{
    "additionDate": "2021-01-18T07:02:54Z",
    "biotoolsCURIE": "biotools:focan",
    "biotoolsID": "focan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "djuzenova_t@ukw.de",
            "name": "Cholpon S. Djuzenova",
            "typeEntity": "Person"
        },
        {
            "email": "Flentje_M@ukw.de",
            "name": "Michael Flentje",
            "typeEntity": "Person"
        }
    ],
    "description": "FocAn is a tool for automated 3D analysis of DNA repair foci in image stacks acquired by confocal fluorescence microscopy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/focan-3d/files/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-11T10:35:18Z",
    "license": "GPL-3.0",
    "name": "FocAn",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3370-8",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Phosphorylated histone H2AX, also known as γH2AX, forms μm-sized nuclear foci at the sites of DNA double-strand breaks (DSBs) induced by ionizing radiation and other agents. Due to their specificity and sensitivity, γH2AX immunoassays have become the gold standard for studying DSB induction and repair. One of these assays relies on the immunofluorescent staining of γH2AX followed by microscopic imaging and foci counting. During the last years, semi- A nd fully automated image analysis, capable of fast detection and quantification of γH2AX foci in large datasets of fluorescence images, are gradually replacing the traditional method of manual foci counting. A major drawback of the non-commercial software for foci counting (available so far) is that they are restricted to 2D-image data. In practice, these algorithms are useful for counting the foci located close to the midsection plane of the nucleus, while the out-of-plane foci are neglected. Results: To overcome the limitations of 2D foci counting, we present a freely available ImageJ-based plugin (FocAn) for automated 3D analysis of γH2AX foci in z-image stacks acquired by confocal fluorescence microscopy. The image-stack processing algorithm implemented in FocAn is capable of automatic 3D recognition of individual cell nuclei and γH2AX foci, as well as evaluation of the total foci number per cell nucleus. The FocAn algorithm consists of two parts: Nucleus identification and foci detection, each employing specific sequences of auto local thresholding in combination with watershed segmentation techniques. We validated the FocAn algorithm using fluorescence-labeled γH2AX in two glioblastoma cell lines, irradiated with 2 Gy and given up to 24 h post-irradiation for repair. We found that the data obtained with FocAn agreed well with those obtained with an already available software (FoCo) and manual counting. Moreover, FocAn was capable of identifying overlapping foci in 3D space, which ensured accurate foci counting even at high DSB density of up to ~ 200 DSB/nucleus. Conclusions: FocAn is freely available an open-source 3D foci analyzer. The user-friendly algorithm FocAn requires little supervision and can automatically count the amount of DNA-DSBs, i.e. fluorescence-labeled γH2AX foci, in 3D image stacks acquired by laser-scanning microscopes without additional nuclei staining.",
                "authors": [
                    {
                        "name": "Memmel S."
                    },
                    {
                        "name": "Sisario D."
                    },
                    {
                        "name": "Zimmermann H."
                    },
                    {
                        "name": "Sauer M."
                    },
                    {
                        "name": "Sukhorukov V.L."
                    },
                    {
                        "name": "Djuzenova C.S."
                    },
                    {
                        "name": "Flentje M."
                    }
                ],
                "date": "2020-01-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FocAn: Automated 3D analysis of DNA repair foci in image stacks acquired by confocal fluorescence microscopy"
            },
            "pmcid": "PMC6986076",
            "pmid": "31992200"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}