{
    "accessibility": "Open access",
    "additionDate": "2022-01-03T07:59:22.986050Z",
    "biotoolsCURIE": "biotools:zebrashare",
    "biotoolsID": "zebrashare",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "AprilD@usca.edu",
            "name": "April DeLaurier",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jared.talbot@maine.edu",
            "name": "Jared C. Talbot",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ZebraShare is intended to help establish fruitful collaborations by sharing mutant fish lines, and information about these mutants, particularly when authors do not otherwise see a clear path to publication.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://zfin.org/action/zebrashare",
    "lastUpdate": "2022-01-03T07:59:22.989795Z",
    "name": "ZebraShare",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11007",
            "metadata": {
                "abstract": "© 2021 PeerJ Inc.. All rights reserved.Background. In the past decade, the zebrafish community has widely embraced targeted mutagenesis technologies, resulting in an abundance of mutant lines. While many lines have proven to be useful for investigating gene function, many have also shown no apparent phenotype, or phenotypes not of interest to the originating lab. In order for labs to document and share information about these lines, we have created ZebraShare as a new resource offered within ZFIN. Methods. ZebraShare involves a form-based submission process generated by ZFIN. The ZebraShare interface (https://zfin.org/action/zebrashare) can be accessed on ZFIN under ‘‘Submit Data’’. Users download the Submission Workbook and complete the required fields, then submit the completed workbook with associated images and captions, generating a new ZFIN publication record. ZFIN curators add the submitted phenotype and mutant information to the ZFIN database, provide mapping information about mutations, and cross reference this information across the appropriate ZFIN databases. We present here examples of ZebraShare submissions, including phf21aa, kdm1a, ctnnd1, snu13a, and snu13b mutant lines. Results. Users can find ZebraShare submissions by searching ZFIN for specific alleles or line designations, just as for alleles submitted through the normal process. We present several potential examples of submission types to ZebraShare including a phenotypic mutants, mildly phenotypic, and early lethal mutants. Mutants for kdm1a show no apparent skeletal phenotype, and phf21aa mutants show only a mild skeletal phenotype, yet these genes have specific human disease relevance and therefore may be useful for further studies. The p120-catenin encoding gene, ctnnd1, was knocked out to investigate a potential role in brain development or function. The homozygous ctnnd1 mutant disintegrates during early somitogenesis and the heterozygote has localized defects, revealing vital roles in early development. Two snu13 genes were knocked out to investigate a role in muscle formation. The snu13a;snu13b double mutant has an early embryonic lethal phenotype, potentially related to a proposed role in the core splicing complex. In each example, the mutants submitted to ZebraShare display phenotypes that are not ideally suited to their originating lab’s project directions but may be of great relevance to other researchers. Conclusion. ZebraShare provides an opportunity for researchers to directly share information about mutant lines within ZFIN, which is widely used by the community as a central database of information about zebrafish lines. Submissions of alleles with a phenotypic or unexpected phenotypes is encouraged to promote collaborations, disseminate lines, reduce redundancy of effort and to promote efficient use of time and resources. We anticipate that as submissions to ZebraShare increase, they will help build an ultimately more complete picture of zebrafish genetics and development.",
                "authors": [
                    {
                        "name": "Carte A.N."
                    },
                    {
                        "name": "DeLaurier A."
                    },
                    {
                        "name": "Gallati M.M."
                    },
                    {
                        "name": "Hernandez L.M."
                    },
                    {
                        "name": "Howe D.G."
                    },
                    {
                        "name": "Jihad K."
                    },
                    {
                        "name": "Pugh K.G."
                    },
                    {
                        "name": "Rosado F.L."
                    },
                    {
                        "name": "Ruzicka L."
                    },
                    {
                        "name": "Shabdue C.J."
                    },
                    {
                        "name": "Talbot J.C."
                    },
                    {
                        "name": "Thyme S.B."
                    },
                    {
                        "name": "Vanpelt K."
                    },
                    {
                        "name": "Wiggins K.J."
                    }
                ],
                "date": "2021-04-13T00:00:00Z",
                "journal": "PeerJ",
                "title": "ZebraShare: A new venue for rapid dissemination of zebrafish mutant data"
            },
            "pmcid": "PMC8051354",
            "pmid": "33954026",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
