
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://dmb.iasi.cnr.it/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://dmb.iasi.cnr.it/Downloads/MALA/GUI/MALA-GUI-MANUAL.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mala-microarray-logic-analyzer.html"
        }
    ],
    "publication": [
        {
            "abstract": "Microarray Logic Analyzer (MALA) is a clustering and classification software, particularly engineered for microarray gene expression analysis. The aims of MALA are to cluster the microarray gene expression profiles in order to reduce the amount of data to be analyzed and to classify the microarray experiments. To fulfil this objective MALA uses a machine learning process based methodology, that relies on 1) Discretization, 2) Gene clustering, 3) Feature selection, 4) Formulas computation,5) Classification. In this paper we describe the methodology, the software design, the different releases and user interfaces of MALA. We also emphasize its strengths: the identification of classification formulas that are able to precisely describe in a compact way the different classes of the microarray experiments. Finally, we show the experimental results obtained on a real microarray data set coming from Alzheimer diseased versus control mice microarray probes, and conclude that MALA is a powerful and reliable software for microarray gene expression analysis. © 2012 IEEE.",
            "authors": [
                "Weitschek E.",
                "Felici G.",
                "Bertolazzi P."
            ],
            "cit_count": 16,
            "doi": "10.1109/DEXA.2012.29",
            "journal": "Proceedings - International Workshop on Database and Expert Systems Applications, DEXA",
            "title": "MALA: A microarray clustering and classification software",
            "type": "Primary",
            "year": "2012-11-26"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mala",
        "biotoolsID": "mala",
        "description": "Designed for the analysis of Microarray data. The rational data representing the gene expressions is discretized into a limited number of intervals for each cell of the array; the obtained discrete variables are then used to select a small subset of the genes that have strong discriminating power for the considered classes. The optimization algorithms for feature selection and logic formula extraction are then used to identify networks of genes that characterize the classes.",
        "homepage": "http://dmb.iasi.cnr.it/mala.php",
        "name": "MALA"
    }
}