
{
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "torgeir.hvidsten@umu.se",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://predictioncenter.org/Services/FragHMMent/descr.html"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    }
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Correct prediction of residue-residue contacts in proteins that lack good templates with known structure would take ab initio protein structure prediction a large step forward. The lack of correct contacts, and in particular long-range contacts, is considered the main reason why these methods often fail. Results: We propose a novel hidden Markov model (HMM)-based method for predicting residue-residue contacts from protein sequences using as training data homologous sequences, predicted secondary structure and a library of local neighborhoods (local descriptors of protein structure). The library consists of recurring structural entities incorporating short-, medium- and long-range interactions and is general enough to reassemble the cores of nearly all proteins in the PDB. The method is tested on an external test set of 606 domains with no significant sequence similarity to the training set as well as 151 domains with SCOP folds not present in the training set. Considering the top 0.2 · L predictions (L = sequence length), our HMMs obtained an accuracy of 22.8% for long-range interactions in new fold targets, and an average accuracy of 28.6% for long-, medium- and short-range contacts. This is a significant performance increase over currently available methods when comparing against results published in the literature. © The Author 2009. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Bjorkholm P.",
                "Daniluk P.",
                "Kryshtafovych A.",
                "Fidelis K.",
                "Andersson R.",
                "Hvidsten T.R."
            ],
            "cit_count": 26,
            "doi": "10.1093/bioinformatics/btp149",
            "journal": "Bioinformatics",
            "title": "Using multi-data hidden Markov models trained on local neighborhoods of protein structure to predict residue-residue contacts",
            "type": "Primary",
            "year": "2009-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fraghmment",
        "biotoolsID": "fraghmment",
        "description": "Residue-residue contact prediction.",
        "homepage": "http://predictioncenter.org/Services/FragHMMent/descr.html",
        "name": "FragHMMent",
        "version": [
            "1"
        ]
    }
}