{
    "additionDate": "2017-02-14T09:34:25Z",
    "biotoolsCURIE": "biotools:webpipsa",
    "biotoolsID": "webpipsa",
    "credit": [
        {
            "email": "stefan.richter@eml-r.villa-bosch.de",
            "name": "Stefan Richter",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "webPIPSA is the web server for Protein Interaction Property Similarity Analysis (PIPSA), a procedure for the comparison and analysis of protein electrostatic potentials for a large number of related protein structures. The resulting matrices of pairwise electrostatic similarities may be visualized as epograms or heat maps.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pipsa.h-its.org/pipsa/pipsa-docu.jsp"
        }
    ],
    "editPermission": {
        "authors": [
            "Stefan.Richter"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                },
                {
                    "term": "Protein property comparison",
                    "uri": "http://edamontology.org/operation_2930"
                },
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                }
            ]
        }
    ],
    "homepage": "http://pipsa.h-its.org",
    "lastUpdate": "2024-11-25T14:02:49.099604Z",
    "name": "webPIPSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Stefan.Richter",
    "publication": [
        {
            "doi": "10.1093/nar/gkn181",
            "metadata": {
                "abstract": "Protein molecular interaction fields are key determinants of protein functionality. PIPSA (Protein Interaction Property Similarity Analysis) is a procedure to compare and analyze protein molecular interaction fields, such as the electrostatic potential. PIPSA may assist in protein functional assignment, classification of proteins, the comparison of binding properties and the estimation of enzyme kinetic parameters. webPIPSA is a web server that enables the use of PIPSA to compare and analyze protein electrostatic potentials. While PIPSA can be run with downloadable software (see http://projects.eml.org/mcm/software/pipsa), webPIPSA extends and simplifies a PIPSA run. This allows non-expert users to perform PIPSA for their protein datasets. With input protein coordinates, the superposition of protein structures, as well as the computation and analysis of electrostatic potentials, is automated. The results are provided as electrostatic similarity matrices from an all-pairwise comparison of the proteins which can be subjected to clustering and visualized as epograms (tree-like diagrams showing electrostatic potential differences) or heat maps. webPIPSA is freely available at: http://pipsa.eml.org.",
                "authors": [
                    {
                        "name": "Gabdoulline R.R."
                    },
                    {
                        "name": "Richter S."
                    },
                    {
                        "name": "Stein M."
                    },
                    {
                        "name": "Wade R.C."
                    },
                    {
                        "name": "Wenzel A."
                    }
                ],
                "citationCount": 85,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "webPIPSA: a web server for the comparison of protein interaction properties."
            },
            "pmcid": "PMC2447742",
            "pmid": "18420653"
        },
        {
            "doi": "10.1186/1471-2105-8-373",
            "metadata": {
                "abstract": "Background: The simulation of metabolic networks in quantitative systems biology requires the assignment of enzymatic kinetic parameters. Experimentally determined values are often not available and therefore computational methods to estimate these parameters are needed. It is possible to use the three-dimensional structure of an enzyme to perform simulations of a reaction and derive kinetic parameters. However, this is computationally demanding and requires detailed knowledge of the enzyme mechanism. We have therefore sought to develop a general, simple and computationally efficient procedure to relate protein structural information to enzymatic kinetic parameters that allows consistency between the kinetic and structural information to be checked and estimation of kinetic constants for structurally and mechanistically similar enzymes. Results: We describe qPIPSA: quantitative Protein Interaction Property Similarity Analysis. In this analysis, molecular interaction fields, for example, electrostatic potentials, are computed from the enzyme structures. Differences in molecular interaction fields between enzymes are then related to the ratios of their kinetic parameters. This procedure can be used to estimate unknown kinetic parameters when enzyme structural information is available and kinetic parameters have been measured for related enzymes or were obtained under different conditions. The detailed interaction of the enzyme with substrate or cofactors is not modeled and is assumed to be similar for all the proteins compared. The protein structure modeling protocol employed ensures that differences between models reflect genuine differences between the protein sequences, rather than random fluctuations in protein structure. Conclusion: Provided that the experimental conditions and the protein structural models refer to the same protein state or conformation, correlations between interaction fields and kinetic parameters can be established for sets of related enzymes. Outliers may arise due to variation in the importance of different contributions to the kinetic parameters, such as protein stability and conformational changes. The qPIPSA approach can assist in the validation as well as estimation of kinetic parameters, and provide insights into enzyme mechanism. © 2007 Gabdoulline et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Gabdoulline R.R."
                    },
                    {
                        "name": "Stein M."
                    },
                    {
                        "name": "Wade R.C."
                    }
                ],
                "citationCount": 33,
                "date": "2007-10-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "qPIPSA: Relating enzymatic kinetic parameters and interaction fields"
            },
            "pmcid": "PMC2174957",
            "pmid": "17919319"
        },
        {
            "doi": "10.1093/bioinformatics/btn207",
            "metadata": {
                "abstract": "Summary: SYCAMORE is a browser-based application that facilitates construction, simulation and analysis of kinetic models in systems biology. Thus, it allows e.g. database supported modelling, basic model checking and the estimation of unknown kinetic parameters based on protein structures. In addition, it offers some guidance in order to allow non-expert users to perform basic computational modelling tasks. © The Author 2008. Published by the Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Besson B."
                    },
                    {
                        "name": "Gabdoulline R."
                    },
                    {
                        "name": "Gauges R."
                    },
                    {
                        "name": "Kummer U."
                    },
                    {
                        "name": "Richter S."
                    },
                    {
                        "name": "Rojas I."
                    },
                    {
                        "name": "Sahle S."
                    },
                    {
                        "name": "Semmelrock N."
                    },
                    {
                        "name": "Stein M."
                    },
                    {
                        "name": "Surovtsova I."
                    },
                    {
                        "name": "Wade R."
                    },
                    {
                        "name": "Weidemann A."
                    }
                ],
                "citationCount": 28,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SYCAMORE - A systems biology computational analysis and modeling research environment"
            },
            "pmid": "18463116"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
