{
    "additionDate": "2020-01-14T09:20:10Z",
    "biotoolsCURIE": "biotools:scGEAToolbox",
    "biotoolsID": "scGEAToolbox",
    "confidence_flag": "tool",
    "description": "a Matlab toolbox for single-cell RNA sequencing data analysis.\n\nscGEAToolbox: Matlab toolbox for single-cell gene expression analyses.\n\nscGEAToolbox - a Matlab toolbox for single-cell RNA-seq data analyses.\n\nResults: I developed scGEAToolbox—a Matlab toolbox for scRNA-seq data analysis. It contains a comprehensive set of functions for data normalization, feature selection, batch correction, imputation, cell clustering, trajectory/pseudotime analysis, and network construction, which can be combined and integrated to building custom workflow. While most of the functions are implemented in native Matlab, wrapper functions are provided to allow users to call the “third-party” tools developed in Matlab or other languages. Furthermore, scGEAToolbox is equipped with sophisticated graphical user interfaces (GUIs) generated with App Designer, making it an easy-to-use application for quick data processing",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jamesjcai/scGEAToolbox",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-17T09:30:01Z",
    "license": "GPL-3.0",
    "name": "scGEAToolbox",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ830",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Single-cell RNA sequencing (scRNA-seq) technology has revolutionized the way research is done in biomedical sciences. It provides an unprecedented level of resolution across individual cells for studying cell heterogeneity and gene expression variability. Analyzing scRNA-seq data is challenging though, due to the sparsity and high dimensionality of the data. Results: I developed scGEAToolbox—a Matlab toolbox for scRNA-seq data analysis. It contains a comprehensive set of functions for data normalization, feature selection, batch correction, imputation, cell clustering, trajectory/pseudotime analysis and network construction, which can be combined and integrated to building custom workflow. Although most of the functions are implemented in native Matlab, wrapper functions are provided to allow users to call the ‘third-party’ tools developed in Matlab or other languages. Furthermore, scGEAToolbox is equipped with sophisticated graphical user interfaces generated with App Designer, making it an easy-to-use application for quick data processing. Availability and implementation: https://github.com/jamesjcai/scGEAToolbox.",
                "authors": [
                    {
                        "name": "Cai J.J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "scGEAToolbox: A matlab toolbox for single-cell RNA sequencing data analysis"
            },
            "pmid": "31697351"
        }
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
