{
    "additionDate": "2020-01-09T18:00:52Z",
    "biotoolsCURIE": "biotools:B27",
    "biotoolsID": "B27",
    "confidence_flag": "high",
    "description": "Comparison of Patient-Reported Outcomes in Laparoscopic and Open Right Hemicolectomy.\n\nThe requested resource https://links.lww.com/_redirect.aspx?404;https://links.lww.com:443/DCR/B27.REPORTE was not found!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'los pacientes sometidos resecciones abiertas', 'resultados relevantes para los pacientes', 'sintomas en el periodo temprano', 'Los pacientes sometidos reseccion laparoscopica'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://links.lww.com/DCR/B27",
    "lastUpdate": "2020-01-09T18:00:52Z",
    "link": [
        {
            "type": "Other",
            "url": "http://links.lww.com/DCR/B27.REPORTE"
        }
    ],
    "name": "B27",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1097/DCR.0000000000001485",
            "metadata": {
                "abstract": "BACKGROUND: Open and laparoscopic resections for colon cancer have equivalent perioperative morbidity and mortality. However, there are little data concerning patient-reported outcomes in the early postdischarge period. OBJECTIVE: We examined patient-reported outcomes in the early postdischarge period for open and laparoscopic right hemicolectomy for colon cancer. DESIGN: This was a retrospective cohort study. SETTINGS: The study was conducted using linked administrative healthcare databases in the province of Ontario, Canada. PATIENTS: Patients undergoing laparoscopic or open right hemicolectomy for colon cancer between January 2010 and December 2014 were identified using the Ontario Cancer Registry and physician billing data. MAIN OUTCOME MEASURES: The primary outcome was the presence of moderate-to-severe symptom scores on the Edmonton Symptom Assessment System (≥4 of 10) within 6 weeks of hospital discharge after right hemicolectomy. RESULTS: A total of 1022 patients completed ≥1 Edmonton Symptom Assessment System survey within 6 weeks of surgery and were included in the study. Patients undergoing laparoscopic resection were more likely to have an urban residence, to have undergone planned resections, and to have had proportionally more stage 1 disease compared with patients undergoing open resection. On multivariable analyses, adjusting for patient demographics, cancer stage, and planned versus unplanned admission status, there were no differences in the adjusted odds of moderate-to-severe symptom scores between the laparoscopic and open approaches. LIMITATIONS: Edmonton Symptom Assessment System scores are not collected for inpatients and thus only represent outpatient postoperative visits. Scores were reported by 19% of all resections in the population, with a bias to patients treated at cancer centers, and therefore they are not fully representative of the general population of right hemicolectomy. The Edmonton Symptom Assessment System is not a disease-specific tool and may not measure all relevant outcomes for patients undergoing right hemicolectomy. CONCLUSIONS: Receipt of the open or laparoscopic surgical technique was not associated with increased risk of elevated symptom burden in the early postdischarge period. See Video Abstract at http://links.lww.com/DCR/B27. REPORTE COMPARATIVO DE RESULTADOS INFORMADOS DE PACIENTES CON HEMICOLECTOMÍA DERECHA LAPAROSCÓPICA Y ABIERTA: UN ESTUDIO DE COHORTE RETROSPECTIVO: Las resecciones abiertas y laparoscópicas para el cáncer de colon, presentan semejante morbilidad y mortalidad perioperatoria. Sin embargo, en el período inicial posterior al alta, hay pocos datos sobre los resultados informados por los pacientes.Examinamos los resultados informados por los pacientes, en el período temprano posterior al alta, para hemicolectomía derecha abierta y laparoscópica en cáncer de colon.Estudio de cohorte retrospectivo.El estudio se realizó utilizando bases de datos administrativas de atención médica en la provincia de Ontario, Canadá.Pacientes sometidos a hemicolectomía derecha abierta o laparoscópica para cáncer de colon, de enero 2010 a diciembre 2014, se identificaron mediante el Registro de cáncer de Ontario y de los datos médicos de facturación.El resultado primario, después de la hemicolectomía derecha, fue la presencia de síntomas de moderados a graves en el Sistema de evaluación de síntomas de Edmonton (≥4 de cada 10) dentro de las seis semanas posteriores al alta hospitalaria.Un total de 1022 pacientes completaron al menos una encuesta del Sistema de evaluación de síntomas de Edmonton, dentro de las seis semanas de la cirugía y se incluyeron en el estudio. Los pacientes sometidos a resección laparoscópica fueron más propensos a residir en zona urbana, a resecciones planificadas y proporcionalmente más enfermedad en estadio 1; en comparación con los pacientes sometidos a resecciones abiertas. En los análisis multivariables, que se ajustaron a la demografía del paciente, al estadio del cáncer y del estado de ingreso planificado versus no planificado, no hubo diferencias en las probabilidades ajustadas de las puntuaciones de los síntomas moderados a severos entre el abordaje abierto o laparoscópico.Las puntuaciones del Sistema de evaluación de síntomas de Edmonton no se recopilan para pacientes hospitalizados y por lo tanto, solo representan las visitas postoperatorias de pacientes ambulatorios. Las puntuaciones informadas fueron del 19% de todas las resecciones en la población, con un sesgo en los pacientes tratados en los Centros de Cáncer y por lo tanto, no son totalmente representativos de la población general de hemicolectomía derecha. El Sistema de evaluación de síntomas de Edmonton no es una herramienta específica de la enfermedad y puede no medir todos los resultados relevantes para los pacientes que se someten a una hemicolectomía derecha.La recepción entre una técnica quirúrgica abierta o laparoscópica, no se asoció con un aumento del riesgo de síntomas en el período temprano posterior al alta. Vea el Resumen del Video en http://links.lww.com/DCR/B27.",
                "authors": [
                    {
                        "name": "Vela N."
                    },
                    {
                        "name": "Bubis L.D."
                    },
                    {
                        "name": "Davis L.E."
                    },
                    {
                        "name": "Mahar A.L."
                    },
                    {
                        "name": "Kennedy E."
                    },
                    {
                        "name": "Coburn N.G."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Diseases of the colon and rectum",
                "title": "Comparison of Patient-Reported Outcomes in Laparoscopic and Open Right Hemicolectomy: A Retrospective Cohort Study"
            },
            "pmid": "31567922"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}