{
    "additionDate": "2015-01-21T13:29:27Z",
    "biotoolsCURIE": "biotools:netmhc",
    "biotoolsID": "netmhc",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "mniel@cbs.dtu.dk",
            "name": "Morten Nielsen",
            "orcidid": "http://orcid.org/0000-0001-7885-4311",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Prediction of binding of peptides to a number of different HLA alleles using artificial neural networks (ANNs).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cbs.dtu.dk/services/NetMHC/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Predicts binding of peptides to a number of different HLA alleles",
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://cbs.dtu.dk/services/NetMHC/",
    "lastUpdate": "2024-11-25T14:25:45.260491Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://cbs.dtu.dk/services"
        }
    ],
    "maturity": "Emerging",
    "name": "NetMHC",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1110/ps.0239403",
            "metadata": {
                "abstract": "In this paper we describe an improved neural network method to predict T-cell class I epitopes. A novel input representation has been developed consisting of a combination of sparse encoding, Blosum encoding, and input derived from hidden Markov models. We demonstrate that the combination of several neural networks derived using different sequence-encoding schemes has a performance superior to neural networks derived using a single sequence-encoding scheme. The new method is shown to have a performance that is substantially higher than that of other methods. By use of mutual information calculations we show that peptides that bind to the HLA A*0204 complex display signal of higher order sequence correlations. Neural networks are ideally suited to integrate such higher order correlations when predicting the binding affinity. It is this feature combined with the use of several neural networks derived from different and novel sequence-encoding schemes and the ability of the neural network to be trained on data consisting of continuous binding affinities that gives the new method an improved performance. The difference in predictive performance between the neural network methods and that of the matrix-driven methods is found to be most significant for peptides that bind strongly to the HLA molecule, confirming that the signal of higher order sequence correlation is most strongly present in high-binding peptides. Finally, we use the method to predict T-cell epitopes for the genome of hepatitis C virus and discuss possible applications of the prediction method to guide the process of rational vaccine design.",
                "authors": [
                    {
                        "name": "Brunak S."
                    },
                    {
                        "name": "Buus S."
                    },
                    {
                        "name": "Lamberth K."
                    },
                    {
                        "name": "Lauemoller S.L."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Lundegaard C."
                    },
                    {
                        "name": "Nielsen M."
                    },
                    {
                        "name": "Worning P."
                    }
                ],
                "citationCount": 885,
                "date": "2003-05-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Reliable prediction of T-cell epitopes using neural networks with novel sequence representations"
            },
            "pmcid": "PMC2323871",
            "pmid": "12717023",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/bth100",
            "metadata": {
                "abstract": "Motivation: Prediction of which peptides, will bind a specific major histocompatibility complex (MHC) constitutes an important step in identifying potential T-cell epitopes suitable as vaccine candidates. MHC class II binding peptides have a broad length distribution complicating such predictions. Thus, identifying the correct alignment is a crucial part of identifying the core of an MHC class II binding motif. In this context, we wish to describe a novel Gibbs motif sampler method ideally suited for recognizing such weak sequence motifs. The method is based on the Gibbs sampling method, and it incorporates novel features optimized for the task of recognizing the binding motif of MHC classes I and II. The method locates the binding motif in a set of sequences and characterizes the motif in terms of a weight-matrix. Subsequently, the weight-matrix can be applied to identifying effectively potential MHC binding peptides and to guiding the process of rational vaccine design. Results: We apply the motif sampler method to the complex problem of MHC class II binding. The input to the method is amino acid peptide sequences extracted from the public databases of SYFPEITHI and MHCPEP and known to bind to the MHC class II complex HLA-DR4(B1*0401). Prior identification of information-rich (anchor) positions in the binding motif is shown to improve the predictive performance of the Gibbs sampler. Similarly, a consensus solution obtained from an ensemble average over suboptimal solutions is shown to outperform the use of a single optimal solution. In a large-scale benchmark calculation, the performance is quantified using relative operating characteristics curve (ROC) plots and we make a detailed comparison of the performance with that of both the TEPITOPE method and a weight-matrix derived using the conventional alignment algorithm of ClustalW. The calculation demonstrates that the predictive performance of the Gibbs sampler is higher than that of ClustalW and in most cases also higher than that of the TEPITOPE method. © Oxford University Press 2004; all rigths reserved.",
                "authors": [
                    {
                        "name": "Brunak S."
                    },
                    {
                        "name": "Buus S."
                    },
                    {
                        "name": "Lamberth K."
                    },
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Lundegaard C."
                    },
                    {
                        "name": "Nielsen M."
                    },
                    {
                        "name": "Sylvester Hvid C."
                    },
                    {
                        "name": "Worning P."
                    }
                ],
                "citationCount": 231,
                "date": "2004-06-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Improved prediction of MHC class I and class II epitopes using a novel Gibbs sampling approach"
            },
            "pmid": "14962912",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btn128",
            "metadata": {
                "abstract": "Several accurate prediction systems have been developed for prediction of class I major histocompatibility complex (MHC):peptide binding. Most of these are trained on binding affinity data of primarily 9mer peptides. Here, we show how prediction methods trained on 9mer data can be used for accurate binding affinity prediction of peptides of length 8, 10 and 11. The method gives the opportunity to predict peptides with a different length than nine for MHC alleles where no such peptides have been measured. As validation, the performance of this approach is compared to predictors trained on peptides of the peptide length in question. In this validation, the approximation method has an accuracy that is comparable to or better than methods trained on a peptide length identical to the predicted peptides. © The Author 2008. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lund O."
                    },
                    {
                        "name": "Lundegaard C."
                    },
                    {
                        "name": "Nielsen M."
                    }
                ],
                "citationCount": 193,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Accurate approximation method for prediction of class I MHC affinities for peptides of length 8, 10 and 11 using prediction tools trained on 9mers"
            },
            "pmid": "18413329",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1,
    "version": [
        "3.4"
    ]
}
