{
    "name": "DisLocate", 
    "description": "Prediction of cysteine connectivity patterns in a protein chain.", 
    "homepage": "http://dislocate.biocomp.unibo.it/dislocate/default/index", 
    "biotoolsID": "dislocate", 
    "biotoolsCURIE": "biotools:dislocate", 
    "version": [
        "1.0"
    ], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_1830", 
                    "term": "Free cysteine detection"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0267", 
                    "term": "Protein secondary structure prediction"
                }, 
                {
                    "uri": "http://edamontology.org/operation_1829", 
                    "term": "Cysteine bridge detection"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2974", 
                        "term": "Protein sequence (raw)"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_1929", 
                            "term": "FASTA"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2048", 
                        "term": "Report"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2331", 
                            "term": "HTML"
                        }
                    ]
                }
            ], 
            "note": "Prediction", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0091", 
            "term": "Bioinformatics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0082", 
            "term": "Structure prediction"
        }, 
        {
            "uri": "http://edamontology.org/topic_3542", 
            "term": "Protein secondary structure"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [
        "Bologna Biocomputing group"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://dislocate.biocomp.unibo.it/dislocate/default/method", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr387", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Improving the prediction of disulfide bonds in Eukaryotes with machine learning methods and protein subcellular localization", 
                "abstract": "Motivation: Disulfide bonds stabilize protein structures and play relevant roles in their functions. Their formation requires an oxidizing environment and their stability is consequently depending on the redox ambient potential, which may differ according to the subcellular compartment. Several methods are available to predict cysteine-bonding state and connectivity patterns. However, none of them takes into consideration the relevance of protein subcellular localization. Results: Here we develop DISLOCATE, a two-step method based on machine learning models for predicting both the bonding state and the connectivity patterns of cysteine residues in a protein chain. We find that the inclusion of protein subcellular localization improves the performance of these predictive steps by 3 and 2 percentage points, respectively. When compared with previously developed methods for predicting disulfide bonds from sequence, DISLOCATE improves the overall performance by more than 10 percentage points. © The Author 2011. Published by Oxford University Press. All rights reserved.", 
                "date": "2011-08-01T00:00:00Z", 
                "citationCount": 27, 
                "authors": [
                    {
                        "name": "Savojardo C."
                    }, 
                    {
                        "name": "Fariselli P."
                    }, 
                    {
                        "name": "Alhamdoosh M."
                    }, 
                    {
                        "name": "Martelli P.L."
                    }, 
                    {
                        "name": "Pierleoni A."
                    }, 
                    {
                        "name": "Casadio R."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": "10.1186/1471-2105-14-S1-S10", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Prediction of disulfide connectivity in proteins with machine-learning methods and correlated mutations", 
                "abstract": "Background: Recently, information derived by correlated mutations in proteins has regained relevance for predicting protein contacts. This is due to new forms of mutual information analysis that have been proven to be more suitable to highlight direct coupling between pairs of residues in protein structures and to the large number of protein chains that are currently available for statistical validation. It was previously discussed that disulfide bond topology in proteins is also constrained by correlated mutations.Results: In this paper we exploit information derived from a corrected mutual information analysis and from the inverse of the covariance matrix to address the problem of the prediction of the topology of disulfide bonds in Eukaryotes. Recently, we have shown that Support Vector Regression (SVR) can improve the prediction for the disulfide connectivity patterns. Here we show that the inclusion of the correlated mutation information increases of 5 percentage points the SVR performance (from 54% to 59%). When this approach is used in combination with a method previously developed by us and scoring at the state of art in predicting both location and topology of disulfide bonds in Eukaryotes (DisLocate), the per-protein accuracy is 38%, 2 percentage points higher than that previously obtained.Conclusions: In this paper we show that the inclusion of information derived from correlated mutations can improve the performance of the state of the art methods for predicting disulfide connectivity patterns in Eukaryotic proteins. Our analysis also provides support to the notion that improving methods to extract evolutionary information from multiple sequence alignments greatly contributes to the scoring performance of predictors suited to detect relevant features from protein chains. © 2013 Savojardo et al.; licensee BioMed Central Ltd.", 
                "date": "2013-01-14T00:00:00Z", 
                "citationCount": 9, 
                "authors": [
                    {
                        "name": "Savojardo C."
                    }, 
                    {
                        "name": "Fariselli P."
                    }, 
                    {
                        "name": "Martelli P.L."
                    }, 
                    {
                        "name": "Casadio R."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }, 
        {
            "doi": "10.1007/978-3-642-21946-7_8", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Prediction of the bonding state of cysteine residues in proteins with machine-learning methods", 
                "abstract": "In this paper we evaluate the performance of machine learning methods in the task of predicting the bonding state of cysteines starting from protein sequences. This task is the first step for the identification of disulfide bonds in proteins. We score the performance of three different approaches: 1) Hidden Support Vector Machines (HSVMs) which integrate the SVM predictions with a Hidden Markov Model; 2) SVM-HMMs which discriminatively train models that are isomorphic to a kth-order hidden Markov model; 3) Grammatical-Restrained Hidden Conditional Random Fields (GRHCRFs) that we recently introduced. We evaluate two different encoding schemes based on sequence profile and position specific scoring matrix (PSSM) as computed with the PSI-BLAST program and we show that when the evolutionary information is encoded with PSSM all the methods perform better than with sequence profile. Among the different methods it appears that GRHCRFs perform slightly better than the others achieving a per protein accuracy of 87% with a Matthews correlation coefficient (C) of 0.73. Finally, we investigate the difference between disulfide bonding state predictions in Eukaryotes and Prokaryotes. Our analysis shows that the per-protein accuracy in Prokaryotic proteins is higher than that in Eukaryotes (0.88 vs 0.83). However, given the paucity of bonded cysteines in Prokaryotes as compared to Eukaryotes the Matthews correlation coefficient is drastically reduced (0.48 vs 0.80). © 2011 Springer-Verlag Berlin Heidelberg.", 
                "date": "2011-08-19T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Savojardo C."
                    }, 
                    {
                        "name": "Fariselli P."
                    }, 
                    {
                        "name": "Martelli P.L."
                    }, 
                    {
                        "name": "Shukla P."
                    }, 
                    {
                        "name": "Casadio R."
                    }
                ], 
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)"
            }
        }
    ], 
    "credit": [
        {
            "name": "ELIXIR-ITA-BOLOGNA", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Castrense Savojardo", 
            "email": "savojard@biocomp.unibo.it", 
            "url": "http://biocomp.unibo.it/savojard/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-ITA-BOLOGNA", 
    "additionDate": "2016-01-22T15:15:26Z", 
    "lastUpdate": "2018-12-10T12:58:50Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0
}