
{
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.bioisis.net/tutorial"
        }
    ],
    "function": [
        {
            "note": "BIOISIS is an open access database dedicated to the study of biological macromolecules by small angle X-ray scattering (SAXS). BIOISIS aims to become the complete source for the deposition, distribution and maintenance of small angle X-ray scattering data and technologies.We",
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Instruct"
        ],
        "cost": "Free of charge",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Structural biology",
                "uri": "http://edamontology.org/topic_1317"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Replication protein A (RPA) is the primary eukaryotic single-stranded DNA (ssDNA) binding protein utilized in diverse DNA transactions in the cell. RPA is a heterotrimeric protein with seven globular domains connected by flexible linkers, which enable substantial interdomain motion that is essential to its function. Small angle X-ray scattering (SAXS) experiments with two multidomain constructs from the N-terminus of the large subunit (RPA70) were used to examine the structural dynamics of these domains and their response to the binding of ssDNA. The SAXS data combined with molecular dynamics simulations reveal substantial interdomain flexibility for both RPA70AB (the tandem high-affinity ssDNA binding domains A and B connected by a 10-residue linker) and. RPA70NAB (RPA70AB extended by a 70-residue linker to the RPA70N protein interaction domain). Binding of ssDNA to RPA70NAB reduces the interdomain flexibility between the A and B domains but has no effect on RPA70N. These studies provide the first direct measurements of changes in orientation of these three RPA domains upon binding ssDNA. The results support a model in which RPA70N remains structurally independent of RPA70AB in the DNA-bound state and therefore freely available to serve as a protein recruitment module. © 2010 American Chemical Society.",
            "authors": [
                "Pretto D.I.",
                "Tsutakawa S.",
                "Brosey C.A.",
                "Castillo A.",
                "Chagot M.-E.",
                "Smith J.A.",
                "Tainer J.A.",
                "Chazin W.J."
            ],
            "cit_count": 28,
            "doi": "10.1021/bi9019934",
            "journal": "Biochemistry",
            "title": "Structural dynamics and single-stranded DNA binding activity of the three N-terminal domains of the large subunit of replication protein a from small angle X-ray scattering",
            "type": "Other",
            "year": "2010-04-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bioisis",
        "biotoolsID": "bioisis",
        "description": "Open access database dedicated to the study of biological macromolecules by small angle X-ray scattering (SAXS).",
        "homepage": "http://www.bioisis.net/",
        "name": "BIOISIS"
    }
}