{
    "additionDate": "2021-01-18T10:59:25Z",
    "biotoolsCURIE": "biotools:vacpred",
    "biotoolsID": "vacpred",
    "confidence_flag": "tool",
    "description": "VacPred software is a machine-learning based package for prediction of Plant Vacuolar proteins. User have to provide the single or multiple protein sequence in fasta format and the software based on our model will predict the plant vacuole protein.\n\nDSL provide the help to new learner of bioinformatics, genomics and personalized medicine, job in india and abroad along with learning tool and software to motivate the researchers all over the world.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://www.deepaklab.com/vacpred",
    "lastUpdate": "2021-03-10T13:38:12Z",
    "name": "VacPred",
    "owner": "zsmag19",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2020, Indian Academy of Sciences.Subcellular localization prediction of the proteome is one of major goals of large-scale genome or proteome sequencing projects to define the gene functions that could be possible with the help of computational modeling techniques. Previously, different methods have been developed for this purpose using multi-label classification system and achieved a high level of accuracy. However, during the validation of our blind dataset of plant vacuole proteins, we observed that they have poor performance with accuracy value range from ~1.3% to 48.5%. The results showed that the previously developed methods are not very accurate for the plant vacuole protein prediction and thus emphasize the need to develop a more accurate and reliable algorithm. In this study, we have developed various compositions as well as PSSM-based models and achieved a high accuracy than previously developed methods. We have shown that our best model achieved ~63% accuracy on blind dataset, which is far better than currently available tools. Furthermore, we have implemented our best models in the form of GUI-based free software called ‘VacPred’ which is compatible with both Linux and Window platform. This software is freely available for download at www.deepaklab.com/vacpred.",
                "authors": [
                    {
                        "name": "Yadav A.K."
                    },
                    {
                        "name": "Singla D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Journal of Biosciences",
                "title": "VacPred: Sequence-based prediction of plant vacuole proteins using machine-learning techniques"
            },
            "pmid": "32975233"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}