{
    "additionDate": "2021-01-18T11:59:36Z",
    "biotoolsCURIE": "biotools:triplexfpp",
    "biotoolsID": "triplexfpp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asckkwoh@ntu.edu.sg",
            "name": "Chee Keong Kwoh",
            "orcidid": "https://orcid.org/0000-0002-8547-6387",
            "typeEntity": "Person"
        }
    ],
    "description": "TriplexFPP: A deep learning program for DNA:RNA triplex potential prediction.\n\nTriplexFPP is an integrated program for DNA:RNA triplex prediction. It contains two models: 1) triplex lncRNA prediction model, to predict the most likely triplex forming lncRNA in practical, and 2) triplex DNA site prediction model, to predict if a DNA site can form triplex in practical. It will give researchers useful guidelines to study the DNA:RNA triplex formation. Fig. 1.An overview of the architechture and model parameters for TriplexFPP.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuuuuzhang/TriplexFPP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-05T16:50:23Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yuuuuzhang/TriplexFPP_data"
        }
    ],
    "name": "TriplexFPP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03864-0",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Long non-coding RNAs (lncRNAs) can exert functions via forming triplex with DNA. The current methods in predicting the triplex formation mainly rely on mathematic statistic according to the base paring rules. However, these methods have two main limitations: (1) they identify a large number of triplex-forming lncRNAs, but the limited number of experimentally verified triplex-forming lncRNA indicates that maybe not all of them can form triplex in practice, and (2) their predictions only consider the theoretical relationship while lacking the features from the experimentally verified data. Results: In this work, we develop an integrated program named TriplexFPP (Triplex Forming Potential Prediction), which is the first machine learning model in DNA:RNA triplex prediction. TriplexFPP predicts the most likely triplex-forming lncRNAs and DNA sites based on the experimentally verified data, where the high-level features are learned by the convolutional neural networks. In the fivefold cross validation, the average values of Area Under the ROC curves and PRC curves for removed redundancy triplex-forming lncRNA dataset with threshold 0.8 are 0.9649 and 0.9996, and these two values for triplex DNA sites prediction are 0.8705 and 0.9671, respectively. Besides, we also briefly summarize the cis and trans targeting of triplexes lncRNAs. Conclusions: The TriplexFPP is able to predict the most likely triplex-forming lncRNAs from all the lncRNAs with computationally defined triplex forming capacities and the potential of a DNA site to become a triplex. It may provide insights to the exploration of lncRNA functions.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Long Y."
                    },
                    {
                        "name": "Kwoh C.K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Deep learning based DNA:RNA triplex forming potential prediction"
            },
            "pmcid": "PMC7663897",
            "pmid": "33183242"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}