{
    "additionDate": "2015-02-05T13:44:31Z",
    "biotoolsCURIE": "biotools:aspic-geneid",
    "biotoolsID": "aspic-geneid",
    "collectionID": [
        "ELIXIR-ITA-CNR"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "ELIXIR-ITA-CNR",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ernesto.picardi@uniba.it",
            "name": "Ernesto Picardi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A lightweight pipeline for gene prediction and alternative isoforms detection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://150.145.82.212/aspic/aspicgeneid.tar.gz",
    "homepage_status": 1,
    "lastUpdate": "2019-02-26T14:45:44Z",
    "maturity": "Mature",
    "name": "ASPic-GeneID",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-CNR",
    "publication": [
        {
            "doi": "10.1155/2013/502827",
            "metadata": {
                "abstract": "New genomes are being sequenced at an increasingly rapid rate, far outpacing the rate at which manual gene annotation can be performed. Automated genome annotation is thus necessitated by this growth in genome projects; however, full-fledged annotation systems are usually home-grown and customized to a particular genome. There is thus a renewed need for accurate ab initio gene prediction methods. However, it is apparent that fully ab initio methods fall short of the required level of sensitivity and specificity for a quality annotation. Evidence in the form of expressed sequences gives the single biggest improvement in accuracy when used to inform gene predictions. Here, we present a lightweight pipeline for first-pass gene prediction on newly sequenced genomes. The two main components are ASPic, a program that derives highly accurate, albeit not necessarily complete, EST-based transcript annotations from EST alignments, and GeneID, a standard gene prediction program, which we have modified to take as evidence intron annotations. The introns output by ASPic CDS predictions is given to GeneID to constrain the exon-chaining process and produce predictions consistent with the underlying EST alignments. The pipeline was successfully tested on the entire C. elegans genome and the 44 ENCODE human pilot regions. © 2013 Tyler Alioto et al.",
                "authors": [
                    {
                        "name": "Alioto T."
                    },
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Guigo R."
                    },
                    {
                        "name": "Pesole G."
                    }
                ],
                "citationCount": 6,
                "date": "2013-12-09T00:00:00Z",
                "journal": "BioMed Research International",
                "title": "ASPic-GeneID: A lightweight pipeline for gene prediction and alternative isoforms detection"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}