{
    "additionDate": "2017-12-18T00:04:36Z",
    "biotoolsCURIE": "biotools:cbcanalyzer",
    "biotoolsID": "cbcanalyzer",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biozentrum.uni-wuerzburg.de/bioinformatik"
        }
    ],
    "description": "CBCAnalyzer ( compensatory base change) is a custom written software toolbox consisting of three parts, CTTransform, CBCDetect, and CBCTree. CTTransform reads several CT-file formats (ct, RNAviz ct or Mac ct), and generates a so called “bracket-dot-bracket” format that typically is used as input for other tools such as RNAforester, RNAmovie or MARNA. The latter one creates a multiple alignment based on primary sequences and secondary structures that now can be used as input for CBCDetect. It consists of three parts, CTTransform, CBCDetect, and CBCTree. CTTransform reads several CT-file formats and generates a so called “bracket-dot-bracket” format that typically is used as input for other tools such as RNAforester, RNAmovie or MARNA. The latter one creates a multiple alignment based on primary sequences and secondary structures that now can be used as input for CBCDetect. The count matrix obtained by CBCDetect is used as input for CBCTree.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cbcanalyzer.bioapps.biozentrum.uni-wuerzburg.de/cgi-bin/index.php?section=quickstart"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://cbcanalyzer.bioapps.biozentrum.uni-wuerzburg.de/cgi-bin/index.php",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/cbcanalyzer-1-1-beta-inferring-phylogenies-based-compensatory-base.html"
        }
    ],
    "name": "CBCAnalyzer 1.1 beta",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The CBCAnalyzer (CBC = compensatory base change) is a custom written software toolbox consisting of three parts, CTTransform, CBCDetect, and CBCTree. CTTransform reads several ct-file formats, and generates a so called \"bracket-dot-bracket\" format that typically is used as input for other tools such as RNAforester, RNAmovie or MARNA. The latter one creates a multiple alignment based on primary sequences and secondary structures that now can be used as input for CBCDetect. CBCDetect counts CBCs in all against all of the aligned sequences. This is important in detecting species that are discriminated by their sexual incompatibility. The count (distance) matrix obtained by CBCDetect is used as input for CBCTree that reconstructs a phylogram by using the algorithm of BIONJ. In this note we describe the features of the toolbox as well as application examples. The toolbox provides a graphical user interface. It is written in C++ and freely available at: http://cbcanalyzer.bioapps.biozentrum.uni-wuerzburg.de. © 2005 - IOS Press and Bioinformation Systems e.V. and the authors. All rights reserved.",
                "authors": [
                    {
                        "name": "Wolf M."
                    },
                    {
                        "name": "Friedrich J."
                    },
                    {
                        "name": "Dandekar T."
                    },
                    {
                        "name": "Muller T."
                    }
                ],
                "citationCount": 59,
                "date": "2005-08-24T00:00:00Z",
                "journal": "In Silico Biology",
                "title": "CBCAnalyzer: Inferring phylogenies based on compensatory base changes in RNA secondary structures"
            },
            "pmid": "15996120",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}