{
    "additionDate": "2024-07-24T10:53:56.313556Z",
    "biotoolsCURIE": "biotools:bcinfo",
    "biotoolsID": "bcinfo",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr. Gajendra P. S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/"
        }
    ],
    "description": "BCINFO: A COMPLETE GUIDE TO B-CELL EPITOPE PREDICTION",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://webs.iiitd.edu.in/raghava/bcinfo/",
    "lastUpdate": "2024-07-24T10:53:56.316043Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/bcinfo/"
        }
    ],
    "name": "BCINFO",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1002/PRO.4785",
            "metadata": {
                "abstract": "The identification of B-cell epitopes (BCEs) in antigens is a crucial step in developing recombinant vaccines or immunotherapies for various diseases. Over the past four decades, numerous in silico methods have been developed for predicting BCEs. However, existing reviews have only covered specific aspects, such as the progress in predicting conformational or linear BCEs. Therefore, in this paper, we have undertaken a systematic approach to provide a comprehensive review covering all aspects associated with the identification of BCEs. First, we have covered the experimental techniques developed over the years for identifying linear and conformational epitopes, including the limitations and challenges associated with these techniques. Second, we have briefly described the historical perspectives and resources that maintain experimentally validated information on BCEs. Third, we have extensively reviewed the computational methods developed for predicting conformational BCEs from the structure of the antigen, as well as the methods for predicting conformational epitopes from the sequence. Fourth, we have systematically reviewed the in silico methods developed in the last four decades for predicting linear or continuous BCEs. Finally, we have discussed the overall challenge of identifying continuous or conformational BCEs. In this review, we only listed major computational resources; a complete list with the URL is available from the BCinfo website (https://webs.iiitd.edu.in/raghava/bcinfo/).",
                "authors": [
                    {
                        "name": "Bajiya N."
                    },
                    {
                        "name": "Kumar N."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 2,
                "date": "2023-11-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Multi-perspectives and challenges in identifying B-cell epitopes"
            }
        }
    ]
}
