{
    "additionDate": "2021-01-18T10:00:54Z",
    "biotoolsCURIE": "biotools:mares",
    "biotoolsID": "mares",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vanearranz@hotmail.com",
            "name": "Vanessa Arranz",
            "orcidid": "https://orcid.org/0000-0002-3404-5317",
            "typeEntity": "Person"
        }
    ],
    "description": "Replicable pipeline and curated reference database for marine eukaryote metabarcoding.\n\nBuilding custom reference databases for metabarcoding.\n\nThis pipeline can be used to develop a de-contamination database (i.e used to create a database of potential contaminants), or as a database for general purpose metabarcoding. We have provided three databases - a very small database composed of common contaminants (i.e human, sheep, goat, flies etc), as well as two metabarcoding databases for marine eukaryotes.\n\nThese scripts support the MARES (MARine Eukaryote Species) pipeline used to create the MARES database of COI sequences for metabarcoding studies (presented in Arranz, Pearman, Aguirre, Liggins, in prep.).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wpearman1996/MARES_database_pipeline",
    "language": [
        "Perl",
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-02-19T09:45:19Z",
    "name": "MARES",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1038/S41597-020-0549-9",
            "metadata": {
                "abstract": "© 2020, The Author(s).The use of DNA metabarcoding to characterise the biodiversity of environmental and community samples has exploded in recent years. However, taxonomic inferences from these studies are contingent on the quality and completeness of the sequence reference database used to characterise sample species-composition. In response, studies often develop custom reference databases to improve species assignment. The disadvantage of this approach is that it limits the potential for database re-use, and the transferability of inferences across studies. Here, we present the MARine Eukaryote Species (MARES) reference database for use in marine metabarcoding studies, created using a transparent and reproducible pipeline. MARES includes all COI sequences available in GenBank and BOLD for marine taxa, unified into a single taxonomy. Our pipeline facilitates the curation of sequences, synonymization of taxonomic identifiers used by different repositories, and formatting these data for use in taxonomic assignment tools. Overall, MARES provides a benchmark COI reference database for marine eukaryotes, and a standardised pipeline for (re)producing reference databases enabling integration and fair comparison of marine DNA metabarcoding results.",
                "authors": [
                    {
                        "name": "Aguirre J.D."
                    },
                    {
                        "name": "Arranz V."
                    },
                    {
                        "name": "Liggins L."
                    },
                    {
                        "name": "Pearman W.S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "MARES, a replicable pipeline and curated reference database for marine eukaryote metabarcoding"
            },
            "pmcid": "PMC7334202",
            "pmid": "32620910"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Marine biology",
            "uri": "http://edamontology.org/topic_3387"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
