
{
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "vincent.zoete@sib.swiss",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://www.swissadme.ch/help.php"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "SMILES string",
                        "uri": "http://edamontology.org/data_2301"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    }
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "PHP",
            "JavaScript"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Medicinal chemistry",
                "uri": "http://edamontology.org/topic_0209"
            },
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2017. To be effective as a drug, a potent molecule must reach its target in the body in sufficient concentration, and stay there in a bioactive form long enough for the expected biologic events to occur. Drug development involves assessment of absorption, distribution, metabolism and excretion (ADME) increasingly earlier in the discovery process, at a stage when considered compounds are numerous but access to the physical samples is limited. In that context, computer models constitute valid alternatives to experiments. Here, we present the new SwissADME web tool that gives free access to a pool of fast yet robust predictive models for physicochemical properties, pharmacokinetics, drug-likeness and medicinal chemistry friendliness, among which in-house proficient methods such as the BOILED-Egg, iLOGP and Bioavailability Radar. Easy efficient input and interpretation are ensured thanks to a user-friendly interface through the login-free website http://www.swissadme.ch. Specialists, but also nonexpert in cheminformatics or computational chemistry can predict rapidly key parameters for a collection of molecules to support their drug discovery endeavours.",
            "authors": [
                "Daina A.",
                "Michielin O.",
                "Zoete V."
            ],
            "cit_count": 185,
            "doi": "10.1038/srep42717",
            "journal": "Scientific Reports",
            "title": "SwissADME: A free web tool to evaluate pharmacokinetics, drug-likeness and medicinal chemistry friendliness of small molecules",
            "type": "Primary",
            "year": "2017-03-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:swissadme",
        "biotoolsID": "swissadme",
        "description": "Gives free access to a number of parameters and predictive models in order to compute the physicochemistry and estimate the pharmacokinetics, druglikeness and medicinal chemistry friendliness of one or several small molecules.",
        "homepage": "http://www.swissadme.ch/index.php",
        "name": "SwissADME",
        "version": [
            "1"
        ]
    }
}