
{
    "credit": [
        {
            "email": "yunliu@iupui.edu",
            "name": "Yunlong Liu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "zhangxin@umail.iu.edu",
            "name": "Xinjun Zhang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://watson.compbio.iupui.edu/pinpor/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Protein modifications",
                "uri": "http://edamontology.org/topic_0601"
            },
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pinpor-predicting-pathogenic-micro-insertions-and-deletions-affecting-post-transcriptional-regulation.html"
        }
    ],
    "publication": [
        {
            "abstract": "Small insertions/deletions (INDELs) of ≤21 bp comprise 18%of all recorded mutations causing human inherited disease and are evident in 24%of documentedMendelian diseases. INDELs affect gene function inmultipleways: forexample,byintroducingprematurestopcodonsthateither leadtotheproductionof truncatedproteinsoraffect transcriptional efficiency.However, themeans bywhich they impact post-transcriptional regulation, including alternative splicing, havenot been fully evaluated. In this study,wecollate disease-causingINDELs fromtheHuman Gene Mutation Database (HGMD) and neutral INDELs from the 1000 Genomes Project. The potential of these two types of INDELs to affect binding-site affinity of RNA-binding proteins (RBPs) was then evaluated. We identified several sequence features that can distinguish disease-causing INDELs from neutral INDELs. Moreover, we built a machine-learning predictor called PinPor (predicting pathogenic small insertions and deletions affecting post-transcriptional regulation, http://watson.compbio.iupui.edu/pinpor/) to ascertain which newly observed INDELs are likely to be pathogenic. Our results show that disease-causing INDELs are more likely to ablate RBP-binding sites and tend to affectmore RBP-binding sites than neutral INDELs. Additionally, disease-causing INDELs give rise to greater deviations in binding affinity than neutral INDELs.We also demonstrated that diseasecausing INDELsmay be distinguished fromneutral INDELs by several sequence features, such as their proximity tosplice sites andtheirpotential effectsonRNAsecondary structure.Thispredictor showedsatisfactoryperformance in identifying numerous pathogenic INDELs, with aMatthews correlation coefficient (MCC) value of 0.51 and an accuracy of 0.75. © The Author 2014. Published by Oxford University Press. All rights reserved. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Zhang X.",
                "Lin H.",
                "Zhao H.",
                "Hao Y.",
                "Mort M.",
                "Cooper D.N.",
                "Zhou Y.",
                "Liu Y."
            ],
            "cit_count": 15,
            "journal": "Human Molecular Genetics",
            "pmid": "24436305",
            "title": "Impact of human pathogenic micro-insertions and micro-deletions on post-transcriptional regulation",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pinpor",
        "biotoolsID": "pinpor",
        "description": "Machine-learning predictor to ascertain which newly observed INDELs are likely to be pathogenic.",
        "homepage": "http://watson.compbio.iupui.edu/pinpor/",
        "name": "PinPor"
    }
}