{"collectionID": [], "accessibility": [], "topic": [{"term": "Cheminformatics", "uri": "http://edamontology.org/topic_2258"}, {"term": "Simulation experiment", "uri": "http://edamontology.org/topic_3524"}, {"term": "Biophysics", "uri": "http://edamontology.org/topic_3306"}, {"term": "Protein binding sites", "uri": "http://edamontology.org/topic_3534"}], "owner": "d.gabrielaitis", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/s13321-017-0243-x", "note": null, "version": null, "pmid": null, "type": null, "pmcid": null, "metadata": {"title": "ETOX ALLIES: An automated pipeLine for linear interaction energy-based simulations", "abstract": "© 2017 The Author(s).Background: Computational methods to predict binding affinities of small ligands toward relevant biological (off-)targets are helpful in prioritizing the screening and synthesis of new drug candidates, thereby speeding up the drug discovery process. However, use of ligand-based approaches can lead to erroneous predictions when structural and dynamic features of the target substantially affect ligand binding. Free energy methods for affinity computation can include steric and electrostatic protein-ligand interactions, solvent effects, and thermal fluctuations, but often they are computationally demanding and require a high level of supervision. As a result their application is typically limited to the screening of small sets of compounds by experts in molecular modeling. Results: We have developed eTOX ALLIES, an open source framework that allows the automated prediction of ligand-binding free energies requiring the ligand structure as only input. eTOX ALLIES is based on the linear interaction energy approach, an efficient end-point free energy method derived from Free Energy Perturbation theory. Upon submission of a ligand or dataset of compounds, the tool performs the multiple steps required for binding free-energy prediction (docking, ligand topology creation, molecular dynamics simulations, data analysis), making use of external open source software where necessary. Moreover, functionalities are also available to enable and assist the creation and calibration of new models. In addition, a web graphical user interface has been developed to allow use of free-energy based models to users that are not an expert in molecular modeling. Conclusions: Because of the user-friendliness, efficiency and free-software licensing, eTOX ALLIES represents a novel extension of the toolbox for computational chemists, pharmaceutical scientists and toxicologists, who are interested in fast affinity predictions of small molecules toward biological (off-)targets for which protein flexibility, solvent and binding site interactions directly affect the strength of ligand-protein binding.", "citationCount": 0, "authors": [{"name": "Capoferri L."}, {"name": "Van Dijk M."}, {"name": "Rustenburg A.S."}, {"name": "Wassenaar T.A."}, {"name": "Kooi D.P."}, {"name": "Rifai E.A."}, {"name": "Vermeulen N.P.E."}, {"name": "Geerke D.P."}], "date": "2017-11-21T00:00:00Z", "journal": "Journal of Cheminformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Daan P. Geerke", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "d.p.geerke@vu.nl"}], "biotoolsCURIE": "biotools:etox_allies", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://github.com/GeerkeLab/eTOX-ALLIES", "function": [{"note": null, "input": [], "operation": [{"term": "Molecular docking", "uri": "http://edamontology.org/operation_0478"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:59:01Z", "otherID": [], "description": "An open source framework that allows the automated prediction of ligand-binding free energies requiring the ligand structure as only input.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Shell", "Python"], "link": [], "biotoolsID": "etox_allies", "additionDate": "2018-08-27T15:29:00Z", "name": "eTOX ALLIES", "license": "GPL-2.0", "documentation": [{"url": "https://github.com/GeerkeLab/eTOX-ALLIES", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Mac"]}