{
    "name": "compareMS2", 
    "description": "A simple tool developed to compare, globally, all MS/MS spectra between two datasets (in Mascot Generic Format or MGF).", 
    "homepage": "http://www.ms-utils.org/compareMS2.html", 
    "biotoolsID": "comparems2", 
    "biotoolsCURIE": "biotools:comparems2", 
    "version": [
        "1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2424", 
                    "term": "Comparison"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0953", 
                        "term": "Version information"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_3651", 
                            "term": "MGF"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0953", 
                        "term": "Version information"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_3651", 
                            "term": "MGF"
                        }
                    ]
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0084", 
            "term": "Phylogeny"
        }, 
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3172", 
            "term": "Metabolomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3520", 
            "term": "Proteomics experiment"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C"
    ], 
    "license": "GPL-2.0", 
    "collectionID": [
        "ms-utils", 
        "Proteomics"
    ], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.ms-utils.org/compareMS2.html", 
            "type": "Repository", 
            "note": null
        }, 
        {
            "url": "http://ms-utils.org", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [
        {
            "url": "http://www.ms-utils.org/compareMS2.c", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }, 
        {
            "url": "http://www.ms-utils.org/compareMS2.html", 
            "type": "Binaries", 
            "note": null, 
            "version": null
        }, 
        {
            "url": "http://www.ms-utils.org/compareMS2.c", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://www.ms-utils.org/compareMS2.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1002/rcm.6162", 
            "pmid": "22368051", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Molecular phylogenetics by direct comparison of tandem mass spectra", 
                "abstract": "Rationale: Molecular phylogenetics is the study of evolution and relatedness of organisms or genes. Mass spectrometry is used routinely for bacterial identification and has also been used for phylogenetic analysis, for instance from bone material. Unfortunately, only a small fraction of the acquired tandem mass spectra allow direct interpretation. Methods: We describe a new algorithm and software for molecular phylogenetics using pairwise comparisons of tandem mass spectra from enzymatically digested proteins. The spectra need not be annotated and all acquired data is used in the analysis. To demonstrate the method, we analyzed tryptic digests of sera from four great apes and two other primates. Results: The distribution of spectra dot products for thousands of tandem mass spectra collected from two samples provides a measure on the fraction of shared peptides between the two samples. When inverted, this becomes a distance metric. By pairwise comparison between species and averaging over four individuals per species, it was possible to reconstruct the unique correct phylogenetic tree for the great apes and other primates. Conclusions: The new method described here has several attractive features compared with existing methods, among them simplicity, the unbiased use of all acquired data rather than a small subset of spectra, and the potential use of heavily degraded proteins or proteins with a priori unknown modifications. © 2012 John Wiley & Sons, Ltd.", 
                "date": "2012-04-15T00:00:00Z", 
                "citationCount": 10, 
                "authors": [
                    {
                        "name": "Palmblad M."
                    }, 
                    {
                        "name": "Deelder A.M."
                    }
                ], 
                "journal": "Rapid Communications in Mass Spectrometry"
            }
        }, 
        {
            "doi": null, 
            "pmid": "26864526", 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Differentiating samples and experimental protocols by direct comparison of tandem mass spectra", 
                "abstract": "Copyright © 2016 John Wiley & Sons, Ltd.Rationale Peptide tandem mass spectra can be analyzed by a number of means. They can be compared against predicted spectra of peptides derived from genome sequences, compared against previously acquired and identified spectra, or - sometimes - sequenced de novo. We recently introduced another method which compares spectra between liquid chromatography/tandem mass spectrometry (LC/MS/MS) datasets to determine the shared spectral content, and demonstrated how this can be applied in a molecular phylogenetic study using sera from human and non-human primates. We will here explore if such a method have other, serendipitous uses. Methods We used the existing compareMS2 algorithm without modification on a diverse set of experiments. Results First we conducted a small phylogenetic study, using (mammalian) bone samples to study old material, and human pathogens aiming to distinguish clinically important strains. Although not as straightforward as primate sera analysis, the method shows significant promise for all these applications. We also used the algorithm to compare 24 different protocols for extraction of proteins from muscle tissue. The results provided useful information in comparing protocols. Finally, we applied compareMS2 aiming for quality control of two traceable protein reference standards (troponin) used in clinical chemistry assays, by analysing the effect of storage conditions. Conclusions The results illustrate a broad applicability of the metric based on shared tandem mass spectra between LC/MS/MS datasets for analysing protein digests in different types of experiments. There is no reason to assume that our instance of this method is optimal in any of these situations, as it makes limited or no use of accurate mass and chromatographic retention time. We propose that with further improvement and refinement, this type of analysis can be applied as a simple but informative first step in many pipelines for bottom-up tandem mass spectrometry data analysis in proteomics and other fields, comparing or analysing large numbers of samples or datasets.", 
                "date": "2016-03-30T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Van Der Plas-Duivesteijn S.J."
                    }, 
                    {
                        "name": "Wulff T."
                    }, 
                    {
                        "name": "Klychnikov O."
                    }, 
                    {
                        "name": "Ohana D."
                    }, 
                    {
                        "name": "Dalebout H."
                    }, 
                    {
                        "name": "Van Veelen P.A."
                    }, 
                    {
                        "name": "De Keijzer J."
                    }, 
                    {
                        "name": "Nessen M.A."
                    }, 
                    {
                        "name": "Van Der Burgt Y.E.M."
                    }, 
                    {
                        "name": "Deelder A.M."
                    }, 
                    {
                        "name": "Palmblad M."
                    }
                ], 
                "journal": "Rapid Communications in Mass Spectrometry"
            }
        }
    ], 
    "credit": [
        {
            "name": "lumc.nl", 
            "email": null, 
            "url": "https://www.lumc.nl", 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Magnus Palmblad", 
            "email": "magnus.palmblad@gmail.com", 
            "url": null, 
            "orcidid": "http://orcid.org/0000-0002-5865-8994", 
            "typeEntity": null, 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Magnus Palmblad", 
            "email": "magnus.palmblad@gmail.com", 
            "url": null, 
            "orcidid": "http://orcid.org/0000-0002-5865-8994", 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "n.m.palmblad@lumc.nl", 
    "additionDate": "2016-04-15T11:52:42Z", 
    "lastUpdate": "2019-03-26T08:13:35Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}