{
    "additionDate": "2021-01-18T08:03:59Z",
    "biotoolsCURIE": "biotools:cd-nuss",
    "biotoolsID": "cd-nuss",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tr@iith.ac.in",
            "name": "Thenmalarchelvi Rathinavelan",
            "typeEntity": "Person"
        }
    ],
    "description": "CD-NuSS is web server to predict the nucleic acid secondary structures from the CD spectral data using machine learning algorithms. Circular dichroism (CD) spectroscopy is a profoundly used technique to decipher the protein and nucleic acid secondary structures as well as the structural changes that occur during the biomolecular interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "Protein secondary structure assignment",
                    "uri": "http://edamontology.org/operation_0319"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Nucleic acid structure comparison",
                    "uri": "http://edamontology.org/operation_2518"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://project.iith.ac.in/cdnuss/",
    "lastUpdate": "2021-02-09T08:14:18Z",
    "name": "CD-NuSS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.03.16.993352"
        },
        {
            "doi": "10.1016/j.jmb.2020.08.014",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdNucleic acids exhibit a repertoire of conformational preference depending on the sequence and environment. Circular dichroism (CD) is an essential and valuable tool for monitoring such secondary structural conformations of nucleic acids. Nonetheless, the CD spectral diversity associated with these structures poses a challenge in obtaining the quantitative information about the secondary structural content of a given CD spectrum. To this end, the competence of the extreme gradient boosting decision-tree (XGBoost), Kohonen and neural network (nnet) algorithms have been exploited here to predict the diverse secondary structures of nucleic acids. A curated library of 450 CD spectra corresponding to 16 different secondary structures of nucleic acids has been created and used as a training dataset. The hyper-parameters corresponding to the aforementioned algorithms have been optimized using holdout and k-fold (here, k = 5) cross-validation methods. For a test dataset of 150 CD spectra, both the nnet and XGBoost algorithms have exhibited nearly similar prediction accuracy in the range of 85% and 87% (the latter exhibited a slightly higher prediction accuracy). Thus, the nnet and XGBoost algorithms tested here can be employed for predicting the hybrid nucleic acid topologies in future. For the sake of accessibility, the entire process has been automated and implemented as a webserver, called CD-NuSS (CD to nucleic acids secondary structure) and is freely accessible at https://project.iith.ac.in/cdnuss/.",
                "authors": [
                    {
                        "name": "Sathyaseelan C."
                    },
                    {
                        "name": "Vijayakumar V."
                    },
                    {
                        "name": "Rathinavelan T."
                    }
                ],
                "citationCount": 4,
                "date": "2021-05-28T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "CD-NuSS: A Web Server for the Automated Secondary Structural Characterization of the Nucleic Acids from Circular Dichroism Spectra Using Extreme Gradient Boosting Decision-Tree, Neural Network and Kohonen Algorithms"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        }
    ]
}