{
    "additionDate": "2017-12-18T00:04:19Z",
    "biotoolsCURIE": "biotools:biohel",
    "biotoolsID": "biohel",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ico2s.org/index.html"
        }
    ],
    "description": "BioHEL is an evolutionary learning system designed to handle with large-scale bioinformatic datasets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://ico2s.org/software/tutorials/biohel.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Processing",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://ico2s.org/software/biohel.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/biohel-bioinformatics-oriented-hierarchical-evolutionary-learning.html"
        }
    ],
    "name": "BioHEL",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1145/1830483.1830672",
            "metadata": {
                "abstract": "In this paper we introduce a method for computing fitness in evolutionary learning systems based on NVIDIA's massive parallel technology using the CUDA library. Both the match process of a population of classifiers against a training set and the computation of the fitness of each classifier from its matches have been parallelized. This method has been integrated within the BioHEL evolutionary learning system. The methodology presented in this paper can be easily extended to any evolutionary learning system. The method has been tested using a broad set of problems with varying number of attributes and instances. The evaluation function by itself achieves speedups up to 52.4X while its integration with the entire learning process achieves speedups up to 58.1X. Moreover, the speedup increases when the CUDAbased fitness computation is combined with other efficiency enhancement mechanisms. Copyright 2010 ACM.",
                "authors": [
                    {
                        "name": "Franco M.A."
                    },
                    {
                        "name": "Krasnogor N."
                    },
                    {
                        "name": "Bacardit J."
                    }
                ],
                "citationCount": 39,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Proceedings of the 12th Annual Genetic and Evolutionary Computation Conference, GECCO '10",
                "title": "Speeding up the evaluation of evolutionary learning systems using GPGPUs"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1145/2330163.2330281",
            "metadata": {
                "abstract": "This paper proposes three post-processing operators (rule cleaning, rule pruning and rule swapping) which combined together in different ways can help reduce the complexity of decision lists evolved by means of genetics-based machine learning. While the first two operators work on the independent rules to reduce the number of expressed attributes, the last one changes the order of the rules (based on the similarities between them) to identify and delete the unnecessary ones. These operators were tested using the BioHEL system over 35 different problems. Our results show that it is possible to reduce the number of specified attributes per rule and the number rules up to 30% in some problems, without producing significant changes in the test accuracy. Moreover, the approaches presented in this paper can be easily extended to other learning paradigms and representations. © 2012 ACM.",
                "authors": [
                    {
                        "name": "Franco M.A."
                    },
                    {
                        "name": "Krasnogor N."
                    },
                    {
                        "name": "Bacardit J."
                    }
                ],
                "citationCount": 5,
                "date": "2012-08-13T00:00:00Z",
                "journal": "GECCO'12 - Proceedings of the 14th International Conference on Genetic and Evolutionary Computation",
                "title": "Post-processing operators for decision lists"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}