{
    "additionDate": "2019-11-14T19:55:55Z",
    "biotoolsCURIE": "biotools:MVIAm",
    "biotoolsID": "MVIAm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yliang@must.edu.mo",
            "name": "Yong Liang",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-view based integrative analysis of gene expression data for identifying biomarkers | This repository provides some codes for this paper | The widespread applications in microarray technology have produced the vast quantity of publicly available gene expression datasets | If you are interested in it but have doubts about the content, please feel free to contact me | Communication: yangziyi091100@163.com",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/must-bio-team/MVIAm",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-29T11:01:22Z",
    "name": "MVIAm",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-49967-4",
            "metadata": {
                "abstract": "© 2019, The Author(s).The widespread applications in microarray technology have produced the vast quantity of publicly available gene expression datasets. However, analysis of gene expression data using biostatistics and machine learning approaches is a challenging task due to (1) high noise; (2) small sample size with high dimensionality; (3) batch effects and (4) low reproducibility of significant biomarkers. These issues reveal the complexity of gene expression data, thus significantly obstructing microarray technology in clinical applications. The integrative analysis offers an opportunity to address these issues and provides a more comprehensive understanding of the biological systems, but current methods have several limitations. This work leverages state of the art machine learning development for multiple gene expression datasets integration, classification and identification of significant biomarkers. We design a novel integrative framework, MVIAm - Multi-View based Integrative Analysis of microarray data for identifying biomarkers. It applies multiple cross-platform normalization methods to aggregate multiple datasets into a multi-view dataset and utilizes a robust learning mechanism Multi-View Self-Paced Learning (MVSPL) for gene selection in cancer classification problems. We demonstrate the capabilities of MVIAm using simulated data and studies of breast cancer and lung cancer, it can be applied flexibly and is an effective tool for facing the four challenges of gene expression data analysis. Our proposed model makes microarray integrative analysis more systematic and expands its range of applications.",
                "authors": [
                    {
                        "name": "Yang Z.-Y."
                    },
                    {
                        "name": "Liu X.-Y."
                    },
                    {
                        "name": "Shu J."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Ren Y.-Q."
                    },
                    {
                        "name": "Xu Z.-B."
                    },
                    {
                        "name": "Liang Y."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Multi-view based integrative analysis of gene expression data for identifying biomarkers"
            },
            "pmcid": "PMC6751173",
            "pmid": "31534156"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}