
{
    "credit": [
        {
            "email": "buech@mpi-inf.mpg.de",
            "name": "Dr. Joachim Büch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://bioinf.mpi-inf.mpg.de/homepage/index.php?&account=buech"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "Python"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web service"
        ],
        "topic": [
            {
                "term": "Epigenomics",
                "uri": "http://edamontology.org/topic_3173"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The EpiGRAPH web service http://epigraph.mpi-inf.mpg.de/ enables biologists to uncover hidden associations in vertebrate genome and epigenome datasets. Users can upload sets of genomic regions and EpiGRAPH will test multiple attributes (including DNA sequence, chromatin structure, epigenetic modifications and evolutionary conservation) for enrichment or depletion among these regions. Furthermore, EpiGRAPH learns to predictively identify similar genomic regions. This paper demonstrates EpiGRAPH's practical utility in a case study on monoallelic gene expression and describes its novel approach to reproducible bioinformatic analysis. © 2009 Bock et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Bock C.",
                "Halachev K.",
                "Buch J.",
                "Lengauer T."
            ],
            "cit_count": 36,
            "journal": "Genome Biology",
            "pmid": "19208250",
            "title": "EpiGRAPH: User-friendly software for statistical analysis and prediction of (epi)genomic data",
            "year": "2009-02-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:epigraph",
        "biotoolsID": "epigraph",
        "description": "Enables biologists to analyze genome and epigenome datasets with powerful statistical and machine learning methods. In a typical workflow, the user uploads a set of genomic regions of interest, and its searches a large database of (epi-) genomic attributes for significant overlap and correlation with the regions in the input dataset. Furthermore, it can predict the status of genomic regions that were not included in the input dataset.",
        "homepage": "http://epigraph.mpi-inf.mpg.de/WebGRAPH/",
        "name": "EpiGRAPH"
    }
}