{
    "accessibility": "Open access",
    "additionDate": "2023-08-24T13:41:04.356982Z",
    "biotoolsCURIE": "biotools:quantimage",
    "biotoolsID": "quantimage",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "adrien.depeursinge@hevs.ch",
            "name": "Adrien Depeursinge",
            "orcidid": "https://orcid.org/0000-0002-2362-0304",
            "typeEntity": "Person"
        },
        {
            "name": "Daniel Abler",
            "orcidid": "http://orcid.org/0000-0003-1776-5985",
            "typeEntity": "Person"
        },
        {
            "name": "Roger Schaer",
            "orcidid": "http://orcid.org/0000-0001-7984-2099",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive and integrated physician-centered cloud platform for radiomics and machine learning research.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://medgift.github.io/quantimage-v2-info/",
    "lastUpdate": "2024-11-24T14:42:58.635310Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://quantimage2.ehealth.hevs.ch/"
        }
    ],
    "name": "QuantImage",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s41747-023-00326-z",
            "metadata": {
                "abstract": "Background: Radiomics, the field of image-based computational medical biomarker research, has experienced rapid growth over the past decade due to its potential to revolutionize the development of personalized decision support models. However, despite its research momentum and important advances toward methodological standardization, the translation of radiomics prediction models into clinical practice only progresses slowly. The lack of physicians leading the development of radiomics models and insufficient integration of radiomics tools in the clinical workflow contributes to this slow uptake. Methods: We propose a physician-centered vision of radiomics research and derive minimal functional requirements for radiomics research software to support this vision. Free-to-access radiomics tools and frameworks were reviewed to identify best practices and reveal the shortcomings of existing software solutions to optimally support physician-driven radiomics research in a clinical environment. Results: Support for user-friendly development and evaluation of radiomics prediction models via machine learning was found to be missing in most tools. QuantImage v2 (QI2) was designed and implemented to address these shortcomings. QI2 relies on well-established existing tools and open-source libraries to realize and concretely demonstrate the potential of a one-stop tool for physician-driven radiomics research. It provides web-based access to cohort management, feature extraction, and visualization and supports “no-code” development and evaluation of machine learning models against patient-specific outcome data. Conclusions: QI2 fills a gap in the radiomics software landscape by enabling “no-code” radiomics research, including model validation, in a clinical environment. Further information about QI2, a public instance of the system, and its source code is available at https://medgift.github.io/quantimage-v2-info/. Key points As domain experts, physicians play a key role in the development of radiomics models.Existing software solutions do not support physician-driven research optimally.QuantImage v2 implements a physician-centered vision for radiomics research.QuantImage v2 is a web-based, “no-code” radiomics research platform.",
                "authors": [
                    {
                        "name": "Abler D."
                    },
                    {
                        "name": "Aidonopoulos O."
                    },
                    {
                        "name": "Depeursinge A."
                    },
                    {
                        "name": "Evequoz F."
                    },
                    {
                        "name": "Jreige M."
                    },
                    {
                        "name": "Oreiller V."
                    },
                    {
                        "name": "Prior J.O."
                    },
                    {
                        "name": "Reichenbach J."
                    },
                    {
                        "name": "Schaer R."
                    },
                    {
                        "name": "Verma H."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "European Radiology Experimental",
                "title": "QuantImage v2: a comprehensive and integrated physician-centered cloud platform for radiomics and machine learning research"
            },
            "pmcid": "PMC10033788",
            "pmid": "36947346"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
