{
    "additionDate": "2022-06-15T13:15:11.627396Z",
    "biotoolsCURIE": "biotools:ipro-gan",
    "biotoolsID": "ipro-gan",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Bowei Wang"
        },
        {
            "name": "Huijuan Qiao"
        }
    ],
    "description": "A novel model based on generative adversarial learning for identifying promoters and their strength",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/Bovbene/iPro-GAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-15T13:15:11.631587Z",
    "license": "Not licensed",
    "name": "iPro-GAN",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2022.106625",
            "metadata": {
                "abstract": "© 2022Background and Objective: Promoter is a component of the gene, which can specifically bind with RNA polymerase and determine where transcription starts, and also determine the transcription efficiency of the gene. Promoters can be divided into strong promoters and weak promoters because their structures and the interaction time interval are quite different. The functional variation of the promoter can lead to a variety of diseases. Therefore, identifying promoters and their strength is necessary and has important biological significance. A novel and promising model based on deep learning is proposed to achieve it. Methods: In this work, we build a power model named iPro-GAN for identification of promoters and their strength. First, we collect benchmark datasets and independent datasets for training and testing. Then, Moran-based spatial auto-cross correlation method is used as feature extraction method. Finally, deep convolution generative adversarial network with 10-fold cross validation is applied for classifying. The first layer of the model is used to identify the promoter and the second layer is used to determine its type. Results: On the benchmark data set, the accuracy of the first layer predictor is 93.15%, and the accuracy of the second layer predictor is 92.30%. On the independent data set, the accuracy of the first layer predictor is 86.77%, and the accuracy of the second layer predictor is 91.66%. In particular, breakthrough progress has been made in the identification of promoters’ strength. Conclusions: These results are far higher than the existing best predictor, which indicate that our model is serviceable and practicable to identify promoters and their strength. Furthermore, the datasets and source codes are available from this link: https://github.com/Bovbene/iPro-GAN.",
                "authors": [
                    {
                        "name": "Qiao H."
                    },
                    {
                        "name": "Wang B."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Xue T."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "iPro-GAN: A novel model based on generative adversarial learning for identifying promoters and their strength"
            },
            "pmid": "35038653"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
