{
    "name": "ARIA", 
    "description": "A software for automated NOE assignment and NMR structure calculation.", 
    "homepage": "http://aria.pasteur.fr/", 
    "biotoolsID": "aria", 
    "biotoolsCURIE": "biotools:aria", 
    "version": [
        "2.3.2"
    ], 
    "otherID": [], 
    "relation": [
        {
            "biotoolsID": "ccpn", 
            "type": "uses"
        }, 
        {
            "biotoolsID": "cnssolve", 
            "type": "uses"
        }
    ], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0477", 
                    "term": "Protein modelling"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2476", 
                    "term": "Molecular dynamics"
                }, 
                {
                    "uri": "http://edamontology.org/operation_1844", 
                    "term": "Protein geometry validation"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_3488", 
                        "term": "NMR spectrum"
                    }, 
                    "format": []
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_1743", 
                        "term": "Atomic coordinate"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_1476", 
                            "term": "PDB"
                        }
                    ]
                }
            ], 
            "note": "ARIA (Ambiguous Restraints for Iterative Assignment) is a software tool for automated NOE assignment and NMR structure calculation", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_1317", 
            "term": "Structural biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0593", 
            "term": "NMR"
        }, 
        {
            "uri": "http://edamontology.org/topic_0176", 
            "term": "Molecular dynamics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3332", 
            "term": "Computational chemistry"
        }, 
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [
        "Tools"
    ], 
    "elixirNode": [
        "France"
    ], 
    "link": [
        {
            "url": "https://listes.services.cnrs.fr/wws/info/aria-discuss", 
            "type": "Mailing list", 
            "note": null
        }
    ], 
    "download": [
        {
            "url": "http://aria.pasteur.fr/downloads", 
            "type": "Downloads page", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://aria.pasteur.fr/documentation", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btl589", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "ARIA2: Automated NOE assignment and data integration in NMR structure calculation", 
                "abstract": "Summary: Modern structural genomics projects demand for integrated methods for the interpretation and storage of nuclear magnetic resonance (NMR) data. Here we present version 2.1 of our program ARIA (Ambiguous Restraints for Iterative Assignment) for automated assignment of nuclear Overhauser enhancement (NOE) data and NMR structure calculation. We report on recent developments, most notably a graphical user interface, and the incorporation of the object-oriented data model of the Collaborative Computing Project for NMR (CCPN). The CCPN data model defines a storage model for NMR data, which greatly facilitates the transfer of data between different NMR software packages. © 2007 Oxford University Press.", 
                "date": "2007-02-01T00:00:00Z", 
                "citationCount": 320, 
                "authors": [
                    {
                        "name": "Rieping W."
                    }, 
                    {
                        "name": "Bardiaux B."
                    }, 
                    {
                        "name": "Bernard A."
                    }, 
                    {
                        "name": "Malliavin T.E."
                    }, 
                    {
                        "name": "Nilges M."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": "10.1007/978-1-61779-480-3_23", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Usage", 
            "version": null, 
            "metadata": {
                "title": "ARIA for solution and solid-state NMR", 
                "abstract": "In solution or solid-state, determining the three-dimensional structure of biomolecules by Nuclear -Magnetic Resonance (NMR) normally requires the collection of distance information. The interpretation of the spectra containing this distance information is a critical step in an NMR structure determination. In this chapter, we present the Ambiguous Restraints for Iterative Assignment (ARIA) program for automated cross-peak assignment and determination of macromolecular structure from solution and solid-state NMR experiments. While the program was initially designed for the assignment of nuclear Overhauser effect (NOE) resonances, it has been extended to the interpretation of magic-angle spinning (MAS) solid-state NMR data. This chapter first details the concepts and procedures carried out by the program. Then, we describe both the general strategy for structure determination with ARIA 2.3 and practical aspects of the technique. ARIA 2.3 includes all recent developments. such as an extended integration of the Collaborative Computing Project for the NMR community (CCPN), the incorporation of the log-harmonic distance restraint potential and an automated treatment of symmetric oligomers. © 2012 Springer Science+Business Media, LLC.", 
                "date": "2012-01-20T00:00:00Z", 
                "citationCount": 28, 
                "authors": [
                    {
                        "name": "Bardiaux B."
                    }, 
                    {
                        "name": "Malliavin T."
                    }, 
                    {
                        "name": "Nilges M."
                    }
                ], 
                "journal": "Methods in Molecular Biology"
            }
        }, 
        {
            "doi": "10.1093/bioinformatics/19.2.315", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Method", 
            "version": null, 
            "metadata": {
                "title": "ARIA: Automated NOE assignment and NMR structure calculation", 
                "abstract": "Motivation: In the light of several ongoing structural genomics projects, faster and more reliable methods for structure calculation from NMR data are in great demand. The major bottleneck in the determination of solution NMR structures is the assignment of NOE peaks (nuclear Overhauser effect). Due to the high complexity of the assignment problem, most NOEs cannot be directly converted into unambiguous inter-proton distance restraints. Results: We present version 1.2 of our program ARIA (Ambiguous Restraints for Iterative Assignment) for automated assignment of NOE data and NMR structure calculation. We summarize recent progress in correcting for spin diffusion with a relaxation matrix approach, representing non-bonded interactions in the force field and refining final structures in explicit solvent. We also discuss book-keeping, data exchange with spectra assignment programs and deposition of the analysed experimental data to the databases.", 
                "date": "2003-02-01T00:00:00Z", 
                "citationCount": 287, 
                "authors": [
                    {
                        "name": "Linge J.P."
                    }, 
                    {
                        "name": "Habeck M."
                    }, 
                    {
                        "name": "Rieping W."
                    }, 
                    {
                        "name": "Nilges M."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }, 
        {
            "doi": "10.1007/s10858-015-9928-5", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Method", 
            "version": null, 
            "metadata": {
                "title": "Improved reliability, accuracy and quality in automated NMR structure calculation with ARIA", 
                "abstract": "© 2015 The Author(s).In biological NMR, assignment of NOE cross-peaks and calculation of atomic conformations are critical steps in the determination of reliable high-resolution structures. ARIA is an automated approach that performs NOE assignment and structure calculation in a concomitant manner in an iterative procedure. The log-harmonic shape for distance restraint potential and the Bayesian weighting of distance restraints, recently introduced in ARIA, were shown to significantly improve the quality and the accuracy of determined structures. In this paper, we propose two modifications of the ARIA protocol: (1) the softening of the force field together with adapted hydrogen radii, which is meaningful in the context of the log-harmonic potential with Bayesian weighting, (2) a procedure that automatically adjusts the violation tolerance used in the selection of active restraints, based on the fitting of the structure to the input data sets. The new ARIA protocols were fine-tuned on a set of eight protein targets from the CASD-NMR initiative. As a result, the convergence problems previously observed for some targets was resolved and the obtained structures exhibited better quality. In addition, the new ARIA protocols were applied for the structure calculation of ten new CASD-NMR targets in a blind fashion, i.e. without knowing the actual solution. Even though optimisation of parameters and pre-filtering of unrefined NOE peak lists were necessary for half of the targets, ARIA consistently and reliably determined very precise and highly accurate structures for all cases. In the context of integrative structural biology, an increasing number of experimental methods are used that produce distance data for the determination of 3D structures of macromolecules, stressing the importance of methods that successfully make use of ambiguous and noisy distance data.", 
                "date": "2015-08-22T00:00:00Z", 
                "citationCount": 10, 
                "authors": [
                    {
                        "name": "Mareuil F."
                    }, 
                    {
                        "name": "Malliavin T.E."
                    }, 
                    {
                        "name": "Nilges M."
                    }, 
                    {
                        "name": "Bardiaux B."
                    }
                ], 
                "journal": "Journal of Biomolecular NMR"
            }
        }
    ], 
    "credit": [
        {
            "name": "Institut Pasteur", 
            "email": null, 
            "url": "http://aria.pasteur.fr/contact-info", 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Michael Nilges", 
            "email": "michael.nilges@pasteur.fr", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": "Benjamin Bardiaux", 
            "email": "benjamin.bardiaux@pasteur.fr", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }
    ], 
    "owner": "hmenager", 
    "additionDate": "2015-03-05T10:36:59Z", 
    "lastUpdate": "2019-10-23T09:32:36Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "bardiaux", 
            "khillion"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}