{"credit":[{"name":"DRCAT","typeRoles":[]},{"email":"info@ncbi.nlm.nih.gov","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.ncbi.nlm.nih.gov/books/NBK53758/"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Taxonomic classification","uri":"http://edamontology.org/operation_3460"},{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"}]},{"input":[{"data":{"term":"NCBI taxonomy ID","uri":"http://edamontology.org/data_1179"}}],"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}],"output":[{"data":{"term":"Taxonomy","uri":"http://edamontology.org/data_3028"},"format":[{"term":"HTML","uri":"http://edamontology.org/format_2331"}]}]}],"labels":{"collectionID":["DRCAT"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Taxonomy","uri":"http://edamontology.org/topic_0637"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"}]},"publication":[{"doi":"10.1093/nar/gkr1178","pmcid":"PMC3245000","pmid":"10592170","type":"Review"},{"abstract":"In addition to maintaining the GenBank® nucleic acid sequence database, the National Center for Biotechnology Information (NCBI) provides data analysis and retrieval and resources that operate on the data in GenBank and a variety of other biological data made available through NCBI's Web site. NCBI data retrieval resources include Entrez, PubMed, Locus Link and the Taxonomy Browser. Data analysis resources include BLAST, Electronic PCR, OrfFinder, RefSeq, UniGene, Database of Single Nucleotide Polymorphisms (dbSNP), Human Genome Sequencing pages, GeneMap'99, Davis Human-Mouse Homology Map, Cancer Chromosome Aberration Project (CCAP) pages, Entrez Genomes, Clusters of Orthologous Groups (COGs) database, Retroviral Genotyping Tools, Cancer Genome Anatomy Project (CGAP) pages, SAGEmap, Online Mendelian Inheritance in Man (OMIM) and the Molecular Modeling Database (MMDB). Augmenting many of the Web applications are custom implementations of the BLAST program optimized to search specialized data sets. All of the resources can be accessed through the NCBI home page at: http://www.ncbi.nlm.nih.gov.","authors":["Wheeler D.L.","Chappey C.","Lash A.E.","Leipe D.D.","Madden T.L.","Schuler G.D.","Tatusova T.A.","Rapp B.A."],"cit_count":364,"journal":"Nucleic Acids Research","pmid":"10592169","title":"Database resources of the National Center for Biotechnology Information","type":"Review","year":"2000-01-01"},{"abstract":"The NCBI Taxonomy database (http://www.ncbi.nlm.nih.gov/taxonomy) is the standard nomenclature and classification repository for the International Nucleotide Sequence Database Collaboration (INSDC), comprising the GenBank, ENA (EMBL) and DDBJ databases. It includes organism names and taxonomic lineages for each of the sequences represented in the INSDC's nucleotide and protein sequence databases. The taxonomy database is manually curated by a small group of scientists at the NCBI who use the current taxonomic literature to maintain a phylogenetic taxonomy for the source organisms represented in the sequence databases. The taxonomy database is a central organizing hub for many of the resources at the NCBI, and provides a means for clustering elements within other domains of NCBI web site, for internal linking between domains of the Entrez system and for linking out to taxon-specific external resources on the web. Our primary purpose is to index the domain of sequences as conveniently as possible for our user community.","authors":["Federhen S."],"cit_count":314,"journal":"Nucleic Acids Research","pmid":"22139910","title":"The NCBI Taxonomy database","type":"Primary","year":"2012-01-01"},{"abstract":"Entrez Gene (www.ncbi.nlm.nih.gov/entrez/query. fcgi?db=gene) is NCBI's database for gene-specific information. It does not include all known or predicted genes; instead Entrez Gene focuses on the genomes that have been completely sequenced, that have an active research community to contribute gene-specific information, or that are scheduled for intense sequence analysis. The content of Entrez Gene represents the result of curation and automated integration of data from NCBI's Reference Sequence project (RefSeq), from collaborating model organism databases, and from many other databases available from NCBI. Records are assigned unique, stable and tracked integers as identifiers. The content (nomenclature, map location, gene products and their attributes, markers, phenotypes, and links to citations, sequences, variation details, maps, expression, homologs, protein domains and external databases) is updated as new information becomes available. Entrez Gene is a step forward from NCBI's LocusLink, with both a major increase in taxonomic scope and improved access through the many tools associated with NCBI Entrez. © Oxford University Press 2005; all rights reserved.","authors":["Maglott D.","Ostell J.","Pruitt K.D.","Tatusova T."],"cit_count":613,"doi":"10.1093/nar/gki031","journal":"Nucleic Acids Research","title":"Entrez Gene: Gene-centered information at NCBI","type":"Review","year":"2005-01-01"}],"summary":{"biotoolsCURIE":"biotools:ncbi_taxonomy_database","biotoolsID":"ncbi_taxonomy_database","description":"Curated classification and nomenclature for all of the organisms in the public sequence databases. This currently represents about 10% of the described species of life on the planet.","homepage":"http://www.ncbi.nlm.nih.gov/Taxonomy","name":"NCBI Taxonomy Database"}}