{
    "additionDate": "2021-01-18T11:59:33Z",
    "biotoolsCURIE": "biotools:deepcirgo",
    "biotoolsID": "deepcirgo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangjp@csu.edu.cn",
            "name": "Jingpu Zhang",
            "orcidid": "https://orcid.org/0000-0002-8006-747X",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepciRGO is a computational method for microRNA Gene Ontology function prediction. It constructed a global heterogeneous network through circRNA co-expression, circRNA-protein association, and protein-protein interaction data. The potential network feature vector of the global network is extracted by Hin2vec and are further used for the construction of deep neural network classifier to predict circRNA Gene Ontology function.",
    "download": [
        {
            "type": "Source code",
            "url": "http://denglab.org/DeepciRGO/html/download/DeepciRGO.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://denglab.org/DeepciRGO/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T15:45:04Z",
    "name": "DeepciRGO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03748-3",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Circular RNAs (circRNAs) are special noncoding RNA molecules with closed loop structures. Compared with the traditional linear RNA, circRNA is more stable and not easily degraded. Many studies have shown that circRNAs are involved in the regulation of various diseases and cancers. Determining the functions of circRNAs in mammalian cells is of great significance for revealing their mechanism of action in physiological and pathological processes, diagnosis and treatment of diseases. However, determining the functions of circRNAs on a large scale is a challenging task because of the high experimental costs. Results: In this paper, we present a hierarchical deep learning model, DeepciRGO, which can effectively predict gene ontology functions of circRNAs. We build a heterogeneous network containing circRNA co-expressions, protein–protein interactions and protein–circRNA interactions. The topology features of proteins and circRNAs are calculated using a novel representation learning approach HIN2Vec across the heterogeneous network. Then, a deep multi-label hierarchical classification model is trained with the topology features to predict the biological process function in the gene ontology for each circRNA. In particular, we manually curated a benchmark dataset containing 185 GO annotations for 62 circRNAs, namely, circRNA2GO-62. The DeepciRGO achieves promising performance on the circRNA2GO-62 dataset with a maximum F-measure of 0.412, a recall score of 0.400, and an accuracy of 0.425, which are significantly better than other state-of-the-art RNA function prediction methods. In addition, we demonstrate the considerable potential of integrating multiple interactions and association networks. Conclusions: DeepciRGO will be a useful tool for accurately annotating circRNAs. The experimental results show that integrating multi-source data can help to improve the predictive performance of DeepciRGO. Moreover, The model also can combine RNA structure and sequence information to further optimize predictive performance.",
                "authors": [
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Lin W."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeepciRGO: functional prediction of circular RNAs through hierarchical deep neural networks using heterogeneous network features"
            },
            "pmcid": "PMC7659092",
            "pmid": "33183227"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}