{
    "additionDate": "2019-11-14T18:29:20Z",
    "biotoolsCURIE": "biotools:bioner",
    "biotoolsID": "bioner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kexu@nlsde.buaa.edu.cn",
            "name": "Ke Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "Multitask learning for biomedical named entity recognition with cross-sharing structure | This repository is a Biomedical Named Entity Recognition model. The code is based on XuezheMax/NeuroNLP2 | Python 3+, PyTorch < 1.0, Gensim >= 0.12.0 | In the root of the repository, first make the tmp directory:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JogleLew/bioner-cross-sharing",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-09T13:54:53.534613Z",
    "name": "BioNER",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3000-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Biomedical named entity recognition (BioNER) is a fundamental and essential task for biomedical literature mining, which affects the performance of downstream tasks. Most BioNER models rely on domain-specific features or hand-crafted rules, but extracting features from massive data requires much time and human efforts. To solve this, neural network models are used to automatically learn features. Recently, multi-task learning has been applied successfully to neural network models of biomedical literature mining. For BioNER models, using multi-task learning makes use of features from multiple datasets and improves the performance of models. Results: In experiments, we compared our proposed model with other multi-task models and found our model outperformed the others on datasets of gene, protein, disease categories. We also tested the performance of different dataset pairs to find out the best partners of datasets. Besides, we explored and analyzed the influence of different entity types by using sub-datasets. When dataset size was reduced, our model still produced positive results. Conclusion: We propose a novel multi-task model for BioNER with the cross-sharing structure to improve the performance of multi-task models. The cross-sharing structure in our model makes use of features from both datasets in the training procedure. Detailed analysis about best partners of datasets and influence between entity categories can provide guidance of choosing proper dataset pairs for multi-task training. Our implementation is available at https://github.com/JogleLew/bioner-cross-sharing.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Lyu J."
                    },
                    {
                        "name": "Dong L."
                    },
                    {
                        "name": "Xu K."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Multitask learning for biomedical named entity recognition with cross-sharing structure"
            },
            "pmcid": "PMC6697996",
            "pmid": "31419937"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}