{
    "additionDate": "2020-01-09T18:04:11Z",
    "biotoolsCURIE": "biotools:dockNmine",
    "biotoolsID": "dockNmine",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stephane.teletchea@univ-nantes.fr",
            "name": "Stéphane Téletchéa",
            "orcidid": "https://orcid.org/0000-0002-2402-028X",
            "typeEntity": "Person"
        }
    ],
    "description": "Web Portal to Assemble and Analyse Virtual and Experimental Interaction Data.\n\nThe dockNmine portal aims at gathering public and private data into a unique service. Automated queries on protein targets and ligand definitions are performed to Uniprot, PubChem and ChemBL to enhance the results of pre-computed docking experiments. When available, public data are automatically added to the docking results to produce state-of-the-art protein-ligand binding analysis such as ROC curves or enrichment analysis. Users can also upload their own private data to analyze them automatically",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.ufip.univ-nantes.fr/tools/docknmine/documentation"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://www.ufip.univ-nantes.fr/tools/docknmine/",
    "lastUpdate": "2020-12-22T10:04:11Z",
    "name": "dockNmine",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/IJMS20205062",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Scientists have to perform multiple experiments producing qualitative and quantitative data to determine if a compound is able to bind to a given target. Due to the large diversity of the potential ligand chemical space, the possibility of experimentally exploring a lot of compounds on a target rapidly becomes out of reach. Scientists therefore need to use virtual screening methods to determine the putative binding mode of ligands on a protein and then post-process the raw docking experiments with a dedicated scoring function in relation with experimental data. Two of the major difficulties for comparing docking predictions with experiments mostly come from the lack of transferability of experimental data and the lack of standardisation in molecule names. Although large portals like PubChem or ChEMBL are available for general purpose, there is no service allowing a formal expert annotation of both experimental data and docking studies. To address these issues, researchers build their own collection of data in flat files, often in spreadsheets, with limited possibilities of extensive annotations or standardisation of ligand descriptions allowing cross-database retrieval. We have conceived the dockNmine platform to provide a service allowing an expert and authenticated annotation of ligands and targets. First, this portal allows a scientist to incorporate controlled information in the database using reference identifiers for the protein (Uniprot ID) and the ligand (SMILES description), the data and the publication associated to it. Second, it allows the incorporation of docking experiments using forms that automatically parse useful parameters and results. Last, the web interface provides a lot of pre-computed outputs to assess the degree of correlations between docking experiments and experimental data.",
                "authors": [
                    {
                        "name": "Gheyouche E."
                    },
                    {
                        "name": "Launay R."
                    },
                    {
                        "name": "Lethiec J."
                    },
                    {
                        "name": "Labeeuw A."
                    },
                    {
                        "name": "Roze C."
                    },
                    {
                        "name": "Amosse A."
                    },
                    {
                        "name": "Teletchea S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Docknmine, a web portal to assemble and analyse virtual and experimental interaction data"
            },
            "pmcid": "PMC6829441",
            "pmid": "31614716"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}