{
    "additionDate": "2020-01-14T08:53:02Z",
    "biotoolsCURIE": "biotools:TSEA-DB",
    "biotoolsID": "TSEA-DB",
    "confidence_flag": "tool",
    "description": "a trait-tissue association map for human complex traits and diseases.\n\ndeTSDB, deTS, TSEA, tissue-specificity.\n\nTSEA-DB provides a comprehensive reference for trait-associated tissues. A systematic tissue-specific enrichment analysis (TSEA) has been conducted using deTS to infer tissues in which trait-associated genes are enriched. Two reference tissue panels are collected: the GTEx v7 panel (47 tissues) and the ENCODE panel (44 tissues). A total of 5019 GWAS summary statistics data sets for human complex traits and diseases (435 + 161 GWAS data sets from the non-UKBB panel and 4423 data sets from the UKBB panel) have been analyzed for their causal tissues.\n\nContent 1.\n\n1. Collection and processing of GWAS summary statistics for complex traits and diseases.\n\nThe Multi-Trait Collection (MTC) traits were previously reported in the work by Liu et al., 2019",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "https://bioinfo.uth.edu/TSEADB/",
    "lastUpdate": "2020-12-31T11:56:48Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://bioinfo.uth.edu/TSEADB/html/document.jsp"
        }
    ],
    "name": "TSEA-DB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ957",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Assessing the causal tissues of human traits and diseases is important for better interpreting trait-associated genetic variants, understanding disease etiology, and improving treatment strategies. Here, we present a reference database for trait-associated tissue specificity based on genome-wide association study (GWAS) results, named Tissue-Specific Enrichment Analysis DataBase (TSEA-DB, available at https://bioinfo.uth.edu/TSEADB/). We collected GWAS summary statistics data for a wide range of human traits and diseases followed by rigorous quality control. The current version of TSEA-DB includes 4423 data sets from the UK Biobank (UKBB) and 596 from other resources (GWAS Catalog and literature mining), totaling 5019 unique GWAS data sets and 15 770 trait-associated gene sets. TSEA-DB aims to provide reference tissue(s) enriched with the genes from GWAS. To this end, we systematically performed a tissue-specific enrichment analysis using our recently developed tool deTS and gene expression profiles from two reference tissue panels: the GTEx panel (47 tissues) and the ENCODE panel (44 tissues). The comprehensive trait-tissue association results can be easily accessed, searched, visualized, analyzed, and compared across the studies and traits through our web site. TSEA-DB represents one of the many timely and comprehensive approaches in exploring human trait-tissue association.",
                "authors": [
                    {
                        "name": "Jia P."
                    },
                    {
                        "name": "Dai Y."
                    },
                    {
                        "name": "Hu R."
                    },
                    {
                        "name": "Pei G."
                    },
                    {
                        "name": "Manuel A.M."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TSEA-DB: A trait-tissue association map for human complex traits and diseases"
            },
            "pmid": "31680168"
        }
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}