{"collectionID": [], "accessibility": [], "topic": [{"term": "Structure prediction", "uri": "http://edamontology.org/topic_0082"}, {"term": "Protein folds and structural domains", "uri": "http://edamontology.org/topic_0736"}, {"term": "Sequence sites, features and motifs", "uri": "http://edamontology.org/topic_0160"}, {"term": "Protein folding, stability and design", "uri": "http://edamontology.org/topic_0130"}, {"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "10526371", "type": null, "pmcid": null, "metadata": {"title": "CAFASP-1: Critical assessment of fully automated structure prediction methods", "abstract": "The results of the first Critical Assessment of Fully Automated Structure Prediction (CAFASP-1) are presented. The objective was to evaluate the success rates of fully automatic web servers for fold recognition which are available to the community. This study was based on the targets used in the third meeting on the Critical-Assessment of Techniques for Protein Structure Prediction (CASP-3). However, unlike CASP-3, the study was not a blind trial, as it was held after the structures of the targets were known. The aim was to assess the performance of methods without the user intervention that several groups used in their CASP-3 submissions. Although it is clear that 'human plus machine' predictions are superior to automated ones, this CAFASP-1 experiment is extremely valuable for users of our methods; it provides an indication of the performance of the methods alone, and not of the 'human plus machine' performance assessed in CASP. This information may aid users in choosing which programs they wish to use and in evaluating the reliability of the programs when applied to their specific prediction targets. In addition, evaluation of fully automated methods is particularly important to assess their applicability at genomic scales. For each target, groups submitted the top-ranking folds generated from their servers. In CAFASP-1 we concentrated on fold-recognition web servers only and evaluated only recognition of the correct fold, and not, as in CASP-3, alignment accuracy. Although some performance differences appeared within each of the four target categories used here, overall, no single server has proved markedly superior to the others. The results showed that current fully automated fold recognition servers can often identify remote similarities when pairwise sequence search methods fall. Nevertheless, in only a few cases outside the family-level targets has the score of the top-ranking fold been significant enough to allow for a confident fully automated prediction. Because the goals, rules, and procedures of CAFASP-1 were different from those used at CASP-3, the results reported here are not comparable with those reported in CASP-3. Nevertheless, it is clear that current automated fold recognition methods can not yet compete with 'human-expert plus machine' predictions. Finally, CAFASP-1 has been useful in identifying the requirements for a future blind trial of automated served-based protein structure prediction.", "citationCount": 167, "authors": [{"name": "Fischer D."}, {"name": "Barret C."}, {"name": "Bryson K."}, {"name": "Elofsson A."}, {"name": "Godzik A."}, {"name": "Jones D."}, {"name": "Karplus K.J."}, {"name": "Kelley L.A."}, {"name": "Maccallum R.M."}, {"name": "Pawowski K."}, {"name": "Rost B."}, {"name": "Rychlewski L."}, {"name": "Sternberg M."}], "date": "1999-01-01T00:00:00Z", "journal": "Proteins: Structure, Function and Genetics"}}, {"doi": null, "note": null, "version": null, "pmid": "10860755", "type": null, "pmcid": null, "metadata": {"title": "Enhanced genome annotation using structural profiles in the program 3D-PSSM", "abstract": "A method (three-dimensional position-specific scoring matrix, 3D-PSSM) to recognise remote protein sequence homologues is described. The method combines the power of multiple sequence profiles with knowledge of protein structure to provide enhanced recognition and thus functional assignment of newly sequenced genomes. The method uses structural alignments of homologous proteins of similar three-dimensional structure in the structural classification of proteins (SCOP) database to obtain a structural equivalence of residues. These equivalences are used to extend multiply aligned sequences obtained by standard sequence searches. The resulting large superfamily-based multiple alignment is converted into a PSSM. Combined with secondary structure matching and solvation potentials, 3D-PSSM can recognise structural and functional relationships beyond state-of-the-art sequence methods. In a cross-validated benchmark on 136 homologous relationships unambiguously undetectable by position-specific iterated basic local alignment search tool (PSI-Blast), 3D-PSSM can confidently assign 18%. The method was applied to the remaining unassigned regions of the Mycoplasma genitalium genome and an additional 13 regions were assigned with 95% confidence. 3D-PSSM is available to the community as a web server: http://www.bmm.icnet.uk/servers/3dpssm. (C) 2000 Academic Press.", "citationCount": 1097, "authors": [{"name": "Kelley L.A."}, {"name": "MacCallum R.M."}, {"name": "Sternberg M.J.E."}], "date": "2000-06-02T00:00:00Z", "journal": "Journal of Molecular Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Lawrence Kelley", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "L.A.Kelley@ic.ac.uk"}], "biotoolsCURIE": "biotools:3d-pssm", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.sbg.bio.ic.ac.uk/~3dpssm/index2.html", "function": [{"note": null, "input": [], "operation": [{"term": "Protein structural motif recognition", "uri": "http://edamontology.org/operation_0245"}, {"term": "Protein secondary structure prediction", "uri": "http://edamontology.org/operation_0267"}, {"term": "Protein fold recognition", "uri": "http://edamontology.org/operation_0303"}, {"term": "Protein structure prediction", "uri": "http://edamontology.org/operation_0474"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:55Z", "otherID": [], "description": "Protein fold recognition using 1d and 3d sequence profiles coupled with secondary structure and solvation potential information.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "3d-pssm", "additionDate": "2017-05-01T17:08:40Z", "name": "3D-pssm", "license": null, "documentation": [{"url": "http://www.sbg.bio.ic.ac.uk/~3dpssm/index2.html", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}