{
    "additionDate": "2018-07-31T11:53:53Z",
    "biotoolsCURIE": "biotools:mysyntenyportal",
    "biotoolsID": "mysyntenyportal",
    "credit": [
        {
            "email": "jbkim@konkuk.ac.kr",
            "name": "Jaebum Kim",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It is an easy-to-use application to build and publish websites for synteny block analyses by using users’ own genome sequences or synteny block definitions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/jkimlab/mySyntenyPortal/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jkimlab/mySyntenyPortal",
    "language": [
        "JavaScript",
        "PHP",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "mySyntenyPortal",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2219-x",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: Advances in sequencing technologies have facilitated large-scale comparative genomics based on whole genome sequencing. Constructing and investigating conserved genomic regions among multiple species (called synteny blocks) are essential in the comparative genomics. However, they require significant amounts of computational resources and time in addition to bioinformatics skills. Many web interfaces have been developed to make such tasks easier. However, these web interfaces cannot be customized for users who want to use their own set of genome sequences or definition of synteny blocks. Results: To resolve this limitation, we present mySyntenyPortal, a stand-alone application package to construct websites for synteny block analyses by using users' own genome data. mySyntenyPortal provides both command line and web-based interfaces to build and manage websites for large-scale comparative genomic analyses. The websites can be also easily published and accessed by other users. To demonstrate the usability of mySyntenyPortal, we present an example study for building websites to compare genomes of three mammalian species (human, mouse, and cow) and show how they can be easily utilized to identify potential genes affected by genome rearrangements. Conclusions: mySyntenyPortal will contribute for extended comparative genomic analyses based on large-scale whole genome sequences by providing unique functionality to support the easy creation of interactive websites for synteny block analyses from user's own genome data.",
                "authors": [
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Sim M."
                    },
                    {
                        "name": "Kwon D."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Ko Y."
                    },
                    {
                        "name": "Kim J."
                    }
                ],
                "date": "2018-06-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "mySyntenyPortal: An application package to construct websites for synteny block analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}