{
    "additionDate": "2021-03-19T09:08:38Z",
    "biotoolsCURIE": "biotools:geff",
    "biotoolsID": "geff",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gianluca.moro@unibo.it",
            "name": "Gianluca Moro",
            "typeEntity": "Person"
        }
    ],
    "description": "Gene function finding through cross-organism ensemble learning.\n\nGeFF (Gene Function Finder) is a Web-based portal providing an intuitive interface both to compute novel predicted annotations for multiple organisms (all organisms in the Entrez Gene database) and to browse a database of:.\n\nKnown annotations of the genes of all organisms in the Entrez Gene database to Gene Ontology (GO) terms describing the gene biological function features,.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "http://tiny.cc/geff/",
    "lastUpdate": "2021-03-26T09:18:05Z",
    "name": "GeFF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13040-021-00239-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Structured biological information about genes and proteins is a valuable resource to improve discovery and understanding of complex biological processes via machine learning algorithms. Gene Ontology (GO) controlled annotations describe, in a structured form, features and functions of genes and proteins of many organisms. However, such valuable annotations are not always reliable and sometimes are incomplete, especially for rarely studied organisms. Here, we present GeFF (Gene Function Finder), a novel cross-organism ensemble learning method able to reliably predict new GO annotations of a target organism from GO annotations of another source organism evolutionarily related and better studied. Results: Using a supervised method, GeFF predicts unknown annotations from random perturbations of existing annotations. The perturbation consists in randomly deleting a fraction of known annotations in order to produce a reduced annotation set. The key idea is to train a supervised machine learning algorithm with the reduced annotation set to predict, namely to rebuild, the original annotations. The resulting prediction model, in addition to accurately rebuilding the original known annotations for an organism from their perturbed version, also effectively predicts new unknown annotations for the organism. Moreover, the prediction model is also able to discover new unknown annotations in different target organisms without retraining.We combined our novel method with different ensemble learning approaches and compared them to each other and to an equivalent single model technique. We tested the method with five different organisms using their GO annotations: Homo sapiens, Mus musculus, Bos taurus, Gallus gallus and Dictyostelium discoideum. The outcomes demonstrate the effectiveness of the cross-organism ensemble approach, which can be customized with a trade-off between the desired number of predicted new annotations and their precision.A Web application to browse both input annotations used and predicted ones, choosing the ensemble prediction method to use, is publicly available at http://tiny.cc/geff/. Conclusions: Our novel cross-organism ensemble learning method provides reliable predicted novel gene annotations, i.e., functions, ranked according to an associated likelihood value. They are very valuable both to speed the annotation curation, focusing it on the prioritized new annotations predicted, and to complement known annotations available.",
                "authors": [
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Moro G."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BioData Mining",
                "title": "Gene function finding through cross-organism ensemble learning"
            },
            "pmcid": "PMC7879670",
            "pmid": "33579334"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
