{
    "additionDate": "2021-06-14T13:42:17Z",
    "biotoolsCURIE": "biotools:celluloid",
    "biotoolsID": "celluloid",
    "confidence_flag": "tool",
    "description": "Celluloid is a tool for clustering single cell sequencing data around centroids.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AlgoLab/celluloid/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-08-20T05:54:33.354894Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/AlgoLab/celluloid/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/celluloid-clust/"
        }
    ],
    "name": "celluloid",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/JBHI.2021.3081380",
            "metadata": {
                "abstract": "IEEESingle cell sequencing (SCS) technologies provide a level of resolution that makes it indispensable for inferring from a sequenced tumor, evolutionary trees or phylogenies representing an accumulation of cancerous mutations. A drawback of SCS is elevated false negative and missing value rates, resulting in a large space of possible solutions, which in turn makes it difficult, sometimes infeasible using current approaches and tools. One possible solution is to reduce the size of an SCS instance --- usually represented as a matrix of presence, absence, and uncertainty of the mutations found in the different sequenced cells --- and to infer the tree from this reduced-size instance. In this work, we present a new clustering procedure aimed at clustering such categorical vector, or matrix data --- here representing SCS instances, called celluloid. We show that celluloid clusters mutations with high precision: never pairing too many mutations that are unrelated in the ground truth, but also obtains accurate results in terms of the phylogeny inferred downstream from the reduced instance produced by this method. We demonstrate the usefulness of a clustering step by applying the entire pipeline (clustering + inference method) to a real dataset, showing a significant reduction in the runtime, raising considerably the upper bound on the size of SCS instances which can be solved in practice. Our approach, celluloid: clustering single cell sequencing data around centroids is available at https://github.com/AlgoLab/celluloid/ under an MIT license, as well as on the Python Package Index (PyPI) at https://pypi.org/project/celluloid-clust/",
                "authors": [
                    {
                        "name": "Ciccolella S."
                    },
                    {
                        "name": "Patterson M."
                    },
                    {
                        "name": "Bonizzoni P."
                    },
                    {
                        "name": "Della Vedova G."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "Effective Clustering for Single Cell Sequencing Cancer Data"
            },
            "pmid": "34003758",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}