{
    "accessibility": "Open access",
    "additionDate": "2021-11-11T19:40:59.378481Z",
    "biotoolsCURIE": "biotools:ivterm",
    "biotoolsID": "ivterm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ccwei@sjtu.edu.cn",
            "name": "Chaochun Wei",
            "orcidid": "https://orcid.org/0000-0002-1031-034X"
        }
    ],
    "description": "R package for interactive visualization of functional analysis results of meta-omics data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SJTU-CGM/ivTerm",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-11T19:40:59.381273Z",
    "name": "ivTerm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/JCB.30019",
            "metadata": {
                "abstract": "© 2021 Wiley Periodicals LLCInterpreting functional analysis results derived from environmental samples using direct sequencing meta-omics data, including metagenomics and meta-transcriptomics data, is challenging due to their complexity. Visualization of functional analysis results can help researchers discover relevant biological insights. Despite the availability of many R packages, there lacks interactive and comprehensive graphic systems for displaying functional terms and corresponding genes in meta-omics analysis results. Here, we present ivTerm, an R-shiny package with a user-friendly graphical interface that enables users to inspect functional annotations, compare results across multiple experiments, create customized charts, and download these charts. It provides various basic and innovative chart types to visualize functional terms and involved genes. Users can also browse the description of terms obtained from the database web servers automatically. Two examples, including a metagenome analysis data for human gut and a meta-transcriptome data for coral symbiomes, are given to show the usage of ivTerm. In the end, we compared ivTerm with existing tools with similar functions, such as GOplot, ViSEAGO, and Chordomics. The tool ivTerm is convenient and efficient for biologists to gain an integrated view and develop deep insights by interactive analysis of meta-omics data. It can accelerate the procedure to develop insights from complex meta-omics data. The code for ivTerm is freely available at https://github.com/SJTU-CGM/ivTerm.",
                "authors": [
                    {
                        "name": "Dong X."
                    },
                    {
                        "name": "Wei C."
                    },
                    {
                        "name": "Xue H."
                    }
                ],
                "date": "2021-10-01T00:00:00Z",
                "journal": "Journal of Cellular Biochemistry",
                "title": "ivTerm—An R package for interactive visualization of functional analysis results of meta-omics data"
            },
            "pmid": "34132422"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        }
    ],
    "validated": 1
}
