{
    "additionDate": "2018-05-03T12:46:50Z",
    "biotoolsCURIE": "biotools:seda",
    "biotoolsID": "seda",
    "collectionID": [
        "FASTA utility"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "seda@sing.ei.uvigo.es",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.sing-group.org/seda/about.html"
        }
    ],
    "description": "SEDA (SEquence DAtaset builder) is an open source application for processing FASTA files containing DNA and protein sequences.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.sing-group.org/seda/manual/index.html"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "http://www.sing-group.org/seda/download.html"
        }
    ],
    "editPermission": {
        "authors": [
            "jbvieira"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Sequence editing",
                    "uri": "http://edamontology.org/operation_0231"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.sing-group.org/seda/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-10-22T09:14:22Z",
    "license": "GPL-3.0",
    "maturity": "Emerging",
    "name": "SEDA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hlfernandez@uvigo.es",
    "publication": [
        {
            "doi": "10.1007/s12539-018-0312-5",
            "metadata": {
                "abstract": "© 2018, International Association of Scientists in the Interdisciplinary Areas.Useful insight into the evolution of genes and gene families can be provided by the analysis of all available genome datasets rather than just a few, which are usually those of model species. Handling and transforming such datasets into the desired format for downstream analyses is, however, often a difficult and time-consuming task for researchers without a background in informatics. Therefore, we present two simple and fast protocols for data preparation, using an easy-to-install, open-source, cross-platform software application with user-friendly, rich graphical user interface (SEDA; http://www.sing-group.org/seda/index.html). The first protocol is a substantial improvement over one recently published (López-Fernández et al. Practical applications of computational biology and bioinformatics, 12th International conference. Springer, Cham, pp 88–96 (2019)[1]), which was used to study the evolution of GULO, a gene that encodes the enzyme responsible for the last step of vitamin C synthesis. In this paper, we show how the sequence data file used for the phylogenetic analyses can now be obtained much faster by changing the way coding sequence isoforms are removed, using the newly implemented SEDA operation “Remove isoforms”. This protocol can be used to easily show that putative functional GULO genes are present in several Prostotomian groups such as Molluscs, Priapulida and Arachnida. Such findings could have been easily missed if only a few Protostomian model species had been used. The second protocol allowed us to identify positively selected amino acid sites in a set of 19 primate HLA immunity genes. Interestingly, the proteins encoded by MHC class II genes can show just as many positively selected amino acid sites as those encoded by classical MHC class I genes. Although a significant percentage of codons, which can be as high as 14.8%, are evolving under positive selection, the main mode of evolution of HLA immunity genes is purifying selection. Using a large number of primate species, the probability of missing the identification of positively selected amino acid sites is lower. Both projects were performed in less than one week, and most of the time was spent running the analyses rather than preparing the files. Such protocols can be easily adapted to answer many other questions using a phylogenetic approach.",
                "authors": [
                    {
                        "name": "Lopez-Fernandez H."
                    },
                    {
                        "name": "Duque P."
                    },
                    {
                        "name": "Henriques S."
                    },
                    {
                        "name": "Vazquez N."
                    },
                    {
                        "name": "Fdez-Riverola F."
                    },
                    {
                        "name": "Vieira C.P."
                    },
                    {
                        "name": "Reboiro-Jato M."
                    },
                    {
                        "name": "Vieira J."
                    }
                ],
                "citationCount": 7,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "Bioinformatics Protocols for Quickly Obtaining Large-Scale Data Sets for Phylogenetic Inferences"
            },
            "pmid": "30511150",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        }
    ],
    "validated": 1,
    "version": [
        "0.5.0"
    ]
}