{
    "additionDate": "2017-12-18T00:06:25Z",
    "biotoolsCURIE": "biotools:faapred",
    "biotoolsID": "faapred",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.icgeb.res.in/"
        }
    ],
    "description": "FaaPred is a SVM-based prediction method for fungal adhesins and adhesin-like proteins",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinfo.icgeb.res.in/faap/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.icgeb.res.in/faap/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/faapred-fungal-adhesins-and-adhesin-like-proteins-predictor.html"
        }
    ],
    "name": "FaaPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0009695",
            "metadata": {
                "abstract": "Adhesion constitutes one of the initial stages of infection in microbial diseases and is mediated by adhesins. Hence, identification and comprehensive knowledge of adhesins and adhesin-like proteins is essential to understand adhesin mediated pathogenesis and how to exploit its therapeutic potential. However, the knowledge about fungal adhesins is rudimentary compared to that of bacterial adhesins. In addition to host cell attachment and mating, the fungal adhesins play a significant role in homotypic and xenotypic aggregation, foraging and biofilm formation. Experimental identification of fungal adhesins is labor- as well as time-intensive. In this work, we present a Support Vector Machine (SVM) based method for the prediction of fungal adhesins and adhesin-like proteins. The SVM models were trained with different compositional features, namely, amino acid, dipeptide, multiplet fractions, charge and hydrophobic compositions, as well as PSI-BLAST derived PSSM matrices. The best classifiers are based on compositional properties as well as PSSM and yield an overall accuracy of 86%. The prediction method based on best classifiers is freely accessible as a world wide web based server at http://bioinfo.icgeb.res.in/ faap. This work will aid rapid and rational identification of fungal adhesins, expedite the pace of experimental characterization of novel fungal adhesins and enhance our knowledge about role of adhesins in fungal infections. © 2010 Ramana, Gupta.",
                "authors": [
                    {
                        "name": "Ramana J."
                    },
                    {
                        "name": "Gupta D."
                    }
                ],
                "citationCount": 30,
                "date": "2010-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FaaPred: A SVM-based prediction method for fungal adhesins and adhesin-like proteins"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}