{
    "additionDate": "2018-05-20T09:04:19Z",
    "biotoolsCURIE": "biotools:pse-in-one",
    "biotoolsID": "pse-in-one",
    "credit": [
        {
            "email": "bliu@hit.edu.cn",
            "name": "Bin Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web server for generating various modes of pseudo components of DNA, RNA, and protein sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.hitsz.edu.cn/Pse-in-One/doc/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.hitsz.edu.cn/Pse-in-One/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "Pse-in-One",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1093/NAR/GKV458",
            "metadata": {
                "abstract": "© 2015 The Author(s).With the avalanche of biological sequences generated in the post-genomic age, one of the most challenging problems in computational biology is how to effectively formulate the sequence of a biological sample (such as DNA, RNA or protein) with a discrete model or a vector that can effectively reflect its sequence pattern information or capture its key features concerned. Although several web servers and stand-alone tools were developed to address this problem, all these tools, however, can only handle one type of samples. Furthermore, the number of their built-in properties is limited, and hence it is often difficult for users to formulate the biological sequences according to their desired features or properties. In this article, with a much larger number of built-in properties, we are to propose a much more flexible web server called Pse-in-One (http://bioinformatics.hitsz.edu.cn/Pse-in-One/), which can, through its 28 different modes, generate nearly all the possible feature vectors for DNA, RNA and protein sequences. Particularly, it can also generate those feature vectors with the properties defined by users themselves. These feature vectors can be easily combinedwith machine-learning algorithms to develop computational predictors and analysis methods for various tasks in bioinformatics and system biology. It is anticipated that the Pse-in-One web server will become a very useful tool in computational proteomics, genomics, as well as biological sequence analysis. Moreover, to maximize users' convenience, its stand-alone version can also be downloaded from http://bioinformatics.hitsz.edu.cn/Pse-in-One/download/, and directly run on Windows, Linux, Unix and Mac OS.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Fang L."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 565,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Pse-in-One: A web server for generating various modes of pseudo components of DNA, RNA, and protein sequences"
            },
            "pmcid": "PMC4489303",
            "pmid": "25958395"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
