{
    "additionDate": "2019-11-14T18:47:52Z",
    "biotoolsCURIE": "biotools:GBS",
    "biotoolsID": "GBS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "francois.belzile@fsaa.ulaval.ca",
            "name": "François Belzile",
            "orcidid": "https://orcid.org/0000-0001-6893-4529",
            "typeEntity": "Person"
        }
    ],
    "description": "Screening populations for copy number variation using genotyping-by-sequencing | Detection of deletions and duplications from GBS data | delgbs is an R package which provides tools for detecting copy number variation from genotyping-by-sequencing (GBS) data. delgbs bases its CNV calls on the number of reads per sample in discrete bins (e.g. 1-kb bins) located along a reference genome",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "http://github.com/malemay/delgbs",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-02T19:46:26Z",
    "license": "GPL-3.0",
    "name": "GBS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-5998-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The effective use of mutant populations for reverse genetic screens relies on the population-wide characterization of the induced mutations. Genome- and population-wide characterization of the mutations found in fast neutron populations has been hindered, however, by the wide range of mutations generated and the lack of affordable technologies to detect DNA sequence changes. In this study, we therefore aimed to test whether genotyping-by-sequencing (GBS) technology could be used to characterize copy number variation (CNV) induced by fast neutrons in a soybean mutant population. Results: We called CNVs from GBS data in 79 soybean mutants and assessed the sensitivity and precision of this approach by validating our results against array comparative genomic hybridization (aCGH) data for 19 of these mutants as well as targeted PCR and ddPCR assays for a representative subset of the smallest events detected by GBS. Our GBS pipeline detected 55 of the 96 events found by aCGH, with approximate detection thresholds of 60 kb, 500 kb and 1 Mb for homozygous deletions, hemizygous deletions and duplications, respectively. Among the whole set of 79 mutants, the GBS data revealed 105 homozygous deletions, 32 hemizygous deletions and 19 duplications. This included several extremely large events, exhibiting maximum sizes of ~ 11.2 Mb for a homozygous deletion, ~ 11.6 Mb for a hemizygous deletion, and ~ 50 Mb for a duplication. Conclusions: This study provides a proof of concept that GBS can be used as an affordable high-throughput method for assessing CNVs in fast neutron mutants. The modularity of this GBS approach allows combining as many different libraries or sequencing runs as is necessary for reaching the goals of a particular study. This method should enable the low-cost genome-wide characterization of hundreds to thousands of individuals in fast neutron mutant populations or any population with large genomic deletions and duplications.",
                "authors": [
                    {
                        "name": "Belzile F."
                    },
                    {
                        "name": "Boyle B."
                    },
                    {
                        "name": "Lemay M.-A."
                    },
                    {
                        "name": "Rigaill G."
                    },
                    {
                        "name": "Stec A.O."
                    },
                    {
                        "name": "Stupar R.M."
                    },
                    {
                        "name": "Torkamaneh D."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-06T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Screening populations for copy number variation using genotyping-by-sequencing: A proof of concept using soybean fast neutron mutants"
            },
            "pmcid": "PMC6683502",
            "pmid": "31387530"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
