
{
    "credit": [
        {
            "email": "anthony.mathelier@ncmm.uio.no",
            "name": "Anthony Mathelier",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "aziz.khan@ncmm.uio.no",
            "name": "Aziz Khan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://jaspar.genereg.net/api/v1/docs/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "JASPAR"
        ],
        "language": [
            "Python"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web API"
        ],
        "topic": [
            {
                "term": "Data acquisition",
                "uri": "http://edamontology.org/topic_3077"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com. JASPAR is a widely used open-access database of curated, non-redundant transcription factor binding profiles. Currently, data from JASPAR can be retrieved as flat files or by using programming language-specific interfaces. Here, we present a programming language-independent application programming interface (API) to access JASPAR data using the Representational State Transfer (REST) architecture. The REST API enables programmatic access to JASPAR by most programming languages and returns data in eight widely used formats. Several endpoints are available to access the data and an endpoint is available to infer the TF binding profile(s) likely bound by a given DNA binding domain protein sequence. Additionally, it provides an interactive browsable interface for bioinformatics tool developers. Availability and implementation This REST API is implemented in Python using the Django REST Framework. It is accessible at http://jaspar.genereg.net/api/ and the source code is freely available at https://bitbucket.org/CBGR/jaspar under GPL v3 license. Contact aziz.khan@ncmm.uio.no or anthony.mathelier@ncmm.uio.no Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Khan A.",
                "Mathelier A."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btx804",
            "journal": "Bioinformatics",
            "title": "JASPAR RESTful API: Accessing JASPAR data from any programming language",
            "year": "2018-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:jaspar_api",
        "biotoolsID": "jaspar_api",
        "description": "Widely used open-access database of curated, non-redundant transcription factor binding profiles. Currently, data from JASPAR can be retrieved as flat files or by using programming language-specific interfaces. Here, we present a programming language-independent application programming interface (API) to access JASPAR data using the Representational State Transfer (REST) architecture.",
        "homepage": "http://jaspar.genereg.net/api/",
        "name": "JASPAR RESTful API"
    }
}