
{
    "credit": [
        {
            "email": "dbarash@cs.bgu.ac.il",
            "name": "Barash D.",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.cs.bgu.ac.il/incaRNAfbinv/Help.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid design",
                    "uri": "http://edamontology.org/operation_3095"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research. In recent years, new methods for computational RNA design have been developed and applied to various problems in synthetic biology and nanotechnology. Lately, there is considerable interest in incorporating essential biological information when solving the inverse RNA folding problem. Correspondingly, RNAfbinv aims at including biologically meaningful constraints and is the only program to-date that performs a fragment-based design of RNA sequences. In doing so it allows the design of sequences that do not necessarily exactly fold into the target, as long as the overall coarse-grained tree graph shape is preserved. Augmented by the weighted sampling algorithm of incaRNAtion, our web server called incaRNAfbinv implements the method devised in RNAfbinv and offers an interactive environment for the inverse folding of RNA using a fragment-based design approach. It takes as input: a target RNA secondary structure; optional sequence and motif constraints; optional target minimum free energy, neutrality and GC content. In addition to the design of synthetic regulatory sequences, it can be used as a pre-processing step for the detection of novel natural occurring RNAs. The two complementary methodologies RNAfbinv and incaRNAtion are merged together and fully implemented in our web server incaRNAfbinv, available at http://www.cs.bgu.ac.il/incaRNAfbinv.",
            "authors": [
                "Drory Retwitzer M.",
                "Reinharz V.",
                "Ponty Y.",
                "Waldispuhl J.",
                "Barash D."
            ],
            "cit_count": 2,
            "doi": "10.1093/NAR/GKW440",
            "journal": "Nucleic acids research",
            "pmid": "27185893",
            "title": "incaRNAfbinv: a web server for the fragment-based design of RNA sequences",
            "year": "2016-07-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:incarnafbinv",
        "biotoolsID": "incarnafbinv",
        "description": "Fragment-based design of RNA sequences.",
        "homepage": "https://www.cs.bgu.ac.il/incaRNAfbinv/",
        "name": "incaRNAfbinv"
    }
}