{
    "additionDate": "2017-01-17T15:05:35Z",
    "biotoolsCURIE": "biotools:roleswitch",
    "biotoolsID": "roleswitch",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "yueli@cs.toronto.edu",
            "name": "Yue Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Infer Probabilities of MiRNA-mRNA Interaction Signature (ProMISe) using paired expression data from a single sample. It operates in two phases by inferring the probability of mRNA being the targets of miRNA, considering the expression of all the mRNAs due to their potential competition for the same miRNA. It assumes that the total transcribed mRNA levels are higher than the observed mRNA levels and iteratively updates the total transcription of each mRNA targets based on the above inference.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/Roleswitch.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/Roleswitch_1.12.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/Roleswitch.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T05:08:56Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.cs.utoronto.ca/~yueli/roleswitch.html"
        }
    ],
    "name": "Roleswitch",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gku182",
            "metadata": {
                "abstract": "Aberrant microRNA (miRNA) expression is implicated in tumorigenesis. The underlying mechanisms are unclear because the regulations of each miRNA on potentially hundreds of mRNAs are sample specific. We describe a novel approach to infeŕ Probabilistić MiRNA-mRNA Interaction Signature ('ProMISe') from a single pair of miRNA-mRNA expression profile. Our model considers mRNA and miRNA competition as a probabilistic function of the expressed seeds (matches). To demonstrate ProMISe, we extensively exploited The Cancer Genome Atlaś data. As a target predictor, ProMISe identifies more confidence/validated targets than other methods. Importantly, ProMISe confers higher cancer diagnostic power than using expression profiles alone. Gene set enrichment analysis on averaged ProMISe uniquely revealed respective target enrichments of oncomirs miR-21 and 145 in glioblastoma and ovarian cancers. Moreover, comparing matched breast (BRCA) and thyroid (THCA) tumor/normal samples uncovered thousands of tumor-related interactions. For example, ProMISe-BRCA network involves miR-155/183/21, which exhibits higher ProMISe coupled with coherently higher miRNA expression and lower target expression; oncomirs miR-221/222 in the ProMISe-THCA network engage with many downregulated target genes. Together, our probabilistic approach of integrating expression and sequence scores establishes a functional link between the aberrant miRNA and mRNA expression, which was previouslý under-appreciated due to the methodological differences. © 2014 The Author(s) 2014.",
                "authors": [
                    {
                        "name": "Jin K."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liang C."
                    },
                    {
                        "name": "Wong K.-C."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 32,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Inferring probabilistic miRNA-mRNA interaction signatures in cancers: a role-switch approach"
            },
            "pmcid": "PMC4027195",
            "pmid": "24609385",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "1.12.0"
    ]
}
