{
    "additionDate": "2019-11-14T18:39:59Z",
    "biotoolsCURIE": "biotools:JabberDock",
    "biotoolsID": "JabberDock",
    "confidence_flag": "tool",
    "description": "Protein Docking Using a Single Representation for Protein Surface, Electrostatics, and Local Dynamics | protein docking using a density-based descriptor for atoms charge and dynamics | JabberDock provides a mechanism to dock two protein STID maps together in conjunction with the POW engine and BioBox | Shipped with this version of JabberDock is a heavily stripped version of biobox containing the functions JabberDock requires. Please move the biobox folder into whatever directory you like (e.g. your home), just make sure it's in your pythonpath There is a readme file in the biobox folder containing instructions on requirements and installation instructions",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "http://github.com/degiacom/JabberDock",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:55:13.657506Z",
    "license": "GPL-3.0",
    "name": "JabberDock",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.jctc.9b00474",
            "metadata": {
                "abstract": "Predicting the assembly of multiple proteins into specific complexes is critical to understanding their biological function in an organism and thus the design of drugs to address their malfunction. Proteins are flexible molecules, which inherently pose a problem to any protein docking computational method, where even a simple rearrangement of the side chain and backbone atoms at the interface of binding partners complicates the successful determination of the correct docked pose. Herein, we present a means of representing protein surface, electrostatics, and local dynamics within a single volumetric descriptor. We show that our representations can be physically related to the surface-accessible solvent area and mass of the protein. We then demonstrate that the application of this representation into a protein-protein docking scenario bypasses the need to compensate for, and predict, specific side chain packing at the interface of binding partners. This representation is leveraged in our de novo protein docking software, JabberDock, which can accurately and robustly predict difficult target complexes with an average success rate of >54%, which is comparable to or greater than the currently available methods.",
                "authors": [
                    {
                        "name": "Degiacomi M.T."
                    },
                    {
                        "name": "Rudden L.S.P."
                    }
                ],
                "citationCount": 12,
                "date": "2019-09-10T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "Protein Docking Using a Single Representation for Protein Surface, Electrostatics, and Local Dynamics"
            },
            "pmcid": "PMC7007192",
            "pmid": "31390206"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1
}
