{"credit":[{"name":"Bastian Greshake","typeRoles":[]},{"name":"Philipp E. Bayer","typeRoles":[]},{"name":"Helge Rausch","typeRoles":[]},{"name":"Julia Reda","typeRoles":[]},{"email":"info@opensnp.org","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"input":[{"data":{"term":"Sequence variations","uri":"http://edamontology.org/data_3498"}}],"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"}]}],"labels":{"cost":"Free of charge","language":["Ruby"],"license":"MIT","toolType":["Database portal"],"topic":[{"term":"Human genetics","uri":"http://edamontology.org/topic_3574"}]},"link":[{"note":"Main website","type":"OTHER","url":"https://www.opensnp.org"},{"note":"Source-code","type":"REPOSITORY","url":"https://github.com/opensnp/snpr"}],"publication":[{"abstract":"Genome-Wide Association Studies are widely used to correlate phenotypic traits with genetic variants. These studies usually compare the genetic variation between two groups to single out certain Single Nucleotide Polymorphisms (SNPs) that are linked to a phenotypic variation in one of the groups. However, it is necessary to have a large enough sample size to find statistically significant correlations. Direct-To-Consumer (DTC) genetic testing can supply additional data: DTC-companies offer the analysis of a large amount of SNPs for an individual at low cost without the need to consult a physician or geneticist. Over 100,000 people have already been genotyped through Direct-To-Consumer genetic testing companies. However, this data is not public for a variety of reasons and thus cannot be used in research. It seems reasonable to create a central open data repository for such data. Here we present the web platform openSNP, an open database which allows participants of Direct-To-Consumer genetic testing to publish their genetic data at no cost along with phenotypic information. Through this crowdsourced effort of collecting genetic and phenotypic information, openSNP has become a resource for a wide area of studies, including Genome-Wide Association Studies. openSNP is hosted at http://www.opensnp.org, and the code is released under MIT-license at http://github.com/gedankenstuecke/snpr. © 2014 Greshake et al.","authors":["Greshake B.","Bayer P.E.","Rausch H.","Reda J."],"cit_count":19,"doi":"10.1371/journal.pone.0089204","journal":"PLoS ONE","pmid":"24647222","title":"openSNP-A crowdsourced web resource for personal genomics","year":"2014-03-19"}],"summary":{"biotoolsCURIE":"biotools:opensnp","biotoolsID":"opensnp","description":"openSNP allows customers of direct-to-customer genetic tests to publish their test results, find others with similar genetic variations, learn more about their results by getting the latest primary literature on their variations, and help scientists find new associations.","homepage":"https://www.opensnp.org","name":"openSNP","version":["v1.0"]}}