{
    "additionDate": "2017-12-18T00:07:43Z",
    "biotoolsCURIE": "biotools:integron_gene_fetch",
    "biotoolsID": "integron_gene_fetch",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mendel.informatics.indiana.edu/~yye/lab/index.php"
        }
    ],
    "description": "integron_gene_fetch is developed to get integron genes from metagenomic sequencing reads. It is capable of getting the integron mobile genes more efficiently, as these genes are extremely difficult to be detected in whole-genome assembly.  By assembling the dataset and traces all potential paths between any two contigs that consist of recombination sites, the integron_gene_fetch tool is able to get more integron genes given a pre-determined set of recombination site sequences.",
    "documentation": [
        {
            "type": "General",
            "url": "http://omics.informatics.indiana.edu/integron/instruction.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "http://omics.informatics.indiana.edu/integron/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/integron_gene_fetch-1-0-discovery-chromosomal-integrons-metagenomic-sequences.html"
        }
    ],
    "name": "integron_gene_fetch",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1128/AEM.00564-12",
            "metadata": {
                "abstract": "The NIH Human Microbiome Project (HMP) has produced several hundred metagenomic data sets, allowing studies of the many functional elements in human-associated microbial communities. Here, we survey the distribution of oral spirochetes implicated in dental diseases in normal human individuals, using recombination sites associated with the chromosomal integron in Treponema genomes, taking advantage of the multiple copies of the integron recombination sites (repeats) in the genomes, and using a targeted assembly approach thatwe have developed. We find that integron-containing Treponema species are present in 80%of the normal human subjects included in the HMP. Further, we are able to de novo assemble the integron gene cassettes using our constrained assembly approach, which employs a unique application of the de Bruijn graph assembly information;most of these cassette genes were not assembled in whole-metagenome assemblies and could not be identified by mapping sequencing reads onto the known reference Treponema genomes due to the dynamic nature of integron gene cassettes. Our studysignificantly enriches the gene pool known to be carried by Treponema chromosomal integrons, totaling 826 (598 97% nonredundant) enes. We characterize the functions of these gene cassettes: many of these genes have unknown functions. The integron gene cassette arrays found in the human microbiome are extraordinarily dynamic, with different microbial communities sharing only a small number of common genes. © 2012, American Society for Microbiology.",
                "authors": [
                    {
                        "name": "Wu Y.-W."
                    },
                    {
                        "name": "Rho M."
                    },
                    {
                        "name": "Doak T.G."
                    },
                    {
                        "name": "Ye Y."
                    }
                ],
                "citationCount": 10,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Applied and Environmental Microbiology",
                "title": "Oral spirochetes implicated in dental diseases are widespread in normal human subjects and carry extremely diverse integron gene cassettes"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}