
{
    "credit": [
        {
            "email": "zacharyfoster1989@gmail.com",
            "name": "Zachary Foster",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/ropensci/taxa/issues"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://cran.r-project.org/web/packages/taxa/taxa.pdf"
        },
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/taxa/vignettes/taxa-introduction.html"
        }
    ],
    "download": [
        {
            "url": "https://cran.r-project.org/src/contrib/taxa_0.3.1.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "CRAN"
        ],
        "language": [
            "R"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://cran.r-project.org/web/packages/taxa/index.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 Foster ZSL et al. The taxa R package provides a set of tools for defining and manipulating taxonomic data. The recent and widespread application of DNA sequencing to community composition studies is making large data sets with taxonomic information commonplace. However, compared to typical tabular data, this information is encoded in many different ways and the hierarchical nature of taxonomic classifications makes it difficult to work with. There are many R packages that use taxonomic data to varying degrees but there is currently no cross-package standard for how this information is encoded and manipulated. We developed the R package taxa to provide a robust and flexible solution to storing and manipulating taxonomic data in R and any application-specific information associated with it. Taxa provides parsers that can read common sources of taxonomic information (taxon IDs, sequence IDs, taxon names, and classifications) from nearly any format while preserving associated data. Once parsed, the taxonomic data and any associated data can be manipulated using a cohesive set of functions modeled after the popular R package dplyr. These functions take into account the hierarchical nature of taxa and can modify the taxonomy or associated data in such a way that both are kept in sync. Taxa is currently being used by the metacoder and taxize packages, which provide broadly useful functionality that we hope will speed adoption by users and developers.",
            "authors": [
                "Grunwald N.J.",
                "Foster Z.S.L.",
                "Chamberlain S."
            ],
            "cit_count": 0,
            "doi": "10.12688/f1000research.14013.1",
            "journal": "F1000Research",
            "title": "Taxa: An R package implementing data standards and methods for taxonomic data",
            "type": "Primary",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:taxa",
        "biotoolsID": "taxa",
        "description": "Define and manipulate taxonomic data.  Robust and flexible solution to storing and manipulating taxonomic data and any application-specific information associated with it. It provides parsers that can read common sources of taxonomic information from nearly any format while preserving associated data. It takes into account the hierarchical nature of taxa and can modify the taxonomy or associated data in such a way that both are kept in sync.",
        "homepage": "https://github.com/ropensci/taxa",
        "name": "Taxa",
        "version": [
            "0.3.1"
        ]
    }
}