{
    "additionDate": "2017-08-03T18:54:15Z",
    "biotoolsCURIE": "biotools:plato",
    "biotoolsID": "plato",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ritchielab.psu.edu/contact-us"
        }
    ],
    "description": "System for the analysis of genome-wide association data that will incorporate several analytical approaches as filters to allow a scientist to choose whatever analytical methods they wish to apply. It was designed to aid in retrieving, evaluating, formatting, and analyzing genotypic and clinical data from the latest large-scale genotyping studies. It also implements a battery of quality control procedures to assess the data.",
    "documentation": [
        {
            "type": "General",
            "url": "http://ritchielab.psu.edu/files/RL_software/plato-manual-2.1.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "http://ritchielab.psu.edu/software/plato-download",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/plato-1-1-analysis-genome-wide-association-data.html"
        }
    ],
    "name": "PLATO",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The methods to detect gene-gene interactions between variants in genome-wide association study (GWAS) datasets have not been well developed thus far. PLATO, the Platform for the Analysis, Translation and Organization of large-scale data, is a filter-based method bringing together many analytical methods simultaneously in an effort to solve this problem. PLATO filters a large, genomic dataset down to a subset of genetic variants, which may be useful for interaction analysis. As a precursor to the use of PLATO for the detection of gene-gene interactions, the implementation of a variety of single locus filters was completed and evaluated as a proof of concept. To streamline PLATO for efficient epistasis analysis, we determined which of 24 analytical filters produced redundant results. Using a kappa score to identify agreement between filters, we grouped the analytical filters into 4 filter classes; thus all further analyses employed four filters. We then tested the MAX statistic put forth by Sladek et al. 1 in simulated data exploring a number of genetic models of modest effect size. To find the MAX statistic, the four filters were run on each SNP in each dataset and the smallest p-value among the four results was taken as the final result. Permutation testing was performed to empirically determine the p-value. The power of the MAX statistic to detect each of the simulated effects was determined in addition to the Type 1 error and false positive rates. The results of this simulation study demonstrates that PLATO using the four filters incorporating the MAX statistic has higher power on average to find multiple types of effects and a lower false positive rate than any of the individual filters alone. In the future we will extend PLATO with the MAX statistic to interaction analyses for large-scale genomic datasets. © 2010 World Scientific Publishing Co. Pte. Ltd.",
                "authors": [
                    {
                        "name": "Grady B.J."
                    },
                    {
                        "name": "Torstenson E."
                    },
                    {
                        "name": "Dudek S.M."
                    },
                    {
                        "name": "Giles J."
                    },
                    {
                        "name": "Sexton D."
                    },
                    {
                        "name": "Ritchie M.D."
                    }
                ],
                "citationCount": 41,
                "date": "2010-12-01T00:00:00Z",
                "journal": "Pacific Symposium on Biocomputing 2010, PSB 2010",
                "title": "Finding unique filter sets in plato: A precursor to efficient interaction analysis in gwas data"
            },
            "pmid": "19908384"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genotyping experiment",
            "uri": "http://edamontology.org/topic_3516"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1
}