{
    "additionDate": "2020-01-14T20:11:30Z",
    "biotoolsCURIE": "biotools:NUMT",
    "biotoolsID": "NUMT",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "robert_buecking@eva.mpg.de",
            "name": "Robert Bücking",
            "orcidid": "https://orcid.org/0000-0002-0180-5551",
            "typeEntity": "Person"
        }
    ],
    "description": "Archaic mitochondrial DNA inserts in modern day nuclear genomes.\n\nScripts used to detect archaic NUMTs in NGS data.\n\nA pipeline including a collection of scripts used to analyse NUMTs discovered in whole genome paired read data. flanking_region_analysis.py is a script used to calculate match ratios with archaic genomes of a specific genomic region. numt_stats.py is a script to calculate various statistics for discovered NUMTs. mito_variance.py is a script to calculate pariwise differences between all sequences of an alignment.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/robbueck/arcnumt",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-04T09:18:17Z",
    "name": "NUMT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6392-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Traces of interbreeding of Neanderthals and Denisovans with modern humans in the form of archaic DNA have been detected in the genomes of present-day human populations outside sub-Saharan Africa. Up to now, only nuclear archaic DNA has been detected in modern humans; we therefore attempted to identify archaic mitochondrial DNA (mtDNA) residing in modern human nuclear genomes as nuclear inserts of mitochondrial DNA (NUMTs). Results: We analysed 221 high-coverage genomes from Oceania and Indonesia using an approach which identifies reads that map both to the nuclear and mitochondrial DNA. We then classified reads according to the source of the mtDNA, and found one NUMT of Denisovan mtDNA origin, present in 15 analysed genomes; analysis of the flanking region suggests that this insertion is more likely to have happened in a Denisovan individual and introgressed into modern humans with the Denisovan nuclear DNA, rather than in a descendant of a Denisovan female and a modern human male. Conclusions: Here we present our pipeline for detecting introgressed NUMTs in next generation sequencing data that can be used on genomes sequenced in the future. Further discovery of such archaic NUMTs in modern humans can be used to detect interbreeding between archaic and modern humans and can reveal new insights into the nature of such interbreeding events.",
                "authors": [
                    {
                        "name": "Bucking R."
                    },
                    {
                        "name": "Cox M.P."
                    },
                    {
                        "name": "Hudjashov G."
                    },
                    {
                        "name": "Saag L."
                    },
                    {
                        "name": "Stoneking M."
                    },
                    {
                        "name": "Sudoyo H."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-26T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Archaic mitochondrial DNA inserts in modern day nuclear genomes"
            },
            "pmcid": "PMC6933719",
            "pmid": "31878873"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
