{
    "additionDate": "2017-08-20T15:22:21Z",
    "biotoolsCURIE": "biotools:come",
    "biotoolsID": "come",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "zhilu@tsinghua.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hulongptp@gmail.com",
            "name": "Long Hu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A COding potential calculation tool based on Multiple fEatures integrates multiple sequence-derived and experiment-based features to identify and characterize novel lncRNAs in RNA sequencing data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/lulab/COME/blob/master/README.md"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lulab/COME",
    "language": [
        "R",
        "Shell",
        "Perl"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/lulab/COME/issues"
        }
    ],
    "name": "COME",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/nar/gkw798",
            "metadata": {
                "abstract": "© The Author(s) 2016.Recent genomic studies suggest that novel long non-coding RNAs (lncRNAs) are specifically expressed and far outnumber annotated lncRNA sequences. To identify and characterize novel lncRNAs in RNA sequencing data from new samples, we have developed COME, a coding potential calculation tool based on multiple features. It integrates multiple sequence-derived and experiment-based features using a decompose-compose method, which makes it more accurate and robust than other wellknown tools. We also showed that COME was able to substantially improve the consistency of predication results from other coding potential calculators. Moreover, COME annotates and characterizes each predicted lncRNA transcript with multiple lines of supporting evidence, which are not provided by other tools. Remarkably, we found that one subgroup of lncRNAs classified by such supporting features (i.e. conserved local RNA secondary structure) was highly enriched in a well-validated database (lncRNAdb). We further found that the conserved structural domains on lncRNAs had better chance than other RNA regions to interact with RNA binding proteins, based on the recent eCLIP-seq data in human, indicating their potential regulatory roles. Overall, we present COME as an accurate, robust and multiplefeature supported method for the identification and characterization of novel lncRNAs. The software implementation is available at https://github.com/lulab/COME.",
                "authors": [
                    {
                        "name": "Hu L."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Hu B."
                    },
                    {
                        "name": "Lu Z.J."
                    }
                ],
                "citationCount": 48,
                "date": "2017-01-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "COME: A robust coding potential calculation tool for lncRNA identification and characterization based on multiple features"
            },
            "pmcid": "PMC5224497",
            "pmid": "27608726",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}