{
    "additionDate": "2020-01-09T18:14:41Z",
    "biotoolsCURIE": "biotools:dREG_autogenerated",
    "biotoolsID": "dREG_autogenerated",
    "confidence_flag": "medium",
    "description": "Building a Science Gateway For Processing and Modeling Sequencing Data Via Apache Airavata.\n\nWelcome to dREG and dTOX gateway!.\n\nThe dREG model in the gateway predicts the location of enhancers and promoters using PRO-seq, GRO-seq, or ChRO-seq data. The server takes as input bigWig files provided by the user, which represent PRO-seq signal on the plus and minus strand. The gateway uses a pre-trained dREG model to identify divergent transcript start sites and impute the predicted DNase-I hypersensitivity signal across the genome. The current dREG model works in any mammalian organism.\n\n||| NAME (dREG) SIMILAR TO (PUB. DIFFERENT) bio.tools/dreg (dreg).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'dREG gateway'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://dREG.dnasequence.org/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2020-01-09T18:14:41Z",
    "name": "dREG_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1145/3219104.3219141",
            "metadata": {
                "abstract": "© 2018 Association for Computing Machinery.The amount of DNA sequencing data has been exponentially growing during the past decade due to advances in sequencing technology. Processing and modeling large amounts of sequencing data can be computationally intractable for desktop computing platforms. High performance computing (HPC) resources offer advantages in terms of computing power, and can be a general solution to these problems. Using HPCs directly for computational needs requires skilled users who know their way around HPCs and acquiring such skills take time. Science gateways acts as the middle layer between users and HPCs, providing users with the resources to accomplish compute-intensive tasks without requiring specialized expertise. We developed a web-based computing platform for genome biologists by customizing the PHP Gateway for Airavata (PGA) framework that accesses publicly accessible HPC resources via Apache Airavata. This web computing platform takes advantage of the Extreme Science and Engineering Discovery Environment (XSEDE) which provides the resources for gateway development, including access to CPU, GPU, and storage resources. We used this platform to develop a gateway for the dREG algorithm, an online computing tool for finding functional regions in mammalian genomes using nascent RNA sequencing data. The dREG gateway provides its users a free, powerful and user-friendly GPU computing resource based on XSEDE, circumventing the need of specialized knowledge about installation, configuration, and execution on an HPC for biologists.",
                "authors": [
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Chu T."
                    },
                    {
                        "name": "Christie M.A."
                    },
                    {
                        "name": "Marru S."
                    },
                    {
                        "name": "Danko C.G."
                    },
                    {
                        "name": "Abeysinghe E."
                    },
                    {
                        "name": "Pierce M."
                    }
                ],
                "citationCount": 1,
                "date": "2018-07-22T00:00:00Z",
                "journal": "ACM International Conference Proceeding Series",
                "title": "Building a science gateway for processing and modeling sequencing data via apache airavata"
            },
            "pmcid": "PMC6785190",
            "pmid": "31598610"
        }
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}