{
    "additionDate": "2021-01-18T09:20:14Z",
    "biotoolsCURIE": "biotools:oslnet",
    "biotoolsID": "oslnet",
    "confidence_flag": "tool",
    "description": "Deep Small-Sample Classification with an Orthogonal Softmax Layer.\n\nCode release for OSLNet: Deep Small-Sample Classification with an Orthogonal Softmax Layer (TIP2020) DOI.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/dongliangchang/OSLNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-15T09:42:30Z",
    "license": "MIT",
    "name": "OSLNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TIP.2020.2990277",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.A deep neural network of multiple nonlinear layers forms a large function space, which can easily lead to overfitting when it encounters small-sample data. To mitigate overfitting in small-sample classification, learning more discriminative features from small-sample data is becoming a new trend. To this end, this paper aims to find a subspace of neural networks that can facilitate a large decision margin. Specifically, we propose the Orthogonal Softmax Layer (OSL), which makes the weight vectors in the classification layer remain orthogonal during both the training and test processes. The Rademacher complexity of a network using the OSL is only 1 K, where K is the number of classes, of that of a network using the fully connected classification layer, leading to a tighter generalization error bound. Experimental results demonstrate that the proposed OSL has better performance than the methods used for comparison on four small-sample benchmark datasets, as well as its applicability to large-sample datasets. Codes are available at: https://github.com/dongliangchang/OSLNet.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Chang D."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Tan Z.-H."
                    },
                    {
                        "name": "Xue J.-H."
                    },
                    {
                        "name": "Cao J."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Guo J."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "OSLNet: Deep Small-Sample Classification with an Orthogonal Softmax Layer"
            },
            "pmid": "32386152"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ]
}