{
    "additionDate": "2021-01-18T12:14:07Z",
    "biotoolsCURIE": "biotools:summer",
    "biotoolsID": "summer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mshokhirev@salk.edu",
            "name": "Maxim N. Shokhirev",
            "orcidid": "https://orcid.org/0000-0002-8379-8657",
            "typeEntity": "Person"
        }
    ],
    "description": "shiny utility for metabolomics and multiomics exploratory research.\n\nCellular metabolites are generated by a complex network of biochemical reactions. This makes interpreting changes in metabolites exceptionally challenging.<h4>Objectives< h4>To develop a computational tool that integrates multiomics data at the level of reactions.<h4>Methods< h4>Changes in metabolic reactions are modeled with input from transcriptomics proteomics measurements of enzymes and metabolomic measurements of metabolites",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://summer.salk.edu",
    "lastUpdate": "2021-02-24T12:21:05Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/salkigc/summer"
        }
    ],
    "name": "SUMMER",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.0C00246",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.The nonlinear signal response of electrospray ionization (ESI) presents a critical limitation for mass spectrometry (MS)-based quantitative analysis. In the field of metabolomics research, this issue has largely remained unaddressed; MS signal intensities are usually directly used to calculate fold changes for quantitative comparison. In this work, we demonstrate that, due to the nonlinear ESI response, signal intensity ratios of a metabolic feature calculated between two samples may not reflect their real metabolic concentration ratios (i.e., fold-change compression), implying that conventional fold-change calculations directly using MS signal intensities can be misleading. In this regard, we developed a quality control (QC) sample-based signal calibration workflow to overcome the quantitative bias caused by the nonlinear ESI response. In this workflow, calibration curves for every metabolic feature are first established using a QC sample injected in serial injection volumes. The MS signals of each metabolic feature are then calibrated to their equivalent QC injection volumes for comparative analysis. We demonstrated this novel workflow in a targeted metabolite analysis, showing that the accuracy of fold-change calculations can be significantly improved. Furthermore, in a metabolomic comparison of the bone marrow interstitial fluid samples from leukemia patients before and after chemotherapy, an additional 59 significant metabolic features were found with fold changes larger than 1.5, and an additional 97 significant metabolic features had fold changes corrected by more than 0.1. This work enables high-quality quantitative analysis in untargeted metabolomics, thus providing more confident biological hypotheses generation.",
                "authors": [
                    {
                        "name": "Yu H."
                    },
                    {
                        "name": "Xing S."
                    },
                    {
                        "name": "Nierves L."
                    },
                    {
                        "name": "Lange P.F."
                    },
                    {
                        "name": "Huan T."
                    }
                ],
                "citationCount": 6,
                "date": "2020-05-19T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Fold-Change Compression: An Unexplored but Correctable Quantitative Bias Caused by Nonlinear Electrospray Ionization Responses in Untargeted Metabolomics"
            },
            "pmcid": "PMC7723939",
            "pmid": "33294943"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}