{
    "additionDate": "2017-08-20T17:26:10Z",
    "biotoolsCURIE": "biotools:smalt",
    "biotoolsID": "smalt",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "hannes.ponstingl@sanger.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zemin.ning@sanger.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Aligns DNA sequencing reads with a reference genome. Reads from a wide range of sequencing platforms can be processed except for SOLiD reads.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://sourceforge.net/projects/smalt/files/smalt_manual.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.sanger.ac.uk/science/tools/smalt-0",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-09-04T08:38:35Z",
    "license": "GPL-3.0",
    "name": "Smalt",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-264",
            "metadata": {
                "abstract": "Background: The rapid evolution in high-throughput sequencing (HTS) technologies has opened up new perspectives in several research fields and led to the production of large volumes of sequence data. A fundamental step in HTS data analysis is the mapping of reads onto reference sequences. Choosing a suitable mapper for a given technology and a given application is a subtle task because of the difficulty of evaluating mapping algorithms.Results: In this paper, we present a benchmark procedure to compare mapping algorithms used in HTS using both real and simulated datasets and considering four evaluation criteria: computational resource and time requirements, robustness of mapping, ability to report positions for reads in repetitive regions, and ability to retrieve true genetic variation positions. To measure robustness, we introduced a new definition for a correctly mapped read taking into account not only the expected start position of the read but also the end position and the number of indels and substitutions. We developed CuReSim, a new read simulator, that is able to generate customized benchmark data for any kind of HTS technology by adjusting parameters to the error types. CuReSim and CuReSimEval, a tool to evaluate the mapping quality of the CuReSim simulated reads, are freely available. We applied our benchmark procedure to evaluate 14 mappers in the context of whole genome sequencing of small genomes with Ion Torrent data for which such a comparison has not yet been established.Conclusions: A benchmark procedure to compare HTS data mappers is introduced with a new definition for the mapping correctness as well as tools to generate simulated reads and evaluate mapping quality. The application of this procedure to Ion Torrent data from the whole genome sequencing of small genomes has allowed us to validate our benchmark procedure and demonstrate that it is helpful for selecting a mapper based on the intended application, questions to be addressed, and the technology used. This benchmark procedure can be used to evaluate existing or in-development mappers as well as to optimize parameters of a chosen mapper for any application and any sequencing platform. © 2014 Caboche et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Audebert C."
                    },
                    {
                        "name": "Caboche S."
                    },
                    {
                        "name": "Hot D."
                    },
                    {
                        "name": "Lemoine Y."
                    }
                ],
                "citationCount": 57,
                "date": "2014-04-05T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Comparison of mapping algorithms used in high-throughput sequencing: Application to Ion Torrent data"
            },
            "pmcid": "PMC4051166",
            "pmid": "24708189",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1016/j.ygeno.2017.03.001",
            "metadata": {
                "abstract": "© 2017 Elsevier Inc.Massive data produced due to the advent of next-generation sequencing (NGS) technology is widely used for biological researches and medical diagnosis. The crucial step in NGS analysis is read alignment or mapping which is computationally intensive and complex. The mapping bias tends to affect the downstream analysis, including detection of polymorphisms. In order to provide guidelines to the biologist for suitable selection of aligners; we have evaluated and benchmarked 5 different aligners (BWA, Bowtie2, NovoAlign, Smalt and Stampy) and their mapping bias based on characteristics of 5 microbial genomes. Two million simulated read pairs of various sizes (36 bp, 50 bp, 72 bp, 100 bp, 125 bp, 150 bp, 200 bp, 250 bp and 300 bp) were aligned. Specific alignment features such as sensitivity of mapping, percentage of properly paired reads, alignment time and effect of tandem repeats on incorrectly mapped reads were evaluated. BWA showed faster alignment followed by Bowtie2 and Smalt. NovoAlign and Stampy were comparatively slower. Most of the aligners showed high sensitivity towards long reads (> 100 bp) mapping. On the other hand NovoAlign showed higher sensitivity towards both short reads (36 bp, 50 bp, 72 bp) and long reads (> 100 bp) mappings; It also showed higher sensitivity towards mapping a complex genome like Plasmodium falciparum. The percentage of properly paired reads aligned by NovoAlign, BWA and Stampy were markedly higher. None of the aligners outperforms the others in the benchmark, however the aligners perform differently with genome characteristics. We expect that the results from this study will be useful for the end user to choose aligner, thus enhance the accuracy of read mapping.",
                "authors": [
                    {
                        "name": "Nookaew I."
                    },
                    {
                        "name": "Sen P."
                    },
                    {
                        "name": "Thankaswamy-Kosalai S."
                    }
                ],
                "citationCount": 31,
                "date": "2017-07-01T00:00:00Z",
                "journal": "Genomics",
                "title": "Evaluation and assessment of read-mapping by multiple next-generation sequencing aligners based on genome-wide characteristics"
            },
            "pmid": "28286147",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
