{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T07:44:00Z",
    "biotoolsCURIE": "biotools:GePhEx",
    "biotoolsID": "GePhEx",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gephex.ega@crg.eu",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Genome-Phenome Explorer (GePhEx): A tool for the visualization and interpretation of phenotypic relationships supported by genetic evidence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://gephex.ega-archive.org/doc"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "https://gephex.ega-archive.org/",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "GePhEx",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz622",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Association studies based on SNP arrays and Next Generation Sequencing technologies have enabled the discovery of thousands of genetic loci related to human diseases. Nevertheless, their biological interpretation is still elusive, and their medical applications limited. Recently, various tools have been developed to help bridging the gap between genomes and phenomes. To our knowledge, however none of these tools allows users to retrieve the phenotype-wide list of genetic variants that may be linked to a given disease or to visually explore the joint genetic architecture of different pathologies. Results: We present the Genome-Phenome Explorer (GePhEx), a web-tool easing the visual exploration of phenotypic relationships supported by genetic evidences. GePhEx is primarily based on the thorough analysis of linkage disequilibrium between disease-associated variants and also considers relationships based on genes, pathways or drug-targets, leveraging on publicly available variant-disease associations to detect potential relationships between diseases. We demonstrate that GePhEx does retrieve well-known relationships as well as novel ones, and that, thus, it might help shedding light on the patho-physiological mechanisms underlying complex diseases. To this end, we investigate the potential relationship between schizophrenia and lung cancer, first detected using GePhEx and provide further evidence supporting a functional link between them.",
                "authors": [
                    {
                        "name": "Farre X."
                    },
                    {
                        "name": "Spataro N."
                    },
                    {
                        "name": "Haziza F."
                    },
                    {
                        "name": "Rambla J."
                    },
                    {
                        "name": "Navarro A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Genome-phenome explorer (GePhEx): A tool for the visualization and interpretation of phenotypic relationships supported by genetic evidence"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1
}