{
    "additionDate": "2017-08-03T18:57:13Z",
    "biotoolsCURIE": "biotools:quantisnp",
    "biotoolsID": "quantisnp",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.well.ox.ac.uk/contact"
        }
    ],
    "description": "Analytical tool for the analysis of copy number variation using whole genome SNP genotyping data. In its first implementation it was developed for data arising from Illumina® platforms.",
    "documentation": [
        {
            "type": "General",
            "url": "https://sites.google.com/site/quantisnp/howto"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid property calculation",
                    "uri": "http://edamontology.org/operation_0262"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/quantisnp/home",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/quantisnp-2-3-copy-number-variation-cnv-detection.html"
        }
    ],
    "name": "QuantiSNP",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Array-based technologies have been used to detect chromosomal copy number changes (aneuploidies) in the human genome. Recent studies identified numerous copy number variants (CNV) and some are common polymorphisms that may contribute to disease susceptibility. We developed, and experimentally validated, a novel computational framework (QuantiSNP) for detecting regions of copy number variation from BeadArray™ SNP genotyping data using an Objective Bayes Hidden-Markov Model (OB-HMM). Objective Bayes measures are used to set certain hyperparameters in the priors using a novel re-sampling framework to calibrate the model to a fixed Type I (false positive) error rate. Other parameters are set via maximum marginal likelihood to prior training data of known structure. QuantiSNP provides probabilistic quantification of state classifications and significantly improves the accuracy of segmental aneuploidy identification and mapping, relative to existing analytical tools (Beadstudio, Illumina), as demonstrated by validation of breakpoint boundaries. QuantiSNP identified both novel and validated CNVs. QuantiSNP was developed using BeadArray™ SNP data but it can be adapted to other platforms and we believe that the OB-HMM framework has widespread applicability in genomic research. In conclusion, QuantiSNP is a novel algorithm for high-resolution CNV/F;aneuploidy detection with application to clinical genetics, cancer and disease association studies. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Colella S."
                    },
                    {
                        "name": "Yau C."
                    },
                    {
                        "name": "Taylor J.M."
                    },
                    {
                        "name": "Mirza G."
                    },
                    {
                        "name": "Butler H."
                    },
                    {
                        "name": "Clouston P."
                    },
                    {
                        "name": "Bassett A.S."
                    },
                    {
                        "name": "Seller A."
                    },
                    {
                        "name": "Holmes C.C."
                    },
                    {
                        "name": "Ragoussis J."
                    }
                ],
                "citationCount": 380,
                "date": "2007-03-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "QuantiSNP: An objective bayes hidden-markov model to detect and accurately map copy number variation using SNP genotyping data"
            },
            "pmid": "17341461"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}