{
    "additionDate": "2017-03-27T08:35:23Z",
    "biotoolsCURIE": "biotools:fantom",
    "biotoolsID": "fantom",
    "credit": [
        {
            "email": "fantom-help@gsc.riken.jp",
            "name": "Fantom Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Functional Annotation Of the Mammalian Genome is a database for the transcriptional network that regulates macrophage differentiation. Data comes from cap analysis of gene expression, sequencing mRNA 5-ends with a second-generation sequencer to quantify promoter activities even in the absence of gene annotation. Additional genome-wide experiments complement the setup including short RNA sequencing, microarray gene expression profiling on large-scale perturbation experiments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://fantom.gsc.riken.jp/4/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://fantom.gsc.riken.jp/4/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "FANTOM",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The international Functional Annotation Of the Mammalian Genomes 4 (FANTOM4) research collaboration set out to better understand the transcriptional network that regulates macrophage differentiation and to uncover novel components of the transcriptome employing a series of highthroughput experiments. The primary and unique technique is cap analysis of gene expression (CAGE), sequencing mRNA 50-ends with a secondgeneration sequencer to quantify promoter activities even in the absence of gene annotation. Additional genome-wide experiments complement the setup including short RNA sequencing, microarray gene expression profiling on large-scale perturbation experiments and ChIP-chip for epigenetic marks and transcription factors. All the experiments are performed in a differentiation time course of the THP-1 human leukemic cell line. Furthermore, we performed a large-scale mammalian two-hybrid (M2H) assay between transcription factors and monitored their expression profile across human and mouse tissues with qRT-PCR to address combinatorial effects of regulation by transcription factors. These interdependent data have been analyzed individually and in combination with each other and are published in related but distinct papers. We provide all data together with systematic annotation in an integrated view as resource for the scientific community (http://fantom.gsc.riken.jp/4/). Additionally, we assembled a rich set of derived analysis results including published predicted and validated regulatory interactions. Here we introduce the resource and its update after the initial release. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Kawaji H."
                    },
                    {
                        "name": "Severin J."
                    },
                    {
                        "name": "Lizio M."
                    },
                    {
                        "name": "Forrest A.R.R."
                    },
                    {
                        "name": "Van Nimwegen E."
                    },
                    {
                        "name": "Rehli M."
                    },
                    {
                        "name": "Schroder K."
                    },
                    {
                        "name": "Irvine K."
                    },
                    {
                        "name": "Suzuki H."
                    },
                    {
                        "name": "Carninci P."
                    },
                    {
                        "name": "Hayashizaki Y."
                    },
                    {
                        "name": "Daub C.O."
                    }
                ],
                "citationCount": 38,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Update of the FANTOM web resource: From mammalian transcriptional landscape to its dynamic regulation"
            },
            "pmid": "21075797"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ],
    "validated": 1
}