{
    "additionDate": "2021-01-18T11:21:06Z",
    "biotoolsCURIE": "biotools:trftar",
    "biotoolsID": "trftar",
    "confidence_flag": "tool",
    "description": "Prediction of tRF-target gene interactions via systemic re-analysis of Argonaute CLIP-seq datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.rnanut.net/tRFTar/",
    "lastUpdate": "2021-03-20T17:41:34Z",
    "name": "tRFTar",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2020.10.006",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.tRNA-derived fragments (tRFs), which by definition are cleaved from tRNAs, comprise a novel class of regulatory small non-coding RNAs. Recent evidence has revealed that tRFs can be loaded onto Argonaute (AGO) family proteins to perform post-transcriptional regulations via substantial tRF-target gene interactions (TGIs). However, there is no resource that systematically profiles potential AGO-mediated TGIs. To this end, we performed a systemic computational screening of potential AGO-mediated TGIs by a re-analysis of 146 crosslinking-immunoprecipitation and high-throughput sequencing (CLIP-seq) datasets in which 920,690 TGIs between 12,102 tRFs and 5,688 target genes were identified. The predicted TGIs have superior signal-to-noise ratio and good consistency with TGIs identified from an orthogonal technique. AGO-bound tRFs are not evenly distributed, where the 5′-tRF and 3′-tRF are enriched and some commonly expressed tRFs are also overrepresented. The tRFs tend to target conserved regions of transcripts and co-express with their target genes. Filtering TGIs with consistent co-expression with target genes results in a set of regulatory TGIs that contains 25,281 tRF-target pairs. Together, our results unveiled the extensive regulatory interactions between tRFs and target genes. Finally, the CLIP-derived TGIs were incorporated in a user-friendly online platform termed as tRFTar, where various functions like custom searching, co-expressed TGI filtering, genome browser and TGI-based tRF functional enrichment analysis are enabled to help users to investigate the functions of tRFs. The tRFTar is freely available at http://www.rnanut.net/tRFTar/.",
                "authors": [
                    {
                        "name": "Cui Q."
                    },
                    {
                        "name": "Peng H."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Methods",
                "title": "tRFTar: Prediction of tRF-target gene interactions via systemic re-analysis of Argonaute CLIP-seq datasets"
            },
            "pmid": "33045361"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ]
}
