{"credit":[{"name":"SIB Swiss Institute of Bioinformatics","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"vincent.zoete@sib.swiss","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://www.swisssimilarity.ch/help.php"}],"function":[{"input":[{"data":{"term":"SMILES string","uri":"http://edamontology.org/data_2301"}}],"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}],"output":[{"data":{"term":"Report","uri":"http://edamontology.org/data_2048"}}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Cheminformatics","uri":"http://edamontology.org/topic_2258"},{"term":"Medicinal chemistry","uri":"http://edamontology.org/topic_0209"}]},"publication":[{"abstract":"© 2016 American Chemical Society. SwissSimilarity is a new web tool for rapid ligand-based virtual screening of small to unprecedented ultralarge libraries of small molecules. Screenable compounds include drugs, bioactive and commercial molecules, as well as 205 million of virtual compounds readily synthesizable from commercially available synthetic reagents. Predictions can be carried out on-the-fly using six different screening approaches, including 2D molecular fingerprints as well as superpositional and fast nonsuperpositional 3D similarity methodologies. SwissSimilarity is part of a large initiative of the SIB Swiss Institute of Bioinformatics to provide online tools for computer-aided drug design, such as SwissDock, SwissBioisostere or SwissTargetPrediction with which it can interoperate, and is linked to other well-established online tools and databases. User interface and backend have been designed for simplicity and ease of use, to provide proficient virtual screening capabilities to specialists and nonexperts in the field. SwissSimilarity is accessible free of charge or login at http://www.swisssimilarity.ch.","authors":["Zoete V.","Daina A.","Bovigny C.","Michielin O."],"cit_count":21,"doi":"10.1021/acs.jcim.6b00174","journal":"Journal of Chemical Information and Modeling","title":"SwissSimilarity: A Web Tool for Low to Ultra High Throughput Ligand-Based Virtual Screening","type":"Primary","year":"2016-08-22"}],"summary":{"biotoolsCURIE":"biotools:swisssimilarity","biotoolsID":"swisssimilarity","description":"Allows the rapid screening of small to very large-scale libraries of drugs, bioactive small molecules, commercially available compounds, and an ultra-large library of virtual compounds readily synthesizable from commercially available reagents. The virtual screening can be performed using molecular fingerprints, as well as superpositional or fast non-superpositional 3D shape similarity approaches.","homepage":"http://www.swisssimilarity.ch/","name":"SwissSimilarity","version":["1"]}}