{
    "accessibility": "Open access",
    "additionDate": "2024-05-24T09:06:20.209715Z",
    "biotoolsCURIE": "biotools:mscan",
    "biotoolsID": "mscan",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lin.zhang@cumt.edu.cn",
            "name": "Lin Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "yjsun@cumt.edu.cn",
            "name": "Yanjing Sun",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-scale self- and cross-attention network for RNA methylation site prediction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://47.242.23.141/MSCAN/index.php",
    "lastUpdate": "2024-11-24T13:56:22.157179Z",
    "name": "MSCAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05649-1",
            "metadata": {
                "abstract": "Background: Epi-transcriptome regulation through post-transcriptional RNA modifications is essential for all RNA types. Precise recognition of RNA modifications is critical for understanding their functions and regulatory mechanisms. However, wet experimental methods are often costly and time-consuming, limiting their wide range of applications. Therefore, recent research has focused on developing computational methods, particularly deep learning (DL). Bidirectional long short-term memory (BiLSTM), convolutional neural network (CNN), and the transformer have demonstrated achievements in modification site prediction. However, BiLSTM cannot achieve parallel computation, leading to a long training time, CNN cannot learn the dependencies of the long distance of the sequence, and the Transformer lacks information interaction with sequences at different scales. This insight underscores the necessity for continued research and development in natural language processing (NLP) and DL to devise an enhanced prediction framework that can effectively address the challenges presented. Results: This study presents a multi-scale self- and cross-attention network (MSCAN) to identify the RNA methylation site using an NLP and DL way. Experiment results on twelve RNA modification sites (m6A, m1A, m5C, m5U, m6Am, m7G, Ψ, I, Am, Cm, Gm, and Um) reveal that the area under the receiver operating characteristic of MSCAN obtains respectively 98.34%, 85.41%, 97.29%, 96.74%, 99.04%, 79.94%, 76.22%, 65.69%, 92.92%, 92.03%, 95.77%, 89.66%, which is better than the state-of-the-art prediction model. This indicates that the model has strong generalization capabilities. Furthermore, MSCAN reveals a strong association among different types of RNA modifications from an experimental perspective. A user-friendly web server for predicting twelve widely occurring human RNA modification sites (m6A, m1A, m5C, m5U, m6Am, m7G, Ψ, I, Am, Cm, Gm, and Um) is available at http://47.242.23.141/MSCAN/index.php . Conclusions: A predictor framework has been developed through binary classification to predict RNA methylation sites.",
                "authors": [
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zeng W."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 2,
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MSCAN: multi-scale self- and cross-attention network for RNA methylation site prediction"
            },
            "pmcid": "PMC10795237",
            "pmid": "38233745"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
