{
    "additionDate": "2021-01-18T07:10:13Z",
    "biotoolsCURIE": "biotools:drimc",
    "biotoolsID": "drimc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "linwang@tust.edu.cn",
            "name": "Lin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "DRIMC is a drug repositioning approach using Bayesian inductive matrix completion.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/linwang1982/DRIMC",
    "lastUpdate": "2021-03-03T19:08:39Z",
    "name": "DRIMC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA062",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: One of the most important problems in drug discovery research is to precisely predict a new indication for an existing drug, i.e. drug repositioning. Recent recommendation system-based methods have tackled this problem using matrix completion models. The models identify latent factors contributing to known drug-disease associations, and then infer novel drug-disease associations by the correlations between latent factors. However, these models have not fully considered the various drug data sources and the sparsity of the drug-disease association matrix. In addition, using the global structure of the drug-disease association data may introduce noise, and consequently limit the prediction power. Results: In this work, we propose a novel drug repositioning approach by using Bayesian inductive matrix completion (DRIMC). First, we embed four drug data sources into a drug similarity matrix and two disease data sources in a disease similarity matrix. Then, for each drug or disease, its feature is described by similarity values between it and its nearest neighbors, and these features for drugs and diseases are mapped onto a shared latent space. We model the association probability for each drug-disease pair by inductive matrix completion, where the properties of drugs and diseases are represented by projections of drugs and diseases, respectively. As the known drug-disease associations have been manually verified, they are more trustworthy and important than the unknown pairs. We assign higher confidence levels to known association pairs compared with unknown pairs. We perform comprehensive experiments on three benchmark datasets, and DRIMC improves prediction accuracy compared with six stat-of-the-art approaches.",
                "authors": [
                    {
                        "name": "Gao Q."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 5,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DRIMC: An improved drug repositioning approach using Bayesian inductive matrix completion"
            },
            "pmid": "31999326"
        }
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
