
{
    "credit": [
        {
            "email": "stuckyb@colorado.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/robgur/home2"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://code.google.com/archive/p/seqtrace/wikis/About.wiki"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Chromatogram visualisation",
                    "uri": "http://edamontology.org/operation_3203"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Nucleic acids",
                "uri": "http://edamontology.org/topic_0077"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/seqtrace-0-8-1-rapidly-processing-dna-sequencing-chromatograms.html"
        }
    ],
    "publication": [
        {
            "abstract": "Modern applications of Sanger DNA sequencing often require converting a large number of chromatogram trace files into high-quality DNA sequences for downstream analyses. Relatively few nonproprietary software tools are available to assist with this process. SeqTrace is a new, free, and open-source software application that is designed to automate the entire workflow by facilitating easy batch processing of large numbers of trace files. SeqTrace can identify, align, and compute consensus sequences from matching forward and reverse traces, filter low-quality base calls, and end-trim finished sequences. The software features a graphical interface that includes a full-featured chromatogram viewer and sequence editor. SeqTrace runs on most popular operating systems and is freely available, along with supporting documentation, at http://seqtrace. googlecode.com/.© 2012 ABRF.",
            "authors": [
                "Stucky B.J."
            ],
            "cit_count": 86,
            "journal": "Journal of Biomolecular Techniques",
            "pmid": "22942788",
            "title": "Seqtrace: A graphical tool for rapidly processing DNA sequencing chromatograms",
            "year": "2012-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:seqtrace",
        "biotoolsID": "seqtrace",
        "description": "Application for viewing and processing DNA sequencing chromatograms (trace files). SeqTrace makes it easy to quickly generate high-quality finished sequences from a large number of trace files. SeqTrace can automatically identify, align, and compute consensus sequences from matching forward and reverse traces, filter low-quality base calls, and perform end trimming of finished sequences. The finished DNA sequences can then be exported to common sequence file formats, such as FASTA.",
        "homepage": "https://code.google.com/p/seqtrace/",
        "name": "SeqTrace"
    }
}