{
    "additionDate": "2017-08-03T18:47:27Z",
    "biotoolsCURIE": "biotools:k-map",
    "biotoolsID": "k-map",
    "credit": [
        {
            "email": "aikchoon.tan@ucdenver.edu",
            "name": "Tan Lab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://tanlab.ucdenver.edu/"
        }
    ],
    "description": "Novel and user-friendly web-based program that systematically connects a set of query kinases to kinase inhibitors based on quantitative profiles of the kinase inhibitor activities. Users can find kinase inhibitors for a set of query kinases (obtained from high-throughput “omics” experiments) or to reveal new interactions between kinases and kinase inhibitors for rational drug combination studies.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://tanlab.ucdenver.edu/kMap/kMapv1.0/kinaseMap/Kmap_UserManual_09152013.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://tanlab.ucdenver.edu/kMap/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/k-map-kinase-connectivity-map.html"
        }
    ],
    "name": "K-Map",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Non-small-cell lung cancer (NSCLC) is the leading cause of cancer death in the United States. Targeted tyrosine kinase inhibitors (TKIs) directed against the epidermal growth factor receptor (EGFR) have been widely and successfully used in treating NSCLC patients with activating EGFR mutations. Unfortunately, the duration of response is short-lived, and all patients eventually relapse by acquiring resistance mechanisms. Result: We performed an integrative systems biology approach to determine essential kinases that drive EGFR-TKI resistance in cancer cell lines. We used a series of bioinformatics methods to analyze and integrate the functional genetics screen and RNA-seq data to identify a set of kinases that are critical in survival and proliferation in these TKI-resistant lines. By connecting the essential kinases to compounds using a novel kinase connectivity map (K-Map), we identified and validated bosutinib as an effective compound that could inhibit proliferation and induce apoptosis in TKI-resistant lines. A rational combination of bosutinib and gefitinib showed additive and synergistic effects in cancer cell lines resistant to EGFR TKI alone. Conclusions: We have demonstrated a bioinformatics-driven discovery roadmap for drug repurposing and development in overcoming resistance in EGFR-mutant NSCLC, which could be generalized to other cancer types in the era of personalized medicine.. © The Author(s) 2014.",
                "authors": [
                    {
                        "name": "Farias-Hesson E."
                    },
                    {
                        "name": "Finigan J.H."
                    },
                    {
                        "name": "Heasley L.E."
                    },
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "Kern J.A."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Leach S.M."
                    },
                    {
                        "name": "Mason R.J."
                    },
                    {
                        "name": "Mishra R."
                    },
                    {
                        "name": "Ramamoorthy P."
                    },
                    {
                        "name": "Singleton K.R."
                    },
                    {
                        "name": "Tan A.C."
                    },
                    {
                        "name": "Vasu V.T."
                    },
                    {
                        "name": "Yoo M."
                    }
                ],
                "citationCount": 19,
                "date": "2014-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Bioinformatics-driven discovery of rational combination for overcoming EGFR-mutant lung cancer resistance to EGFR therapy"
            },
            "pmid": "24812339"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
