{
    "additionDate": "2022-11-15T08:52:37.301380Z",
    "biotoolsCURIE": "biotools:pc-dot",
    "biotoolsID": "pc-dot",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Boxing Sun"
        },
        {
            "name": "Hao Sun"
        }
    ],
    "description": "R scripts to preform perform principal components regression based on the dot product theory on different frameworks",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SUNHAO-JLU/Genome_Prediction-PC_DOT",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-15T08:52:37.303887Z",
    "license": "Not licensed",
    "name": "PC-DOT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1111/AGE.13255",
            "metadata": {
                "abstract": "© 2022 Stichting International Foundation for Animal Genetics.Principal component regression (PC regression) is a useful method developed for prediction based on a dimension-reducing strategy. Generally, the principal components (PCs) are added to the regression model one by one based on the eigenvalue (PC-Eigen). Considering that some PCs with large eigenvalues may be poorly associated with the response variable, the PC-Eigen may not be the best framework. Researchers previously tried to add PCs to the model based on their contribution to the sum of squares of the regression (PC-SS) and they found that the performance of PC-SS is generally lower than that of the PC-Eigen. A standard approach for selecting the optimal set of PCs remains a challenge. Here, from the cosine similarity theory, we postulated that we could rank the PCs by dot product, and this framework (we called PC-DOT) could help to preferentially extract PCs that are highly correlated with the response variable and meanwhile have a large eigenvalue. Based on one simulated and three real genomic datasets (a total of 15 traits), we tested the prediction ability of different frameworks. In general, the PC-DOT method showed a better performance than both PC-Eigen and PC-SS. To facilitate the application of PC, we attached a series of R codes for different frameworks (https://github.com/SUNHAO-JLU/Genome_Prediction-PC_DOT). In addition, the HAT matrix was used to reduce the compute complex in reference data during the cross-validation process. Our work may help researchers to better understand and carry out the PC regression model.",
                "authors": [
                    {
                        "name": "Bai C."
                    },
                    {
                        "name": "Sun B."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Wei M."
                    },
                    {
                        "name": "Xu Z."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Animal Genetics",
                "title": "PC-DOT: Improving genomic prediction ability of principal component regression by DOT product"
            },
            "pmid": "36168679"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}
