{
    "additionDate": "2021-01-18T07:05:54Z",
    "biotoolsCURIE": "biotools:fithic-py",
    "biotoolsID": "fithic-py",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ferhatay@lji.org",
            "name": "Ferhat Ay",
            "orcidid": "https://orcid.org/0000-0002-0708-6914",
            "typeEntity": "Person"
        }
    ],
    "description": "Fit-Hi-C (FitHiC) is a Python tool for assigning statistical confidence estimates to chromosomal contact maps produced by genome-wide genome architecture assays such as Hi-C.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ay-lab/fithic",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-03-11T09:15:36Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Discussion forum"
            ],
            "url": "https://groups.google.com/forum/#!forum/fithic"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ay-lab/fithic.git"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/fithic/#files"
        }
    ],
    "name": "FitHiC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41596-019-0273-0",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.Fit-Hi-C is a programming application to compute statistical confidence estimates for Hi-C contact maps to identify significant chromatin contacts. By fitting a monotonically non-increasing spline, Fit-Hi-C captures the relationship between genomic distance and contact probability without any parametric assumption. The spline fit together with the correction of contact probabilities with respect to bin- or locus-specific biases accounts for previously characterized covariates impacting Hi-C contact counts. Fit-Hi-C is best applied for the study of mid-range (e.g., 20 kb–2 Mb for human genome) intra-chromosomal contacts; however, with the latest reimplementation, named FitHiC2, it is possible to perform genome-wide analysis for high-resolution Hi-C data, including all intra-chromosomal distances and inter-chromosomal contacts. FitHiC2 also offers a merging filter module, which eliminates indirect/bystander interactions, leading to significant reduction in the number of reported contacts without sacrificing recovery of key loops such as those between convergent CTCF binding sites. Here, we describe how to apply the FitHiC2 protocol to three use cases: (i) 5-kb resolution Hi-C data of chromosome 5 from GM12878 (a human lymphoblastoid cell line), (ii) 40-kb resolution whole-genome Hi-C data from IMR90 (human lung fibroblast), and (iii) budding yeast whole-genome Hi-C data at a single restriction cut site (EcoRI) resolution. The procedure takes ~12 h with preprocessing when all use cases are run sequentially (~4 h when run parallel). With the recent improvements in its implementation, FitHiC2 (8 processors and 16 GB memory) is also scalable to genome-wide analysis of the highest resolution (1 kb) Hi-C data available to date (~48 h with 32 GB peak memory). FitHiC2 is available through Bioconda, GitHub and the Python Package Index.",
                "authors": [
                    {
                        "name": "Ay F."
                    },
                    {
                        "name": "Bhattacharyya S."
                    },
                    {
                        "name": "Kaul A."
                    }
                ],
                "citationCount": 16,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Identifying statistically significant chromatin contacts from Hi-C data with FitHiC2"
            },
            "pmcid": "PMC7451401",
            "pmid": "31980751"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "version": [
        "2.0"
    ]
}
