{
    "additionDate": "2019-11-14T20:08:38Z",
    "biotoolsCURIE": "biotools:SRA01_04",
    "biotoolsID": "SRA01_04",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'SRA01', 'LEC SRA01', 'LEC SRA01 04', 'LEC' | Molecular characterization of the human lens epithelium-derived cell line SRA01/04 | Cataract-associated gene discovery in human and animal models have informed on key aspects of human lens development, homeostasis and pathology. Additionally, in vitro models such as the culture of permanent human lens epithelium-derived cell lines (LECs) have also been utilized to understand the molecular biology of lens cells. However, these resources remain uncharacterized, specifically regarding their global gene expression and suitability to model lens cell biology. Therefore, we sought to molecularly characterize gene expression in the human LEC, SRA01 04, which is commonly used in lens studies. We first performed short tandem repeat (STR) analysis and validated SRA01 04 LEC for its human origin, as recommended by the eye research community",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31479653",
    "lastUpdate": "2019-11-14T20:08:38Z",
    "name": "SRA01 04",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.EXER.2019.107787",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdCataract-associated gene discovery in human and animal models have informed on key aspects of human lens development, homeostasis and pathology. Additionally, in vitro models such as the culture of permanent human lens epithelium-derived cell lines (LECs) have also been utilized to understand the molecular biology of lens cells. However, these resources remain uncharacterized, specifically regarding their global gene expression and suitability to model lens cell biology. Therefore, we sought to molecularly characterize gene expression in the human LEC, SRA01/04, which is commonly used in lens studies. We first performed short tandem repeat (STR) analysis and validated SRA01/04 LEC for its human origin, as recommended by the eye research community. Next, we used Illumina HumanHT-12 v3.0 Expression BeadChip arrays to gain insights into the global gene expression profile of SRA01/04. Comparative analysis of SRA01/04 microarray data was performed using other resources such as the lens expression database iSyTE (integrated Systems Tool for Eye gene discovery), the cataract gene database Cat-Map and the published lens literature. This analysis showed that SRA01/04 significantly expresses >40% of the top iSyTE lens-enriched genes (313 out of 749) across different developmental stages. Further, SRA01/04 also significantly expresses ~53% (168 out of 318) of cataract-associated genes in Cat-Map. We also performed comparative gene expression analysis between SRA01/04 cells and the previously validated mouse LEC 21EM15. To gain insight into whether SRA01/04 reflects epithelial or fiber cell characteristics, we compared its gene expression profile to previously reported differentially expressed genes in isolated mouse lens epithelial and fiber cells. This analysis suggests that SRA01/04 has reduced expression of several fiber cell-enriched genes. In agreement with these findings, cell culture analysis demonstrates that SRA01/04 has reduced potential to initiate spontaneous lentoid body formation compared to 21EM15 cells. Next, to independently validate SRA01/04 microarray gene expression, we subjected several candidate genes to RT-PCR and RT-qPCR assays. This analysis demonstrates that SRA01/04 supports expression of many key genes associated with lens development and cataract, including CRYAB, CRYBB2, CRYGS, DKK3, EPHA2, ETV5, GJA1, HSPB1, INPPL1, ITGB1, PAX6, PVRL3, SFRP1, SPARC, TDRD7, and VIM, among others, and therefore can be relevant for understanding the mechanistic basis of these factors. At the same time, SRA01/04 cells do not exhibit robust expression of several genes known to be important to lens biology and cataract such as ALDH1A1, COL4A6, CP, CRYBA4, FOXE3, HMX1, HSF4, MAF, MEIS1, PITX3, PRX, SIX3, and TRPM3, among many others. Therefore, the present study offers a rich transcript-level resource for case-by-case evaluation of the potential advantages and limitations of SRA01/04 cells prior to their use in downstream investigations. In sum, these data show that the human LEC, SRA01/04, exhibits lens epithelial cell-like character reflected in the expression of several lens-enriched and cataract-associated genes, and therefore can be considered as a useful in vitro resource when combined with in vivo studies to gain insight into specific aspects of human lens epithelial cells.",
                "authors": [
                    {
                        "name": "Weatherbee B.A.T."
                    },
                    {
                        "name": "Barton J.R."
                    },
                    {
                        "name": "Siddam A.D."
                    },
                    {
                        "name": "Anand D."
                    },
                    {
                        "name": "Lachke S.A."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Experimental Eye Research",
                "title": "Molecular characterization of the human lens epithelium-derived cell line SRA01/04"
            },
            "pmid": "31479653"
        }
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}