{
    "additionDate": "2015-01-22T11:40:41Z",
    "biotoolsCURIE": "biotools:queryor",
    "biotoolsID": "queryor",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "claudio.forcato@cribi.unipd.it",
            "name": "Claudio Forcato",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web-based platform to manage and retrieve data from human exome sequencing projects.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://queryor.cribi.unipd.it/cgi-bin/queryor/info.pl"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "It allows to upload VCF files and to perform several complex queries to prioritize the variants",
            "operation": [
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://genomes.cribi.unipd.it/cgi-bin/queryor/login.pl",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "QueryOr",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1654-4",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Whole genome and exome sequencing are contributing to the extraordinary progress in the study of human genetic variants. In this fast developing field, appropriate and easily accessible tools are required to facilitate data analysis. Results: Here we describe QueryOR, a web platform suitable for searching among known candidate genes as well as for finding novel gene-disease associations. QueryOR combines several innovative features that make it comprehensive, flexible and easy to use. Instead of being designed on specific datasets, it works on a general XML schema specifying formats and criteria of each data source. Thanks to this flexibility, new criteria can be easily added for future expansion. Currently, up to 70 user-selectable criteria are available, including a wide range of gene and variant features. Moreover, rather than progressively discarding variants taking one criterion at a time, the prioritization is achieved by a global positive selection process that considers all transcript isoforms, thus producing reliable results. QueryOR is easy to use and its intuitive interface allows to handle different kinds of inheritance as well as features related to sharing variants in different patients. QueryOR is suitable for investigating single patients, families or cohorts. Conclusions: QueryOR is a comprehensive and flexible web platform eligible for an easy user-driven variant prioritization. It is freely available for academic institutions at http://queryor.cribi.unipd.it/.",
                "authors": [
                    {
                        "name": "Bertoldi L."
                    },
                    {
                        "name": "Forcato C."
                    },
                    {
                        "name": "Vitulo N."
                    },
                    {
                        "name": "Birolo G."
                    },
                    {
                        "name": "De Pascale F."
                    },
                    {
                        "name": "Feltrin E."
                    },
                    {
                        "name": "Schiavon R."
                    },
                    {
                        "name": "Anglani F."
                    },
                    {
                        "name": "Negrisolo S."
                    },
                    {
                        "name": "Zanetti A."
                    },
                    {
                        "name": "D'Avanzo F."
                    },
                    {
                        "name": "Tomanin R."
                    },
                    {
                        "name": "Faulkner G."
                    },
                    {
                        "name": "Vezzi A."
                    },
                    {
                        "name": "Valle G."
                    }
                ],
                "citationCount": 13,
                "date": "2017-04-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "QueryOR: A comprehensive web platform for genetic variant analysis and prioritization"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}