{
    "additionDate": "2020-01-14T19:41:15Z",
    "biotoolsCURIE": "biotools:AnthOligo",
    "biotoolsID": "AnthOligo",
    "confidence_flag": "tool",
    "description": "Automating the design of oligonucleotides for capture/enrichment technologies.\n\nAnthOligo is a web-based application developed to automatically generate oligo sequences to be used for the targeting and capturing the continuum of large and complex genomic regions. It automates the complex process of checking multiple applications so that the oligos selected successfully pass certain specific parameter criteria and then get shortlisted as a possible use case for RSE (region specific extraction) processes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Microarray probe design",
                    "uri": "http://edamontology.org/operation_0309"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://antholigo.chop.edu",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-02T13:46:54Z",
    "name": "AnthOligo",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa552",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comA number of methods have been devised to address the need for targeted genomic resequencing. One of these methods, region-specific extraction (RSE) is characterized by the capture of long DNA fragments (15-20 kb) by magnetic beads, after enzymatic extension of oligonucleotides hybridized to selected genomic regions. Facilitating the selection of the most appropriate capture oligos for targeting a region of interest, satisfying the properties of temperature (Tm) and entropy (DG), while minimizing the formation of primer-dimers in a pooled experiment, is therefore necessary. Manual design and selection of oligos becomes very challenging, complicated by factors such as length of the target region and number of targeted regions. Here we describe, AnthOligo, a web-based application developed to optimally automate the process of generation of oligo sequences used to target and capture the continuum of large and complex genomic regions. Apart from generating oligos for RSE, this program may have wider applications in the design of customizable internal oligos to be used as baits for gene panel analysis or even probes for large-scale comparative genomic hybridization array processes. AnthOligo was tested by capturing the Major Histocompatibility Complex (MHC) of a random sample. The application provides users with a simple interface to upload an input file in BED format and customize parameters for each task. The task of probe design in AnthOligo commences when a user uploads an input file and concludes with the generation of a result-set containing an optimal set of region-specific oligos. AnthOligo is currently available as a public web application with URL: http://antholigo.chop.edu.",
                "authors": [
                    {
                        "name": "Jayaraman P."
                    },
                    {
                        "name": "Mosbruger T."
                    },
                    {
                        "name": "Hu T."
                    },
                    {
                        "name": "Tairis N.G."
                    },
                    {
                        "name": "Wu C."
                    },
                    {
                        "name": "Clark P.M."
                    },
                    {
                        "name": "D'Arcy M."
                    },
                    {
                        "name": "Ferriola D."
                    },
                    {
                        "name": "Mackiewicz K."
                    },
                    {
                        "name": "Gai X."
                    },
                    {
                        "name": "Monos D."
                    },
                    {
                        "name": "Sarmady M."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AnthOligo: Automating the design of oligonucleotides for capture/enrichment technologies"
            }
        }
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}