{
    "additionDate": "2021-01-18T11:45:53Z",
    "biotoolsCURIE": "biotools:rbp2go",
    "biotoolsID": "rbp2go",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.caudron@dkfz.de",
            "name": "Maiwen Caudron-Herger",
            "typeEntity": "Person"
        }
    ],
    "description": "a comprehensive pan-species database on RNA-binding proteins, their interactions and functions.\n\nRBP2GO is a comprehensive database dedicated to the analysis of RNA-binding proteins, their interactions and functions. RBP2GO offers three search options for each species, which can be accessed via the sidebar under SEARCH SPECIES. More details can be found in the HELP menu.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://RBP2GO.DKFZ.de",
    "lastUpdate": "2021-02-04T14:33:40Z",
    "name": "RBP2GO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1040",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited.RNA-protein complexes have emerged as central players in numerous key cellular processes with significant relevance in health and disease. To further deepen our knowledge of RNA-binding proteins (RBPs), multiple proteome-wide strategies have been developed to identify RBPs in different species leading to a large number of studies contributing experimentally identified as well as predicted RBP candidate catalogs. However, the rapid evolution of the field led to an accumulation of isolated datasets, hampering the access and comparison of their valuable content. Moreover, tools to link RBPs to cellular pathways and functions were lacking. Here, to facilitate the efficient screening of the RBP resources, we provide RBP2GO (https://RBP2GO.DKFZ.de), a comprehensive database of all currently available proteome-wide datasets for RBPs across 13 species from 53 studies including 105 datasets identifying altogether 22 552 RBP candidates. These are combined with the information on RBP interaction partners and on the related biological processes, molecular functions and cellular compartments. RBP2GO offers a user-friendly web interface with an RBP scoring system and powerful advanced search tools allowing forward and reverse searches connecting functions and RBPs to stimulate new research directions.",
                "authors": [
                    {
                        "name": "Caudron-Herger M."
                    },
                    {
                        "name": "Diederichs S."
                    },
                    {
                        "name": "Jansen R.E."
                    },
                    {
                        "name": "Wassmer E."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RBP2GO: A comprehensive pan-species database on RNA-binding proteins, their interactions and functions"
            },
            "pmid": "33196814"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
