{
    "accessibility": "Open access",
    "additionDate": "2016-12-19T14:28:27Z",
    "biotoolsCURIE": "biotools:cd-hit",
    "biotoolsID": "cd-hit",
    "collectionID": [
        "galaxyPasteur"
    ],
    "credit": [
        {
            "email": "galaxy@pasteur.fr",
            "name": "Galaxy Support Team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Cluster a nucleotide dataset into representative sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/weizhongli/cdhit/wiki"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ",
            "sergitobara",
            "yaominmin"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/weizhongli/cdhit",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:12:17.320156Z",
    "link": [
        {
            "type": [
                "Galaxy service"
            ],
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/afelten/microbiome_analyses/CD-HIT/4.6.1"
        }
    ],
    "maturity": "Mature",
    "name": "cd-hit",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hmenager",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq003",
            "metadata": {
                "abstract": "Summary: CD-HIT is a widely used program for clustering and comparing large biological sequence datasets. In order to further assist the CD-HIT users, we significantly improved this program with more functions and better accuracy, scalability and flexibility. Most importantly, we developed a new web server, CD-HIT Suite, for clustering a user-uploaded sequence dataset or comparing it to another dataset at different identity levels. Users can now interactively explore the clusters within web browsers. We also provide downloadable clusters for several public databases (NCBI NR, Swissprot and PDB) at different identity levels. Availability: Free access at http://cd-hit.org. Contact: liwz@sdsc.edu Supplementary information: Supplementary data are available at Bioinformatics online. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Fu L."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Niu B."
                    }
                ],
                "citationCount": 2016,
                "date": "2010-01-06T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CD-HIT Suite: A web server for clustering and comparing biological sequences"
            },
            "pmcid": "PMC2828112",
            "pmid": "20053844"
        },
        {
            "doi": "10.1093/bioinformatics/bts565",
            "metadata": {
                "abstract": "CD-HIT is a widely used program for clustering biological sequences to reduce sequence redundancy and improve the performance of other sequence analyses. In response to the rapid increase in the amount of sequencing data produced by the next-generation sequencing technologies, we have developed a new CD-HIT program accelerated with a novel parallelization strategy and some other techniques to allow efficient clustering of such datasets. Our tests demonstrated very good speedup derived from the parallelization for up to ∼24 cores and a quasi-linear speedup for up to ∼8 cores. The enhanced CD-HIT is capable of handling very large datasets in much shorter time than previous versions. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Fu L."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Niu B."
                    },
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Zhu Z."
                    }
                ],
                "citationCount": 6301,
                "date": "2012-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CD-HIT: Accelerated for clustering the next-generation sequencing data"
            },
            "pmcid": "PMC3516142",
            "pmid": "23060610",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/17.3.282",
            "metadata": {
                "abstract": "We present a fast and flexible program for clustering large protein databases at different sequence identity levels. It takes less than 2 h for the all-against-all sequence comparison and clustering of the non-redundant protein database of over 560 000 sequences on a high-end PC. The output database, including only the representative sequences, can be used for more efficient and sensitive database searches.",
                "authors": [
                    {
                        "name": "Godzik A."
                    },
                    {
                        "name": "Jaroszewski L."
                    },
                    {
                        "name": "Li W."
                    }
                ],
                "citationCount": 788,
                "date": "2001-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Clustering of highly homologous sequences to reduce the size of large protein databases"
            },
            "pmid": "11294794"
        },
        {
            "doi": "10.1093/bioinformatics/18.1.77",
            "metadata": {
                "abstract": "Motivation: Sequence clustering replaces groups of similar sequences in a database with single representatives. Clustering large protein databases like the NCBI Non-Redundant database (NR) using even the best currently available clustering algorithms is very time-consuming and only practical at relatively high sequence identity thresholds. Our previous program, CD-HI, clustered NR at 90% identity in ∼1 h and at 75% identity in ∼1 day on a 1 GHz Linux PC (Li et al., Bioinformatics, 17, 282, 2001); however even faster clustering speed is needed because the size of protein databases are rapidly growing and many applications desire a lower attainable thresholds. Results: For our previous algorithm (CD-HI), we have employed short-word filters to speed up the clustering. In this paper, we show that tolerating some redundancy makes for more efficient use of these short-word filters and increases the program's speed 100 times. Our new program implements this technique and clusters NR at 70% identity within 2 h, and at 50% identity in ∼5 days. Although some redundancy is present after clustering, our new program's results only differ from our previous program's by less than 0.4%.",
                "authors": [
                    {
                        "name": "Godzik A."
                    },
                    {
                        "name": "Jaroszewski L."
                    },
                    {
                        "name": "Li W."
                    }
                ],
                "citationCount": 399,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Tolerating some redundancy significantly speeds up clustering of large protein databases"
            },
            "pmid": "11836214"
        },
        {
            "doi": "10.1093/bioinformatics/btl158",
            "metadata": {
                "abstract": "Motivation: In 2001 and 2002, we published two papers (Bioinformatics, 17, 282-283, Bioinformatics, 18, 77-82) describing an ultrafast protein sequence clustering program called cd-hit. This program can efficiently cluster a huge protein database with millions of sequences. However, the applications of the underlying algorithm are not limited to only protein sequences clustering, here we present several new programs using the same algorithm including cd-hit-2d, cd-hit-est and cd-hit-est-2d. Cd-hit-2d compares two protein datasets and reports similar matches between them; cd-hit-est clusters a DNA/RNA sequence database and cd-hit-est-2d compares two nucleotide datasets. All these programs can handle huge datasets with millions of sequences and can be hundreds of times faster than methods based on the popular sequence comparison and database search tools, such as BLAST. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Godzik A."
                    },
                    {
                        "name": "Li W."
                    }
                ],
                "citationCount": 7720,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Cd-hit: A fast program for clustering and comparing large sets of protein or nucleotide sequences"
            },
            "pmid": "16731699"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "4.6.1"
    ]
}
