
{
    "credit": [
        {
            "email": "siamak@tamu.edu",
            "name": "Siamak Zamani Dadaneh",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "mingyuan.zhou@mccombs.utexas.edu",
            "name": "Mingyuan Zhou",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "xqian@ece.tamu.edu",
            "name": "Xiaoning Qian",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/siamakz/BNBR"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Motivation: Rapid adoption of high-throughput sequencing technologies has enabled better understanding of genome-wide molecular profile changes associated with phenotypic differences in biomedical studies. Often, these changes are due to multiple interacting factors. Existing methods are mostly considering differential expression across two conditions studying one main factor without considering other confounding factors. In addition, they are often coupled with essential sophisticated ad-hoc pre-processing steps such as normalization, restricting their adaptability to general experimental setups. Complex multi-factor experimental design to accurately decipher genotypephenotype relationships signifies the need for developing effective statistical tools for genomescale sequencing data profiled under multi-factor conditions. Results: We have developed a novel Bayesian negative binomial regression (BNB-R) method for the analysis of RNA sequencing (RNA-seq) count data. In particular, the natural model parameterization removes the needs for the normalization step, while the method is capable of tackling complex experimental design involving multi-variate dependence structures. Efficient Bayesian inference of model parameters is obtained by exploiting conditional conjugacy via novel data augmentation techniques. Comprehensive studies on both synthetic and real-world RNA-seq data demonstrate the superior performance of BNB-R in terms of the areas under both the receiver operating characteristic and precision-recall curves.",
            "authors": [
                "Dadaneh S.Z.",
                "Zhou M.",
                "Qian X."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty330",
            "journal": "Bioinformatics",
            "title": "Bayesian negative binomial regression for differential expression with confounding factors",
            "year": "2018-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bnbr",
        "biotoolsID": "bnbr",
        "description": "Bayesian negative binomial regression for differential expression with confounding factors",
        "homepage": "https://github.com/siamakz/BNBR",
        "name": "BNBR"
    }
}