{"credit":[],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Text annotation","uri":"http://edamontology.org/operation_3778"},{"term":"Literature search","uri":"http://edamontology.org/operation_0305"}]}],"labels":{"topic":[{"term":"Public health and epidemiology","uri":"http://edamontology.org/topic_3305"},{"term":"Medical informatics","uri":"http://edamontology.org/topic_3063"},{"term":"Psychiatry","uri":"http://edamontology.org/topic_3419"},{"term":"Literature and language","uri":"http://edamontology.org/topic_3068"},{"term":"Preclinical and clinical studies","uri":"http://edamontology.org/topic_3379"}]},"publication":[{"abstract":"© 2019 Alireza Ahmadvand, David Kavanagh, Michele Clark, Judy Drennan, Lisa Nissen.Background: Digital health has become an advancing phenomenon in the health care systems of modern societies. Over the past two decades, various digital health options, technologies, and innovations have been introduced; many of them are still being investigated and evaluated by researchers all around the globe. However, the actual trends and visibility of peer-reviewed publications using \"digital health\" as a keyword to reflect the topic, published by major relevant journals, still remain to be quantified. Objective: This study aimed to conduct a bibliographic-bibliometric analysis on articles published in JMIR Publications journals that used \"digital health\" as a keyword. We evaluated the trends, topics, and citations of these research publications to identify the important share and contribution of JMIR Publications journals in publishing articles on digital health. Methods: All JMIR Publications journals were searched to find articles in English, published between January 2000 and August 2019, in which the authors focused on, utilized, or discussed digital health in their study and used \"digital health\" as a keyword. In addition, a bibliographic-bibliometric analysis was conducted using the freely available Profiles Research Networking Software by the Harvard Clinical and Translational Science Center. Results: Out of 1797 articles having \"digital health\" as a keyword, published mostly between 2016 and 2019, 277 articles (32.3%) were published by JMIR Publications journals, mainly in the Journal of Medical Internet Research. The most frequently used keyword for the topic was \"mHealth.\" The average number of times an article had been cited, including self-citations, was above 2.8. Conclusions: The reflection of \"digital health\" as a keyword in JMIR Publications journals has increased noticeably over the past few years. To maintain this momentum, more regular bibliographic and bibliometric analyses will be needed. This would encourage authors to consider publishing their articles in relevant, high-visibility journals and help these journals expand their supportive publication policies and become more inclusive of digital health.","authors":["Ahmadvand A.","Kavanagh D.","Clark M.","Drennan J.","Nissen L."],"cit_count":0,"doi":"10.2196/10477","journal":"Journal of Medical Internet Research","pmid":"31855190","title":"Trends and visibility of \"digital health\" as a keyword in articles by JMIR publications in the new millennium: Bibliographic-bibliometric analysis","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:JMIR","biotoolsID":"JMIR","description":"Trends and Visibility of \"Digital Health\" as a Keyword in Articles by JMIR Publications in the New Millennium.\n\nJournal of Medical Internet Research.\n\nJournal of Medical Internet Research - International Scientific Journal for Medical Research, Information and Communication on the Internet.\n\nDue to necessary scheduled maintenance, the JMIR Publications website will be unavailable from Monday, March 11, 2019 at 4:00 PM to 4:30 PM EST . We apologize in advance for any inconvenience this may cause you.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'JMIR Publications', 'bibliographic-bibliometric'","homepage":"http://www.jmir.org","name":"JMIR"}}