{
    "additionDate": "2019-11-14T18:02:32Z",
    "biotoolsCURIE": "biotools:StrainHub",
    "biotoolsID": "StrainHub",
    "confidence_flag": "tool",
    "description": "A phylogenetic tool to construct pathogen transmission networks | Welcome to the StrainHub Repo - Files and Data - StrainHub Online: | Strainhub is designed as a web-based software to generate disease transmission networks and associated metrics from a combination of a phylogenetic tree and associated metadata. The software maps the metadata onto the tree and performs a parsimony ancestry reconstruction step to create links between the associated metadata and enable the construction of the network. Users also have the option to skip the StrainHub ancestry reconstruction step by generating a maximum clade credibility tree (MCC) through BEAST phylogeography | Generate disease transmission networks and associated metrics from a combination of a phylogenetic tree and associated metadata",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (consensus)",
                    "uri": "http://edamontology.org/operation_0555"
                },
                {
                    "term": "Phylogenetic tree generation (parsimony methods)",
                    "uri": "http://edamontology.org/operation_0545"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://strainhub.io",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2020-12-26T19:31:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/abschneider/StrainHub"
        }
    ],
    "name": "StrainHub",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ646",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Summary: In exploring the epidemiology of infectious diseases, networks have been used to reconstruct contacts among individuals and/or populations. Summarizing networks using pathogen metadata (e.g. host species and place of isolation) and a phylogenetic tree is a nascent, alternative approach. In this paper, we introduce a tool for reconstructing transmission networks in arbitrary space from phylogenetic information and metadata. Our goals are to provide a means of deriving new insights and infection control strategies based on the dynamics of the pathogen lineages derived from networks and centrality metrics. We created a web-based application, called StrainHub, in which a user can input a phylogenetic tree based on genetic or other data along with characters derived from metadata using their preferred tree search method. StrainHub generates a transmission network based on character state changes in metadata, such as place or source of isolation, mapped on the phylogenetic tree. The user has the option to calculate centrality metrics on the nodes including betweenness, closeness, degree and a new metric, the source/hub ratio. The outputs include the network with values for metrics on its nodes and the tree with characters reconstructed. All of these results can be exported for further analysis.",
                "authors": [
                    {
                        "name": "Catalyurek U.V."
                    },
                    {
                        "name": "Cioce M."
                    },
                    {
                        "name": "De Bernardi Schneider A."
                    },
                    {
                        "name": "Ford C.T."
                    },
                    {
                        "name": "Hostager R."
                    },
                    {
                        "name": "Janies D."
                    },
                    {
                        "name": "Wertheim J.O."
                    },
                    {
                        "name": "Williams J."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "StrainHub: A phylogenetic tool to construct pathogen transmission networks"
            },
            "pmid": "31418766"
        }
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
