{
    "additionDate": "2021-01-18T09:25:11Z",
    "biotoolsCURIE": "biotools:naguider",
    "biotoolsID": "naguider",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yanghao@scu.edu.cn",
            "name": "Hao Yang",
            "typeEntity": "Person"
        },
        {
            "email": "yansheng.liu@yale.edu",
            "name": "Yansheng Liu",
            "orcidid": "https://orcid.org/0000-0002-2626-3912",
            "typeEntity": "Person"
        }
    ],
    "description": "Performing and prioritizing missing value imputations for consistent bottom-up proteomic analyses.\n\nNAguideR is a web-based tool, which integrates 23 common missing value imputation methods and provides two categories of evaluation criteria (4 classic criteria and 4 proteomic criteria) to assess the imputation performance of various methods. We hope this tool could help scientists impute the missing values systematically and present valuable guidance to select one proper method for their own data. In addition, this tool supports both online access and local installation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/wangshisheng/NAguideR/blob/master/NAguideR_Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "http://www.omicsolution.org/wukong/NAguideR/",
    "language": [
        "R",
        "JavaScript"
    ],
    "lastUpdate": "2021-03-18T09:58:37Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/wangshisheng/NAguideR/"
        }
    ],
    "name": "NAguideR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA498",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Mass spectrometry (MS)-based quantitative proteomics experiments frequently generate data with missing values, which may profoundly affect downstream analyses. A wide variety of imputation methods have been established to deal with the missing-value issue. To date, however, there is a scarcity of efficient, systematic, and easy-to-handle tools that are tailored for proteomics community. Herein, we developed a user-friendly and powerful stand-alone software, NAguideR, to enable implementation and evaluation of different missing value methods offered by 23 widely used missing-value imputation algorithms. NAguideR further evaluates data imputation results through classic computational criteria and, unprecedentedly, proteomic empirical criteria, such as quantitative consistency between different charge-states of the same peptide, different peptides belonging to the same proteins, and individual proteins participating protein complexes and functional interactions. We applied NAguideR into three label-free proteomic datasets featuring peptide-level, protein-level, and phosphoproteomic variables respectively, all generated by data independent acquisition mass spectrometry (DIA-MS) with substantial biological replicates. The results indicate that NAguideR is able to discriminate the optimal imputation methods that are facilitating DIA-MS experiments over those sub-optimal and low-performance algorithms. NAguideR further provides downloadable tables and figures supporting flexible data analysis and interpretation. NAguideR is freely available at http://www.omicsolution.org/wukong/NAguideR/ and the source code: https://github.com/wangshisheng/NAguideR/.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Hu L."
                    },
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Liu Y."
                    }
                ],
                "citationCount": 7,
                "date": "2020-08-20T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NAguideR: Performing and prioritizing missing value imputations for consistent bottom-up proteomic analyses"
            },
            "pmcid": "PMC7641313",
            "pmid": "32526036"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ]
}