{
    "additionDate": "2017-03-25T16:29:45Z",
    "biotoolsCURIE": "biotools:evolview",
    "biotoolsID": "evolview",
    "credit": [
        {
            "email": "evolgenius.team@gmail.com",
            "name": "Evolview Team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web server for displaying, managing and customizing phylogenetic trees.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/evolgeniusteam/EvolviewDocumentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                },
                {
                    "term": "Phylogenetic tree annotation",
                    "uri": "http://edamontology.org/operation_0558"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://www.evolgenius.info/evolview.html",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "EvolView",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "EvolView is a web application for visualizing, annotating and managing phylogenetic trees. First, EvolView is a phylogenetic tree viewer and customization tool; it visualizes trees in various formats, customizes them through built-in functions that can link information from external datasets, and exports the customized results to publication-ready figures. Second, EvolView is a tree and dataset management tool: users can easily organize related trees into distinct projects, add new datasets to trees and edit and manage existing trees and datasets. To make EvolView easy to use, it is equipped with an intuitive user interface. With a free account, users can save data and manipulations on the EvolView server. EvolView is freely available at: http://www.evolgenius.info/evolview.html. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Gao S."
                    },
                    {
                        "name": "Lercher M.J."
                    },
                    {
                        "name": "Hu S."
                    },
                    {
                        "name": "Chen W.-H."
                    }
                ],
                "citationCount": 150,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EvolView, an online tool for visualizing, annotating and managing phylogenetic trees"
            },
            "pmid": "22695796"
        },
        {
            "doi": "10.1093/NAR/GKW370",
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.Evolview is an online visualization and management tool for customized and annotated phylogenetic trees. It allows users to visualize phylogenetic trees in various formats, customize the trees through built-in functions and user-supplied datasets and export the customization results to publication-ready figures. Its 'dataset system' contains not only the data to be visualized on the tree, but also 'modifiers' that control various aspects of the graphical annotation. Evolview is a single-page application (like Gmail); its carefully designed interface allows users to upload, visualize, manipulate and manage trees and datasets all in a single webpage. Developments since the last public release include a modern dataset editor with keyword highlighting functionality, seven newly added types of annotation datasets, collaboration support that allows users to share their trees and datasets and various improvements of the web interface and performance. In addition, we included eleven new 'Demo' trees to demonstrate the basic functionalities of Evolview, and five new 'Showcase' trees inspired by publications to showcase the power of Evolview in producing publication-ready figures. Evolview is freely available at: http://www.evolgenius.info/evolview/.",
                "authors": [
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Gao S."
                    },
                    {
                        "name": "Lercher M.J."
                    },
                    {
                        "name": "Chen W.-H."
                    },
                    {
                        "name": "Hu S."
                    }
                ],
                "citationCount": 189,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Evolview v2: an online visualization and management tool for customized and annotated phylogenetic trees"
            },
            "pmcid": "PMC4987921",
            "pmid": "27131786"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1,
    "version": [
        "2"
    ]
}