{
    "additionDate": "2019-11-14T18:38:41Z",
    "biotoolsCURIE": "biotools:IDSR",
    "biotoolsID": "IDSR",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "jnaiene@yahoo.com.br",
            "name": "Jeremias Domingos Naiene",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'IDSR Liberia', 'Liberia' | The implementation of integrated disease surveillance and response in Liberia after Ebola virus disease outbreak 2015-2017 | Introduction:Although Liberia adapted the integrated diseases surveillance and response (IDSR) in 2004 as a platform for implementation of International Health Regulation (IHR (2005)), IDSR was not actively implemented until 2015. Some innovations and best practices were observed during the implementation of IDSR in Liberia after Ebola virus disease outbreak. This paper describes the different approaches used for implementation of IDSR in Liberia from 2015 to 2017. Methods:We conducted a cross-sectional study using the findings from IDSR supervisions conducted from September to November 2017 and perused the outbreaks linelists submitted by the counties to the national level from January to December 2017 and key documents available at the national level",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31404272",
    "lastUpdate": "2019-11-14T18:38:41Z",
    "name": "IDSR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.11604/PAMJ.SUPP.2019.33.2.16820",
            "metadata": {
                "abstract": "Introduction: Although Liberia adapted the integrated diseases surveillance and response (IDSR) in 2004 as a platform for implementation of International Health Regulation (IHR (2005)), IDSR was not actively implemented until 2015. Some innovations and best practices were observed during the implementation of IDSR in Liberia after Ebola virus disease outbreak. This paper describes the different approaches used for implementation of IDSR in Liberia from 2015 to 2017. Methods: We conducted a cross-sectional study using the findings from IDSR supervisions conducted from September to November 2017 and perused the outbreaks linelists submitted by the counties to the national level from January to December 2017 and key documents available at the national level. Results: In 2017, the country piloted the use of mobile phones application to store and send data from the health facilities to the national level. In addition, an electronic platform for acute flaccid paralysis (AFP) surveillance called Auto-Visual AFP Detection and Reporting (AVADAR) was piloted in Montserrado County during the first semester of 2017. The timeliness and completeness of reports submitted from the counties to national level were above the target of 80% stable despite the challenges like insufficient resources, including skilled staff. Conclusion: IDSR is being actively implemented in Liberia since 2015. Although the country is facing the same challenges as other countries during the early stages of implementation of IDSR, the several innovations were implemented in a short time. The surveillance system reveled to be resilient, despite the challenges.",
                "authors": [
                    {
                        "name": "Nagbe T."
                    },
                    {
                        "name": "Naiene J.D."
                    },
                    {
                        "name": "Rude J.M."
                    },
                    {
                        "name": "Mahmoud N."
                    },
                    {
                        "name": "Kromah M."
                    },
                    {
                        "name": "Sesay J."
                    },
                    {
                        "name": "Chukwudi O.J."
                    },
                    {
                        "name": "Stephen M."
                    },
                    {
                        "name": "Talisuna A."
                    },
                    {
                        "name": "Yahaya A.A."
                    },
                    {
                        "name": "Rajatonirina S."
                    },
                    {
                        "name": "Fallah M."
                    },
                    {
                        "name": "Nyenswah T."
                    },
                    {
                        "name": "Dahn B."
                    },
                    {
                        "name": "Gasasira A."
                    },
                    {
                        "name": "Fall I.S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "The Pan African medical journal",
                "title": "The implementation of integrated disease surveillance and response in Liberia after Ebola virus disease outbreak 2015-2017"
            },
            "pmcid": "PMC6675929",
            "pmid": "31404272"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}