{
    "additionDate": "2018-07-31T11:37:11Z",
    "biotoolsCURIE": "biotools:rs-expnet-crnmf",
    "biotoolsID": "rs-expnet-crnmf",
    "credit": [
        {
            "email": "mhwang@ustc.edu.cn",
            "name": "Minghui Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Discovering mutated driver genes through a robust and sparse co-regularized matrix factorization framework with prior information from mRNA expression patterns and interaction network",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/USTC-HIlab/RS-ExpNet-CRNMF/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                }
            ]
        }
    ],
    "homepage": "https://github.com/USTC-HIlab/RS-ExpNet-CRNMF",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "RS-ExpNet-CRNMF",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2218-y",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: Discovery of mutated driver genes is one of the primary objective for studying tumorigenesis. To discover some relatively low frequently mutated driver genes from somatic mutation data, many existing methods incorporate interaction network as prior information. However, the prior information of mRNA expression patterns are not exploited by these existing network-based methods, which is also proven to be highly informative of cancer progressions. Results: To incorporate prior information from both interaction network and mRNA expressions, we propose a robust and sparse co-regularized nonnegative matrix factorization to discover driver genes from mutation data. Furthermore, our framework also conducts Frobenius norm regularization to overcome overfitting issue. Sparsity-inducing penalty is employed to obtain sparse scores in gene representations, of which the top scored genes are selected as driver candidates. Evaluation experiments by known benchmarking genes indicate that the performance of our method benefits from the two type of prior information. Our method also outperforms the existing network-based methods, and detect some driver genes that are not predicted by the competing methods. Conclusions: In summary, our proposed method can improve the performance of driver gene discovery by effectively incorporating prior information from interaction network and mRNA expression patterns into a robust and sparse co-regularized matrix factorization framework.",
                "authors": [
                    {
                        "name": "Xi J."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Li A."
                    }
                ],
                "citationCount": 3,
                "date": "2018-06-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Discovering mutated driver genes through a robust and sparse co-regularized matrix factorization framework with prior information from mRNA expression patterns and interaction network"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cancer",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}