{
    "additionDate": "2021-01-18T09:25:21Z",
    "biotoolsCURIE": "biotools:fobi",
    "biotoolsID": "fobi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asanchez@ub.edu",
            "name": "Alex Sánchez-Pla",
            "typeEntity": "Person"
        }
    ],
    "description": "FOBI (Food-Biomarker Ontology) an ontology to represent food intake data and associate it with metabolomic data. It is composed of  two interconnected sub-ontologies. One is a “Food Ontology” consisting of raw foods and prepared foods while the second is a “Biomarker Ontology” containing food intake biomarkers classified by their chemical classes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pcastellanoescuder/FoodBiomarkerOntology",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-03-11T10:33:12Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://polcastellano.shinyapps.io/FOBI_Visualization_Tool/"
        }
    ],
    "name": "FOBI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABA/BAAA033",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Nutrition research can be conducted by using two complementary approaches: (i) traditional self-reporting methods or (ii) via metabolomics techniques to analyze food intake biomarkers in biofluids. However, the complexity and heterogeneity of these two very different types of data often hinder their analysis and integration. To manage this challenge, we have developed a novel ontology that describes food and their associated metabolite entities in a hierarchical way. This ontology uses a formal naming system, category definitions, properties and relations between both types of data. The ontology presented is called FOBI (Food-Biomarker Ontology) and it is composed of two interconnected sub-ontologies. One is a 'Food Ontology' consisting of raw foods and 'multi-component foods' while the second is a 'Biomarker Ontology' containing food intake biomarkers classified by their chemical classes. These two sub-ontologies are conceptually independent but interconnected by different properties. This allows data and information regarding foods and food biomarkers to be visualized in a bidirectional way, going from metabolomics to nutritional data or vice versa. Potential applications of this ontology include the annotation of foods and biomarkers using a well-defined and consistent nomenclature, the standardized reporting of metabolomics workflows (e.g. metabolite identification, experimental design) or the application of different enrichment analysis approaches to analyze nutrimetabolomic data. Availability: FOBI is freely available in both OWL (Web Ontology Language) and OBO (Open Biomedical Ontologies) formats at the project's Github repository (https://github.com/pcastellanoescuder/FoodBiomarkerOntology) and FOBI visualization tool is available in https://polcastellano.shinyapps.io/FOBI-Visualization-Tool/.",
                "authors": [
                    {
                        "name": "Castellano-Escuder P."
                    },
                    {
                        "name": "Gonzalez-Dominguez R."
                    },
                    {
                        "name": "Wishart D.S."
                    },
                    {
                        "name": "Andres-Lacueva C."
                    },
                    {
                        "name": "Sanchez-Pla A."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "FOBI: An ontology to represent food intake data and associate it with metabolomic data"
            },
            "pmcid": "PMC7298227",
            "pmid": "32556148"
        }
    ],
    "toolType": [
        "Ontology"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}