{
    "accessibility": "Open access",
    "additionDate": "2023-01-25T23:25:30.835941Z",
    "biotoolsCURIE": "biotools:sesam",
    "biotoolsID": "sesam",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "matthieu.falque@inrae.fr",
            "name": "Matthieu Falque",
            "orcidid": "https://orcid.org/0000-0002-6444-858X",
            "typeEntity": "Person"
        },
        {
            "name": "Adrien Vidal",
            "orcidid": "http://orcid.org/0000-0001-5139-6445"
        },
        {
            "name": "Franck Gauthier",
            "orcidid": "http://orcid.org/0000-0003-0574-065X"
        },
        {
            "name": "Olivier C. Martin",
            "orcidid": "http://orcid.org/0000-0002-5295-5963"
        }
    ],
    "description": "The SeSAM R package allows fully automatic construction of two successive genetic maps.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Physical mapping",
                    "uri": "http://edamontology.org/operation_2944"
                }
            ]
        }
    ],
    "homepage": "https://forgemia.inra.fr/gqe-acep/sesam",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2023-01-25T23:25:30.839002Z",
    "license": "GPL-3.0",
    "name": "SeSAM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-05045-7",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Genotyping and sequencing technologies produce increasingly large numbers of genetic markers with potentially high rates of missing or erroneous data. Therefore, the construction of linkage maps is more and more complex. Moreover, the size of segregating populations remains constrained by cost issues and is less and less commensurate with the numbers of SNPs available. Thus, guaranteeing a statistically robust marker order requires that maps include only a carefully selected subset of SNPs. Results: In this context, the SeSAM software allows automatic genetic map construction using seriation and placement approaches, to produce (1) a high-robustness framework map which includes as many markers as possible while keeping the order robustness beyond a given statistical threshold, and (2) a high-density total map including the framework plus almost all polymorphic markers. During this process, care is taken to limit the impact of genotyping errors and of missing data on mapping quality. SeSAM can be used with a wide range of biparental populations including from outcrossing species for which phases are inferred on-the-fly by maximum-likelihood during map elongation. The package also includes functions to simulate data sets, convert data formats, detect putative genotyping errors, visualize data and map quality (including graphical genotypes), and merge several maps into a consensus. SeSAM is also suitable for interactive map construction, by providing lower-level functions for 2-point and multipoint EM analyses. The software is implemented in a R package including functions in C++. Conclusions: SeSAM is a fully automatic linkage mapping software designed to (1) produce a framework map as robust as desired by optimizing the selection of a subset of markers, and (2) produce a high-density map including almost all polymorphic markers. The software can be used with a wide range of biparental mapping populations including cases from outcrossing. SeSAM is freely available under a GNU GPL v3 license and works on Linux, Windows, and macOS platforms. It can be downloaded together with its user-manual and quick-start tutorial from ForgeMIA (SeSAM project) at https://forgemia.inra.fr/gqe-acep/sesam/-/releases.",
                "authors": [
                    {
                        "name": "Chevrolier N."
                    },
                    {
                        "name": "Falque M."
                    },
                    {
                        "name": "Gauthier F."
                    },
                    {
                        "name": "Guiglielmoni N."
                    },
                    {
                        "name": "Jasson S."
                    },
                    {
                        "name": "Leroux D."
                    },
                    {
                        "name": "Martin O.C."
                    },
                    {
                        "name": "Rodrigez W."
                    },
                    {
                        "name": "Tourrette E."
                    },
                    {
                        "name": "Vidal A."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SeSAM: software for automatic construction of order-robust linkage maps"
            },
            "pmcid": "PMC9675223",
            "pmid": "36402957"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
