
{
    "credit": [
        {
            "email": "lindsay.cowell@utsouthwestern.edu",
            "name": "Lindsay G. Cowell",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://bitbucket.org/vdjserver/vdj_pipe"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: Pre-processing of high-throughput sequencing data for immune repertoire profiling is essential to insure high quality input for downstream analysis. VDJPipe is a flexible, high-performance tool that can perform multiple pre-processing tasks with just a single pass over the data files. Results: Processing tasks provided by VDJPipe include base composition statistics calculation, read quality statistics calculation, quality filtering, homopolymer filtering, length and nucleotide filtering, paired-read merging, barcode demultiplexing, 5' and 3' PCR primer matching, and duplicate reads collapsing. VDJPipe utilizes a pipeline approach whereby multiple processing steps are performed in a sequential workflow, with the output of each step passed as input to the next step automatically. The workflow is flexible enough to handle the complex barcoding schemes used in many immunosequencing experiments. Because VDJPipe is designed for computational efficiency, we evaluated this by comparing execution times with those of pRESTO, a widely-used pre-processing tool for immune repertoire sequencing data. We found that VDJPipe requires <10% of the run time required by pRESTO. Conclusions: VDJPipe is a high-performance tool that is optimized for pre-processing large immune repertoire sequencing data sets.",
            "authors": [
                "Christley S.",
                "Levin M.K.",
                "Toby I.T.",
                "Fonner J.M.",
                "Monson N.L.",
                "Rounds W.H.",
                "Rubelt F.",
                "Scarborough W.",
                "Scheuermann R.H.",
                "Cowell L.G."
            ],
            "cit_count": 3,
            "doi": "10.1186/s12859-017-1853-z",
            "journal": "BMC Bioinformatics",
            "title": "VDJPipe: A pipelined tool for pre-processing immune repertoire sequencing data",
            "type": "Primary",
            "year": "2017-10-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vdjpipe",
        "biotoolsID": "vdjpipe",
        "description": "Pipelined tool for pre-processing immune repertoire sequencing data.",
        "homepage": "https://vdjserver.org/vdjpipe/index.html",
        "name": "VDJPipe"
    }
}