
{
    "credit": [
        {
            "email": "harald.barsnes@ii.uib.no",
            "name": "Harald Barsnes",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.uib.no/rg/probe"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/compomics/ols-dialog/blob/master/README.txt"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Ontology and terminology",
                "uri": "http://edamontology.org/topic_0089"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ols-dialog-3-4-0-java-front-ontology-lookup-service.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: With the growing amount of biomedical data available in public databases it has become increasingly important to annotate data in a consistent way in order to allow easy access to this rich source of information. Annotating the data using controlled vocabulary terms and ontologies makes it much easier to compare and analyze data from different sources. However, finding the correct controlled vocabulary terms can sometimes be a difficult task for the end user annotating these data.Results: In order to facilitate the location of the correct term in the correct controlled vocabulary or ontology, the Ontology Lookup Service was created. However, using the Ontology Lookup Service as a web service is not always feasible, especially for researchers without bioinformatics support. We have therefore created a Java front end to the Ontology Lookup Service, called the OLS Dialog, which can be plugged into any application requiring the annotation of data using controlled vocabulary terms, making it possible to find and use controlled vocabulary terms without requiring any additional knowledge about web services or ontology formats.Conclusions: As a user-friendly open source front end to the Ontology Lookup Service, the OLS Dialog makes it straightforward to include controlled vocabulary support in third-party tools, which ultimately makes the data even more valuable to the biomedical community. © 2010 Barsnes et al; licensee BioMed Central Ltd.",
            "authors": [
                "Barsnes H.",
                "Cote R.G.",
                "Eidhammer I.",
                "Martens L."
            ],
            "cit_count": 10,
            "journal": "BMC Bioinformatics",
            "pmid": "20078892",
            "title": "OLS Dialog: An open-source front end to the Ontology Lookup Service",
            "year": "2010-01-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ols_dialog",
        "biotoolsID": "ols_dialog",
        "description": "Java front end to the Ontology Lookup Service allowing easy access to an extensive list of biomedical ontologies.",
        "homepage": "https://code.google.com/p/ols-dialog/",
        "name": "OLS Dialog"
    }
}