
{
    "credit": [
        {
            "email": "lbrinkac@jcvi.org",
            "name": "Lauren Brinkac",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Infectious disease",
                "uri": "http://edamontology.org/topic_3324"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Pathema (http://pathema.jcvi.org) is one of the eight Bioinformatics Resource Centers (BRCs) funded by the National Institute of Allergy and Infectious Disease (NIAID) designed to serve as a core resource for the bio-defense and infectious disease research community. Pathema strives to support basic research and accelerate scientific progress for understanding, detecting, diagnosing and treating an established set of six target NIAID Category A-C pathogens: Category A priority pathogens; Bacillus anthracis and Clostridium botulinum, and Category B priority pathogens; Burkholderia mallei, Burkholderia pseudomallei, Clostridium perfringens and Entamoeba histolytica. Each target pathogen is represented in one of four distinct clade-specific Pathema web resources and underlying databases developed to target the specific data and analysis needs of each scientific community. All publicly available complete genome projects of phylogenetically related organisms are also represented, providing a comprehensive collection of organisms for comparative analyses. Pathema facilitates the scientific exploration of genomic and related data through its integration with web-based analysis tools, customized to obtain, display, and compute results relevant to ongoing pathogen research. Pathema serves the bio-defense and infectious disease research community by disseminating data resulting from pathogen genome sequencing projects and providing access to the results of inter-genomic comparisons for these organisms. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Brinkac L.M.",
                "Davidsen T.",
                "Beck E.",
                "Ganapathy A.",
                "Caler E.",
                "Dodson R.J.",
                "Durkin A.S.",
                "Harkins D.M.",
                "Lorenzi H.",
                "Madupu R.",
                "Sebastian Y.",
                "Shrivastava S.",
                "Thiagarajan M.",
                "Orvis J.",
                "Sundaram J.P.",
                "Crabtree J.",
                "Galens K.",
                "Zhao Y.",
                "Inman J.M.",
                "Montgomery R.",
                "Schobel S.",
                "Galinsky K.",
                "Tanenbaum D.M.",
                "Resnick A.",
                "Zafar N.",
                "White O.",
                "Sutton G."
            ],
            "cit_count": 19,
            "journal": "Nucleic Acids Research",
            "pmid": "19843611",
            "title": "Pathema: A clade-specific bioinformatics resource center for pathogen research",
            "year": "2009-10-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pathema",
        "biotoolsID": "pathema",
        "description": "It is a site for understanding, detecting, diagnosing and treating an established set of six target NIAID Category A-C pathogens. Each target pathogen is represented in one of four distinct clade-specific Pathema web resources and underlying databases. All publicly available complete genome projects of phylogenetically related organisms are also represented, providing a comprehensive collection of organisms for comparative analyses.",
        "homepage": "http://pathema.jcvi.org",
        "name": "Pathema"
    }
}