{
    "additionDate": "2019-11-14T19:49:41Z",
    "biotoolsCURIE": "biotools:R-LiNK",
    "biotoolsID": "R-LiNK",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "frank.bellivier@inserm.fr",
            "name": "Frank Bellivier",
            "orcidid": "https://orcid.org/0000-0002-3660-6640",
            "typeEntity": "Person"
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'Response Lithium Network' | Prospective cohort study of early biosignatures of response to lithium in bipolar-I-disorders | Optimizing response to lithium treatment through personalized evaluation of individuals with bipolar I disorder: the R-LiNK initiative | R-Link is a multinational study funded by the European Union’s Horizon 2020 Research and Innovation programme. R-Link involves eight European countries including France, United Kingdom, Denmark, Spain, Norway, Sweden, Germany and Italy",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.r-link.eu.com/",
    "lastUpdate": "2019-11-14T19:49:41Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://rlink.eu.com/"
        }
    ],
    "name": "R-LiNK",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S40345-019-0156-X",
            "metadata": {
                "abstract": "© 2019, The Author(s).Background: Lithium is recommended as a first line treatment for bipolar disorders. However, only 30% of patients show an optimal outcome and variability in lithium response and tolerability is poorly understood. It remains difficult for clinicians to reliably predict which patients will benefit without recourse to a lengthy treatment trial. Greater precision in the early identification of individuals who are likely to respond to lithium is a significant unmet clinical need. Structure: The H2020-funded Response to Lithium Network (R-LiNK; http://www.r-link.eu.com/) will undertake a prospective cohort study of over 300 individuals with bipolar-I-disorder who have agreed to commence a trial of lithium treatment following a recommendation by their treating clinician. The study aims to examine the early prediction of lithium response, non-response and tolerability by combining systematic clinical syndrome subtyping with examination of multi-modal biomarkers (or biosignatures), including omics, neuroimaging, and actigraphy, etc. Individuals will be followed up for 24 months and an independent panel will assess and classify each participants’ response to lithium according to predefined criteria that consider evidence of relapse, recurrence, remission, changes in illness activity or treatment failure (e.g. stopping lithium; new prescriptions of other mood stabilizers) and exposure to lithium. Novel elements of this study include the recruitment of a large, multinational, clinically representative sample specifically for the purpose of studying candidate biomarkers and biosignatures; the application of lithium-7 magnetic resonance imaging to explore the distribution of lithium in the brain; development of a digital phenotype (using actigraphy and ecological momentary assessment) to monitor daily variability in symptoms; and economic modelling of the cost-effectiveness of introducing biomarker tests for the customisation of lithium treatment into clinical practice. Also, study participants with sub-optimal medication adherence will be offered brief interventions (which can be delivered via a clinician or smartphone app) to enhance treatment engagement and to minimize confounding of lithium non-response with non-adherence. Conclusions: The paper outlines the rationale, design and methodology of the first study being undertaken by the newly established R-LiNK collaboration and describes how the project may help to refine the clinical response phenotype and could translate into the personalization of lithium treatment.",
                "authors": [
                    {
                        "name": "Scott J."
                    },
                    {
                        "name": "Hidalgo-Mazzei D."
                    },
                    {
                        "name": "Strawbridge R."
                    },
                    {
                        "name": "Young A."
                    },
                    {
                        "name": "Resche-Rigon M."
                    },
                    {
                        "name": "Etain B."
                    },
                    {
                        "name": "Andreassen O.A."
                    },
                    {
                        "name": "Bauer M."
                    },
                    {
                        "name": "Bennabi D."
                    },
                    {
                        "name": "Blamire A.M."
                    },
                    {
                        "name": "Boumezbeur F."
                    },
                    {
                        "name": "Brambilla P."
                    },
                    {
                        "name": "Cattane N."
                    },
                    {
                        "name": "Cattaneo A."
                    },
                    {
                        "name": "Chupin M."
                    },
                    {
                        "name": "Coello K."
                    },
                    {
                        "name": "Cointepas Y."
                    },
                    {
                        "name": "Colom F."
                    },
                    {
                        "name": "Cousins D.A."
                    },
                    {
                        "name": "Dubertret C."
                    },
                    {
                        "name": "Duchesnay E."
                    },
                    {
                        "name": "Ferro A."
                    },
                    {
                        "name": "Garcia-Estela A."
                    },
                    {
                        "name": "Goikolea J."
                    },
                    {
                        "name": "Grigis A."
                    },
                    {
                        "name": "Haffen E."
                    },
                    {
                        "name": "Hoegh M.C."
                    },
                    {
                        "name": "Jakobsen P."
                    },
                    {
                        "name": "Kalman J.L."
                    },
                    {
                        "name": "Kessing L.V."
                    },
                    {
                        "name": "Klohn-Saghatolislam F."
                    },
                    {
                        "name": "Lagerberg T.V."
                    },
                    {
                        "name": "Landen M."
                    },
                    {
                        "name": "Lewitzka U."
                    },
                    {
                        "name": "Lutticke A."
                    },
                    {
                        "name": "Mazer N."
                    },
                    {
                        "name": "Mazzelli M."
                    },
                    {
                        "name": "Mora C."
                    },
                    {
                        "name": "Muller T."
                    },
                    {
                        "name": "Mur-Mila E."
                    },
                    {
                        "name": "Oedegaard K.J."
                    },
                    {
                        "name": "Oltedal L."
                    },
                    {
                        "name": "Palsson E."
                    },
                    {
                        "name": "Papadopoulos Orfanos D."
                    },
                    {
                        "name": "Papiol S."
                    },
                    {
                        "name": "Perez-Sola V."
                    },
                    {
                        "name": "Reif A."
                    },
                    {
                        "name": "Ritter P."
                    },
                    {
                        "name": "Rossi R."
                    },
                    {
                        "name": "Schulze T."
                    },
                    {
                        "name": "Senner F."
                    },
                    {
                        "name": "Smith F.E."
                    },
                    {
                        "name": "Squarcina L."
                    },
                    {
                        "name": "Steen N.E."
                    },
                    {
                        "name": "Thelwall P.E."
                    },
                    {
                        "name": "Varo C."
                    },
                    {
                        "name": "Vieta E."
                    },
                    {
                        "name": "Vinberg M."
                    },
                    {
                        "name": "Wessa M."
                    },
                    {
                        "name": "Westlye L.T."
                    },
                    {
                        "name": "Bellivier F."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-01T00:00:00Z",
                "journal": "International Journal of Bipolar Disorders",
                "title": "Prospective cohort study of early biosignatures of response to lithium in bipolar-I-disorders: overview of the H2020-funded R-LiNK initiative"
            },
            "pmcid": "PMC6760458",
            "pmid": "31552554"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}