{
    "additionDate": "2020-01-14T09:07:56Z",
    "biotoolsCURIE": "biotools:iEDGE",
    "biotoolsID": "iEDGE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "smonti@bu.edu",
            "name": "Stefano Monti",
            "orcidid": "https://orcid.org/0000-0002-9376-0660",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of candidate cancer drivers by integrative Epi-DNA and Gene Expression (iEDGE) data analysis.\n\nintegrative analysis of (epi-)DNA and gene expression data for the identification of candidate cancer drivers.\n\niEDGE is an R-package for performing integrative analysis of (epi-)DNA and gene expression data that builds upon, and significantly expands, the methodology first described in Monti, Chapuy, et. al., Cancer Cell (2012). This package provides the generalized pipeline to perform integrative analysis of epi-genomic data (methylation, copy number alteration, mutation, microRNA, etc.) and gene-expression data from paired samples, and consists of 3 major modules:.\n\nIntegrative analysis of (Epi-)DNA and Gene Expression Data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://montilab.bu.edu/iEDGE",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2020-12-14T08:33:52Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://montilab.github.io/iEDGE"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/montilab/iEDGE"
        }
    ],
    "name": "iEDGE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-52886-Z",
            "metadata": {
                "abstract": "© 2019, The Author(s).The emergence of large-scale multi-omics data warrants method development for data integration. Genomic studies from cancer patients have identified epigenetic and genetic regulators – such as methylation marks, somatic mutations, and somatic copy number alterations (SCNAs), among others – as predictive features of cancer outcome. However, identification of “driver genes” associated with a given alteration remains a challenge. To this end, we developed a computational tool, iEDGE, to model cis and trans effects of (epi-)DNA alterations and identify potential cis driver genes, where cis and trans genes denote those genes falling within and outside the genomic boundaries of a given (epi-)genetic alteration, respectively. iEDGE first identifies the cis and trans gene expression signatures associated with the presence/absence of a particular epi-DNA alteration across samples. It then applies tests of statistical mediation to determine the cis genes predictive of the trans gene expression. Finally, cis and trans effects are annotated by pathway enrichment analysis to gain insights into the underlying regulatory networks. We used iEDGE to perform integrative analysis of SCNAs and gene expression data from breast cancer and 18 additional cancer types included in The Cancer Genome Atlas (TCGA). Notably, cis gene drivers identified by iEDGE were found to be significantly enriched for known driver genes from multiple compendia of validated oncogenes and tumor suppressors, suggesting that the remainder are of equal importance. Furthermore, predicted drivers were enriched for functionally relevant cancer genes with amplification-driven dependencies, which are of potential prognostic and therapeutic value. All the analyses results are accessible at https://montilab.bu.edu/iEDGE. In summary, integrative analysis of SCNAs and gene expression using iEDGE successfully identified known cancer driver genes and putative cancer therapeutic targets across 19 cancer types in the TCGA. The proposed method can easily be applied to the integration of gene expression profiles with other epi-DNA assays in a variety of disease contexts.",
                "authors": [
                    {
                        "name": "Chapuy B."
                    },
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Monti S."
                    },
                    {
                        "name": "Sebastiani P."
                    },
                    {
                        "name": "Varelas X."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Identification of candidate cancer drivers by integrative Epi-DNA and Gene Expression (iEDGE) data analysis"
            },
            "pmcid": "PMC6858347",
            "pmid": "31729402"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
