{
    "accessibility": "Open access",
    "additionDate": "2022-06-25T08:49:04.700654Z",
    "biotoolsCURIE": "biotools:dsdbase",
    "biotoolsID": "dsdbase",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mini@ncbs.res.in",
            "name": "Ramanathan Sowdhamini",
            "typeEntity": "Person"
        }
    ],
    "description": "DSDBASE is a database on disulphide bonds in proteins that provides information on native disulphides and those which are stereochemically possible between pairs of residues in a protein.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Protein cysteine and disulfide bond assignment",
                    "uri": "http://edamontology.org/operation_1850"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://caps.ncbs.res.in/dsdbase2",
    "lastUpdate": "2024-11-24T16:01:17.254392Z",
    "name": "DSDBASE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/database/baac005",
            "metadata": {
                "abstract": "Disulphide bonds are stabilizing crosslinks in proteins and serve to enhance their thermal stability. In proteins that are small and rich in disulphide bonds, they could be the major determining factor for the choice of conformational state since their constraints on appropriate backbone conformation can be substantial. Such crosslinks and their positional conservation could itself enable protein family and functional association. Despite the importance of the field, there is no comprehensive database on disulphide crosslinks that is available to the public. Herein we provide information on disulphides in DSDBASE2.0, an updated and significantly expanded database that is freely available, fully annotated and manually curated database on native and modelled disulphides. The web interface also provides several useful computational tools that have been specifically developed for proteins containing disulphide crosslinks. The modelling of disulphide crosslinks is performed using stereochemical criteria, coded within our Modelling of Disulphides in Proteins (MODIP) algorithm. The inclusion of modelled disulphides potentially enhances the loop database substantially, thereby permitting the recognition of compatible polypeptide segments that could serve as templates for immediate modelling. The DSDBASE2.0 database has been updated to include 153,944 PDB entries, 216,096 native and 20,153,850 modelled disulphide bond segments from PDB January 2021 release. The current database also provides a resource to user-friendly search for multiple disulphide bond containing loops, along with annotation of their function using GO and subcellular localization of the query. Furthermore, it is possible to obtain the three-dimensional models of disulphide-rich small proteins using an independent algorithm, RANMOD, that generates and examines random, but allowed backbone conformations of the polypeptide. DSDBASE2.0 still remains the largest open-access repository that organizes all disulphide bonds of proteins on a single platform. The database can be accessed from http://caps.ncbs.res.in/dsdbase2.",
                "authors": [
                    {
                        "name": "Indrakumar S."
                    },
                    {
                        "name": "Kalmankar N.V."
                    },
                    {
                        "name": "Pavalam M."
                    },
                    {
                        "name": "Sowdhamini R."
                    },
                    {
                        "name": "Srinivasan N."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Database",
                "title": "DSDBASE 2.0: Updated version of DiSulphide dataBASE, a database on disulphide bonds in proteins"
            },
            "pmcid": "PMC9216586",
            "pmid": "35230424"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
