{
    "additionDate": "2019-11-14T18:35:31Z",
    "biotoolsCURIE": "biotools:THBP",
    "biotoolsID": "THBP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xuyan04@gmail.com",
            "name": "Yan Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "Mapping anatomical related entities to human body parts based on wikipedia in discharge summaries | *: Background Consisting of dictated free-text documents such as discharge summaries, medical narratives are widely used in medical natural language processing. Relationships between anatomical entities and human body parts are crucial for building medical text mining applications. To achieve this, we establish a mapping system consisting of a Wikipedia-based scoring algorithm and a named entity normalization method (NEN). The mapping system makes full use of information available on Wikipedia, which is a comprehensive Internet medical knowledge base",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xuyanbuaa/THBP",
    "language": [
        "C#"
    ],
    "lastUpdate": "2020-12-28T12:19:29Z",
    "name": "THBP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3005-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background Consisting of dictated free-text documents such as discharge summaries, medical narratives are widely used in medical natural language processing. Relationships between anatomical entities and human body parts are crucial for building medical text mining applications. To achieve this, we establish a mapping system consisting of a Wikipedia-based scoring algorithm and a named entity normalization method (NEN). The mapping system makes full use of information available on Wikipedia, which is a comprehensive Internet medical knowledge base. We also built a new ontology, Tree of Human Body Parts (THBP), from core anatomical parts by referring to anatomical experts and Unified Medical Language Systems (UMLS) to make the mapping system efficacious for clinical treatments.: Result The gold standard is derived from 50 discharge summaries from our previous work, in which 2,224 anatomical entities are included. The F1-measure of the baseline system is 70.20%, while our algorithm based on Wikipedia achieves 86.67% with the assistance of NEN.: Conclusions We construct a framework to map anatomical entities to THBP ontology using normalization and a scoring algorithm based on Wikipedia. The proposed framework is proven to be much more effective and efficient than the main baseline system.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Fan X."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Chang E.I.-C."
                    },
                    {
                        "name": "Ananiadou S."
                    },
                    {
                        "name": "Tsujii J."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "date": "2019-08-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Mapping anatomical related entities to human body parts based on wikipedia in discharge summaries"
            },
            "pmcid": "PMC6697955",
            "pmid": "31419946"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        }
    ],
    "validated": 1
}