{
    "additionDate": "2015-02-16T10:06:57Z",
    "biotoolsCURIE": "biotools:eman",
    "biotoolsID": "eman",
    "credit": [
        {
            "email": "sludtke@bcm.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ncmi.bcm.edu/ncmi"
        }
    ],
    "description": "A scientific image processing package with a particular focus on single particle reconstruction from transmission electron microscopy (TEM) images. he suite now also offers support for single particle cryo-ET, and tools useful in many other subdisciplines such as helical reconstruction, 2-D crystallography and whole-cell tomography.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://blake.bcm.edu/emanwiki/EMAN"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "3D profile generation",
                    "uri": "http://edamontology.org/operation_0297"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                }
            ]
        }
    ],
    "homepage": "http://blake.bcm.edu/emanwiki/EMAN",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T15:56:16.623866Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/eman-2-04-suite-scientific-image-processing-tools.html"
        }
    ],
    "name": "EMAN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_016867"
        }
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1006/jsbi.1999.4174",
            "metadata": {
                "abstract": "We present EMAN (Electron Micrograph ANalysis), a software package for performing semiautomated single-particle reconstructions from transmission electron micrographs. The goal of this project is to provide software capable of performing single-particle reconstructions beyond 10 Å as such high- resolution data become available. A complete single-particle reconstruction algorithm is implemented. Options are available to generate an initial model for particles with no symmetry, a single axis of rotational symmetry, or icosahedral symmetry. Model refinement is an iterative process, which utilizes classification by model-based projection matching. CTF (contrast transfer function) parameters are determined using a new paradigm in which data from multiple micrographs are fit simultaneously. Amplitude and phase CTF correction is then performed automatically as part of the refinement loop. A graphical user interface is provided, so even those with little image processing experience will be able to begin performing reconstructions. Advanced users can directly use the lower level shell commands and even expand the package utilizing EMAN's extensive image-processing library. The package was written from scratch in C++ and is provided free of charge on our Web site. We present an overview of the package as well as several conformance tests with simulated data.",
                "authors": [
                    {
                        "name": "Baldwin P.R."
                    },
                    {
                        "name": "Chiu W."
                    },
                    {
                        "name": "Ludtke S.J."
                    }
                ],
                "citationCount": 2140,
                "date": "1999-12-01T00:00:00Z",
                "journal": "Journal of Structural Biology",
                "title": "EMAN: Semiautomated software for high-resolution single-particle reconstructions"
            },
            "pmid": "10600563"
        },
        {
            "doi": "10.1016/j.jsb.2006.05.009",
            "metadata": {
                "abstract": "EMAN is a scientific image processing package with a particular focus on single particle reconstruction from transmission electron microscopy (TEM) images. It was first released in 1999, and new versions have been released typically 2-3 times each year since that time. EMAN2 has been under development for the last two years, with a completely refactored image processing library, and a wide range of features to make it much more flexible and extensible than EMAN1. The user-level programs are better documented, more straightforward to use, and written in the Python scripting language, so advanced users can modify the programs' behavior without any recompilation. A completely rewritten 3D transformation class simplifies translation between Euler angle standards and symmetry conventions. The core C++ library has over 500 functions for image processing and associated tasks, and it is modular with introspection capabilities, so programmers can add new algorithms with minimal effort and programs can incorporate new capabilities automatically. Finally, a flexible new parallelism system has been designed to address the shortcomings in the rigid system in EMAN1. © 2006 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Baldwin P.R."
                    },
                    {
                        "name": "Jiang W."
                    },
                    {
                        "name": "Ludtke S.J."
                    },
                    {
                        "name": "Mann D.S."
                    },
                    {
                        "name": "Peng L."
                    },
                    {
                        "name": "Rees I."
                    },
                    {
                        "name": "Tang G."
                    }
                ],
                "citationCount": 2316,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Journal of Structural Biology",
                "title": "EMAN2: An extensible image processing suite for electron microscopy"
            },
            "pmid": "16859925"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1,
    "version": [
        "2.2"
    ]
}
