{
    "additionDate": "2022-12-23T08:24:41.063297Z",
    "biotoolsCURIE": "biotools:cat-net",
    "biotoolsID": "cat-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Alex Ling Yu Hung"
        }
    ],
    "description": "A Cross-Slice Attention Transformer Model for Prostate Zonal Segmentation in MRI.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/aL3x-O-o-Hung/CAT-Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-23T08:24:41.066164Z",
    "name": "CAT-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TMI.2022.3211764",
            "metadata": {
                "abstract": "AuthorProstate cancer is the second leading cause of cancer death among men in the United States. The diagnosis of prostate MRI often relies on accurate prostate zonal segmentation. However, state-of-the-art automatic segmentation methods often fail to produce well-contained volumetric segmentation of the prostate zones since certain slices of prostate MRI, such as base and apex slices, are harder to segment than other slices. This difficulty can be overcome by leveraging important multi-scale image-based information from adjacent slices, but current methods do not fully learn and exploit such cross-slice information. In this paper, we propose a novel cross-slice attention mechanism, which we use in a Transformer module to systematically learn cross-slice information at multiple scales. The module can be utilized in any existing deep-learning-based segmentation framework with skip connections. Experiments show that our cross-slice attention is able to capture cross-slice information significant for prostate zonal segmentation in order to improve the performance of current state-of-the-art methods. Cross-slice attention improves segmentation accuracy in the peripheral zones, such that segmentation results are consistent across all the prostate slices (apex, mid-gland, and base). The code for the proposed model is available at https://github.com/aL3x-O-o-Hung/CAT-Net.",
                "authors": [
                    {
                        "name": "Hung A.L.Y."
                    },
                    {
                        "name": "Miao Q."
                    },
                    {
                        "name": "Raman S.S."
                    },
                    {
                        "name": "Sung K."
                    },
                    {
                        "name": "Terzopoulos D."
                    },
                    {
                        "name": "Zheng H."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "CAT-Net: A Cross-Slice Attention Transformer Model for Prostate Zonal Segmentation in MRI"
            },
            "pmid": "36194719"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
