{
    "additionDate": "2024-01-23T12:16:36.626140Z",
    "biotoolsCURIE": "biotools:scviewer",
    "biotoolsID": "scviewer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "abhijeetr.patil@tevapharm.com",
            "name": "Abhijeet R. Patil",
            "orcidid": "https://orcid.org/0000-0003-1444-1555",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive single-cell gene expression visualization tool.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "homepage": "https://github.com/arpatil01/scViewer",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T14:20:08.821534Z",
    "name": "scViewer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/cells12111489",
            "metadata": {
                "abstract": "Single-cell RNA sequencing (scRNA-seq) is an attractive technology for researchers to gain valuable insights into the cellular processes and cell type diversity present in all tissues. The data generated by the scRNA-seq experiment are high-dimensional and complex in nature. Several tools are now available to analyze the raw scRNA-seq data from public databases; however, simple and easy-to-explore single-cell gene expression visualization tools focusing on differential expression and co-expression are lacking. Here, we present scViewer, an interactive graphical user interface (GUI) R/Shiny application designed to facilitate the visualization of scRNA-seq gene expression data. With the processed Seurat RDS object as input, scViewer utilizes several statistical approaches to provide detailed information on the loaded scRNA-seq experiment and generates publication-ready plots. The major functionalities of scViewer include exploring cell-type-specific gene expression, co-expression analysis of two genes, and differential expression analysis with different biological conditions considering both cell-level and subject-level variations using negative binomial mixed modeling. We utilized a publicly available dataset (brain cells from a study of Alzheimer’s disease to demonstrate the utility of our tool. scViewer can be downloaded from GitHub as a Shiny app with local installation. Overall, scViewer is a user-friendly application that will allow researchers to visualize and interpret the scRNA-seq data efficiently for multi-condition comparison by performing gene-level differential expression and co-expression analysis on the fly. Considering the functionalities of this Shiny app, scViewer can be a great resource for collaboration between bioinformaticians and wet lab scientists for faster data visualizations.",
                "authors": [
                    {
                        "name": "Kumar G."
                    },
                    {
                        "name": "Patil A.R."
                    },
                    {
                        "name": "Warren L."
                    },
                    {
                        "name": "Zhou H."
                    }
                ],
                "citationCount": 3,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Cells",
                "title": "scViewer: An Interactive Single-Cell Gene Expression Visualization Tool"
            },
            "pmcid": "PMC10253102",
            "pmid": "37296611"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
