
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "topic": [
            {
                "term": "Surgery",
                "uri": "http://edamontology.org/topic_3421"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2020 American Society for Investigative Pathology and the Association for Molecular PathologyA quantitative chimerism test monitors engraftment of donor hematopoietic stem cells or relapse of leukemias or lymphomas in hematopoietic stem cell transplantation patients. The most common method used for chimerism testing is PCR amplification of short tandem repeat loci, followed by capillary gel electrophoresis. Manual data analysis is tedious and time consuming, as it involves the selection of informative loci and the repetition of quantifying chimerism percentage for multiple loci from multiple cell types. It is also susceptible to human errors. Currently, there is no free software to fully automate chimerism data analysis. Rchimerism, an R shiny package, was developed to automatically pick informative loci, calculate chimerism percentage, and display the results through a user-friendly interface. The accuracy of the program was compared with manual calculation on 60 patient samples with 100% concordance. Compared with manual calculation, Rchimerism drastically reduces analysis time from 20 to 40 minutes for single donor transplantation samples and from 40 to 80 minutes for double donor transplantation samples to >1 minute. Rchimerism can be downloaded and used freely by noncommercial laboratories.",
            "authors": [
                "Siddiqui Z.",
                "Maldonado J.",
                "Grojean J.",
                "Ye F.",
                "Zhang D.",
                "Longtine J.",
                "Ahn T.-H.",
                "Guo H."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.JMOLDX.2019.08.005",
            "journal": "Journal of Molecular Diagnostics",
            "pmid": "31605803",
            "title": "Rchimerism: An R Package for Automated Chimerism Data Analysis",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Rchimerism",
        "biotoolsID": "Rchimerism",
        "description": "An R Package for Automated Chimerism Data Analysis.\n\nA quantitative chimerism test monitors engraftment of donor hematopoietic stem cells or relapse of leukemias or lymphomas in hematopoietic stem cell transplantation patients. The most common method used for chimerism testing is PCR amplification of short tandem repeat loci, followed by capillary gel electrophoresis. Manual data analysis is tedious and time consuming, as it involves the selection of informative loci and the repetition of quantifying chimerism percentage for multiple loci from multiple cell types. It is also susceptible to human errors. Currently, there is no free software to fully automate chimerism data analysis. Rchimerism, an R shiny package, was developed to automatically pick informative loci, calculate chimerism percentage, and display the results through a user-friendly interface. The accuracy of the program was compared with manual calculation on 60 patient samples with 100% concordance.\n\n||| HOMEPAGE MISSING!",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31605803",
        "name": "Rchimerism"
    }
}