{
    "additionDate": "2022-12-22T09:18:23.317041Z",
    "biotoolsCURIE": "biotools:bracs",
    "biotoolsID": "bracs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nadia.brancati@icar.cnr.it",
            "name": "Nadia Brancati",
            "orcidid": "https://orcid.org/0000-0001-9061-1187",
            "typeEntity": "Person"
        }
    ],
    "description": "The BReAst Carcinoma Subtyping (BRACS) dataset, a large cohort of annotated Hematoxylin and Eosin -stained images to advance AI development in the automatic characterization of breast lesions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.bracs.icar.cnr.it/",
    "lastUpdate": "2022-12-22T09:18:23.320271Z",
    "license": "Other",
    "name": "BRACS",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAC093",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.Breast cancer is the most commonly diagnosed cancer and registers the highest number of deaths for women. Advances in diagnostic activities combined with large-scale screening policies have significantly lowered the mortality rates for breast cancer patients. However, the manual inspection of tissue slides by pathologists is cumbersome, time-consuming and is subject to significant inter- and intra-observer variability. Recently, the advent of whole-slide scanning systems has empowered the rapid digitization of pathology slides and enabled the development of Artificial Intelligence (AI)-assisted digital workflows. However, AI techniques, especially Deep Learning, require a large amount of high-quality annotated data to learn from. Constructing such task-specific datasets poses several challenges, such as data-acquisition level constraints, time-consuming and expensive annotations and anonymization of patient information. In this paper, we introduce the BReAst Carcinoma Subtyping (BRACS) dataset, a large cohort of annotated Hematoxylin and Eosin (H&E)-stained images to advance AI development in the automatic characterization of breast lesions. BRACS contains 547 Whole-Slide Images (WSIs) and 4539 Regions Of Interest (ROIs) extracted from the WSIs. Each WSI and respective ROIs are annotated by the consensus of three board-certified pathologists into different lesion categories. Specifically, BRACS includes three lesion types, i.e., benign, malignant and atypical, which are further subtyped into seven categories. It is, to the best of our knowledge, the largest annotated dataset for breast cancer subtyping both at WSI and ROI levels. Furthermore, by including the understudied atypical lesions, BRACS offers a unique opportunity for leveraging AI to better understand their characteristics. We encourage AI practitioners to develop and evaluate novel algorithms on the BRACS dataset to further breast cancer diagnosis and patient care. Database URL: https://www.bracs.icar.cnr.it/.",
                "authors": [
                    {
                        "name": "Anniciello A.M."
                    },
                    {
                        "name": "Botti G."
                    },
                    {
                        "name": "Brancati N."
                    },
                    {
                        "name": "De Pietro G."
                    },
                    {
                        "name": "Di Bonito M."
                    },
                    {
                        "name": "Feroce F."
                    },
                    {
                        "name": "Foncubierta A."
                    },
                    {
                        "name": "Frucci M."
                    },
                    {
                        "name": "Gabrani M."
                    },
                    {
                        "name": "Jaume G."
                    },
                    {
                        "name": "Pati P."
                    },
                    {
                        "name": "Riccio D."
                    },
                    {
                        "name": "Scognamiglio G."
                    }
                ],
                "date": "2022-10-17T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "BRACS: A Dataset for BReAst Carcinoma Subtyping in H&E Histology Images"
            },
            "pmcid": "PMC9575967",
            "pmid": "36251776"
        }
    ],
    "toolType": [
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
