{
    "additionDate": "2020-01-14T09:16:05Z",
    "biotoolsCURIE": "biotools:CARNIVAL",
    "biotoolsID": "CARNIVAL",
    "collectionID": [
        "PerMedCoE",
        "TransQST"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "julio.saez@bioquant.uni-heidelberg.de",
            "name": "Julio Saez-Rodriguez",
            "orcidid": "https://orcid.org/0000-0002-8552-8976",
            "typeEntity": "Person"
        }
    ],
    "description": "contextualizing large signaling networks with CARNIVAL.\n\nCAusal Reasoning for Network Identification with integer VALue programming in R.\n\nCARNIVAL is an R-package providing a framework to perform causal reasoning to infer a subset of signalling network from transcriptomics data. This work was originally based on Melas et al. with a number improved functionalities comparing to the original version. Transcription factors’ (TFs) activities and pathway scores from gene expressions can be inferred with our in-house tools DoRothEA & PROGENy, respectively. TFs’ activities and signed directed protein-protein interaction networks +/- drug targets and pathway scores are then used to derive a series of linear constraints to generate integer linear programming (ILP) problems. An ILP solver (CPLEX) is subsequently applied to identify the sub-network topology with minimised discrepancies on fitting error and model size",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://github.com/saezlab/CARNIVAL",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-04-28T16:20:24.306085Z",
    "name": "CARNIVAL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41540-019-0118-Z",
            "metadata": {
                "abstract": "© 2019, The Author(s).While gene expression profiling is commonly used to gain an overview of cellular processes, the identification of upstream processes that drive expression changes remains a challenge. To address this issue, we introduce CARNIVAL, a causal network contextualization tool which derives network architectures from gene expression footprints. CARNIVAL (CAusal Reasoning pipeline for Network identification using Integer VALue programming) integrates different sources of prior knowledge including signed and directed protein–protein interactions, transcription factor targets, and pathway signatures. The use of prior knowledge in CARNIVAL enables capturing a broad set of upstream cellular processes and regulators, leading to a higher accuracy when benchmarked against related tools. Implementation as an integer linear programming (ILP) problem guarantees efficient computation. As a case study, we applied CARNIVAL to contextualize signaling networks from gene expression data in IgA nephropathy (IgAN), a condition that can lead to chronic kidney disease. CARNIVAL identified specific signaling pathways and associated mediators dysregulated in IgAN including Wnt and TGF-β, which we subsequently validated experimentally. These results demonstrated how CARNIVAL generates hypotheses on potential upstream alterations that propagate through signaling networks, providing insights into diseases.",
                "authors": [
                    {
                        "name": "Barratt J."
                    },
                    {
                        "name": "Didangelos A."
                    },
                    {
                        "name": "Gjerga E."
                    },
                    {
                        "name": "Liu A."
                    },
                    {
                        "name": "Saez-Rodriguez J."
                    },
                    {
                        "name": "Trairatphisan P."
                    }
                ],
                "citationCount": 33,
                "date": "2019-12-01T00:00:00Z",
                "journal": "npj Systems Biology and Applications",
                "title": "From expression footprints to causal pathways: contextualizing large signaling networks with CARNIVAL"
            },
            "pmcid": "PMC6848167",
            "pmid": "31728204"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ],
    "validated": 1
}
