{
    "additionDate": "2021-01-18T09:03:39Z",
    "biotoolsCURIE": "biotools:mutarna",
    "biotoolsID": "mutarna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "miladim@cs.uni-freiburg.de",
            "name": "Milad Miladi",
            "orcidid": "https://orcid.org/0000-0002-0173-3009",
            "typeEntity": "Person"
        },
        {
            "email": "backofen@informatik.uni-freiburg.de",
            "name": "Rolf Backofen",
            "typeEntity": "Person"
        }
    ],
    "description": "Analysis and visualization of mutation-induced changes in RNA structure.\n\nMutaRNA (Mutational Analysis of RNAs) predicts and visualizes the mutation-induced structure changes of a single-nucleotide polymorphism (SNP) in an RNA sequence. This covers changes in the accessibility (single-strandedness) of the molecule, its intra-molecular base pairing potential and its the base pairing probabilities. Combined with evaluation results of tools like remuRNA and RNAsnp, MutaRNA enables a detailed evaluation of a mutation's effects on RNA structure formation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                }
            ]
        }
    ],
    "homepage": "http://rna.informatik.uni-freiburg.de/MutaRNA",
    "lastUpdate": "2021-03-02T08:28:31Z",
    "name": "MutaRNA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA331",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.RNA molecules fold into complex structures as a result of intramolecular interactions between their nucleotides. The function of many non-coding RNAs and some cis-regulatory elements of messenger RNAs highly depends on their fold. Single-nucleotide variants (SNVs) and other types of mutations can disrupt the native function of an RNA element by altering its base pairing pattern. Identifying the effect of a mutation on an RNA's structure is, therefore, a crucial step in evaluating the impact of mutations on the post-transcriptional regulation and function of RNAs within the cell. Even though a single nucleotide variation can have striking impacts on the structure formation, interpreting and comparing the impact usually needs expertise and meticulous efforts. Here, we present MutaRNA, a web server for visualization and interpretation of mutation-induced changes on the RNA structure in an intuitive and integrative fashion. To this end, probabilities of base pairing and position-wise unpaired probabilities of wildtype and mutated RNA sequences are computed and compared. Differential heatmap-like dot plot representations in combination with circular plots and arc diagrams help to identify local structure abberations, which are otherwise hidden in standard outputs. Eventually, MutaRNA provides a comprehensive and comparative overview of the mutation-induced changes in base pairing potentials and accessibility.",
                "authors": [
                    {
                        "name": "Miladi M."
                    },
                    {
                        "name": "Raden M."
                    },
                    {
                        "name": "Diederichs S."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MutaRNA: Analysis and visualization of mutation-induced changes in RNA structure"
            },
            "pmcid": "PMC7319544",
            "pmid": "32392303"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}