{
    "additionDate": "2021-01-18T10:32:01Z",
    "biotoolsCURIE": "biotools:im6a-ts-cnn",
    "biotoolsID": "im6a-ts-cnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenweiimu@gmail.com",
            "name": "Wei Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying the N<sup>6</sup>-Methyladenine Site in Multiple Tissues by Using the Convolutional Neural Network.\n\nim6A-TS-cnn is able to identify multi-tissues in Human, Mouse and Rat.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liukeweiaway/DeepM6A_cnn",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-03T08:04:46Z",
    "license": "MIT",
    "name": "im6A-TS-CNN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2020.07.034",
            "metadata": {
                "abstract": "© 2020 The Author(s)With the consideration of the spatial specificity of m6A modification, it is necessary to develop methods able to detect m6A in different tissues. With the use of a convolutional neural network, Liu and colleagues proposed a computational method that can identify m6A sites in multiple tissues of Homo sapiens, Mus musculus, and Rattus norvegicus. © 2020 The Author(s)N6-methyladenosine (m6A) is the most abundant post-transcriptional modification and involves a series of important biological processes. Therefore, accurate detection of the m6A site is very important for revealing its biological functions and impacts on diseases. Although both experimental and computational methods have been proposed for identifying m6A sites, few of them are able to detect m6A sites in different tissues. With the consideration of the spatial specificity of m6A modification, it is necessary to develop methods able to detect the m6A site in different tissues. In this work, by using the convolutional neural network (CNN), we proposed a new method, called im6A-TS-CNN, that can identify m6A sites in brain, liver, kidney, heart, and testis of Homo sapiens, Mus musculus, and Rattus norvegicus. In im6A-TS-CNN, the samples were encoded by using the one-hot encoding scheme. The results from both a 5-fold cross-validation test and independent dataset test demonstrate that im6A-TS-CNN is better than the existing method for the same purpose. The command-line version of im6A-TS-CNN is available at https://github.com/liukeweiaway/DeepM6A_cnn.",
                "authors": [
                    {
                        "name": "Cao L."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Du P."
                    },
                    {
                        "name": "Liu K."
                    }
                ],
                "citationCount": 7,
                "date": "2020-09-04T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "im6A-TS-CNN: Identifying the N6-Methyladenine Site in Multiple Tissues by Using the Convolutional Neural Network"
            },
            "pmcid": "PMC7473875",
            "pmid": "32858457"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
