{"credit":[{"email":"bogdan.mazoure@gmail.com","name":"Bogdan Mazoure","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://cran.r-project.org/web/packages/AssayCorrector/AssayCorrector.pdf"}],"function":[{"operation":[{"term":"Microarray data analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"collectionID":["CRAN"],"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Quality affairs","uri":"http://edamontology.org/topic_3393"}]},"publication":[{"abstract":"© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation Considerable attention has been paid recently to improve data quality in high-throughput screening (HTS) and high-content screening (HCS) technologies widely used in drug development and chemical toxicity research. However, several environmentally- and procedurally-induced spatial biases in experimental HTS and HCS screens decrease measurement accuracy, leading to increased numbers of false positives and false negatives in hit selection. Although effective bias correction methods and software have been developed over the past decades, almost all of these tools have been designed to reduce the effect of additive bias only. Here, we address the case of multiplicative spatial bias. Results We introduce three new statistical methods meant to reduce multiplicative spatial bias in screening technologies. We assess the performance of the methods with synthetic and real data affected by multiplicative spatial bias, including comparisons with current bias correction methods. We also describe a wider data correction protocol that integrates methods for removing both assay and plate-specific spatial biases, which can be either additive or multiplicative. Conclusions The methods for removing multiplicative spatial bias and the data correction protocol are effective in detecting and cleaning experimental data generated by screening technologies. As our protocol is of a general nature, it can be used by researchers analyzing current or next-generation high-throughput screens. Availability and implementation The AssayCorrector program, implemented in R, is available on CRAN. Contact makarenkov.vladimir@uqam.ca Supplementary informationSupplementary dataare available at Bioinformatics online.","authors":["Caraus I.","Mazoure B.","Nadon R.","Makarenkov V."],"cit_count":2,"doi":"10.1093/bioinformatics/btx327","journal":"Bioinformatics","title":"Detecting and removing multiplicative spatial bias in high-throughput screening technologies","year":"2017-10-15"}],"summary":{"biotoolsCURIE":"biotools:assaycorrector","biotoolsID":"assaycorrector","description":"Detecting and removing multiplicative spatial bias in high-throughput screening technologies.","homepage":"https://cran.r-project.org/web/packages/AssayCorrector/index.html","name":"AssayCorrector"}}