{
    "accessibility": "Open access",
    "additionDate": "2022-06-09T08:21:33.388631Z",
    "biotoolsCURIE": "biotools:biscap",
    "biotoolsID": "biscap",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dnarciso@fe.up.pt",
            "name": "Diogo A C Narciso",
            "typeEntity": "Person"
        }
    ],
    "description": "BISCAP (Biofilm Imaging and Structure Classification Automatic Processor) a high-fidelity strategy for the automatic processing of 2D OCT biofilm.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/diogonarciso/BISCAP",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2022-06-09T08:21:33.392735Z",
    "license": "Not licensed",
    "name": "BISCAP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC002",
            "metadata": {
                "abstract": "© 2022 The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Processing of Optical Coherence Tomography (OCT) biofilm images is currently restricted to a set of custom-made MATLAB scripts. None of the tools currently available for biofilm image processing (including those developed for Confocal Laser Scanning Microscopy - CLSM) enable a fully automatic processing of 2D OCT images. Results: A novel software tool entitled Biofilm Imaging and Structure Classification Automatic Processor (BISCAP) is presented. It was developed specifically for the automatic processing of 2D OCT biofilm images. The proposed approach makes use of some of the key principles used in CLSM image processing, and introduces a novel thresholding algorithm and substratum detection strategy. Two complementary pixel continuity checks are executed, enabling very detailed pixel characterizations. BISCAP delivers common structural biofilm parameters and a set of processed images for biofilm analysis. A novel biofilm 'compaction parameter' is suggested. The proposed strategy was tested on a set of 300 images with highly satisfactory results obtained. BISCAP is a Python-based standalone application, not requiring any programming knowledge or property licenses, and where all operations are managed via an intuitive Graphical User Interface. The automatic nature of this image processing strategy decreases biasing problems associated to human-perception and allows a reliable comparison of outputs.",
                "authors": [
                    {
                        "name": "DIas N.O."
                    },
                    {
                        "name": "Martins F.G."
                    },
                    {
                        "name": "Melo L.F."
                    },
                    {
                        "name": "Narciso D.A.C."
                    },
                    {
                        "name": "Pereira A."
                    }
                ],
                "date": "2022-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Characterization of biofilm structure and properties via processing of 2D optical coherence tomography images in BISCAP"
            },
            "pmid": "34986264"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
