{
    "accessibility": "Open access",
    "additionDate": "2022-10-28T08:29:52.554882Z",
    "biotoolsCURIE": "biotools:tquery",
    "biotoolsID": "tquery",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fmontesi@imada.sdu.dk",
            "name": "Fabrizio Montesi",
            "typeEntity": "Person"
        },
        {
            "name": "Larisa Safina"
        },
        {
            "name": "Saverio Giallorenzo"
        },
        {
            "name": "Stefano Pio Zingaro"
        }
    ],
    "description": "Ephemeral data handling in microservices with Tquery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Service invocation",
                    "uri": "http://edamontology.org/operation_3763"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jolie/tquery",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T15:25:28.917409Z",
    "license": "LGPL-2.1",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.npmjs.com/package/@jolie/tquery"
        }
    ],
    "name": "Tquery",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.7717/peerj-cs.1037",
            "metadata": {
                "abstract": "The adoption of edge and fog systems, along with the introduction of privacypreserving regulations, compel the usage of tools for expressing complex data queries in an ephemeral way. That is, queried data should not persist. Database engines partially address this need, as they provide domain-specific languages for querying data. Unfortunately, using a database in an ephemeral setting has inessential issues related to throughput bottlenecks, scalability, dependency management, and security (e.g., query injection). Moreover, databases can impose specific data structures and data formats, which can hinder the development of microservice architectures that integrate heterogeneous systems and handle semi-structured data. In this article, we present Jolie/Tquery, the first query framework designed for ephemeral data handling in microservices. Jolie/Tquery joins the benefits of a technology-agnostic, microservice-oriented programming language, Jolie, and of one of the most widely-used query languages for semi-structured data in microservices, the MongoDB aggregation framework. To make Jolie/Tquery reliable for the users, we follow a cleanroom software engineering process. First, we define Tquery, a theory for querying semistructured data compatible with Jolie and inspired by a consistent variant of the key operators of the MongoDB aggregation framework. Then, we describe how we implemented Jolie/Tquery following Tquery and how the Jolie type system naturally captures the syntax of Tquery and helps to preserve its invariants. To both illustrate Tquery and Jolie/Tquery, we present the use case of a medical algorithm and build our way to a microservice that implements it using Jolie/Tquery. Finally, we report microbenchmarks that validate the expectation that, in the ephemeral case, using Jolie/Tquery outperforms using an external database (MongoDB, specifically)",
                "authors": [
                    {
                        "name": "Giallorenzo S."
                    },
                    {
                        "name": "Montesi F."
                    },
                    {
                        "name": "Safina L."
                    },
                    {
                        "name": "Zingaro S.P."
                    }
                ],
                "citationCount": 2,
                "date": "2022-01-01T00:00:00Z",
                "journal": "PeerJ Computer Science",
                "title": "Ephemeral data handling in microservices with Tquery"
            },
            "pmcid": "PMC9454887",
            "pmid": "36091995"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
