
{
    "credit": [
        {
            "name": "Antonio Mora",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "Ian Donaldson",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "name": "R",
            "typeEntity": "Consortium",
            "typeRoles": [
            ]
        },
        {
            "name": "UiO",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "antoniocmora@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/iRefR/index.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://cran.r-project.org/web/packages/iRefR/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: The iRefIndex addresses the need to consolidate protein interaction data into a single uniform data resource. iRefR provides the user with access to this data source from an R environment.Results: The iRefR package includes tools for selecting specific subsets of interest from the iRefIndex by criteria such as organism, source database, experimental method, protein accessions and publication identifier. Data may be converted between three representations (MITAB, edgeList and graph) for use with other R packages such as igraph, graph and RBGL.The user may choose between different methods for resolving redundancies in interaction data and how n-ary data is represented. In addition, we describe a function to identify binary interaction records that possibly represent protein complexes. We show that the user choice of data selection, redundancy resolution and n-ary data representation all have an impact on graphical analysis.Conclusions: The package allows the user to control how these issues are dealt with and communicate them via an R-script written using the iRefR package - this will facilitate communication of methods, reproducibility of network analyses and further modification and comparison of methods by researchers. © 2011 Mora and Donaldson; licensee BioMed Central Ltd.",
            "authors": [
                "Mora A.",
                "Donaldson I.M."
            ],
            "cit_count": 17,
            "doi": "10.1186/1471-2105-12-455",
            "journal": "BMC Bioinformatics",
            "title": "IRefR: An R package to manipulate the iRefIndex consolidated protein interaction database",
            "type": "Primary",
            "year": "2011-11-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:irefr",
        "biotoolsID": "irefr",
        "description": "This tool allows the user to load any version of the consolidated protein interaction database \"iRefIndex\" and perform tasks such as: selecting databases, pmids, experimental methods, searching for specific proteins, separate binary interactions from complexes and polymers, generate complexes according to an algorithm that looks after possible binary-represented complexes, make general database statistics and create network graphs, among others.",
        "homepage": "https://cran.r-project.org/web/packages/iRefR/index.html",
        "name": "iRefIndex Manager (iRefR)",
        "version": [
            "1.13"
        ]
    }
}