{
    "accessibility": "Open access",
    "additionDate": "2019-08-26T14:34:55Z",
    "biotoolsCURIE": "biotools:MINERVA_Platform",
    "biotoolsID": "MINERVA_Platform",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "piotr.gawron@uni.lu",
            "name": "Piotr Gawron",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Primary contact"
            ]
        },
        {
            "email": "marek.ostaszewski@uni.lu",
            "name": "Marek Ostaszewski",
            "orcidid": "https://orcid.org/0000-0003-1473-370X",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor",
                "Primary contact"
            ]
        },
        {
            "email": "david.hoksza@uni.lu",
            "name": "David Hoksza",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "ewa.smula@uni.lu",
            "name": "Ewa Smula",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor",
                "Support",
                "Contributor"
            ]
        },
        {
            "email": "venkata.satagopam@uni.lu",
            "name": "Venkata Satagopam",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "email": "rudi.balling@uni.lu",
            "name": "Rudi Balling",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "email": "reinhard.schneider@uni.lu",
            "name": "Reinhard Schneider",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Luxembourg Centre for Systems Biomedicine, University of Luxembourg",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider",
                "Maintainer",
                "Support"
            ],
            "url": "https://lcsb.uni.lu"
        }
    ],
    "description": "MINERVA (Molecular Interaction NEtwoRk VisuAlization) platform is a standalone webserver for visualization, exploration and management of molecular networks encoded in SBGN-compliant format, including files produced using CellDesigner or SBGN editors. Visualization of uploaded networks generated by the platform is accessible via a web browser to all viewers with the weblink to the resource.\n\nMINERVA is a webservice using the Java Server Faces 2 technology. The server side, including data parsing, integration, annotation and verification, is implemented in Java 8. The platform uses the Postgres SQL database for data storage and the Hibernate framework as a middle layer between web server and database. The user web-interface is generated using JSF and PrimeFaces. The displayed content is visualized by OpenLayers or Google Maps API, dedicated JavaScript and CSS.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://minerva-web.lcsb.uni.lu"
        },
        {
            "type": [
                "API documentation"
            ],
            "url": "https://minerva.pages.uni.lu/doc/api/"
        },
        {
            "type": [
                "Release notes"
            ],
            "url": "https://minerva.pages.uni.lu/doc/releasenotes/"
        },
        {
            "note": "User manual",
            "type": [
                "User manual"
            ],
            "url": "https://minerva.pages.uni.lu/doc/user-manual/"
        },
        {
            "note": "Administrator's manual",
            "type": [
                "User manual"
            ],
            "url": "https://minerva.pages.uni.lu/doc/admin-manual/"
        },
        {
            "type": [
                "Terms of use"
            ],
            "url": "https://minerva.pages.uni.lu/doc/tos/"
        }
    ],
    "download": [
        {
            "note": "Virtual Machine and Docker containers to a standalone version",
            "type": "Container file",
            "url": "https://webdav-r3lab.uni.lu/public/minerva/",
            "version": "all released"
        }
    ],
    "editPermission": {
        "authors": [
            "ewa.smula",
            "laurentheirendt"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Luxembourg"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "SBML",
                            "uri": "http://edamontology.org/format_2585"
                        },
                        {
                            "term": "SBGN-ML",
                            "uri": "http://edamontology.org/format_3692"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence variations",
                        "uri": "http://edamontology.org/data_3498"
                    },
                    "format": [
                        {
                            "term": "VCF",
                            "uri": "http://edamontology.org/format_3016"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Surface rendering",
                    "uri": "http://edamontology.org/operation_1816"
                }
            ]
        }
    ],
    "homepage": "https://minerva-web.lcsb.uni.lu",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2020-09-02T10:55:23Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://git-r3lab.uni.lu/minerva/core"
        }
    ],
    "maturity": "Mature",
    "name": "MINERVA Platform",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mjostaszewski",
    "publication": [
        {
            "doi": "10.1038/npjsba.2016.20",
            "metadata": {
                "abstract": "© The Author(s) 2016.Our growing knowledge about various molecular mechanisms is becoming increasingly more structured and accessible. Different repositories of molecular interactions and available literature enable construction of focused and high-quality molecular interaction networks. Novel tools for curation and exploration of such networks are needed, in order to foster the development of a systems biology environment. In particular, solutions for visualization, annotation and data cross-linking will facilitate usage of network-encoded knowledge in biomedical research. To this end we developed the MINERVA (Molecular Interaction NEtwoRks VisuAlization) platform, a standalone webservice supporting curation, annotation and visualization of molecular interaction networks in Systems Biology Graphical Notation (SBGN)-compliant format. MINERVA provides automated content annotation and verification for improved quality control. The end users can explore and interact with hosted networks, and provide direct feedback to content curators. MINERVA enables mapping drug targets or overlaying experimental data on the visualized networks. Extensive export functions enable downloading areas of the visualized networks as SBGN-compliant models for efficient reuse of hosted networks. The software is available under Affero GPL 3.0 as a Virtual Machine snapshot, Debian package and Docker instance at http://r3lab.uni.lu/web/minerva-website/. We believe that MINERVA is an important contribution to systems biology community, as its architecture enables set-up of locally or globally accessible SBGN-oriented repositories of molecular interaction networks. Its functionalities allow overlay of multiple information layers, facilitating exploration of content and interpretation of data. Moreover, annotation and verification workflows of MINERVA improve the efficiency of curation of networks, allowing life-science researchers to better engage in development and use of biomedical knowledge repositories.",
                "authors": [
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Ostaszewski M."
                    },
                    {
                        "name": "Satagopam V."
                    },
                    {
                        "name": "Gebel S."
                    },
                    {
                        "name": "Mazein A."
                    },
                    {
                        "name": "Kuzma M."
                    },
                    {
                        "name": "Zorzan S."
                    },
                    {
                        "name": "McGee F."
                    },
                    {
                        "name": "Otjacques B."
                    },
                    {
                        "name": "Balling R."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 28,
                "date": "2016-01-01T00:00:00Z",
                "journal": "npj Systems Biology and Applications",
                "title": "MINERVA—A platform for visualization and curation of molecular interaction networks"
            },
            "pmcid": "PMC5516855",
            "pmid": "28725475",
            "type": [
                "Primary"
            ],
            "version": "10.0"
        },
        {
            "doi": "10.1093/bioinformatics/btz286",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Summary: The complexity of molecular networks makes them difficult to navigate and interpret, creating a need for specialized software. MINERVA is a web platform for visualization, exploration and management of molecular networks. Here, we introduce an extension to MINERVA architecture that greatly facilitates the access and use of the stored molecular network data. It allows to incorporate such data in analytical pipelines via a programmatic access interface, and to extend the platform's visual exploration and analytics functionality via plugin architecture. This is possible for any molecular network hosted by the MINERVA platform encoded in well-recognized systems biology formats. To showcase the possibilities of the plugin architecture, we have developed several plugins extending the MINERVA core functionalities. In the article, we demonstrate the plugins for interactive tree traversal of molecular networks, for enrichment analysis and for mapping and visualization of known disease variants or known adverse drug reactions to molecules in the network. Availability and implementation: Plugins developed and maintained by the MINERVA team are available under the AGPL v3 license at https://git-r3lab.uni.lu/minerva/plugins/. The MINERVA API and plugin documentation is available at https://minerva-web.lcsb.uni.lu.",
                "authors": [
                    {
                        "name": "Hoksza D."
                    },
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Ostaszewski M."
                    },
                    {
                        "name": "Smula E."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 4,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MINERVA API and plugins: Opening molecular network analysis and visualization to the community"
            },
            "pmid": "31074494",
            "type": [
                "Primary"
            ],
            "version": "12.2.3"
        },
        {
            "doi": "10.1093/bib/bbz067",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.The understanding of complex biological networks often relies on both a dedicated layout and a topology. Currently, there are three major competing layout-aware systems biology formats, but there are no software tools or software libraries supporting all of them. This complicates the management of molecular network layouts and hinders their reuse and extension. In this paper, we present a high-level overview of the layout formats in systems biology, focusing on their commonalities and differences, review their support in existing software tools, libraries and repositories and finally introduce a new conversion module within the MINERVA platform. The module is available via a REST API and offers, besides the ability to convert between layout-aware systems biology formats, the possibility to export layouts into several graphical formats. The module enables conversion of very large networks with thousands of elements, such as disease maps or metabolic reconstructions, rendering it widely applicable in systems biology.",
                "authors": [
                    {
                        "name": "Hoksza D."
                    },
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Ostaszewski M."
                    },
                    {
                        "name": "Hasenauer J."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-10T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Closing the gap between formats for storing layout information in systems biology"
            },
            "pmid": "31273380",
            "type": [
                "Primary"
            ],
            "version": "13.1.1"
        },
        {
            "doi": "10.1089/big.2015.0057",
            "metadata": {
                "abstract": "© Venkata Satagopam et al. 2016; Published by Mary Ann Liebert, Inc.Translational medicine is a domain turning results of basic life science research into new tools and methods in a clinical environment, for example, as new diagnostics or therapies. Nowadays, the process of translation is supported by large amounts of heterogeneous data ranging from medical data to a whole range of -omics data. It is not only a great opportunity but also a great challenge, as translational medicine big data is difficult to integrate and analyze, and requires the involvement of biomedical experts for the data processing. We show here that visualization and interoperable workflows, combining multiple complex steps, can address at least parts of the challenge. In this article, we present an integrated workflow for exploring, analysis, and interpretation of translational medicine data in the context of human health. Three Web services - tranSMART, a Galaxy Server, and a MINERVA platform - are combined into one big data pipeline. Native visualization capabilities enable the biomedical experts to get a comprehensive overview and control over separate steps of the workflow. The capabilities of tranSMART enable a flexible filtering of multidimensional integrated data sets to create subsets suitable for downstream processing. A Galaxy Server offers visually aided construction of analytical pipelines, with the use of existing or custom components. A MINERVA platform supports the exploration of health and disease-related mechanisms in a contextualized analytical visualization system. We demonstrate the utility of our workflow by illustrating its subsequent steps using an existing data set, for which we propose a filtering scheme, an analytical pipeline, and a corresponding visualization of analytical results. The workflow is available as a sandbox environment, where readers can work with the described setup themselves. Overall, our work shows how visualization and interfacing of big data processing services facilitate exploration, analysis, and interpretation of translational medicine data.",
                "authors": [
                    {
                        "name": "Satagopam V."
                    },
                    {
                        "name": "Gu W."
                    },
                    {
                        "name": "Eifes S."
                    },
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Ostaszewski M."
                    },
                    {
                        "name": "Gebel S."
                    },
                    {
                        "name": "Barbosa-Silva A."
                    },
                    {
                        "name": "Balling R."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 26,
                "date": "2016-06-01T00:00:00Z",
                "journal": "Big Data",
                "title": "Integration and Visualization of Translational Medicine Data for Better Understanding of Human Diseases"
            },
            "pmcid": "PMC4932659",
            "pmid": "27441714",
            "type": [
                "Usage"
            ],
            "version": "10.0"
        },
        {
            "doi": "10.1016/j.envpol.2019.04.005",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdPolychlorinated biphenyls (PCBs) are a class of widespread environmental pollutants, commonly found in human blood, that have been suggested to be linked to the occurrence of sporadic Parkinson's disease (PD). It has been reported that some non-coplanar PCBs accumulate in the brains of female PD patients. To improve our understanding of the association between PCB exposure and PD risk we have applied whole transcriptome gene expression analysis in blood cells from 594 PCB-exposed subjects (369 female, 225 male). Interestingly, we observe that in females, blood levels of non-coplanar PCBs appear to be associated with expression levels of PD-specific genes. However, no such association was detected in males. Among the 131 PD-specific genes affected, 39 have been shown to display similar changes in expression levels in the substantia nigra of deceased PD patients. Especially among the down-regulated genes, transcripts of genes involved in neurotransmitter vesicle-related functions were predominant. Capsule: Plasma PCB levels are associated with gene expression changes in females only, resulting in brain-related genes changing in blood cells of healthy individuals exposed to PCBs.",
                "authors": [
                    {
                        "name": "Bohler S."
                    },
                    {
                        "name": "Krauskopf J."
                    },
                    {
                        "name": "Espin-Perez A."
                    },
                    {
                        "name": "Gebel S."
                    },
                    {
                        "name": "Palli D."
                    },
                    {
                        "name": "Rantakokko P."
                    },
                    {
                        "name": "Kiviranta H."
                    },
                    {
                        "name": "Kyrtopoulos S.A."
                    },
                    {
                        "name": "Balling R."
                    },
                    {
                        "name": "Kleinjans J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Environmental Pollution",
                "title": "Genes associated with Parkinson's disease respond to increasing polychlorinated biphenyl levels in the blood of healthy females"
            },
            "pmid": "30991279",
            "type": [
                "Usage"
            ],
            "version": "13.1.1"
        },
        {
            "doi": "10.1093/bioinformatics/btw667",
            "metadata": {
                "abstract": "© 2017 The Author.Motivation: A genome-scale reconstruction of human metabolism, Recon 2, is available but no interface exists to interactively visualize its content integrated with omics data and simulation results. Results: We manually drew a comprehensive map, ReconMap 2.0, that is consistent with the content of Recon 2. We present it within a web interface that allows content query, visualization of custom datasets and submission of feedback to manual curators.",
                "authors": [
                    {
                        "name": "Noronha A."
                    },
                    {
                        "name": "Danielsdottir A.D."
                    },
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Johannsson F."
                    },
                    {
                        "name": "Jonsdottir S."
                    },
                    {
                        "name": "Jarlsson S."
                    },
                    {
                        "name": "Gunnarsson J.P."
                    },
                    {
                        "name": "Brynjolfsson S."
                    },
                    {
                        "name": "Schneider R."
                    },
                    {
                        "name": "Thiele I."
                    },
                    {
                        "name": "Fleming R.M.T."
                    }
                ],
                "citationCount": 34,
                "date": "2017-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ReconMap: An interactive visualization of human metabolism"
            },
            "pmcid": "PMC5408809",
            "pmid": "27993782",
            "type": [
                "Usage"
            ],
            "version": "10.0.3"
        },
        {
            "doi": "10.1093/bioinformatics/bty489",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited. For commercial re-use, please contact journals.permissions@oup.comMolArt fills the gap between sequence and structure visualization by providing a lightweight, interactive environment enabling exploration of sequence annotations in the context of available experimental or predicted protein structures. Provided a UniProt ID, MolArt downloads and displays sequence annotations, sequence-structure mapping and relevant structures. The sequence and structure views are interlinked, enabling sequence annotations being color overlaid over the mapped structures, thus providing an enhanced understanding and interpretation of the available molecular data. Availability and implementation: MolArt is released under the Apache 2 license and is available at https://github.com/davidhoksza/MolArt. The project web page https://davidhoksza.github.io/MolArt/ features examples and applications of the tool.",
                "authors": [
                    {
                        "name": "Hoksza D."
                    },
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Ostaszewski M."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 9,
                "date": "2018-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MolArt: A molecular structure annotation and visualization tool"
            },
            "pmcid": "PMC6247942",
            "pmid": "29931246",
            "type": [
                "Usage"
            ],
            "version": "12.1"
        },
        {
            "doi": "10.1038/s41540-018-0059-y",
            "metadata": {
                "abstract": "© 2018, The Author(s).The development of computational approaches in systems biology has reached a state of maturity that allows their transition to systems medicine. Despite this progress, intuitive visualisation and context-dependent knowledge representation still present a major bottleneck. In this paper, we describe the Disease Maps Project, an effort towards a community-driven computationally readable comprehensive representation of disease mechanisms. We outline the key principles and the framework required for the success of this initiative, including use of best practices, standards and protocols. We apply a modular approach to ensure efficient sharing and reuse of resources for projects dedicated to specific diseases. Community-wide use of disease maps will accelerate the conduct of biomedical research and lead to new disease ontologies defined from mechanism-based disease endotypes rather than phenotypes.",
                "authors": [
                    {
                        "name": "Mazein A."
                    },
                    {
                        "name": "Ostaszewski M."
                    },
                    {
                        "name": "Kuperstein I."
                    },
                    {
                        "name": "Watterson S."
                    },
                    {
                        "name": "Le Novere N."
                    },
                    {
                        "name": "Lefaudeux D."
                    },
                    {
                        "name": "De Meulder B."
                    },
                    {
                        "name": "Pellet J."
                    },
                    {
                        "name": "Balaur I."
                    },
                    {
                        "name": "Saqi M."
                    },
                    {
                        "name": "Nogueira M.M."
                    },
                    {
                        "name": "He F."
                    },
                    {
                        "name": "Parton A."
                    },
                    {
                        "name": "Lemonnier N."
                    },
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Gebel S."
                    },
                    {
                        "name": "Hainaut P."
                    },
                    {
                        "name": "Ollert M."
                    },
                    {
                        "name": "Dogrusoz U."
                    },
                    {
                        "name": "Barillot E."
                    },
                    {
                        "name": "Zinovyev A."
                    },
                    {
                        "name": "Schneider R."
                    },
                    {
                        "name": "Balling R."
                    },
                    {
                        "name": "Auffray C."
                    }
                ],
                "citationCount": 30,
                "date": "2018-12-01T00:00:00Z",
                "journal": "npj Systems Biology and Applications",
                "title": "Systems medicine disease maps: community-driven comprehensive representation of disease mechanisms"
            },
            "pmcid": "PMC5984630",
            "pmid": "29872544",
            "type": [
                "Review"
            ],
            "version": "11.0.9"
        },
        {
            "doi": "10.1093/bib/bby024",
            "metadata": {
                "abstract": "© 2018 The Author(s) 2018. Published by Oxford University Press.The Disease Maps Project builds on a network of scientific and clinical groups that exchange best practices, share information and develop systems biomedicine tools. The project aims for an integrated, highly curated and user-friendly platform for disease-related knowledge. The primary focus of disease maps is on interconnected signaling, metabolic and gene regulatory network pathways represented in standard formats. The involvement of domain experts ensures that the key disease hallmarks are covered and relevant, up-to-date knowledge is adequately represented. Expert-curated and computer readable, disease maps may serve as a compendium of knowledge, allow for data-supported hypothesis generation or serve as a scaffold for the generation of predictive mathematical models. This article summarizes the 2nd Disease Maps Community meeting, highlighting its important topics and outcomes. We outline milestones on the roadmap for the future development of disease maps, including creating and maintaining standardized disease maps; sharing parts of maps that encode common human disease mechanisms; providing technical solutions for complexity management of maps; and Web tools for in-depth exploration of such maps. A dedicated discussion was focused on mathematical modeling approaches, as one of the main goals of disease map development is the generation of mathematically interpretable representations to predict disease comorbidity or drug response and to suggest drug repositioning, altogether supporting clinical decisions.",
                "authors": [
                    {
                        "name": "Ostaszewski M."
                    },
                    {
                        "name": "Gebel S."
                    },
                    {
                        "name": "Kuperstein I."
                    },
                    {
                        "name": "Mazein A."
                    },
                    {
                        "name": "Zinovyev A."
                    },
                    {
                        "name": "Dogrusoz U."
                    },
                    {
                        "name": "Hasenauer J."
                    },
                    {
                        "name": "Fleming R.M.T."
                    },
                    {
                        "name": "Le Novere N."
                    },
                    {
                        "name": "Gawron P."
                    },
                    {
                        "name": "Ligon T."
                    },
                    {
                        "name": "Niarakis A."
                    },
                    {
                        "name": "Nickerson D."
                    },
                    {
                        "name": "Weindl D."
                    },
                    {
                        "name": "Balling R."
                    },
                    {
                        "name": "Barillot E."
                    },
                    {
                        "name": "Auffray C."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 21,
                "date": "2019-03-22T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Community-driven roadmap for integrated disease maps"
            },
            "pmcid": "PMC6556900",
            "pmid": "29688273",
            "type": [
                "Review"
            ],
            "version": "11.0.9"
        }
    ],
    "relation": [
        {
            "biotoolsID": "transmart",
            "type": "usedBy"
        },
        {
            "biotoolsID": "molart",
            "type": "uses"
        },
        {
            "biotoolsID": "drugbank",
            "type": "uses"
        },
        {
            "biotoolsID": "chembl",
            "type": "uses"
        },
        {
            "biotoolsID": "ctd",
            "type": "uses"
        },
        {
            "biotoolsID": "mirtarbase",
            "type": "uses"
        }
    ],
    "toolType": [
        "Web API",
        "Web service"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Translational medicine",
            "uri": "http://edamontology.org/topic_3342"
        }
    ],
    "version": [
        "13.1.3",
        "13.2.0",
        "14.0.13",
        "15.0.3"
    ]
}