{
    "additionDate": "2023-02-11T07:59:16.897703Z",
    "biotoolsCURIE": "biotools:atlasgrabber",
    "biotoolsID": "atlasgrabber",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "benedek.bozoky@ki.se",
            "name": "Benedek Bozoky",
            "orcidid": "https://orcid.org/0000-0003-3388-7210",
            "typeEntity": "Person"
        }
    ],
    "description": "A software facilitating the high throughput analysis of the human protein atlas online database.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/b3nb0z/AtlasGrabber",
    "language": [
        "C#"
    ],
    "lastUpdate": "2023-02-11T07:59:16.900261Z",
    "license": "GPL-3.0",
    "name": "AtlasGrabber",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-05097-9",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: The human protein atlas (HPA) is an online database containing large sets of protein expression data in normal and cancerous tissues in image form from immunohistochemically (IHC) stained tissue microarrays. In these, the tissue architecture is preserved and thus provides information on the spatial distribution and localization of protein expression at the cellular and extracellular levels. The database is freely available online through the HPA website but currently without support for large-scale screening and analysis of the images in the database. Features like spatial information are typically lacking in gene expression datasets from homogenized tissues or single-cell analysis. To enable high throughput analysis of the HPA database, we developed the AtlasGrabber software. It is available freely under an open-source license. Based on a predefined gene list, the software fetches the images from the database and displays them for the user. Several filters for specific antibodies or images enable the user to customize her/his image analysis. Up to four images can be displayed simultaneously, which allows for the comparison of protein expression between different tissues and between normal and cancerous tissues. An additional feature is the XML parser that allows the extraction of a list of available antibodies, images, and genes for specific tissues or cancer types from the HPA’s database file. Results: Compared to existing software designed for a similar purpose, ours provide more functionality and is easier to use. To demonstrate the software’s usability, we identified six new markers of basal cells of the prostate. A comparison to prostate cancer showed that five of them are absent in prostate cancer. Conclusions: The HPA is a uniquely valuable database. By facilitating its usefulness with the AtlasGrabber, we enable researchers to exploit its full capacity. The loss of basal cell markers is diagnostic for prostate cancer and can help refine the histopathological diagnosis of prostate cancer. As proof of concept, with the AtlasGrabber we identified five new potential biomarkers specific for prostate basal cells which are lost in prostate cancer and thus can be used for prostate cancer diagnostics.",
                "authors": [
                    {
                        "name": "Bozoky B."
                    },
                    {
                        "name": "Ernberg I."
                    },
                    {
                        "name": "Savchenko A."
                    },
                    {
                        "name": "Szekely L."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AtlasGrabber: a software facilitating the high throughput analysis of the human protein atlas online database"
            },
            "pmcid": "PMC9758778",
            "pmid": "36526955"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
