
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We have developed a web tool, PupasView, for the selection of single nucleotide polymorphisms (SNPs) with potential phenotypic effect. PupasView constitutes an interactive environment in which functional information and population frequency data can be used as sequential filters over linkage disequilibrium parameters to obtain a final list of SNPs optimal for genotyping purposes. PupasView is the first resource that integrates phenotypic effects caused by SNPs at both the translational and the transcriptional level. PupasView retrieves SNPs that could affect conserved regions that the cellular machinery uses for the correct processing of genes (intron/exon boundaries or exonic splicing enhancers), predicted transcription factor binding sites and changes in amino acids in the proteins for which a putative pathological effect is calculated. The program uses the mapping of SNPs in the genome provided by Ensembl. PupasView will be of much help in studies of multifactorial disorders, where the use of functional SNPs will increase the sensitivity of the identification of the genes responsible for the disease. The PupasView web interface is accessible through http://pupasview.ochoa.fib.esand through http://www.pupasnp.org. © 2005 Oxford University Press.",
            "authors": [
                "Conde L.",
                "Vaquerizas J.M.",
                "Ferrer-Costa C.",
                "de la Cruz X.",
                "Orozco M.",
                "Dopazo J."
            ],
            "cit_count": 37,
            "journal": "Nucleic Acids Research",
            "pmid": "15980522",
            "title": "PupasView: A visual tool for selecting suitable SNPs, with putative pathological effect in genes, for genotyping purposes",
            "year": "2005-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pupasview",
        "biotoolsID": "pupasview",
        "description": "Interactive web-based SNP analysis tool that allows for the selection of relevant SNPs within a gene, based on different characteristics of the SNP itself, such as validation status, type, frequency/population data and putative functional properties (pathological SNPs, SNPs disrupting potential transcription factor binding sites, intron/exon boundaries;.).",
        "homepage": "http://pupasuite.bioinfo.cipf.es/",
        "name": "PupasView"
    }
}