
{
    "credit": [
        {
            "email": "bvhoute@few.vu.nl",
            "name": "Bart P.P. van Houte",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/CGHnormaliter.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/CGHnormaliter_1.28.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Array comparative genomic hybridization (aCGH) is a popular technique for detection of genomic copy number imbalances. These play a critical role in the onset of various types of cancer. In the analysis of aCGH data, normalization is deemed a critical pre-processing step. In general, aCGH normalization approaches are similar to those used for gene expression data, albeit both data-types differ inherently. A particular problem with aCGH data is that imbalanced copy numbers lead to improper normalization using conventional methods. Results: In this study we present a novel method, called CGHnormaliter, which addresses this issue by means of an iterative normalization procedure. First, provisory balanced copy numbers are identified and subsequently used for normalization. These two steps are then iterated to refine the normalization. We tested our method on three well-studied tumor-related aCGH datasets with experimentally confirmed copy numbers. Results were compared to a conventional normalization approach and two more recent state-of-the-art aCGH normalization strategies. Our findings show that, compared to these three methods, CGHnormaliter yields a higher specificity and precision in terms of identifying the 'true' copy numbers. Conclusion: We demonstrate that the normalization of aCGH data can be significantly enhanced using an iterative procedure that effectively eliminates the effect of imbalanced copy numbers. This also leads to a more reliable assessment of aberrations. An R-package containing the implementation of CGHnormaliter is available at http://www.ibi.vu.nl/programs/cghnormaliterwww. © 2009 van Houte et al; licensee BioMed Central Ltd.",
            "authors": [
                "van Houte B.P.P.",
                "Binsl T.W.",
                "Hettling H.",
                "Pirovano W.",
                "Heringa J."
            ],
            "cit_count": 15,
            "doi": "10.1186/1471-2164-10-401",
            "journal": "BMC Genomics",
            "title": "CGHnormaliter: An iterative strategy to enhance normalization of array CGH data with imbalanced aberrations",
            "type": "Primary",
            "year": "2009-08-26"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cghnormaliter",
        "biotoolsID": "cghnormaliter",
        "description": "Normalization and centralization of array comparative genomic hybridization (aCGH) data. The algorithm uses an iterative procedure that effectively eliminates the influence of imbalanced copy numbers. This leads to a more reliable assessment of copy number alterations (CNAs).",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/CGHnormaliter.html",
        "name": "CGHnormaliter",
        "version": [
            "1.28.0"
        ]
    }
}