
{
    "credit": [
        {
            "email": "cybert@ics.uci.edu",
            "name": "For bugs and general help (Subject=CyberT)",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "license@ics.uci.edu",
            "name": "For commercial licenses (Subject=CyberT)",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://cybert.ics.uci.edu/help/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Bayesian regularization method for high-throughput differential analysis, described in Baldi and Long (A Bayesian framework for the analysis of microarray expression data: regularized t-test and statistical inferences of gene changes. Bioinformatics 2001: 17: 509-519) and implemented in the Cyber-T web server, is one of the most widely validated. Cyber-T implements a t-test using a Bayesian framework to compute a regularized variance of the measurements associated with each probe under each condition. This regularized estimate is derived by flexibly combining the empirical measurements with a prior, or background, derived from pooling measurements associated with probes in the same neighborhood. This approach flexibly addresses problems associated with low replication levels and technology biases, not only for DNA microarrays, but also for other technologies, such as protein arrays, quantitative mass spectrometry and next-generation sequencing (RNA-seq). Here we present an update to the Cyber-T web server, incorporating several useful new additions and improvements. Several preprocessing data normalization options including logarithmic and (Variance Stabilizing Normalization) VSN transforms are included. To augment two-sample t-tests, a one-way analysis of variance is implemented. Several methods for multiple tests correction, including standard frequentist methods and a probabilistic mixture model treatment, are available. Diagnostic plots allow visual assessment of the results. The web server provides comprehensive documentation and example data sets. The Cyber-T web server, with R source code and data sets, is publicly available at http://cybert.ics.uci.edu/. © 2012 The Author(s).",
            "authors": [
                "Kayala M.A.",
                "Baldi P."
            ],
            "cit_count": 87,
            "journal": "Nucleic Acids Research",
            "pmid": "22600740",
            "title": "Cyber-T web server: Differential analysis of high-throughput data",
            "year": "2012-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cyber-t",
        "biotoolsID": "cyber-t",
        "description": "Cyber-T provides differential analysis tools for high-throughput data such as data from microarrays, next generation sequencing platforms and mass spectrometry. Various statistical analyses are computed using R-code.",
        "homepage": "http://cybert.ics.uci.edu/.",
        "name": "Cyber-T"
    }
}