{
    "accessibility": "Open access",
    "additionDate": "2022-09-01T12:22:50.774759Z",
    "biotoolsCURIE": "biotools:splitavg",
    "biotoolsID": "splitavg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Daniel L. Rubin"
        },
        {
            "name": "Jayashree Kalpathy-Cramer"
        },
        {
            "name": "Liangqiong Qu"
        },
        {
            "name": "Miao Zhang"
        },
        {
            "name": "Praveer Singh"
        }
    ],
    "description": "A heterogeneity-aware federated deep learning method for medical imaging.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zm17943/SplitAVG",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-01T12:22:50.777216Z",
    "license": "Not licensed",
    "name": "SplitAVG",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/JBHI.2022.3185956",
            "metadata": {
                "abstract": "IEEEFederated learning is an emerging research paradigm for enabling collaboratively training deep learning models without sharing patient data. However, the data from different institutions are usually heterogeneous across institutions, which may reduce the performance of models trained using federated learning. In this study, we propose a novel heterogeneity-aware federated learning method, SplitAVG, to overcome the performance drops from data heterogeneity in federated learning. Unlike previous federated methods that require complex heuristic training or hyper parameter tuning, our SplitAVG leverages the simple network split and feature map concatenation strategies to encourage the federated model training an unbiased estimator of the target data distribution. We compare SplitAVG with seven state-of-the-art federated learning methods, using centrally hosted training data as the baseline on a suite of both synthetic and real-world federated datasets. We find that the performance of models trained using all the comparison federated learning methods degraded significantly with the increasing degrees of data heterogeneity. In contrast, SplitAVG method achieves comparable results to the baseline method under all heterogeneous settings, that it achieves 96.2&#x0025; of the accuracy and 110.4&#x0025; of the mean absolute error obtained by the baseline in a diabetic retinopathy binary classification dataset and a bone age prediction dataset, respectively, on highly heterogeneous data partitions. We conclude that SplitAVG method can effectively overcome the performance drops from variability in data distributions across institutions. Experimental results also show that SplitAVG can be adapted to different base convolutional neural networks (CNNs) and generalized to various types of medical imaging tasks. The code is publicly available at <uri>https://github.com/zm17943/SplitAVG</uri>.",
                "authors": [
                    {
                        "name": "Kalpathy-Cramer J."
                    },
                    {
                        "name": "L. Rubin D."
                    },
                    {
                        "name": "Qu L."
                    },
                    {
                        "name": "Singh P."
                    },
                    {
                        "name": "Zhang M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "SplitAVG: A heterogeneity-aware federated deep learning method for medical imaging"
            },
            "pmid": "35749336"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ],
    "validated": 1
}
