{
    "additionDate": "2021-01-18T06:56:46Z",
    "biotoolsCURIE": "biotools:topofilter",
    "biotoolsID": "topofilter",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "joerg.stelling@bsse.ethz.ch",
            "name": "Jörg Stelling",
            "orcidid": "https://orcid.org/0000-0002-1145-891X",
            "typeEntity": "Person"
        }
    ],
    "description": "a MATLAB package for mechanistic model identification in systems biology.\n\nTopological filtering method: model space exploration for ODE models based on approximate parameter space exploration.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/csb.ethz/TopoFilter",
    "lastUpdate": "2021-03-01T10:42:28Z",
    "license": "GPL-3.0",
    "name": "TopoFilter",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3343-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: To develop mechanistic dynamic models in systems biology, one often needs to identify all (or minimal) representations of the biological processes that are consistent with experimental data, out of a potentially large set of hypothetical mechanisms. However, a simple enumeration of all alternatives becomes quickly intractable when the number of model parameters grows. Selecting appropriate dynamic models out of a large ensemble of models, taking the uncertainty in our biological knowledge and in the experimental data into account, is therefore a key current problem in systems biology. Results: The TopoFilter package addresses this problem in a heuristic and automated fashion by implementing the previously described topological filtering method for Bayesian model selection. It includes a core heuristic for searching the space of submodels of a parametrized model, coupled with a sampling-based exploration of the parameter space. Recent developments of the method allow to balance exhaustiveness and speed of the model space search, to efficiently re-sample parameters, to parallelize the search, and to use custom scoring functions. We use a theoretical example to motivate these features and then demonstrate TopoFilter's applicability for a yeast signaling network with more than 250'000 possible model structures. Conclusions: TopoFilter is a flexible software framework that makes Bayesian model selection and reduction efficient and scalable to network models of a complexity that represents contemporary problems in, for example, cell signaling. TopoFilter is open-source, available under the GPL-3.0 license at https://gitlab.com/csb.ethz/TopoFilter. It includes installation instructions, a quickstart guide, a description of all package options, and multiple examples.",
                "authors": [
                    {
                        "name": "Rybinski M."
                    },
                    {
                        "name": "Moller S."
                    },
                    {
                        "name": "Sunnaker M."
                    },
                    {
                        "name": "Lormeau C."
                    },
                    {
                        "name": "Stelling J."
                    }
                ],
                "date": "2020-01-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Topofilter: A matlab package for mechanistic model identification in systems biology"
            },
            "pmcid": "PMC6990465",
            "pmid": "31996136"
        }
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}