{"credit":[{"email":"kerry.odonnell@ars.usda.gov","name":"Kerry O'Donnell","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"kerry.odonnell@ars.usda.gov","name":"David M. Geiser","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Phylogenetic tree analysis (gene family prediction)","uri":"http://edamontology.org/operation_0553"},{"term":"Genome visualisation","uri":"http://edamontology.org/operation_3208"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Zoology","uri":"http://edamontology.org/topic_3500"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"publication":[{"abstract":"The fungal genus Fusarium includes many plant and/or animal pathogenic species and produces diverse toxins. Although accurate species identification is critical for managing such threats, it is difficult to identify Fusarium morphologically. Fortunately, extensive molecular phylogenetic studies, founded on well-preserved culture collections, have established a robust foundation for Fusarium classification. Genomes of four Fusarium species have been published with more being currently sequenced. The Cyber infrastructure for Fusarium (CiF; http://www.fusariumdb.org/) was built to support archiving and utilization of rapidly increasing data and knowledge and consists of Fusarium-ID, Fusarium Comparative Genomics Platform (FCGP) and Fusarium Community Platform (FCP). The Fusarium-ID archives phylogenetic marker sequences from most known species along with information associated with characterized isolates and supports strain identification and phylogenetic analyses. The FCGP currently archives five genomes from four species. Besides supporting genome browsing and analysis, the FCGP presents computed characteristics of multiple gene families and functional groups. The Cart/Favorite function allows users to collect sequences from Fusarium-ID and the FCGP and analyze them later using multiple tools without requiring repeated copying-and-pasting of sequences. The FCP is designed to serve as an online community forum for sharing and preserving accumulated experience and knowledge to support future research and education. © The Author(s) 2010.","authors":["Park B.","Park J.","Cheong K.-C.","Choi J.","Jung K.","Kim D.","Lee Y.-H.","Ward T.J.","O'Donnell K.","Geiser D.M.","Kang S."],"cit_count":40,"journal":"Nucleic Acids Research","pmid":"21087991","title":"Cyber infrastructure for Fusarium: Three integrated platforms supporting strain identification, phylogenetics, comparative genomics and knowledge sharing","year":"2011-01-01"}],"summary":{"biotoolsCURIE":"biotools:cif","biotoolsID":"cif","description":"Fusarium-ID, Fusarium Comparative Genomics Platform (FCGP) and Fusarium Community Platform (FCP). The Fusarium-ID archives phylogenetic marker sequences from most known species along with information associated with characterized isolates and supports strain identification and phylogenetic analyses. FCGP presents computed characteristics of multiple gene families and functional groups. The Cart/Favorite function allows users to collect sequences from Fusarium-ID and the FCGP and analyze them.","homepage":"http://www.fusariumdb.org/","name":"CiF"}}