{
    "additionDate": "2015-02-16T10:08:21Z",
    "biotoolsCURIE": "biotools:mcpep",
    "biotoolsID": "mcpep",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.prc.boun.edu.tr/"
        }
    ],
    "description": "The MCPep server for Monte Carlo simulations of peptide-membrane interactions",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bental.tau.ac.il/MCPep/faq.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "The MCPep server is designed for non-experts wishing to perform Monte Carlo (MC) simulations of helical peptides in association with lipid membranes. MCPep is a web implementation of a previously developed MC simulation model. The model has been tested on a variety of peptides and protein fragments. The simulations successfully reproduced available empirical data and provided new molecular insights, such as the preferred locations of peptides in the membrane and the contribution of individual amino acids to membrane association. MCPep simulates the peptide in the aqueous phase and membrane environments, both described implicitly. In the former, the peptide is subjected solely to internal conformational changes, and in the latter, each MC cycle includes additional external rigid body rotational and translational motions to allow the peptide to change its location in the membrane. The server can explore the interaction of helical peptides of any amino-acid composition with membranes ofv",
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://bental.tau.ac.il/MCPep/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mcpep-monte-carlo-simulations-of-peptide-membrane-interactions.html"
        }
    ],
    "name": "MCPep",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1093/nar/gks577",
            "metadata": {
                "abstract": "The MCPep server (http://bental.tau.ac.il/MCPep/) is designed for non-experts wishing to perform Monte Carlo (MC) simulations of helical peptides in association with lipid membranes. MCPep is a web implementation of a previously developed MC simulation model. The model has been tested on a variety of peptides and protein fragments. The simulations successfully reproduced available empirical data and provided new molecular insights, such as the preferred locations of peptides in the membrane and the contribution of individual amino acids to membrane association. MCPep simulates the peptide in the aqueous phase and membrane environments, both described implicitly. In the former, the peptide is subjected solely to internal conformational changes, and in the latter, each MC cycle includes additional external rigid body rotational and translational motions to allow the peptide to change its location in the membrane. The server can explore the interaction of helical peptides of any amino-acid composition with membranes of various lipid compositions. Given the peptide's sequence or structure and the natural width and surface charge of the membrane, MCPep reports the main determinants of peptide-membrane interactions, e.g. average location and orientation in the membrane, free energy of membrane association and the peptide's helical content. Snapshots of example simulations are also provided. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Gofman Y."
                    },
                    {
                        "name": "Haliloglu T."
                    },
                    {
                        "name": "Ben-Tal N."
                    }
                ],
                "citationCount": 25,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Monte Carlo simulations of peptide-membrane interactions with the MCPep web server"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}