{
    "accessibility": "Open access",
    "additionDate": "2019-05-29T13:28:43Z",
    "biotoolsCURIE": "biotools:RBP-Maps",
    "biotoolsID": "RBP-Maps",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "geneyeo@ucsd.edu",
            "name": "Yeo LAB",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://yeolab.github.io/"
        }
    ],
    "description": "Enables robust generation of splicing regulatory maps and rapid query of regulatory patterns of RNA binding protein (RBP) of interest.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice transcript prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YeoLab/rbp-maps",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "RBP-Maps",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1261/rna.069237.118",
            "metadata": {
                "abstract": "© 2019 Yee et al. This article, published in RNA, is available under a Creative Commons LicenseAlternative splicing of pre-messenger RNA transcripts enables the generation of multiple protein isoforms from the same gene locus, providing a major source of protein diversity in mammalian genomes. RNA binding proteins (RBPs) bind to RNA to control splice site choice and define which exons are included in the resulting mature RNA transcript. However, depending on where the RBPs bind relative to splice sites, they can activate or repress splice site usage. To explore this position-specific regulation, in vivo binding sites identified by methods such as cross-linking and immunoprecipitation (CLIP) are integrated with alternative splicing events identified by RNA-seq or microarray. Merging these data sets enables the generation of a “splicing map,” where CLIP signal relative to a merged meta-exon provides a simple summary of the position-specific effect of binding on splicing regulation. Here, we provide RBP-Maps, a software tool to simplify generation of these maps and enable researchers to rapidly query regulatory patterns of an RBP of interest. Further, we discuss various alternative approaches to generate such splicing maps, focusing on how decisions in construction (such as the use of peak versus read density, or whole-reads versus only single-nucleotide candidate crosslink positions) can affect the interpretation of these maps using example eCLIP data from the 150 RBPs profiled by the ENCODE consortium.",
                "authors": [
                    {
                        "name": "Yee B.A."
                    },
                    {
                        "name": "Pratt G.A."
                    },
                    {
                        "name": "Graveley B.R."
                    },
                    {
                        "name": "van Nostrand E.L."
                    },
                    {
                        "name": "Yeo G.W."
                    }
                ],
                "citationCount": 11,
                "date": "2019-02-01T00:00:00Z",
                "journal": "RNA",
                "title": "RBP-Maps enables robust generation of splicing regulatory maps"
            },
            "pmcid": "PMC6348990",
            "pmid": "30413564",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}