{"credit":[{"email":"afrank@ucsd.edu","name":"A Frank","typeEntity":"Person","typeRoles":["Maintainer"]},{"email":"webmaster@ms-utils.org","typeEntity":"Person","typeRoles":["Documentor"],"url":"http://ms-utils.org"}],"documentation":[{"type":"GENERAL","url":"https://github.com/buotex/BICEPS/tree/master/libs/pepsplice"}],"function":[{"operation":[{"term":"Blind peptide database search","uri":"http://edamontology.org/operation_3647"}]}],"labels":{"collectionID":["ms-utils","Proteomics"],"language":["C++"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://ms-utils.org"}],"publication":[{"abstract":"Motivation: Tandem mass spectrometry allows for high-throughput identification of complex protein samples. Searching tandem mass spectra against sequence databases is the main analysis method nowadays. Since many peptide variations are possible, including them in the search space seems only logical. However, the search space usually grows exponentially with the number of independent variations and may therefore overwhelm computational resources. Results: We provide fast, cache-efficient search algorithms to screen large peptide search spaces including non-tryptic peptides, whole genomes, dozens of posttranslational modifications, unannotated point mutations and even unannotated splice sites. All these search spaces can be screened simultaneously. By optimizing the cache usage, we achieve a calculation speed that closely approaches the limits of the hardware. At the same time, we control the size of the overall search space by limiting the combinations of variations that can co-occur on the same peptide. Using a hypergeometric scoring scheme, we applied these algorithms to a dataset of 1 420 632 spectra. We were able to identify a considerable number of peptide variations within a modest amount of computing time on standard desktop computers. © The Author 2007. Published by Oxford University Press. All rights reserved.","authors":["Roos F.F.","Jacob R.","Grossmann J.","Fischer B.","Buhmann J.M.","Gruissem W.","Baginsky S.","Widmayer P."],"cit_count":29,"journal":"Bioinformatics","pmid":"17768164","title":"PepSplice: Cache-efficient search algorithms for comprehensive identification of tandem mass spectra","year":"2007-11-01"}],"summary":{"biotoolsCURIE":"biotools:pepsplice","biotoolsID":"pepsplice","description":"Cache-optimized search algorithm.","homepage":"https://github.com/buotex/BICEPS/tree/master/libs/pepsplice","name":"PepSplice"}}