{
    "additionDate": "2017-08-03T18:47:45Z",
    "biotoolsCURIE": "biotools:kmerstream",
    "biotoolsID": "kmerstream",
    "credit": [
        {
            "email": "pmelsted@hi.is",
            "name": "Páll Melsted",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://notendur.hi.is/~pmelsted/"
        }
    ],
    "description": "Streaming algorithm for estimating the number of distinct k-mers present in high throughput sequencing data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/pmelsted/KmerStream/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence composition calculation",
                    "uri": "http://edamontology.org/operation_0236"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pmelsted/KmerStream",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/kmerstream-1-0-computing-kmer-statistics-for-massive-genomics-datasets.html"
        }
    ],
    "name": "KmerStream",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Several applications in bioinformatics, such as genome assemblers and error corrections methods, rely on counting and keeping track of k-mers (substrings of length k). Histograms of k-mer frequencies can give valuable insight into the underlying distribution and indicate the error rate and genome size sampled in the sequencing experiment. Results: We present KmerStream, a streaming algorithm for estimating the number of distinct k-mers present in high-throughput sequencing data. The algorithm runs in time linear in the size of the input and the space requirement are logarithmic in the size of the input. We derive a simple model that allows us to estimate the error rate of the sequencing experiment, as well as the genome size, using only the aggregate statistics reported by KmerStream. As an application we show how KmerStream can be used to compute the error rate of a DNA sequencing experiment. We run KmerStream on a set of 2656 whole genome sequenced individuals and compare the error rate to quality values reported by the sequencing equipment. We discover that while the quality values alone are largely reliable as a predictor of error rate, there is considerable variability in the error rates between sequencing runs, even when accounting for reported quality values. S) The Author 2014. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Melsted P."
                    },
                    {
                        "name": "Halldorsson B.V."
                    }
                ],
                "citationCount": 14,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "KmerStream: Streaming algorithms for k-mer abundance estimation"
            },
            "pmid": "25355787"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}