{
    "additionDate": "2016-01-31T16:34:54Z",
    "biotoolsCURIE": "biotools:enigma",
    "biotoolsID": "enigma",
    "collectionID": [
        "BIG N2N",
        "VIB",
        "Plant Systems Biology",
        "UGent"
    ],
    "credit": [
        {
            "name": "PSB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "stmae@psb.vib-ugent.be",
            "name": "Steven Maere",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A software tool to extract gene expression modules from perturbational microarray data, based on the use of combinatorial statistics and graph-based clustering.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinformatics.psb.ugent.be/ENIGMA/manual.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression profile",
                        "uri": "http://edamontology.org/data_0928"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network report",
                        "uri": "http://edamontology.org/data_2984"
                    }
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.psb.ugent.be/ENIGMA/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-04-17T20:15:33Z",
    "name": "Enigma",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_013400"
        }
    ],
    "owner": "PSB",
    "publication": [
        {
            "doi": "10.1186/1752-0509-2-33",
            "metadata": {
                "abstract": "Background: Compendia of gene expression profiles under chemical and genetic perturbations constitute an invaluable resource from a systems biology perspective. However, the perturbational nature of such data imposes specific challenges on the computational methods used to analyze them. In particular, traditional clustering algorithms have difficulties in handling one of the prominent features of perturbational compendia, namely partial coexpression relationships between genes. Biclustering methods on the other hand are specifically designed to capture such partial coexpression patterns, but they show a variety of other drawbacks. For instance, some biclustering methods are less suited to identify overlapping biclusters, while others generate highly redundant biclusters. Also, none of the existing biclustering tools takes advantage of the staple of perturbational expression data analysis: the identification of differentially expressed genes. Results: We introduce a novel method, called ENIGMA, that addresses some of these issues. ENIGMA leverages differential expression analysis results to extract expression modules from perturbational gene expression data. The core parameters of the ENIGMA clustering procedure are automatically optimized to reduce the redundancy between modules. In contrast to the biclusters produced by most other methods, ENIGMA modules may show internal substructure, i.e. subsets of genes with distinct but significantly related expression patterns. The grouping of these (often functionally) related patterns in one module greatly aids in the biological interpretation of the data. We show that ENIGMA outperforms other methods on artificial datasets, using a quality criterion that, unlike other criteria, can be used for algorithms that generate overlapping clusters and that can be modified to take redundancy between clusters into account. Finally, we apply ENIGMA to the Rosetta compendium of expression profiles for Saccharomyces cerevisiae and we analyze one pheromone response-related module in more detail, demonstrating the potential of ENIGMA to generate detailed predictions. Conclusion: It is increasingly recognized that perturbational expression compendia are essential to identify the gene networks underlying cellular function, and efforts to build these for different organisms are currently underway. We show that ENIGMA constitutes a valuable addition to the repertoire of methods to analyze such data. © 2008 Maere et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Maere S."
                    },
                    {
                        "name": "Van Dijck P."
                    },
                    {
                        "name": "Kuiper M."
                    }
                ],
                "citationCount": 13,
                "date": "2008-04-10T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "Extracting expression modules from perturbational gene expression compendia"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}