{"credit":[{"email":"rob@spot.colorado.edu","name":"Rob Kight","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.ibi.vu.nl/programs/k2nwww/"}],"function":[{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"},{"term":"Structure visualisation","uri":"http://edamontology.org/operation_0570"},{"term":"RNA structure prediction","uri":"http://edamontology.org/operation_2441"},{"term":"RNA structure covariance model generation","uri":"http://edamontology.org/operation_3469"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"}]},"publication":[{"abstract":"Pseudoknots are abundant in RNA structures. Many computational analyses require pseudoknot-free structures, which means that some of the base pairs in the knotted structure must be disregarded to obtain a nested structure. There is a surprising diversity of methods to perform this pseudoknot removal task, but these methods are often poorly described and studies can therefore be difficult to reproduce (in part, because different procedures may be intuitively obvious to different investigators). Here we provide a variety of algorithms for pseudoknot removal, some of which can incorporate sequence or alignment information in the removal process. We demonstrate that different methods lead to different results, which might affect structure-based analyses. This work thus provides a starting point for discussion of the extent to which these different methods recapture the underlying biological reality. We provide access to reference implementations through a web interface (at http:// www.ibi.vu.nl/programs/k2nwww), and the source code is available in the PyCogent project. Published by Cold Spring Harbor Laboratory Press. Copyright © 2008 RNA Society.","authors":["Smit S.","Rother K.","Heringa J.","Knight R."],"cit_count":38,"journal":"RNA","pmid":"18230758","title":"From knotted to nested RNA structures: A variety of computational methods for pseudoknot removal","year":"2008-03-01"}],"summary":{"biotoolsCURIE":"biotools:k2n","biotoolsID":"k2n","description":"Web service to get from knotted to nested RNA structures. This site provides access to a variety of methods for pseudoknot removal.","homepage":"http://www.ibi.vu.nl/programs/k2nwww/","name":"K2N"}}