{
    "additionDate": "2021-01-18T07:41:18Z",
    "biotoolsCURIE": "biotools:rpi-se",
    "biotoolsID": "rpi-se",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhuhongyou@ms.xjb.ac.cn",
            "name": "Zhu-Hong You",
            "orcidid": "https://orcid.org/0000-0003-1266-2696",
            "typeEntity": "Person"
        }
    ],
    "description": "a stacking ensemble learning framework for ncRNA-protein interactions prediction using sequence information.\n\nThe interactions between non-coding RNAs and proteins play an essential role in many biological processes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/haichengyi/RPI-SE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-08T13:18:02Z",
    "name": "RPI-SE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3406-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The interactions between non-coding RNAs (ncRNA) and proteins play an essential role in many biological processes. Several high-throughput experimental methods have been applied to detect ncRNA-protein interactions. However, these methods are time-consuming and expensive. Accurate and efficient computational methods can assist and accelerate the study of ncRNA-protein interactions. Results: In this work, we develop a stacking ensemble computational framework, RPI-SE, for effectively predicting ncRNA-protein interactions. More specifically, to fully exploit protein and RNA sequence feature, Position Weight Matrix combined with Legendre Moments is applied to obtain protein evolutionary information. Meanwhile, k-mer sparse matrix is employed to extract efficient feature of ncRNA sequences. Finally, an ensemble learning framework integrated different types of base classifier is developed to predict ncRNA-protein interactions using these discriminative features. The accuracy and robustness of RPI-SE was evaluated on three benchmark data sets under five-fold cross-validation and compared with other state-of-the-art methods. Conclusions: The results demonstrate that RPI-SE is competent for ncRNA-protein interactions prediction task with high accuracy and robustness. It's anticipated that this work can provide a computational prediction tool to advance ncRNA-protein interactions related biomedical research.",
                "authors": [
                    {
                        "name": "Yi H.-C."
                    },
                    {
                        "name": "You Z.-H."
                    },
                    {
                        "name": "Wang M.-N."
                    },
                    {
                        "name": "Guo Z.-H."
                    },
                    {
                        "name": "Wang Y.-B."
                    },
                    {
                        "name": "Zhou J.-R."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RPI-SE: A stacking ensemble learning framework for ncRNA-protein interactions prediction using sequence information"
            },
            "pmcid": "PMC7029608",
            "pmid": "32070279"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}