{
    "accessibility": "Open access",
    "additionDate": "2023-10-15T17:44:47.462088Z",
    "biotoolsCURIE": "biotools:circpcbl",
    "biotoolsID": "circpcbl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zxd@ahau.edu.cn",
            "name": "Xiaodan Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of Plant CircRNAs with a CNN-BiGRU-GLT Model.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Score",
                        "uri": "http://edamontology.org/data_1772"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.circpcbl.cn",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:38:08.997959Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Peg-Wu/CircPCBL"
        }
    ],
    "name": "CircPCBL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/plants12081652",
            "metadata": {
                "abstract": "Circular RNAs (circRNAs), which are produced post-splicing of pre-mRNAs, are strongly linked to the emergence of several tumor types. The initial stage in conducting follow-up studies involves identifying circRNAs. Currently, animals are the primary target of most established circRNA recognition technologies. However, the sequence features of plant circRNAs differ from those of animal circRNAs, making it impossible to detect plant circRNAs. For example, there are non-GT/AG splicing signals at circRNA junction sites and few reverse complementary sequences and repetitive elements in the flanking intron sequences of plant circRNAs. In addition, there have been few studies on circRNAs in plants, and thus it is urgent to create a plant-specific method for identifying circRNAs. In this study, we propose CircPCBL, a deep-learning approach that only uses raw sequences to distinguish between circRNAs found in plants and other lncRNAs. CircPCBL comprises two separate detectors: a CNN-BiGRU detector and a GLT detector. The CNN-BiGRU detector takes in the one-hot encoding of the RNA sequence as the input, while the GLT detector uses k-mer (k = 1 − 4) features. The output matrices of the two submodels are then concatenated and ultimately pass through a fully connected layer to produce the final output. To verify the generalization performance of the model, we evaluated CircPCBL using several datasets, and the results revealed that it had an F1 of 85.40% on the validation dataset composed of six different plants species and 85.88%, 75.87%, and 86.83% on the three cross-species independent test sets composed of Cucumis sativus, Populus trichocarpa, and Gossypium raimondii, respectively. With an accuracy of 90.9% and 90%, respectively, CircPCBL successfully predicted ten of the eleven circRNAs of experimentally reported Poncirus trifoliata and nine of the ten lncRNAs of rice on the real set. CircPCBL could potentially contribute to the identification of circRNAs in plants. In addition, it is remarkable that CircPCBL also achieved an average accuracy of 94.08% on the human datasets, which is also an excellent result, implying its potential application in animal datasets. Ultimately, CircPCBL is available as a web server, from which the data and source code can also be downloaded free of charge.",
                "authors": [
                    {
                        "name": "Huang Z."
                    },
                    {
                        "name": "Nie Z."
                    },
                    {
                        "name": "Wu P."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 1,
                "date": "2023-04-01T00:00:00Z",
                "journal": "Plants",
                "title": "CircPCBL: Identification of Plant CircRNAs with a CNN-BiGRU-GLT Model"
            },
            "pmcid": "PMC10143888",
            "pmid": "37111874",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
