{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://sourceforge.net/u/andi210/profile/"}],"documentation":[{"type":"GENERAL","url":"https://sourceforge.net/projects/tagcna/"}],"function":[{"operation":[{"term":"Copy number estimation","uri":"http://edamontology.org/operation_3233"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Oncology","uri":"http://edamontology.org/topic_2640"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/tagcna-1-0-identify-significant-consensus-events-copy-number-alterations-cancer-genome.html"}],"publication":[{"abstract":"Somatic copy number alteration (CNA) is a common phenomenon in cancer genome. Distinguishing significant consensus events (SCEs) from random background CNAs in a set of subjects has been proven to be a valuable tool to study cancer. In order to identify SCEs with an acceptable type I error rate, better computational approaches should be developed based on reasonable statistics and null distributions. In this article, we propose a new approach named TAGCNA for identifying SCEs in somatic CNAs that may encompass cancer driver genes. TAGCNA employs a peel-off permutation scheme to generate a reasonable null distribution based on a prior step of selecting tag CNA markers from the genome being considered. We demonstrate the statistical power of TAGCNA on simulated ground truth data, and validate its applicability using two publicly available cancer datasets: lung and prostate adenocarcinoma. TAGCNA identifies SCEs that are known to be involved with proto-oncogenes (e.g. EGFR, CDK4) and tumor suppressor genes (e.g. CDKN2A, CDKN2B), and provides many additional SCEs with potential biological relevance in these data. TAGCNA can be used to analyze the significance of CNAs in various cancers. It is implemented in R and is freely available at http://tagcna.sourceforge.net/. © 2012 Yuan et al.","authors":["Yuan X.","Zhang J.","Yang L.","Zhang S.","Chen B.","Geng Y.","Wang Y."],"cit_count":4,"journal":"PLoS ONE","pmid":"22815924","title":"TAGCNA: A method to identify significant consensus events of copy number alterations in cancer","year":"2012-07-18"}],"summary":{"biotoolsCURIE":"biotools:tagcna","biotoolsID":"tagcna","description":"The tool is designed to identify significant consensus events from copy number alterations in cancer genome.","homepage":"http://sourceforge.net/projects/tagcna/","name":"TAGCNA"}}