{
    "additionDate": "2021-01-18T11:44:34Z",
    "biotoolsCURIE": "biotools:mutrank",
    "biotoolsID": "mutrank",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ahuffaker@ucsd.edu",
            "name": "Alisa Huffaker",
            "typeEntity": "Person"
        }
    ],
    "description": "An R shiny web-application for exploratory targeted mutual rank-based coexpression analyses integrated with user-provided supporting information.\n\nTranscriptomic data can uncover complex biological processes in part through the improved understanding of gene coexpression patterns.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eporetsky/MutRank",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-02T08:33:14Z",
    "name": "MutRank",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.7717/PEERJ.10264",
            "metadata": {
                "abstract": "Copyright 2020 Poretsky and HuffakerThe rapid assignment of genotypes to phenotypes has been a historically challenging process. The discovery of genes encoding biosynthetic pathway enzymes for defined plant specialized metabolites has been informed and accelerated by the detection of gene clusters. Unfortunately, biosynthetic pathway genes are commonly dispersed across chromosomes or reside in genes clusters that provide little predictive value. More reliably, transcript abundance of genes underlying biochemical pathways for plant specialized metabolites display significant coregulation. By rapidly identifying highly coexpressed transcripts, it is possible to efficiently narrow candidate genes encoding pathway enzymes and more easily predict both functions and functional associations. Mutual Rank (MR)-based coexpression analyses in plants accurately demonstrate functional associations for many specialized metabolic pathways; however, despite the clear predictive value of MR analyses, the application is uncommonly used to drive new pathway discoveries. Moreover, many coexpression databases aid in the prediction of both functional associations and gene functions, but lack customizability for refined hypothesis testing. To facilitate and speed flexible MR-based hypothesis testing, we developed MutRank, an R Shiny web-application for coexpression analyses. MutRank provides an intuitive graphical user interface with multiple customizable features that integrates user-provided data and supporting information suitable for personal computers. Tabular and graphical outputs facilitate the rapid analyses of both unbiased and user-defined coexpression results that accelerate gene function predictions. We highlight the recent utility of MR analyses for functional predictions and discoveries in defining two maize terpenoid antibiotic pathways. Beyond applications in biosynthetic pathway discovery, MutRank provides a simple, customizable and user-friendly interface to enable coexpression analyses relating to a breadth of plant biology inquiries. Data and code are available at GitHub: https://github.com/eporetsky/MutRank.",
                "authors": [
                    {
                        "name": "Poretsky E."
                    },
                    {
                        "name": "Huffaker A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-09T00:00:00Z",
                "journal": "PeerJ",
                "title": "MutRank: an R shiny web-application for exploratory targeted mutual rank-based coexpression analyses integrated with user-provided supporting information"
            },
            "pmcid": "PMC7659623",
            "pmid": "33240618"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}