{
    "additionDate": "2021-01-18T11:59:26Z",
    "biotoolsCURIE": "biotools:snackvar",
    "biotoolsID": "snackvar",
    "confidence_flag": "tool",
    "description": "SnackVar is a free software for Sanger sequencing analysis in clinical environment.\n\nWhen a higher value of gap opening penalty is required, SnackVar automatically applies a higher gap opening penalty and notifies the user with a popup that the heterozygous indel optimization mode is activated.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Young-gonKim/SnackVar",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-20T08:29:14Z",
    "license": "Apache-2.0",
    "name": "SnackVar",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JMOLDX.2020.11.001",
            "metadata": {
                "abstract": "© 2021 Association for Molecular Pathology and American Society for Investigative PathologyDespite the wide application of next-generation sequencing, Sanger sequencing still plays a necessary role in clinical laboratories. However, recent developments in the field of bioinformatics have focused mostly on next-generation sequencing, while tools for Sanger sequencing have shown little progress. In this study, SnackVar (https://github.com/Young-gonKim/SnackVar, last accessed June 22, 2020), a novel graphical user interface–based software for Sanger sequencing, was developed. All types of variants, including heterozygous insertion/deletion variants, can be identified by SnackVar with minimal user effort. The featured reference sequences of all of the genes are prestored in SnackVar, allowing for detected variants to be precisely described based on coding DNA references according to the nomenclature of the Human Genome Variation Society. Among 88 previously reported variants from four insertion/deletion–rich genes (BRCA1, APC, CALR, and CEBPA), the result of SnackVar agreed with reported results in 87 variants [98.9% (93.0%; 99.9%)]. The cause of one incorrect variant calling was proven to be erroneous base callings from poor-quality trace files. Compared with commercial software, SnackVar required less than one-half of the time taken for the analysis of a selected set of test cases. We expect SnackVar to be a cost-effective option for clinical laboratories performing Sanger sequencing.",
                "authors": [
                    {
                        "name": "Kim Y.-G."
                    },
                    {
                        "name": "Kim M.J."
                    },
                    {
                        "name": "Lee J.-S."
                    },
                    {
                        "name": "Lee J.A."
                    },
                    {
                        "name": "Song J.Y."
                    },
                    {
                        "name": "Cho S.I."
                    },
                    {
                        "name": "Park S.-S."
                    },
                    {
                        "name": "Seong M.-W."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Journal of Molecular Diagnostics",
                "title": "SnackVar: An Open-Source Software for Sanger Sequencing Analysis Optimized for Clinical Use"
            },
            "pmid": "33246077"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}