{
    "accessibility": "Open access",
    "additionDate": "2022-01-22T16:24:44.637434Z",
    "biotoolsCURIE": "biotools:angionet",
    "biotoolsID": "angionet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "figueroc@med.umich.edu",
            "name": "C. Alberto Figueroa",
            "typeEntity": "Person"
        }
    ],
    "description": "A fully automatic method to segment the vessels would eliminate potential subjectivity and provide a quantitative and systematic measurement of diameter reduction. Here, we have designed a convolutional neural network, AngioNet, for vessel segmentation in X-ray angiography images",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kritiyer/AngioNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-22T16:24:44.640580Z",
    "license": "Other",
    "name": "AngioNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1038/S41598-021-97355-8",
            "metadata": {
                "abstract": "© 2021, The Author(s).Coronary Artery Disease (CAD) is commonly diagnosed using X-ray angiography, in which images are taken as radio-opaque dye is flushed through the coronary vessels to visualize the severity of vessel narrowing, or stenosis. Cardiologists typically use visual estimation to approximate the percent diameter reduction of the stenosis, and this directs therapies like stent placement. A fully automatic method to segment the vessels would eliminate potential subjectivity and provide a quantitative and systematic measurement of diameter reduction. Here, we have designed a convolutional neural network, AngioNet, for vessel segmentation in X-ray angiography images. The main innovation in this network is the introduction of an Angiographic Processing Network (APN) which significantly improves segmentation performance on multiple network backbones, with the best performance using Deeplabv3+ (Dice score 0.864, pixel accuracy 0.983, sensitivity 0.918, specificity 0.987). The purpose of the APN is to create an end-to-end pipeline for image pre-processing and segmentation, learning the best possible pre-processing filters to improve segmentation. We have also demonstrated the interchangeability of our network in measuring vessel diameter with Quantitative Coronary Angiography. Our results indicate that AngioNet is a powerful tool for automatic angiographic vessel segmentation that could facilitate systematic anatomical assessment of coronary stenosis in the clinical workflow.",
                "authors": [
                    {
                        "name": "Arthurs C.J."
                    },
                    {
                        "name": "Fattah A.A."
                    },
                    {
                        "name": "Figueroa C.A."
                    },
                    {
                        "name": "Iyer K."
                    },
                    {
                        "name": "Nadakuditi R.R."
                    },
                    {
                        "name": "Najarian C.P."
                    },
                    {
                        "name": "Nallamothu B.K."
                    },
                    {
                        "name": "Sankardas M.A."
                    },
                    {
                        "name": "Soroushmehr S.M.R."
                    },
                    {
                        "name": "Subban V."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "AngioNet: a convolutional neural network for vessel segmentation in X-ray angiography"
            },
            "pmcid": "PMC8433338",
            "pmid": "34508124"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
