{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-08-01T11:36:19.361794Z",
    "biotoolsCURIE": "biotools:drummer",
    "biotoolsID": "drummer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "depledge.daniel@mh-hannover.de",
            "name": "Daniel P Depledge",
            "orcidid": "https://orcid.org/0000-0002-4292-0599",
            "typeEntity": "Person"
        },
        {
            "name": "Jonathan S Abebe"
        }
    ],
    "description": "DRUMMER is designed to identify RNA modifications at nucleotide-level resolution on distinct transcript isoforms through the comparative analysis of basecall errors in Nanopore direct RNA sequencing (DRS) datasets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DepledgeLab/DRUMMER",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-08-01T11:36:19.365285Z",
    "license": "GPL-3.0",
    "name": "DRUMMER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC274",
            "metadata": {
                "abstract": "© The Author(s) 2022.Motivation: The chemical modification of ribonucleotides regulates the structure, stability and interactions of RNAs. Profiling of these modifications using short-read (Illumina) sequencing techniques provides high sensitivity but low-to-medium resolution i.e. modifications cannot be assigned to specific transcript isoforms in regions of sequence overlap. An alternative strategy uses current fluctuations in nanopore-based long read direct RNA sequencing (DRS) to infer the location and identity of nucleotides that differ between two experimental conditions. While highly sensitive, these signal-level analyses require high-quality transcriptome annotations and thus are best suited to the study of model organisms. By contrast, the detection of RNA modifications in microbial organisms which typically have no or low-quality annotations requires an alternative strategy. Here, we demonstrate that signal fluctuations directly influence error rates during base-calling and thus provides an alternative approach for identifying modified nucleotides. Results: DRUMMER (Detection of Ribonucleic acid Modifications Manifested in Error Rates) (i) utilizes a range of statistical tests and background noise correction to identify modified nucleotides with high confidence, (ii) operates with similar sensitivity to signal-level analysis approaches and (iii) correlates very well with orthogonal approaches. Using well-characterized DRS datasets supported by independent meRIP-Seq and miCLIP-Seq datasets we demonstrate that DRUMMER operates with high sensitivity and specificity. Availability and implementation: DRUMMER is written in Python 3 and is available as open source in the GitHub repository: https://github.com/DepledgeLab/DRUMMER.",
                "authors": [
                    {
                        "name": "Abebe J.S."
                    },
                    {
                        "name": "Depledge D.P."
                    },
                    {
                        "name": "Hayer K.E."
                    },
                    {
                        "name": "Mohr I."
                    },
                    {
                        "name": "Price A.M."
                    },
                    {
                        "name": "Weitzman M.D."
                    },
                    {
                        "name": "Wilson A.C."
                    }
                ],
                "citationCount": 1,
                "date": "2022-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DRUMMER—rapid detection of RNA modifications through comparative nanopore sequencing"
            },
            "pmcid": "PMC9154255",
            "pmid": "35426900"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
