{
    "additionDate": "2020-01-09T18:31:57Z",
    "biotoolsCURIE": "biotools:mumot",
    "biotoolsID": "mumot",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "james.marshall@sheffield.ac.uk",
            "name": "James A. R. Marshall",
            "orcidid": "https://orcid.org/0000-0002-1506-167X",
            "typeEntity": "Person"
        }
    ],
    "description": "Mathematical modelling of collective behaviour without the maths.\n\nMultiscale Modelling Tool - mathematical modelling without the maths.\n\nMuMoT: Multiscale Modelling Tool.\n\nMuMoT (Multiscale Modelling Tool) is a tool designed to allow sophisticated mathematical modelling and analysis, without writing equations - the class of models that can be represented is broad, ranging from chemical reaction kinetics to demography and collective behaviour - by using a web-based interactive interface with minimal coding, rapid development and exploration of models is facilitated - the tool may also be particularly useful for pedagogical demonstrations",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://github.com/DiODeProject/MuMoT/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-11T09:16:20Z",
    "license": "GPL-3.0",
    "name": "MuMoT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0222906",
            "metadata": {
                "abstract": "© 2019 Marshall et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Collective behaviour is of fundamental importance in the life sciences, where it appears at levels of biological complexity from single cells to superorganisms, in demography and the social sciences, where it describes the behaviour of populations, and in the physical and engineering sciences, where it describes physical phenomena and can be used to design distributed systems. Reasoning about collective behaviour is inherently difficult, as the nonlinear interactions between individuals give rise to complex emergent dynamics. Mathematical techniques have been developed to analyse systematically collective behaviour in such systems, yet these frequently require extensive formal training and technical ability to apply. Even for those with the requisite training and ability, analysis using these techniques can be laborious, time-consuming and error-prone. Together these difficulties raise a barrier-to-entry for practitioners wishing to analyse models of collective behaviour. However, rigorous modelling of collective behaviour is required to make progress in understanding and applying it. Here we present an accessible tool which aims to automate the process of modelling and analysing collective behaviour, as far as possible. We focus our attention on the general class of systems described by reaction kinetics, involving interactions between components that change state as a result, as these are easily understood and extracted from data by natural, physical and social scientists, and correspond to algorithms for component-level controllers in engineering applications. By providing simple automated access to advanced mathematical techniques from statistical physics, nonlinear dynamical systems analysis, and computational simulation, we hope to advance standards in modelling collective behaviour. At the same time, by providing expert users with access to the results of automated analyses, sophisticated investigations that could take significant effort are substantially facilitated. Our tool can be accessed online without installing software, uses a simple programmatic interface, and provides interactive graphical plots for users to develop understanding of their models.",
                "authors": [
                    {
                        "name": "Bose T."
                    },
                    {
                        "name": "Marshall J.A.R."
                    },
                    {
                        "name": "Reina A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Multiscale modelling tool: Mathematical modelling of collective behaviour without the maths"
            },
            "pmcid": "PMC6768458",
            "pmid": "31568526"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}
