{
    "additionDate": "2021-01-18T07:11:14Z",
    "biotoolsCURIE": "biotools:iphys",
    "biotoolsID": "iphys",
    "confidence_flag": "tool",
    "description": "An Open Non-Contact Imaging-Based Physiological Measurement Toolbox.\n\nIn the past few years a lot of attention has been given to methods for remotely measuring physiological signals using low-cost cameras. Imaging PPG (iPPG) focuses on the measurement of volumetric changes in blood flow at distance from the body using imaging devices to capture changes in transmitted or reflected light. Imaging ballistocardiography (iBCG) typically leverages optical flow estimation to track the vertical motion of the head or body from a video sequence. Both iPPG and iBCG methods can be used to recover human vital signals.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/danmcduff/iphys-toolbox",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-11T09:42:13Z",
    "name": "iPhys",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/EMBC.2019.8857012",
            "metadata": {
                "abstract": "© 2019 IEEE.Imaging-based, non-contact measurement of physiology (including imaging photoplethysmography and imaging ballistocardiography) is a growing field of research. There are several strengths of imaging methods that make them attractive. They remove the need for uncomfortable contact sensors and can enable spatial and concomitant measurement from a single sensor. Furthermore, cameras are ubiquitous and often low-cost solutions for sensing. Open source toolboxes help accelerate the progress of research by providing a means to compare new approaches against standard implementations of the state-of-the-art. We present an open source imaging-based physiological measurement toolbox with implementations of many of the most frequently employed computational methods. We hope that this toolbox will contribute to the advancement of noncontact physiological sensing methods. Code: https://github.com/danmcduff/iphys-toolbox.",
                "authors": [
                    {
                        "name": "McDuff D."
                    },
                    {
                        "name": "Blackford E."
                    }
                ],
                "citationCount": 14,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS",
                "title": "IPhys: An Open Non-Contact Imaging-Based Physiological Measurement Toolbox"
            },
            "pmid": "31947335"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}