{
    "additionDate": "2019-12-20T08:03:07Z",
    "biotoolsCURIE": "biotools:IMGT_GeneFrequency",
    "biotoolsID": "IMGT_GeneFrequency",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "patrice.duroux@igh.cnrs.fr",
            "name": "Patrice Duroux"
        },
        {
            "email": "sofia.kossida@igh.cnrs.fr",
            "name": "Sofia Kossida"
        }
    ],
    "description": "IMGT/GeneFrequency is the IMGT® tool providing the frequency usage of immunoglobulin (IG) and T cell receptor (TR) variable (V), diversity (D) and joining (J) genes in Homo sapiens and Mus musculus rearranged sequences from IMGT/LIGM-DB.\nAnalysis is based on the IMGT-ONTOLOGY concepts.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.imgt.org/genefrequency/doc/documentation"
        }
    ],
    "editPermission": {
        "authors": [
            "pduroux",
            "skossida",
            "Joumana",
            "geraldine.folch",
            "vgiudicelli"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    },
                    "format": [
                        {
                            "term": "Gene expression report format",
                            "uri": "http://edamontology.org/format_2058"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.imgt.org/genefrequency/query",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-01-25T00:01:48Z",
    "maturity": "Mature",
    "name": "IMGT GeneFrequency",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Joumana",
    "publication": [
        {
            "metadata": {
                "abstract": "IMGT, the international ImMunoGeneTics information system® (http://imgt.cines.fr), was created in 1989 at Montpellier, France. IMGT is a high quality integrated knowledge resource specialized in immunoglobulins (IG), T cell receptors (TR), major histocompatibility complex (MHC) of human and other vertebrates, and related proteins of the immune system (RPI) which belong to the immunoglobulin superfamily (IgSF) and MHC superfamily (MhcSF). IMGT provides a common access to standardized data from genome, proteome, genetics and three-dimensional structures. The accuracy and the consistency of IMGT data are based on IMGT-ONTOLOGY, a semantic specification of terms to be used in immunogenetics and immunoinformatics. IMGT-ONTOLOGY has been formalized using XML Schema (IMGT-ML) for interoperability with other information systems. We are developing Web services to automatically query IMGT databases and tools. This is the first step towards IMGT-Choreography which will trigger and coordinate dynamic interactions between IMGT Web services to process complex significant biological and clinical requests. IMGT-Choreography will further increase the IMGT leadership in immunogenetics and immunoinformatics for medical research (repertoire analysis of the IG antibody recognition sites and of the TR recognition sites in autoimmune and infectious diseases, AIDS, leukemias, lymphomas, myelomas), veterinary research (IG and TR repertoires in farm and wild life species), genome diversity and genome evolution studies of the adaptive immune responses, biotechnology related to antibody engineering (single chain Fragment variable (scFv), phage displays, combinatorial libraries, chimeric, humanized and human antibodies), diagnostics (detection and follow-up of residual diseases) and therapeutical approaches (grafts, immunotherapy, vaccinology). IMGT is freely available at http://imgt.cines.fr. © 2005 IOS Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lefranc M.-P."
                    },
                    {
                        "name": "Clement O."
                    },
                    {
                        "name": "Kaas Q."
                    },
                    {
                        "name": "Duprat E."
                    },
                    {
                        "name": "Chastellan P."
                    },
                    {
                        "name": "Coelho I."
                    },
                    {
                        "name": "Combres K."
                    },
                    {
                        "name": "Ginestoux C."
                    },
                    {
                        "name": "Giudicelli V."
                    },
                    {
                        "name": "Chaume D."
                    },
                    {
                        "name": "Lefranc G."
                    }
                ],
                "citationCount": 69,
                "date": "2005-06-13T00:00:00Z",
                "journal": "In Silico Biology",
                "title": "IMGT-Choreography for immunogenetics and immunoinformatics"
            },
            "pmid": "15972004"
        },
        {
            "metadata": {
                "abstract": "Background: Adaptative immune repertoire diversity in vertebrate species is generated by recombination of variable (V), diversity (D) and joining (J) genes in the immunoglobulin (IG) loci of B lymphocytes and in the T cell receptor (TR) loci of T lymphocytes. These V-J and V-D-J gene rearrangements at the DNA level involve recombination signal sequences (RSS). Whereas many data exist, they are scattered in non specialized resources with different nomenclatures (eg. flat files) and are difficult to extract. Description: IMGT/GeneInfo is an online information system that provides, through a user-friendly interface, exhaustive information resulting from the complex mechanisms of T cell receptor V-J and V-D-J recombinations. T cells comprise two populations which express the αβ and γδ TR, respectively. The first version of the system dealt with the Homo sapiens and Mus musculus TRA and TRB loci whose gene rearrangements allow the synthesis of the αβ TR chains. In this paper, we present the second version of IMGT/GeneInfo where we complete the database for the Homo sapiens and Mus musculus TRG and TRD loci along with the introduction of a quality control procedure for existing and new data. We also include new functionalities to the four loci analysis, giving, to date, a very informative tool which allows to work on V(D)J genes of all TR loci in both human and mouse species. IMGT/GeneInfo provides more than 59,000 rearrangement combinations with a full gene description which is freely available at http://imgt.cines.fr/GeneInfo. Conclusion: IMGT/GeneInfo allows all TR information sequences to be in the same spot, and are now available within two computer-mouse clicks. This is useful for biologists and bioinformaticians for the study of T lymphocyte V(D)J gene rearrangements and their applications in immune response analysis. © 2006 Baum et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Baum T.-P."
                    },
                    {
                        "name": "Hierle V."
                    },
                    {
                        "name": "Pasqual N."
                    },
                    {
                        "name": "Bellahcene F."
                    },
                    {
                        "name": "Chaume D."
                    },
                    {
                        "name": "Lefranc M.-P."
                    },
                    {
                        "name": "Jouvin-Marche E."
                    },
                    {
                        "name": "Marche P.N."
                    },
                    {
                        "name": "Demongeot J."
                    }
                ],
                "citationCount": 13,
                "date": "2006-04-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IMGT/GeneInfo: T cell receptor gamma TRG and delta TRD genes in database give access to all TR potential V(D)J recombinations"
            },
            "pmid": "16640788"
        },
        {
            "metadata": {
                "abstract": "© The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.IMGT, the international ImMunoGeneTics information system (http://www.imgt.org) is the global reference in immunogenetics and immunoinformatics. By its creation in 1989 by Marie-Paule Lefranc (Université de Montpellier and CNRS), IMGT marked the advent of immunoinformatics, which emerged at the interface between immunogenetics and bioinformatics. IMGT is specialized in the immunoglobulins (IG) or antibodies, T cell receptors (TR), major histocompatibility (MH) and proteins of the IgSF and MhSF superfamilies. IMGT is built on the IMGTONTOLOGY axioms and concepts, which bridged the gap between genes, sequences and 3D structures. The concepts include the IMGTR standardized keywords (identification), IMGTR standardized labels (description), IMGTR standardized nomenclature (classification), IMGT unique numbering and IMGT Colliers de Perles (numerotation). IMGTR comprises 7 databases, 17 online tools and 15 000 pages of web resources, and provides a high-quality and integrated system for analysis of the genomic and expressed IG and TR repertoire of the adaptive immune responses, including NGS high-throughput data. Tools and databases are used in basic, veterinary and medical research, in clinical applications (mutation analysis in leukemia and lymphoma) and in antibody engineering and humanization. The IMGT/mAb-DB interface was developed for therapeutic antibodies and fusion proteins for immunological applications (FPIA). IMGTR is freely available at http://www.imgt.org.",
                "authors": [
                    {
                        "name": "Lefranc M.-P."
                    },
                    {
                        "name": "Giudicelli V."
                    },
                    {
                        "name": "Duroux P."
                    },
                    {
                        "name": "Jabado-Michaloud J."
                    },
                    {
                        "name": "Folch G."
                    },
                    {
                        "name": "Aouinti S."
                    },
                    {
                        "name": "Carillon E."
                    },
                    {
                        "name": "Duvergey H."
                    },
                    {
                        "name": "Houles A."
                    },
                    {
                        "name": "Paysan-Lafosse T."
                    },
                    {
                        "name": "Hadi-Saljoqi S."
                    },
                    {
                        "name": "Sasorith S."
                    },
                    {
                        "name": "Lefranc G."
                    },
                    {
                        "name": "Kossida S."
                    }
                ],
                "citationCount": 205,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "IMGT R, the international ImMunoGeneTics information system R 25 years on"
            },
            "pmid": "25378316"
        }
    ],
    "relation": [
        {
            "biotoolsID": "imgt",
            "type": "includedIn"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        }
    ]
}