{
    "additionDate": "2019-11-14T19:49:31Z",
    "biotoolsCURIE": "biotools:VIEW-MOD",
    "biotoolsID": "VIEW-MOD",
    "confidence_flag": "high",
    "description": "> HOMEPAGE MISSING! | a versatile illumination engine with a modular optical design for fluorescence microscopy | We developed VIEW-MOD (Versatile Illumination Engine with a Modular Optical Design): a compact, multi-modality microscope, which accommodates multiple illumination schemes including variable angle total internal reflection, point scanning and vertical horizontal light sheet. This system allows combining and flexibly switching between different illuminations and imaging modes by employing three electrically tunable lenses and two fast-steering mirrors. This versatile optics design provides control of 6 degrees of freedom of the illumination source (3 translation, 2 tilt, and beam shape) plus the axial position of the imaging plane. We also developed standalone software with an easy-to-use GUI to calibrate and control the microscope. We demonstrate the applications of this system and software in biosensor imaging, optogenetics and fast 3D volume imaging",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31503749",
    "lastUpdate": "2019-11-14T19:49:31Z",
    "name": "VIEW-MOD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1364/OE.27.019950",
            "metadata": {
                "abstract": "© 2019 Optical Society of America.We developed VIEW-MOD (Versatile Illumination Engine with a Modular Optical Design): a compact, multi-modality microscope, which accommodates multiple illumination schemes including variable angle total internal reflection, point scanning and vertical/horizontal light sheet. This system allows combining and flexibly switching between different illuminations and imaging modes by employing three electrically tunable lenses and two fast-steering mirrors. This versatile optics design provides control of 6 degrees of freedom of the illumination source (3 translation, 2 tilt, and beam shape) plus the axial position of the imaging plane. We also developed standalone software with an easy-to-use GUI to calibrate and control the microscope. We demonstrate the applications of this system and software in biosensor imaging, optogenetics and fast 3D volume imaging. This system is ready to fit into complex imaging circumstances requiring precise control of illumination and detection paths, and has a broad scope of usability for a myriad of biological applications.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Hobson C.M."
                    },
                    {
                        "name": "Pimenta F.M."
                    },
                    {
                        "name": "Nelsen E."
                    },
                    {
                        "name": "Hsiao J."
                    },
                    {
                        "name": "O'Brien T."
                    },
                    {
                        "name": "Falvo M.R."
                    },
                    {
                        "name": "Hahn K.M."
                    },
                    {
                        "name": "Superfine R."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Optics Letters",
                "title": "View-mod: A versatile illumination engine with a modular optical design for fluorescence microscopy"
            },
            "pmid": "31503749"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}