{
    "accessibility": "Open access",
    "additionDate": "2022-07-26T11:43:22.262632Z",
    "biotoolsCURIE": "biotools:neuroblu",
    "biotoolsID": "neuroblu",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rashmi.patel@holmusk.com",
            "name": "Rashmi Patel",
            "orcidid": "https://orcid.org/0000-0002-9259-8788",
            "typeEntity": "Person"
        },
        {
            "name": "Rajagopalan Ramaswamy"
        },
        {
            "name": "Simran Thadani"
        },
        {
            "name": "Soon Nan Wee"
        }
    ],
    "description": "Electronic health record (EHR) trusted research environment (TRE) to support mental healthcare analytics with real-world data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.neuroblu.ai",
    "lastUpdate": "2024-11-24T15:52:13.974111Z",
    "name": "NeuroBlu",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1136/bmjopen-2021-057227",
            "metadata": {
                "abstract": "Purpose NeuroBlu is a real-world data (RWD) repository that contains deidentified electronic health record (EHR) data from US mental healthcare providers operating the MindLinc EHR system. NeuroBlu enables users to perform statistical analysis through a secure web-based interface. Structured data are available for sociodemographic characteristics, mental health service contacts, hospital admissions, International Classification of Diseases ICD-9/ICD-10 diagnosis, prescribed medications, family history of mental disorders, Clinical Global Impression - Severity and Improvement (CGI-S/CGI-I) and Global Assessment of Functioning (GAF). To further enhance the data set, natural language processing (NLP) tools have been applied to obtain mental state examination (MSE) and social/environmental data. This paper describes the development and implementation of NeuroBlu, the procedures to safeguard data integrity and security and how the data set supports the generation of real-world evidence (RWE) in mental health. Participants As of 31 July 2021, 562 940 individuals (48.9% men) were present in the data set with a mean age of 33.4 years (SD: 18.4 years). The most frequently recorded diagnoses were substance use disorders (1 52 790 patients), major depressive disorder (1 29 120 patients) and anxiety disorders (1 03 923 patients). The median duration of follow-up was 7 months (IQR: 1.3 to 24.4 months). Findings to date The data set has supported epidemiological studies demonstrating increased risk of psychiatric hospitalisation and reduced antidepressant treatment effectiveness among people with comorbid substance use disorders. It has also been used to develop data visualisation tools to support clinical decision-making, evaluate comparative effectiveness of medications, derive models to predict treatment response and develop NLP applications to obtain clinical information from unstructured EHR data. Future plans The NeuroBlu data set will be further analysed to better understand factors related to poor clinical outcome, treatment responsiveness and the development of predictive analytic tools that may be incorporated into the source EHR system to support real-time clinical decision-making in the delivery of mental healthcare services.",
                "authors": [
                    {
                        "name": "Calvanese N."
                    },
                    {
                        "name": "Garg R."
                    },
                    {
                        "name": "Kollins S.H."
                    },
                    {
                        "name": "Patel R."
                    },
                    {
                        "name": "Ramaswamy R."
                    },
                    {
                        "name": "Renteria M.E."
                    },
                    {
                        "name": "Rush A.J."
                    },
                    {
                        "name": "Sarkar J."
                    },
                    {
                        "name": "Tandi J."
                    },
                    {
                        "name": "Thadani S."
                    },
                    {
                        "name": "Valko M."
                    },
                    {
                        "name": "Wee S.N."
                    }
                ],
                "citationCount": 16,
                "date": "2022-04-22T00:00:00Z",
                "journal": "BMJ Open",
                "title": "NeuroBlu, an electronic health record (EHR) trusted research environment (TRE) to support mental healthcare analytics with real-world data"
            },
            "pmcid": "PMC9036423",
            "pmid": "35459671"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
