{
    "additionDate": "2015-01-21T15:12:26Z",
    "biotoolsCURIE": "biotools:phymyco-db",
    "biotoolsID": "phymyco-db",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "support@genouest.org",
            "name": "GenOuest",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "GenOuest",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A database designed to help the mycologist community to access to fungal DNA markers data for phylogenetic analyses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://phymycodb.genouest.org/"
        }
    ],
    "editPermission": {
        "authors": [
            "olivier.collin@irisa.fr"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Sequence alignment",
            "operation": [
                {
                    "term": "Alignment",
                    "uri": "http://edamontology.org/operation_2928"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://phymycodb.genouest.org/",
    "lastUpdate": "2024-11-25T14:25:53.229148Z",
    "name": "Phymyco-DB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "GenOuest",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0043117",
            "metadata": {
                "abstract": "Background: In environmental sequencing studies, fungi can be identified based on nucleic acid sequences, using either highly variable sequences as species barcodes or conserved sequences containing a high-quality phylogenetic signal. For the latter, identification relies on phylogenetic analyses and the adoption of the phylogenetic species concept. Such analysis requires that the reference sequences are well identified and deposited in public-access databases. However, many entries in the public sequence databases are problematic in terms of quality and reliability and these data require screening to ensure correct phylogenetic interpretation. Methods and Principal Findings: To facilitate phylogenetic inferences and phylogenetic assignment, we introduce a fungal sequence database. The database PHYMYCO-DB comprises fungal sequences from GenBank that have been filtered to satisfy stringent sequence quality criteria. For the first release, two widely used molecular taxonomic markers were chosen: the nuclear SSU rRNA and EF1-α gene sequences. Following the automatic extraction and filtration, a manual curation is performed to remove problematic sequences while preserving relevant sequences useful for phylogenetic studies. As a result of curation, ~20% of the automatically filtered sequences have been removed from the database. To demonstrate how PHYMYCO-DB can be employed, we test a set of environmental Chytridiomycota sequences obtained from deep sea samples. Conclusion: PHYMYCO-DB offers the tools necessary to: (i) extract high quality fungal sequences for each of the 5 fungal phyla, at all taxonomic levels, (ii) extract already performed alignments, to act as 'reference alignments', (iii) launch alignments of personal sequences along with stored data. A total of 9120 SSU rRNA and 672 EF1-α high-quality fungal sequences are now available. The PHYMYCO-DB is accessible through the URL http://phymycodb.genouest.org. © 2012 Mahé et al.",
                "authors": [
                    {
                        "name": "Bretaudeau A."
                    },
                    {
                        "name": "Collin O."
                    },
                    {
                        "name": "Dufresne A."
                    },
                    {
                        "name": "Duhamel M."
                    },
                    {
                        "name": "Guillot L."
                    },
                    {
                        "name": "Kiers E.T."
                    },
                    {
                        "name": "Le Calvez T."
                    },
                    {
                        "name": "Mahe S."
                    },
                    {
                        "name": "Sarbu L."
                    },
                    {
                        "name": "Vandenkoornhuyse P."
                    }
                ],
                "citationCount": 37,
                "date": "2012-09-13T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PHYMYCO-DB: A Curated Database for Analyses of Fungal Diversity and Evolution"
            },
            "pmcid": "PMC3441585",
            "pmid": "23028445",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}
