{"credit":[{"email":"robp@cs.cmu.edu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/Kingsford-Group/ghost2"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"},{"term":"Global alignment","uri":"http://edamontology.org/operation_0496"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/ghost-global-network-alignment-multiscale-spectral-signatures.html"}],"publication":[{"abstract":"Motivation: Protein interaction networks provide an important system-level view of biological processes. One of the fundamental problems in biological network analysis is the global alignment of a pair of networks, which puts the proteins of one network into correspondence with the proteins of another network in a manner that conserves their interactions while respecting other evidence of their homology. By providing a mapping between the networks of different species, alignments can be used to inform hypotheses about the functions of unannotated proteins, the existence of unobserved interactions, the evolutionary divergence between the two species and the evolution of complexes and pathways.Results: We introduce GHOST, a global pairwise network aligner that uses a novel spectral signature to measure topological similarity between subnetworks. It combines a seed-and-extend global alignment phase with a local search procedure and exceeds state-of-the-art performance on several network alignment tasks. We show that the spectral signature used by GHOST is highly discriminative, whereas the alignments it produces are also robust to experimental noise. When compared with other recent approaches, we find that GHOST is able to recover larger and more biologically significant, shared subnetworks between species. © The Author 2012. Published by Oxford University Press. All rights reserved.","authors":["Patro R.","Kingsford C."],"cit_count":86,"journal":"Bioinformatics","pmid":"23047556","title":"Global network alignment using multiscale spectral signatures","year":"2012-12-01"}],"summary":{"biotoolsCURIE":"biotools:ghost","biotoolsID":"ghost","description":"Software package for global biological network alignment. It computes alignments based on a novel spectral signature for comparing the topological similarity of nodes across networks.","homepage":"http://www.cs.cmu.edu/~ckingsf/software/ghost/index.html","name":"GHOST"}}