{
    "additionDate": "2020-01-09T18:09:29Z",
    "biotoolsCURIE": "biotools:PELE-MSM",
    "biotoolsID": "PELE-MSM",
    "confidence_flag": "tool",
    "description": "PELE-MSM is a Monte Carlo Based Protocol for the Estimation of Absolute Binding Free Energies.\n\nIIt is a fully automatic platform based on our Monte Carlo algorithm, the Protein Energy Landscape Exploration method (PELE), for the estimation of absolute protein-ligand binding free energies, one of the most significant challenges in computer-aided drug design. \nBased on a ligand pathway approach, an initial short enhanced sampling simulation is performed to identify reasonable starting positions for more extended sampling. This stepwise approach allows for a significantly faster convergence of the free energy estimation using the Markov State Model (MSM) technique. \nPELE-MSM was applied on four diverse protein and ligand systems, successfully ranking compounds for two systems. Based on the results, current limitations and challenges with physics-based methods in computational structural biology are discussed.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://nostrumbiodiscovery.github.io/msm_pele/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Active site prediction",
                    "uri": "http://edamontology.org/operation_3896"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/miniaoshi/MSM_PELE.git",
    "lastUpdate": "2021-01-09T12:04:53Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/MSM-PELE/"
        }
    ],
    "name": "PELE-MSM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.9B00753",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.In this study, we present a fully automatic platform based on our Monte Carlo algorithm, the Protein Energy Landscape Exploration method (PELE), for the estimation of absolute protein-ligand binding free energies, one of the most significant challenges in computer aided drug design. Based on a ligand pathway approach, an initial short enhanced sampling simulation is performed to identify reasonable starting positions for more extended sampling. This stepwise approach allows for a significant faster convergence of the free energy estimation using the Markov State Model (MSM) technique. PELE-MSM was applied on four diverse protein and ligand systems, successfully ranking compounds for two systems. Based on the results, current limitations and challenges with physics-based methods in computational structural biology are discussed. Overall, PELE-MSM constitutes a promising step toward computing absolute binding free energies and in their application into drug discovery projects.",
                "authors": [
                    {
                        "name": "Gilabert J.F."
                    },
                    {
                        "name": "Grebner C."
                    },
                    {
                        "name": "Soler D."
                    },
                    {
                        "name": "Lecina D."
                    },
                    {
                        "name": "Municoy M."
                    },
                    {
                        "name": "Gracia Carmona O."
                    },
                    {
                        "name": "Soliva R."
                    },
                    {
                        "name": "Packer M.J."
                    },
                    {
                        "name": "Hughes S.J."
                    },
                    {
                        "name": "Tyrchan C."
                    },
                    {
                        "name": "Hogner A."
                    },
                    {
                        "name": "Guallar V."
                    }
                ],
                "citationCount": 6,
                "date": "2019-11-12T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "PELE-MSM: A Monte Carlo Based Protocol for the Estimation of Absolute Binding Free Energies"
            },
            "pmid": "31589430"
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ],
    "validated": 1
}