{
    "additionDate": "2021-01-18T07:00:14Z",
    "biotoolsCURIE": "biotools:mir-tv",
    "biotoolsID": "mir-tv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wenlin@ibms.sinica.edu.tw",
            "name": "Wen-Chang Lin",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive microRNA Target Viewer for microRNA and target gene expression interrogation for human cancer studies.\n\nMicroRNAs (miRNAs) have been found in many organisms and play essential roles in gene expression regulation of many critical cellular processes, including human cancers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://mirtv.ibms.sinica.edu.tw",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-02-24T08:09:12Z",
    "name": "miR-TV",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ148",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.MicroRNAs (miRNAs) have been identified in many organisms, and they are essential for gene expression regulation in many critical cellular processes. The expression levels of these genes and miRNAs are closely associated with the progression of diseases such as cancers. Furthermore, survival analysis is a significant indicator for evaluating the criticality of these cellular processes in cancer progression. We established a web tool, miRNA Target Viewer (miR-TV), which integrates 5p-arm and 3p-arm miRNA expression profiles, mRNA target gene expression levels in healthy and cancer populations, and clinical data of cancer patients and their survival information. The developed miR-TV obtained miRNA-seq, mRNA-seq and clinical data from the Cancer Genome Atlas and potential miRNA target gene predictions from miRDB, targetScan and miRanda. The data presentation was implemented using the D3 javascript toolkit. The D3 toolkit is frequently used to provide an easy-to-use interactive interface. Our miR-TV provides a user-friendly and interactive interface, which can be beneficial for biomedical researchers to freely interrogate miRNA expression information and their potential target genes. We believe that such a data visualization bioinformatics tool is excellent for obtaining information from massive biological data. Database URL: http://mirtv.ibms.sinica.edu.tw.",
                "authors": [
                    {
                        "name": "Pan C.-Y."
                    },
                    {
                        "name": "Lin W.-C."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "MiR-TV: An interactive microRNA Target Viewer for microRNA and target gene expression interrogation for human cancer studies"
            },
            "pmcid": "PMC6966094",
            "pmid": "31950188"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}