{"credit":[],"function":[{"operation":[{"term":"Phasing","uri":"http://edamontology.org/operation_3454"},{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"}]}],"labels":{"topic":[{"term":"Data mining","uri":"http://edamontology.org/topic_3473"},{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"}]},"publication":[{"abstract":"Stroke represents a major health problem in our society. One of the effects of stroke is foot drop. Foot drop (FD) is a weakness that occurs in specific muscles in the ankle and foot such as the anterior tibialis, gastrocnemius, plantaris and soleus muscles. Foot flexion and extension are normally generated by lower motor neurons (LMN). The affected muscles impact the ankle and foot in both downward and upward motions. One possible solution for FD is to investigate the movement based on the bio signal (myoelectric signal) of the muscles. Bio signal control systems like electromyography (EMG) are used for rehabilitation devices that include foot drop. One of these systems is function electrical stimulation (FES). This paper proposes new methods and algorithms to develop the performance of myoelectric pattern recognition (M-PR), to improve automated rehabilitation devices, to test these methodologies in offline and real-time experimental datasets. Label classifying is a predictive data mining application with multiple applications in the world, including automatic labeling of resources such as videos, music, images and texts. We combine the label classification method with the self-advised support vector machine (SA-SVM) to create an adapted and altered label classification method, named the label self-advised support vector machine (LSA-SVM). For the experimental data, we collected data from foot drop patients using the sEMG device, in the Metro Rehabilitation Hospital in Sydney, Australia using Ethical Approval (UTS HREC NO. ETH15-0152). The experimental results for the EMG dataset and benchmark datasets exhibit its benefits. Furthermore, the experimental results on UCI datasets indicate that LSA-SVM achieves the best performance when working together with SA-SVM and SVM. This paper describes the state-of-the-art procedures for M-PR and studies all the conceivable structures.","authors":["Adil Abboud S.","Al-Wais S.","Abdullah S.H.","Alnajjar F.","Al-Jumaily A."],"cit_count":0,"doi":"10.3390/BIOS9040114","journal":"Biosensors","pmid":"31569694","title":"Label Self-Advised Support Vector Machine (LSA-SVM)-Automated Classification of Foot Drop Rehabilitation Case Study","year":"2019-09-27"}],"summary":{"biotoolsCURIE":"biotools:LSA-SVM","biotoolsID":"LSA-SVM","description":"Label Self-Advised Support Vector Machine (LSA-SVM)-Automated Classification of Foot Drop Rehabilitation Case Study.\n\nStroke represents a major health problem in our society. One of the effects of stroke is foot drop. Foot drop (FD) is a weakness that occurs in specific muscles in the ankle and foot such as the anterior tibialis, gastrocnemius, plantaris and soleus muscles. Foot flexion and extension are normally generated by lower motor neurons (LMN). The affected muscles impact the ankle and foot in both downward and upward motions. One possible solution for FD is to investigate the movement based on the bio signal (myoelectric signal) of the muscles. Bio signal control systems like electromyography (EMG) are used for rehabilitation devices that include foot drop. One of these systems is function electrical stimulation (FES).\n\n||| HOMEPAGE MISSING!","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31569694","name":"LSA-SVM"}}