{
    "additionDate": "2018-09-03T09:28:02Z",
    "biotoolsCURIE": "biotools:kvik",
    "biotoolsID": "kvik",
    "credit": [
        {
            "email": "bjorn.fjukstad@uit.no",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Develope interactive data exploration applications in genomics and systems biology. Collection of packages in the Go programming language that help application developers i) interface with the R statistical programming language; ii) specify and run statistical analysis pipelines; and iii) interface with online databases such as MsigDB and KEGG.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fjukstad/kvik",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "MIT",
    "name": "Kvik",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.6238.2",
            "metadata": {
                "abstract": "© 2015 Fjukstad B et al.Kvik is an open-source framework that we developed for explorative analysis of functional genomics data from large epidemiological studies. Creating such studies requires a significant amount of time and resources. It is therefore usual to reuse the data from one study for several research projects. Often each project requires implementing new analysis code, integration with specific knowledge bases, and specific visualizations. Although existing data exploration tools are available for single study data exploration, no tool provides all the required functionality for multistudy data exploration. We have therefore used the Kvik framework to develop Kvik Pathways, an application for exploring gene expression data in the context of biological pathways. We have used Kvik Pathways to explore data from both a cross-sectional study design and a case-control study within the Norwegian Women and Cancer (NOWAC) cohort. Kvik Pathways follows the three-tier architecture in web applications using a powerful back-end for statistical analyses and retrieval of metadata. In this note, we describe how we used the Kvik framework to develop the Kvik Pathways application. Kvik Pathways was used by our team of epidemiologists toexplore gene expression data from healthy women with high and low plasma ratios of essential fatty acids.",
                "authors": [
                    {
                        "name": "Fjukstad B."
                    },
                    {
                        "name": "Standahl Olsen K."
                    },
                    {
                        "name": "Jareid M."
                    },
                    {
                        "name": "Lund E."
                    },
                    {
                        "name": "Bongo L.A."
                    }
                ],
                "citationCount": 1,
                "date": "2015-06-16T00:00:00Z",
                "journal": "F1000Research",
                "title": "Kvik: Three-tier data exploration tools for flexible analysis of genomic data in epidemiological studies"
            },
            "pmcid": "PMC4574765",
            "pmid": "26425340",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}