{
    "accessibility": "Open access",
    "additionDate": "2022-09-04T12:49:28.229834Z",
    "biotoolsCURIE": "biotools:pyzebrascope",
    "biotoolsID": "pyzebrascope",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kyle@kyleharrington.com",
            "name": "Kyle Harrington",
            "typeEntity": "Person"
        },
        {
            "email": "takashi.kawashima@weizmann.ac.il",
            "name": "Takashi Kawashima",
            "typeEntity": "Person"
        },
        {
            "name": "Madhu Nagathihalli Kantharaju"
        },
        {
            "name": "Rani Barbara"
        },
        {
            "name": "Ravid Haruvi"
        }
    ],
    "description": "An Open-Source Platform for Brain-Wide Neural Activity Imaging in Zebrafish.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/KawashimaLab/PyZebraScope_public",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-04T12:49:28.269191Z",
    "license": "MIT",
    "name": "PyZebrascope",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FCELL.2022.875044",
            "metadata": {
                "abstract": "Copyright © 2022 Barbara, Nagathihalli Kantharaju, Haruvi, Harrington and Kawashima.Understanding how neurons interact across the brain to control animal behaviors is one of the central goals in neuroscience. Recent developments in fluorescent microscopy and genetically-encoded calcium indicators led to the establishment of whole-brain imaging methods in zebrafish, which record neural activity across a brain-wide volume with single-cell resolution. Pioneering studies of whole-brain imaging used custom light-sheet microscopes, and their operation relied on commercially developed and maintained software not available globally. Hence it has been challenging to disseminate and develop the technology in the research community. Here, we present PyZebrascope, an open-source Python platform designed for neural activity imaging in zebrafish using light-sheet microscopy. PyZebrascope has intuitive user interfaces and supports essential features for whole-brain imaging, such as two orthogonal excitation beams and eye damage prevention. Its camera module can handle image data throughput of up to 800 MB/s from camera acquisition to file writing while maintaining stable CPU and memory usage. Its modular architecture allows the inclusion of advanced algorithms for microscope control and image processing. As a proof of concept, we implemented a novel automatic algorithm for maximizing the image resolution in the brain by precisely aligning the excitation beams to the image focal plane. PyZebrascope enables whole-brain neural activity imaging in fish behaving in a virtual reality environment. Thus, PyZebrascope will help disseminate and develop light-sheet microscopy techniques in the neuroscience community and advance our understanding of whole-brain neural dynamics during animal behaviors.",
                "authors": [
                    {
                        "name": "Barbara R."
                    },
                    {
                        "name": "Harrington K."
                    },
                    {
                        "name": "Haruvi R."
                    },
                    {
                        "name": "Kawashima T."
                    },
                    {
                        "name": "Nagathihalli Kantharaju M."
                    }
                ],
                "date": "2022-05-19T00:00:00Z",
                "journal": "Frontiers in Cell and Developmental Biology",
                "title": "PyZebrascope: An Open-Source Platform for Brain-Wide Neural Activity Imaging in Zebrafish"
            },
            "pmcid": "PMC9161555",
            "pmid": "35663407"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
