{
    "additionDate": "2021-01-18T09:12:44Z",
    "biotoolsCURIE": "biotools:viruscircbase",
    "biotoolsID": "viruscircbase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pys2013@hnu.edu.cn",
            "name": "Yousong Peng",
            "typeEntity": "Person"
        }
    ],
    "description": "VirusCircBase Database for viral circRNA.\n\nVirusCircBase(1.1), is a comprehensive database of circular RNA molecules encoded by viruses. All the viral circRNAs were identified by computational tools such as CIRI2 based on the viral infection-related RNA-seq data downloaded from NCBI SRA. The latest version of the database contains 46,440 viral circRNAs from 26 viruses. VirusCircBase is freely available for non-commercial use and would be a valuable resource for further research on viral circRNAs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://www.computationalbiology.cn/ViruscircBase/home.html",
    "lastUpdate": "2021-03-13T14:11:36Z",
    "name": "VirusCircBase",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA052",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.Circular RNAs (circRNAs) are covalently closed long noncoding RNAs critical in diverse cellular activities and multiple human diseases. Several cancer-related viral circRNAs have been identified in double-stranded DNA viruses (dsDNA), yet no systematic study about the viral circRNAs has been reported. Herein, we have performed a systematic survey of 11 924 circRNAs from 23 viral species by computational prediction of viral circRNAs from viral-infection-related RNA sequencing data. Besides the dsDNA viruses, our study has also revealed lots of circRNAs in single-stranded RNA viruses and retro-transcribing viruses, such as the Zika virus, the Influenza A virus, the Zaire ebolavirus, and the Human immunodeficiency virus 1. Most viral circRNAs had reverse complementary sequences or repeated sequences at the flanking sequences of the back-splice sites. Most viral circRNAs only expressed in a specific cell line or tissue in a specific species. Functional enrichment analysis indicated that the viral circRNAs from dsDNA viruses were involved in KEGG pathways associated with cancer. All viral circRNAs presented in the current study were stored and organized in VirusCircBase, which is freely available at http://www.computationalbiology.cn/ViruscircBase/home.HTML and is the first virus circRNA database. VirusCircBase forms the fundamental atlas for the further exploration and investigation of viral circRNAs in the context of public health.",
                "authors": [
                    {
                        "name": "Cai Z."
                    },
                    {
                        "name": "Fan Y."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Lu C."
                    },
                    {
                        "name": "Zhu Z."
                    },
                    {
                        "name": "Jiang T."
                    },
                    {
                        "name": "Shan T."
                    },
                    {
                        "name": "Peng Y."
                    }
                ],
                "citationCount": 5,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "VirusCircBase: A database of virus circular RNAs"
            },
            "pmid": "32349124"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "version": [
        "1.1"
    ]
}