
{
    "credit": [
        {
            "email": "emily.goren@gmail.com",
            "name": "Emily Goren",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://cran.r-project.org/web/packages/BinQuasi/BinQuasi.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "DNA replication and recombination",
                "uri": "http://edamontology.org/topic_3127"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Motivation: ChIP-seq experiments that are aimed at detecting DNA-protein interactions require biological replication to draw inferential conclusions, however there is no current consensus on how to analyze ChIP-seq data with biological replicates. Very few methodologies exist for the joint analysis of replicated ChIP-seq data, with approaches ranging from combining the results of analyzing replicates individually to joint modeling of all replicates. Combining the results of individual replicates analyzed separately can lead to reduced peak classification performance compared to joint modeling. Currently available methods for joint analysis may fail to control the false discovery rate at the nominal level. Results: We propose BinQuasi, a peak caller for replicated ChIP-seq data, that jointly models biological replicates using a generalized linear model framework and employs a one-sided quasilikelihood ratio test to detect peaks. When applied to simulated data and real datasets, BinQuasi performs favorably compared to existing methods, including better control of false discovery rate than existing joint modeling approaches. BinQuasi offers a flexible approach to joint modeling of replicated ChIP-seq data which is preferable to combining the results of replicates analyzed individually. Availability and implementation: Source code is freely available for download at https://cran.r-pro ject.org/packageBinQuasi, implemented in R.",
            "authors": [
                "Goren E.",
                "Liu P.",
                "Wang C.",
                "Wang C."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty227",
            "journal": "Bioinformatics",
            "title": "BinQuasi: A peak detection method for ChIP-sequencing data with biological replicates",
            "year": "2018-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:binquasi",
        "biotoolsID": "binquasi",
        "description": "Peak detection method for ChIP-sequencing data with biological replicates.",
        "homepage": "https://cran.r-project.org/web/packages/BinQuasi/index.html",
        "name": "BinQuasi"
    }
}