{
    "additionDate": "2017-08-03T18:37:23Z",
    "biotoolsCURIE": "biotools:better_bunny",
    "biotoolsID": "better_bunny",
    "credit": [
        {
            "email": "domski@wayne.edu",
            "name": "Alan Dombkowski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cptweb.cpt.wayne.edu/"
        }
    ],
    "description": "An easy to use tool designed primarily to augment Agilent’s transcriptome-wide rabbit, Oryctolagus cuniculus, gene expression microarray.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cptweb.cpt.wayne.edu/BB/faqs.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://cptweb.cpt.wayne.edu/BB/",
    "language": [
        "PHP",
        "SQL",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bunny-2-1-functional-annotation-rabbit-gene.html"
        }
    ],
    "name": "Better Bunny",
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: The rabbit is an important model organism used in a wide range of biomedical research. However, the rabbit genome is still sparsely annotated, thus prohibiting extensive functional analysis of gene sets derived from whole-genome experiments. We developed a web-based application that provides augmented annotation and orthologue analysis for rabbit genes. Importantly, the application allows comprehensive functional analysis through the use of orthologous relationships.Results: Using data extracted from several public bioinformatics repositories we created Better Bunny, a database and query tool that extensively augments the available functional annotation for rabbit genes. Using the complete set of target genes from a commercial rabbit gene expression microarray as our benchmark, we are able to obtain functional information for 88 % of the genes on the microarray. Previously, functional information was available for fewer than 10 % of the rabbit genes.Conclusions: We have developed a freely available, web-accessible bioinformatics tool that enables investigators to quickly and easily perform extensive functional analysis of rabbit genes (http://cptweb.cpt.wayne.edu). The software application fills a critical void for a wide range of biomedical research that relies on the rabbit model and requires characterization of biological function for large sets of genes. © 2012 Craig et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Craig D.B."
                    },
                    {
                        "name": "Kannan S."
                    },
                    {
                        "name": "Dombkowski A.A."
                    }
                ],
                "citationCount": 13,
                "date": "2012-05-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Augmented annotation and orthologue analysis for Oryctolagus cuniculus: Better Bunny"
            },
            "pmid": "22568790"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ],
    "validated": 1
}