{
    "additionDate": "2022-02-15T17:50:19.119024Z",
    "biotoolsCURIE": "biotools:covidium",
    "biotoolsID": "covidium",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kraza@jmi.ac.in",
            "name": "Khalid Raza",
            "orcidid": "https://orcid.org/0000-0002-3646-6828",
            "typeEntity": "Person"
        }
    ],
    "description": "COVID-19 resource compendium (COVIDium) that would facilitate the researchers to find suitable DBs and tools for their research studies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://kraza.in/covidium/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-02-15T17:50:19.121565Z",
    "name": "COVIDium",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB057",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Oxford University Press.The severe acute respiratory syndrome coronavirus 2 that causes coronavirus disease 2019 (COVID-19) disrupted the normal functioning throughout the world since early 2020 and it continues to do so. Nonetheless, the global pandemic was taken up as a challenge by researchers across the globe to discover an effective cure, either in the form of a drug or vaccine. This resulted in an unprecedented surge of experimental and computational data and publications, which often translated their findings in the form of databases (DBs) and tools. Over 160 such DBs and more than 80 software tools were developed, which are uncharacterized, unannotated, deployed at different universal resource locators and are challenging to reach out through a normal web search. Besides, most of the DBs/tools are present on preprints and are either underutilized or unrecognized because of their inability to make it to top Google search hits. Henceforth, there was a need to crawl and characterize these DBs and create a compendium for easy referencing. The current article is one such concerted effort in this direction to create a COVID-19 resource compendium (COVIDium) that would facilitate the researchers to find suitable DBs and tools for their research studies. COVIDium tries to classify the DBs and tools into 11 broad categories for quick navigation. It also provides end-users some generic hit terms to filter the DB entries for quick access to the resources. Additionally, the DB provides Tracker Dashboard, Neuro Resources, references to COVID-19 datasets and protein-protein interactions. This compendium will be periodically updated to accommodate new resources. Database URL: The COVIDium is accessible through http://kraza.in/covidium/",
                "authors": [
                    {
                        "name": "Bhat A.M."
                    },
                    {
                        "name": "Qazi S."
                    },
                    {
                        "name": "Raza K."
                    },
                    {
                        "name": "Satyam R."
                    },
                    {
                        "name": "Yousef M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "COVIDium: A COVID-19 resource compendium"
            },
            "pmcid": "PMC8500058",
            "pmid": "34585731"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        }
    ],
    "validated": 1
}
