{
    "accessibility": "Open access",
    "additionDate": "2021-12-15T14:54:37.772689Z",
    "biotoolsCURIE": "biotools:rcat",
    "biotoolsID": "rcat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "huangml@suda.edu.cn",
            "name": "Moli Huang",
            "orcidid": "https://orcid.org/0000-0001-5543-9334",
            "typeEntity": "Person"
        },
        {
            "name": "Hao Qiu"
        },
        {
            "name": "Meng Meng"
        },
        {
            "name": "Shufan Zhang"
        },
        {
            "name": "Zhibo Liu"
        },
        {
            "name": "Zhiwei Liu"
        }
    ],
    "description": "A Precise, Efficient and User-Friendly Tool for Circadian Clock Genes Analysis.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/lzbbest/Rhythmic-Component-Analysis-Tool/releases/tag/RCAT"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lzbbest/Rhythmic-Component-Analysis-Tool",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-15T14:54:37.775251Z",
    "license": "MIT",
    "name": "RCAT",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S12539-021-00471-2",
            "metadata": {
                "abstract": "© 2021, International Association of Scientists in the Interdisciplinary Areas.High-throughput next-generation sequencing (NGS) technologies and real-time circadian dynamics reporting systems produce large amounts of experimental data on RNA and protein levels in the field of circadian rhythm and therefore require statistical knowledge and computational skills for quantitative analysis. Although there are many software applications that can process these data, they are often difficult to use and computationally inefficient. Hence, a convenient, user-friendly tool that can accurately acquire rhythmic components (period, amplitude, and phase) of circadian clock genes is necessary. Here, we develop a new analysis tool named rhythmic component analysis tool (RCAT), which has an easily understood interface featuring a one-button operation, that presents all results as tables and images and automatically saves them as CSV files. We use the relative amplitude error (RAE), widely-adopted criteria on the circadian research field to estimate the quality of results. To illustrate the analytical ability of the RCAT under different situations, we generate four groups of time-series data by CircaInSilico (a web server for generating synthetic genome biology data to benchmark statistical methods for studying biological rhythms) with different collection intervals and amplitude ranges and use RCAT to analyze them. To demonstrate the effectiveness of RCAT, we analyze two sets of case studies with time-series data: one set uses microarray and RNA-Seq data from the gene expression omnibus (GEO) repository to identify core clock genes (CCGs) with significant periodicity in the liver, and the other set uses real-time fluorescence reporting data collected by Lumicycle® (a commonly-used luminometer) to calculate the precise period, amplitude and phase. In these examples, most cycling samples are successfully detected by the RCAT within a short collection time, and accurate rhythmic components are also successfully computed. These results indicate that RCAT improves flexibility and convenience in periodic oscillation data analysis. RCAT, is freely available at: https://github.com/lzbbest/Rhythmic-Component-Analysis-Tool/releases. It, as a cross-platform software, can be run not only on Linux, but also on Win10, Win8 and Win7. Graphical abstract: [Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Huang M."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Meng M."
                    },
                    {
                        "name": "Qiu H."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "Rhythmic Component Analysis Tool (RCAT): A Precise, Efficient and User-Friendly Tool for Circadian Clock Genes Analysis"
            },
            "pmid": "34374039"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
