{
    "additionDate": "2021-11-29T11:32:34.597999Z",
    "biotoolsCURIE": "biotools:rtabnetsp",
    "biotoolsID": "rtabnetsp",
    "confidence_flag": "tool",
    "description": "The rtabnetsp package enables retrieval of health indicators data from São Paulo's TABNET system.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/joaohmorais/rtabnetsp",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T11:32:34.600518Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/joaohmorais/rtabnetsp/issues"
        }
    ],
    "name": "rtabnetsp",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1590/S1679-4974202100020",
            "metadata": {
                "abstract": "Health status indicators are an important tool for monitoring the performance of public health actions, identifying trends and priority regions for resource allocation. An R package was developed in order to increase the feasibility of handling and analyzing health status indicator data. The rtabnetsp package requests data from TabNet servers on the São Paulo State Department of Health website, retrieving and preprocessing the data for user manipulation. This article presents the rtabnetsp package and its functions, installation and use; as well as providing examples of its functionalities, which involve listing and searching among available indicators, selecting desired content and obtaining data aggregated according to regionalization level held on the data matrix, enabling greater agility in tasks regarding public health management in the state of São Paulo. Indicadores de saúde representam uma importante ferramenta de acompanhamento de desempenho de ações em Saúde Pública, permitindo a avaliação de intervenções realizadas, bem como a identificação de tendências e regiões prioritárias para alocação de recursos. Com o objetivo de aumentar a praticidade nas tarefas de análise e manipulação de dados desses indicadores, foi criado um pacote R. O pacote rtabnetsp realiza requisições aos servidores TabNet da página eletrônica da Secretaria de Estado da Saúde de São Paulo, recuperando e tratando tais dados para utilização do usuário. Este artigo apresenta o pacote rtabnetsp e suas funções, modo de instalação e uso; traz também exemplos de suas funcionalidades, que permitem a visualização, busca e seleção, entre uma lista de indicadores, do conteúdo desejado, além da obtenção dos dados agregados pelo nível de regionalização disponível na matriz de dados, conferindo maior agilidade a tarefas de gestão em saúde do estado de São Paulo. Indicadores de salud son una herramienta importante para monitorear el desempeño de las acciones de salud pública, permitiendo la evaluación de las intervenciones hechas, así como la identificación de tendencias y regiones prioritarias para la asignación de recursos. En la búsqueda de aumentar la practicidad en las tareas de análisis y manipulación de datos de estos indicadores, se creó un paquete R. El paquete rtabnetsp realiza solicitudes a los servidores TabNet del Departamento de Salud del Estado de São Paulo, recogiendo y procesando dichos datos para el usuario. Este artículo presenta el paquete, sus funciones, instalación y uso, así como ejemplos de sus funcionalidades, que permiten visualizar y buscar desde un listado de indicadores, seleccionar el contenido deseado y obtener los datos agregados por el nivel de regionalización disponible en la matriz de datos, alcanzando más agilidad en las tareas de gestión de la salud en el estado de São Paulo.",
                "authors": [
                    {
                        "name": "Fazenda AL."
                    },
                    {
                        "name": "Konstantyner T.C.R.O."
                    },
                    {
                        "name": "Martins C.B."
                    },
                    {
                        "name": "Morais J.H.A."
                    },
                    {
                        "name": "Sala A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Epidemiologia e servicos de saude : revista do Sistema Unico de Saude do Brasil",
                "title": "Rtabnetsp: an R package for retrieving São Paulo State health status indicators, Brazil Rtabnetsp: pacote R para extração de indicadores de saúde do estado de São Paulo"
            },
            "pmid": "33852697",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
