{"collectionID": ["Proteomics"], "accessibility": [], "topic": [{"term": "Systems biology", "uri": "http://edamontology.org/topic_2259"}, {"term": "Transcriptomics", "uri": "http://edamontology.org/topic_3308"}, {"term": "Human biology", "uri": "http://edamontology.org/topic_2815"}, {"term": "Proteomics", "uri": "http://edamontology.org/topic_0121"}, {"term": "Metabolomics", "uri": "http://edamontology.org/topic_3172"}, {"term": "Data visualisation", "uri": "http://edamontology.org/topic_0092"}, {"term": "Data visualisation", "uri": "http://edamontology.org/topic_0092"}], "owner": "d.gabrielaitis", "cost": null, "relation": [], "download": [], "validated": 0, "publication": [{"doi": "10.1186/1752-0509-7-64", "note": null, "version": null, "pmid": null, "type": null, "pmcid": null, "metadata": {"title": "3Omics: A web-based systems biology tool for analysis, integration and visualization of human transcriptomic, proteomic and metabolomic data", "abstract": "Background: Integrative and comparative analyses of multiple transcriptomics, proteomics and metabolomics datasets require an intensive knowledge of tools and background concepts. Thus, it is challenging for users to perform such analyses, highlighting the need for a single tool for such purposes. The 3Omics one-click web tool was developed to visualize and rapidly integrate multiple human inter- or intra-transcriptomic, proteomic, and metabolomic data by combining five commonly used analyses: correlation networking, coexpression, phenotyping, pathway enrichment, and GO (Gene Ontology) enrichment.Results: 3Omics generates inter-omic correlation networks to visualize relationships in data with respect to time or experimental conditions for all transcripts, proteins and metabolites. If only two of three omics datasets are input, then 3Omics supplements the missing transcript, protein or metabolite information related to the input data by text-mining the PubMed database. 3Omics' coexpression analysis assists in revealing functions shared among different omics datasets. 3Omics' phenotype analysis integrates Online Mendelian Inheritance in Man with available transcript or protein data. Pathway enrichment analysis on metabolomics data by 3Omics reveals enriched pathways in the KEGG/HumanCyc database. 3Omics performs statistical Gene Ontology-based functional enrichment analyses to display significantly overrepresented GO terms in transcriptomic experiments. Although the principal application of 3Omics is the integration of multiple omics datasets, it is also capable of analyzing individual omics datasets. The information obtained from the analyses of 3Omics in Case Studies 1 and 2 are also in accordance with comprehensive findings in the literature.Conclusions: 3Omics incorporates the advantages and functionality of existing software into a single platform, thereby simplifying data analysis and enabling the user to perform a one-click integrated analysis. Visualization and analysis results are downloadable for further user customization and analysis. The 3Omics software can be freely accessed at http://3omics.cmdm.tw. © 2013 Kuo et al.; licensee BioMed Central Ltd.", "citationCount": 54, "authors": [{"name": "Kuo T.-C."}, {"name": "Tian T.-F."}, {"name": "Tseng Y.J."}], "date": "2013-07-13T00:00:00Z", "journal": "BMC Systems Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Yufeng Jane Tseng", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "yjtseng@csie.ntu.edu.tw"}], "biotoolsCURIE": "biotools:3omics", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://3omics.cmdm.tw/", "function": [{"note": null, "input": [], "operation": [{"term": "Sequence analysis", "uri": "http://edamontology.org/operation_2403"}, {"term": "Genome visualisation", "uri": "http://edamontology.org/operation_3208"}], "cmd": null, "output": []}], "lastUpdate": "2019-03-26T08:10:08Z", "otherID": [], "description": "A web based systems biology visualization tool for integrating human transcriptomic, proteomic and metabolomic data.", "toolType": ["Web application"], "editPermission": {"type": "group", "authors": ["proteomics.bio.tools"]}, "language": ["PHP", "Perl"], "link": [], "biotoolsID": "3omics", "additionDate": "2018-08-17T19:04:18Z", "name": "3Omics", "license": null, "documentation": [{"url": "https://3omics.cmdm.tw/help.php", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}