{
    "accessibility": "Open access",
    "additionDate": "2022-12-31T00:20:04.996941Z",
    "biotoolsCURIE": "biotools:ican",
    "biotoolsID": "ican",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kurata@bio.kyutech.ac.jp",
            "name": "Hiroyuki Kurata",
            "orcidid": "https://orcid.org/0000-0003-4254-2214",
            "typeEntity": "Person"
        },
        {
            "name": "Sho Tsukiyama"
        }
    ],
    "description": "Interpretable cross-attention network for identifying drug and target protein interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kuratahiroyuki/ICAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:14:44.142069Z",
    "license": "MIT",
    "name": "ICAN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0276609",
            "metadata": {
                "abstract": "Drug–target protein interaction (DTI) identification is fundamental for drug discovery and drug repositioning, because therapeutic drugs act on disease-causing proteins. However, the DTI identification process often requires expensive and time-consuming tasks, including biological experiments involving large numbers of candidate compounds. Thus, a variety of computation approaches have been developed. Of the many approaches available, chemo-genomics feature-based methods have attracted considerable attention. These methods compute the feature descriptors of drugs and proteins as the input data to train machine and deep learning models to enable accurate prediction of unknown DTIs. In addition, attention-based learning methods have been proposed to identify and interpret DTI mechanisms. However, improvements are needed for enhancing prediction performance and DTI mechanism elucidation. To address these problems, we developed an attention-based method designated the interpretable cross-attention network (ICAN), which predicts DTIs using the Simplified Molecular Input Line Entry System of drugs and amino acid sequences of target proteins. We optimized the attention mechanism architecture by exploring the cross-attention or self-attention, attention layer depth, and selection of the context matrixes from the attention mechanism. We found that a plain attention mechanism that decodes drug-related protein context features without any protein-related drug context features effectively achieved high performance. The ICAN outperformed state-of-the-art methods in several metrics on the DAVIS dataset and first revealed with statistical significance that some weighted sites in the cross-attention weight matrix represent experimental binding sites, thus demonstrating the high interpretability of the results. The program is freely available at https://github.com/kuratahiroyuki/ICAN.",
                "authors": [
                    {
                        "name": "Kurata H."
                    },
                    {
                        "name": "Tsukiyama S."
                    }
                ],
                "citationCount": 8,
                "date": "2022-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "ICAN: Interpretable cross-attention network for identifying drug and target protein interactions"
            },
            "pmcid": "PMC9591068",
            "pmid": "36279284"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
