{
    "additionDate": "2018-10-22T10:48:35Z",
    "biotoolsCURIE": "biotools:meneco",
    "biotoolsID": "meneco",
    "credit": [
        {
            "email": "anne.siegel@irisa.fr",
            "name": "Anne Siegel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "prigent@chalmers.se",
            "name": "Sylvain Prigent",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Topological gap-filling of genome-scale draft metabolic networks.",
    "download": [
        {
            "type": "Source code",
            "url": "https://codeload.github.com/bioasp/meneco/zip/meneco-1.5.2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic labeling",
                    "uri": "http://edamontology.org/operation_3715"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "https://bioasp.github.io/meneco/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-12-14T20:34:14Z",
    "license": "GPL-3.0",
    "name": "meneco",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "jgot",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1005276",
            "metadata": {
                "abstract": "© 2017 Prigent et al.Increasing amounts of sequence data are becoming available for a wide range of non-model organisms. Investigating and modelling the metabolic behaviour of those organisms is highly relevant to understand their biology and ecology. As sequences are often incomplete and poorly annotated, draft networks of their metabolism largely suffer from incompleteness. Appropriate gap-filling methods to identify and add missing reactions are therefore required to address this issue. However, current tools rely on phenotypic or taxonomic information, or are very sensitive to the stoichiometric balance of metabolic reactions, especially concerning the co-factors. This type of information is often not available or at least prone to errors for newly-explored organisms. Here we introduce Meneco, a tool dedicated to the topological gap-filling of genome-scale draft metabolic networks. Meneco reformulates gap-filling as a qualitative combinatorial optimization problem, omitting constraints raised by the stoichiometry of a metabolic network considered in other methods, and solves this problem using Answer Set Programming. Run on several artificial test sets gathering 10,800 degraded Escherichia coli networks Meneco was able to efficiently identify essential reactions missing in networks at high degradation rates, outperforming the stoichiometry-based tools in scalability. To demonstrate the utility of Meneco we applied it to two case studies. Its application to recent metabolic networks reconstructed for the brown algal model Ectocarpus siliculosus and an associated bacterium Candidatus Phaeomarinobacter ectocarpi revealed several candidate metabolic pathways for algal-bacterial interactions. Then Meneco was used to reconstruct, from transcriptomic and metabolomic data, the first metabolic network for the microalga Euglena mutabilis. These two case studies show that Meneco is a versatile tool to complete draft genome-scale metabolic networks produced from heterogeneous data, and to suggest relevant reactions that explain the metabolic capacity of a biological system.",
                "authors": [
                    {
                        "name": "Prigent S."
                    },
                    {
                        "name": "Frioux C."
                    },
                    {
                        "name": "Dittami S.M."
                    },
                    {
                        "name": "Thiele S."
                    },
                    {
                        "name": "Larhlimi A."
                    },
                    {
                        "name": "Collet G."
                    },
                    {
                        "name": "Gutknecht F."
                    },
                    {
                        "name": "Got J."
                    },
                    {
                        "name": "Eveillard D."
                    },
                    {
                        "name": "Bourdon J."
                    },
                    {
                        "name": "Plewniak F."
                    },
                    {
                        "name": "Tonon T."
                    },
                    {
                        "name": "Siegel A."
                    }
                ],
                "citationCount": 23,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Meneco, a Topology-Based Gap-Filling Tool Applicable to Degraded Genome-Wide Metabolic Networks"
            },
            "pmcid": "PMC5302834",
            "pmid": "28129330",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ],
    "validated": 1,
    "version": [
        "1.5"
    ]
}