{
    "additionDate": "2021-01-18T08:32:10Z",
    "biotoolsCURIE": "biotools:i4mc-mouse",
    "biotoolsID": "i4mc-mouse",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kurata@bio.kyutech.ac.jp",
            "name": "Hiroyuki Kurata",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved identification of DNA N4-methylcytosine sites in the mouse genome using multiple encoding schemes.\n\ni4mC-Mouse is available for public.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://kurata14.bio.kyutech.ac.jp/i4mC-Mouse/",
    "lastUpdate": "2021-02-01T09:17:09Z",
    "name": "i4mC-Mouse",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2020.04.001",
            "metadata": {
                "abstract": "© 2020 The AuthorsN4-methylcytosine (4mC) is one of the most important DNA modifications and involved in regulating cell differentiations and gene expressions. The accurate identification of 4mC sites is necessary to understand various biological functions. In this work, we developed a new computational predictor called i4mC-Mouse to identify 4mC sites in the mouse genome. Herein, six encoding schemes of k-space nucleotide composition (KSNC), k-mer nucleotide composition (Kmer), mono nucleotide binary encoding (MBE), dinucleotide binary encoding, electron–ion interaction pseudo potentials (EIIP) and dinucleotide physicochemical composition were explored that cover different characteristics of DNA sequence information. Subsequently, we built six RF-based encoding models and then linearly combined their probability scores to construct the final predictor. Among the six RF-based models, the Kmer, KSNC, MBE, and EIIP encodings are sufficient, which contributed to 10%, 45%, 25%, and 20% of the prediction performance, respectively. On the independent test the i4mC-Mouse predicted the 4mC sites with accuracy and MCC of 0.816 and 0.633, respectively, which were approximately 2.5% and 5% higher than those of the existing method (4mCpred-EL). For experimental biologists, a freely available web application was implemented at http://kurata14.bio.kyutech.ac.jp/i4mC-Mouse/.",
                "authors": [
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Shoombuatong W."
                    },
                    {
                        "name": "Khatun M.S."
                    },
                    {
                        "name": "Kurata H."
                    }
                ],
                "citationCount": 19,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "i4mC-Mouse: Improved identification of DNA N4-methylcytosine sites in the mouse genome using multiple encoding schemes"
            },
            "pmcid": "PMC7168350",
            "pmid": "32322372"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ]
}