{
    "additionDate": "2021-03-19T09:08:28Z",
    "biotoolsCURIE": "biotools:fastral",
    "biotoolsID": "fastral",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "warnow@illinois.edu",
            "name": "Tandy Warnow",
            "typeEntity": "Person"
        }
    ],
    "description": "Improving scalability of phylogenomic analysis.\n\nFASTRAL is a novel approach for running ASTRAL, a widely used and popular species tree reconstruction method. FASTRAL runs up to ~800 times faster than ASTRAL but with a similar (or sometimes better) accuracy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PayamDiba/FASTRAL",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T20:38:34.986767Z",
    "license": "MIT",
    "name": "FASTRAL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab093",
            "metadata": {
                "abstract": "Motivation: ASTRAL is the current leading method for species tree estimation from phylogenomic datasets (i.e. hundreds to thousands of genes) that addresses gene tree discord resulting from incomplete lineage sorting (ILS). ASTRAL is statistically consistent under the multi-locus coalescent model (MSC), runs in polynomial time, and is able to run on large datasets. Key to ASTRAL's algorithm is the use of dynamic programming to find an optimal solution to the MQSST (maximum quartet support supertree) within a constraint space that it computes from the input. Yet, ASTRAL can fail to complete within reasonable timeframes on large datasets with many genes and species, because in these cases the constraint space it computes is too large. Results: Here, we introduce FASTRAL, a phylogenomic estimation method. FASTRAL is based on ASTRAL, but uses a different technique for constructing the constraint space. The technique we use to define the constraint space maintains statistical consistency and is polynomial time; thus we prove that FASTRAL is a polynomial time algorithm that is statistically consistent under the MSC. Our performance study on both biological and simulated datasets demonstrates that FASTRAL matches or improves on ASTRAL with respect to species tree topology accuracy (and under high ILS conditions it is statistically significantly more accurate), while being dramatically faster-especially on datasets with large numbers of genes and high ILS-due to using a significantly smaller constraint space. VC The Author(s) 2021. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Dibaeinia P."
                    },
                    {
                        "name": "Tabe-Bordbar S."
                    },
                    {
                        "name": "Warnow T."
                    }
                ],
                "citationCount": 11,
                "date": "2021-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FASTRAL: Improving scalability of phylogenomic Analysis"
            },
            "pmcid": "PMC8388037",
            "pmid": "33576396"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
