
{
    "credit": [
        {
            "email": "bostanict.net@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "gmod-gbrowse@lists.sourceforge.net",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://cab.unina.it/gbrowse2/general_help.html"
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Present-day '-omics' technologies produce overwhelming amounts of data which include genome sequences, information on gene expression (transcripts and proteins) and on cell metabolic status. These data represent multiple aspects of a biological system and need to be investigated as a whole to shed light on the mechanisms which underpin the system functionality. The gathering and convergence of data generated by high-throughput technologies, the effective integration of different data-sources and the analysis of the information content based on comparative approaches are key methods for meaningful biological interpretations. In the frame of the International Solanaceae Genome Project, we propose here ISOLA, an Italian SOLAnaceae genomics resource. Results: ISOLA (available at http://biosrv.cab.unina.it/isola) represents a trial platform and it is conceived as a multi-level computational environment. ISOLA currently consists of two main levels: the genome and the expression level. The cornerstone of the genome level is represented by the Solanum lycopersicum genome draft sequences generated by the International Tomato Genome Sequencing Consortium. Instead, the basic element of the expression level is the transcriptome information from different Solanaceae species, mainly in the form of species-specific comprehensive collections of Expressed Sequence Tags (ESTs). The cross-talk between the genome and the expression levels is based on data source sharing and on tools that enhance data quality, that extract information content from the levels' under parts and produce value-added biological knowledge. Conclusions: ISOLA is the result of a bioinformatics effort that addresses the challenges of the post-genomics era. It is designed to exploit '-omics' data based on effective integration to acquire biological knowledge and to approach a systems biology view. Beyond providing experimental biologists with a preliminary annotation of the tomato genome, this effort aims to produce a trial computational environment where different aspects and details are maintained as they are relevant for the analysis of the organization, the functionality and the evolution of the Solanaceae family. © 2008 Chiusano et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Chiusano M.L.",
                "D'Agostino N.",
                "Traini A.",
                "Licciardello C.",
                "Raimondo E.",
                "Aversano M.",
                "Frusciante L.",
                "Monti L."
            ],
            "cit_count": 16,
            "doi": "10.1186/1471-2105-9-S2-S7",
            "journal": "BMC Bioinformatics",
            "title": "ISOL\" An Italian SOLAnaceae genomics resource",
            "type": "Primary",
            "year": "2008-03-26"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Tomato_Genome_Browser",
        "biotoolsID": "Tomato_Genome_Browser",
        "description": "Genome browser for tomato (cultivar Heinz 1706 version 2.50) that includes RNAseq tags, EST and Tentative Consensus sequences to investigate the functional and structural annotation of the tomato genome.",
        "homepage": "http://cab.unina.it/cgi-bin/gb2/gbrowse/SL250/",
        "name": "Tomato Genome Browser",
        "version": [
            "1"
        ]
    }
}