{"credit":[{"email":"chhy@mail.ustc.edu.cn","name":"Haoyu Cheng","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://home.ustc.edu.cn/~chhy/#contract"},{"email":"xuyun@ustc.edu.cn","name":"Yun Xu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://home.ustc.edu.cn/~chhy/BitMapper.html"}],"function":[{"operation":[{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/bitmapper-short-reads-alignment-tool.html"}],"publication":[{"abstract":"© 2015 Cheng et al. Background: As the next-generation sequencing (NGS) technologies producing hundreds of millions of reads every day, a tremendous computational challenge is to map NGS reads to a given reference genome efficiently. However, existing methods of all-mappers, which aim at finding all mapping locations of each read, are very time consuming. The majority of existing all-mappers consist of 2 main parts, filtration and verification. This work significantly reduces verification time, which is the dominant part of the running time. Results: An efficient all-mapper, BitMapper, is developed based on a new vectorized bit-vector algorithm, which simultaneously calculates the edit distance of one read to multiple locations in a given reference genome. Experimental results on both simulated and real data sets show that BitMapper is from several times to an order of magnitude faster than the current state-of-the-art all-mappers, while achieving higher sensitivity, i.e., better quality solutions. Conclusions: We present BitMapper, which is designed to return all mapping locations of raw reads containing indels as well as mismatches. BitMapper is implemented in C under a GPL license. Binaries are freely available at http://home.ustc.edu.cn/%7Echhy.","authors":["Cheng H.","Jiang H.","Yang J.","Xu Y.","Shang Y."],"cit_count":11,"journal":"BMC Bioinformatics","pmid":"26063651","title":"BitMapper: An efficient all-mapper based on bit-vector computing","year":"2015-12-12"}],"summary":{"biotoolsCURIE":"biotools:bitmapper","biotoolsID":"bitmapper","description":"Efficient reads mappers for short reads of equal length. It is designed to output all mapping locations for each reads.","homepage":"http://home.ustc.edu.cn/~chhy/","name":"BitMapper"}}