{
    "additionDate": "2017-02-10T14:15:22Z",
    "biotoolsCURIE": "biotools:jprogo",
    "biotoolsID": "jprogo",
    "description": "Tool for the functional interpretation of prokaryotic microarray data using Gene Ontology information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data rendering",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.jprogo.de/index.jsp",
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "JProGO",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A novel program suite was implemented for the functional interpretation of high-throughput gene expression data based on the identification of Gene Ontology (GO) nodes. The focus of the analysis lies on the interpretation of microarray data from prokaryotes. The three well established statistical methods of the threshold value-based Fisher's exact test, as well as the threshold value-independent Kolmogorov-Smirnov and Student's t-test were employed in order to identify the groups of genes with a significantly altered expression profile. Furthermore, we provide the application of the rankbased unpaired Wilcoxon's test for a GO-based microarray data interpretation. Further features of the program include recognition of the alternative gene names and the correction for multiple testing. Obtained results are visualized interactively both as a table and as a GO subgraph including all significant nodes. Currently, JProGO enables the analysis of microarray data from more than 20 different prokaryotic species, including all important model organisms, and thus constitutes a useful web service for the microbial research community. JProGO is freely accessible via the web at the following address: http://www.jprogo.de. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Scheer M."
                    },
                    {
                        "name": "Klawon F."
                    },
                    {
                        "name": "Munch R."
                    },
                    {
                        "name": "Grote A."
                    },
                    {
                        "name": "Hiller K."
                    },
                    {
                        "name": "Choi C."
                    },
                    {
                        "name": "Koch I."
                    },
                    {
                        "name": "Schobert M."
                    },
                    {
                        "name": "Hartlig E."
                    },
                    {
                        "name": "Klages U."
                    },
                    {
                        "name": "Jahn D."
                    }
                ],
                "citationCount": 26,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "JProGO: A novel tool for the functional interpretation of prokaryotic microarray data using Gene Ontology information"
            },
            "pmid": "16845060"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}