{
    "accessibility": "Open access",
    "additionDate": "2024-01-28T18:24:18.062768Z",
    "biotoolsCURIE": "biotools:lircentral",
    "biotoolsID": "lircentral",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vprobon@ucy.ac.cy",
            "name": "Vasilis J Promponas",
            "orcidid": "https://orcid.org/0000-0003-3352-4831",
            "typeEntity": "Person"
        },
        {
            "name": "Agathangelos Chatzichristofi",
            "typeEntity": "Person"
        },
        {
            "name": "Vasileios Sagris",
            "typeEntity": "Person"
        }
    ],
    "description": "Manually curated online database of experimentally validated functional LIR motifs.\nLIRcentral contains information about manually curated entries of LIR-motifs that have been experimentally tested for their ability to bind Atg8 homologs, often in a biologically relevant context.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://lircentral.eu",
    "lastUpdate": "2024-01-28T18:24:18.065521Z",
    "license": "CC-BY-4.0",
    "name": "LIRcentral",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/15548627.2023.2235851",
            "metadata": {
                "abstract": "Several selective macroautophagy receptor and adaptor proteins bind members of the Atg8 (autophagy related 8) family using short linear motifs (SLiMs), most often referred to as Atg8-family interacting motifs (AIMs) or LC3-interacting regions (LIRs). AIM/LIR motifs have been extensively studied during the last fifteen years, since they can uncover the underlying biological mechanisms and possible substrates for this key catabolic process of eukaryotic cells. Prompted by the fact that experimental information regarding LIR motifs can be found scattered across heterogeneous literature resources, we have developed LIRcentral (https://lircentral.eu), a freely available online repository for user-friendly access to comprehensive, high-quality information regarding LIR motifs from manually curated publications. Herein, we describe the development of LIRcentral and showcase currently available data and features, along with our plans for the expansion of this resource. Information incorporated in LIRcentral is useful for accomplishing a variety of research tasks, including: (i) guiding wet biology researchers for the characterization of novel instances of LIR motifs, (ii) giving bioinformaticians/computational biologists access to high-quality LIR motifs for building novel prediction methods for LIR motifs and LIR containing proteins (LIRCPs) and (iii) performing analyses to better understand the biological importance/features of functional LIR motifs. We welcome feedback on the LIRcentral content and functionality by all interested researchers and anticipate this work to spearhead a community effort for sustaining this resource which will further promote progress in studying LIR motifs/LIRCPs. Abbreviations: AIM, Atg8-family interacting motif; Atg8, autophagy related 8; GABARAP, GABA type A receptor-associated protein; LIR, LC3-interacting region; LIRCP, LIR-containing protein; MAP1LC3/LC3, microtubule associated protein 1 light chain 3; PMID, PubMed identifier; PPI, protein-protein interaction; SLiM, short linear motif.",
                "authors": [
                    {
                        "name": "Chatzichristofi A."
                    },
                    {
                        "name": "Eftychiou M."
                    },
                    {
                        "name": "Iliopoulos I."
                    },
                    {
                        "name": "Kalvari I."
                    },
                    {
                        "name": "Nezis I.P."
                    },
                    {
                        "name": "Pallaris A."
                    },
                    {
                        "name": "Price N."
                    },
                    {
                        "name": "Promponas V.J."
                    },
                    {
                        "name": "Sagris V."
                    },
                    {
                        "name": "Theodosiou T."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Autophagy",
                "title": "LIRcentral: a manually curated online database of experimentally validated functional LIR motifs"
            },
            "pmcid": "PMC10621281",
            "pmid": "37530436"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
