{
    "additionDate": "2024-03-06T13:24:56.194898Z",
    "biotoolsCURIE": "biotools:phisical",
    "biotoolsID": "phisical",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "arun.konagurthu@monash.edu",
            "name": "Arun S Konagurthu",
            "typeEntity": "Person"
        }
    ],
    "description": "Minimum message length inference of joint distributions of backbone and sidechain dihedral angles.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Accessible surface calculation",
                    "uri": "http://edamontology.org/operation_0384"
                },
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "http://lcb.infotech.monash.edu.au/phisical",
    "lastUpdate": "2024-11-24T14:12:09.137213Z",
    "name": "PhiSiCal",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad251",
            "metadata": {
                "abstract": "The tendency of an amino acid to adopt certain configurations in folded proteins is treated here as a statistical estimation problem. We model the joint distribution of the observed mainchain and sidechain dihedral angles (hϕ; ψ; χ1; χ2; . . .i) of any amino acid by a mixture of a product of von Mises probability distributions. This mixture model maps any vector of dihedral angles to a point on a multi-dimensional torus. The continuous space it uses to specify the dihedral angles provides an alternative to the commonly used rotamer libraries. These rotamer libraries discretize the space of dihedral angles into coarse angular bins, and cluster combinations of sidechain dihedral angles (hχ1; χ2; . . .i) as a function of backbone hϕ; ψi conformations. A ‘good’ model is one that is both concise and explains (compresses) observed data. Competing models can be compared directly and in particular our model is shown to outperform the Dunbrack rotamer library in terms of model complexity (by three orders of magnitude) and its fidelity (on average 20% more compression) when losslessly explaining the observed dihedral angle data across experimental resolutions of structures. Our method is unsupervised (with parameters estimated automatically) and uses information theory to determine the optimal complexity of the statistical model, thus avoiding under/over-fitting, a common pitfall in model selection problems. Our models are computationally inexpensive to sample from and are geared to support a number of downstream studies, ranging from experimental structure refinement, de novo protein design, and protein structure prediction. We call our collection of mixture models as PhiSiCal (ϕψχal).",
                "authors": [
                    {
                        "name": "Allison L."
                    },
                    {
                        "name": "Amarasinghe P.R."
                    },
                    {
                        "name": "Konagurthu A.S."
                    },
                    {
                        "name": "Lesk A.M."
                    },
                    {
                        "name": "Stuckey P.J."
                    },
                    {
                        "name": "de la Banda M.G."
                    }
                ],
                "date": "2023-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Getting ‘ϕψxal’ with proteins: minimum message length inference of joint distributions of backbone and sidechain dihedral angles"
            },
            "pmcid": "PMC10311319",
            "pmid": "37387189"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
