{
    "additionDate": "2018-08-03T15:18:01Z",
    "biotoolsCURIE": "biotools:chromagnon",
    "biotoolsID": "chromagnon",
    "credit": [
        {
            "email": "a.matsuda@nict.go.jp",
            "name": "Atsushi Matsuda",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Image correction software for chromatic shifts in fluorescence microscopic images.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/macronucleus/chromagnon"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/macronucleus/chromagnon",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-2.0",
    "name": "Chromagnon",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/s41598-018-25922-7",
            "metadata": {
                "abstract": "© 2018 The Author(s).Correction of chromatic shift is necessary for precise registration of multicolor fluorescence images of biological specimens. New emerging technologies in fluorescence microscopy with increasing spatial resolution and penetration depth have prompted the need for more accurate methods to correct chromatic aberration. However, the amount of chromatic shift of the region of interest in biological samples often deviates from the theoretical prediction because of unknown dispersion in the biological samples. To measure and correct chromatic shift in biological samples, we developed a quadrisection phase correlation approach to computationally calculate translation, rotation, and magnification from reference images. Furthermore, to account for local chromatic shifts, images are split into smaller elements, for which the phase correlation between channels is measured individually and corrected accordingly. We implemented this method in an easy-to-use open-source software package, called Chromagnon, that is able to correct shifts with a 3D accuracy of approximately 15 nm. Applying this software, we quantified the level of uncertainty in chromatic shift correction, depending on the imaging modality used, and for different existing calibration methods, along with the proposed one. Finally, we provide guidelines to choose the optimal chromatic shift registration method for any given situation.",
                "authors": [
                    {
                        "name": "Matsuda A."
                    },
                    {
                        "name": "Schermelleh L."
                    },
                    {
                        "name": "Hirano Y."
                    },
                    {
                        "name": "Haraguchi T."
                    },
                    {
                        "name": "Hiraoka Y."
                    }
                ],
                "citationCount": 25,
                "date": "2018-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Accurate and fiducial-marker-free correction for three-dimensional chromatic shift in biological fluorescence microscopy"
            },
            "pmcid": "PMC5954143",
            "pmid": "29765093"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biological imaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}