{
    "additionDate": "2017-08-03T19:02:05Z",
    "biotoolsCURIE": "biotools:starpdb",
    "biotoolsID": "starpdb",
    "credit": [
        {
            "email": "raghava@imtech.res.in",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://crdd.osdd.net/raghava/starpdb/contact.php"
        }
    ],
    "description": "A web-server for structural annotation of a protein based on its similarity with known protein structures.",
    "documentation": [
        {
            "type": "General",
            "url": "http://crdd.osdd.net/raghava/starpdb/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Protein structure annotation",
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "homepage": "http://crdd.osdd.net/raghava/starpdb/index.php",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/starpdb-blast-based-structural-annotation-of-a-protein.html"
        }
    ],
    "name": "StarPDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 Singh and Raghava. Background: In the era of next-generation sequencing where thousands of genomes have been already sequenced; size of protein databases is growing with exponential rate. Structural annotation of these proteins is one of the biggest challenges for the computational biologist. Although, it is easy to perform BLAST search against Protein Data Bank (PDB) but it is difficult for a biologist to annotate protein residues from BLAST search. Results: A web-server StarPDB has been developed for structural annotation of a protein based on its similarity with known protein structures. It uses standard BLAST software for performing similarity search of a query protein against protein structures in PDB. This server integrates wide range modules for assigning different types of annotation that includes, Secondary-structure, Accessible surface area, Tight-turns, DNA-RNA and Ligand modules. Secondary structure module allows users to predict regular secondary structure states to each residue in a protein. Accessible surface area predict the exposed or buried residues in a protein. Tight-turns module is designed to predict tight turns like beta-turns in a protein. DNA-RNA module developed for predicting DNA and RNA interacting residues in a protein. Similarly, Ligand module of server allows one to predicted ligands, metal and nucleotides ligand interacting residues in a protein. Conclusions: In summary, this manuscript presents a web server for comprehensive annotation of a protein based on similarity search. It integrates number of visualization tools that facilitate users to understand structure and function of protein residues. This web server is available freely for scientific community from URL http://crdd.osdd.net/raghava/starpdb. Reviewers: This article was reviewed by Prof Michael Gromiha, Prof. Thomas Dandekar and Dr. I. King Jordan.",
                "authors": [
                    {
                        "name": "Singh H."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 4,
                "date": "2016-01-25T00:00:00Z",
                "journal": "Biology Direct",
                "title": "BLAST-based structural annotation of protein residues using Protein Data Bank"
            },
            "pmid": "26810894"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}