{
    "additionDate": "2017-08-03T18:49:53Z",
    "biotoolsCURIE": "biotools:modelestimator",
    "biotoolsID": "modelestimator",
    "credit": [
        {
            "email": "arve@nada.su.se",
            "name": "Lars Arvestad",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.csc.kth.se/~arve"
        }
    ],
    "description": "Estimates amino acid replacement rates from an input of aligned sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/arvestad/modelestimator/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "http://www.csc.kth.se/~arve/code/modelestimator/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/modelestimator-1-1-estimate-amino-acid-replacement-rates.html"
        }
    ],
    "name": "MODELESTIMATOR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Replacement rate matrices describe the process of evolution at one position in a protein and are used in many applications where proteins are studied with an evolutionary perspective. Several general matrices have been suggested and have proved to be good approximations of the real process. However, there are data for which general matrices are inappropriate, for example, special protein families, certain lineages in the tree of life, or particular parts of proteins. Analysis of such data could benefit from adaption of a data-specific rate matrix. This paper suggests two new methods for estimating replacement rate matrices from independent pairwise protein sequence alignments and also carefully studies Müller-Vingron's resolvent method. Comprehensive tests on synthetic datasets show that both new methods perform better than the resolvent method in a variety of settings. The best method is furthermore demonstrated to be robust on small datasets as well as practical on very large datasets of real data. Neither short nor divergent sequence pairs have to be discarded, making the method economical with data. A generalization to multialignment data is suggested and used in a test on protein-domain family phylogenies, where it is shown that the method offers family-specific rate matrices that often have a significantly better likelihood than a general matrix. © Springer Science+Business Media, Inc. 2006.",
                "authors": [
                    {
                        "name": "Arvestad L."
                    }
                ],
                "citationCount": 9,
                "date": "2006-06-01T00:00:00Z",
                "journal": "Journal of Molecular Evolution",
                "title": "Efficient methods for estimating amino acid replacement rates"
            },
            "pmid": "16752207"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}