{
    "additionDate": "2021-01-20T11:00:12Z",
    "biotoolsCURIE": "biotools:codysan",
    "biotoolsID": "codysan",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "msanchezfe@uic.es",
            "name": "Mayka Sánchez",
            "typeEntity": "Person"
        }
    ],
    "description": "A Telemedicine Tool to Improve Awareness and Diagnosis for Patients With Congenital Dyserythropoietic Anemia.\n\nAlgorithms and recommendations for diagnosis and management of congenital dyserythropoietic anemia (CDA).\n\nThis website uses cookies to ensure you get the best experience on our website. Learn more.\n\nThis is a web service dedicated to Congenital Dyseritropoyetic Anemias. Our aim is to provide information to patients and their families, but also to provide doctors with specific tools for this disease.\n\nCongenital Dyseritropoyetic Anemias.\n\nCoDysAn collaborates with various Associations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                }
            ]
        }
    ],
    "homepage": "http://www.codysan.eu",
    "lastUpdate": "2021-05-14T05:33:07Z",
    "name": "CoDysAn",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FPHYS.2019.01063",
            "metadata": {
                "abstract": "© Copyright © 2019 Tornador, Sánchez-Prados, Cadenas, Russo, Venturi, Andolfo, Hernández-Rodriguez, Iolascon and Sánchez.Congenital Dyserythropoietic Anemia (CDA) is a heterogeneous group of hematological disorders characterized by chronic hyporegenerative anemia and distinct morphological abnormalities of erythroid precursors in the bone marrow. In many cases, a final diagnosis is not achieved due to different levels of awareness for the diagnosis of CDAs and lack of use of advanced diagnostic procedures. Researchers have identified five major types of CDA: types I, II, III, IV, and X-linked dyserythropoietic anemia and thrombocytopenia (XLDAT). Proper management in CDA is still unsatisfactory, as the different subtypes of CDA have different genetic causes and different but overlapping patterns of signs and symptoms. For this reason, we developed a new telemedicine tool that will help doctors to achieve a faster diagnostic for this disease. Using open access code, we have created a responsive webpage named CoDysAn (Congenital Dyserythropoietic Anemia) that includes practical information for CDA awareness and a step-by-step diagnostic tool based on a CDA algorithm. The site is currently available in four languages (Catalan, Spanish, Italian, and English). This telemedicine webpage is available at http://www.codysan.eu.",
                "authors": [
                    {
                        "name": "Tornador C."
                    },
                    {
                        "name": "Sanchez-Prados E."
                    },
                    {
                        "name": "Cadenas B."
                    },
                    {
                        "name": "Russo R."
                    },
                    {
                        "name": "Venturi V."
                    },
                    {
                        "name": "Andolfo I."
                    },
                    {
                        "name": "Hernandez-Rodriguez I."
                    },
                    {
                        "name": "Iolascon A."
                    },
                    {
                        "name": "Sanchez M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-09-13T00:00:00Z",
                "journal": "Frontiers in Physiology",
                "title": "CoDysAn: A Telemedicine Tool to Improve Awareness and Diagnosis for Patients With Congenital Dyserythropoietic Anemia"
            },
            "pmcid": "PMC6753183",
            "pmid": "31572203"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}