{
    "additionDate": "2017-02-10T14:15:08Z",
    "biotoolsCURIE": "biotools:tsema",
    "biotoolsID": "tsema",
    "credit": [
        {
            "email": "jmgonzalez@cnio.es",
            "name": "Jose Maria González-Izarzugaza",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Server for Efficient Mapping Assessment (TSEMA) predicts possible protein-protein interactions based on the comparision of phylogenetic trees derived from sequences of associated protein families.",
    "documentation": [
        {
            "type": "General",
            "url": "http://tsema.bioinfo.cnio.es/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                },
                {
                    "term": "Phylogenetic tree analysis (gene family prediction)",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://tsema.bioinfo.cnio.es/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "TSEMA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "An entire family of methodologies for predicting protein interactions is based on the observed fact that families of interacting proteins tend to have similar phylogenetic trees due to co-evolution. One application of this concept is the prediction of the mapping between the members of two interacting protein families (which protein within one family interacts with which protein within the other). The idea is that the real mapping would be the one maximizing the similarity between the trees. Since the exhaustive exploration of all possible mappings is not feasible for large families, current approaches use heuristic techniques which do not ensure the best solution to be found. This is why it is important to check the results proposed by heuristic techniques and to manually explore other solutions. Here we present TSEMA, the server for efficient mapping assessment. This system calculates an initial mapping between two families of proteins based on a Monte Carlo approach and allows the user to interactively modify it based on performance figures and/or specific biological knowledge. All the explored mappings are graphically shown over a representation of the phylogenetic trees. The system is freely available at http://pdg.cnb.uam.es/TSEMA. Standalone versions of the software behind the interface are available upon request from the authors. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Izarzugaza J.M.G."
                    },
                    {
                        "name": "Juan D."
                    },
                    {
                        "name": "Pons C."
                    },
                    {
                        "name": "Ranea J.A.G."
                    },
                    {
                        "name": "Valencia A."
                    },
                    {
                        "name": "Pazos F."
                    }
                ],
                "citationCount": 14,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TSEMA: Interactive prediction of protein pairings between interacting families"
            },
            "pmid": "16845017"
        },
        {
            "metadata": {
                "abstract": "Deciphering the network of protein interactions that underlines cellular operations has become one of the main tasks of proteomics and computational biology. Recently, a set of bioinformatics approaches has emerged for the prediction of possible interactions by combining sequence and genomic information. Even though the initial results are very promising, the current methods are still far from perfect. We propose here a new way of discovering possible protein-protein interactions based on the comparison of the evolutionary distances between the sequences of the associated protein families, an idea based on previous observations of correspondence between the phylogenetic trees of associated proteins in systems such as ligands and receptors. Here, we extend the approach to different test sets, including the statistical evaluation of their capacity to predict protein interactions. To demonstrate the possibilities of the system to perform large-scale predictions of interactions, we present the application to a collection of more than 67 000 pairs of E.coli proteins, of which 2742 are predicted to correspond to interacting proteins.",
                "authors": [
                    {
                        "name": "Pazos F."
                    },
                    {
                        "name": "Valencia A."
                    }
                ],
                "citationCount": 330,
                "date": "2001-12-05T00:00:00Z",
                "journal": "Protein Engineering",
                "title": "Similarity of phylogenetic trees as indicator of protein-protein interaction"
            },
            "pmid": "11707606"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}