{
    "additionDate": "2021-01-18T12:13:19Z",
    "biotoolsCURIE": "biotools:unipath",
    "biotoolsID": "unipath",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "debarka@iiitd.ac.in",
            "name": "Debarka Sengupta",
            "typeEntity": "Person"
        },
        {
            "email": "vibhor@iiitd.ac.in",
            "name": "Vibhor Kumar",
            "typeEntity": "Person"
        }
    ],
    "description": "a uniform approach for pathway and gene-set based analysis of heterogeneity in single-cell epigenome and transcriptome profiles.\n\nUniPath provides robust statistical methods to represent every single cell using pathway and gene-set enrichment scores. It can be used with both single cell RNA-seq and single cell ATAC-seq profile with scalability for atlas scale data-sets. UniPath comes with several features like pseudo-temporal ordering using pathway scores and unconventional way of enumerating differences between two cell populations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://reggenlab.github.io/UniPathWeb/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-09T18:00:02Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/reggenlab/UniPath"
        }
    ],
    "name": "UniPath",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1138",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Recent advances in single-cell open-chromatin and transcriptome profiling have created a challenge of exploring novel applications with a meaningful transformation of read-counts, which often have high variability in noise and drop-out among cells. Here, we introduce UniPath, for representing single-cells using pathway and gene-set enrichment scores by a transformation of their open-chromatin or gene-expression profiles. The robust statistical approach of UniPath provides high accuracy, consistency and scalability in estimating gene-set enrichment scores for every cell. Its framework provides an easy solution for handling variability in drop-out rate, which can sometimes create artefact due to systematic patterns. UniPath provides an alternative approach of dimension reduction of single-cell open-chromatin profiles. UniPath's approach of predicting temporal-order of single-cells using their pathway enrichment scores enables suppression of covariates to achieve correct order of cells. Analysis of mouse cell atlas using our approach yielded surprising, albeit biologically-meaningful co-clustering of cell-types from distant organs. By enabling an unconventional method of exploiting pathway co-occurrence to compare two groups of cells, our approach also proves to be useful in inferring context-specific regulations in cancer cells. Available at https://reggenlab.github.io/UniPathWeb/.",
                "authors": [
                    {
                        "name": "Chawla S."
                    },
                    {
                        "name": "Kong S.L."
                    },
                    {
                        "name": "Kumar V."
                    },
                    {
                        "name": "Samydurai S."
                    },
                    {
                        "name": "Sengupta D."
                    },
                    {
                        "name": "Tam W.L."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wu Z."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-22T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "UniPath: A uniform approach for pathway and gene-set based analysis of heterogeneity in single-cell epigenome and transcriptome profiles"
            },
            "pmid": "33275158"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
