{
    "additionDate": "2018-10-11T18:58:23Z",
    "biotoolsCURIE": "biotools:eegnet",
    "biotoolsID": "eegnet",
    "credit": [
        {
            "email": "mahmoud.hassan@univ-rennes1.fr",
            "name": "Mahmoud Hassan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "EEGNET is software designed to enclose the different steps from EEG signal preprocessing to brain network visualization.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://sites.google.com/site/eegnetworks/Tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/eegnetworks/home",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "CECILL-1.0",
    "name": "EEGNET",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0138297",
            "metadata": {
                "abstract": "© 2015 Hassan et al.The brain is a large-scale complex network often referred to as the \"connectome\". Exploring the dynamic behavior of the connectome is a challenging issue as both excellent time and space resolution is required. In this context Magneto/Electroencephalography (M/EEG) are effective neuroimaging techniques allowing for analysis of the dynamics of functional brain networks at scalp level and/or at reconstructed sources. However, a tool that can cover all the processing steps of identifying brain networks from M/EEG data is still missing. In this paper, we report a novel software package, called EEGNET, running under MATLAB (Math works, inc), and allowing for analysis and visualization of functional brain networks from M/EEG recordings. EEGNET is developed to analyze networks either at the level of scalp electrodes or at the level of reconstructed cortical sources. It includes i) Basic steps in preprocessing M/EEG signals, ii) the solution of the inverse problem to localize / reconstruct the cortical sources, iii) the computation of functional connectivity among signals collected at surface electrodes or/and time courses of reconstructed sources and iv) the computation of the network measures based on graph theory analysis. EEGNET is the unique tool that combines the M/EEG functional connectivity analysis and the computation of network measures derived from the graph theory. The first version of EEGNET is easy to use, flexible and user friendly. Copyright:",
                "authors": [
                    {
                        "name": "Hassan M."
                    },
                    {
                        "name": "Shamas M."
                    },
                    {
                        "name": "Khalil M."
                    },
                    {
                        "name": "Falou W.E."
                    },
                    {
                        "name": "Wendling F."
                    }
                ],
                "citationCount": 34,
                "date": "2015-09-17T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "EEGNET: An open source tool for analyzing and visualizing M/EEG connectome"
            },
            "pmcid": "PMC4574940",
            "pmid": "26379232",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        }
    ],
    "validated": 1
}