{
    "additionDate": "2020-01-09T17:58:10Z",
    "biotoolsCURIE": "biotools:uniConSig",
    "biotoolsID": "uniConSig",
    "confidence_flag": "tool",
    "description": "uniConSig is a genome-wide quantification of new biological and pathological functions of genes and pathways.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangxlab/uniConSig",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2021-01-16T17:37:04Z",
    "name": "uniConSig",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ093",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Identifying new gene functions and pathways underlying diseases and biological processes are major challenges in genomics research. Particularly, most methods for interpreting the pathways characteristic of an experimental gene list defined by genomic data are limited by their dependence on assessing the overlapping genes or their interactome topology, which cannot account for the variety of functional relations. This is particularly problematic for pathway discovery from single-cell genomics with low gene coverage or interpreting complex pathway changes such as during change of cell states. Here, we exploited the comprehensive sets of molecular concepts that combine ontologies, pathways, interactions and domains to help inform the functional relations. We first developed a universal concept signature (uniConSig) analysis for genome-wide quantification of new gene functions underlying biological or pathological processes based on the signature molecular concepts computed from known functional gene lists. We then further developed a novel concept signature enrichment analysis (CSEA) for deep functional assessment of the pathways enriched in an experimental gene list. This method is grounded on the framework of shared concept signatures between gene sets at multiple functional levels, thus overcoming the limitations of the current methods. Through meta-analysis of transcriptomic data sets of cancer cell line models and single hematopoietic stem cells, we demonstrate the broad applications of CSEA on pathway discovery from gene expression and single-cell transcriptomic data sets for genetic perturbations and change of cell states, which complements the current modalities. The R modules for uniConSig analysis and CSEA are available through https://github.com/wangxlab/uniConSig.",
                "authors": [
                    {
                        "name": "Anurag M."
                    },
                    {
                        "name": "Chi X."
                    },
                    {
                        "name": "Hall P."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Patil S."
                    },
                    {
                        "name": "Sartor M.A."
                    },
                    {
                        "name": "Wang X.-S."
                    },
                    {
                        "name": "Wexler M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Universal concept signature analysis: genome-wide quantification of new biological and pathological functions of genes and pathways"
            },
            "pmid": "31631213"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
