{
    "additionDate": "2020-01-14T19:49:58Z",
    "biotoolsCURIE": "biotools:CryoFLARE",
    "biotoolsID": "CryoFLARE",
    "confidence_flag": "tool",
    "description": "Live analysis and reconstruction of single-particle cryo-electron microscopy data with CryoFLARE.\n\nCryoFLARE: FMI Live Analysis and Reconstruction Engine for single particle Cryo EM data.\n\nThe FMI Live Analysis and Reconstruction Engine.\n\nLive analysis of Cryo EM data made easy.\n\nImport data from EPU or SerialEM",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "http://www.cryoflare.org/download-and-installation/cryoflare-scripting-bridge/"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.cryoflare.org/documentation/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                },
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://www.cryoflare.org",
    "language": [
        "Shell",
        "C++"
    ],
    "lastUpdate": "2020-12-17T09:13:38Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://www.github.com/fmi-basel/faim-cryoflare"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/fmi-basel/faim-cryoflare/issues"
        }
    ],
    "name": "CryoFLARE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/861740"
        },
        {
            "doi": "10.1021/acs.jcim.9b01102",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Efficient, reproducible and accountable single-particle cryo-electron microscopy structure determination is tedious and often impeded by the lack of a standardized procedure for data analysis and processing. To address this issue, we have developed the FMI Live Analysis and Reconstruction Engine (CryoFLARE). CryoFLARE is a modular open-source platform offering easy integration of new processing algorithms developed by the cryo-EM community. It provides a user-friendly interface that allows fast setup of standardized workflows, serving the need of pharmaceutical industry and academia alike who need to optimize throughput of their microscope. To consistently document how data is processed, CryoFLARE contains an integrated reporting facility to create reports. Live analysis and processing parallel to data acquisition are used to monitor and optimize data quality. Problems at the level of the sample preparation (heterogeneity, ice thickness, sparse particles, areas selected for acquisition, etc.) or misalignments of the microscope optics can quickly be detected and rectified before data collection is continued. Interfacing with automated data collection software for retrieval of acquisition metadata reduces user input needed for analysis, and with it minimizes potential sources of errors and workflow inconsistencies. Local and remote export support in Relion-compatible job and data format allows seamless integration into the refinement process. The support for nonlinear workflows and fine-grained scheduling for mixed workflows with separate CPU and GPU based calculation steps ensures optimal use of processing hardware. CryoFLARE's flexibility allows it to be used for all types of image acquisitions, ranging from sample screening to high-resolution data collection, and it offers a new alternative for setting up image processing workflows. It can be used without modifications of the hardware/software delivered by the microscope supplier. As it runs on a server in parallel to the hardware used for acquisition, it can easily be set up for remote display connections and fast control of the acquisition status.",
                "authors": [
                    {
                        "name": "Schenk A.D."
                    },
                    {
                        "name": "Cavadini S."
                    },
                    {
                        "name": "Thoma N.H."
                    },
                    {
                        "name": "Genoud C."
                    }
                ],
                "citationCount": 4,
                "date": "2020-05-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Live Analysis and Reconstruction of Single-Particle Cryo-Electron Microscopy Data with CryoFLARE"
            },
            "pmid": "32233514"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}