{
    "additionDate": "2021-01-18T08:46:58Z",
    "biotoolsCURIE": "biotools:crnt4sbml",
    "biotoolsID": "crnt4sbml",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Vladislav.Petyuk@pnnl.gov",
            "name": "Vladislav A Petyuk",
            "typeEntity": "Person"
        }
    ],
    "description": "CRNT4SBML is a Python package for the detection of bistability in biochemical reaction networks.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://crnt4sbml.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PNNL-Comp-Mass-Spec/CRNT4SBML",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-18T15:57:37Z",
    "license": "Apache-2.0",
    "name": "CRNT4SBML",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA241",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Signaling pathways capable of switching between two states are ubiquitous within living organisms. They provide the cells with the means to produce reversible or irreversible decisions. Switch-like behavior of biological systems is realized through biochemical reaction networks capable of having two or more distinct steady states, which are dependent on initial conditions. Investigation of whether a certain signaling pathway can confer bistability involves a substantial amount of hypothesis testing. The cost of direct experimental testing can be prohibitive. Therefore, constraining the hypothesis space is highly beneficial. One such methodology is based on chemical reaction network theory (CRNT), which uses computational techniques to rule out pathways that are not capable of bistability regardless of kinetic constant values and molecule concentrations. Although useful, these methods are complicated from both pure and computational mathematics perspectives. Thus, their adoption is very limited amongst biologists. Results: We brought CRNT approaches closer to experimental biologists by automating all the necessary steps in CRNT4SMBL. The input is based on systems biology markup language (SBML) format, which is the community standard for biological pathway communication. The tool parses SBML and derives C-graph representations of the biological pathway with mass action kinetics. Next steps involve an efficient search for potential saddle-node bifurcation points using an optimization technique. This type of bifurcation is important as it has the potential of acting as a switching point between two steady states. Finally, if any bifurcation points are present, continuation analysis with respect to a user-defined parameter extends the steady state branches and generates a bifurcation diagram. Presence of an S-shaped bifurcation diagram indicates that the pathway acts as a bistable switch for the given optimization parameters.",
                "authors": [
                    {
                        "name": "Otero-Muras I."
                    },
                    {
                        "name": "Petyuk V.A."
                    },
                    {
                        "name": "Reyes B.C."
                    },
                    {
                        "name": "Shuen M.T."
                    },
                    {
                        "name": "Tartakovsky A.M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CRNT4SBML: A Python package for the detection of bistability in biochemical reaction networks"
            },
            "pmid": "32289149"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
