{
    "additionDate": "2021-01-18T11:18:03Z",
    "biotoolsCURIE": "biotools:soluphred",
    "biotoolsID": "soluphred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "salvador.ventura@uab.cat",
            "name": "Valentín Iglesias",
            "typeEntity": "Person"
        },
        {
            "email": "valentin.iglesias@uab.cat",
            "name": "Salvador Ventura",
            "typeEntity": "Person"
        }
    ],
    "description": "A Server to Predict the pH-dependent Aggregation of Intrinsically Disordered Proteins.\n\npH-dependent solubility predictor.\n\nSolupHred is the first phenomenological predictor that considers protein environment pH when calculating aggregation propensity of Intrinsically Disordered Proteins (IDPs).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein solubility prediction",
                    "uri": "http://edamontology.org/operation_0409"
                },
                {
                    "term": "Protein pKa calculation",
                    "uri": "http://edamontology.org/operation_0400"
                }
            ]
        }
    ],
    "homepage": "https://ppmclab.pythonanywhere.com/SolupHred",
    "lastUpdate": "2021-02-20T09:34:37Z",
    "name": "SolupHred",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA909",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.SUMMARY: Polypeptides are exposed to changing environmental conditions that modulate their intrinsic aggregation propensities. Intrinsically disordered proteins (IDPs) constitutively expose their aggregation determinants to the solvent, thus being especially sensitive to its fluctuations. However, solvent conditions are often disregarded in computational aggregation predictors. We recently developed a phenomenological model to predict IDPs' solubility as a function of the solution pH, which is based on the assumption that both protein lipophilicity and charge depend on this parameter. The model anticipated solubility changes in different IDPs accurately. In this application note, we present SolupHred, a web-based interface that implements the aforementioned theoretical framework into a predictive tool able to compute IDPs aggregation propensities as a function of pH. SolupHred is the first dedicated software for the prediction of pH-dependent protein aggregation. AVAILABILITY AND IMPLEMENTATION: The SolupHred web server is freely available for academic users at: https://ppmclab.pythonanywhere.com/SolupHred. It is platform-independent and does not require previous registration. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Pintado C."
                    },
                    {
                        "name": "Santos J."
                    },
                    {
                        "name": "Iglesias V."
                    },
                    {
                        "name": "Ventura S."
                    }
                ],
                "date": "2021-07-12T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "SolupHred: a server to predict the pH-dependent aggregation of intrinsically disordered proteins"
            },
            "pmid": "33098409"
        }
    ],
    "topic": [
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ]
}