{
    "additionDate": "2019-11-14T19:41:03Z",
    "biotoolsCURIE": "biotools:VAP_autogenerated",
    "biotoolsID": "VAP_autogenerated",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "amodupe@udel.edu",
            "name": "Modupeore O. Adetunji",
            "orcidid": "https://orcid.org/0000-0001-8870-1052",
            "typeEntity": "Person"
        }
    ],
    "description": "> NAME EQUAL TO (PUB. DIFFERENT) bio.tools/vap | Variant analysis pipeline for accurate detection of genomic variants from transcriptome sequencing data | VAP : For Reference mapping and Variant detection | Thank you for your interest in using the Variant Analysis Pipeline. VAP is a comprehensive workflow for reference mapping and variant detection of genomic and transcriptomic reads using a suite of bioinformatics tools",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://modupeore.github.io/VAP/",
    "lastUpdate": "2019-11-14T19:41:03Z",
    "name": "VAP_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0216838",
            "metadata": {
                "abstract": "© 2019 Adetunji et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The wealth of information deliverable from transcriptome sequencing (RNA-seq) is significant, however current applications for variant detection still remain a challenge due to the complexity of the transcriptome. Given the ability of RNA-seq to reveal active regions of the genome, detection of RNA-seq SNPs can prove valuable in understanding the phenotypic diversity between populations. Thus, we present a novel computational workflow named VAP (Variant Analysis Pipeline) that takes advantage of multiple RNA-seq splice aware aligners to call SNPs in non-human models using RNA-seq data only. We applied VAP to RNA-seq from a highly inbred chicken line and achieved high accuracy when compared with the matching whole genome sequencing (WGS) data. Over 65% of WGS coding variants were identified from RNA-seq. Further, our results discovered SNPs resulting from post transcriptional modifications, such as RNA editing, which may reveal potentially functional variation that would have otherwise been missed in genomic data. Even with the limitation in detecting variants in expressed regions only, our method proves to be a reliable alternative for SNP identification using RNA-seq data. The source code and user manuals are available at https://modupeore.github.io/VAP/.",
                "authors": [
                    {
                        "name": "Adetunji M.O."
                    },
                    {
                        "name": "Lamont S.J."
                    },
                    {
                        "name": "Abasht B."
                    },
                    {
                        "name": "Schmidt C.J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Variant analysis pipeline for accurate detection of genomic variants from transcriptome sequencing data"
            },
            "pmcid": "PMC6756534",
            "pmid": "31545812"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}