{
    "additionDate": "2019-11-14T18:35:36Z",
    "biotoolsCURIE": "biotools:YAPP",
    "biotoolsID": "YAPP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sgutierr@udec.cl",
            "name": "Soraya Gutiérrez",
            "orcidid": "https://orcid.org/0000-0003-1086-3726",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of a novel long non-coding RNA within RUNX1 intron 5 | This site uses cookies. By continuing to browse the site you are agreeing to our use of cookies. Find out more here . {{alert.msg}}",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "cis-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0441"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.org/yapp/cgi-bin/yapp.cgi",
    "lastUpdate": "2021-01-07T18:07:09Z",
    "name": "YAPP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S40246-019-0219-1",
            "metadata": {
                "abstract": "BACKGROUND: RUNX1 gene, a master regulator of the hematopoietic process, participates in pathological conditions as a partner for several genes in chromosomal translocations. One of the most frequent chromosomal translocations found in acute myeloid leukemia patients is the t(8;21), in which RUNX1 and ETO genes recombine. In RUNX1 gene, the DNA double-strand breaks that originate the t(8;21) are generated in the intron 5, specifically within three regions designated as BCR1, BCR2, and BCR3. To date, what determines that these regions are more susceptible to DNA double-strand breaks is not completely clear. In this report, we characterized RUNX1 intron 5, by analyzing DNase-seq and ChIP-seq data, available in the ENCODE Project server, to evaluate DNaseI hypersensitivity and the presence of the epigenetic mark H3K4me3 in 124 and 51 cell types, respectively. RESULTS: Our results show that intron 5 exhibits an epigenetic mark distribution similar to known promoter regions. Moreover, using the online tool YAPP and available CAGE data from the ENCODE Project server, we identified several putative transcription start sites within intron 5 in regions BCR2 and BCR3. Finally, available EST data was analyzed, identifying a novel uncharacterized long non-coding RNA, which is expressed in hematopoietic cell lines as shown by RT-PCR. Our data suggests that the core promoter of the novel long non-coding RNA locates within the region BCR3. CONCLUSION: We identified a novel long non-coding RNA within RUNX1 intron 5, transcribed from a promoter located in the region BCR3, one of the chromosomal breakpoints of RUNX1 gene.",
                "authors": [
                    {
                        "name": "Gutierrez S."
                    },
                    {
                        "name": "Hinojosa M."
                    },
                    {
                        "name": "Schnake N."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-31T00:00:00Z",
                "journal": "Human genomics",
                "title": "Identification of a novel long non-coding RNA within RUNX1 intron 5"
            },
            "pmcid": "PMC6670153",
            "pmid": "31366376"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
