{
    "additionDate": "2017-08-03T19:07:40Z",
    "biotoolsCURIE": "biotools:pgenn",
    "biotoolsID": "pgenn",
    "credit": [
        {
            "name": "BioNLP and Text Mining Lab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biotm.cis.udel.edu/biotm/contact.php"
        }
    ],
    "description": "System specifically designed for plant gene normalization. This website enables user search gene normalization information by keywords, a list of PMIDs, or UniProt ACs in the database. The results (Gene names and corresponding UniProt ACs) are displayed in sortable tables with text evidence and downloadable for further research.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://biotm.cis.udel.edu/gn/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://biotm.cis.udel.edu/gn/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pgenn-gene-normalization-tool-for-plant-genes-and-proteins-in-scientific-literature.html"
        }
    ],
    "name": "pGenN",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Ding et al.Background: Automatically detecting gene/protein names in the literature and connecting them to databases records, also known as gene normalization, provides a means to structure the information buried in free-text literature. Gene normalization is critical for improving the coverage of annotation in the databases, and is an essential component of many text mining systems and database curation pipelines. Methods: In this manuscript, we describe a gene normalization system specifically tailored for plant species, called pGenN (pivot-based Gene Normalization). The system consists of three steps: dictionary-based gene mention detection, species assignment, and intra species normalization. We have developed new heuristics to improve each of these phases. Results: We evaluated the performance of pGenN on an in-house expertly annotated corpus consisting of 104 plant relevant abstracts. Our system achieved an F-value of 88.9% (Precision 90.9% and Recall 87.2%) on this corpus, outperforming state-of-art systems presented in BioCreative III. We have processed over 440,000 plant-related Medline abstracts using pGenN. The gene normalization results are stored in a local database for direct query from the pGenN web interface (proteininformationresource.org/pgenn/). The annotated literature corpus is also publicly available through the PIR text mining portal (proteininformationresource.org/iprolink/). Copyright:",
                "authors": [
                    {
                        "name": "Ding R."
                    },
                    {
                        "name": "Arighi C.N."
                    },
                    {
                        "name": "Lee J.-Y."
                    },
                    {
                        "name": "Wu C.H."
                    },
                    {
                        "name": "Vijay-Shanker K."
                    }
                ],
                "citationCount": 9,
                "date": "2015-08-10T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "pGenN, a gene normalization tool for plant genes and proteins in scientific literature"
            },
            "pmid": "26258475"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}