{"credit":[],"function":[{"operation":[{"term":"Sequence trimming","uri":"http://edamontology.org/operation_3192"},{"term":"Filtering","uri":"http://edamontology.org/operation_3695"}]}],"labels":{"language":["MATLAB"],"license":"GPL-3.0","topic":[{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Literature and language","uri":"http://edamontology.org/topic_3068"}]},"publication":[{"abstract":"© 2019 Elsevier LtdBackground: Automated fetal heart rate (FHR) analysis removes inter- and intra-expert variability, and is a promising solution for reducing the occurrence of fetal acidosis and the implementation of unnecessary medical procedures. The first steps in automated FHR analysis are determination of the baseline, and detection of accelerations and decelerations (A/D). We describe a new method in which a weighted median filter baseline (WMFB) is computed and A/Ds are then detected. Method: The filter weightings are based on the prior probability that the sampled FHR is in the baseline state or in an A/D state. This probability is computed by estimating the signal's stability at low frequencies and by progressively trimming the signal. Using a competition dataset of 90 previously annotated FHR recordings, we evaluated the WMFB method and 11 recently published literature methods against the ground truth of an expert consensus. The level of agreement between the WMFB method and the expert consensus was estimated by calculating several indices (primarily the morphological analysis discordance index, MADI). The agreement indices were then compared with the values for eleven other methods. We also compared the level of method-expert agreement with the level of interrater agreement. Results: For the WMFB method, the MADI indicated a disagreement of 4.02% vs. the consensus; this value is significantly lower (p<10−13) than that calculated for the best of the 11 literature methods (7.27%, for Lu and Wei's empirical mode decomposition method). The level of inter-expert agreement (according to the MADI) and the level of WMFB-expert agreement did not differ significantly (p=0.22). Conclusion: The WMFB method reproduced the expert consensus analysis better than 11 other methods. No differences in performance between the WMFB method and individual experts were observed. The method Matlab source code is available under General Public Licence at http://utsb.univ-catholille.fr/fhr-wmfb.","authors":["Boudet S.","Houze de l'Aulnoit A.","Demailly R.","Peyrodie L.","Beuscart R.","Houze de l'Aulnoit D."],"cit_count":0,"doi":"10.1016/J.COMPBIOMED.2019.103468","journal":"Computers in Biology and Medicine","pmid":"31577964","title":"Fetal heart rate baseline computation with a weighted median filter","year":"2019-11-01"}],"summary":{"biotoolsCURIE":"biotools:WMFB","biotoolsID":"WMFB","description":"Fetal heart rate baseline computation with a weighted median filter.\n\nLive review of baseline FHR methods.\n\nFrom Live review of baseline FHR methods.\n\nand hayden is their best chance It'Doug Ford s holistic Conservatives succeed in part In Ontari a good thing Jones bounced back with a good performance after a poor outing against Denver in Week 3 (eight catches for 118 yards and a TD on nine targets).\n\nGabriel apparently is never around in most episodes and he he knows about the Miraculouses as shown in the episode Volpina where he has an entire book on the Miraculous and the Heroes/Villains that wield them as well as in the episode Simon Says where he finds an interest in both Cat Noire and Ladybug Miraculouses and even notices Adriens Ring {which in reality is actually his miraculous disguised in it ordinary inflatable form of art glides in keeping with s f phoenix s without his Kwami Plagg in it.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'FHR'","homepage":"http://utsb.univ-catholille.fr/fhr-wmfb","name":"WMFB"}}