{
    "additionDate": "2022-03-28T10:19:57.673187Z",
    "biotoolsCURIE": "biotools:autofair",
    "biotoolsID": "autofair",
    "confidence_flag": "tool",
    "description": "AutoFAIR is portal for automating FAIR assessments for bioinformatics resources. AutoFAIR a semi-automated tool to assess a resource according to the Findability, Accessibility, Interoperability and Reusability (FAIR) criteria. The aim is to create a portal that presents the assessment score together with a report that researchers can use to gauge a resource.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://autofair.research.um.edu.mt/portal/home/",
    "lastUpdate": "2022-03-28T10:19:57.675824Z",
    "name": "AutoFAIR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.BBAGRM.2021.194767",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Background: Research in Bioinformatics generates tools and datasets in Bioinformatics at a very fast rate. Meanwhile, a lot of effort is going into making these resources findable and reusable to improve resource discovery by researchers in the course of their work. Purpose: This paper proposes a semi-automated tool to assess a resource according to the Findability, Accessibility, Interoperability and Reusability (FAIR) criteria. The aim is to create a portal that presents the assessment score together with a report that researchers can use to gauge a resource. Method: Our system uses internet searches to automate the process of generating FAIR scores. The process is semi-automated in that if a particular property of the FAIR scores has not been captured by AutoFAIR, a user is able to amend and supply the information to complete the assessment. Results: We compare our results against FAIRshake that was used as the benchmark tool for comparing the assessments. The results show that AutoFAIR was able to match the FAIR criteria in FAIRshake with minimal intervention from the user. Conclusions: We show that AutoFAIR can be a good repository for storing metadata about tools and datasets, together with comprehensive reports detailing the assessments of the resources. Moreover, AutoFAIR is also able to score workflows, giving an overall indication of the FAIRness of the resources used in a scientific study.",
                "authors": [
                    {
                        "name": "Alfino N."
                    },
                    {
                        "name": "Bonello J."
                    },
                    {
                        "name": "Cachia E."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - Gene Regulatory Mechanisms",
                "title": "AutoFAIR-A portal for automating FAIR assessments for bioinformatics resources"
            },
            "pmid": "34749004"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
