
{
    "credit": [
        {
            "email": "enquiry@bii.a-star.edu.sg",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.bii.a-star.edu.sg/"
        }
    ],
    "documentation": [
        {
            "url": "http://mendel.bii.a-star.edu.sg/METHODS/hufzinc/hufzinc_help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structural motif recognition",
                    "uri": "http://edamontology.org/operation_0245"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web service"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/huf-zinc-hmm-based-u-shape-motif-finder-for-zinc-binding.html"
        }
    ],
    "publication": [
        {
            "abstract": "Data mining in protein databases, derivatives from more fundamental protein 3D structure and sequence databases, has considerable unearthed potential for the discovery of sequence motif-structural motif-function relationships as the finding of the U-shape (Huf-Zinc) motif, originally a small student's project, exemplifies. The metal ion zinc is critically involved in universal biological processes, ranging from protein-DNA complexes and transcription regulation to enzymatic catalysis and metabolic pathways. Proteins have evolved a series of motifs to specifically recognize and bind zinc ions. Many of these, so called zinc fingers, are structurally independent globular domains with discontinuous binding motifs made up of residues mostly far apart in sequence. Through a systematic approach starting from the BRIX structure fragment database, we discovered that there exists another predictable subset of zinc-binding motifs that not only have a conserved continuous sequence pattern but also share a characteristic local conformation, despite being included in totally different overall folds. While this does not allow general prediction of all Zn binding motifs, a HMM-based web server, Huf-Zinc, is available for prediction of these novel, as well as conventional, zinc finger motifs in protein sequences. The Huf-Zinc webserver can be freely accessed through this URL (). © 2013 Imperial College Press.",
            "authors": [
                "Maurer-Stroh S.",
                "Gao H.",
                "Han H.",
                "Baeten L.",
                "Schymkowitz J.",
                "Rousseau F.",
                "Zhang L.",
                "Eisenhaber F."
            ],
            "cit_count": 3,
            "journal": "Journal of Bioinformatics and Computational Biology",
            "pmid": "23427990",
            "title": "Motif discovery with data mining in 3D protein structure databases: Discovery, validation and prediction of the u-shape zinc binding (\\HUF-ZINC) motif",
            "year": "2013-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:huf-zinc",
        "biotoolsID": "huf-zinc",
        "description": "HMM-based web server for prediction of the novel, as well as conventional, zinc finger motifs in protein sequences.",
        "homepage": "http://mendel.bii.a-star.edu.sg/METHODS/hufzinc/",
        "name": "HUF-ZINC"
    }
}