{
    "additionDate": "2017-12-18T00:15:42Z",
    "biotoolsCURIE": "biotools:survgenesinterim",
    "biotoolsID": "survgenesinterim",
    "credit": [
        {
            "email": "Klaus.Jung@ams.med.uni-goettingen.de",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ams.med.uni-goettingen.de/index-en.shtml"
        }
    ],
    "description": "survGenesInterim is an R package for simulation of survival studies based on simulated gene expression level and patient data. Includes functions to generate such data. Resulting error and power rate can be visualized.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://r-forge.r-project.org/projects/survgenesinter/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.ams.med.uni-goettingen.de/software-en.shtml",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/survgenesinterim-1-0-simulation-of-survival-studies-with-microarray-data.html"
        }
    ],
    "name": "survGenesInterim",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-127",
            "metadata": {
                "abstract": "Background: Discovery of biomarkers that are correlated with therapy response and thus with survival is an important goal of medical research on severe diseases, e.g. cancer. Frequently, microarray studies are performed to identify genes of which the expression levels in pretherapeutic tissue samples are correlated to survival times of patients. Typically, such a study can take several years until the full planned sample size is available.Therefore, interim analyses are desirable, offering the possibility of stopping the study earlier, or of performing additional laboratory experiments to validate the role of the detected genes. While many methods correcting the multiple testing bias introduced by interim analyses have been proposed for studies of one single feature, there are still open questions about interim analyses of multiple features, particularly of high-dimensional microarray data, where the number of features clearly exceeds the number of samples. Therefore, we examine false discovery rates and power rates in microarray experiments performed during interim analyses of survival studies. In addition, the early stopping based on interim results of such studies is evaluated. As stop criterion we employ the achieved average power rate, i.e. the proportion of detected true positives, for which a new estimator is derived and compared to existing estimators.Results: In a simulation study, pre-specified levels of the false discovery rate are maintained in each interim analysis, where reduced levels as used in classical group sequential designs of one single feature are not necessary. Average power rates increase with each interim analysis, and many studies can be stopped prior to their planned end when a certain pre-specified power rate is achieved. The new estimator for the power rate slightly deviates from the true power rate but is comparable to other estimators.Conclusions: Interim analyses of microarray experiments can provide evidence for early stopping of long-term survival studies. The developed simulation framework, which we also offer as a new R package 'SurvGenesInterim' available at http://survgenesinter.R-Forge.R-Project.org, can be used for sample size planning of the evaluated study design. © 2011 Leha et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Beissbarth T."
                    },
                    {
                        "name": "Jung K."
                    },
                    {
                        "name": "Leha A."
                    }
                ],
                "citationCount": 4,
                "date": "2011-04-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Sequential interim analyses of survival data in DNA microarray experiments"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
