{
    "accessibility": "Open access",
    "additionDate": "2019-05-26T06:56:27Z",
    "biotoolsCURIE": "biotools:Cropper",
    "biotoolsID": "Cropper",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "toomas.haller@ut.ee",
            "name": "T. Haller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GUI application for viewing and handling Manhattan Plots. The user can zoom, select and crop Manhattan Plots and generate output both in the graphical and numerical format.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "https://www.geenivaramu.ee/en/tools/cropper",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Cropper",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2600-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Selection of interesting regions from genome wide association studies (GWAS) is typically performed by eyeballing of Manhattan Plots. This is no longer possible with thousands of different phenotypes. There is a need for tools that can automatically detect genomic regions that correspond to what the experienced researcher perceives as peaks worthwhile of further study. Results: We developed Manhattan Harvester, a tool designed for \"peak extraction\" from GWAS summary files and computation of parameters characterizing various aspects of individual peaks. We present the algorithms used and a model for creating a general quality score that evaluates peaks similarly to that of a human researcher. Our tool Cropper utilizes a graphical interface for inspecting, cropping and subsetting Manhattan Plot regions. Cropper is used to validate and visualize the regions detected by Manhattan Harvester. Conclusions: We conclude that our tools fill the current void in automatically screening large number of GWAS output files in batch mode. The interesting regions are detected and quantified by various parameters by Manhattan Harvester. Cropper offers graphical tools for in-depth inspection of the regions. The tools are open source and freely available.",
                "authors": [
                    {
                        "name": "Haller T."
                    },
                    {
                        "name": "Metspalu A."
                    },
                    {
                        "name": "Tasa T."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Manhattan Harvester and Cropper: A system for GWAS peak detection"
            },
            "pmcid": "PMC6330393",
            "pmid": "30634901",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}
