
{
    "credit": [
        {
            "email": "mabrouk@iro.umontreal.ca",
            "name": "Nadia El-Mabrouk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://udem-lbit.github.io/CoreTracker/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage analysis",
                    "uri": "http://edamontology.org/operation_0286"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author (2017). Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com Motivation: Codon reassignments have been reported across all domains of life. With the increasing number of sequenced genomes, the development of systematic approaches for genetic code detection is essential for accurate downstream analyses. Three automated prediction tools exist so far: FACIL, GenDecoder and Bagheera; the last two respectively restricted to metazoan mitochondrial genomes and CUG reassignments in yeast nuclear genomes. These tools can only analyze a single genome at a time and are often not followed by a validation procedure, resulting in a high rate of false positives. Results: We present CoreTracker, a new algorithm for the inference of sense-to-sense codon reassignments. CoreTracker identifies potential codon reassignments in a set of related genomes, then uses statistical evaluations and a random forest classifier to predict those that are the most likely to be correct. Predicted reassignments are then validated through a phylogeny-aware step that evaluates the impact of the new genetic code on the protein alignment. Handling simultaneously a set of genomes in a phylogenetic framework, allows tracing back the evolution of each reassignment, which provides information on its underlying mechanism. Applied to metazoan and yeast genomes, CoreTracker significantly outperforms existing methods on both precision and sensitivity. Availability and implementation: CoreTracker is written in Python and available at https://github.com/UdeM-LBIT/CoreTracker. Contact: mabrouk@iro.umontreal.ca. Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Noutahi E.",
                "Calderon V.",
                "Blanchette M.",
                "Lang F.B.",
                "El-Mabrouk N."
            ],
            "cit_count": 2,
            "doi": "10.1093/bioinformatics/btx421",
            "journal": "Bioinformatics (Oxford, England)",
            "title": "CoreTracker: accurate codon reassignment prediction, applied to mitochondrial genomes",
            "year": "2017-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:coretracker",
        "biotoolsID": "coretracker",
        "description": "Accurate codon reassignment prediction, applied to mitochondrial genomes.",
        "homepage": "https://github.com/UdeM-LBIT/CoreTracker",
        "name": "CoreTracker"
    }
}