{
    "additionDate": "2017-08-03T18:43:37Z",
    "biotoolsCURIE": "biotools:focus-point",
    "biotoolsID": "focus-point",
    "credit": [
        {
            "email": "dominic.waithe@imm.ox.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Utilise advanced time-correlated single-photon counting (TCSPC) correlation algorithms along with time-gated filtering and innovative data visualisation.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/dwaithe/FCS_point_correlator/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Correlation",
                    "uri": "http://edamontology.org/operation_3465"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://dwaithe.github.io/FCS_point_correlator/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/focus-point-python-tcspc-fcs-data-visualiser.html"
        }
    ],
    "name": "FoCuS-point",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. Motivation: Fluorescence Correlation Spectroscopy (FCS) is a popular tool for measuring molecular mobility and how mobility relates to molecular interaction dynamics and bioactivity in living cells. The FCS technique has been significantly advanced by its combination with super-resolution STED microscopy (STED-FCS). Specifically, the use of gated detection has shown great potential for enhancing STED-FCS, but has also created a demand for software which is efficient and also implements the latest algorithms. Prior to this study, no open software has been available which would allow practical time-gating and correlation of point data derived from STED-FCS experiments. Results: The product of this study is a piece of stand-alone software called FoCuS-point. FoCuS-point utilizes advanced time-correlated single-photon counting (TCSPC) correlation algorithms along with time-gated filtering and innovative data visualization. The software has been designed to be highly user-friendly and is tailored to handle batches of data with tools designed to process files in bulk. FoCuS-point also includes advanced fitting algorithms which allow the parameters of the correlation curves and thus the kinetics of diffusion to be established quickly and efficiently. Availability and implementation: FoCuS-point is written in python and is available through the github repository: https://github.com/dwaithe/FCS-point-correlator. Furthermore, compiled versions of the code are available as executables which can be run directly in Linux, Windows and Mac OSX operating systems. Contact:",
                "authors": [
                    {
                        "name": "Waithe D."
                    },
                    {
                        "name": "Clausen M.P."
                    },
                    {
                        "name": "Sezgin E."
                    },
                    {
                        "name": "Eggeling C."
                    }
                ],
                "citationCount": 12,
                "date": "2015-09-11T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FoCuS-point: Software for STED fluorescence correlation and time-gated single photon counting"
            },
            "pmid": "26589275"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}