{
    "name": "SECISearch3  Seblastian", 
    "description": "In this web server we provide public access for two new computational methods for selenoprotein identification and analysis. This tool replaces its predecessor SECISearch as a tool for prediction of eukaryotic SECIS elements and becomes a new method for selenoprotein gene detection that predicts selenoprotein sequences encoded upstream of SECIS elements. It is able to both identify known selenoproteins and predict new selenoproteins.", 
    "homepage": "http://seblastian.crg.es/", 
    "biotoolsID": "secisearch3_seblastian", 
    "biotoolsCURIE": "biotools:secisearch3_seblastian", 
    "version": [
        "1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0362", 
                    "term": "Genome annotation"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2977", 
                        "term": "Nucleic acid sequence"
                    }, 
                    "format": []
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_1255", 
                        "term": "Sequence features"
                    }, 
                    "format": []
                }
            ], 
            "note": "Selenoproteins are proteins containing an uncommon amino acid selenocysteine (Sec). Sec is inserted by a specific translational machinery that recognizes a stem-loop structure, the SECIS element, at the 3' UTR of selenoprotein genes and recodes a UGA codon within the coding sequence. As UGA is normally a translational stop signal, selenoproteins are generally misannotated and designated tools have to be developed for this class of proteins. In this webserver (go to http://seblastian.crg.es) we provide public access to two new computational methods for selenoprotein identification and analysis: SECISearch3 replaces its predecessor SECISearch as a tool for prediction of eukaryotic SECIS elements. Seblastian is a new method for selenoprotein gene detection that uses SECISearch3 and then predicts selenoprotein sequences encoded upstream of SECIS elements. Seblastian is able to both identify known selenoproteins and predict new selenoproteins.", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3307", 
            "term": "Computational biology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": "GPL-3.0", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://big.crg.cat/services/secisearch3seblastian", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/nar/gkt550", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "SECISearch3 and Seblastian: New tools for prediction of SECIS elements and selenoproteins", 
                "abstract": "Selenoproteins are proteins containing an uncommon amino acid selenocysteine (Sec). Sec is inserted by a specific translational machinery that recognizes a stem-loop structure, the SECIS element, at the 30 UTR of selenoprotein genes and recodes a UGA codon within the coding sequence. As UGA is normally a translational stop signal, selenoproteins are generally misannotated and designated tools have to be developed for this class of proteins. Here, we present two new computational methods for selenoprotein identification and analysis, which we provide publicly through the web servers at http://gladyshevlab.org/ SelenoproteinPredictionServer or http://seblastian. crg.es. SECISearch3 replaces its predecessor SECISearch as a tool for prediction of eukaryotic SECIS elements. Seblastian is a new method for selenoprotein gene detection that uses SECISearch3 and then predicts selenoprotein sequences encoded upstream of SECIS elements. Seblastian is able to both identify known selenoproteins and predict new selenoproteins. By applying these tools to diverse eukaryotic genomes, we provide a ranked list of newly predicted selenoproteins together with their annotated cysteine-containing homologues. An analysis of a representative candidate belonging to the AhpC family shows how the use of Sec in this protein evolved in bacterial and eukaryotic lineages.", 
                "date": "2013-08-01T00:00:00Z", 
                "citationCount": 38, 
                "authors": [
                    {
                        "name": "Mariotti M."
                    }, 
                    {
                        "name": "Lobanov A.V."
                    }, 
                    {
                        "name": "Guigo R."
                    }, 
                    {
                        "name": "Gladyshev V.N."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Marco Mariotti", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Didac Santesmasses", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": null, 
            "typeRole": [
                "Contributor"
            ], 
            "note": null
        }, 
        {
            "name": "Lab Roderic Guigo Group", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "crg.eu", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Didac Santesmasses & Marco Mariotti", 
            "email": "didac.santesmasses@crg.eu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "francisco.camara@crg.eu", 
    "additionDate": "2016-04-22T13:44:52Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}