{
    "additionDate": "2019-11-14T19:42:57Z",
    "biotoolsCURIE": "biotools:FlowSculpt",
    "biotoolsID": "FlowSculpt",
    "confidence_flag": "tool",
    "description": "Flowsculpt is an open-source utility for solving the inverse problem in pillar programming. That is, given a fluid flow shape, what is the pillar sequence and inlet design that will produce such a shape? Our utility uses a customizable genetic algorithm to determine optimal pillar sequence and inlet flow design for a given fluid flow shape.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.flowsculpt.org",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2020-12-29T09:48:56Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/baskargroup/flowsculptga/"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://bitbucket.org/baskargroup/flowsculptga/issues"
        }
    ],
    "name": "FlowSculpt",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1039/C9LC00658C",
            "metadata": {
                "abstract": "© 2019 The Royal Society of Chemistry.Flow sculpting is a powerful method for passive flow control that uses a sequence of bluff-body structures to engineer the structure of inertially flowing microfluidic streams. A variety of cross-sectional flow shapes can be created through this method, offering a new platform for flow manipulation or material fabrication useful in bioengineering, manufacturing, and chemistry applications. However, the inverse problem in flow sculpting-designing a device that produces a target fluid flow shape-remains challenging due to the complex, diverse, and enormous design space. Solutions to the inverse problem have been constrained to single-material fluid streams that are shaped into top-bottom symmetric shapes due to the bluff-body structures available in current libraries (pillars) that span the height of the channel. In this work, we introduce multi-material design and symmetry-breaking flow deformations enabled by half-height pillars, presented within an extremely fast simulation method for flow sculpting yielding a 34-fold reduction in runtime. The framework is deployed freely as a cross-platform application called \"FlowSculpt\". We detail its implementation and usage, and discuss the addition of enhanced search operations, which enable users to more easily design flow shapes that replicate their input drawings. With FlowSculpt, the microfluidics community can now quickly design flow shaping microfluidic devices on modest hardware, and easily integrate these complex physics into their research toolkit.",
                "authors": [
                    {
                        "name": "Stoecklein D."
                    },
                    {
                        "name": "Davies M."
                    },
                    {
                        "name": "De Rutte J.M."
                    },
                    {
                        "name": "Wu C.-Y."
                    },
                    {
                        "name": "Di Carlo D."
                    },
                    {
                        "name": "Ganapathysubramanian B."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-07T00:00:00Z",
                "journal": "Lab on a Chip",
                "title": "FlowSculpt: Software for efficient design of inertial flow sculpting devices"
            },
            "pmid": "31482902"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}