{
    "accessibility": "Open access",
    "additionDate": "2022-10-30T22:08:26.011317Z",
    "biotoolsCURIE": "biotools:snpaamapper-python",
    "biotoolsID": "snpaamapper-python",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xiaomingliu@usf.edu",
            "name": "Xiaoming Liu",
            "typeEntity": "Person"
        },
        {
            "name": "Andrew He"
        },
        {
            "name": "Chenjian Fu"
        },
        {
            "name": "Yongsheng Bai",
            "typeEntity": "Person"
        }
    ],
    "description": "A highly efficient genome-wide SNP variant analysis pipeline for Next-Generation Sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BaiLab/SNPAAMapper-Python",
    "language": [
        "Perl",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T15:24:43.307732Z",
    "license": "MIT",
    "name": "SNPAAMapper-Python",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/frai.2022.991733",
            "metadata": {
                "abstract": "Currently, there are many publicly available Next Generation Sequencing tools developed for variant annotation and classification. However, as modern sequencing technology produces more and more sequencing data, a more efficient analysis program is desired, especially for variant analysis. In this study, we updated SNPAAMapper, a variant annotation pipeline by converting perl codes to python for generating annotation output with an improved computational efficiency and updated information for broader applicability. The new pipeline written in Python can classify variants by region (Coding Sequence, Untranslated Regions, upstream, downstream, intron), predict amino acid change type (missense, nonsense, etc.), and prioritize mutation effects (e.g., synonymous > non-synonymous) while being faster and more efficient. Our new pipeline works in five steps. First, exon annotation files are generated. Next, the exon annotation files are processed, and gene mapping and feature information files are produced. Afterward, the python scrips classify the variants based on genomic regions and predict the amino acid change category. Lastly, another python script prioritizes and ranks the mutation effects of variants to output the result file. The Python version of SNPAAMapper accomplished the overall speed by running most annotation steps in a substantially shorter time. The Python script can classify variants by region in 53 s compared to 166 s for the Perl script in a test sample run on a Latitude 7480 Desktop computer with 8GB RAM and an Intel Core i5-6300 CPU @ 2.4Ghz. Steps of predicting amino acid change type and prioritizing mutation effects of variants were executed within 1 s for both pipelines. SNPAAMapper-Python was developed and tested on the ClinVar database, a NCBI database of information on genomic variation and its relationship to human health. We believe our developed Python version of SNPAAMapper variant annotation pipeline will benefit the community by elucidating the variant consequence and speed up the discovery of causative genetic variants through whole genome/exome sequencing. Source codes, test data files, instructions, and further explanations are available on the web at https://github.com/BaiLab/SNPAAMapper-Python.",
                "authors": [
                    {
                        "name": "Bai Y."
                    },
                    {
                        "name": "Fu C."
                    },
                    {
                        "name": "He A."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Ma K."
                    },
                    {
                        "name": "Xu N."
                    }
                ],
                "date": "2022-09-12T00:00:00Z",
                "journal": "Frontiers in Artificial Intelligence",
                "title": "SNPAAMapper-Python: A highly efficient genome-wide SNP variant analysis pipeline for Next-Generation Sequencing data"
            },
            "pmcid": "PMC9510352",
            "pmid": "36171799"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
