{
    "accessibility": "Open access",
    "additionDate": "2021-06-01T00:05:56Z",
    "biotoolsCURIE": "biotools:trance",
    "biotoolsID": "trance",
    "cost": "Free of charge",
    "description": "TRAnsforming Nested Collections Efficiently (TraNCE) is a compilation framework that auto- mates the difficulties of designing distributed analyses with complex, biomedical data types.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Query compilation for integrative analysis of complex biomedical datasets",
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jacmarjorie/trance",
    "lastUpdate": "2021-06-01T00:05:56Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jacmarjorie/trance"
        }
    ],
    "maturity": "Emerging",
    "name": "TraNCE",
    "owner": "jacmarjorie",
    "publication": [
        {
            "doi": "10.14778/3430915.3430933",
            "metadata": {
                "abstract": "© 2020, VLDB Endowment. All rights reserved.While large-scale distributed data processing platforms have become an attractive target for query processing, these systems are problematic for applications that deal with nested collections. Programmers are forced either to perform non-trivial translations of collection programs or to employ automated flattening procedures, both of which lead to performance problems. These challenges only worsen for nested collections with skewed cardinalities, where both handcrafted rewriting and automated flattening are unable to enforce load balancing across partitions. In this work, we propose a framework that translates a program manipulating nested collections into a set of semantically equivalent shredded queries that can be efficiently evaluated. The framework employs a combination of query compilation techniques, an efficient data representation for nested collections, and automated skew-handling. We provide an extensive experimental evaluation, demonstrating significant improvements provided by the framework in diverse scenarios for nested collection programs.",
                "authors": [
                    {
                        "name": "Benedikt M."
                    },
                    {
                        "name": "Nikolic M."
                    },
                    {
                        "name": "Shaikhha A."
                    },
                    {
                        "name": "Smith J."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Proceedings of the VLDB Endowment",
                "title": "Scalable querying of nested data"
            }
        }
    ],
    "toolType": [
        "Workflow"
    ]
}
