{
    "additionDate": "2020-01-14T09:27:19Z",
    "biotoolsCURIE": "biotools:InSTIL",
    "biotoolsID": "InSTIL",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "c.huckvale@unsw.edu.au",
            "name": "Kit Huckvale",
            "orcidid": "https://orcid.org/0000-0001-9088-6682",
            "typeEntity": "Person"
        }
    ],
    "description": "A Scalable and Governance-Aware Platform for Universal, Smartphone-Based Digital Phenotyping for Research and Clinical Applications.\n\nIn this viewpoint we describe the architecture of, and design rationale for, a new software platform designed to support the conduct of digital phenotyping research studies. These studies seek to collect passive and active sensor signals from participants' smartphones for the purposes of modelling and predicting health outcomes, with a specific focus on mental health. We also highlight features of the current research landscape that recommend the coordinated development of such platforms, including the significant technical and resource costs of development, and we identify specific considerations relevant to the design of platforms for digital phenotyping.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Intelligent Sensing Inform Learn'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31692450",
    "lastUpdate": "2020-01-14T09:27:19Z",
    "name": "InSTIL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2196/16399",
            "metadata": {
                "abstract": "© Scott Barnett, Kit Huckvale, Helen Christensen, Svetha Venkatesh, Kon Mouzakis, Rajesh Vasa.In this viewpoint we describe the architecture of, and design rationale for, a new software platform designed to support the conduct of digital phenotyping research studies. These studies seek to collect passive and active sensor signals from participants' smartphones for the purposes of modelling and predicting health outcomes, with a specific focus on mental health. We also highlight features of the current research landscape that recommend the coordinated development of such platforms, including the significant technical and resource costs of development, and we identify specific considerations relevant to the design of platforms for digital phenotyping. In addition, we describe trade-offs relating to data quality and completeness versus the experience for patients and public users who consent to their devices being used to collect data. We summarize distinctive features of the resulting platform, InSTIL (Intelligent Sensing to Inform and Learn), which includes universal (ie, cross-platform) support for both iOS and Android devices and privacy-preserving mechanisms which, by default, collect only anonymized participant data. We conclude with a discussion of recommendations for future work arising from learning during the development of the platform. The development of the InSTIL platform is a key step towards our research vision of a population-scale, international, digital phenotyping bank. With suitable adoption, the platform will aggregate signals from large numbers of participants and large numbers of research studies to support modelling and machine learning analyses focused on the prediction of mental illness onset and disease trajectories.",
                "authors": [
                    {
                        "name": "Barnett S."
                    },
                    {
                        "name": "Huckvale K."
                    },
                    {
                        "name": "Christensen H."
                    },
                    {
                        "name": "Venkatesh S."
                    },
                    {
                        "name": "Mouzakis K."
                    },
                    {
                        "name": "Vasa R."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of Medical Internet Research",
                "title": "Intelligent sensing to inform and learn (instil): A scalable and governance-aware platform for universal, smartphone-based digital phenotyping for research and clinical applications"
            },
            "pmcid": "PMC6868504",
            "pmid": "31692450"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ]
}