{
    "accessibility": "Open access",
    "additionDate": "2023-03-27T21:46:16.355186Z",
    "biotoolsCURIE": "biotools:dr-detector",
    "biotoolsID": "dr-detector",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "scjanga@iupui.edu",
            "name": "Sarath Chandra Janga",
            "orcidid": "http://orcid.org/0000-0001-7351-6268",
            "typeEntity": "Person"
        },
        {
            "name": "Amir R. Hajrasouliha"
        },
        {
            "name": "Hunter Mathias Gill"
        },
        {
            "name": "Doaa Hassan",
            "orcidid": "http://orcid.org/0000-0002-7358-0830"
        }
    ],
    "description": "Combining Transfer Learning with Retinal Lesions Features for Accurate Detection of Diabetic Retinopathy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Janga-Lab/DR-detector",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-27T21:46:16.357596Z",
    "license": "Not licensed",
    "name": "DR-detector",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fmed.2022.1050436",
            "metadata": {
                "abstract": "Diabetic retinopathy (DR) is a late microvascular complication of Diabetes Mellitus (DM) that could lead to permanent blindness in patients, without early detection. Although adequate management of DM via regular eye examination can preserve vision in in 98% of the DR cases, DR screening and diagnoses based on clinical lesion features devised by expert clinicians; are costly, time-consuming and not sufficiently accurate. This raises the requirements for Artificial Intelligent (AI) systems which can accurately detect DR automatically and thus preventing DR before affecting vision. Hence, such systems can help clinician experts in certain cases and aid ophthalmologists in rapid diagnoses. To address such requirements, several approaches have been proposed in the literature that use Machine Learning (ML) and Deep Learning (DL) techniques to develop such systems. However, these approaches ignore the highly valuable clinical lesion features that could contribute significantly to the accurate detection of DR. Therefore, in this study we introduce a framework called DR-detector that employs the Extreme Gradient Boosting (XGBoost) ML model trained via the combination of the features extracted by the pretrained convolutional neural networks commonly known as transfer learning (TL) models and the clinical retinal lesion features for accurate detection of DR. The retinal lesion features are extracted via image segmentation technique using the UNET DL model and captures exudates (EXs), microaneurysms (MAs), and hemorrhages (HEMs) that are relevant lesions for DR detection. The feature combination approach implemented in DR-detector has been applied to two common TL models in the literature namely VGG-16 and ResNet-50. We trained the DR-detector model using a training dataset comprising of 1,840 color fundus images collected from e-ophtha, retinal lesions and APTOS 2019 Kaggle datasets of which 920 images are healthy. To validate the DR-detector model, we test the model on external dataset that consists of 81 healthy images collected from High-Resolution Fundus (HRF) dataset and MESSIDOR-2 datasets and 81 images with DR signs collected from Indian Diabetic Retinopathy Image Dataset (IDRID) dataset annotated for DR by expert. The experimental results show that the DR-detector model achieves a testing accuracy of 100% in detecting DR after training it with the combination of ResNet-50 and lesion features and 99.38% accuracy after training it with the combination of VGG-16 and lesion features. More importantly, the results also show a higher contribution of specific lesion features toward the performance of the DR-detector model. For instance, using only the hemorrhages feature to train the model, our model achieves an accuracy of 99.38 in detecting DR, which is higher than the accuracy when training the model with the combination of all lesion features (89%) and equal to the accuracy when training the model with the combination of all lesions and VGG-16 features together. This highlights the possibility of using only the clinical features, such as lesions that are clinically interpretable, to build the next generation of robust artificial intelligence (AI) systems with great clinical interpretability for DR detection. The code of the DR-detector framework is available on GitHub at https://github.com/Janga-Lab/DR-detector and can be readily employed for detecting DR from retinal image datasets.",
                "authors": [
                    {
                        "name": "Bhatwadekar A.D."
                    },
                    {
                        "name": "Gill H.M."
                    },
                    {
                        "name": "Hajrasouliha A.R."
                    },
                    {
                        "name": "Happe M."
                    },
                    {
                        "name": "Hassan D."
                    },
                    {
                        "name": "Janga S.C."
                    }
                ],
                "date": "2022-11-08T00:00:00Z",
                "journal": "Frontiers in Medicine",
                "title": "Combining transfer learning with retinal lesion features for accurate detection of diabetic retinopathy"
            },
            "pmcid": "PMC9681494",
            "pmid": "36425113"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
