{
    "additionDate": "2021-01-18T10:35:43Z",
    "biotoolsCURIE": "biotools:covid-abs",
    "biotoolsID": "covid-abs",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Petrônio C.L. Silva",
            "typeEntity": "Person"
        }
    ],
    "description": "COVID-ABS is an agent-based model of COVID-19 epidemic to simulate health and economic effects of social distancing interventions. COVID-ABS is a SEIR (Susceptible-Exposed-Infected-Recovered) agent-based model that aims to simulate the pandemic dynamics using a society of agents emulating people, business and government.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/petroniocandido/COVID19_AgentBasedSimulation",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-17T20:34:12Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://bit.ly/covid_abs_experiments"
        }
    ],
    "name": "COVID-ABS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CHAOS.2020.110088",
            "metadata": {
                "abstract": "© 2020The COVID-19 pandemic due to the SARS-CoV-2 coronavirus has directly impacted the public health and economy worldwide. To overcome this problem, countries have adopted different policies and non-pharmaceutical interventions for controlling the spread of the virus. This paper proposes the COVID-ABS, a new SEIR (Susceptible-Exposed-Infected-Recovered) agent-based model that aims to simulate the pandemic dynamics using a society of agents emulating people, business and government. Seven different scenarios of social distancing interventions were analyzed, with varying epidemiological and economic effects: (1) do nothing, (2) lockdown, (3) conditional lockdown, (4) vertical isolation, (5) partial isolation, (6) use of face masks, and (7) use of face masks together with 50% of adhesion to social isolation. In the impossibility of implementing scenarios with lockdown, which present the lowest number of deaths and highest impact on the economy, scenarios combining the use of face masks and partial isolation can be the more realistic for implementation in terms of social cooperation. The COVID-ABS model was implemented in Python programming language, with source code publicly available. The model can be easily extended to other societies by changing the input parameters, as well as allowing the creation of a multitude of other scenarios. Therefore, it is a useful tool to assist politicians and health authorities to plan their actions against the COVID-19 epidemic.",
                "authors": [
                    {
                        "name": "Alves M.A."
                    },
                    {
                        "name": "Batista P.V.C."
                    },
                    {
                        "name": "Guimaraes F.G."
                    },
                    {
                        "name": "Lima H.S."
                    },
                    {
                        "name": "Silva P.C.L."
                    },
                    {
                        "name": "Silva R.C.P."
                    }
                ],
                "citationCount": 64,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Chaos, Solitons and Fractals",
                "title": "COVID-ABS: An agent-based model of COVID-19 epidemic to simulate health and economic effects of social distancing interventions"
            },
            "pmcid": "PMC7340090",
            "pmid": "32834624"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
