{
    "additionDate": "2019-11-14T18:27:26Z",
    "biotoolsCURIE": "biotools:CoNekT-Plants",
    "biotoolsID": "CoNekT-Plants",
    "confidence_flag": "tool",
    "description": "Expression atlas of Selaginella moellendorffii provides insights into the evolution of vasculature, secondary metabolism and roots | A platform dedicated to the visualization and analysis of plant co-expression and co-function networks",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://conekt.plant.tools",
    "lastUpdate": "2020-12-16T17:37:25Z",
    "name": "CoNekT-Plants",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/744326"
        },
        {
            "doi": "10.1105/tpc.19.00780",
            "metadata": {
                "abstract": "© 2020 ASPB.Selaginella moellendorffii is a representative of the lycophyte lineage that is studied to understand the evolution of land plant traits such as the vasculature, leaves, stems, roots, and secondary metabolism. However, only a few studies have investigated the expression and transcriptional coordination of Selaginella genes, precluding us from understanding the evolution of the transcriptional programs behind these traits. We present a gene expression atlas comprising all major organs, tissue types, and the diurnal gene expression profiles for S. moellendorffii. We show that the transcriptional gene module responsible for the biosynthesis of lignocellulose evolved in the ancestor of vascular plants and pinpoint the duplication and subfunctionalization events that generated multiple gene modules involved in the biosynthesis of various cell wall types. We demonstrate how secondary metabolism is transcriptionally coordinated and integrated with other cellular pathways. Finally, we identify root-specific genes and show that the evolution of roots did not coincide with an increased appearance of gene families, suggesting that the development of new organs does not coincide with increased fixation of new gene functions. Our updated database at conekt.plant.tools represents a valuable resource for studying the evolution of genes, gene families, transcriptomes, and functional gene modules in the Archaeplastida kingdom.",
                "authors": [
                    {
                        "name": "Esteban E."
                    },
                    {
                        "name": "Fernie A."
                    },
                    {
                        "name": "Ferrari C."
                    },
                    {
                        "name": "Hansen B.O."
                    },
                    {
                        "name": "Kragler F."
                    },
                    {
                        "name": "Mutwil M."
                    },
                    {
                        "name": "Pasha A."
                    },
                    {
                        "name": "Provart N.J."
                    },
                    {
                        "name": "Shivhare D."
                    },
                    {
                        "name": "Tohge T."
                    }
                ],
                "citationCount": 11,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Plant Cell",
                "title": "Expression atlas of selaginella moellendorffii provides insights into the evolution of vasculature, secondary metabolism, and roots"
            },
            "pmcid": "PMC7145505",
            "pmid": "31988262"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
