{
    "additionDate": "2024-01-29T09:39:11.550886Z",
    "biotoolsCURIE": "biotools:gutbug",
    "biotoolsID": "gutbug",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vineetks@iiserb.ac.in",
            "name": "Vineet K. Sharma"
        }
    ],
    "description": "Tool for prediction of human gut bacteria-mediated biotransformation of biotic and xenobiotic molecules using machine learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://metabiosys.iiserb.ac.in/gutbug",
    "lastUpdate": "2024-11-24T14:18:45.773953Z",
    "name": "GutBug",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2023.168056",
            "metadata": {
                "abstract": "Dietary components and bioactive molecules present in functional foods and nutraceuticals provide various beneficial effects including modulation of host gut microbiome. These metabolites along with orally administered drugs can be potentially bio-transformed by gut microbiome, which can alter their bioavailability and intended biological or pharmacological activity resulting in individual or population-specific variation in drug and dietary responses. Experimental determination of microbiome-mediated metabolism of orally ingested molecules is difficult due to the enormous diversity and complexity of the gut microbiome. To address this problem, we developed “GutBug”, a web-based resource that predicts all possible bacterial metabolic enzymes that can potentially biotransform xenobiotics and biotic molecules using a combination of machine learning, neural networks and chemoinformatic methods. Using 3,457 enzyme substrates for training and a curated database of 363,872 enzymes from ∼700 gut bacterial strains, GutBug can predict complete EC number of the bacterial enzymes involved in a biotransformation reaction of the given molecule along with the reaction centres with accuracies between 0.78 and 0.97 across different reaction classes. Validation of GutBug's performance using 27 molecules known to be biotransformed by human gut bacteria, including complex polysaccharides, flavonoids, and oral drugs further attests to GutBug's accuracy and utility. Thus, GutBug enhances our understanding of various metabolite-gut bacterial interactions and their resultant effects on the human host health across populations, which will find enormous applications in diet design and intervention, identification and administration of new prebiotics, development of nutraceutical products, and improvements in drug designing. GutBug is available at https://metabiosys.iiserb.ac.in/gutbug.",
                "authors": [
                    {
                        "name": "Malwe A.S."
                    },
                    {
                        "name": "Sharma V.K."
                    },
                    {
                        "name": "Srivastava G.N."
                    }
                ],
                "citationCount": 8,
                "date": "2023-07-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "GutBug: A Tool for Prediction of Human Gut Bacteria Mediated Biotransformation of Biotic and Xenobiotic Molecules Using Machine Learning"
            },
            "pmid": "37356904"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}
