{
    "additionDate": "2019-11-14T18:19:55Z",
    "biotoolsCURIE": "biotools:Epi-GTBN",
    "biotoolsID": "Epi-GTBN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "guoyang@webmail.hzau.edu.cn",
            "name": "Yang Guo",
            "typeEntity": "Person",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "liujianxiao@mail.hzau.edu.cn",
            "name": "Jianxiao Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "An approach of epistasis mining based on genetic Tabu algorithm and Bayesian network",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://122.205.95.139/Epi-GTBN/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-25T15:00:40Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Epi-GTBN/package/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Epi-GTBN/package"
        }
    ],
    "name": "Epi-GTBN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3022-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Mining epistatic loci which affects specific phenotypic traits is an important research issue in the field of biology. Bayesian network (BN) is a graphical model which can express the relationship between genetic loci and phenotype. Until now, it has been widely used into epistasis mining in many research work. However, this method has two disadvantages: low learning efficiency and easy to fall into local optimum. Genetic algorithm has the excellence of rapid global search and avoiding falling into local optimum. It is scalable and easy to integrate with other algorithms. This work proposes an epistasis mining approach based on genetic tabu algorithm and Bayesian network (Epi-GTBN). It uses genetic algorithm into the heuristic search strategy of Bayesian network. The individual structure can be evolved through the genetic operations of selection, crossover and mutation. It can help to find the optimal network structure, and then further to mine the epistasis loci effectively. In order to enhance the diversity of the population and obtain a more effective global optimal solution, we use the tabu search strategy into the operations of crossover and mutation in genetic algorithm. It can help to accelerate the convergence of the algorithm. Results: We compared Epi-GTBN with other recent algorithms using both simulated and real datasets. The experimental results demonstrate that our method has much better epistasis detection accuracy in the case of not affecting the efficiency for different datasets. Conclusions: The presented methodology (Epi-GTBN) is an effective method for epistasis detection, and it can be seen as an interesting addition to the arsenal used in complex traits analyses.",
                "authors": [
                    {
                        "name": "Gao H."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Liang Z."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Zhong Z."
                    }
                ],
                "citationCount": 10,
                "date": "2019-08-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Epi-GTBN: An approach of epistasis mining based on genetic Tabu algorithm and Bayesian network"
            },
            "pmcid": "PMC6712799",
            "pmid": "31455207"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
