{
    "additionDate": "2018-08-29T12:54:22Z",
    "biotoolsCURIE": "biotools:chemsar",
    "biotoolsID": "chemsar",
    "credit": [
        {
            "email": "oriental-cds@163.com",
            "name": "Dongsheng Cao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This web server provides online access to realize a full workflow of building a Structure‑Activity/Property Relationship(SAR/SPR) model. It provides a browser-based pipelining which requires no programming skills.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://chemsar.scbdd.com/home/manual/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                }
            ]
        }
    ],
    "homepage": "http://chemsar.scbdd.com/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "ChemSAR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0215-1",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: In recent years, predictive models based on machine learning techniques have proven to be feasible and effective in drug discovery. However, to develop such a model, researchers usually have to combine multiple tools and undergo several different steps (e.g., RDKit or ChemoPy package for molecular descriptor calculation, ChemAxon Standardizer for structure preprocessing, scikit-learn package for model building, and ggplot2 package for statistical analysis and visualization, etc.). In addition, it may require strong programming skills to accomplish these jobs, which poses severe challenges for users without advanced training in computer programming. Therefore, an online pipelining platform that integrates a number of selected tools is a valuable and efficient solution that can meet the needs of related researchers. Results: This work presents a web-based pipelining platform, called ChemSAR, for generating SAR classification models of small molecules. The capabilities of ChemSAR include the validation and standardization of chemical structure representation, the computation of 783 1D/2D molecular descriptors and ten types of widely-used fingerprints for small molecules, the filtering methods for feature selection, the generation of predictive models via a step-by-step job submission process, model interpretation in terms of feature importance and tree visualization, as well as a helpful report generation system. The results can be visualized as high-quality plots and downloaded as local files. Conclusion: ChemSAR provides an integrated web-based platform for generating SAR classification models that will benefit cheminformatics and other biomedical users. It is freely available at: http://chemsar.scbdd.com. Graphical abstract.",
                "authors": [
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Yao Z.-J."
                    },
                    {
                        "name": "Zhu M.-F."
                    },
                    {
                        "name": "Wang N.-N."
                    },
                    {
                        "name": "Lu B."
                    },
                    {
                        "name": "Chen A.F."
                    },
                    {
                        "name": "Lu A.-P."
                    },
                    {
                        "name": "Miao H."
                    },
                    {
                        "name": "Zeng W.-B."
                    },
                    {
                        "name": "Cao D.-S."
                    }
                ],
                "citationCount": 20,
                "date": "2017-05-04T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "ChemSAR: An online pipelining platform for molecular SAR modeling"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}