{
    "additionDate": "2017-12-18T00:11:59Z",
    "biotoolsCURIE": "biotools:rssvm",
    "biotoolsID": "rssvm",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://stormo.wustl.edu/"
        }
    ],
    "description": "Employs Support Vector Machines (SVM) for efficient identification of functional RNA motifs from random RNA structures. It uses a set of distinctive features to represent the common RNA secondary structure and structural alignment predicted by RNA Sampler, a tool for accurate RNA common structure prediction, and is trained with functional RNAs from a variety of bacterial RNA motif/gene families covering a wide range of sequence identities.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://stormo.wustl.edu/RSSVM/README.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure prediction",
                    "uri": "http://edamontology.org/operation_0271"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://stormo.wustl.edu/RSSVM/",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rssvm-1-0-discover-cis-regulatory-rnas.html"
        }
    ],
    "name": "RSSVM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1000338",
            "metadata": {
                "abstract": "An increasing number of cis-regulatory RNA elements have been found to regulate gene expression post-transcriptionally in various biological processes in bacterial systems. Effective computational tools for large-scale identification of novel regulatory RNAs are strongly desired to facilitate our exploration of gene regulation mechanisms and regulatory networks. We present a new computational program named RSSVM (RNA Sampler+Support Vector Machine), which employs Support Vector Machines (SVMs) for efficient identification of functional RNA motifs from random RNA secondary structures. RSSVM uses a set of distinctive features to represent the common RNA secondary structure and structural alignment predicted by RNA Sampler, a tool for accurate common RNA secondary structure prediction, and is trained with functional RNAs from a variety of bacterial RNA motif/gene families covering a wide range of sequence identities. When tested on a large number of known and random RNA motifs, RSSVM shows a significantly higher sensitivity than other leading RNA identification programs while maintaining the same false positive rate. RSSVM performs particularly well on sets with low sequence identities. The combination of RNA Sampler and RSSVM provides a new, fast, and efficient pipeline for large-scale discovery of regulatory RNA motifs. We applied RSSVM to multiple Shewanella genomes and identified putative regulatory RNA motifs in the 59 untranslated regions (UTRs) in S. oneidensis, an important bacterial organism with extraordinary respiratory and metal reducing abilities and great potential for bioremediation and alternative energy generation. From 1002 sets of 59-UTRs of orthologous operons, we identified 166 putative regulatory RNA motifs, including 17 of the 19 known RNA motifs from Rfam, an additional 21 RNA motifs that are supported by literature evidence, 72 RNA motifs overlapping predicted transcription terminators or attenuators, and other candidate regulatory RNA motifs. Our study provides a list of promising novel regulatory RNA motifs potentially involved in post-transcriptional gene regulation. Combined with the previous cisregulatory DNA motif study in S. oneidensis, this genome-wide discovery of cis-regulatory RNA motifs may offer more comprehensive views of gene regulation at a different level in this organism. The RSSVM software, predictions, and analysis results on Shewanella genomes are available at http://ural.wustl.edu/resources.html#RSSVM.",
                "authors": [
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Ji Y."
                    },
                    {
                        "name": "Stormo G.D."
                    }
                ],
                "citationCount": 14,
                "date": "2009-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Discovering cis-Regulatory RNAs in Shewanella Genomes by Support Vector Machines"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Gene families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Functional RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}