{
    "accessibility": "Open access",
    "additionDate": "2022-03-28T07:52:11.421590Z",
    "biotoolsCURIE": "biotools:anat",
    "biotoolsID": "anat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "roded@tauex.tau.ac.il",
            "name": "R. Sharan",
            "typeEntity": "Person"
        }
    ],
    "description": "ANAT (Advanced Network Analysis Tool) is an all-in-one resource that provides access to up-to-date large-scale physical association data in several organisms, advanced algorithms for network reconstruction, and a number of tools for exploring and evaluating the obtained network models. It is a framework for elucidating functional protein subnetworks using graph-theoretic and machine learning approaches.\n\nGenome-scale screening studies are gradually accumulating a wealth of data on the putative involvement of hundreds of genes in various cellular responses or functions. A fundamental challenge is to chart out the molecular pathways that underlie these systems. ANAT (Advanced Network Analysis Tool) , is an all-in-one resource that provides access to up-to-date large-scale physical association data in several organisms, advanced algorithms for network reconstruction, and a number of tools for exploring and evaluating the obtained network models. It is a plug-in for Cytoscape.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.cs.tau.ac.il/~bnet/ANAT/resources/ANAT-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                }
            ]
        }
    ],
    "homepage": "https://www.cs.tau.ac.il/~bnet/ANAT/",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2022-03-28T07:52:11.424132Z",
    "license": "Other",
    "name": "ANAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04449-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: ANAT is a Cytoscape plugin for the inference of functional protein–protein interaction networks in yeast and human. It is a flexible graphical tool for scientists to explore and elucidate the protein–protein interaction pathways of a process under study. Results: Here we present ANAT3.0, which comes with updated PPI network databases of 544,455 (human) and 155,504 (yeast) interactions, and a new machine-learning layer for refined network elucidation. Together they improve network reconstruction to more than twofold increase in the quality of reconstructing known signaling pathways from KEGG. Conclusions: ANAT3.0 includes improved network reconstruction algorithms and more comprehensive protein–protein interaction networks than previous versions. ANAT is available for download on the Cytoscape Appstore and at https://www.cs.tau.ac.il/~bnet/ANAT/.",
                "authors": [
                    {
                        "name": "Almozlino T."
                    },
                    {
                        "name": "Sharan R."
                    },
                    {
                        "name": "Signorini L.F."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ANAT 3.0: a framework for elucidating functional protein subnetworks using graph-theoretic and machine learning approaches"
            },
            "pmcid": "PMC8555137",
            "pmid": "34706638",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
