
{
    "credit": [
        {
            "email": "deb@nii.res.in",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.nii.ac.in/~pksdb/sbspks/homepage.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/sbspks-structure-based-sequence-analysis-polyketide-synthases.html"
        }
    ],
    "publication": [
        {
            "abstract": "Polyketide synthases (PKSs) catalyze biosynthesis of a diverse family of pharmaceutically important secondary metabolites. Bioinformatics analysis of sequence and structural features of PKS proteins plays a crucial role in discovery of new natural products by genome mining, as well as in design of novel secondary metabolites by biosynthetic engineering. The availability of the crystal structures of various PKS catalytic and docking domains, and mammalian fatty acid synthase module prompted us to develop SBSPKS software which consists of three major components. Model_3D_PKS can be used for modeling, visualization and analysis of 3D structure of individual PKS catalytic domains, dimeric structures for complete PKS modules and prediction of substrate specificity. Dock_Dom_Anal identifies the key interacting residue pairs in inter-subunit interfaces based on alignment of inter-polypeptide linker sequences to the docking domain structure. In case of modular PKS with multiple open reading frames (ORFs), it can predict the cognate order of substrate channeling based on combinatorial evaluation of all possible interface contacts. NRPS-PKS provides user friendly tools for identifying various catalytic domains in the sequence of a Type I PKS protein and comparing them with experimentally characterized PKS/NRPS clusters cataloged in the backend databases of SBSPKS. SBSPKS is available at http://www.nii.ac.in/sbspks.html. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "Anand S.",
                "Prasad M.V.R.",
                "Yadav G.",
                "Kumar N.",
                "Shehara J.",
                "Ansari M.Z.",
                "Mohanty D."
            ],
            "cit_count": 112,
            "journal": "Nucleic Acids Research",
            "pmid": "20444870",
            "title": "SBSPKS: Structure based sequence analysis of polyketide synthases",
            "year": "2010-05-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sbspks",
        "biotoolsID": "sbspks",
        "description": "A webserver for carrying out sequence and structure based analysis of Polyketide Synthases, an important family of multifunctional megasynthases involved in the biosynthesis of a variety of pharmaceutically important secondary metabolites.",
        "homepage": "http://www.nii.ac.in/~pksdb/sbspks/homepage.html",
        "name": "SBSPKS"
    }
}