{
    "name": "ZygProb", 
    "description": "Processes convenient and accurate zygosity probability calculation.", 
    "homepage": "http://neurogenetics.qimrberghofer.edu.au/ZygProb/", 
    "biotoolsID": "zygprob", 
    "biotoolsCURIE": "biotools:zygprob", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0236", 
                    "term": "Sequence composition calculation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2269", 
            "term": "Statistics and probability"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/zygprob-zygosity-probability-calculation.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://neurogenetics.qimrberghofer.edu.au/ZygProb/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "1661148", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Aggregation of IGF-I Receptors or Insulin Receptors and Activation of Their Kinase Activity Are Simultaneously Caused by the Presence of Polycations or K-ras Basic Peptides", 
                "abstract": "Several groups including us reported that basic proteins and polycations activate the insulin receptor tyrosine-specific protein kinase (TPK) in vitro. However, some inconsistency has become obvious in the observations. The most intriguing was the brief description by Morrison et al. [(1989) J. Biol. Chem. 264, 9994-10001] that polylysine had no effect on the IGF-I receptor TPK despite its 84% identity to the insulin receptor TPK. In the present study, we used highly purified IGF-I and insulin receptor TPKs in an effort to solve the discrepancies noted in the recent publications and to reveal the mechanism by which polycations stimulate the receptor TPKs. We report that the IGF-I receptor TPK is stimulated by polycations and basic proteins in a manner similar to their effects on the insulin receptor TPK. When effects of polylysine and polyarginine on both receptor TPKs were closely compared, subtle qualitative differences were found: Polylysine stimulated autophosphorylation and exogenous substrate phosphorylation activities of both insulin receptor TPK and IGF-I receptor TPK similarly. In contrast, another polycation, polyarginine, affected both TPKs in a manner quite different from polylysine: Polyarginine stimulated insulin receptor autophosphorylation to a greater extent than polylysine did while it had a very small effect on the IGF-I receptor autophosphorylation as well as the exogenous substrate phosphorylation activities of the two receptor TPKs. We have further extended the studies to include the domains of natural proteins which contain a polylysine-like sequence. Such peptides, K-ras peptides, had similar effects on the two receptor TPKs to those of polycations. Finally, we observed that polycations and K-ras peptides caused receptor aggregation as judged by nondenaturing gradient polyacrylamide gel electrophoresis and sucrose density gradient centrifugation. These studies suggest a strong correlation between receptor aggregation and activation of IGF-I and insulin receptor TPKs which may be caused by cellular proteins such as K-ras products. © 1991, American Chemical Society. All rights reserved.", 
                "date": "1991-12-01T00:00:00Z", 
                "citationCount": 15, 
                "authors": [
                    {
                        "name": "Xu Q.-Y."
                    }, 
                    {
                        "name": "Li S.-L."
                    }, 
                    {
                        "name": "LeBon T.R."
                    }, 
                    {
                        "name": "Fujita-Yamaguchi Y."
                    }
                ], 
                "journal": "Biochemistry"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "daleN@qimr.edu.au", 
            "url": "http://neurogenetics.qimrberghofer.edu.au/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:04:52Z", 
    "lastUpdate": "2018-12-10T12:58:49Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}