{
    "additionDate": "2020-01-14T20:01:59Z",
    "biotoolsCURIE": "biotools:LOBSTER",
    "biotoolsID": "LOBSTER",
    "confidence_flag": "tool",
    "description": "An environment to design bioimage analysis workflows for large and complex fluorescence microscopy data.\n\nSUMMARY:Open source software such as ImageJ and CellProfiler greatly simplified the quantitative analysis of microscopy images but their applicability is limited by the size, dimensionality and complexity of the images under study. In contrast, software optimized for the needs of specific research projects can overcome these limitations, but they may be harder to find, set up and customize to different needs. Overall, the analysis of large, complex, microscopy images is hence still a critical bottleneck for many Life Scientists. We introduce LOBSTER (Little Objects Segmentation & Tracking Environment), an environment designed to help scientists design and customize image analysis workflows to accurately characterize biological objects from a broad range of fluorescence microscopy images, including large images exceeding workstation main memory.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31860062",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-22T11:21:28Z",
    "name": "LOBSTER",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ945",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Open source software such as ImageJ and CellProfiler greatly simplified the quantitative analysis of microscopy images but their applicability is limited by the size, dimensionality and complexity of the images under study. In contrast, software optimized for the needs of specific research projects can overcome these limitations, but they may be harder to find, set up and customize to different needs. Overall, the analysis of large, complex, microscopy images is hence still a critical bottleneck for many Life Scientists. We introduce LOBSTER (Little Objects Segmentation and Tracking Environment), an environment designed to help scientists design and customize image analysis workflows to accurately characterize biological objects from a broad range of fluorescence microscopy images, including large images exceeding workstation main memory. LOBSTER comes with a starting set of over 75 sample image analysis workflows and associated images stemming from state-of-the-art image-based research projects.",
                "authors": [
                    {
                        "name": "Tosi S."
                    },
                    {
                        "name": "Bardia L."
                    },
                    {
                        "name": "Filgueira M.J."
                    },
                    {
                        "name": "Calon A."
                    },
                    {
                        "name": "Colombelli J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LOBSTER: An environment to design bioimage analysis workflows for large and complex fluorescence microscopy data"
            },
            "pmid": "31860062"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "validated": 1
}