{
    "additionDate": "2021-11-01T13:07:12.512309Z",
    "biotoolsCURIE": "biotools:peptherdia",
    "biotoolsID": "peptherdia",
    "confidence_flag": "tool",
    "description": "PepTherDia is a database and tool for structural composition analysis of approved peptide therapeutics and diagnostics. Manually curated database containing a searchable list of approved peptide drugs and diagnostic agents. On these compounds, we have performed a detailed analysis of the structural features and collected information on their physicochemical and pharmacokinetic properties, indication, route of administration, production methodologies, marketing authorisation and origin of their design. The final purpose of this database is to aid the scientific community to more successfully design or pre-screen candidates at an early stage of the peptide drug discovery process.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://peptherdia.herokuapp.com",
    "lastUpdate": "2021-11-01T13:07:12.515032Z",
    "name": "PepTherDia",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.DRUDIS.2021.02.019",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdAs of 2020, there were >100 approved peptides with therapeutic or diagnostic applications. However, a complete database providing information on marketed peptides is not freely available, making the peptide chemists’ job of designing future peptide drug candidates challenging. Unlike the rules for small-molecule drugs, there is no general set of guidelines for designing a successful peptide-based drug. In this review, together with our freely available database (PepTherDia, http://peptherdia.herokuapp.com), we provide insights into what a successful peptide therapeutic or diagnostic agent looks like and lay the foundation for establishing a set of rules to help future medicinal chemists to design peptide candidates with increased approval rates.",
                "authors": [
                    {
                        "name": "Coxon C.R."
                    },
                    {
                        "name": "D'Aloisio V."
                    },
                    {
                        "name": "Dognini P."
                    },
                    {
                        "name": "Hutcheon G.A."
                    }
                ],
                "citationCount": 3,
                "date": "2021-06-01T00:00:00Z",
                "journal": "Drug Discovery Today",
                "title": "PepTherDia: database and structural composition analysis of approved peptide therapeutics and diagnostics"
            },
            "pmid": "33647438"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
