{"credit":[{"email":"hugo.varet@pasteur.fr","name":"Hugo Varet","typeEntity":"Person","typeRoles":["Primary contact"]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","elixirNode":["France"],"elixirPlatform":["Tools"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Data management","uri":"http://edamontology.org/topic_3071"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/PF2-pasteur-fr/checkMyIndex"}],"publication":[{"abstract":"© The Author(s) 2018. Published by Oxford University Press. SUMMARY: When sequencing several libraries simultaneously, the selection of compatible combinations of indexes is critical for ensuring that the sequencer will be able to decipher the short, sample-specific barcodes added to each fragment. However, researchers have few tools to help them choose optimal indexes. Here, we present checkMyIndex, an online R/Shiny application that facilitates the selection of the right indexes as a function of the experimental constraints. AVAILABILITY AND IMPLEMENTATION: checkMyIndex is available free of charge at https://checkmyindex.pasteur.fr as an online, web-based R/Shiny application. The source code is available on GitHub at https://github.com/PF2-pasteur-fr/checkMyIndex.","authors":["Varet H.","Coppee J.-Y."],"cit_count":0,"doi":"10.1093/bioinformatics/bty706","journal":"Bioinformatics (Oxford, England)","pmid":"30165585","title":"checkMyIndex: a web-based R/Shiny interface for choosing compatible sequencing indexes","type":"Usage","year":"2019-03-01"}],"summary":{"biotoolsCURIE":"biotools:checkmyindex","biotoolsID":"checkmyindex","description":"When sequencing several libraries simultaneously, the selection of compatible combinations of indexes is critical for ensuring that the sequencer will be able to decipher the short, sample-specific barcodes added to each fragment. However, researchers have few tools to help them choose optimal indexes. Here, we present checkMyIndex, an online R/Shiny application that facilitates the selection of the right indexes as a function of the experimental constraints.","homepage":"https://checkmyindex.pasteur.fr","name":"checkMyIndex","version":["1.0.0"]}}