{
    "additionDate": "2021-01-18T09:04:38Z",
    "biotoolsCURIE": "biotools:penda",
    "biotoolsID": "penda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "magali.richard@univ-grenoble-alpes.fr",
            "name": "Magali Richard",
            "orcidid": "https://orcid.org/0000-0003-3165-3218",
            "typeEntity": "Person"
        },
        {
            "email": "daniel.jost@ens-lyon.fr",
            "name": "Daniel Jost",
            "orcidid": "https://orcid.org/0000-0002-9877-6864",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package that performs personalized differential analysis of omics data. The penda package provide different methods to perform differential analysis and rank-based method for personalized differential analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bcm-uga/penda",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2021-01-23T08:10:04Z",
    "name": "PenDA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007869",
            "metadata": {
                "abstract": "© 2020 Richard et al.The hopes of precision medicine rely on our capacity to measure various high-throughput genomic information of a patient and to integrate them for personalized diagnosis and adapted treatment. Reaching these ambitious objectives will require the development of efficient tools for the detection of molecular defects at the individual level. Here, we propose a novel method, PenDA, to perform Personalized Differential Analysis at the scale of a single sample. PenDA is based on the local ordering of gene expressions within individual cases and infers the deregulation status of genes in a sample of interest compared to a reference dataset. Based on realistic simulations of RNA-seq data of tumors, we showed that PenDA outcompetes existing approaches with very high specificity and sensitivity and is robust to normalization effects. Applying the method to lung cancer cohorts, we observed that deregulated genes in tumors exhibit a cancer-type-specific commitment towards up- or down-regulation. Based on the individual information of deregulation given by PenDA, we were able to define two new molecular histologies for lung adenocarcinoma cancers strongly correlated to survival. In particular, we identified 37 biomarkers whose up-regulation lead to bad prognosis and that we validated on two independent cohorts. PenDA provides a robust, generic tool to extract personalized deregulation patterns that can then be used for the discovery of therapeutic targets and for personalized diagnosis. An open-access, user-friendly R package is available at https://github.com/bcm-uga/penda.",
                "authors": [
                    {
                        "name": "Richard M."
                    },
                    {
                        "name": "Decamps C."
                    },
                    {
                        "name": "Chuffart F."
                    },
                    {
                        "name": "Brambilla E."
                    },
                    {
                        "name": "Rousseaux S."
                    },
                    {
                        "name": "Khochbin S."
                    },
                    {
                        "name": "Jost D."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "PenDA, a rank-based method for personalized differential analysis: Application to lung cancer"
            },
            "pmcid": "PMC7274464",
            "pmid": "32392248"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}