{"credit":[{"name":"IntAct team","typeEntity":"Person","typeRoles":["Developer"]},{"name":"EMBL-EBI","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"intact-help@ebi.ac.uk","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"marine@ebi.ac.uk","name":"Marine Dumousseau","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"TERMS_OF_USE","url":"http://www.ebi.ac.uk/about/terms-of-use"},{"type":"GENERAL","url":"http://www.ebi.ac.uk/intact/validator/start.xhtml"}],"function":[{"input":[{"data":{"term":"Protein interaction data","uri":"http://edamontology.org/data_0906"},"format":[{"term":"PSI MI XML (MIF)","uri":"http://edamontology.org/format_3158"},{"term":"PSI-PAR","uri":"http://edamontology.org/format_3243"}]}],"operation":[{"term":"Format validation","uri":"http://edamontology.org/operation_0336"}],"output":[{"data":{"term":"Report","uri":"http://edamontology.org/data_2048"},"format":[{"term":"HTML","uri":"http://edamontology.org/format_2331"}]}]}],"labels":{"collectionID":["EBI Tools"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Data management","uri":"http://edamontology.org/topic_3071"}]},"publication":[{"abstract":"The Human Proteome Organization's Proteomics Standards Initiative (PSI) promotes the development of exchange standards to improve data integration and interoperability. PSI specifies the suitable level of detail required when reporting a proteomics experiment (via the Minimum Information About a Proteomics Experiment), and provides extensible markup language (XML) exchange formats and dedicated controlled vocabularies (CVs) that must be combined to generate a standard compliant document. The framework presented here tackles the issue of checking that experimental data reported using a specific format, CVs and public bio-ontologies (e.g. Gene Ontology, NCBI taxonomy) are compliant with the Minimum Information About a Proteomics Experiment recommendations. The semantic validator not only checks the XML syntax but it also enforces rules regarding the use of an ontology class or CV terms by checking that the terms exist in the resource and that they are used in the correct location of a document. Moreover, this framework is extremely fast, even on sizable data files, and flexible, as it can be adapted to any standard by customizing the parameters it requires: an XML Schema Definition, one or more CVs or ontologies, and a mapping file describing in a formal way how the semantic resources and the format are interrelated. As such, the validator provides a general solution to the common problem in data exchange: how to validate the correct usage of a data standard beyond simple XML Schema Definition validation. The framework source code and its various applications can be found at http://psidev.info/ validator. © 2009 Wiley-VCH Verlag GmbH & Co. KGaA.","authors":["Montecchi-Palazzi L.","Kerrien S.","Reisinger F.","Aranda B.","Jones A.R.","Martens L.","Hermjakob H."],"cit_count":43,"doi":"10.1002/pmic.200900189","journal":"Proteomics","title":"The PSI semantic validator: A framework to check MIAPE compliance of proteomics data","type":"Primary","year":"2009-11-01"}],"summary":{"biotoolsCURIE":"biotools:psi-mi_validator","biotoolsID":"psi-mi_validator","description":"Validate files in PSI-MI XML 2.5 and PSI-PAR format, and generate a table with error messages.","homepage":"http://www.ebi.ac.uk/intact/validator/start.xhtml","name":"PSI-MI Validator","version":["1"]}}