{
    "additionDate": "2019-02-13T12:52:15Z",
    "biotoolsCURIE": "biotools:biostudies",
    "biotoolsID": "biostudies",
    "credit": [
        {
            "email": "ugis@ebi.ac.uk",
            "name": "Ugis Sarkans",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "biostudies@ebi.ac.uk",
            "name": "Helpdesk",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "The BioStudies database holds descriptions of biological studies, links to data from these studies in other databases at EMBL-EBI or outside, as well as data that do not fit in the structured archives at EMBL-EBI. The database can accept a wide range of types of studies described via a simple format. It also enables manuscript authors to submit supplementary information and link to it from the publication.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ebi.ac.uk/biostudies/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "EMBL"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "elixir_badge": 1,
    "homepage": "https://www.ebi.ac.uk/biostudies/",
    "lastUpdate": "2019-02-15T10:24:02Z",
    "name": "BioStudies",
    "owner": "jison",
    "publication": [
        {
            "doi": "10.1093/nar/gkx965",
            "metadata": {
                "abstract": "© 2017 The Author(s). BioStudies (www.ebi.ac.uk/biostudies) is a new public database that organizes data from biological studies. Typically, but not exclusively, a study is associated with a publication. BioStudies offers a simple way to describe the study structure, and provides flexible data deposition tools and data access interfaces. The actual data can be stored either in BioStudies or remotely, or both. BioStudies imports supplementary data from Europe PMC, and is a resource for authors and publishers for packaging data during the manuscript preparation process. It also can support data management needs of collaborative projects. The growth in multiomics experiments and other multi-faceted approaches to life sciences research mean that studies result in a diversity of data outputs in multiple locations. BioStudies presents a solution to ensuring that all these data and the associated publication(s) can be found coherently in the longer term.",
                "authors": [
                    {
                        "name": "Sarkans U."
                    },
                    {
                        "name": "Gostev M."
                    },
                    {
                        "name": "Athar A."
                    },
                    {
                        "name": "Behrangi E."
                    },
                    {
                        "name": "Melnichuk O."
                    },
                    {
                        "name": "Ali A."
                    },
                    {
                        "name": "Minguet J."
                    },
                    {
                        "name": "Rada J.C."
                    },
                    {
                        "name": "Snow C."
                    },
                    {
                        "name": "Tikhonov A."
                    },
                    {
                        "name": "Brazma A."
                    },
                    {
                        "name": "McEntyre J."
                    }
                ],
                "citationCount": 4,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The BioStudies database-one stop shop for all data supporting a life sciences study"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        }
    ],
    "validated": 1
}