
{
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "name": "Contact Us page",
            "typeEntity": "Person",
            "typeRoles": [
                "Support"
            ],
            "url": "http://www.cgl.ucsf.edu/chimera/docs/feedback.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cgl.ucsf.edu/chimera/docindex.html"
        }
    ],
    "function": [
        {
            "note": "UCSF Chimera is a highly extensible program for interactive visualization and analysis of molecular structures and related data, including density maps, supramolecular assemblies, sequence alignments, docking results, trajectories, and conformational ensembles. High-quality images and animations can be generated.",
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Instruct"
        ],
        "cost": "Free of charge",
        "language": [
            "C++",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Structural biology",
                "uri": "http://edamontology.org/topic_1317"
            },
            {
                "term": "Electron microscopy",
                "uri": "http://edamontology.org/topic_0611"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The design, implementation, and capabilities of an extensible visualization system, UCSF Chimera, are discussed. Chimera is segmented into a core that provides basic services and visualization, and extensions that provide most higher level functionality. This architecture ensures that the extension mechanism satisfies the demands of outside developers who wish to incorporate new features, Two unusual extensions are presented: Multiscale, which adds the ability to visualize large-scale molecular assemblies such as viral coats, and Collaboratory, which allows researchers to share a Chimera session interactively despite being at separate locales. Other extensions include Multalign Viewer, for showing multiple sequence alignments and associated structures; ViewDock, for screening docked ligand orientations; Movie, for replaying molecular dynamics trajectories; and Volume Viewer, for display and analysis of volumetric data. A discussion of the usage of Chimera in real-world situations is given, along with anticipated future directions. Chimera includes full user documentation, is free to academic and nonprofit users, and is available for Microsoft Windows, Linux, Apple Mac OS X, SGI IRIX, and HP Tru64 Unix from http://www.cgl.ucsf.edu/chimera/. © 2004 Wiley Periodicals, Inc.",
            "authors": [
                "Pettersen E.F.",
                "Goddard T.D.",
                "Huang C.C.",
                "Couch G.S.",
                "Greenblatt D.M.",
                "Meng E.C.",
                "Ferrin T.E."
            ],
            "cit_count": 14340,
            "doi": "10.1002/jcc.20084",
            "journal": "Journal of Computational Chemistry",
            "title": "UCSF Chimera - A visualization system for exploratory research and analysis",
            "type": "Primary",
            "year": "2004-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:chimera",
        "biotoolsID": "chimera",
        "description": "Highly extensible program for interactive visualization and analysis of molecular structures and related data, including density maps, supramolecular assemblies, sequence alignments, docking results, trajectories, and conformational ensembles. High-quality images and animations can be generated.",
        "homepage": "http://www.cgl.ucsf.edu/chimera/",
        "name": "Chimera",
        "version": [
            "1.10"
        ]
    }
}