{
    "additionDate": "2015-03-26T22:55:01Z",
    "biotoolsCURIE": "biotools:chimera",
    "biotoolsID": "chimera",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Contact Us page",
            "typeEntity": "Person",
            "typeRole": [
                "Support"
            ],
            "url": "http://www.cgl.ucsf.edu/chimera/docs/feedback.html"
        }
    ],
    "description": "Highly extensible program for interactive visualization and analysis of molecular structures and related data, including density maps, supramolecular assemblies, sequence alignments, docking results, trajectories, and conformational ensembles. High-quality images and animations can be generated.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cgl.ucsf.edu/chimera/docindex.html"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "note": "UCSF Chimera is a highly extensible program for interactive visualization and analysis of molecular structures and related data, including density maps, supramolecular assemblies, sequence alignments, docking results, trajectories, and conformational ensembles. High-quality images and animations can be generated.",
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://www.cgl.ucsf.edu/chimera/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2022-07-11T10:54:22.593114Z",
    "name": "Chimera",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1093/nar/gku377",
            "metadata": {
                "abstract": "Integrating access to web services with desktop applications allows for an expanded set of application features, including performing computationally intensive tasks and convenient searches of databases. We describe how we have enhanced UCSF Chimera (http://www.rbvi.ucsf.edu/chimera/), a program for the interactive visualization and analysis of molecular structures and related data, through the addition of several web services (http://www.rbvi.ucsf.edu/chimera/ docs/webservices.html). By streamlining access to web services, including the entire job submission, monitoring and retrieval process, Chimera makes it simpler for users to focus on their science projects rather than data manipulation. Chimera uses Opal, a toolkit for wrapping scientific applications as web services, to provide scalable and transparent access to several popular software packages. We illustrate Chimera's use of web services with an example workflow that interleaves use of these services with interactive manipulation of molecular sequences and structures, and we provide an example Python program to demonstrate how easily Opal-based web services can be accessed from within an application. Web server availability: http://webservices.rbvi.ucsf.edu/opal2/ dashboard-command=serviceList. © 2014 The Author(s).",
                "authors": [
                    {
                        "name": "Ferrin T.E."
                    },
                    {
                        "name": "Huang C.C."
                    },
                    {
                        "name": "Meng E.C."
                    },
                    {
                        "name": "Morris J.H."
                    },
                    {
                        "name": "Pettersen E.F."
                    }
                ],
                "citationCount": 78,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Enhancing UCSF Chimera through web services"
            },
            "pmcid": "PMC4086125",
            "pmid": "24861624"
        },
        {
            "doi": "10.1093/nar/gnj031",
            "metadata": {
                "abstract": "With the increase in the number of large, 3D, high-resolution nucleic acid structures, particularly of the 30S and 50S ribosomal subunits and the intact bacterial ribosome, advancements in the visualization of nucleic acid structural features are essential. Large molecular structures are complicated and detailed, and one goal of visualization software is to allow the user to simplify the display of some features and accent others. We describe an extension to the UCSF Chimera molecular visualization system for the purpose of displaying and highlighting nucleic acid characteristics, including a new representation of sugar pucker, several options for abstraction of base geometries that emphasize stacking and base pairing, and an adaptation of the ribbon backbone to accommodate the nucleic acid backbone. Molecules are displayed and manipulated interactively, allowing the user to change the representations as desired for small molecules, proteins and nucleic acids. This software is available as part of the UCSF Chimera molecular visualization system and thus is integrated with a suite of existing tools for molecular graphics. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Couch G.S."
                    },
                    {
                        "name": "Ferrin T.E."
                    },
                    {
                        "name": "Hendrix D.K."
                    }
                ],
                "citationCount": 59,
                "date": "2006-03-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Nucleic acid visualization with UCSF Chimera"
            },
            "pmcid": "PMC1368656",
            "pmid": "16478715"
        },
        {
            "doi": "10.1016/j.jsb.2006.06.010",
            "metadata": {
                "abstract": "We describe methods for interactive visualization and analysis of density maps available in the UCSF Chimera molecular modeling package. The methods enable segmentation, fitting, coarse modeling, measuring and coloring of density maps for elucidating structures of large molecular assemblies such as virus particles, ribosomes, microtubules, and chromosomes. The methods are suitable for density maps with resolutions in the range spanned by electron microscope single particle reconstructions and tomography. All of the tools described are simple, robust and interactive, involving computations taking only seconds. An advantage of the UCSF Chimera package is its integration of a large collection of interactive methods. Interactive tools are sufficient for performing simple analyses and also serve to prepare input for and examine results from more complex, specialized, and algorithmic non-interactive analysis software. While both interactive and non-interactive analyses are useful, we discuss only interactive methods here. © 2006 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Ferrin T.E."
                    },
                    {
                        "name": "Goddard T.D."
                    },
                    {
                        "name": "Huang C.C."
                    }
                ],
                "citationCount": 560,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Journal of Structural Biology",
                "title": "Visualizing density maps with UCSF Chimera"
            },
            "pmid": "16963278"
        },
        {
            "doi": "10.1186/1471-2105-7-339",
            "metadata": {
                "abstract": "Background: Comparing related structures and viewing the structures in the context of sequence alignments are important tasks in protein structure-function research. While many programs exist for individual aspects of such work, there is a need for interactive visualization tools that: (a) provide a deep integration of sequence and structure, far beyond mapping where a sequence region falls in the structure and vice versa; (b) facilitate changing data of one type based on the other (for example, using only sequence-conserved residues to match structures, or adjusting a sequence alignment based on spatial fit); (c) can be used with a researcher's own data, including arbitrary sequence alignments and annotations, closely or distantly related sets of proteins, etc.; and (d) interoperate with each other and with a full complement of molecular graphics features. We describe enhancements to UCSF Chimera to achieve these goals. Results: The molecular graphics program UCSF Chimera includes a suite of tools for interactive analyses of sequences and structures. Structures automatically associate with sequences in imported alignments, allowing many kinds of crosstalk. A novel method is provided to superimpose structures in the absence of a pre-existing sequence alignment. The method uses both sequence and secondary structure, and can match even structures with very low sequence identity. Another tool constructs structure-based sequence alignments from superpositions of two or more proteins. Chimera is designed to be extensible, and mechanisms for incorporating user-specific data without Chimera code development are also provided. Conclusion: The tools described here apply to many problems involving comparison and analysis of protein structures and their sequences. Chimera includes complete documentation and is intended for use by a wide range of scientists, not just those in the computational disciplines. UCSF Chimera is free for non-commercial use and is available for Microsoft Windows, Apple Mac OS X, Linux, and other platforms from http://www.cgl.ucsf.edu/chimera. © 2006 Meng et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Couch G.S."
                    },
                    {
                        "name": "Ferrin T.E."
                    },
                    {
                        "name": "Huang C.C."
                    },
                    {
                        "name": "Meng E.C."
                    },
                    {
                        "name": "Pettersen E.F."
                    }
                ],
                "citationCount": 376,
                "date": "2006-07-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Tools for integrated sequence-structure analysis with UCSF Chimera"
            },
            "pmid": "16836757"
        },
        {
            "doi": "10.1002/jcc.20084",
            "metadata": {
                "abstract": "The design, implementation, and capabilities of an extensible visualization system, UCSF Chimera, are discussed. Chimera is segmented into a core that provides basic services and visualization, and extensions that provide most higher level functionality. This architecture ensures that the extension mechanism satisfies the demands of outside developers who wish to incorporate new features, Two unusual extensions are presented: Multiscale, which adds the ability to visualize large-scale molecular assemblies such as viral coats, and Collaboratory, which allows researchers to share a Chimera session interactively despite being at separate locales. Other extensions include Multalign Viewer, for showing multiple sequence alignments and associated structures; ViewDock, for screening docked ligand orientations; Movie, for replaying molecular dynamics trajectories; and Volume Viewer, for display and analysis of volumetric data. A discussion of the usage of Chimera in real-world situations is given, along with anticipated future directions. Chimera includes full user documentation, is free to academic and nonprofit users, and is available for Microsoft Windows, Linux, Apple Mac OS X, SGI IRIX, and HP Tru64 Unix from http://www.cgl.ucsf.edu/chimera/. © 2004 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Couch G.S."
                    },
                    {
                        "name": "Ferrin T.E."
                    },
                    {
                        "name": "Goddard T.D."
                    },
                    {
                        "name": "Greenblatt D.M."
                    },
                    {
                        "name": "Huang C.C."
                    },
                    {
                        "name": "Meng E.C."
                    },
                    {
                        "name": "Pettersen E.F."
                    }
                ],
                "citationCount": 25637,
                "date": "2004-10-01T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "UCSF Chimera - A visualization system for exploratory research and analysis"
            },
            "pmid": "15264254",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1016/j.str.2005.01.006",
            "metadata": {
                "abstract": "Many structures of large molecular assemblies such as virus capsids and ribosomes have been experimentally determined to atomic resolution. We consider four software problems that arise in interactive visualization and analysis of large assemblies: how to represent multimers efficiently, how to make cartoon representations, how to calculate contacts efficiently, and how to select subassemblies. We describe techniques and algorithms we have developed and give examples of their use. Existing molecular visualization programs work well for single protein and nucleic acid molecules and for small complexes. The methods presented here are proposed as features to add to existing programs or include in next-generation visualization software to allow easy exploration of assemblies containing tens to thousands of macromolecules. Our approach is pragmatic, emphasizing simplicity of code, reliability, and speed. The methods described have been distributed as the Multiscale extension of the UCSF Chimera (www.cgl.ucsf.edu/chimera) molecular graphics program. © 2005 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Ferrin T.E."
                    },
                    {
                        "name": "Goddard T.D."
                    },
                    {
                        "name": "Huang C.C."
                    }
                ],
                "citationCount": 153,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Structure",
                "title": "Software extensions to UCSF chimera for interactive visualization of large molecular assemblies"
            },
            "pmid": "15766548",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1,
    "version": [
        "1.10"
    ]
}
