{
    "additionDate": "2017-12-18T00:06:26Z",
    "biotoolsCURIE": "biotools:famfetch",
    "biotoolsID": "famfetch",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://raweb.inria.fr/rapportsactivite/RA2008/helix/uid20.html"
        }
    ],
    "description": "FamFetch is the general interface used to query the families databases developed using the HOBACGEN model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://pbil.univ-lyon1.fr/software/famfetch.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/famfetch-2-0-search-tree-patterns-databases-phylogenetic-trees.html"
        }
    ],
    "name": "FamFetch",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bti325",
            "metadata": {
                "abstract": "Motivation: Comparative sequence analysis is widely used to study genome function and evolution. This approach first requires the identification of homologous genes and then the interpretation of their homology relationships (orthology or paralogy). To provide help in this complex task, we developed three databases of homologous genes containing sequences, multiple alignments and phylogenetic trees: HOBACGEN, HOVERGEN and HOGENOM. In this paper, we present two new tools for automating the search for orthologs or paralogs in these databases. Results: First, we have developed and implemented an algorithm to infer speciation and duplication events by comparison of gene and species trees (tree reconciliation). Second, we have developed a general method to search in our databases the gene families for which the tree topology matches a peculiar tree pattern. This algorithm of unordered tree pattern matching has been implemented in the FamFetch graphical interface. With the help of a graphical editor, the user can specify the topology of the tree pattern, and set constraints on its nodes and leaves. Then, this pattern is compared with all the phylogenetic trees of the database, to retrieve the families in which one or several occurrences of this pattern are found. By specifying ad hoc patterns, it is therefore possible to identify orthologs in our databases. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Dufayard J.-F."
                    },
                    {
                        "name": "Duret L."
                    },
                    {
                        "name": "Penel S."
                    },
                    {
                        "name": "Gouy M."
                    },
                    {
                        "name": "Rechenmann F."
                    },
                    {
                        "name": "Perriere G."
                    }
                ],
                "citationCount": 109,
                "date": "2005-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Tree pattern matching in phylogenetic trees: Automatic search for orthologs or paralogs in homologous gene sequence databases"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Databases",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}