{
    "additionDate": "2017-02-10T14:13:57Z",
    "biotoolsCURIE": "biotools:pkd",
    "biotoolsID": "pkd",
    "description": "This tool takes as input a protein structure and allows you to redesign the protein pKa value for that molecule. The server calculates a set of point mutations that will cause the desired pKa change.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Protein pH-dependent property calculation",
                    "uri": "http://edamontology.org/operation_0400"
                }
            ]
        }
    ],
    "homepage": "http://enzyme.ucd.ie/cgi-bin/pKD/server_start.cgi",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "pKD",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The pKa values in proteins govern the pH-dependence of protein stability and enzymatic activity. A large number of mutagenesis experiments have been carried out in the last three decades to re-engineer the pH-activity and pH-stability profile of enzymes and proteins. We have developed the pKD webserver (http://polymerase.ucd.ie/ pKa_Design), which predicts sets of point mutations that will change the pKa values of a set of target residues in a given direction, thus allowing for targeted re-design of the pH-dependent characteristics of proteins. The server provides the user with an interactive experience for re-designing pKa values by pre-calculating ΔpKa values from all feasible point mutations. Design solutions are found in less than 10 min for a typical design job for a medium-sized protein. Mutant ΔpKa values calculated by the pKD web server are in close agreement with those produced by comparing results from full-fledged pKa calculation methods. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Tynan-Connolly B.M."
                    },
                    {
                        "name": "Nielsen J.E."
                    }
                ],
                "citationCount": 29,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "pKD: Re-designing protein pKa values"
            },
            "pmid": "16845054"
        },
        {
            "metadata": {
                "abstract": "pKa calculation methods that are based on finite difference solutions to the Poisson-Boltzmann equation (FDPB) require that energy calculations be performed for a large number of different protonation states of the protein. Normally, the differences between these protonation states are modeled by changing the charges on a few atoms, sometimes the differences are modeled by adding or removing hydrogens, and in a few cases the positions of these hydrogens are optimized locally. We present an FDPB-based pKa calculation method in which the hydrogen-bond network is globally optimized for every single protonation state used. This global optimization gives a significant improvement in the accuracy of calculated pKa values, especially for buried residues. It is also shown that large errors in calculated pKa values are often due to structural artifacts induced by crystal packing. Optimization of the force fields and parameters used in pKa calculations should therefore be performed with X-ray structures that are corrected for crystal artifacts. © 2001 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Nielsen J.E."
                    },
                    {
                        "name": "Vriend G."
                    }
                ],
                "citationCount": 178,
                "date": "2001-06-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Optimizing the hydrogen-bond network in poisson-boltzmann equation-based pKa calculations"
            },
            "pmid": "11340657"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}