{
    "additionDate": "2017-01-17T14:50:24Z",
    "biotoolsCURIE": "biotools:massypup",
    "biotoolsID": "massypup",
    "collectionID": [
        "Proteomics",
        "ms-utils"
    ],
    "credit": [
        {
            "email": "robert.winkler@ira.cinvestav.mx",
            "name": "Robert Winkler",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "description": "A lightweight Linux live distribution prepackaged with a wide range of tools for MS and MS/MS data analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.lababi.bioprocess.org/index.php/14-sample-data-articles/78-massypup"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "mzML",
                            "uri": "http://edamontology.org/format_3244"
                        },
                        {
                            "term": "mzXML",
                            "uri": "http://edamontology.org/format_3654"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                }
            ]
        }
    ],
    "homepage": "http://www.bioprocess.org/massypup",
    "language": [
        "Java",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2024-11-25T14:14:16.375579Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "name": "MASSyPup",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "msutils_import",
    "publication": [
        {
            "doi": "10.7717/peerj.1401",
            "metadata": {
                "abstract": "In biological mass spectrometry, crude instrumental data need to be converted into meaningful theoretical models. Several data processing and data evaluation steps are required to come to the final results. These operations are often difficult to reproduce, because of too specific computing platforms. This effect, known as 'workflow decay', can be diminished by using a standardized informatic infrastructure. Thus, we compiled an integrated platform, which contains ready-to-use tools and workflows for mass spectrometry data analysis. Apart from general unit operations, such as peak picking and identification of proteins and metabolites, we put a strong emphasis on the statistical validation of results and Data Mining. MASSyPup64 includes e.g., the OpenMS/TOPPAS framework, the Trans-Proteomic-Pipeline programs, the ProteoWizard tools, X!Tandem, Comet and SpiderMass. The statistical computing language R is installed with packages for MS data analyses, such as XCMS/metaXCMS andMetabR. The R package Rattle provides a user-friendly access to multiple Data Mining methods. Further, we added the non-conventional spreadsheet program teapot for editing large data sets and a command line tool for transposing large matrices. Individual programs, console commands and modules can be integrated using the Workflow Management System (WMS) taverna. We explain the useful combination of the tools by practical examples: (1) A workflow for protein identification and validation, with subsequent Association Analysis of peptides, (2) Cluster analysis and Data Mining in targeted Metabolomics, and (3) Raw data processing, Data Mining and identification of metabolites in untargeted Metabolomics. Association Analyses reveal relationships between variables across different sample sets. We present its application for finding co-occurring peptides, which can be used for target proteomics, the discovery of alternative biomarkers and protein-protein interactions. DataMining derived models displayed a higher robustness and accuracy for classifying sample groups in targeted Metabolomics than cluster analyses. Random Forest models do not only provide predictive models, which can be deployed for new data sets, but also the variable importance. We demonstrate that the later is especially useful for tracking down significant signals and affected pathways in untargeted Metabolomics. Thus, Random Forest modeling supports the unbiased search for relevant biological features inMetabolomics. Our results clearly manifest the importance of Data Mining methods to disclose non-obvious information in biological mass spectrometry . The application of aWorkflowManagement System and the integration of all required programs and data in a consistent platformmakes the presented data analyses strategies reproducible for non-expert users. The simple remastering process and the Open Source licenses of MASSyPup64 (http://www. bioprocess.org/massypup/) enable the continuous improvement of the system.",
                "authors": [
                    {
                        "name": "Winkler R."
                    }
                ],
                "citationCount": 24,
                "date": "2015-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "An evolving computational platformfor biological mass spectrometry: Workflows, statistics and data mining with MASSyPup64"
            },
            "pmcid": "PMC4655102",
            "pmid": "26618079",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
