{
    "accessibility": "Open access",
    "additionDate": "2024-05-24T10:45:53.085548Z",
    "biotoolsCURIE": "biotools:ace_elispot",
    "biotoolsID": "ace_elispot",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Alex Rubinsteyn",
            "typeEntity": "Person"
        },
        {
            "name": "Jin Seok Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "Optimizing Combinatorial Design of Pooled ELISpot Assays with an Epitope Similarity Model. ACE facilitates (1) generation of ELISpot configurations (peptide-pool assignments) using a deep learning approach to cluster similar peptides and (2) deconvolution of pool spot counts for identification of immunogenic peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pirl-unc/ace",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-05-24T10:45:53.087676Z",
    "license": "Apache-2.0",
    "name": "ACE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbad495",
            "metadata": {
                "abstract": "The enzyme-linked immunosorbent spot (ELISpot) assay is a powerful in vitro immunoassay that enables cost-effective quantification of antigen-specific T-cell reactivity. It is used widely in the context of cancer and infectious diseases to validate the immunogenicity of predicted epitopes. While technological advances have kept pace with the demand for increased throughput, efforts to increase scale are bottlenecked by current assay design and deconvolution methods, which have remained largely unchanged. Current methods for designing pooled ELISpot experiments offer limited flexibility of assay parameters, lack support for high-throughput scenarios and do not consider peptide identity during pool assignment. We introduce the ACE Configurator for ELISpot (ACE) to address these gaps. ACE generates optimized peptide-pool assignments from highly customizable user inputs and handles the deconvolution of positive peptides using assay readouts. In this study, we present a novel sequence-aware pooling strategy, powered by a fine-tuned ESM-2 model that groups immunologically similar peptides, reducing the number of false positives and subsequent confirmatory assays compared to existing combinatorial approaches. To validate ACE’s performance on real-world datasets, we conducted a comprehensive benchmark study, contextualizing design choices with their impact on prediction quality. Our results demonstrate ACE’s capacity to further increase precision of identified immunogenic peptides, directly optimizing experimental efficiency. ACE is freely available as an executable with a graphical user interface and command-line interfaces at https://github.com/pirl-unc/ace.",
                "authors": [
                    {
                        "name": "Fini M."
                    },
                    {
                        "name": "Karthikeyan D."
                    },
                    {
                        "name": "Lee J.S."
                    },
                    {
                        "name": "Rubinsteyn A."
                    },
                    {
                        "name": "Vincent B.G."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "ACE configurator for ELISpot: optimizing combinatorial design of pooled ELISpot assays with an epitope similarity model"
            },
            "pmcid": "PMC10768796",
            "pmid": "38180831"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
