{
    "additionDate": "2020-01-14T08:59:54Z",
    "biotoolsCURIE": "biotools:scafSLICR",
    "biotoolsID": "scafSLICR",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "wgrayson@jhmi.edu",
            "name": "Warren Grayson",
            "orcidid": "https://orcid.org/0000-0001-6099-6469",
            "typeEntity": "Person"
        }
    ],
    "description": "A MATLAB-based slicing algorithm to enable 3D-printing of tissue engineering scaffolds with heterogeneous porous microarchitecture.\n\nversion 1.0.2 (15.4 MB) by Ethan Nyberg.\n\nPrepares GCODE files to 3D-Print Porous Shapes.\n\nChoose a web site to get translated content where available and see local events and offers. Based on your location, we recommend that you select:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://www.mathworks.com/matlabcentral/fileexchange/72856-scafslicr",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-01-14T08:59:54Z",
    "name": "scafSLICR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0225007",
            "metadata": {
                "abstract": "© 2019 Nyberg et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.3D-printing is a powerful manufacturing tool that can create precise microscale architectures across macroscale geometries. Within biomedical research, 3D-printing of various materials has been used to fabricate rigid scaffolds for cell and tissue engineering constructs with precise microarchitecture to direct cell behavior and macroscale geometry provides patient specificity. While 3D-printing hardware has become low-cost due to modeling and rapid prototyping applications, there is no common paradigm or platform for the controlled design and manufacture of 3D-printed constructs for tissue engineering. Specifically, controlling the tissue engineering features of pore size, porosity, and pore arrangement is difficult using currently available software. We have developed a MATLAB approach termed scafSLICR to design and manufacture tissue-engineered scaffolds with precise microarchitecture and with simple options to enable spatially patterned pore properties. Using scafSLICR, we designed, manufactured, and characterized porous scaffolds in acrylonitrile butadiene styrene with a variety of pore sizes, porosities, and gradients. We found that transitions between different porous regions maintained an open, connected porous network without compromising mechanical integrity. Further, we demonstrated the usefulness of scafSLICR in patterning different porous designs throughout large anatomic shapes and in preparing craniofacial tissue engineering bone scaffolds. Finally, scafSLICR is distributed as open-source MATLAB scripts and as a stand-alone graphical interface.",
                "authors": [
                    {
                        "name": "Nyberg E."
                    },
                    {
                        "name": "O'Sullivan A."
                    },
                    {
                        "name": "Grayson W."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "ScafSlicr: A MATLAB-based slicing algorithm to enable 3D-printing of tissue engineering scaffolds with heterogeneous porous microarchitecture"
            },
            "pmcid": "PMC6863524",
            "pmid": "31743350"
        }
    ],
    "topic": [
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}