{
    "additionDate": "2017-08-03T18:54:26Z",
    "biotoolsCURIE": "biotools:popisk",
    "biotoolsID": "popisk",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://140.113.239.45/POPISK/develop.php"
        }
    ],
    "description": "Support vector machine and weighted degree string kernel to predict immunogenicity of HLA-A2 binding peptides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://140.113.239.45/POPISK/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://140.113.239.45/POPISK/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/popisk-t-cell-reactivity-prediction-using-support-vector-machines-and-string-kernels.html"
        }
    ],
    "name": "POPISK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Accurate prediction of peptide immunogenicity and characterization of relation between peptide sequences and peptide immunogenicity will be greatly helpful for vaccine designs and understanding of the immune system. In contrast to the prediction of antigen processing and presentation pathway, the prediction of subsequent T-cell reactivity is a much harder topic. Previous studies of identifying T-cell receptor (TCR) recognition positions were based on small-scale analyses using only a few peptides and concluded different recognition positions such as positions 4, 6 and 8 of peptides with length 9. Large-scale analyses are necessary to better characterize the effect of peptide sequence variations on T-cell reactivity and design predictors of a peptide's T-cell reactivity (and thus immunogenicity). The identification and characterization of important positions influencing T-cell reactivity will provide insights into the underlying mechanism of immunogenicity.Results: This work establishes a large dataset by collecting immunogenicity data from three major immunology databases. In order to consider the effect of MHC restriction, peptides are classified by their associated MHC alleles. Subsequently, a computational method (named POPISK) using support vector machine with a weighted degree string kernel is proposed to predict T-cell reactivity and identify important recognition positions. POPISK yields a mean 10-fold cross-validation accuracy of 68% in predicting T-cell reactivity of HLA-A2-binding peptides. POPISK is capable of predicting immunogenicity with scores that can also correctly predict the change in T-cell reactivity related to point mutations in epitopes reported in previous studies using crystal structures. Thorough analyses of the prediction results identify the important positions 4, 6, 8 and 9, and yield insights into the molecular basis for TCR recognition. Finally, we relate this finding to physicochemical properties and structural features of the MHC-peptide-TCR interaction.Conclusions: A computational method POPISK is proposed to predict immunogenicity with scores which are useful for predicting immunogenicity changes made by single-residue modifications. The web server of POPISK is freely available at http://iclab.life.nctu.edu.tw/POPISK. © 2011 Tung et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Tung C.-W."
                    },
                    {
                        "name": "Ziehm M."
                    },
                    {
                        "name": "Kamper A."
                    },
                    {
                        "name": "Kohlbacher O."
                    },
                    {
                        "name": "Ho S.-Y."
                    }
                ],
                "citationCount": 49,
                "date": "2011-11-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "POPISK: T-cell reactivity prediction using support vector machines and string kernels"
            },
            "pmid": "22085524"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        }
    ],
    "validated": 1
}