{
    "name": "TruHmm", 
    "description": "Reference based transcriptome assembler for prokaryotes, suitable for assembling transcripts for directional RNA-seq library.", 
    "homepage": "http://bioinfolab.uncc.edu/TruHmm_package/", 
    "biotoolsID": "truhmm", 
    "biotoolsCURIE": "biotools:truhmm", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0310", 
                    "term": "Sequence assembly"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3308", 
            "term": "Transcriptome"
        }, 
        {
            "uri": "http://edamontology.org/topic_0099", 
            "term": "RNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0196", 
            "term": "Assembly"
        }, 
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-seq"
        }, 
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-seq"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Transcription"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows"
    ], 
    "language": [
        "C++", 
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/truhmm-trancription-unit-assembly-by-a-hidden-markov-model.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1186/1471-2164-14-520", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Directional RNA-seq reveals highly complex condition-dependent transcriptomes in E. coli K12 through accurate full-length transcripts assembling", 
                "abstract": "Background: Although prokaryotic gene transcription has been studied over decades, many aspects of the process remain poorly understood. Particularly, recent studies have revealed that transcriptomes in many prokaryotes are far more complex than previously thought. Genes in an operon are often alternatively and dynamically transcribed under different conditions, and a large portion of genes and intergenic regions have antisense RNA (asRNA) and non-coding RNA (ncRNA) transcripts, respectively. Ironically, similar studies have not been conducted in the model bacterium E coli K12, thus it is unknown whether or not the bacterium possesses similar complex transcriptomes. Furthermore, although RNA-seq becomes the major method for analyzing the complexity of prokaryotic transcriptome, it is still a challenging task to accurately assemble full length transcripts using short RNA-seq reads.Results: To fill these gaps, we have profiled the transcriptomes of E. coli K12 under different culture conditions and growth phases using a highly specific directional RNA-seq technique that can capture various types of transcripts in the bacterial cells, combined with a highly accurate and robust algorithm and tool TruHMM (http://bioinfolab.uncc.edu/TruHmm_package/) for assembling full length transcripts. We found that 46.9 ~ 63.4% of expressed operons were utilized in their putative alternative forms, 72.23 ~ 89.54% genes had putative asRNA transcripts and 51.37 ~ 72.74% intergenic regions had putative ncRNA transcripts under different culture conditions and growth phases.Conclusions: As has been demonstrated in many other prokaryotes, E. coli K12 also has a highly complex and dynamic transcriptomes under different culture conditions and growth phases. Such complex and dynamic transcriptomes might play important roles in the physiology of the bacterium. TruHMM is a highly accurate and robust algorithm for assembling full-length transcripts in prokaryotes using directional RNA-seq short reads. © 2013 Li et al.; licensee BioMed Central Ltd.", 
                "date": "2013-07-30T00:00:00Z", 
                "citationCount": 21, 
                "authors": [
                    {
                        "name": "Li S."
                    }, 
                    {
                        "name": "Dong X."
                    }, 
                    {
                        "name": "Su Z."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://sulab.uncc.edu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:13:52Z", 
    "lastUpdate": "2018-12-10T12:58:58Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}