{
    "additionDate": "2019-11-14T18:38:50Z",
    "biotoolsCURIE": "biotools:FAERS",
    "biotoolsID": "FAERS",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "jing14@upenn.edu",
            "name": "Jing Huang",
            "typeEntity": "Person"
        },
        {
            "email": "cui.tao@uth.tmc.edu",
            "name": "Cui Tao",
            "typeEntity": "Person"
        },
        {
            "email": "ychen123@upenn.edu",
            "name": "Yong Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'hepatitis', 'FAERS EHR', 'post-market', 'safety' | Comparing drug safety of hepatitis C therapies using post-market data | FAERS Quarterly Data Extract Files | U.S. Department of Health and Human Services | FDA Adverse Event Reporting System (FAERS) Quarterly Data Extract Files | A simple search of FAERS data cannot be performed with these files by persons who are not familiar with creation of relational databases. However, you can get a summary FAERS report for a product by sending a Freedom of Information Act (FOIA) request to FDA. You can also request individual case reports by submitting a FOIA request listing case report numbers",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://fis.fda.gov/extensions/FPD-QDE-FAERS/FPD-QDE-FAERS.html",
    "lastUpdate": "2019-11-14T18:38:50Z",
    "name": "FAERS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0860-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Hepatitis C affects about 3 % of the world's population. In the United States, about 3.5 million have chronic hepatitis C, and it is the leading cause of liver cancer and the most common indication for liver transplantation. In the last decades, new advances in therapy have substantially increased the cure rate of hepatitis C to more than 95% with the use of antiviral agents. However, drug safety of the new treatments remains one of the major concerns. Data from the US Food and Drug Administration (FDA) Adverse Event Reporting System (FAERS) and the Electronic Health Record (EHR) systems provide crucial post-market information to evaluate drug safety. Currently, quantitative evidence of drug safety of hepatitis C treatments based on post-market data are still limited, and there is also a lack of a standard statistical procedure to systematically compare drug safety across multiple drugs using FAERS and EHR. Method: In this study, we presented a statistical procedure to compare the difference in adverse events (AE) across multiple hepatitis C drugs using data from FAERS and EHR, and to assess the consistency of results from two data bases. Through three major steps, including descriptive comparison, testing for difference among groups, and quantification of association, the proposed method can provide a quantitative comparison on safety of multiple drugs. Specifically, we compared drugs that were approved by FDA to treat hepatitis C before 2011versus those approved after 2013. We used spontaneous AE reports submitted between 2004 to 2015 from FAERS data base and medical records between 1999 to 2015 from the Cerner health facts data base to estimate and compare the rate of AE after drug use. Result: We studied 30 most frequently reported AEs after treatment of hepatitis C, comparing the difference between drugs approved before 2011versus those approved after 2013. Our results showed that there was difference in rate of AE between the two groups of treatment. We reported the AEs that have significant statistical difference, and estimate the difference attributable to variation of age and gender between the two groups of drug users. Our findings are consistent with results in existing literature. Moreover, we compared the results obtained from FAERS data and EHR data, and evaluated the consistency of evidence. Conclusion: The proposed procedure is a general and standardized pipeline that can be used to compare and visualize drug safety among multiple drugs to support regulatory decision-makings using post-market data. We showed that there was statistically significant difference in AE rates between the new and old therapies for hepatitis C. We showed that both FAERS and EHR contained large information for research of post-market drug safety, but each has its own strength and limitations. Cautions should be taken when combining evidence from the two data resources and there is a need of more sophisticated informatics and statistical tools for evidence synthesis.",
                "authors": [
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Tong J."
                    },
                    {
                        "name": "Du J."
                    },
                    {
                        "name": "Duan R."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Moore J.H."
                    },
                    {
                        "name": "Tao C."
                    },
                    {
                        "name": "Chen Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-08T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "Comparing drug safety of hepatitis C therapies using post-market data"
            },
            "pmcid": "PMC6686214",
            "pmid": "31391106"
        }
    ],
    "topic": [
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}