{
    "additionDate": "2017-12-18T00:14:57Z",
    "biotoolsCURIE": "biotools:iassembler",
    "biotoolsID": "iassembler",
    "credit": [
        {
            "email": "bioinfo@cornell.edu",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.bti.cornell.edu/"
        }
    ],
    "description": "Standalone package to assemble ESTs generated using Sanger and/or Roche-454 pyrosequencing technologies into contigs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.bti.cornell.edu/tool/iAssembler/#introduction"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.bti.cornell.edu/tool/iAssembler/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/iassembler-1-3-2-de-novo-assembly-roche-454sanger-transcriptome-sequences.html"
        }
    ],
    "name": "iAssembler",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-453",
            "metadata": {
                "abstract": "Background: Expressed Sequence Tags (ESTs) have played significant roles in gene discovery and gene functional analysis, especially for non-model organisms. For organisms with no full genome sequences available, ESTs are normally assembled into longer consensus sequences for further downstream analysis. However current de novo EST assembly programs often generate large number of assembly errors that will negatively affect the downstream analysis. In order to generate more accurate consensus sequences from ESTs, tools are needed to reduce or eliminate errors from de novo assemblies.Results: We present iAssembler, a pipeline that can assemble large-scale ESTs into consensus sequences with significantly higher accuracy than current existing assemblers. iAssembler employs MIRA and CAP3 assemblers to generate initial assemblies, followed by identifying and correcting two common types of transcriptome assembly errors: 1) ESTs from different transcripts (mainly alternatively spliced transcripts or paralogs) are incorrectly assembled into same contigs; and 2) ESTs from same transcripts fail to be assembled together. iAssembler can be used to assemble ESTs generated using the traditional Sanger method and/or the Roche-454 massive parallel pyrosequencing technology.Conclusion: We compared performances of iAssembler and several other de novo EST assembly programs using both Roche-454 and Sanger EST datasets. It demonstrated that iAssembler generated significantly more accurate consensus sequences than other assembly programs. © 2011 Zheng et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Zheng Y."
                    },
                    {
                        "name": "Zhao L."
                    },
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Fei Z."
                    }
                ],
                "citationCount": 104,
                "date": "2011-11-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IAssembler: A package for de novo assembly of Roche-454/Sanger transcriptome sequences"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcriptome",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": [
        "1.3.2"
    ]
}