
{
    "credit": [
        {
            "email": "liuhl3000@163.com",
            "name": "Honglei Liu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://crispr-era.stanford.edu/help.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene regulation",
                "uri": "http://edamontology.org/topic_0204"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press.Summary: The CRISPR/Cas9 system was recently developed as a powerful and flexible technology for targeted genome engineering, including genome editing (altering the genetic sequence) and gene regulation (without altering the genetic sequence). These applications require the design of single guide RNAs (sgRNAs) that are efficient and specific. However, this remains challenging, as it requires the consideration of many criteria. Several sgRNA design tools have been developed for gene editing, but currently there is no tool for the design of sgRNAs for gene regulation. With accumulating experimental data on the use of CRISPR/Cas9 for gene editing and regulation, we implement a comprehensive computational tool based on a set of sgRNA design rules summarized from these published reports. We report a genome-wide sgRNA design tool and provide an online website for predicting sgRNAs that are efficient and specific. We name the tool CRISPR-ERA, for clustered regularly interspaced short palindromic repeat-mediated editing, repression, and activation (ERA). Availability and implementation: http://CRISPR-ERA.stanford.edu.",
            "authors": [
                "Liu H.",
                "Wei Z.",
                "Dominguez A.",
                "Li Y.",
                "Wang X.",
                "Qi L.S."
            ],
            "cit_count": 52,
            "doi": "10.1093/bioinformatics/btv423",
            "journal": "Bioinformatics",
            "title": "CRISPR-ERA: A comprehensive design tool for CRISPR-mediated gene editing, repression and activation",
            "type": "Primary",
            "year": "2015-05-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:CRISPR-ERA",
        "biotoolsID": "CRISPR-ERA",
        "description": "Design tool for CRISPR-mediated gene editing, repression and activation.",
        "homepage": "http://crispr-era.stanford.edu/",
        "name": "CRISPR-ERA"
    }
}