{
    "additionDate": "2020-01-14T20:01:00Z",
    "biotoolsCURIE": "biotools:FCM-m",
    "biotoolsID": "FCM-m",
    "confidence_flag": "medium",
    "description": "Optical classification of inland waters based on an improved Fuzzy C-Means method.\n\nWater optical clustering based on water color information is important for many ecological and environmental application studies, both regionally and globally. The fuzzy clustering method avoids the sharp boundaries in type-memberships produced by hard clustering methods, and thus presents its advantages. However, to make good use of the fuzzy clustering methods on water color spectra data sets, the determination of the fuzzifier parameter (m) of FCM (fuzzy c-means) is the key factor. Usually, the m is set to 2 by default. Unfortunately, this method assigned some membership degrees to non-belonging water type, failing to obtain the unitarity of cluster structure in some cases, especially in inland eutrophic water.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'bishun945'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31878664",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T20:01:00Z",
    "name": "FCM-m",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1364/OE.27.034838",
            "metadata": {
                "abstract": "© 2019 Optical Society of America under the terms of the OSA Open Access Publishing AgreementWater optical clustering based on water color information is important for many ecological and environmental application studies, both regionally and globally. The fuzzy clustering method avoids the sharp boundaries in type-memberships produced by hard clustering methods, and thus presents its advantages. However, to make good use of the fuzzy clustering methods on water color spectra data sets, the determination of the fuzzifier parameter (m) of FCM (fuzzy c-means) is the key factor. Usually, the m is set to 2 by default. Unfortunately, this method assigned some membership degrees to non-belonging water type, failing to obtain the unitarity of cluster structure in some cases, especially in inland eutrophic water. To overcome this shortcoming, we proposed an improved FCM method (namely FCM-m) for water color spectra classification by optimizing the fuzzifier parameter. We collected an inland data set containing 1280 in situ spectral data and co-measured water quality parameters with a wide range of biogeochemical variability in China. Using FCM-m, seven spectrally distinct water optical clusters on Sentinel-3 OLCI (Ocean and Land Colour Imager) bands were obtained with the optimized fuzzifier (m=1.36), and the well-performed clustering result is assessed by the validated index (Fuzzy Silhouette Index=0.513). Also, the FCM-m-based soft classification framework was successfully applied to the atmospherically corrected OLCI images, which was evaluated by previous case studies. Besides, by testing FCM-m on three coastal and oceanic data sets, we verified that the optimized m should be adjusted based on the data set itself, and in general, the value gradually approaches 1 with the increase of the band number (or dimension). Finally, the effect of the improved method was tested by Chlorophyll-a concentration estimation. The results show that the algorithm blending by FCM-m performs better than that by original FCM, which is mainly because the FCM-m reduces the estimation error from non-belonging clusters by a stricter membership value assignation. To sum up, we believe that FCM-m is an adaptive algorithm, whose R codes are available at https://github.com/bishun945, and needs to be tested by more public data sets.",
                "authors": [
                    {
                        "name": "Bi S."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Song K."
                    },
                    {
                        "name": "Mu M."
                    },
                    {
                        "name": "Lyu H."
                    },
                    {
                        "name": "Miao S."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "date": "2019-11-25T00:00:00Z",
                "journal": "Optics Express",
                "title": "Optical classification of inland waters based on an improved Fuzzy C-Means method"
            },
            "pmid": "31878664"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}