{
    "name": "SGP2", 
    "description": "Program to predict genes by comparing anonymous genomic sequences from different species. It combines tblastx, a sequence similarity search program, with geneid, an ab initio gene prediction program.", 
    "homepage": "http://big.crg.cat/services/sgp2", 
    "biotoolsID": "sgp2", 
    "biotoolsCURIE": "biotools:sgp2", 
    "version": [
        "1.1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0362", 
                    "term": "Genome annotation"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2977", 
                        "term": "Nucleic acid sequence"
                    }, 
                    "format": []
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_1276", 
                        "term": "Nucleic acid features"
                    }, 
                    "format": []
                }
            ], 
            "note": "sgp2 is a program to predict genes by comparing anonymous genomic sequences from two different species. It combines tblastx, a sequence similarity search program, with geneid, an \"ab initio\" gene prediction program. In \"assymetric\" mode, genes are predicted in one sequence from one species (the target sequence), using a set of sequences (maybe only one) from the other species (the reference set). Essentially, geneid is used to predict all potential exons along the target sequence. Scores of exons are computed as log-likelihood ratios, function of the splice sites defining the exon, the coding bias in composition of the exon sequence as measured by a Markov Model of order five, and of the optimal alignment at the amino acid level between the target exon sequence and the counterpart homologous sequence in the reference set. From the set of predicted exons, the gene structure is assembled (eventually multiple genes in both strands) maximizing the sum of the scores of the assembled exons.", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3511", 
            "term": "Nucleic acid sites, features and motifs"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": "GPL-3.0", 
    "collectionID": [], 
    "maturity": null, 
    "cost": "Free of charge", 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "ftp://genome.crg.es/pub/software/sgp2/sgp2_v1.1.May_8_2012.tar.gz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://genome.crg.es/software/sgp2/index.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1101/gr.871403", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Comparative gene prediction in human and mouse.", 
                "abstract": "The completion of the sequencing of the mouse genome promises to help predict human genes with greater accuracy. While current ab initio gene prediction programs are remarkably sensitive (i.e., they predict at least a fragment of most genes), their specificity is often low, predicting a large number of false-positive genes in the human genome. Sequence conservation at the protein level with the mouse genome can help eliminate some of those false positives. Here we describe SGP2, a gene prediction program that combines ab initio gene prediction with TBLASTX searches between two genome sequences to provide both sensitive and specific gene predictions. The accuracy of SGP2 when used to predict genes by comparing the human and mouse genomes is assessed on a number of data sets, including single-gene data sets, the highly curated human chromosome 22 predictions, and entire genome predictions from ENSEMBL. Results indicate that SGP2 outperforms purely ab initio gene prediction methods. Results also indicate that SGP2 works about as well with 3x shotgun data as it does with fully assembled genomes. SGP2 provides a high enough specificity that its predictions can be experimentally verified at a reasonable cost. SGP2 was used to generate a complete set of gene predictions on both the human and mouse by comparing the genomes of these two species. Our results suggest that another few thousand human and mouse genes currently not in ENSEMBL are worth verifying experimentally.", 
                "date": "2003-01-01T00:00:00Z", 
                "citationCount": 153, 
                "authors": [
                    {
                        "name": "Parra G."
                    }, 
                    {
                        "name": "Agarwal P."
                    }, 
                    {
                        "name": "Abril J.F."
                    }, 
                    {
                        "name": "Wiehe T."
                    }, 
                    {
                        "name": "Fickett J.W."
                    }, 
                    {
                        "name": "Guigo R."
                    }
                ], 
                "journal": "Genome research"
            }
        }, 
        {
            "doi": "10.1073/pnas.0337561100", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Comparison of mouse and human genomes followed by experimental verification yields an estimated 1,019 additional genes", 
                "abstract": "A primary motivation for sequencing the mouse genome was to accelerate the discovery of mammalian genes by using sequence conservation between mouse and human to identify coding exons. Achieving this goal proved challenging because of the large proportion of the mouse and human genomes that is apparently conserved but apparently does not code for protein. We developed a two-stage procedure that exploits the mouse and human genome sequences to produce a set of genes with a much higher rate of experimental verification than previously reported prediction methods. RT-PCR amplification and direct sequencing applied to an initial sample of mouse predictions that do not overlap previously known genes verified the regions flanking one intron in 139 predictions, with verification rates reaching 76%. On average, the confirmed predictions show more restricted expression patterns than the mouse orthologs of known human genes, and two-thirds lack homologs in fish genomes, demonstrating the sensitivity of this dual-genome approach to hard-to-find genes. We verified 112 previously unknown homologs of known proteins, including two homeobox proteins relevant to developmental biology, an aquaporin, and a homolog of dystrophin. We estimate that transcription and splicing can be verified for >1,000 gene predictions identified by this method that do not overlap known genes. This is likely to constitute a significant fraction of the previously unknown, multiexon mammalian genes.", 
                "date": "2003-02-04T00:00:00Z", 
                "citationCount": 83, 
                "authors": [
                    {
                        "name": "Guigo R."
                    }, 
                    {
                        "name": "Dermitzakis E.T."
                    }, 
                    {
                        "name": "Agarwal P."
                    }, 
                    {
                        "name": "Ponting C.P."
                    }, 
                    {
                        "name": "Parra G."
                    }, 
                    {
                        "name": "Reymond A."
                    }, 
                    {
                        "name": "Abril J.F."
                    }, 
                    {
                        "name": "Keibler E."
                    }, 
                    {
                        "name": "Lyle R."
                    }, 
                    {
                        "name": "Ucla C."
                    }, 
                    {
                        "name": "Antonarakis S.E."
                    }, 
                    {
                        "name": "Brent M.R."
                    }
                ], 
                "journal": "Proceedings of the National Academy of Sciences of the United States of America"
            }
        }
    ], 
    "credit": [
        {
            "name": "Genis Parra", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Roderic Guigo", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Josep Abril", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Lab Roderic Guigo Group", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "crg.eu", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Francisco Camara", 
            "email": "francisco.camara@crg.eu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "francisco.camara@crg.eu", 
    "additionDate": "2016-04-22T13:31:57Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}