{
    "additionDate": "2021-11-01T11:45:25.334401Z",
    "biotoolsCURIE": "biotools:pcysmod",
    "biotoolsID": "pcysmod",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chenghan@zzu.edu.cn",
            "name": "Han Cheng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "gaox@ustc.edu.cn",
            "name": "Xinjiao Gao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "wangjc@qibebt.ac.cn",
            "name": "Jichao Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "pCysMod is a tool for the prediction of multiple cysteine modification based on deep learning framework. Protein cysteine modifications mainly include thiol oxidation and palmitoylation of thioesterification reaction, which lead to a cascade of biochemical reactions. There are many types of cysteine modifications mediated by thiol groups, such as S-nitrosylation, S-sulfhydration, S-sulfenylation and S-sulfinylation. Besides, S-palmitoylation is cysteine modification through thioesterification reaction. These modifications lead to a cascade of biochemical reactions, and regulate various physiological and pathological processes, such as autophagy, redox homeostasis and cell signaling, demonstrating a closely relationship with many human diseases including cancers and diabetes and so on.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Disulfide bond prediction",
                    "uri": "http://edamontology.org/operation_0471"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://pcysmod.omicsbio.info",
    "lastUpdate": "2021-11-01T11:45:25.336910Z",
    "name": "pCysMod",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FCELL.2021.617366",
            "metadata": {
                "abstract": "© Copyright © 2021 Li, Yu, Wu, Zhang, Wang, Zheng, Liu, Wang, Gao and Cheng.Thiol groups on cysteines can undergo multiple post-translational modifications (PTMs), acting as a molecular switch to maintain redox homeostasis and regulating a series of cell signaling transductions. Identification of sophistical protein cysteine modifications is crucial for dissecting its underlying regulatory mechanism. Instead of a time-consuming and labor-intensive experimental method, various computational methods have attracted intense research interest due to their convenience and low cost. Here, we developed the first comprehensive deep learning based tool pCysMod for multiple protein cysteine modification prediction, including S-nitrosylation, S-palmitoylation, S-sulfenylation, S-sulfhydration, and S-sulfinylation. Experimentally verified cysteine sites curated from literature and sites collected by other databases and predicting tools were integrated as benchmark dataset. Several protein sequence features were extracted and united into a deep learning model, and the hyperparameters were optimized by particle swarm optimization algorithms. Cross-validations indicated our model showed excellent robustness and outperformed existing tools, which was able to achieve an average AUC of 0.793, 0.807, 0.796, 0.793, and 0.876 for S-nitrosylation, S-palmitoylation, S-sulfenylation, S-sulfhydration, and S-sulfinylation, demonstrating pCysMod was stable and suitable for protein cysteine modification prediction. Besides, we constructed a comprehensive protein cysteine modification prediction web server based on this model to benefit the researches finding the potential modification sites of their interested proteins, which could be accessed at http://pcysmod.omicsbio.info. This work will undoubtedly greatly promote the study of protein cysteine modification and contribute to clarifying the biological regulation mechanisms of cysteine modification within and among the cells.",
                "authors": [
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Liu Z.-X."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Wu G."
                    },
                    {
                        "name": "Yu K."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "date": "2021-02-23T00:00:00Z",
                "journal": "Frontiers in Cell and Developmental Biology",
                "title": "pCysMod: Prediction of Multiple Cysteine Modifications Based on Deep Learning Framework"
            },
            "pmcid": "PMC7959776",
            "pmid": "33732693",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
