{
    "additionDate": "2021-01-18T07:40:10Z",
    "biotoolsCURIE": "biotools:dtranner",
    "biotoolsID": "dtranner",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jaegil@kaist.ac.kr",
            "name": "Jae-Gil Lee",
            "orcidid": "https://orcid.org/0000-0002-8711-7732",
            "typeEntity": "Person"
        }
    ],
    "description": "DTranNER is a tool for biomedical named entity recognition with deep learning-based label-label transition model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kaist-dmlab/BioNER",
    "lastUpdate": "2021-03-03T20:39:53Z",
    "name": "DTranNER",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3393-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Biomedical named-entity recognition (BioNER) is widely modeled with conditional random fields (CRF) by regarding it as a sequence labeling problem. The CRF-based methods yield structured outputs of labels by imposing connectivity between the labels. Recent studies for BioNER have reported state-of-the-art performance by combining deep learning-based models (e.g., bidirectional Long Short-Term Memory) and CRF. The deep learning-based models in the CRF-based methods are dedicated to estimating individual labels, whereas the relationships between connected labels are described as static numbers; thereby, it is not allowed to timely reflect the context in generating the most plausible label-label transitions for a given input sentence. Regardless, correctly segmenting entity mentions in biomedical texts is challenging because the biomedical terms are often descriptive and long compared with general terms. Therefore, limiting the label-label transitions as static numbers is a bottleneck in the performance improvement of BioNER. Results: We introduce DTranNER, a novel CRF-based framework incorporating a deep learning-based label-label transition model into BioNER. DTranNER uses two separate deep learning-based networks: Unary-Network and Pairwise-Network. The former is to model the input for determining individual labels, and the latter is to explore the context of the input for describing the label-label transitions. We performed experiments on five benchmark BioNER corpora. Compared with current state-of-the-art methods, DTranNER achieves the best F1-score of 84.56% beyond 84.40% on the BioCreative II gene mention (BC2GM) corpus, the best F1-score of 91.99% beyond 91.41% on the BioCreative IV chemical and drug (BC4CHEMD) corpus, the best F1-score of 94.16% beyond 93.44% on the chemical NER, the best F1-score of 87.22% beyond 86.56% on the disease NER of the BioCreative V chemical disease relation (BC5CDR) corpus, and a near-best F1-score of 88.62% on the NCBI-Disease corpus. Conclusions: Our results indicate that the incorporation of the deep learning-based label-label transition model provides distinctive contextual clues to enhance BioNER over the static transition model. We demonstrate that the proposed framework enables the dynamic transition model to adaptively explore the contextual relations between adjacent labels in a fine-grained way. We expect that our study can be a stepping stone for further prosperity of biomedical literature mining.",
                "authors": [
                    {
                        "name": "Hong S.K."
                    },
                    {
                        "name": "Lee J.-G."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DTranNER: Biomedical named entity recognition with deep learning-based label-label transition model"
            },
            "pmcid": "PMC7014657",
            "pmid": "32046638"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}