{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://sites.google.com/site/bestumich/contact"}],"documentation":[{"type":"GENERAL","url":"https://docs.google.com/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxiZXN0dW1pY2h8Z3g6ZTQ5OWNjNjczNjQ3YWNj"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/gboosting-1-0-1-high-dimensional-variable-selection.html"}],"publication":[{"abstract":"© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Technological advances that allow routine identification of high-dimensional risk factors have led to high demand for statistical techniques that enable full utilization of these rich sources of information for genetics studies. Variable selection for censored outcome data as well as control of false discoveries (i.e. inclusion of irrelevant variables) in the presence of high-dimensional predictors present serious challenges. This article develops a computationally feasible method based on boosting and stability selection. Specifically, we modified the component-wise gradient boosting to improve the computational feasibility and introduced random permutation in stability selection for controlling false discoveries. Results: We have proposed a high-dimensional variable selection method by incorporating stability selection to control false discovery. Comparisons between the proposed method and the commonly used univariate and Lasso approaches for variable selection reveal that the proposed method yields fewer false discoveries. The proposed method is applied to study the associations of 2339 common single-nucleotide polymorphisms (SNPs) with overall survival among cutaneous melanoma (CM) patients. The results have confirmed that BRCA2 pathway SNPs are likely to be associated with overall survival, as reported by previous literature. Moreover, we have identified several new Fanconi anemia (FA) pathway SNPs that are likely to modulate survival of CM patients. Availability and implementation: The related source code and documents are freely available at https://sites.google.com/site/bestumich/issues.","authors":["He K.","Li Y.","Zhu J.","Liu H.","Lee J.E.","Amos C.I.","Hyslop T.","Jin J.","Lin H.","Wei Q.","Li Y."],"cit_count":7,"journal":"Bioinformatics","pmid":"26382192","title":"Component-wise gradient boosting and false discovery control in survival analysis with high-dimensional covariates","year":"2015-07-01"}],"summary":{"biotoolsCURIE":"biotools:gboosting","biotoolsID":"gboosting","description":"R package for conducting GWAS with survival outcomes using Boosting and FDR control methods.","homepage":"https://sites.google.com/site/bestumich/issues","name":"gboosting"}}