
{
    "credit": [
        {
            "email": "yongkee.t@gmail.com",
            "name": "Yong Kee Tan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/manuals/oneSENSE/man/oneSENSE.pdf"
        }
    ],
    "download": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/oneSENSE_1.2.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "cost": "Free of charge",
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Biology",
                "uri": "http://edamontology.org/topic_3070"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "http://bioconductor.org/packages/oneSENSE/"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 by The American Association of Immunologists, Inc. Rapid progress in single-cell analysis methods allow for exploration of cellular diversity at unprecedented depth and throughput. Visualizing and understanding these large, high-dimensional datasets poses a major analytical challenge. Mass cytometry allows for simultaneous measurement of >40 different proteins, permitting in-depth analysis of multiple aspects of cellular diversity. In this article, we present one-dimensional soli-expression by nonlinear stochastic embedding (One-SENSE), a dimensionality reduction method based on the t-distributed stochastic neighbor embedding (t-SNE) algorithm, for categorical analysis of mass cytometry data. With One-SENSE, measured parameters are grouped into predefined categories, and cells are projected onto a space composed of one dimension for each category. In contrast with higher-dimensional t-SNE, each dimension (plot axis) in One-SENSE has biological meaning that can be easily annotated with binned heat plots. We applied One-SENSE to probe relationships between categories of human T cell phenotypes and observed previously unappreciated cellular populations within an orchestrated view of immune cell diversity. The presentation of high-dimensional cytometric data using One-SENSE showed a significant improvement in distinguished T cell diversity compared with the original t-SNE algorithm and could be useful for any highdimensional dataset.",
            "authors": [
                "Cheng Y.",
                "Wong M.T.",
                "Van Der Maaten L.",
                "Newell E.W."
            ],
            "cit_count": 28,
            "doi": "10.4049/jimmunol.1501928",
            "journal": "Journal of Immunology",
            "title": "Categorical analysis of human T cell heterogeneity with one-dimensional soli-expression by nonlinear stochastic embedding",
            "type": "Primary",
            "year": "2016-01-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:onesense",
        "biotoolsID": "onesense",
        "description": "A graphical user interface that facilitates the dimensional reduction method based on the t-distributed stochastic neighbor embedding (t-SNE) algorithm, for categorical analysis of mass cytometry data.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/oneSENSE.html",
        "name": "oneSENSE",
        "version": [
            "1.2.0"
        ]
    }
}