{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.hsph.harvard.edu/peter-kraft"}],"documentation":[{"type":"GENERAL","url":"https://www.hsph.harvard.edu/peter-kraft/software/"}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["SAS"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/powergxe-power-calculations-genetic-association-tests-exploiting-gene-environment-interaction.html"}],"publication":[{"abstract":"Complex disease by definition results from the interplay of genetic and environmental factors. However, it is currently unclear how gene-environment interaction can best be used to locate complex disease susceptibility loci, particularly in the context of studies where between 1,000 and 1,000,000 markers are scanned for association with disease. We present a joint test of marginal association and gene-environment interaction for case-control data. We compare the power and sample size requirements of this joint test to other analyses: the marginal test of genetic association, the standard test for gene-environment interaction based on logistic regression, and the case-only test for interaction that exploits gene-environment independence. Although for many penetrance models the joint test of genetic marginal effect and interaction is not the most powerful, it is nearly optimal across all penetrance models we considered. In particular, it generally has better power than the marginal test when the genetic effect is restricted to exposed subjects and much better power than the tests of gene-environment interaction when the genetic effect is not restricted to a particular exposure level. This makes the joint test an attractive tool for large-scale association scans where the true gene-environment interaction model is unknown. Copyright © 2007 S. Karger AG.","authors":["Kraft P.","Yen Y.-C.","Stram D.O.","Morrison J.","Gauderman W.J."],"cit_count":253,"journal":"Human Heredity","pmid":"17283440","title":"Exploiting gene-environment interaction to detect genetic associations","year":"2007-02-01"}],"summary":{"biotoolsCURIE":"biotools:powergxe","biotoolsID":"powergxe","description":"SAS Macro for power calculations for genetic association tests exploiting gene-environment interaction.","homepage":"http://www.hsph.harvard.edu/peter-kraft/software/","name":"PowerGxE"}}