{
    "accessibility": "Open access",
    "additionDate": "2023-08-24T13:59:16.245106Z",
    "biotoolsCURIE": "biotools:cfago",
    "biotoolsID": "cfago",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu",
            "orcidid": "https://orcid.org/0000-0003-3685-9469",
            "typeEntity": "Person"
        },
        {
            "email": "junjiechen@hit.edu.cn",
            "name": "Junjie Chen",
            "orcidid": "https://orcid.org/0000-0002-0483-303X",
            "typeEntity": "Person"
        },
        {
            "name": "Mingyue Guo",
            "typeEntity": "Person"
        },
        {
            "name": "Xiaopeng Jin",
            "typeEntity": "Person"
        },
        {
            "name": "Zhourun Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "Cross-fusion of network and attributes based on attention mechanism for protein function prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/CFAGO/",
    "lastUpdate": "2023-08-24T13:59:16.247807Z",
    "name": "CFAGO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD123",
            "metadata": {
                "abstract": "Motivation: Protein function annotation is fundamental to understanding biological mechanisms. The abundant genome-scale protein-protein interaction (PPI) networks, together with other protein biological attributes, provide rich information for annotating protein functions. As PPI networks and biological attributes describe protein functions from different perspectives, it is highly challenging to cross-fuse them for protein function prediction. Recently, several methods combine the PPI networks and protein attributes via the graph neural networks (GNNs). However, GNNs may inherit or even magnify the bias caused by noisy edges in PPI networks. Besides, GNNs with stacking of many layers may cause the over-smoothing problem of node representations. Results: We develop a novel protein function prediction method, CFAGO, to integrate single-species PPI networks and protein biological attributes via a multi-head attention mechanism. CFAGO is first pre-trained with an encoder-decoder architecture to capture the universal protein representation of the two sources. It is then fine-tuned to learn more effective protein representations for protein function prediction. Benchmark experiments on human and mouse datasets show CFAGO outperforms state-of-the-art single-species network-based methods by at least 7.59%, 6.90%, 11.68% in terms of m-AUPR, M-AUPR, and Fmax, respectively, demonstrating cross-fusion by multi-head attention mechanism can greatly improve the protein function prediction. We further evaluate the quality of captured protein representations in terms of Davies Bouldin Score, whose results show that cross-fused protein representations by multi-head attention mechanism are at least 2.7% better than that of original and concatenated representations. We believe CFAGO is an effective tool for protein function prediction.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Guo M."
                    },
                    {
                        "name": "Jin X."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Wu Z."
                    }
                ],
                "citationCount": 3,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CFAGO: cross-fusion of network and attributes based on attention mechanism for protein function prediction"
            },
            "pmcid": "PMC10032634",
            "pmid": "36883697"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
