{
    "additionDate": "2020-01-14T19:50:55Z",
    "biotoolsCURIE": "biotools:scdney",
    "biotoolsID": "scdney",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "kitty.lo@sydney.edu.au",
            "name": "Kitty K. Lo",
            "orcidid": "https://orcid.org/0000-0002-9392-512X",
            "typeEntity": "Person"
        }
    ],
    "description": "single cell differential composition analysis.\n\nSingle cell data integrative analysis.\n\nscdney is a R package with collection of single cell RNA-sequencing (scRNA-seq) data analysis functions developed by team of Sydney Precision Bioinformatics Research Group at The University of Sydney.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'scDC'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SydneyBioX/scdney",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-01-14T19:50:55Z",
    "name": "scdney",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3211-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Differences in cell-type composition across subjects and conditions often carry biological significance. Recent advancements in single cell sequencing technologies enable cell-types to be identified at the single cell level, and as a result, cell-type composition of tissues can now be studied in exquisite detail. However, a number of challenges remain with cell-type composition analysis-none of the existing methods can identify cell-type perfectly and variability related to cell sampling exists in any single cell experiment. This necessitates the development of method for estimating uncertainty in cell-type composition. Results: We developed a novel single cell differential composition (scDC) analysis method that performs differential cell-type composition analysis via bootstrap resampling. scDC captures the uncertainty associated with cell-type proportions of each subject via bias-corrected and accelerated bootstrap confidence intervals. We assessed the performance of our method using a number of simulated datasets and synthetic datasets curated from publicly available single cell datasets. In simulated datasets, scDC correctly recovered the true cell-type proportions. In synthetic datasets, the cell-type compositions returned by scDC were highly concordant with reference cell-type compositions from the original data. Since the majority of datasets tested in this study have only 2 to 5 subjects per condition, the addition of confidence intervals enabled better comparisons of compositional differences between subjects and across conditions. Conclusions: ScDC is a novel statistical method for performing differential cell-type composition analysis for scRNA-seq data. It uses bootstrap resampling to estimate the standard errors associated with cell-type proportion estimates and performs significance testing through GLM and GLMM models. We have made this method available to the scientific community as part of the scdney package (Single Cell Data Integrative Analysis) R package, available from https://github.com/SydneyBioX/scdney.",
                "authors": [
                    {
                        "name": "Cao Y."
                    },
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Ormerod J.T."
                    },
                    {
                        "name": "Yang P."
                    },
                    {
                        "name": "Yang J.Y.H."
                    },
                    {
                        "name": "Lo K.K."
                    }
                ],
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ScDC: Single cell differential composition analysis"
            },
            "pmcid": "PMC6929335",
            "pmid": "31870280"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}