{
    "additionDate": "2020-01-14T09:44:19Z",
    "biotoolsCURIE": "biotools:SRMs",
    "biotoolsID": "SRMs",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "david.sheen@nist.gov",
            "name": "David A. Sheen",
            "orcidid": "https://orcid.org/0000-0003-1958-1848",
            "typeEntity": "Person"
        }
    ],
    "description": "Metabolomics Test Materials for Quality Control.\n\nNIST supports accurate and compatible measurements by certifying and providing over 1200 Standard Reference Materials.\n\nUpdated NIST Lockbox Address Effective 10/10/2018.\n\nBrowse SRMs by Technical Category.\n\nSearch for Materials - Find an SRM/RM.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Metabolomics Test Materials Quality Control', 'urine', 'ILS'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://www.nist.gov/srm",
    "lastUpdate": "2020-01-14T09:44:19Z",
    "name": "SRMs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/METABO9110270",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.There is a lack of experimental reference materials and standards for metabolomics measurements, such as urine, plasma, and other human fluid samples. Reasons include difficulties with supply, distribution, and dissemination of information about the materials. Additionally, there is a long lead time because reference materials need their compositions to be fully characterized with uncertainty, a labor-intensive process for material containing thousands of relevant compounds. Furthermore, data analysis can be hampered by different methods using different software by different vendors. In this work, we propose an alternative implementation of reference materials. Instead of characterizing biological materials based on their composition, we propose using untargeted metabolomic data such as nuclear magnetic resonance (NMR) or gas and liquid chromatography-mass spectrometry (GC-MS and LC-MS) profiles. The profiles are then distributed with the material accompanying the certificate, so that researchers can compare their own metabolomic measurements with the reference profiles. To demonstrate this approach, we conducted an interlaboratory study (ILS) in which seven National Institute of Standards and Technology (NIST) urine Standard Reference Material®s (SRM®s) were distributed to participants, who then returned the metabolomic data to us. We then implemented chemometric methods to analyze the data together to estimate the uncertainties in the current measurement techniques. The participants identified similar patterns in the profiles that distinguished the seven samples. Even when the number of spectral features is substantially different between platforms, a collective analysis still shows significant overlap that allows reliable comparison between participants. Our results show that a urine suite such as that used in this ILS could be employed for testing and harmonization among different platforms. A limited quantity of test materials will be made available for researchers who are willing to repeat the protocols presented here and contribute their data.",
                "authors": [
                    {
                        "name": "Bearden D.W."
                    },
                    {
                        "name": "Sheen D.A."
                    },
                    {
                        "name": "Simon-Manso Y."
                    },
                    {
                        "name": "Benner B.A."
                    },
                    {
                        "name": "Rocha W.F.C."
                    },
                    {
                        "name": "Blonder N."
                    },
                    {
                        "name": "Lippa K.A."
                    },
                    {
                        "name": "Beger R.D."
                    },
                    {
                        "name": "Schnackenberg L.K."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Mehta K.Y."
                    },
                    {
                        "name": "Cheema A.K."
                    },
                    {
                        "name": "Gu H."
                    },
                    {
                        "name": "Marupaka R."
                    },
                    {
                        "name": "Nagana Gowda G.A."
                    },
                    {
                        "name": "Raftery D."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "Metabolomics test materials for quality control: A study of a urine materials suite"
            },
            "pmcid": "PMC6918257",
            "pmid": "31703392"
        }
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}