{
    "additionDate": "2020-01-14T20:20:36Z",
    "biotoolsCURIE": "biotools:deconvolution_estimate_immune_cell_subsets",
    "biotoolsID": "deconvolution_estimate_immune_cell_subsets",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yhhuang@ym.edu.tw",
            "name": "Yen-Hua Huang",
            "orcidid": "https://orcid.org/0000-0001-7932-374X",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved cell composition deconvolution method of bulk gene expression profiles to quantify subsets of immune cells.\n\nEstimate the fractions of immune cells from expression profiles of tissues.\n\nThis method is created as described in the manuscript - \"Deconvolution of bulk gene expression profiles from complex tissues to quantify subsets of immune cells\".\n\nThe tool is designed to estimate the fractions of immune cells from the expression profiles of tissues, such as tumor masses, PBMCs, etc.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/holiday01/deconvolution-to-estimate-immune-cell-subsets",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-17T14:59:48Z",
    "name": "deconvolution estimate immune cell subsets",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0613-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: To facilitate the investigation of the pathogenic roles played by various immune cells in complex tissues such as tumors, a few computational methods for deconvoluting bulk gene expression profiles to predict cell composition have been created. However, available methods were usually developed along with a set of reference gene expression profiles consisting of imbalanced replicates across different cell types. Therefore, the objective of this study was to create a new deconvolution method equipped with a new set of reference gene expression profiles that incorporate more microarray replicates of the immune cells that have been frequently implicated in the poor prognosis of cancers, such as T helper cells, regulatory T cells and macrophage M1/M2 cells. Methods: Our deconvolution method was developed by choosing ϵ-support vector regression (ϵ-SVR) as the core algorithm assigned with a loss function subject to the L1-norm penalty. To construct the reference gene expression signature matrix for regression, a subset of differentially expressed genes were chosen from 148 microarray-based gene expression profiles for 9 types of immune cells by using ANOVA and minimizing condition number. Agreement analyses including mean absolute percentage errors and Bland-Altman plots were carried out to compare the performances of our method and CIBERSORT. Results: In silico cell mixtures, simulated bulk tissues, and real human samples with known immune-cell fractions were used as the test datasets for benchmarking. Our method outperformed CIBERSORT in the benchmarks using in silico breast tissue-immune cell mixtures in the proportions of 30:70 and 50:50, and in the benchmark using 164 human PBMC samples. Our results suggest that the performance of our method was at least comparable to that of a state-of-the-art tool, CIBERSORT. Conclusions: We developed a new cell composition deconvolution method and the implementation was entirely based on the publicly available R and Python packages. In addition, we compiled a new set of reference gene expression profiles, which might allow for a more robust prediction of the immune cell fractions from the expression profiles of cell mixtures. The source code of our method could be downloaded from https://github.com/holiday01/deconvolution-to-estimate-immune-cell-subsets.",
                "authors": [
                    {
                        "name": "Chiu Y.-J."
                    },
                    {
                        "name": "Hsieh Y.-H."
                    },
                    {
                        "name": "Huang Y.-H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Improved cell composition deconvolution method of bulk gene expression profiles to quantify subsets of immune cells"
            },
            "pmcid": "PMC6923925",
            "pmid": "31856824"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
