{
    "additionDate": "2021-10-11T08:15:39.877133Z",
    "biotoolsCURIE": "biotools:mrireco",
    "biotoolsID": "mrireco",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tobias.knopp@tuhh.de",
            "name": "Tobias Knopp",
            "orcidid": "https://orcid.org/0000-0002-1589-8517",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MRIReco is a Julia packet for magnetic resonance imaging. It contains algorithms for the simulation and reconstruction of MRT data and is both easy to use and flexibly expandable.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MagneticResonanceImaging/MRIReco.jl",
    "language": [
        "Julia",
        "C",
        "C++"
    ],
    "lastUpdate": "2021-10-11T08:16:39.639522Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MagneticResonanceImaging/MRIReco.jl/issues"
        }
    ],
    "name": "MRIReco",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/MRM.28792",
            "metadata": {
                "abstract": "© 2021 The Authors. Magnetic Resonance in Medicine published by Wiley Periodicals LLC on behalf of International Society for Magnetic Resonance in Medicine.Purpose: The aim of this work is to develop a high-performance, flexible, and easy-to-use MRI reconstruction framework using the scientific programming language Julia. Methods: Julia is a modern, general purpose programming language with strong features in the area of signal/image processing and numerical computing. It has a high-level syntax but still generates efficient machine code that is usually as fast as comparable C/C++ applications. In addition to the language features itself, Julia has a sophisticated package management system that makes proper modularization of functionality across different packages feasible. Our developed MRI reconstruction framework MRIReco.jl can therefore reuse existing functionality from other Julia packages and concentrate on the MRI-related parts. This includes common imaging operators and support for MRI raw data formats. Results: MRIReco.jl is a simple to use framework with a high degree of accessibility. While providing a simple-to-use interface, many of its components can easily be extended and customized. The performance of MRIReco.jl is compared to the Berkeley Advanced Reconstruction Toolbox (BART) and we show that the Julia framework achieves comparable reconstruction speed as the popular C/C++ library. Conclusions: Modern programming languages can bridge the gap between high performance and accessible implementations. MRIReco.jl leverages this fact and contributes a promising environment for future algorithmic development in MRI reconstruction.",
                "authors": [
                    {
                        "name": "Knopp T."
                    },
                    {
                        "name": "Grosser M."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "Magnetic Resonance in Medicine",
                "title": "MRIReco.jl: An MRI reconstruction framework written in Julia"
            },
            "pmid": "33817833",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}