{
    "additionDate": "2024-07-18T12:33:11.325300Z",
    "biotoolsCURIE": "biotools:citeviz",
    "biotoolsID": "citeviz",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "braunt@ohsu.edu",
            "name": "Theodore P. Braun",
            "typeEntity": "Person"
        },
        {
            "email": "maxsonj@ohsu.edu",
            "name": "Julia E. Maxson",
            "typeEntity": "Person"
        }
    ],
    "description": "Interactively classify cell populations in CITE-Seq via a flow cytometry-like gating workflow using R-Shiny.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://maxsonbraunlab.github.io/CITEViz/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:50:28.497093Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/maxsonBraunLab/CITEViz/"
        }
    ],
    "name": "CITEViz",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05762-1",
            "metadata": {
                "abstract": "Background: The rapid advancement of new genomic sequencing technology has enabled the development of multi-omic single-cell sequencing assays. These assays profile multiple modalities in the same cell and can often yield new insights not revealed with a single modality. For example, Cellular Indexing of Transcriptomes and Epitopes by Sequencing (CITE-Seq) simultaneously profiles the RNA transcriptome and the surface protein expression. The surface protein markers in CITE-Seq can be used to identify cell populations similar to the iterative filtration process in flow cytometry, also called “gating”, and is an essential step for downstream analyses and data interpretation. While several packages allow users to interactively gate cells, they often do not process multi-omic sequencing datasets and may require writing redundant code to specify gate boundaries. To streamline the gating process, we developed CITEViz which allows users to interactively gate cells in Seurat-processed CITE-Seq data. CITEViz can also visualize basic quality control (QC) metrics allowing for a rapid and holistic evaluation of CITE-Seq data. Results: We applied CITEViz to a peripheral blood mononuclear cell CITE-Seq dataset and gated for several major blood cell populations (CD14 monocytes, CD4 T cells, CD8 T cells, NK cells, B cells, and platelets) using canonical surface protein markers. The visualization features of CITEViz were used to investigate cellular heterogeneity in CD14 and CD16-expressing monocytes and to detect differential numbers of detected antibodies per patient donor. These results highlight the utility of CITEViz to enable the robust classification of single cell populations. Conclusions: CITEViz is an R-Shiny app that standardizes the gating workflow in CITE-Seq data for efficient classification of cell populations. Its secondary function is to generate basic feature plots and QC figures specific to multi-omic data. The user interface and internal workflow of CITEViz uniquely work together to produce an organized workflow and sensible data structures for easy data retrieval. This package leverages the strengths of biologists and computational scientists to assess and analyze multi-omic single-cell datasets. In conclusion, CITEViz streamlines the flow cytometry gating workflow in CITE-Seq data to help facilitate novel hypothesis generation.",
                "authors": [
                    {
                        "name": "Braun T.P."
                    },
                    {
                        "name": "Carratt S.A."
                    },
                    {
                        "name": "Cheney J.H.W."
                    },
                    {
                        "name": "Curtiss B.M."
                    },
                    {
                        "name": "Kong G.L."
                    },
                    {
                        "name": "Lusardi T.A."
                    },
                    {
                        "name": "Maxson J.E."
                    },
                    {
                        "name": "Nguyen T.T."
                    },
                    {
                        "name": "Panikar A.D."
                    },
                    {
                        "name": "Rosales W.K."
                    },
                    {
                        "name": "Yashar W.M."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CITEViz: interactively classify cell populations in CITE-Seq via a flow cytometry-like gating workflow using R-Shiny"
            },
            "pmcid": "PMC10988918",
            "pmid": "38566005"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
