{
    "additionDate": "2021-03-19T09:03:14Z",
    "biotoolsCURIE": "biotools:ispectron",
    "biotoolsID": "ispectron",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "niri.govind@pnnl.gov",
            "name": "Niranjan Govind",
            "typeEntity": "Person"
        },
        {
            "email": "smukamel@uci.edu",
            "name": "Shaul Mukamel",
            "typeEntity": "Person"
        },
        {
            "email": "marco.garavelli@unibo.it",
            "name": "Marco Garavelli",
            "typeEntity": "Person"
        }
    ],
    "description": "A simulation interface for linear and nonlinear spectra with ab-initio quantum chemistry software.\n\nWe introduce iSPECTRON, a program that parses data from common quantum chemistry software (NWChem, OpenMolcas, Gaussian, Cobramm, etc.), produces the input files for the simulation of linear and nonlinear spectroscopy of molecules with the Spectron code, and analyzes the spectra with a broad range of tools. Vibronic spectra are expressed in term of the electronic eigenstates, obtained from quantum chemistry computations, and vibrational bath effects are incorporated in the framework of the displaced harmonic oscillator model, where all required quantities are computed at the Franck-Condon point. The program capabilities are illustrated by simulating linear absorption, transient absorption and two dimensional electronic spectra of the pyrene molecule",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ispectrongit/iSPECTRON/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-05T08:20:50.861899Z",
    "name": "iSPECTRON",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/JCC.26485",
            "metadata": {
                "abstract": "© 2021 Wiley Periodicals LLC.We introduce iSPECTRON, a program that parses data from common quantum chemistry software (NWChem, OpenMolcas, Gaussian, Cobramm, etc.), produces the input files for the simulation of linear and nonlinear spectroscopy of molecules with the Spectron code, and analyzes the spectra with a broad range of tools. Vibronic spectra are expressed in term of the electronic eigenstates, obtained from quantum chemistry computations, and vibrational/bath effects are incorporated in the framework of the displaced harmonic oscillator model, where all required quantities are computed at the Franck-Condon point. The program capabilities are illustrated by simulating linear absorption, transient absorption and two dimensional electronic spectra of the pyrene molecule. Calculations at two levels of electronic structure theory, time-dependent density functional theory (with NWChem) and RASSCF/RASPT2 (with OpenMolcas) are presented and compared where possible. The iSPECTRON program is available online at https://github.com/ispectrongit/iSPECTRON/ and distributed open source under the terms of the Educational Community License version 2.0 (ECL 2.0).",
                "authors": [
                    {
                        "name": "Segatta F."
                    },
                    {
                        "name": "Nenov A."
                    },
                    {
                        "name": "Nascimento D.R."
                    },
                    {
                        "name": "Govind N."
                    },
                    {
                        "name": "Mukamel S."
                    },
                    {
                        "name": "Garavelli M."
                    }
                ],
                "date": "2021-04-05T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "iSPECTRON: A simulation interface for linear and nonlinear spectra with ab-initio quantum chemistry software"
            },
            "pmid": "33556195"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ]
}