{
    "accessibility": [],
    "additionDate": "2017-08-03T18:37:55Z",
    "biotoolsCURIE": "biotools:bubble_gum",
    "biotoolsID": "bubble_gum",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "spinelli@ciml.univ-mrs.fr",
            "gridid": null,
            "name": "Spinelli L",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ciml.univ-mrs.fr/about-us"
        }
    ],
    "description": "Computational tool that allows to automatically extract phenotype signatures based on transcriptomic data and to perform easily multiple GSEA runs in a row.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://www.ciml.univ-mrs.fr/applications/BubbleGUM/BubbleGUM_files/download/BubbleGum_UserGuide.pdf"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.ciml.univ-mrs.fr/applications/BubbleGUM/index.html",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/bubble-gum-extraction-of-phenotype-molecular-signatures-and-comprehensive-visualization.html"
        }
    ],
    "maturity": null,
    "name": "Bubble GUM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "© 2015 Spinelli et al.Background: Recent advances in the analysis of high-throughput expression data have led to the development of tools that scaled-up their focus from single-gene to gene set level. For example, the popular Gene Set Enrichment Analysis (GSEA) algorithm can detect moderate but coordinated expression changes of groups of presumably related genes between pairs of experimental conditions. This considerably improves extraction of information from high-throughput gene expression data. However, although many gene sets covering a large panel of biological fields are available in public databases, the ability to generate home-made gene sets relevant to one's biological question is crucial but remains a substantial challenge to most biologists lacking statistic or bioinformatic expertise. This is all the more the case when attempting to define a gene set specific of one condition compared to many other ones. Thus, there is a crucial need for an easy-to-use software for generation of relevant home-made gene sets from complex datasets, their use in GSEA, and the correction of the results when applied to multiple comparisons of many experimental conditions. Result: We developed BubbleGUM (GSEA Unlimited Map), a tool that allows to automatically extract molecular signatures from transcriptomic data and perform exhaustive GSEA with multiple testing correction. One original feature of BubbleGUM notably resides in its capacity to integrate and compare numerous GSEA results into an easy-to-grasp graphical representation. We applied our method to generate transcriptomic fingerprints for murine cell types and to assess their enrichments in human cell types. This analysis allowed us to confirm homologies between mouse and human immunocytes. Conclusions: BubbleGUM is an open-source software that allows to automatically generate molecular signatures out of complex expression datasets and to assess directly their enrichment by GSEA on independent datasets. Enrichments are displayed in a graphical output that helps interpreting the results. This innovative methodology has recently been used to answer important questions in functional genomics, such as the degree of similarities between microarray datasets from different laboratories or with different experimental models or clinical cohorts. BubbleGUM is executable through an intuitive interface so that both bioinformaticians and biologists can use it. It is available at http://www.ciml.univ-mrs.fr/applications/BubbleGUM/index.html.",
                "authors": [
                    {
                        "name": "Spinelli L."
                    },
                    {
                        "name": "Carpentier S."
                    },
                    {
                        "name": "Montanana Sanchis F."
                    },
                    {
                        "name": "Dalod M."
                    },
                    {
                        "name": "Vu Manh T.-P."
                    }
                ],
                "citationCount": 21,
                "date": "2015-10-19T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "BubbleGUM: Automatic extraction of phenotype molecular signatures and comprehensive visualization of multiple Gene Set Enrichment Analyses"
            },
            "note": null,
            "pmcid": null,
            "pmid": "26481321",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": []
}