{
    "additionDate": "2017-08-03T18:43:56Z",
    "biotoolsCURIE": "biotools:gamp",
    "biotoolsID": "gamp",
    "credit": [
        {
            "email": "mcwu@fhcrc.org",
            "name": "Michael Wu Group",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Conduct “global analysis” of DNA methylation data, particularly from the Illumina 450k Infinium platform. Instead of examining the effect of individual CpGs, the idea is to compare the overall profile or distribution of CpG measurements across individuals.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://research.fhcrc.org/content/dam/stripe/wu/files/GAMP/GAMP-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://research.fhcrc.org/wu/en/software.html#GAMP",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gamp-0-1-global-analysis-methylation-profiles.html"
        }
    ],
    "name": "GAMP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 WILEY PERIODICALS, INC.New high throughput technologies are now enabling simultaneous epigenetic profiling of DNA methylation at hundreds of thousands of CpGs across the genome. A problem of considerable practical interest is identification of large scale, global changes in methylation that are associated with environmental variables, clinical outcomes, or other experimental conditions. However, there has been little statistical research on methods for global methylation analysis using technologies with individual CpG resolution. To address this critical gap in the literature, we develop a new strategy for global analysis of methylation profiles using a functional regression approach wherein we approximate either the density or the cumulative distribution function (CDF) of the methylation values for each individual using B-spline basis functions. The spline coefficients for each individual are allowed to summarize the individual's overall methylation profile. We then test for association between the overall distribution and a continuous or dichotomous outcome variable using a variance component score test that naturally accommodates the correlation between spline coefficients. Simulations indicate that our proposed approach has desirable power while protecting type I error. The method was applied to detect methylation differences, both genome wide and at LINE1 elements, between the blood samples from rheumatoid arthritis patients and healthy controls and to detect the epigenetic changes of human hepatocarcinogenesis in the context of alcohol abuse and hepatitis C virus infection. A free implementation of our methods in the R language is available in the Global Analysis of Methylation Profiles (GAMP) package at http://research.fhcrc.org/wu/en.html.",
                "authors": [
                    {
                        "name": "Zhao N."
                    },
                    {
                        "name": "Bell D.A."
                    },
                    {
                        "name": "Maity A."
                    },
                    {
                        "name": "Staicu A..-M."
                    },
                    {
                        "name": "Joubert B.R."
                    },
                    {
                        "name": "London S.J."
                    },
                    {
                        "name": "Wu M.C."
                    }
                ],
                "citationCount": 9,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Global Analysis of Methylation Profiles From High Resolution CpG Data"
            },
            "pmid": "25537884"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}