{
    "additionDate": "2017-09-21T13:19:53Z",
    "biotoolsCURIE": "biotools:hudsen",
    "biotoolsID": "hudsen",
    "credit": [
        {
            "email": "hdbr@nnewcastle.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Atlas pages that are unique in containing digital 3D models of human developmental stages, organ specific gene expression datasets as well as annotated histology sections.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://hudsen.eu/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "http://www.hudsen.org/",
    "lastUpdate": "2018-12-29T15:13:40Z",
    "name": "HuDSeN atlas and spatial gene expression database",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hudsen130917",
    "publication": [
        {
            "doi": "10.1111/j.1469-7580.2010.01290.x",
            "metadata": {
                "abstract": "We are developing a three-dimensional (3D) atlas of the human embryonic brain using anatomical landmarks and gene expression data to define major subdivisions through 12 stages of development [Carnegie Stages (CS) 12-23; approximately 26-56 days post conception (dpc)]. Virtual 3D anatomical models are generated from intact specimens using optical projection tomography (OPT). Using mapaint software, selected gene expression data, gathered using standard methods of in situ hybridization and immunohistochemistry, are mapped to a representative 3D model for each chosen Carnegie stage. In these models, anatomical domains, defined on the basis of morphological landmarks and comparative knowledge of expression patterns in vertebrates, are linked to a developmental neuroanatomic ontology. Human gene expression patterns for genes with characteristic expression in different vertebrates (e.g. PAX6, GAD65 and OLIG2) are being used to confirm and/or refine the human anatomical domain boundaries. We have also developed interpolation software that digitally generates a full domain from partial data. Currently, the 3D models and a preliminary set of anatomical domains and ontology are available on the atlas pages along with gene expression data from approximately 100 genes in the HUDSEN Human Spatial Gene Expression Database (http://www.hudsen.org). The aim is that full 3D data will be generated from expression data used to define a more detailed set of anatomical domains linked to a more advanced anatomy ontology and all of these will be available online, contributing to the long-term goal of the atlas, which is to help maximize the effective use and dissemination of data wherever it is generated. © 2010 The Authors. Journal of Anatomy © 2010 Anatomical Society of Great Britain and Ireland.",
                "authors": [
                    {
                        "name": "Baldock R."
                    },
                    {
                        "name": "Kerwin J."
                    },
                    {
                        "name": "Lindsay S."
                    },
                    {
                        "name": "Merchan P."
                    },
                    {
                        "name": "Puelles L."
                    },
                    {
                        "name": "Sandoval J."
                    },
                    {
                        "name": "Sarma S."
                    },
                    {
                        "name": "Thompson J."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "citationCount": 29,
                "date": "2010-10-01T00:00:00Z",
                "journal": "Journal of Anatomy",
                "title": "The HUDSEN Atlas: A three-dimensional (3D) spatial framework for studying gene expression in the developing human brain"
            },
            "pmcid": "PMC2967454",
            "pmid": "20979583",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Embryology",
            "uri": "http://edamontology.org/topic_3065"
        }
    ],
    "validated": 1
}
