{
    "accessibility": "Open access",
    "additionDate": "2016-02-10T09:42:32Z",
    "biotoolsCURIE": "biotools:inserm-remap",
    "biotoolsID": "inserm-remap",
    "credit": [
        {
            "email": "benoit.ballester@inserm.fr",
            "name": "Benoit Ballester",
            "orcidid": "http://orcid.org/0000-0002-0834-7135",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "email": "benoit.ballester@inserm.fr",
            "name": "Benoit Ballester",
            "orcidid": "http://orcid.org/0000-0002-0834-7135",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Aix-Marseille University",
            "typeEntity": "Institute"
        },
        {
            "name": "French Institute of Health and Medical Research",
            "typeEntity": "Institute"
        },
        {
            "name": "Inserm U1090 - TAGC",
            "typeEntity": "Institute",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "ReMap is a large scale integrative analysis of DNA-binding experiments for Homo sapiens, Mus musculus, Drosophila melanogaster and Arabidopsis thaliana transcriptional regulators. The catalogues are the results of the manual curation of ChIP-seq, ChIP-exo, DAP-seq from public sources (GEO, ENCODE, ENA). ReMap (https://remap.univ-amu.fr) aims to provide manually curated, high-quality catalogs of regulatory regions resulting from a large-scale integrative analysis of DNA-binding experiments in Human, Mouse, Fly and Arabidopsis thaliana for hundreds of transcription factors and regulators. In this 2022 update, we have uniformly processed >11 000 DNA-binding sequencing datasets from public sources across four species. The four regulatory catalogs are browsable through track hubs at UCSC, Ensembl and NCBI genome browsers.",
    "documentation": [
        {
            "type": [
                "Citation instructions"
            ],
            "url": "https://remap.univ-amu.fr/citations_page"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://remap.univ-amu.fr/about_hsap_page"
        }
    ],
    "download": [
        {
            "type": "API specification",
            "url": "https://remap.univ-amu.fr/rest_page"
        },
        {
            "type": "Downloads page",
            "url": "https://remap.univ-amu.fr/download_page"
        }
    ],
    "editPermission": {
        "authors": [
            "baileqi",
            "jcheneby"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene name",
                        "uri": "http://edamontology.org/data_2299"
                    }
                },
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                },
                {
                    "data": {
                        "term": "Organism name",
                        "uri": "http://edamontology.org/data_2909"
                    }
                },
                {
                    "data": {
                        "term": "Sequence coordinates",
                        "uri": "http://edamontology.org/data_2012"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence tag mapping",
                    "uri": "http://edamontology.org/operation_0527"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence features",
                        "uri": "http://edamontology.org/data_1255"
                    },
                    "format": [
                        {
                            "term": "BED",
                            "uri": "http://edamontology.org/format_3003"
                        },
                        {
                            "term": "Sequence feature table format (text)",
                            "uri": "http://edamontology.org/format_2206"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://remap.univ-amu.fr/",
    "lastUpdate": "2024-11-24T14:21:26.315951Z",
    "license": "CC-BY-NC-4.0",
    "link": [
        {
            "note": "This is the entry point for ReMap",
            "type": [
                "Other"
            ],
            "url": "https://remap.univ-amu.fr/"
        },
        {
            "note": "This is the link to download all the data",
            "type": [
                "Repository"
            ],
            "url": "https://remap.univ-amu.fr/"
        }
    ],
    "maturity": "Mature",
    "name": "ReMap",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "benoit.ballester@inserm.fr",
    "publication": [
        {
            "doi": "10.1093/nar/gkab996",
            "metadata": {
                "abstract": "ReMap (https://remap.univ-amu.fr) aims to provide manually curated, high-quality catalogs of regulatory regions resulting from a large-scale integrative analysis of DNA-binding experiments in Human, Mouse, Fly and Arabidopsis thaliana for hundreds of transcription factors and regulators. In this 2022 update, we have uniformly processed >11 000 DNA-binding sequencing datasets from public sources across four species. The updated Human regulatory atlas includes 8103 datasets covering a total of 1210 transcriptional regulators (TRs) with a catalog of 182 million (M) peaks, while the updated Arabidopsis atlas reaches 4.8M peaks, 423 TRs across 694 datasets. Also, this ReMap release is enriched by two new regulatory catalogs for Mus musculus and Drosophila melanogaster. First, the Mouse regulatory catalog consists of 123M peaks across 648 TRs as a result of the integration and validation of 5503 ChIP-seq datasets. Second, the Drosophila melanogaster catalog contains 16.6M peaks across 550 TRs from the integration of 1205 datasets. The four regulatory catalogs are browsable through track hubs at UCSC, Ensembl and NCBI genome browsers. Finally, ReMap 2022 comes with a new Cis Regulatory Module identification method, improved quality controls, faster search results, and better user experience with an interactive tour and video tutorials on browsing and filtering ReMap catalogs.",
                "authors": [
                    {
                        "name": "Ballester B."
                    },
                    {
                        "name": "Bergon A."
                    },
                    {
                        "name": "De Langen P."
                    },
                    {
                        "name": "Hammal F."
                    },
                    {
                        "name": "Lopez F."
                    }
                ],
                "citationCount": 158,
                "date": "2022-01-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ReMap 2022: A database of Human, Mouse, Drosophila and Arabidopsis regulatory regions from an integrative analysis of DNA-binding sequencing experiments"
            },
            "pmcid": "PMC8728178",
            "pmid": "34751401",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gku1280",
            "metadata": {
                "abstract": "The large collections of ChIP-seq data rapidly accumulating in public data warehouses provide genome-wide binding site maps for hundreds of transcription factors (TFs). However, the extent of the regulatory occupancy space in the human genome has not yet been fully apprehended by integrating public ChIP-seq data sets and combining it with ENCODE TFs map. To enable genome-wide identification of regulatory elements we have collected, analysed and retained 395 available ChIP-seq data sets merged with ENCODE peaks covering a total of 237 TFs. This enhanced repertoire complements and refines current genome-wide occupancy maps by increasing the human genome regulatory search space by 14% compared to ENCODE alone, and also increases the complexity of the regulatory dictionary. As a direct application we used this unified binding repertoire to annotate variant enhancer loci (VELs) from H3K4me1 mark in two cancer cell lines (MCF-7, CRC) and observed enrichments of specific TFs involved in biological key functions to cancer development and proliferation. Those enrichments of TFs within VELs provide a direct annotation of non-coding regions detected in cancer genomes. Finally, full access to this catalogue is available online together with the TFs enrichment analysis tool (http://tagc.univ-mrs.fr/remap/).",
                "authors": [
                    {
                        "name": "Ballester B."
                    },
                    {
                        "name": "Barbier Q."
                    },
                    {
                        "name": "Dalino J."
                    },
                    {
                        "name": "Griffon A."
                    },
                    {
                        "name": "Spicuglia S."
                    },
                    {
                        "name": "Van Helden J."
                    }
                ],
                "citationCount": 92,
                "date": "2015-02-27T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Integrative analysis of public ChIP-seq experiments reveals a complex multi-cell regulatory landscape"
            },
            "pmcid": "PMC4344487",
            "pmid": "25477382",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkx1092",
            "metadata": {
                "abstract": "With this latest release of ReMap (http://remap.cisreg.eu), we present a unique collection of regulatory regions in human, as a result of a large-scale integrative analysis of ChIP-seq experiments for hundreds of transcriptional regulators (TRs) such as transcription factors, transcriptional co-activators and chromatin regulators. In 2015, we introduced the ReMap database to capture the genome regulatory space by integrating public ChIP-seq datasets, covering 237 TRs across 13 million (M) peaks. In this release, we have extended this catalog to constitute a unique collection of regulatory regions. Specifically, we have collected, analyzed and retained after quality control a total of 2829 ChIP-seq datasets available from public sources, covering a total of 485 TRs with a catalog of 80M peaks. Additionally, the updated database includes new search features for TR names as well as aliases, including cell line names and the ability to navigate the data directly within genome browsers via public track hubs. Finally, full access to this catalog is available online together with a TR binding enrichment analysis tool. ReMap 2018 provides a significant update of the ReMap database, providing an in depth view of the complexity of the regulatory landscape in human.",
                "authors": [
                    {
                        "name": "Artufel M."
                    },
                    {
                        "name": "Ballester B."
                    },
                    {
                        "name": "Cheneby J."
                    },
                    {
                        "name": "Gheorghe M."
                    },
                    {
                        "name": "Mathelier A."
                    }
                ],
                "citationCount": 149,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ReMap 2018: An updated atlas of regulatory regions from an integrative analysis of DNA-binding ChIP-seq experiments"
            },
            "pmcid": "PMC5753247",
            "pmid": "29126285",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkz945",
            "metadata": {
                "abstract": "ReMap (http://remap.univ-Amu.fr) aims to provide the largest catalogs of high-quality regulatory regions resulting from a large-scale integrative analysis of hundreds of transcription factors and regulators from DNA-binding experiments in Human and Arabidopsis (Arabidopsis thaliana). In this 2020 update of ReMap we have collected, analyzed and retained after quality control 2764 new human ChIP-seq and 208 ChIP-exo datasets available from public sources. The updated human atlas totalize 5798 datasets covering a total of 1135 transcriptional regulators (TRs) with a catalog of 165 million (M) peaks. This ReMap update comes with two unique Arabidopsis regulatory catalogs. First, a catalog of 372 Arabidopsis TRs across 2.6M peaks as a result of the integration of 509 ChIP-seq and DAP-seq datasets. Second, a catalog of 33 histone modifications and variants across 4.5M peaks from the integration of 286 ChIP-seq datasets. All catalogs are made available through track hubs at Ensembl and UCSC Genome Browsers. Additionally, this update comes with a new web framework providing an interactive user-interface, including improved search features. Finally, full programmatically access to the underlying data is available using a RESTful API together with a new R Shiny interface for a TRs binding enrichment analysis tool.",
                "authors": [
                    {
                        "name": "Ballester B."
                    },
                    {
                        "name": "Bergon A."
                    },
                    {
                        "name": "Cheneby J."
                    },
                    {
                        "name": "Douida A."
                    },
                    {
                        "name": "Lopez F."
                    },
                    {
                        "name": "Menetrier Z."
                    },
                    {
                        "name": "Mestdagh M."
                    },
                    {
                        "name": "Rhalloussi W."
                    },
                    {
                        "name": "Rosnet T."
                    }
                ],
                "citationCount": 87,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ReMap 2020: A database of regulatory regions from an integrative analysis of Human and Arabidopsis DNA-binding sequencing experiments"
            },
            "pmcid": "PMC7145625",
            "pmid": "31665499",
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "jaspar",
            "type": "usedBy"
        },
        {
            "biotoolsID": "ucsc-genome-browser",
            "type": "usedBy"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "2014",
        "2018",
        "2020",
        "2022"
    ]
}
