{
    "additionDate": "2021-01-18T09:14:38Z",
    "biotoolsCURIE": "biotools:hydramap",
    "biotoolsID": "hydramap",
    "confidence_flag": "tool",
    "description": "Prediction of the Favorable Hydration Sites in a Protein Binding Pocket and Its Application to Scoring Function Formulation.\n\nPredict potential water molecules in the protein binding pocket.\n\nHydraMap V1.0 - Automatic Tailoring and Transplanting.\n\nWe developed an empirical method for predicting the favorable hydration sites in a protein binding pocket.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "http://www.sioc-ccbg.ac.cn/software/hydramap/",
    "lastUpdate": "2021-02-01T09:08:03Z",
    "name": "HydraMap",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00619",
            "metadata": {
                "abstract": "© 2020 American Chemical SocietyThe important role of water molecules in protein− ligand binding energetics has attracted wide attention in recent years. A range of computational methods has been developed to predict the favorable locations of water molecules in a protein binding pocket. Most of the current methods are based on extensive molecular dynamics or Monte Carlo simulations. They are time-consuming and thus cannot be applied to high-throughput tasks. To overcome this difficulty, we have developed an empirical method, called HydraMap, to predict the favorable hydration sites in the binding pocket of a protein molecule. This method uses statistical potentials to quantify the interactions between protein atoms and water molecules. Such statistical potentials were derived from 10,987 crystal structures selected from the Protein Data Bank. The probability of placing a water probe at each spot in the binding pocket was evaluated to derive a density map. The density map was then deduced into explicit hydration sites through a clustering process. HydraMap was validated on two external test sets, where it produced comparable results as 3D-RISM and WATsite but was 30−1000 times faster. In addition, we have attempted to estimate the desolvation energy associated with water molecule replacement upon ligand binding based on the outcomes of HydraMap. This desolvation term, called DEWED, was incorporated into the framework of four scoring functions, i.e., ASP, ChemPLP, GoldScore, and X-Score. The derivative scoring functions were tested in terms of scoring power, docking power, and screening power on a range of data sets. It was observed that X-Score exhibited the most obvious improvement in accuracy after adding the DEWED terms. Moreover, all scoring functions augmented with the DEWED terms exhibited improved or comparable performance on most data sets as the corresponding ones augmented with the GB/SA terms. Our study has demonstrated the potential application of HydraMap and DEWED to the formulation of new scoring functions. A beta-version of the HydraMap software is freely available from our Web site (http://www.sioc-ccbg.ac.cn/software/hydramap/) for testing.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Holloway M.K."
                    },
                    {
                        "name": "Wang R."
                    }
                ],
                "citationCount": 3,
                "date": "2020-09-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Prediction of the favorable hydration sites in a protein binding pocket and its application to scoring function formulation"
            },
            "pmid": "32401510"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}