{
    "additionDate": "2021-01-18T08:34:30Z",
    "biotoolsCURIE": "biotools:circminer",
    "biotoolsID": "circminer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hasghari@sfu.ca",
            "name": "Faraz Hach",
            "typeEntity": "Person"
        }
    ],
    "description": "CircMiner is Accurate and Rapid Detection of Circular RNA through Splice-Aware Pseudo-Alignment Scheme. It is a sensitive and fast computational tool for detecting circular RNAs (circRNAs) from RNA-Seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vpc-ccg/circminer",
    "language": [
        "C++",
        "Python",
        "C"
    ],
    "lastUpdate": "2021-02-11T18:59:39Z",
    "license": "GPL-3.0",
    "name": "CircMiner",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA232",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: The ubiquitous abundance of circular RNAs (circRNAs) has been revealed by performing highthroughput sequencing in a variety of eukaryotes. circRNAs are related to some diseases, such as cancer in which they act as oncogenes or tumor-suppressors and, therefore, have the potential to be used as biomarkers or therapeutic targets. Accurate and rapid detection of circRNAs from short reads remains computationally challenging. This is due to the fact that identifying chimeric reads, which is essential for finding back-splice junctions, is a complex process. The sensitivity of discovery methods, to a high degree, relies on the underlying mapper that is used for finding chimeric reads. Furthermore, all the available circRNA discovery pipelines are resource intensive. Results: We introduce CircMiner, a novel stand-alone circRNA detection method that rapidly identifies and filters out linear RNA sequencing reads and detects back-splice junctions. CircMiner employs a rapid pseudo-alignment technique to identify linear reads that originate from transcripts, genes or the genome. CircMiner further processes the remaining reads to identify the back-splice junctions and detect circRNAs with single-nucleotide resolution. We evaluated the efficacy of CircMiner using simulated datasets generated from known back-splice junctions and showed that CircMiner has superior accuracy and speed compared to the existing circRNA detection tools. Additionally, on two RNase R treated cell line datasets, CircMiner was able to detect most of consistent, high confidence circRNAs compared to untreated samples of the same cell line. Availability and implementation: CircMiner is implemented in C++ and is available online at https://github.com/ vpc-ccg/circminer.",
                "authors": [
                    {
                        "name": "Asghari H."
                    },
                    {
                        "name": "Lin Y.-Y."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Haghshenas E."
                    },
                    {
                        "name": "Collins C.C."
                    },
                    {
                        "name": "Hach F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CircMiner: Accurate and rapid detection of circular RNA through splice-aware pseudo-alignment scheme"
            },
            "pmid": "32259207"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}