{
    "additionDate": "2020-01-09T18:13:21Z",
    "biotoolsCURIE": "biotools:RAM-ESVM",
    "biotoolsID": "RAM-ESVM",
    "confidence_flag": "tool",
    "description": "A comprehensive comparison and analysis of computational predictors for RNA N6-methyladenosine sites of Saccharomyces cerevisiae.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://server.malab.cn/RAM-ESVM/",
    "lastUpdate": "2021-01-15T18:39:40Z",
    "name": "RAM-ESVM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BFGP/ELZ018",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.N6-methyladenosine (m6A) modification, as one of the commonest post-transcription modifications in RNAs, has been reported to be highly related to many biological processes. Over the past decade, several tools for m6A sites prediction of Saccharomyces cerevisiae have been developed and are freely available online. However, the quality of predictions by these tools is difficult to quantify and compare. In this study, an independent dataset M6Atest6540 was compiled to systematically evaluate nine publicly available m6A prediction tools for S. cerevisiae. The experimental results indicate that RAM-ESVM achieved the best performance on M6Atest6540; however, most models performed substantially worse than their performances reported in the original papers. The benchmark dataset Met2614, which was used as the training dataset for the nine methods, were further analyzed by using a position bias index. The results demonstrated the significantly different bias of dataset Met2614 compared with the RNA segments around m6A sites recorded in RMBase. Moreover, newMet2614 was collected by randomly selecting RNA segments from non-redundant data recorded in RMBase, and three different kinds of features were extracted. The performances of the models built on Met2614 and newMet2614 with the features were compared, which shows the better generalization of models built on newMet2614. Our results also indicate the position-specific propensity-based features outperform other features, although they are also easily over-fitted on a biased dataset.",
                "authors": [
                    {
                        "name": "Zhu X."
                    },
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Zhao S."
                    },
                    {
                        "name": "Tao W."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Bi S."
                    }
                ],
                "citationCount": 34,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Briefings in Functional Genomics",
                "title": "A comprehensive comparison and analysis of computational predictors for RNA N6-methyladenosine sites of Saccharomyces cerevisiae"
            },
            "pmid": "31609411"
        }
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}