{
    "additionDate": "2020-01-09T18:15:13Z",
    "biotoolsCURIE": "biotools:InterVA-5",
    "biotoolsID": "InterVA-5",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "laith.hussain@gu.se",
            "name": "Laith Hussain-Alkhateeb",
            "typeEntity": "Person"
        }
    ],
    "description": "Adding Circumstances Of Mortality CATegories (COMCATs) to deaths investigated by verbal autopsy.\n\nfiles relating to evaluation of InterVA-5 software.\n\nResources relating to InterVA-5 verbal autopsy software.\n\nSoftware for WHO verbal autopsy standards.\n\nInterVA provides the leading public-domain resources for interpreting verbal autopsy data.\n\nInterVA is a suite of computer models to facilitate interpreting VAs, and the latest versions and information are available on a public-domain basis from this site. This research is based at the Umeå Centre for Global Health Research, in northern Sweden, which also hosted the World Health Organization Collaborating Centre for Verbal Autopsy from 2012 to 2016.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://www.byass.uk/interva/products.htm"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "homepage": "http://www.interva.net",
    "lastUpdate": "2020-12-14T12:51:46Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/peterbyass/InterVA-5"
        }
    ],
    "name": "InterVA-5",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/16549716.2019.1680068",
            "metadata": {
                "abstract": "© 2019, © 2019 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.Half of the world’s deaths and their causes pass unrecorded by routine registration systems, particularly in low- and middle-income countries. Verbal autopsy (VA) collects information on medical signs, symptoms and circumstances from witnesses of a death that is used to assign likely medical causes. To further contextualise information on mortality, understanding underlying determinants, such as logistics, barriers to service utilisation and health systems responses, is important for health planning. Adding systematic methods for categorising circumstantial determinants of death to conventional VA tools is therefore important. In this context, the World Health Organization (WHO) leads the development of international standards for VA, and added questions on the social and health systems circumstances of death in 2012. This paper introduces a pragmatic and scalable approach for assigning relevant Circumstances Of Mortality CATegories (COMCATs) within VA tools, and examines their consistency, reproducibility and plausibility for health policy making, as well as assessing additional effort and cost to the routine VA process. This innovative COMCAT model is integrated with InterVA-5 software (which processes WHO-2016 VA data), for assigning numeric likelihoods to six circumstantial categories for each death. VA data from 4,116 deaths in the Agincourt Health and Socio-Demographic Surveillance System in South Africa from 2012 to 2016 were used to demonstrate proof of principle for COMCATs. Lack of resources to access health care, poor recognition of diseases and inadequate health systems responses ranked highest among COMCATs in the demonstration dataset. COMCATs correlated plausibly with age, sex, causes of death and local knowledge of the demonstration population. The COMCAT approach appears to be plausible, feasible and enhances the functionality of routine VA to account for critical limiting circumstances at and around the time of death. It is a promising tool for evaluating progress towards the Sustainable Development Goals and the roll-out of Universal Health Coverage.",
                "authors": [
                    {
                        "name": "Byass P."
                    },
                    {
                        "name": "D'Ambruoso L."
                    },
                    {
                        "name": "Hussain-Alkhateeb L."
                    },
                    {
                        "name": "Kahn K."
                    },
                    {
                        "name": "Petzold M."
                    },
                    {
                        "name": "Schioler L."
                    },
                    {
                        "name": "Tollman S."
                    },
                    {
                        "name": "Twine R."
                    },
                    {
                        "name": "Van Der Merwe M."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Global Health Action",
                "title": "Enhancing the value of mortality data for health systems: adding Circumstances Of Mortality CATegories (COMCATs) to deaths investigated by verbal autopsy"
            },
            "pmcid": "PMC6818104",
            "pmid": "31648624"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gynaecology and obstetrics",
            "uri": "http://edamontology.org/topic_3411"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
