{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-10-27T19:35:20.311937Z",
    "biotoolsCURIE": "biotools:chartsweep",
    "biotoolsID": "chartsweep",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "wausten@partners.org",
            "name": "William G. Austen",
            "typeEntity": "Person"
        }
    ],
    "description": "ChartSweep is an open-source tool that can be customized for use with any electronic health record system.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=34150426",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-27T19:35:20.314653Z",
    "name": "ChartSweep",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1097/GOX.0000000000003633",
            "metadata": {
                "abstract": "© 2021 Lippincott Williams and Wilkins. All rights reserved.Summary: Retrospective chart review (RCR) is the process of manual patient data review to answer research questions. Large and heterogeneous datasets make the RCR process time-consuming, with potential to introduce errors. The authors therefore designed and developed ChartSweep to expedite the RCR process while remaining faithful to its methodological rigor. ChartSweep is an open-source tool that can be customized for use with any electronic health record system. ChartSweep was developed by the authors to extract information from electronic health records using the Python coding language. As proof-of-concept, the tool was tested in three studies: RCR1 - Identification of subjects who underwent radiofrequency ablation in a cohort of patients who had undergone headache surgery (n = 172); RCR2 - Identification of patients with a diagnosis of thoracic outlet syndrome in patients who underwent peripheral neuroplasty (n = 806); RCR3 - Identification of patients with a history of implant illness or breast implant-associated anaplastic large cell lymphoma in patients who had undergone implant-based breast augmentation or reconstruction (n = 1133). Inter-rater reliability was assessed. ChartSweep reduced the time required to conduct RCR1 by 1315 minutes (21.9 hours), RCR2 by 1664 minutes (27.7 hours), and RCR3 by 2215 minutes (36.9 hours). Inter-rater reliability was uncompromised (k = 1.00). Open-source Python libraries as leveraged by ChartSweep significantly accelerate the RCR process in plastic surgery research. Quality of data review is not compromised. Further analyses with larger, heterogeneous study populations are required to further validate ChartSweep as a research tool.",
                "authors": [
                    {
                        "name": "Chartier C."
                    },
                    {
                        "name": "Gfrerer L."
                    },
                    {
                        "name": "Austen W.G."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Plastic and Reconstructive Surgery - Global Open",
                "title": "ChartSweep: A HIPAA-compliant Tool to Automate Chart Review for Plastic Surgery Research"
            },
            "pmcid": "PMC8205215",
            "pmid": "34150426"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ]
}