{
    "additionDate": "2019-11-14T18:07:04Z",
    "biotoolsCURIE": "biotools:UNIPred-Web",
    "biotoolsID": "UNIPred-Web",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mesiti@di.unimi.it",
            "name": "Marco Mesiti",
            "typeEntity": "Person"
        }
    ],
    "description": "a web tool for the integration and visualization of biomolecular networks for protein function prediction | In order to execute an experiment, you must first create an experiment design | {{ experiment.name }}-{{ experiment.newid }}",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://unipred.di.unimi.it",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-02T09:51:45Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://unipred.di.unimi.it/?load=2592"
        }
    ],
    "name": "UNIPred-Web",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2959-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: One of the main issues in the automated protein function prediction (AFP) problem is the integration of multiple networked data sources. The UNIPred algorithm was thereby proposed to efficiently integrate - in a function-specific fashion - the protein networks by taking into account the imbalance that characterizes protein annotations, and to subsequently predict novel hypotheses about unannotated proteins. UNIPred is publicly available as R code, which might result of limited usage for non-expert users. Moreover, its application requires efforts in the acquisition and preparation of the networks to be integrated. Finally, the UNIPred source code does not handle the visualization of the resulting consensus network, whereas suitable views of the network topology are necessary to explore and interpret existing protein relationships. Results: We address the aforementioned issues by proposing UNIPred-Web, a user-friendly Web tool for the application of the UNIPred algorithm to a variety of biomolecular networks, already supplied by the system, and for the visualization and exploration of protein networks. We support different organisms and different types of networks - e.g., co-expression, shared domains and physical interaction networks. Users are supported in the different phases of the process, ranging from the selection of the networks and the protein function to be predicted, to the navigation of the integrated network. The system also supports the upload of user-defined protein networks. The vertex-centric and the highly interactive approach of UNIPred-Web allow a narrow exploration of specific proteins, and an interactive analysis of large sub-networks with only a few mouse clicks. Conclusions: UNIPred-Web offers a practical and intuitive (visual) guidance to biologists interested in gaining insights into protein biomolecular functions. UNIPred-Web provides facilities for the integration of networks, and supplies a framework for the imbalance-aware protein network integration of nine organisms, the prediction of thousands of GO protein functions, and a easy-to-use graphical interface for the visual analysis, navigation and interpretation of the integrated networks and of the functional predictions.",
                "authors": [
                    {
                        "name": "Ba C.T."
                    },
                    {
                        "name": "Casiraghi E."
                    },
                    {
                        "name": "Frasca M."
                    },
                    {
                        "name": "Gliozzo J."
                    },
                    {
                        "name": "Grossi G."
                    },
                    {
                        "name": "Mesiti M."
                    },
                    {
                        "name": "Notaro M."
                    },
                    {
                        "name": "Perlasca P."
                    },
                    {
                        "name": "Petrini A."
                    },
                    {
                        "name": "Valentini G."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "UNIPred-Web: A web tool for the integration and visualization of biomolecular networks for protein function prediction"
            },
            "pmcid": "PMC6694573",
            "pmid": "31412768"
        }
    ],
    "topic": [
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
