{
    "additionDate": "2021-01-18T11:18:59Z",
    "biotoolsCURIE": "biotools:plastrans",
    "biotoolsID": "plastrans",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hzhou@smu.edu.cn",
            "name": "Hongwei Zhou",
            "orcidid": "https://orcid.org/0000-0003-2472-8541",
            "typeEntity": "Person"
        }
    ],
    "description": "PlasTrans: Identify the conjugative and mobilizable plasmid fragments in plasmidome using sequence signatures.\n\nPlasTrans is designed to distinguish the transmissible plasmid-derived sequences from the non-transmissible plasmid-derived sequences in the plasmid metageomic data. It take a \"fasta\" file that contains the plasmid sequences as input and outputs a tabular file with transferability annotation for each sequence.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Plasmid map drawing",
                    "uri": "http://edamontology.org/operation_0578"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhenchengfang/PlasTrans",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-01-24T07:49:38Z",
    "license": "GPL-3.0",
    "name": "PlasTrans",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1099/MGEN.0.000459",
            "metadata": {
                "abstract": "© 2020 The Authors.Plasmids are the key element in horizontal gene transfer in the microbial community. Recently, a large number of experimental and computational methods have been developed to obtain the plasmidomes of microbial communities. Distinguishing transmissible plasmid sequences, which are derived from conjugative or at least mobilizable plasmids, from non-transmissible plasmid sequences in the plasmidome is essential for understanding the diversity of plasmids and how they regulate the microbial community. Unfortunately, due to the highly fragmented characteristics of DNA sequences in the plasmidome, effective identification methods are lacking. In this work, we used information entropy from information theory to assess the randomness of synonymous codon usage over 4424 plasmid genomes. The results showed that for all amino acids, the choice of a synonymous codon in conjugative and mobilizable plasmids is more random than that in non-transmissible plasmids, indicating that transmissible plasmids have different sequence signatures from non-transmissible plasmids. Inspired by this phenomenon, we further developed a novel algorithm named PlasTrans. PlasTrans takes the triplet code sequences and base sequences of plasmid DNA fragments as input and uses the convolutional neural network of the deep learning technique to further extract the more complex signatures of the plasmid sequences and identify the conjugative and mobilizable DNA fragments. Tests showed that PlasTrans could achieve an AUC of as high as 84–91%, even though the fragments only contained hundreds of base pairs. To the best of our knowledge, this is the first quantitative analysis of the difference in sequence signatures between transmissible and non-transmissible plasmids, and we developed the first tool to perform transferability annotation for DNA fragments in the plasmidome. We expect that PlasTrans will be a useful tool for researchers who analyse the properties of novel plasmids in the microbial community and horizontal gene transfer, especially the spread of resistance genes and virulence factors associated with plasmids. PlasTrans is freely available via https://github.com/zhenchengfang/PlasTrans.",
                "authors": [
                    {
                        "name": "Fang Z."
                    },
                    {
                        "name": "Zhou H."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "Identification of the conjugative and mobilizable plasmid fragments in the plasmidome using sequence signatures"
            },
            "pmcid": "PMC7725325",
            "pmid": "33074084"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}