{
    "additionDate": "2021-01-18T10:09:15Z",
    "biotoolsCURIE": "biotools:pranc",
    "biotoolsID": "pranc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anastasiia.kim@protonmail.com",
            "name": "Anastasiia Kim",
            "typeEntity": "Person"
        }
    ],
    "description": "ML species tree estimation from the ranked gene trees under coalescence.\n\ncan be used to compute the probabilities of ranked or unranked phylogenetic gene tree topologies given a species tree under the coalescent process. A ranked tree depicts not only the topological relationship among gene lineages, as an unranked tree does, but also the sequence in which the lineages coalesce. PRANC can also output \"democratic vote\" (most frequent) ranked or unranked topologies. PRANC can estimate the maximum likelihood species tree with branch lengths from the sample of ranked or unranked gene tree topologies. Greedy consensus tree can be used as a starting tree. Also, trees selected by the minimization of ancient coalescence (MAC) criterion can be used as starting trees.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree construction (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                },
                {
                    "term": "Consensus tree construction",
                    "uri": "http://edamontology.org/operation_0555"
                }
            ]
        }
    ],
    "homepage": "http://github.com/anastasiiakim/PRANC",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2021-01-30T10:37:03Z",
    "license": "MIT",
    "name": "PRANC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA605",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Summary: PRANC computes the Probabilities of RANked gene tree topologies under the multispecies coalescent. A ranked gene tree is a gene tree accounting for the temporal ordering of internal nodes. PRANC can also estimate the maximum likelihood (ML) species tree from a sample of ranked or unranked gene tree topologies. It estimates the ML tree with estimated branch lengths in coalescent units.",
                "authors": [
                    {
                        "name": "Kim A."
                    },
                    {
                        "name": "Degnan J.H."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PRANC: ML species tree estimation from the ranked gene trees under coalescence"
            },
            "pmcid": "PMC7750968",
            "pmid": "32609371"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ]
}