{
    "additionDate": "2022-11-08T08:08:55.628573Z",
    "biotoolsCURIE": "biotools:knockofftrio",
    "biotoolsID": "knockofftrio",
    "confidence_flag": "tool",
    "description": "KnockoffTrio, a statistical method to identify putative causal genetic variants for father-mother-child trio design built upon a recently developed knockoff framework in statistics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/KnockoffTrio/",
    "lastUpdate": "2024-11-24T15:21:58.973705Z",
    "license": "GPL-3.0",
    "name": "KnockoffTrio",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ajhg.2022.08.013",
            "metadata": {
                "abstract": "Family-based designs can eliminate confounding due to population substructure and can distinguish direct from indirect genetic effects, but these designs are underpowered due to limited sample sizes. Here, we propose KnockoffTrio, a statistical method to identify putative causal genetic variants for father-mother-child trio design built upon a recently developed knockoff framework in statistics. KnockoffTrio controls the false discovery rate (FDR) in the presence of arbitrary correlations among tests and is less conservative and thus more powerful than the conventional methods that control the family-wise error rate via Bonferroni correction. Furthermore, KnockoffTrio is not restricted to family-based association tests and can be used in conjunction with more powerful, potentially nonlinear models to improve the power of standard family-based tests. We show, using empirical simulations, that KnockoffTrio can prioritize causal variants over associations due to linkage disequilibrium and can provide protection against confounding due to population stratification. In applications to 14,200 trios from three study cohorts for autism spectrum disorders (ASDs), including AGP, SPARK, and SSC, we show that KnockoffTrio can identify multiple significant associations that are missed by conventional tests applied to the same data. In particular, we replicate known ASD association signals with variants in several genes such as MACROD2, NRXN1, PRKAR1B, CADM2, PCDH9, and DOCK4 and identify additional associations with variants in other genes including ARHGEF10, SLC28A1, ZNF589, and HINT1 at FDR 10%.",
                "authors": [
                    {
                        "name": "Buxbaum J."
                    },
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Ionita-Laza I."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2022-10-06T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "KnockoffTrio: A knockoff framework for the identification of putative causal variants in genome-wide association studies with trio design"
            },
            "pmcid": "PMC9606389",
            "pmid": "36150388"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
