{
    "accessibility": "Open access",
    "additionDate": "2024-02-25T14:09:02.787171Z",
    "biotoolsCURIE": "biotools:gmmad",
    "biotoolsID": "gmmad",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fbguoy@whu.edu.cn",
            "name": "Feng-Biao Guo",
            "typeEntity": "Person"
        },
        {
            "name": "Cheng-Yu Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Xia Kuang",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive database of human gut microbial metabolite associations with diseases.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "http://guolab.whu.edu.cn/GMMAD",
    "lastUpdate": "2024-02-25T14:09:02.789645Z",
    "license": "CC-BY-4.0",
    "name": "GMMAD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-023-09599-5",
            "metadata": {
                "abstract": "Background: The natural products, metabolites, of gut microbes are crucial effect factors on diseases. Comprehensive identification and annotation of relationships among disease, metabolites, and microbes can provide efficient and targeted solutions towards understanding the mechanism of complex disease and development of new markers and drugs. Results: We developed Gut Microbial Metabolite Association with Disease (GMMAD), a manually curated database of associations among human diseases, gut microbes, and metabolites of gut microbes. Here, this initial release (i) contains 3,836 disease-microbe associations and 879,263 microbe-metabolite associations, which were extracted from literatures and available resources and then experienced our manual curation; (ii) defines an association strength score and a confidence score. With these two scores, GMMAD predicted 220,690 disease-metabolite associations, where the metabolites all belong to the gut microbes. We think that the positive effective (with both scores higher than suggested thresholds) associations will help identify disease marker and understand the pathogenic mechanism from the sense of gut microbes. The negative effective associations would be taken as biomarkers and have the potential as drug candidates. Literature proofs supported our proposal with experimental consistence; (iii) provides a user-friendly web interface that allows users to browse, search, and download information on associations among diseases, metabolites, and microbes. The resource is freely available at http://guolab.whu.edu.cn/GMMAD . Conclusions: As the online-available unique resource for gut microbial metabolite-disease associations, GMMAD is helpful for researchers to explore mechanisms of disease- metabolite-microbe and screen the drug and marker candidates for different diseases.",
                "authors": [
                    {
                        "name": "Cheng Z.-S."
                    },
                    {
                        "name": "Deng Z.-X."
                    },
                    {
                        "name": "Guo F.-B."
                    },
                    {
                        "name": "Kuang X."
                    },
                    {
                        "name": "Wang C.-Y."
                    },
                    {
                        "name": "Wang Q.-Q."
                    },
                    {
                        "name": "Zhang G.-Q."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GMMAD: a comprehensive database of human gut microbial metabolite associations with diseases"
            },
            "pmcid": "PMC10464125",
            "pmid": "37620754"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
