{
    "name": "OVPDT", 
    "description": "Ordered Subset – Variable Threshold – Pedigree Disequilibrium Test,  a family-based association test using both common and rare variants and accounting for directions of effects for sequencing data.", 
    "homepage": "http://sourceforge.net/projects/ovpdt/", 
    "biotoolsID": "ovpdt", 
    "biotoolsCURIE": "biotools:ovpdt", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2478", 
                    "term": "Nucleic acid sequence analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }, 
        {
            "uri": "http://edamontology.org/topic_0199", 
            "term": "Genetic variation"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/ovpdt-a-family-based-association-test-for-sequencing-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://sourceforge.net/projects/ovpdt/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25244564", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Family-based association test using both common and rare variants and accounting for directions of effects for sequencing data", 
                "abstract": "© 2014 Chung et al. Current family-based association tests for sequencing data were mainly developed for identifying rare variants associated with a complex disease. As the disease can be influenced by the joint effects of common and rare variants, common variants with modest effects may not be identified by the methods focusing on rare variants. Moreover, variants can have risk, neutral, or protective effects. Association tests that can effectively select groups of common and rare variants that are likely to be causal and consider the directions of effects have become important. We developed the Ordered Subset - Variable Threshold - Pedigree Disequilibrium Test (OVPDT), a combination of three algorithms, for association analysis in family sequencing data. The ordered subset algorithm is used to select a subset of common variants based on their relative risks, calculated using only parental mating types. The variable threshold algorithm is used to search for an optimal allele frequency threshold such that rare variants below the threshold are more likely to be causal. The PDT statistics from both rare and common variants selected by the two algorithms are combined as the OVPDT statistic. A permutation procedure is used in OVPDT to calculate the p-value. We used simulations to demonstrate that OVPDT has the correct type I error rates under different scenarios and compared the power of OVPDT with two other family-based association tests. The results suggested that OVPDT can have more power than the other tests if both common and rare variants have effects on the disease in a region.", 
                "date": "2014-09-22T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Chung R.-H."
                    }, 
                    {
                        "name": "Tsai W.-Y."
                    }, 
                    {
                        "name": "Martin E.R."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Ren-Hua Chung", 
            "email": "rchung@nhri.org.tw", 
            "url": "http://rclab.nhri.org.tw/rclab/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:53:09Z", 
    "lastUpdate": "2018-12-10T12:58:49Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}