{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T00:59:59.265863Z",
    "biotoolsCURIE": "biotools:rmechdb",
    "biotoolsID": "rmechdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Mohammadamin Tavakoli"
        },
        {
            "name": "Ann Marie Carlton",
            "orcidid": "https://orcid.org/0000-0002-8574-1507"
        },
        {
            "name": "David Van Vranken",
            "orcidid": "https://orcid.org/0000-0001-5964-7042"
        },
        {
            "name": "Pierre Baldi",
            "orcidid": "https://orcid.org/0000-0001-8752-4664"
        },
        {
            "name": "Yin Ting T. Chiu",
            "orcidid": "https://orcid.org/0000-0001-5449-8391"
        }
    ],
    "description": "A Public Database of Elementary Radical Reaction Steps.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://deeprxn.ics.uci.edu/rmechdb/",
    "lastUpdate": "2024-11-24T14:54:22.930353Z",
    "name": "RMechDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c01359",
            "metadata": {
                "abstract": "We introduce RMechDB, an open-access platform for aggregating, curating, and distributing reliable data about elementary radical reaction steps for computational radical reaction modeling and prediction. RMechDB contains over 5,300 elementary radical reaction steps, each with a single transition state at or around room temperature. These elementary step reactions are manually curated plausible arrow-pushing steps for organic radical reactions. The steps were taken from a variety of sources. Over 2,000 mechanistic steps were extracted from textbooks and/or constructed from research publications. Another 3,000 were taken from gas-phase atmospheric reactions of isoprene and other organic molecules on the MCM (Master Chemical Mechanism) Web site. Reactions are encoded in the SMIRKS format with accurate atom mapping and annotations for arrow-pushing mechanisms. At its core, RMechDB consists of a database schema with an online interactive search interface and a request portal for downloading the raw form of elementary step reactions with their metadata. It also offers an interface for submitting new reactions to RMechDB and expanding the data set through community contributions. Although there are several applications for RMechDB, it is primarily designed as a central platform of radical elementary steps with a unified and structured representation. We believe that this open access to this data and platform enables the extension of data-driven models for chemical reaction predictions and other chemoinformatics predictive tasks.",
                "authors": [
                    {
                        "name": "Baldi P."
                    },
                    {
                        "name": "Carlton A.M."
                    },
                    {
                        "name": "Chiu Y.T.T."
                    },
                    {
                        "name": "Tavakoli M."
                    },
                    {
                        "name": "Van Vranken D."
                    }
                ],
                "citationCount": 7,
                "date": "2023-02-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "RMechDB: A Public Database of Elementary Radical Reaction Steps"
            },
            "pmcid": "PMC9976277",
            "pmid": "36799778"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}
