{
    "accessibility": "Open access",
    "additionDate": "2024-03-22T16:43:12.758715Z",
    "biotoolsCURIE": "biotools:adp-fuse",
    "biotoolsID": "adp-fuse",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bala2022@skku.edu",
            "name": "Balachandran Manavalan",
            "typeEntity": "Person"
        },
        {
            "name": "Shaherin Basith",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel two-layer machine learning predictor to identify antidiabetic peptides and diabetes types using multiview information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "https://balalab-skku.org/ADP-Fuse",
    "lastUpdate": "2024-11-24T14:06:54.106874Z",
    "name": "ADP-Fuse",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2023.107386",
            "metadata": {
                "abstract": "Diabetes mellitus has become a major public health concern associated with high mortality and reduced life expectancy and can cause blindness, heart attacks, kidney failure, lower limb amputations, and strokes. A new generation of antidiabetic peptides (ADPs) that act on β-cells or T-cells to regulate insulin production is being developed to alleviate the effects of diabetes. However, the lack of effective peptide-mining tools has hampered the discovery of these promising drugs. Hence, novel computational tools need to be developed urgently. In this study, we present ADP-Fuse, a novel two-layer prediction framework capable of accurately identifying ADPs or non-ADPs and categorizing them into type 1 and type 2 ADPs. First, we comprehensively evaluated 22 peptide sequence-derived features coupled with eight notable machine learning algorithms. Subsequently, the most suitable feature descriptors and classifiers for both layers were identified. The output of these single-feature models, embedded with multiview information, was trained with an appropriate classifier to provide the final prediction. Comprehensive cross-validation and independent tests substantiate that ADP-Fuse surpasses single-feature models and the feature fusion approach for the prediction of ADPs and their types. In addition, the SHapley Additive exPlanation method was used to elucidate the contributions of individual features to the prediction of ADPs and their types. Finally, a user-friendly web server for ADP-Fuse was developed and made publicly accessible (https://balalab-skku.org/ADP-Fuse), enabling the swift screening and identification of novel ADPs and their types. This framework is expected to contribute significantly to antidiabetic peptide identification.",
                "authors": [
                    {
                        "name": "Basith S."
                    },
                    {
                        "name": "Lee G."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Pham N.T."
                    },
                    {
                        "name": "Song M."
                    }
                ],
                "citationCount": 11,
                "date": "2023-10-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "ADP-Fuse: A novel two-layer machine learning predictor to identify antidiabetic peptides and diabetes types using multiview information"
            },
            "pmid": "37619323"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
