{
    "additionDate": "2021-01-18T09:03:36Z",
    "biotoolsCURIE": "biotools:protspom",
    "biotoolsID": "protspom",
    "confidence_flag": "tool",
    "description": "Estimating the Effect of Single-Point Mutations on Protein Thermodynamic Stability and Analyzing the Mutation Landscape of the p53 Protein.\n\nEstimating Change in Protein Thermodynamic Stability owing to Single Point Mutation.\n\nDeveloped for protein structures, ProTSPoM uses a combination of Random Forest Regressors (RFR) and Gradient Boosted Regressors (GBR) along with residue properties, fold level attributes, environmental compatibility, and evolutionary information to predict the change in Gibbs free energy originating out of single point missense mutations. ProTSPoM outperforms all existing state-of-the-art methods in both the Pearson correlation coefficient and root-mean-squared-error parameters for the S2648, S350, S1925 and p53 databases (even if we do not include evolutionary information).\n\nProTSPoM execuatable ProTSPoM benchmark data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                }
            ]
        }
    ],
    "homepage": "http://cosmos.iitkgp.ac.in/ProTSPoM/",
    "lastUpdate": "2021-01-29T17:38:41Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://cse.iitkgp.ac.in/~pralay/resources/ProTSPoM/"
        }
    ],
    "name": "ProTSPoM",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00256",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Nonsynonymous single-nucleotide polymorphisms often result in altered protein stability while playing crucial roles both in the evolution process and in the development of human diseases. Prediction of change in the thermodynamic stability due to such missense mutations will help in protein engineering endeavors and will contribute to a better understanding of different disease conditions. Here, we develop a machine-learning-based framework, viz., ProTSPoM, to estimate the change in protein thermodynamic stability arising out of single-point mutations (SPMs). ProTSPoM outperforms existing methods on the S2648 and S1925 databases and reports a Pearson correlation coefficient of 0.82 (0.88) and a root-mean-squared-error of 0.92 (1.06) kcal/mol between the predicted and experimental Î\"Î\"G values on the long-established S350 (tumor suppressor p53 protein) data set. Further, we estimate the change in thermodynamic stability for all possible SPMs in the DNA binding domain of the p53 protein. We identify single-nucleotide polymorphisms in p53 which are plausibly detrimental to its structural integrity and interaction affinity with the DNA molecule. ProTSPoM with its reliable estimates and time-efficient prediction is well suited to be integrated with existing protein engineering techniques. The ProTSPoM web server is accessible at http://cosmos.iitkgp.ac.in/ProTSPoM/.",
                "authors": [
                    {
                        "name": "Banerjee A."
                    },
                    {
                        "name": "Mitra P."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-22T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Estimating the Effect of Single-Point Mutations on Protein Thermodynamic Stability and Analyzing the Mutation Landscape of the p53 Protein"
            },
            "pmid": "32401507"
        }
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}