{"credit":[{"name":"Savant Forum","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://groups.google.com/forum/?fromgroups#!forum/savant-community"}],"function":[{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"},{"term":"Genome visualisation","uri":"http://edamontology.org/operation_3208"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"}]},"publication":[{"abstract":"High-throughput sequencing (HTS) technologies are providing an unprecedented capacity for data generation, and there is a corresponding need for efficient data exploration and analysis capabilities. Although most existing tools for HTS data analysis are developed for either automated (e.g. genotyping) or visualization (e.g. genome browsing) purposes, such tools are most powerful when combined. For example, integration of visualization and computation allows users to iteratively refine their analyses by updating computational parameters within the visual framework in real-time. Here we introduce the second version of the Savant Genome Browser, a standalone program for visual and computational analysis of HTS data. Savant substantially improves upon its predecessor and existing tools by introducing innovative visualization modes and navigation interfaces for several genomic datatypes, and synergizing visual and automated analyses in a way that is powerful yet easy even for non-expert users. We also present a number of plugins that were developed by the Savant Community, which demonstrate the power of integrating visual and automated analyses using Savant. The Savant Genome Browser is freely available (open source) at www.savantbrowser.com. © 2012 The Author(s).","authors":["Fiume M.","Smith E.J.M.","Brook A.","Strbenac D.","Turner B.","Mezlini A.M.","Robinson M.D.","Wodak S.J.","Brudno M."],"cit_count":32,"journal":"Nucleic Acids Research","pmid":"22638571","title":"Savant Genome Browser 2: Visualization and analysis for population-scale genomics","year":"2012-07-01"}],"summary":{"biotoolsCURIE":"biotools:savant_genome_browser","biotoolsID":"savant_genome_browser","description":"Allows for visualization of genomic data. Developed for visualizing high throughput (next generation) sequencing data, it can also be used to visualize virtually any genome-based sequence, point, interval, or continuous dataset.","homepage":"http://www.savantbrowser.com","name":"Savant Genome Browser"}}