{
    "additionDate": "2020-01-09T18:03:51Z",
    "biotoolsCURIE": "biotools:CircaCompare",
    "biotoolsID": "CircaCompare",
    "confidence_flag": "tool",
    "description": "A method to estimate and statistically support differences in mesor, amplitude, and phase, between circadian rhythms.\n\ncircacompare is an R package that allows for the statistical analyses and comparison of two circadian rhythms. This work is published here and can be cited as:.\n\nRex Parsons, Richard Parsons, Nicholas Garner, Henrik Oster, Oliver Rawashdeh, CircaCompare: A method to estimate and statistically support differences in mesor, amplitude, and phase, between circadian rhythms, Bioinformatics, https://doi.org/10.1093/bioinformatics/btz730",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RWParsons/circacompare/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-11T21:02:04Z",
    "link": [
        {
            "note": "Implementation in Python",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/RWParsons/circacompare_py"
        }
    ],
    "name": "CircaCompare",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ730",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: A fundamental interest in chronobiology is to compare patterns between groups of rhythmic data. However, many existing methods are ill-equipped to derive statements concerning the statistical significance of differences between rhythms that may be visually apparent. This is attributed to both the form of data used (longitudinal versus cross-sectional) and the limitations of the statistical tests used to draw conclusions. Results: To address this problem, we propose that a cosinusoidal curve with a particular parametrization be used to model and compare data of two sets of observations collected over a 24-h period. The novelty of our test is in the parametrization, which allows the explicit estimation of rhythmic parameters [mesor (the rhythm-adjusted mean level of a response variable around which a wave function oscillates), amplitude and phase], and simultaneously testing for statistical significance in all three parameters between two or more groups of datasets. A statistically significant difference between two groups, regarding each of these rhythmic parameters, is indicated by a P-value. The method is evaluated by applying the model to publicly available datasets, and is further exemplified by comparison to the currently recommended method, DODR. The results suggest that the method proposed may be highly sensitive to detect rhythmic differences between groups in phase, amplitude and mesor.",
                "authors": [
                    {
                        "name": "Parsons R."
                    },
                    {
                        "name": "Parsons R."
                    },
                    {
                        "name": "Garner N."
                    },
                    {
                        "name": "Oster H."
                    },
                    {
                        "name": "Rawashdeh O."
                    }
                ],
                "citationCount": 18,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CircaCompare: A method to estimate and statistically support differences in mesor, amplitude and phase, between circadian rhythms"
            },
            "pmid": "31588519"
        }
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}