{
    "accessibility": "Open access",
    "additionDate": "2022-05-23T11:51:48.279271Z",
    "biotoolsCURIE": "biotools:mdrsa",
    "biotoolsID": "mdrsa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "horng@db.csie.ncu.edu.tw",
            "name": "Jorng-Tzong Horng",
            "typeEntity": "Person"
        },
        {
            "email": "janglu45@gmail.com",
            "name": "Jang-Jih Lu",
            "typeEntity": "Person"
        },
        {
            "email": "leetzongyi@cuhk.edu.cn",
            "name": "Tzong-Yi Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "The web-based application for rapid determination of multidrug-resistant Staphylococcus aureus with MALDI-TOF mass spectra",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "http://fdblab.csie.ncu.edu.tw/mdrsa/",
    "lastUpdate": "2022-05-23T11:52:49.672218Z",
    "name": "MDRSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FMICB.2021.766206",
            "metadata": {
                "abstract": "Copyright © 2021 Chung, Wang, Weng, Wang, Wu, Tseng, Chen, Lu, Horng and Lee.As antibiotics resistance on superbugs has risen, more and more studies have focused on developing rapid antibiotics susceptibility tests (AST). Meanwhile, identification of multiple antibiotics resistance on Staphylococcus aureus provides instant information which can assist clinicians in administrating the appropriate prescriptions. In recent years, matrix-assisted laser desorption ionization-time of flight mass spectrometry (MALDI-TOF MS) has emerged as a powerful tool in clinical microbiology laboratories for the rapid identification of bacterial species. Yet, lack of study devoted on providing efficient methods to deal with the MS shifting problem, not to mention to providing tools incorporating the MALDI-TOF MS for the clinical use which deliver the instant administration of antibiotics to the clinicians. In this study, we developed a web tool, MDRSA, for the rapid identification of oxacillin-, clindamycin-, and erythromycin-resistant Staphylococcus aureus. Specifically, the kernel density estimation (KDE) was adopted to deal with the peak shifting problem, which is critical to analyze mass spectra data, and machine learning methods, including decision trees, random forests, and support vector machines, which were used to construct the classifiers to identify the antibiotic resistance. The areas under the receiver operating the characteristic curve attained 0.8 on the internal (10-fold cross validation) and external (independent testing) validation. The promising results can provide more confidence to apply these prediction models in the real world. Briefly, this study provides a web-based tool to provide rapid predictions for the resistance of antibiotics on Staphylococcus aureus based on the MALDI-TOF MS data. The web tool is available at: http://fdblab.csie.ncu.edu.tw/mdrsa/.",
                "authors": [
                    {
                        "name": "Chen C.-H."
                    },
                    {
                        "name": "Chung C.-R."
                    },
                    {
                        "name": "Horng J.-T."
                    },
                    {
                        "name": "Lee T.-Y."
                    },
                    {
                        "name": "Lu J.-J."
                    },
                    {
                        "name": "Tseng Y.-J."
                    },
                    {
                        "name": "Wang H.-Y."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Weng J.-M."
                    },
                    {
                        "name": "Wu L.-C."
                    }
                ],
                "date": "2021-12-03T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "MDRSA: A Web Based-Tool for Rapid Identification of Multidrug Resistant Staphylococcus aureus Based on Matrix-Assisted Laser Desorption Ionization-Time of Flight Mass Spectrometry"
            },
            "pmcid": "PMC8678511",
            "pmid": "34925273"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
