{
    "additionDate": "2021-03-19T09:02:44Z",
    "biotoolsCURIE": "biotools:cantare",
    "biotoolsID": "cantare",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jsiebert@cytoanalytics.com",
            "name": "Janet C. Siebert",
            "typeEntity": "Person"
        }
    ],
    "description": "CANTARE (Consolidated Analysis of Network Topology And Regression Elements) is a workflow for building predictive regression models from network neighborhoods in multi-omic networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/cytomelodics/files/CANTARE/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-22T07:47:42Z",
    "name": "CANTARE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04016-8",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: One goal of multi-omic studies is to identify interpretable predictive models for outcomes of interest, with analytes drawn from multiple omes. Such findings could support refined biological insight and hypothesis generation. However, standard analytical approaches are not designed to be “ome aware.” Thus, some researchers analyze data from one ome at a time, and then combine predictions across omes. Others resort to correlation studies, cataloging pairwise relationships, but lacking an obvious approach for cohesive and interpretable summaries of these catalogs. Methods: We present a novel workflow for building predictive regression models from network neighborhoods in multi-omic networks. First, we generate pairwise regression models across all pairs of analytes from all omes, encoding the resulting “top table” of relationships in a network. Then, we build predictive logistic regression models using the analytes in network neighborhoods of interest. We call this method CANTARE (Consolidated Analysis of Network Topology And Regression Elements). Results: We applied CANTARE to previously published data from healthy controls and patients with inflammatory bowel disease (IBD) consisting of three omes: gut microbiome, metabolomics, and microbial-derived enzymes. We identified 8 unique predictive models with AUC > 0.90. The number of predictors in these models ranged from 3 to 13. We compare the results of CANTARE to random forests and elastic-net penalized regressions, analyzing AUC, predictions, and predictors. CANTARE AUC values were competitive with those generated by random forests and penalized regressions. The top 3 CANTARE models had a greater dynamic range of predicted probabilities than did random forests and penalized regressions (p-value = 1.35 × 10–5). CANTARE models were significantly more likely to prioritize predictors from multiple omes than were the alternatives (p-value = 0.005). We also showed that predictive models from a network based on pairwise models with an interaction term for IBD have higher AUC than predictive models built from a correlation network (p-value = 0.016). R scripts and a CANTARE User’s Guide are available at https://sourceforge.net/projects/cytomelodics/files/CANTARE/. Conclusion: CANTARE offers a flexible approach for building parsimonious, interpretable multi-omic models. These models yield quantitative and directional effect sizes for predictors and support the generation of hypotheses for follow-up investigation.",
                "authors": [
                    {
                        "name": "Siebert J.C."
                    },
                    {
                        "name": "Saint-Cyr M."
                    },
                    {
                        "name": "Borengasser S.J."
                    },
                    {
                        "name": "Wagner B.D."
                    },
                    {
                        "name": "Lozupone C.A."
                    },
                    {
                        "name": "Gorg C."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CANTARE: finding and visualizing network-based multi-omic predictive models"
            },
            "pmcid": "PMC7896366",
            "pmid": "33607938"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}