{
    "additionDate": "2017-08-03T19:04:49Z",
    "biotoolsCURIE": "biotools:zmm",
    "biotoolsID": "zmm",
    "credit": [
        {
            "email": "info@zmmsoft.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.science.mcmaster.ca/biochem/faculty/zhorov/index.html"
        }
    ],
    "description": "Molecular modeling program for theoretical studies of systems of any complexity: small molecules, peptides, proteins, nucleic acids, and ligand-receptor complexes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.securewebexchange.com/zmmsoft.com/MoreAboutZMM.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://www.zmmsoft.com/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/zmm-20120214-molecular-modeling-program-theoretical-studies-systems-complexity.html"
        }
    ],
    "name": "ZMM",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Physics-based force fields for ligand-protein docking usually determine electrostatic energy with distance-dependent dielectric (DDD) functions, which do not fully account for the dielectric permittivity variance between ∼2 in the protein core and ∼80 in bulk water. Here we propose an atom-atom solvent exposure- and distance-dependent dielectric (SEDDD) function, which accounts for both electrostatic and dehydration energy components. Docking was performed using the ZMM program, the AMBER force field, and precomputed libraries of ligand conformers. At the seeding stage, hundreds of thousands of positions and orientations of conformers from the libraries were sampled within the rigid protein. At the refinement stage, the ten lowest-energy structures from the seeding stage were Monte Carlo-minimized with the flexible ligand and flexible protein. A search was considered a success if the root mean square deviation (RMSD) of the ligand atoms in the apparent global minimum from the x-ray structure was <2 Å. Calculations on an examining set of 60 ligand-protein complexes with different DDD functions and solvent-exclusion energy revealed outliers in most of which the ligand-binding site was located at the protein surface. Using a training set of 16 ligand-protein complexes, which did not overlap with the examining set, we parameterized the SEDDD function to minimize the RMSD of the apparent global minima from the x-ray structures. Recalculation of the examining set with the SEDDD function demonstrated a 20% increase in the success rate versus the best-performing DDD function. © 2010 Springer Science+Business Media B.V.",
                "authors": [
                    {
                        "name": "Garden D.P."
                    },
                    {
                        "name": "Zhorov B.S."
                    }
                ],
                "citationCount": 56,
                "date": "2010-02-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "Docking flexible ligands in proteins with a solvent exposure- and distance-dependent dielectric function"
            },
            "pmid": "20119653"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}