{
    "additionDate": "2017-08-03T18:53:36Z",
    "biotoolsCURIE": "biotools:pasmet",
    "biotoolsID": "pasmet",
    "credit": [
        {
            "email": "pasmet@riken.jp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://metabolicsystem.riken.jp/English/index.html"
        }
    ],
    "description": "Web-based platform for predicting, modelling and analysing metabolic systems. It is a non-commercial and user-friendly tool for assisting non-experts in mathematical modelling, computing or programming to work on computational biology.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://pasmet.riken.jp/webapp/static/download/PASMET_tutorial.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://pasmet.riken.jp/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pasmet-prediction-analysis-and-simulation-of-metabolic-reaction-networks.html"
        }
    ],
    "name": "PASMet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.PASMet (Prediction, Analysis and Simulation of Metabolic networks) is a web-based platform for proposing and verifying mathematical models to understand the dynamics of metabolism. The advantages of PASMet include user-friendliness and accessibility, which enable biologists and biochemists to easily perform mathematical modelling. PASMet offers a series of user-functions to handle the time-series data of metabolite concentrations. The functions are organised into four steps: (i) Prediction of a probable metabolic pathway and its regulation; (ii) Construction of mathematical models; (iii) Simulation of metabolic behaviours; and (iv) Analysis of metabolic system characteristics. Each function contains various statistical and mathematical methods that can be used independently. Users who may not have enough knowledge of computing or programming can easily and quickly analyse their local data without software downloads, updates or installations. Users only need to upload their files in comma-separated values (CSV) format or enter their model equations directly into the website. Once the time-series data or mathematical equations are uploaded, PASMet automatically performs computation on server-side. Then, users can interactively view their results and directly download them to their local computers. PASMet is freely available with no login requirement at http://pasmet.riken.jp/ from major web browsers on Windows, Mac and Linux operating systems.",
                "authors": [
                    {
                        "name": "Arita M."
                    },
                    {
                        "name": "Hirai M.Y."
                    },
                    {
                        "name": "Mejia R.F."
                    },
                    {
                        "name": "Sriyudthsak K."
                    }
                ],
                "citationCount": 1,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "PASMet: a web-based platform for prediction, modelling and analyses of metabolic systems"
            },
            "pmid": "27174940"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
