{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bio3d.colorado.edu/"}],"documentation":[{"url":"http://bio3d.colorado.edu/ftp/SerialEM/README.txt"},{"type":"GENERAL","url":"http://bio3d.colorado.edu/SerialEM/introPres.ppt"}],"function":[{"operation":[{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["C++"],"operatingSystem":["Windows"],"toolType":["Desktop application"],"topic":[{"term":"Tomography","uri":"http://edamontology.org/topic_3452"},{"term":"Electron tomography","uri":"http://edamontology.org/topic_3452"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/serialem-3-0-2-electron-tomography-data-image-acquisition.html"}],"publication":[{"abstract":"A new method was developed to acquire images automatically at a series of specimen tilts, as required for tomographic reconstruction. The method uses changes in specimen position at previous tilt angles to predict the position at the current tilt angle. Actual measurement of the position or focus is skipped if the statistical error of the prediction is low enough. This method allows a tilt series to be acquired rapidly when conditions are good but falls back toward the traditional approach of taking focusing and tracking images when necessary. The method has been implemented in a program, SerialEM, that provides an efficient environment for data acquisition. This program includes control of an energy filter as well as a low-dose imaging mode, in which tracking and focusing occur away from the area of interest. The program can automatically acquire a montage of overlapping frames, allowing tomography of areas larger than the field of the CCD camera. It also includes tools for navigating between specimen positions and finding regions of interest. © 2005 Elsevier Inc. All rights reserved.","authors":["Mastronarde D.N."],"cit_count":924,"doi":"10.1016/j.jsb.2005.07.007","journal":"Journal of Structural Biology","title":"Automated electron microscope tomography using robust prediction of specimen movements","type":"Primary","year":"2005-10-01"}],"summary":{"biotoolsCURIE":"biotools:serialem","biotoolsID":"serialem","description":"Acquire tilt series for electron tomography on Tecnai and JEOL microscopes. It uses an approach based on prediction of specimen position during the tilt series from the position at previous tilts. It does not count on the microscope or the specimen being particularly well-behaved, so unless a prediction appears reliable, it falls back to measuring and adjusting defocus and/or specimen position when necessary.","homepage":"http://bio3d.colorado.edu/SerialEM/index.html","name":"SerialEM","version":["3.4.8"]}}