
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.evolutionarygenomics.com/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.evolutionarygenomics.com/ProgramsData/lnlcorr/LnLCorr_man.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/lnlcorr-detect-pairwise-coevolutionary-residues-set-proteins.html"
        }
    ],
    "publication": [
        {
            "abstract": "The strength and pattern of coevolution between amino acid residues vary depending on their structural and functional environment. This context dependence, along with differences in analytical technique, is responsible for the different results among coevolutionary analyses of different proteins. It is thus important to perform detailed study of individual proteins to gain better insight into how context dependence can affect coevolutionary patterns even within individual proteins, and to unravel the details of context dependence with respect to structure and function. Here we extend our previous study by presenting further analysis of residue coevolution in cytochrome c oxidase subunit I sequences from 231 vertebrates using a statistically robust phylogeny-based maximum likelihood ratio method. As in previous studies, a strong overall coevolutionary signal was detected, and coevolution within structural regions was significantly related to the Cα distances between residues. While the strong selection for adjacent residues among predicted coevolving pairs in the surface region indicates that the statistical method is highly selective for biologically relevant interactions, the coevolutionary signal was strongest in the transmembrane region, although the distances between coevolving residues were greater. This indicates that coevolution may act to maintain more global structural and functional constraints in the transmembrane region. In the transmembrane region, sites that coevolved according to polarity and hydrophobicity rather than volume had a greater tendency to colocalize with just one of the predicted proton channels (channel H). Thus, the details of coevolution in cytochrome c oxidase subunit I depend greatly on domain structure and residue physicochemical characteristics, but proximity to function appears to play a critical role. We hypothesize that coevolution is indicative of a more important functional role for this channel. © 2007 Springer Science+Business Media, LLC.",
            "authors": [
                "Wang Z.O.",
                "Pollock D.D."
            ],
            "cit_count": 19,
            "doi": "10.1007/s00239-007-9018-8",
            "journal": "Journal of Molecular Evolution",
            "pmid": "17955155",
            "title": "Coevolutionary patterns in cytochrome c oxidase subunit I depend on structural and functional context",
            "type": "Primary",
            "year": "2007-11-01"
        },
        {
            "abstract": "As complete genomes accumulate and the generation of genomic biodiversity proceeds at an accelerating pace, the need to understand the interaction between sequence evolution and protein structure and function rises in prominence. The pattern and pace of substitutions in proteins can provide important clues to functional importance, functional divergence, and adaptive response. Coevolution between amino acid residues and the context dependence of the evolutionary process are often ignored, however, because of their complexity, but they are critical for the accurate interpretation of reconstructed evolutionary events. Because residues interact with one another, and because the effect of substitutions can depend on the structural and physiological environment in which they occur, an accurate science of evolutionary functional genomics and a complete understanding of selection in proteins require a better understanding of how context dependence affects protein evolution. Here, we present new evidence from vertebrate cytochrome oxidase sequences that pairwise coevolutionary interactions between protein residues are highly dependent on tertiary and secondary structure. We also discuss theoretical predictions that impinge on our expectations of how protein residues may interact over long distances because of their shared need to maintain protein stability. Copyright 2005, Elsevier Inc. All rights reserved.",
            "authors": [
                "Wang Z.O.",
                "Pollock D.D."
            ],
            "cit_count": 23,
            "journal": "Methods in Enzymology",
            "pmid": "15865995",
            "title": "Context dependence and coevolution among amino acid residues in proteins",
            "year": "2005-06-13"
        },
        {
            "abstract": "Comprehensive sampling of genomic biodiversity is fast becoming a reality for some genomic regions and complete organelle genomes. Genomic biodiversity is defined as large genomic sequences from many species, and here some recent work is reviewed that demonstrates the potential benefits of genomic biodiversity for molecular evolutionary analysis and phylogenetic reconstruction. This work shows that using likelihood-based approaches, taxon addition can dramatically improve phylogenetic reconstruction. Features or dynamics of the evolutionary process are much more easily inferred with large numbers of taxa, and large numbers are essential for discriminating differences in evolutionary patterns between sites. Accurate prediction of site-specific patterns can improve phylogenetic reconstruction by an amount equivalent to quadrupling sequence length. Genomic biodiversity is particularly central to research relating patterns of evolution, adaptation and coevolution to structural and functional features of proteins. Research on detecting coevolution between amino acid residues in proteins demonstrates a clear need for much greater numbers of closely related taxa to better discriminate site-specific patterns of interaction, and to allow more detailed analysis of coevolutionary interactions between subunits in protein complexes. It is argued that parsing out coevolutionary and other context-dependent substitution probabilities is essential for discriminating between coevolution and adaptation, and for more realistically modelling the evolution of proteins. Also reviewed is research that argues for increasing the efficiency of acquiring genomic biodiversity, and suggests that this might be done by simultaneously shotgun cloning and sequencing genomic mixtures from many species. Increased efficiency is a prerequisite if genomic biodiversity levels are to rapidly increase by orders of magnitude, and thus lead to dramatically improved understanding of interactions between protein structure, function and sequence evolution.",
            "authors": [
                "Pollock D.D."
            ],
            "cit_count": 17,
            "journal": "Applied bioinformatics",
            "pmid": "15130847",
            "title": "Genomic biodiversity, phylogenetics and coevolution in proteins.",
            "year": "2002-01-01"
        },
        {
            "abstract": "The identification of protein sites undergoing correlated evolution (coevolution) is of great interest due to the possibility that these pairs will tend to be adjacent in the three-dimensional structure. Identification of such pairs should provide useful information for understanding the evolutionary process, predicting the effects of site-directed substitution, and potentially for predicting protein structure. Here, we develop and apply a maximum likelihood method with the aim of improving detection of coevolution. Unlike previous methods which have had limited success, this method allows for correlations induced by phylogenetic relationships and for variation in rate of evolution along branches, and does not rely on accurate reconstruction of ancestral nodes. In order to reduce the complexity of coevolutionary relationships and identify the primary component of pairwise coevolution between two sites, we reduce the data to a two-state system at each site, regardless of the actual number of residues observed at that site. Simulations show that this strategy is good at identifying simple correlations and at recognizing cases in which the data are insufficient to distinguish between coevolution and spurious correlations. The new method was tested by using size and charge characteristics to group the residues at each site, and then evaluating coevolution in myoglobin sequences. Grouping based on physicochemical characteristics allows categorization of coevolving sites into positive and negative coevolution, depending on the correlation between equilibrium state frequencies. We detected a striking excess of negative coevolution (corresponding to charge) at sites brought into proximity by the periodicity of the α-helix, and there was also a tendency for sites with significant likelihood ratios to be close in the three-dimensional structure. Sites on the surface of the protein appear to coevolve both when they are close in the structure, and when they are distant, implying a role for folding and/or avoidance of quaternary structure in the coevolution process.",
            "authors": [
                "Pollock D.D.",
                "Taylor W.R.",
                "Goldman N."
            ],
            "cit_count": 183,
            "journal": "Journal of Molecular Biology",
            "pmid": "10074416",
            "title": "Coevolving protein residues: Maximum likelihood identification and relationship to structure",
            "year": "1999-03-19"
        },
        {
            "abstract": "Various methods for detecting correlation between sites were evaluated by ascertaining their ability to discriminate positively correlated sites from background correlation at randomly evolved sites. A model for generating pairwise correlations of different degrees is also described. An assortment of physicochemical vectors and similarity and difference matrices were used to discriminate correlated change. There was little difference in effectiveness between the different matrices, but there were significant differences between the matrices and the physicochemical vectors. It is shown that all methods investigated exhibit significant inability to screen out background correlation, particularly in the presence of phylogenetic relatedness between the sequences. Methods using the matrices are unable to distinguish positively correlated from negatively correlated, or compensatory, replacements.",
            "authors": [
                "Pollock D.D.",
                "Taylor W.R."
            ],
            "cit_count": 96,
            "journal": "Protein Engineering",
            "pmid": "9278277",
            "title": "Effectiveness of correlation analysis in identifying protein residues undergoing correlated evolution",
            "year": "1997-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lnlcorr",
        "biotoolsID": "lnlcorr",
        "description": "The LnLCorr package is designed to detect pairwise coevolutionary among residues in a set of proteins using likelihood ratio tests.",
        "homepage": "http://www.evolutionarygenomics.com/ProgramsData/lnlcorr/LnLCorr.html",
        "name": "LnLCorr"
    }
}