{
    "accessibility": "Open access",
    "additionDate": "2022-06-24T06:32:51.482397Z",
    "biotoolsCURIE": "biotools:memo-ms",
    "biotoolsID": "memo-ms",
    "cost": "Free of charge",
    "description": "Ms2 basEd saMple vectOrization (MEMO) is a method allowing a Retention Time (RT) agnostic alignment of metabolomics samples using the fragmentation spectra (MS2) of their consituents. The occurence of MS2 peaks and neutral losses (to the precursor) in each sample is counted and used to generate an MS2 fingerprint of the sample. These fingerprints can in a second stage be aligned to compare different samples.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/mandelbrot-project/memo",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:07:21.998123Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mandelbrot-project/memo"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/memo-ms/"
        }
    ],
    "maturity": "Emerging",
    "name": "MEMO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "pmallard",
    "publication": [
        {
            "doi": "10.3389/fbinf.2022.842964",
            "metadata": {
                "abstract": "In natural products research, chemodiverse extracts coming from multiple organisms are explored for novel bioactive molecules, sometimes over extended periods. Samples are usually analyzed by liquid chromatography coupled with fragmentation mass spectrometry to acquire informative mass spectral ensembles. Such data is then exploited to establish relationships among analytes or samples (e.g., via molecular networking) and annotate metabolites. However, the comparison of samples profiled in different batches is challenging with current metabolomics methods since the experimental variation—changes in chromatographical or mass spectrometric conditions - hinders the direct comparison of the profiled samples. Here we introduce MEMO—MS2 BasEd SaMple VectOrization—a method allowing to cluster large amounts of chemodiverse samples based on their LC-MS/MS profiles in a retention time agnostic manner. This method is particularly suited for heterogeneous and chemodiverse sample sets. MEMO demonstrated similar clustering performance as state-of-the-art metrics considering fragmentation spectra. More importantly, such performance was achieved without the requirement of a prior feature alignment step and in a significantly shorter computational time. MEMO thus allows the comparison of vast ensembles of samples, even when analyzed over long periods of time, and on different chromatographic or mass spectrometry platforms. This new addition to the computational metabolomics toolbox should drastically expand the scope of large-scale comparative analysis.",
                "authors": [
                    {
                        "name": "Allard P.-M."
                    },
                    {
                        "name": "Cretton S."
                    },
                    {
                        "name": "Gaudry A."
                    },
                    {
                        "name": "Huber F."
                    },
                    {
                        "name": "Kaiser M."
                    },
                    {
                        "name": "Nothias L.-F."
                    },
                    {
                        "name": "Wolfender J.-L."
                    }
                ],
                "citationCount": 7,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "MEMO: Mass Spectrometry-Based Sample Vectorization to Explore Chemodiverse Datasets"
            },
            "pmcid": "PMC9580960",
            "pmid": "36304329"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "version": [
        "0.1.4"
    ]
}
