{
    "additionDate": "2022-11-12T18:52:10.095408Z",
    "biotoolsCURIE": "biotools:molminer",
    "biotoolsID": "molminer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jianfeng Pei"
        },
        {
            "name": "Youjun Xu"
        }
    ],
    "description": "PharmaMind®-MolMiner is a rule-free OCSR (Optical Chemical Structure Recognition) learning system. It aims to transform the vectorization problem into object detection tasks. That means it is able to extract chemical elements in an object detection manner by training well-labelled datasets with atom and bond annotations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/iipharma/pharmamind-molminer",
    "lastUpdate": "2022-11-12T18:52:10.097947Z",
    "license": "Other",
    "name": "MolMiner",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.2C00733",
            "metadata": {
                "abstract": "© 2022 The Authors. Published by American Chemical Society.Molecular structures are commonly depicted in 2D printed forms in scientific documents such as journal papers and patents. However, these 2D depictions are not machine readable. Due to a backlog of decades and an increasing amount of printed literatures, there is a high demand for translating printed depictions into machine-readable formats, which is known as Optical Chemical Structure Recognition (OCSR). Most OCSR systems developed over the last three decades use a rule-based approach, which vectorizes the depiction based on the interpretation of vectors and nodes as bonds and atoms. Here, we present a practical software called MolMiner, which is primarily built using deep neural networks originally developed for semantic segmentation and object detection to recognize atom and bond elements from documents. These recognized elements can be easily connected as a molecular graph with a distance-based construction algorithm. MolMiner gave state-of-the-art performance on four benchmark data sets and a self-collected external data set from scientific papers. As MolMiner performed similarly well in real-world OCSR tasks with a user-friendly interface, it is a useful and valuable tool for daily applications. The free download links of Mac and Windows versions are available at https://github.com/iipharma/pharmamind-molminer.",
                "authors": [
                    {
                        "name": "Chou C.-H."
                    },
                    {
                        "name": "Han J."
                    },
                    {
                        "name": "Han N."
                    },
                    {
                        "name": "Hu Q."
                    },
                    {
                        "name": "Lai L."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Pei J."
                    },
                    {
                        "name": "Xiao J."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhu J."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "MolMiner: You Only Look Once for Chemical Structure Recognition"
            },
            "pmid": "36108142"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
