{
    "accessibility": [],
    "additionDate": "2018-07-28T09:35:05Z",
    "biotoolsCURIE": "biotools:lstrap",
    "biotoolsID": "lstrap",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "mutwil@mpimp-golm.mpg.de",
            "gridid": null,
            "name": "Marek Mutwil",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Large-scale transcriptome analysis pipeline.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://github.molgen.mpg.de/proost/LSTrAP/blob/master/README.md"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.molgen.mpg.de/proost/LSTrAP",
    "homepage_status": 0,
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "link": [],
    "maturity": null,
    "name": "LSTrAP",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1861-z",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: Since experimental elucidation of gene function is often laborious, various in silico methods have been developed to predict gene function of uncharacterized genes. Since functionally related genes are often expressed in the same tissues, conditions and developmental stages (co-expressed), functional annotation of characterized genes can be transferred to co-expressed genes lacking annotation. With genome-wide expression data available, the construction of co-expression networks, where genes are nodes and edges connect significantly co-expressed genes, provides unprecedented opportunities to predict gene function. However, the construction of such networks requires large volumes of high-quality data, multiple processing steps and a considerable amount of computation power. While efficient tools exist to process RNA-Seq data, pipelines which combine them to construct co-expression networks efficiently are currently lacking. Results: LSTrAP (Large-Scale Transcriptome Analysis Pipeline), presented here, combines all essential tools to construct co-expression networks based on RNA-Seq data into a single, efficient workflow. By supporting parallel computing on computer cluster infrastructure, processing hundreds of samples becomes feasible as shown here for Arabidopsis thaliana and Sorghum bicolor, which comprised 876 and 215 samples respectively. The former was used here to show how the quality control, included in LSTrAP, can detect spurious or low-quality samples. The latter was used to show how co-expression networks are able to group known photosynthesis genes and imply a role in this process of several, currently uncharacterized, genes. Conclusions: LSTrAP combines the most popular and performant methods to construct co-expression networks from RNA-Seq data into a single workflow. This allows large amounts of expression data, required to construct co-expression networks, to be processed efficiently and consistently across hundreds of samples. LSTrAP is implemented in Python 3.4 (or higher) and available under MIT license from https://github.molgen.mpg.de/proost/LSTrAP",
                "authors": [
                    {
                        "name": "Proost S."
                    },
                    {
                        "name": "Krawczyk A."
                    },
                    {
                        "name": "Mutwil M."
                    }
                ],
                "citationCount": 7,
                "date": "2017-10-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LSTrAP: Efficiently combining RNA sequencing data into co-expression networks"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": []
}