{
    "additionDate": "2021-01-18T09:02:54Z",
    "biotoolsCURIE": "biotools:ysmr",
    "biotoolsID": "ysmr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "julian.schwanbeck@med.uni-goettingen.de",
            "name": "Julian Schwanbeck",
            "orcidid": "https://orcid.org/0000-0003-2803-0167",
            "typeEntity": "Person"
        }
    ],
    "description": "a video tracking and analysis program for bacterial motility. Bacterial video tracking and analysis.\n\nthe gaussian-sum finite impulse response filter used by YSMR.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/schwanbeck/YSMR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-18T14:16:46Z",
    "license": "GPL-3.0",
    "name": "YSMR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3495-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Motility in bacteria forms the basis for taxis and is in some pathogenic bacteria important for virulence. Video tracking of motile bacteria allows the monitoring of bacterial swimming behaviour and taxis on the level of individual cells, which is a prerequisite to study the underlying molecular mechanisms. Results: The open-source python program YSMR (Your Software for Motility Recognition) was designed to simultaneously track a large number of bacterial cells on standard computers from video files in various formats. In order to cope with the high number of tracked objects, we use a simple detection and tracking approach based on grey-value and position, followed by stringent selection against suspicious data points. The generated data can be used for statistical analyses either directly with YSMR or with external programs. Conclusion: In contrast to existing video tracking software, which either requires expensive computer hardware or only tracks a limited number of bacteria for a few seconds, YSMR is an open-source program which allows the 2-D tracking of several hundred objects over at least 5 minutes on standard computer hardware. The code is freely available at https://github.com/schwanbeck/YSMR",
                "authors": [
                    {
                        "name": "Schwanbeck J."
                    },
                    {
                        "name": "Oehmig I."
                    },
                    {
                        "name": "Dretzke J."
                    },
                    {
                        "name": "Zautner A.E."
                    },
                    {
                        "name": "Gross U."
                    },
                    {
                        "name": "Bohne W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "YSMR: A video tracking and analysis program for bacterial motility"
            },
            "pmcid": "PMC7191716",
            "pmid": "32349658"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}