{"credit":[{"name":"bils.se","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"bairong.shen@suda.edu.cn","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://structure.bmc.lu.se/PPSC/"}],"function":[{"input":[{"data":{"term":"Structure","uri":"http://edamontology.org/data_0883"}}],"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}],"output":[{"data":{"term":"Structure report","uri":"http://edamontology.org/data_2085"}}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"}]},"publication":[{"abstract":"Predicting the effects of amino acid substitutions on protein stability provides invaluable information for protein design, the assignment of biological function, and for understanding disease-associated variations. To understand the effects of substitutions, computational models are preferred to time-consuming and expensive experimental methods. Several methods have been proposed for this task including machine learning-based approaches. However, models trained using limited data have performance problems and many model parameters tend to be over-fitted. To decrease the number of model parameters and to improve the generalization potential, we calculated the amino acid contact energy change for point variations using a structure-based coarse-grained model. Based on the structural properties including contact energy (CE) and further physicochemical properties of the amino acids as input features, we developed two support vector machine classifiers. M47 predicted the stability of variant proteins with an accuracy of 87 % and a Matthews correlation coefficient of 0.68 for a large dataset of 1925 variants, whereas M8 performed better when a relatively small dataset of 388 variants was used for 20-fold cross-validation. The performance of the M47 classifier on all six tested contingency table evaluation parameters is better than that of existing machine learning-based models or energy function-based protein stability classifiers. © 2012 Springer-Verlag Wien.","authors":["Yang Y.","Chen B.","Tan G.","Vihinen M.","Shen B."],"cit_count":22,"doi":"10.1007/s00726-012-1407-7","journal":"Amino Acids","title":"Structure-based prediction of the effects of a missense variant on protein stability","type":"Primary","year":"2013-03-01"}],"summary":{"biotoolsCURIE":"biotools:ppsc","biotoolsID":"ppsc","description":"Prediction of protein stability changes.","homepage":"http://structure.bmc.lu.se/PPSC/","name":"PPSC","version":["1"]}}