
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Elsevier B.V.Prediction of gene function and gene regulatory networks is one of the most active topics in bioinformatics. The accumulation of publicly available gene expression data for hundreds of plant species, together with advances in bioinformatical methods and affordable computing, sets ingenuity as one of the major bottlenecks in understanding gene function and regulation. Here, we show how a credit card-sized computer retailing for <50 USD can be used to rapidly predict gene function and infer regulatory networks from RNA sequencing data. To achieve this, we constructed a bioinformatical pipeline that downloads and allows quality-control of RNA sequencing data; and generates a gene co-expression network that can reveal enzymes and transcription factors participating and controlling a given biosynthetic pathway. We exemplify this by first identifying genes and transcription factors involved in the biosynthesis of secondary cell wall in the plant Artemisia annua, the main natural source of the anti-malarial drug artemisinin. Networks were then used to dissect the artemisinin biosynthesis pathway, which suggest potential transcription factors regulating artemisinin biosynthesis. We provide the source code of our pipeline (https://github.com/mutwil/LSTrAP-Lite) and envision that the ubiquity of affordable computing, availability of biological data and increased bioinformatical training of biologists will transform the field of bioinformatics. This article is part of a Special Issue entitled: Transcriptional Profiles and Regulatory Gene Networks edited by Dr. Dr. Federico Manuel Giorgi and Dr. Shaun Mahony.",
            "authors": [
                "Tan Q.W.",
                "Mutwil M."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.BBAGRM.2019.194429",
            "journal": "Biochimica et Biophysica Acta - Gene Regulatory Mechanisms",
            "pmid": "31634636",
            "title": "Inferring biosynthetic and gene regulatory networks from Artemisia annua RNA sequencing data on a credit card-sized ARM computer",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:LSTrAP-Lite",
        "biotoolsID": "LSTrAP-Lite",
        "description": "Inferring biosynthetic and gene regulatory networks from Artemisia annua RNA sequencing data on a credit card-sized ARM computer.\n\nLarge-Scale Transcriptome Analysis Pipeline-Lite on credit card-sized ARM computer.\n\nIf you use LSTrAP-Lite in your research, please cite: Inferring biosynthetic and gene regulatory networks from Artemisia annua RNA sequencing data on a credit card-sized ARM computer. Tan and Mutwil, 2019. (https://doi.org/10.1101/661058).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'artemisinin', 'card-sized', 'bioinformatical', 'credit'",
        "homepage": "https://github.com/mutwil/LSTrAP-Lite",
        "name": "LSTrAP-Lite"
    }
}