{
    "additionDate": "2015-01-22T11:40:39Z",
    "biotoolsCURIE": "biotools:netsim",
    "biotoolsID": "netsim",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "barbara.dicamillo@unipd.it",
            "name": "Barbara Di Camillo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~dicamill/"
        }
    ],
    "description": "Gene-network simulator. Simulators are helpful to test and compare the accuracy of different reverse-engineering approaches in a variety of experimental conditions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.medcomp.medicina.unipd.it/bioing/netsim/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Netsim is a gene-network simulator that resembles some of the main features of transcriptional regulatory networks related to topology, interaction among regulators of transcription, and expression dynamics. The user can give as input the desired in/out degree distribution and clustering coefficient. Netsim first generates the network topology and second the rules codifying the regulatory interactions (these latter can also be given as input), represented using fuzzy logic. Third, netsim generates the system dynamics using differential equations to generate continuous data, comparable to real data for variety and dynamic complexity. The user can give as input the parameters describing kinetics, saturation in the response to regulation, and transcription activation thresholds.",
            "operation": [
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "homepage": "http://www.medcomp.medicina.unipd.it/bioing/netsim/",
    "homepage_status": 1,
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-2.0",
    "name": "Netsim",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1111/j.1749-6632.2008.03756.x",
            "metadata": {
                "abstract": "In the context of reverse engineering of biological networks, simulators are helpful to test and compare the accuracy of different reverse-engineering approaches in a variety of experimental conditions. A novel gene-network simulator is presented that resembles some of the main features of transcriptional regulatory networks related to topology, interaction among regulators of transcription, and expression dynamics. The simulator generates network topology according to the current knowledge of biological network organization, including scale-free distribution of the connectivity and clustering coefficient independent of the number of nodes in the network. It uses fuzzy logic to represent interactions among the regulators of each gene, integrated with differential equations to generate continuous data, comparable to real data for variety and dynamic complexity. Finally, the simulator accounts for saturation in the response to regulation and transcription activation thresholds and shows robustness to perturbations. It therefore provides a reliable and versatile test bed for reverse engineering algorithms applied to microarray data. Since the simulator describes regulatory interactions and expression dynamics as two distinct, although interconnected aspects of regulation, it can also be used to test reverse engineering approaches that use both microarray and protein-protein interaction data in the process of learning. A first software release is available at http://www.dei.unipd.it/∼dicamill/ software/netsim as an R programming language package. © 2009 New York Academy of Sciences.",
                "authors": [
                    {
                        "name": "Di Camillo B."
                    },
                    {
                        "name": "Toffolo G."
                    },
                    {
                        "name": "Cobelli C."
                    }
                ],
                "citationCount": 33,
                "date": "2009-01-01T00:00:00Z",
                "journal": "Annals of the New York Academy of Sciences",
                "title": "A gene network simulator to assess reverse engineering algorithms"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}