{
    "additionDate": "2021-11-29T08:51:24.362775Z",
    "biotoolsCURIE": "biotools:quarterplus",
    "biotoolsID": "quarterplus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan",
            "orcidid": "https://orcid.org/0000-0002-7749-0314",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "QUARTERplus (QUality Assessment for pRotein inTrinsic disordEr pRedictions.) webserver provides accurate intrinsic disorder predictions using a novel meta-model that are accompanied by interpretable quality assessment (QA) scores. QA scores quantify the quality of the associated disorder predictions for each amino acid in the input sequence.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://biomine.cs.vcu.edu/servers/QUARTERplus/",
    "lastUpdate": "2021-11-29T08:52:14.031072Z",
    "name": "QUARTERplus",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.04.066",
            "metadata": {
                "abstract": "© 2021 The Author(s)A recent advance in the disorder prediction field is the development of the quality assessment (QA) scores. QA scores complement the propensities produced by the disorder predictors by identifying regions where these predictions are more likely to be correct. We develop, empirically test and release a new QA tool, QUARTERplus, that addresses several key drawbacks of the current QA method, QUARTER. QUARTERplus is the first solution that utilizes QA scores and the associated input disorder predictions to produce very accurate disorder predictions with the help of a modern deep learning meta-model. The deep neural network utilizes the QA scores to identify and fix the regions where the original/input disorder predictions are poor. More importantly, the accurate QUATERplus's predictions are accompanied by easy to interpret residue-level QA scores that reliably quantify their residue-level predictive quality. We provide these interpretable QA scores for QUARTERplus and 10 other popular disorder predictors. Empirical tests on a large and independent (low similarity) test dataset show that QUARTERplus predictions secure AUC = 0.93 and are statistically more accurate than the results of twelve state-of-the-art disorder predictors. We also demonstrate that the new QA scores produced by QUARTERplus are highly correlated with the actual predictive quality and that they can be effectively used to identify regions of correct disorder predictions. This feature empowers the users to easily identify which parts of the predictions generated by the modern disorder predictors are more trustworthy. QUARTERplus is available as a convenient webserver at http://biomine.cs.vcu.edu/servers/QUARTERplus/.",
                "authors": [
                    {
                        "name": "Ghadermarzi S."
                    },
                    {
                        "name": "Hu G."
                    },
                    {
                        "name": "Katuwawala A."
                    },
                    {
                        "name": "Kurgan L."
                    },
                    {
                        "name": "Wu Z."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "QUARTERplus: Accurate disorder predictions integrated with interpretable residue-level quality assessment scores"
            },
            "pmcid": "PMC8122155",
            "pmid": "34025946",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
