{
    "additionDate": "2021-01-18T09:40:30Z",
    "biotoolsCURIE": "biotools:mixonat",
    "biotoolsID": "mixonat",
    "confidence_flag": "tool",
    "description": "Software for the Dereplication of Mixtures Based on 13C NMR Spectroscopy.\n\n13C-NMR based dereplication software.\n\nMixONat allows the dereplication of natural products mixtures using 13C-NMR and DEPT data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/mixonat",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-26T08:48:31Z",
    "name": "MixONat",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.0C00193",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Whether chemists or biologists, researchers dealing with metabolomics require tools to decipher complex mixtures. As a part of metabolomics and initially dedicated to identifying bioactive natural products, dereplication aims at reducing the usual time-consuming process of known compounds isolation. Mass spectrometry and nuclear magnetic resonance are the most commonly reported analytical tools during dereplication analysis. Though it has low sensitivity, 13C NMR has many advantages for such a study. Notably, it is nonspecific allowing simultaneous high-resolution analysis of any organic compounds including stereoisomers. Since NMR spectrometers nowadays provide useful data sets in a reasonable time frame, we have embarked upon writing software dedicated to 13C NMR dereplication. The present study describes the development of a freely distributed algorithm, namely MixONat and its ability to help researchers decipher complex mixtures. Based on Python 3.5, MixONat analyses a {1H}-13C NMR spectrum optionally combined with DEPT-135 and 90 data - to distinguish carbon types (i.e., CH3, CH2, CH, and C) - as well as a MW filtering. The software requires predicted or experimental carbon chemical shifts (δc) databases and displays results that can be refined based on user interactions. As a proof of concept, this 13C NMR dereplication strategy was evaluated on mixtures of increasing complexity and exhibiting pharmaceutical (poppy alkaloids), nutritional (rosemary extracts) or cosmetics (mangosteen peel extract) applications. Associated results were compared with other methods commonly used for dereplication. MixONat gave coherent results that rapidly oriented the user toward the correct structural types of secondary metabolites, allowing the user to distinguish between structurally close natural products, including stereoisomers.",
                "authors": [
                    {
                        "name": "Bruguiere A."
                    },
                    {
                        "name": "Derbre S."
                    },
                    {
                        "name": "Dietsch J."
                    },
                    {
                        "name": "Leguy J."
                    },
                    {
                        "name": "Rahier V."
                    },
                    {
                        "name": "Pottier Q."
                    },
                    {
                        "name": "Breard D."
                    },
                    {
                        "name": "Suor-Cherer S."
                    },
                    {
                        "name": "Viault G."
                    },
                    {
                        "name": "Le Ray A.-M."
                    },
                    {
                        "name": "Saubion F."
                    },
                    {
                        "name": "Richomme P."
                    }
                ],
                "citationCount": 7,
                "date": "2020-07-07T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "MixONat, a Software for the Dereplication of Mixtures Based on 13C NMR Spectroscopy"
            },
            "pmid": "32479074"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}