{"credit":[{"email":"Jussi.Paananen@uku.fi","name":"Jussi Paananen","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://kokki.uku.fi/bioinformatics/forg3d/"}],"function":[{"operation":[{"term":"Sequence cluster visualisation","uri":"http://edamontology.org/operation_0566"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"Background: Genomics research produces vast amounts of experimental data that needs to be integrated in order to understand, model, and interpret the underlying biological phenomena. Interpreting these large and complex data sets is challenging and different visualization methods are needed to help produce knowledge from the data. Results: To help researchers to visualize and interpret integrated genomics data, we present a novel visualization method and bioinformatics software tool called FORG3D that is based on real-time three-dimensional force-directed graphs. FORG3D can be used to visualize integrated networks of genome scale data such as interactions between genes or gene products, signaling transduction, metabolic pathways, functional interactions and evolutionary relationships. Furthermore, we demonstrate its utility by exploring gene network relationships using integrated data sets from a Caenorhabditis elegans Parkinson's disease model. Conclusion: We have created an open source software tool called FORG3D that can be used for visualizing and exploring integrated genome scale data. © 2009 Paananen and Wong; licensee BioMed Central Ltd.","authors":["Paananen J.","Wong G."],"cit_count":10,"doi":"10.1186/1752-0509-3-26","journal":"BMC Systems Biology","title":"FORG3D: Force-directed 3D graph editor for visualization of integrated genome scale data","year":"2009-02-24"}],"summary":{"biotoolsCURIE":"biotools:forg3d","biotoolsID":"forg3d","description":"Force-directed 3D graph editor for visualization of integrated genome scale data.","homepage":"http://kokki.uku.fi/bioinformatics/forg3d/","name":"FORG3D"}}