{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T09:21:38Z",
    "biotoolsCURIE": "biotools:dice",
    "biotoolsID": "dice",
    "confidence_flag": "tool",
    "description": "DICE is a Monte Carlo molecular simulation software. It is a Monte Carlo code for molecular simulation including the configurational bias Monte Carlo method.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://portal.if.usp.br/dice/?q=node/333"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                }
            ]
        }
    ],
    "homepage": "https://portal.if.usp.br/dice",
    "lastUpdate": "2021-03-01T08:40:41Z",
    "name": "DICE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00077",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Solute-solvent systems are an important topic of study, as the effects of the solvent on the solute can drastically change its properties. Theoretical studies of these systems are done with ab initio methods, molecular simulations, or a combination of both. The simulations of molecular systems are usually performed with either molecular dynamics (MD) or Monte Carlo (MC) methods. Classical MD has evolved much in the last decades, both in algorithms and implementations, having several stable and efficient codes developed and available. Similarly, MC methods have also evolved, focusing mainly in creating and improving methods and implementations in available codes. In this paper, we provide some enhancements to a configurational bias Monte Carlo (CBMC) methodology to simulate flexible molecules using the molecular fragments concept. In our implementation the acceptance criterion of the CBMC method was simplified and a generalization was proposed to allow the simulation of molecules with any kind of fragments. We also introduce the new version of DICE, an MC code for molecular simulation (available at https://portal.if.usp.br/dice). This code was mainly developed to simulate solute-solvent systems in liquid and gas phases and in interfaces (gas-liquid and solid-liquid) that has been mostly used to generate configurations for a sequential quantum mechanics/molecular mechanics method (S-QM/MM). This new version introduces several improvements over the previous ones, with the ability of simulating flexible molecules with CBMC as one of them. Simulations of well-known molecules, such as n-octane and 1,2-dichloroethane in vacuum and in solution, are presented to validate the new implementations compared with MD simulations, experimental data, and other theoretical results. The efficiency of the conformational sampling was analyzed using the acceptance rates of different alkanes: n-octane, neopentane, and 4-ethylheptane. Furthermore, a very complex molecule, boron subphtalocyanine, was simulated in vacuum and in aqueous solution showing the versatility of the new implementation. We show that the CBMC is a very good method to perform conformation sampling of complex moderately sized molecules (up to 150 atoms) in solution following the Boltzmann thermodynamic equilibrium distribution.",
                "authors": [
                    {
                        "name": "Cezar H.M."
                    },
                    {
                        "name": "Canuto S."
                    },
                    {
                        "name": "Coutinho K."
                    }
                ],
                "citationCount": 15,
                "date": "2020-07-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "DICE: A Monte Carlo Code for Molecular Simulation including the Configurational Bias Monte Carlo Method"
            },
            "pmid": "32470296"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}