{
    "additionDate": "2017-12-18T00:10:45Z",
    "biotoolsCURIE": "biotools:parentchecker",
    "biotoolsID": "parentchecker",
    "credit": [
        {
            "email": "zhiqiu.hu@ucr.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ParentChecker is a user-friendly tool that uses the segregation patterns of progeny to infer missing genotype information of parent lines that have been used to construct mapping populations. It can also be used to automate correction of linkage phase errors in genotypic data that is in ABH format.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://statgen.ucr.edu/software.html",
    "language": [
        "Delphi"
    ],
    "lastUpdate": "2024-11-25T14:47:49.455768Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/parentchecker-1-0-inference-missing-parental-genotype-calls-linkage-phase-correction.html"
        }
    ],
    "name": "ParentChecker",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2156-13-9",
            "metadata": {
                "abstract": "Background: Accurate genetic maps are the cornerstones of genetic discovery, but their construction can be hampered by missing parental genotype information. Inference of parental haplotypes and correction of phase errors can be done manually on a one by one basis with the aide of current software tools, but this is tedious and time consuming for the high marker density datasets currently being generated for many crop species. Tools that help automate the process of inferring parental genotypes can greatly speed the process of map building. We developed a software tool that infers and outputs missing parental genotype information based on observed patterns of segregation in mapping populations. When phases are correctly inferred, they can be fed back to the mapping software to quickly improve marker order and placement on genetic maps.Results: ParentChecker is a user-friendly tool that uses the segregation patterns of progeny to infer missing genotype information of parental lines that have been used to construct a mapping population. It can also be used to automate correction of linkage phase errors in genotypic data that are in ABH format.Conclusion: ParentChecker efficiently improves genetic mapping datasets for cases where parental information is incomplete by automating the process of inferring missing genotypes of inbred mapping populations and can also be used to correct linkage phase errors in ABH formatted datasets. © 2012 Hu et al; BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Close T.J."
                    },
                    {
                        "name": "Ehlers J.D."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Lucas M.R."
                    },
                    {
                        "name": "Roberts P.A."
                    },
                    {
                        "name": "Wanamaker S."
                    },
                    {
                        "name": "Xu S."
                    }
                ],
                "citationCount": 2,
                "date": "2012-02-23T00:00:00Z",
                "journal": "BMC Genetics",
                "title": "ParentChecker: A computer program for automated inference of missing parental genotype calls and linkage phase correction"
            },
            "pmcid": "PMC3310824",
            "pmid": "22360875",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Linkage",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
