{
    "additionDate": "2024-01-29T12:24:54.296060Z",
    "biotoolsCURIE": "biotools:ppgfeat",
    "biotoolsID": "ppgfeat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "saad.abdullah@mdu.se",
            "name": "Saad Abdullah",
            "typeEntity": "Person"
        }
    ],
    "description": "MATLAB toolbox for extracting PPG fiducial points.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/132688-ppgfeat?s_tid=prof_contriblnk",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-01-29T12:24:54.299022Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/saadsur/PPGFeat"
        }
    ],
    "name": "PPGFeat",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2023.1199604",
            "metadata": {
                "abstract": "Photoplethysmography is a non-invasive technique used for measuring several vital signs and for the identification of individuals with an increased disease risk. Its principle of work is based on detecting changes in blood volume in the microvasculature of the skin through the absorption of light. The extraction of relevant features from the photoplethysmography signal for estimating certain physiological parameters is a challenging task, where various feature extraction methods have been proposed in the literature. In this work, we present PPGFeat, a novel MATLAB toolbox supporting the analysis of raw photoplethysmography waveform data. PPGFeat allows for the application of various preprocessing techniques, such as filtering, smoothing, and removal of baseline drift; the calculation of photoplethysmography derivatives; and the implementation of algorithms for detecting and highlighting photoplethysmography fiducial points. PPGFeat includes a graphical user interface allowing users to perform various operations on photoplethysmography signals and to identify, and if required also adjust, the fiducial points. Evaluating the PPGFeat’s performance in identifying the fiducial points present in the publicly available PPG-BP dataset, resulted in an overall accuracy of 99% and 3038/3066 fiducial points were correctly identified. PPGFeat significantly reduces the risk of errors in identifying inaccurate fiducial points. Thereby, it is providing a valuable new resource for researchers for the analysis of photoplethysmography signals.",
                "authors": [
                    {
                        "name": "Abdullah S."
                    },
                    {
                        "name": "Folke M."
                    },
                    {
                        "name": "Hafid A."
                    },
                    {
                        "name": "Kristoffersson A."
                    },
                    {
                        "name": "Linden M."
                    }
                ],
                "citationCount": 1,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "PPGFeat: a novel MATLAB toolbox for extracting PPG fiducial points"
            },
            "pmcid": "PMC10292016",
            "pmid": "37378045"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
