{
    "additionDate": "2017-08-03T18:56:21Z",
    "biotoolsCURIE": "biotools:pro-maya",
    "biotoolsID": "pro-maya",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ibis.tau.ac.il/wiki/nir_bental/index.php/Main_Page"
        }
    ],
    "description": "Predict the protein stability free energy difference (ΔG), arising from a single-site amino acid substitution compared to the wild-type, denoted as ΔΔG.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bental.tau.ac.il/ProMaya/overview.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://bental.tau.ac.il/ProMaya/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pro-maya-protein-mutant-stability-analyzer.html"
        }
    ],
    "name": "Pro-Maya",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Accurate prediction of protein stability is important for understanding the molecular underpinnings of diseases and for the design of new proteins. We introduce a novel approach for the prediction of changes in protein stability that arise from a single-site amino acid substitution; the approach uses available data on mutations occurring in the same position and in other positions. Our algorithm, named Pro-Maya (Protein Mutant stAbilitY Analyzer), combines a collaborative filtering baseline model, Random Forests regression and a diverse set of features. Pro-Maya predicts the stability free energy difference of mutant versus wild type, denoted as ΔΔG. Results: We evaluated our algorithm extensively using cross-validation on two previously utilized datasets of single amino acid mutations and a (third) validation set. The results indicate that using known ΔΔG values of mutations at the query position improves the accuracy of ΔΔG predictions for other mutations in that position. The accuracy of our predictions in such cases significantly surpasses that of similar methods, achieving, e.g. a Pearson's correlation coefficient of 0.79 and a root mean square error of 0.96 on the validation set. Because Pro-Maya uses a diverse set of features, including predictions using two other methods, it also performs slightly better than other methods in the absence of additional experimental data on the query positions. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Wainreb G."
                    },
                    {
                        "name": "Wolf L."
                    },
                    {
                        "name": "Ashkenazy H."
                    },
                    {
                        "name": "Dehouck Y."
                    },
                    {
                        "name": "Ben-Tal N."
                    }
                ],
                "citationCount": 23,
                "date": "2011-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Protein stability: A single recorded mutation aids in predicting the effects of other mutations in the same amino acid site"
            },
            "pmid": "21998155"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}