
{
    "credit": [
        {
            "email": "javier.garciag@upf.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sbi.imim.es/web/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://sbi.imim.es/web/index.php/research/databases/shiprec"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Microbiology",
                "uri": "http://edamontology.org/topic_3301"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/shiprec-salmonellahost-protein-protein-interaction-predictions-browser.html"
        }
    ],
    "publication": [
        {
            "abstract": "Salmonellosis caused by Salmonella bacteria is a food-borne disease and a worldwide health threat causing millions of infections and thousands of deaths every year. This pathogen infects an unusually broad range of host organisms including human and plants. A better understanding of the mechanisms of communication between Salmonella and its hosts requires identifying the interactions between Salmonella and host proteins. Protein-protein interactions (PPIs) are the fundamental building blocks of communication. Here, we utilize the prediction platform BIANA to obtain the putative Salmonella-human and Salmonella-Arabidopsis interactomes based on sequence and domain similarity to known PPIs. A gold standard list of Salmonella-host PPIs served to validate the quality of the human model. 24,726 and 10,926 PPIs comprising interactions between 38 and 33 Salmonella effectors and virulence factors with 9,740 human and 4,676 Arabidopsis proteins, respectively, were predicted. Putative hub proteins could be identified, and parallels between the two interactomes were discovered. This approach can provide insight into possible biological functions of so far uncharacterized proteins. The predicted interactions are available via a web interface which allows filtering of the database according to parameters provided by the user to narrow down the list of suspected interactions. The interactions are available via a web interface at http://sbi.imim.es/web/SHIPREC.php. © 2012 Verlag Helvetica Chimica Acta AG, Zürich.",
            "authors": [
                "Schleker S.",
                "Garcia-Garcia J.",
                "Klein-Seetharaman J.",
                "Oliva B."
            ],
            "cit_count": 19,
            "journal": "Chemistry and Biodiversity",
            "pmid": "22589098",
            "title": "Prediction and comparison of Salmonella-human and Salmonella-Arabidopsis interactomes",
            "year": "2012-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:shiprec",
        "biotoolsID": "shiprec",
        "description": "A Salmonella/Host Protein-Protein Interaction predictions browser.",
        "homepage": "http://sbi.imim.es/web/index.php/research/databases/shiprec",
        "name": "SHIPREC"
    }
}