{
    "additionDate": "2021-01-18T10:29:01Z",
    "biotoolsCURIE": "biotools:papet",
    "biotoolsID": "papet",
    "confidence_flag": "tool",
    "description": "A Pathway Analysis Approach Using Petri Net.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fmansoori/PAPET",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-22T17:31:44Z",
    "name": "PAPET",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/JBHI.2020.3003996",
            "metadata": {
                "abstract": "IEEEPerturbation in the normal function of the cell signaling pathways often leads to diseases. One of the factors that help understand the mechanism of diseases is the precise identification and investigation of perturbed signaling pathways. Pathway analysis methods have been developed as their purpose is to identify perturbed signaling pathways in given conditions. Among these methods, some consider the pathways topologies in their analysis, which are referred to as topology-based methods. Most of the topology-based methods used simple graph-based models to incorporate topology in their analysis, which have some limitations. We describe a new Pathway Analysis method using PETri net (PAPET) that uses the Petri net to model the signaling pathways and then propose an algorithm to measure the perturbation on a given pathway under a given condition. Modeling with Petri net has some advantages and could overcome the shortcomings of the simple graph-based models. We illustrate the capabilities of the proposed method using sensitivity, prioritization, mean reciprocal rank, and false-positive rate metrics on 36 real datasets from various diseases. The results of comparing PAPET with five pathway analysis methods FoPA, PADOG, GSEA, CePa and SPIA show that PAPET is the best one that provides a good compromise between all metrics. In addition, the results of applying methods to gene expression profiles in normal and Pancreatic Ductal Adenocarcinoma cancer (PDAC) samples show that the PAPET method achieves the best rank among others in finding the pathways that have been previously reported for PDAC. The PAPET method is available at https://github.com/fmansoori/PAPET.",
                "authors": [
                    {
                        "name": "Mansoori F."
                    },
                    {
                        "name": "Rahgozar M."
                    },
                    {
                        "name": "Kavousi K."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "A Pathway Analysis Approach Using Petri Net"
            },
            "pmid": "32750945"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}