{
    "accessibility": "Open access",
    "additionDate": "2020-12-10T17:39:17Z",
    "biotoolsCURIE": "biotools:scomap",
    "biotoolsID": "scomap",
    "collectionID": [
        "VIB",
        "KU Leuven"
    ],
    "credit": [
        {
            "name": "Stein Aerts",
            "orcidid": "https://orcid.org/0000-0002-8006-0315",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "we generate independent single-cell RNA-seq and single-cell ATAC-seq atlases of the Drosophila eye-antennal disc and spatially integrate the data into a virtual latent space that mimics the organization of the 2D tissue using ScoMAP (Single-Cell Omics Mapping into spatial Axes using Pseudotime ordering).",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://rawcdn.githack.com/aertslab/ScoMAP/f6cd6724682d4b6c2a8f44b2a18824a56cff2146/vignettes/Vignette.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/aertslab/ScoMAP",
            "version": "0.1.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/aertslab/ScoMAP",
    "lastUpdate": "2020-12-10T17:39:17Z",
    "license": "GPL-3.0",
    "name": "ScoMAP",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.15252/msb.20209438",
            "metadata": {
                "abstract": "© 2020 The Authors. Published under the terms of the CC BY 4.0 licenseSingle-cell technologies allow measuring chromatin accessibility and gene expression in each cell, but jointly utilizing both layers to map bona fide gene regulatory networks and enhancers remains challenging. Here, we generate independent single-cell RNA-seq and single-cell ATAC-seq atlases of the Drosophila eye-antennal disc and spatially integrate the data into a virtual latent space that mimics the organization of the 2D tissue using ScoMAP (Single-Cell Omics Mapping into spatial Axes using Pseudotime ordering). To validate spatially predicted enhancers, we use a large collection of enhancer–reporter lines and identify ~ 85% of enhancers in which chromatin accessibility and enhancer activity are coupled. Next, we infer enhancer-to-gene relationships in the virtual space, finding that genes are mostly regulated by multiple, often redundant, enhancers. Exploiting cell type-specific enhancers, we deconvolute cell type-specific effects of bulk-derived chromatin accessibility QTLs. Finally, we discover that Prospero drives neuronal differentiation through the binding of a GGG motif. In summary, we provide a comprehensive spatial characterization of gene regulation in a 2D tissue.",
                "authors": [
                    {
                        "name": "Bravo Gonzalez-Blas C."
                    },
                    {
                        "name": "Quan X.-J."
                    },
                    {
                        "name": "Duran-Romana R."
                    },
                    {
                        "name": "Taskiran I.I."
                    },
                    {
                        "name": "Koldere D."
                    },
                    {
                        "name": "Davie K."
                    },
                    {
                        "name": "Christiaens V."
                    },
                    {
                        "name": "Makhzami S."
                    },
                    {
                        "name": "Hulselmans G."
                    },
                    {
                        "name": "de Waegeneer M."
                    },
                    {
                        "name": "Mauduit D."
                    },
                    {
                        "name": "Poovathingal S."
                    },
                    {
                        "name": "Aibar S."
                    },
                    {
                        "name": "Aerts S."
                    }
                ],
                "citationCount": 11,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Molecular Systems Biology",
                "title": "Identification of genomic enhancers through spatial integration of single-cell transcriptomics and epigenomics"
            },
            "pmcid": "PMC7237818",
            "pmid": "32431014",
            "type": [
                "Primary"
            ],
            "version": "0.1.0"
        }
    ],
    "validated": 1
}