{"credit":[{"email":"jdzxiaoxuan@163.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.jci-bioinfo.cn/pSuc-Lys/pSucLys_readme.html"}],"function":[{"operation":[{"term":"Post-translation modification site prediction","uri":"http://edamontology.org/operation_0417"},{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein sites, features and motifs","uri":"http://edamontology.org/topic_3510"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/psuc-lys-predict-lysine-succinylation-sites-in-proteins-with-pseaac-and-ensemble-random-forest-approach.html"}],"publication":[{"abstract":"© 2016 Elsevier Ltd.Being one type of post-translational modifications (PTMs), protein lysine succinylation is important in regulating varieties of biological processes. It is also involved with some diseases, however. Consequently, from the angles of both basic research and drug development, we are facing a challenging problem: for an uncharacterized protein sequence having many Lys residues therein, which ones can be succinylated, and which ones cannot? To address this problem, we have developed a predictor called pSuc-Lys through (1) incorporating the sequence-coupled information into the general pseudo amino acid composition, (2) balancing out skewed training dataset by random sampling, and (3) constructing an ensemble predictor by fusing a series of individual random forest classifiers. Rigorous cross-validations indicated that it remarkably outperformed the existing methods. A user-friendly web-server for pSuc-Lys has been established at http://www.jci-bioinfo.cn/pSuc-Lys, by which users can easily obtain their desired results without the need to go through the complicated mathematical equations involved. It has not escaped our notice that the formulation and approach presented here can also be used to analyze many other problems in computational proteomics.","authors":["Jia J.","Liu Z.","Xiao X.","Liu B.","Chou K.-C."],"cit_count":150,"journal":"Journal of Theoretical Biology","pmid":"26807806","title":"pSuc-Lys: Predict lysine succinylation sites in proteins with PseAAC and ensemble random forest approach","year":"2016-04-07"}],"summary":{"biotoolsCURIE":"biotools:psuc-lys","biotoolsID":"psuc-lys","description":"This web-server is used to predict the lysine succinylation in protein.","homepage":"http://www.jci-bioinfo.cn/pSuc-Lys","name":"pSuc-Lys"}}