{
    "accessibility": "Open access",
    "additionDate": "2024-02-26T10:29:42.855229Z",
    "biotoolsCURIE": "biotools:smipoly",
    "biotoolsID": "smipoly",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mt_ohno@jp.daicel.com",
            "name": "Mitsuru Ohno",
            "orcidid": "https://orcid.org/0000-0002-4588-1927",
            "typeEntity": "Person"
        },
        {
            "email": "yoshidar@ism.ac.jp",
            "name": "Ryo Yoshida",
            "orcidid": "https://orcid.org/0000-0001-8092-0162",
            "typeEntity": "Person"
        }
    ],
    "description": "SMiPoly (Small Molecules into Polymers)\" is rule-based virtual library generator for discovery of functional polymers. It is consist of two submodules, \"monc.py\" and \"polg.py\".",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PEJpOhno/SMiPoly",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:12:49.503670Z",
    "license": "BSD-3-Clause",
    "name": "SMiPoly",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.3c00329",
            "metadata": {
                "abstract": "Recent advances in machine learning have led to the rapid adoption of various computational methods for de novo molecular design in polymer research, including high-throughput virtual screening and inverse molecular design. In such workflows, molecular generators play an essential role in creation or sequential modification of candidate polymer structures. Machine learning-assisted molecular design has made great technical progress over the past few years. However, the difficulty of identifying synthetic routes to such designed polymers remains unresolved. To address this technical limitation, we present Small Molecules into Polymers (SMiPoly), a Python library for virtual polymer generation that implements 22 chemical rules for commonly applied polymerization reactions. For given small organic molecules to form a candidate monomer set, the SMiPoly generator conducts possible polymerization reactions to generate an exhaustive list of potentially synthesizable polymers. In this study, using 1083 readily available monomers, we generated 169,347 unique polymers forming seven different molecular types: polyolefin, polyester, polyether, polyamide, polyimide, polyurethane, and polyoxazolidone. By comparing the distribution of the virtually created polymers with approximately 16,000 real polymers synthesized so far, it was found that the coverage and novelty of the SMiPoly-generated polymers can reach 48 and 53%, respectively. Incorporating the SMiPoly library into a molecular design workflow will accelerate the process of de novo polymer synthesis by shortening the step to select synthesizable candidate polymers.",
                "authors": [
                    {
                        "name": "Hayashi Y."
                    },
                    {
                        "name": "Kaneko Y."
                    },
                    {
                        "name": "Ohno M."
                    },
                    {
                        "name": "Yoshida R."
                    },
                    {
                        "name": "Zhang Q."
                    }
                ],
                "citationCount": 6,
                "date": "2023-09-11T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "SMiPoly: Generation of a Synthesizable Polymer Virtual Library Using Rule-Based Polymerization Reactions"
            },
            "pmcid": "PMC10498440",
            "pmid": "37604495"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
