{"credit":[{"email":"fcchen@nhri.org.tw","name":"Feng-Chi Chen","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Classification","uri":"http://edamontology.org/operation_2990"}]}],"labels":{"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Protein expression","uri":"http://edamontology.org/topic_0108"}]},"publication":[{"abstract":"© 2017 Hsu et al.This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Nonsense-mediated decay (NMD) degrades mRNAs that include premature termination codons to avoid the translation and accumulation of truncated proteins. This mechanism has been found to participate in gene regulation and a wide spectrum of biological processes. However, the evolutionary and regulatory origins of NMD-targeted transcripts (NMDTs) have been less studied, partly because of the complexity in analyzing NMD events. Here we report NMD Classifier, a tool for systematic classification of NMD events for either annotated or de novo assembled transcripts. This tool is based on the assumption of minimal evolution/regulation-an event that leads to the least change is the most likely to occur. Our simulation results indicate that NMD Classifier can correctly identify an average of 99.3% of the NMD-causing transcript structural changes, particularly exon inclusions/ exclusions and exon boundary alterations. Researchers can apply NMD Classifier to evolutionary and regulatory studies by comparing NMD events of different biological conditions or in different organisms.","authors":["Hsu M.-K.","Lin H.-Y.","Chen F.-C."],"cit_count":4,"doi":"10.1371/journal.pone.0174798","journal":"PLoS ONE","title":"NMD Classifier: A reliable and systematic classification tool for nonsense-mediated decay events","type":"Primary","year":"2017-03-01"}],"summary":{"biotoolsCURIE":"biotools:nmd_classifier","biotoolsID":"nmd_classifier","description":"Tool for systematic classification of nonsense mediated decay (NMD) events.","homepage":"https://sourceforge.net/projects/transcriptome-analysis/","name":"NMD classifier"}}