{"credit":[],"function":[{"operation":[{"term":"Microscope image visualisation","uri":"http://edamontology.org/operation_3552"}]}],"labels":{"topic":[{"term":"Surgery","uri":"http://edamontology.org/topic_3421"},{"term":"Medical imaging","uri":"http://edamontology.org/topic_3384"},{"term":"Anatomy","uri":"http://edamontology.org/topic_3067"}]},"publication":[{"abstract":"© 2019, The Author(s).Purpose : A robotic intraoperative laser guidance system with hybrid optic-magnetic tracking for skull base surgery is presented. It provides in situ augmented reality guidance for microscopic interventions at the lateral skull base with minimal mental and workload overhead on surgeons working without a monitor and dedicated pointing tools. Methods : Three components were developed: a registration tool (Rhinospider), a hybrid magneto-optic-tracked robotic feedback control scheme and a modified robotic end-effector. Rhinospider optimizes registration of patient and preoperative CT data by excluding user errors in fiducial localization with magnetic tracking. The hybrid controller uses an integrated microscope HD camera for robotic control with a guidance beam shining on a dual plate setup avoiding magnetic field distortions. A robotic needle insertion platform (iSYS Medizintechnik GmbH, Austria) was modified to position a laser beam with high precision in a surgical scene compatible to microscopic surgery. Results : System accuracy was evaluated quantitatively at various target positions on a phantom. The accuracy found is 1.2 mm ± 0.5 mm. Errors are primarily due to magnetic tracking. This application accuracy seems suitable for most surgical procedures in the lateral skull base. The system was evaluated quantitatively during a mastoidectomy of an anatomic head specimen and was judged useful by the surgeon. Conclusion : A hybrid robotic laser guidance system with direct visual feedback is proposed for navigated drilling and intraoperative structure localization. The system provides visual cues directly on/in the patient anatomy, reducing the standard limitations of AR visualizations like depth perception. The custom- built end-effector for the iSYS robot is transparent to using surgical microscopes and compatible with magnetic tracking. The cadaver experiment showed that guidance was accurate and that the end-effector is unobtrusive. This laser guidance has potential to aid the surgeon in finding the optimal mastoidectomy trajectory in more difficult interventions.","authors":["Bardosi Z.","Plattner C.","Ozbek Y.","Hofmann T.","Milosavljevic S.","Schartinger V.","Freysinger W."],"cit_count":0,"doi":"10.1007/S11548-019-02066-1","journal":"International Journal of Computer Assisted Radiology and Surgery","pmid":"31506882","title":"CIGuide: in situ augmented reality laser guidance","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:CIGuide","biotoolsID":"CIGuide","description":"> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'robotic', 'hybrid', 'Rhinospider', 'end-effector' | in situ augmented reality laser guidance | PURPOSE : A robotic intraoperative laser guidance system with hybrid optic-magnetic tracking for skull base surgery is presented. It provides in situ augmented reality guidance for microscopic interventions at the lateral skull base with minimal mental and workload overhead on surgeons working without a monitor and dedicated pointing tools. METHODS : Three components were developed: a registration tool (Rhinospider), a hybrid magneto-optic-tracked robotic feedback control scheme and a modified robotic end-effector. Rhinospider optimizes registration of patient and preoperative CT data by excluding user errors in fiducial localization with magnetic tracking","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31506882","name":"CIGuide"}}