{
    "accessibility": "Open access",
    "additionDate": "2022-06-09T08:33:52.554797Z",
    "biotoolsCURIE": "biotools:brainquake",
    "biotoolsID": "brainquake",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hongbo@tsinghua.edu.cn",
            "name": "Bo Hong",
            "typeEntity": "Person"
        }
    ],
    "description": "A multi-modal neurodata processing software for intracranial stereo-encephalography (SEEG) electrode localization, ictal & inter-ictal data analysis, and cortical surface reconstruction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HongLabTHU/Brainquake",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-09T08:33:52.557410Z",
    "license": "Apache-2.0",
    "name": "BrainQuake",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FNINF.2021.773890",
            "metadata": {
                "abstract": "Copyright © 2022 Cai, Wang, Zhao, Wang, Zhou and Hong.Intracranial stereoelectroencephalography (SEEG) is broadly used in the presurgical evaluation of intractable epilepsy, due to its high temporal resolution in neural activity recording and high spatial resolution within suspected epileptogenic zones. Neurosurgeons or technicians face the challenge of conducting a workflow of post-processing operations with the multimodal data (e.g., MRI, CT, and EEG) after the implantation surgery, such as brain surface reconstruction, electrode contact localization, and SEEG data analysis. Several software or toolboxes have been developed to take one or more steps in the workflow but without an end-to-end solution. In this study, we introduced BrainQuake, an open-source Python software for the SEEG spatiotemporal analysis, integrating modules and pipelines in surface reconstruction, electrode localization, seizure onset zone (SOZ) prediction based on ictal and interictal SEEG analysis, and final visualizations, each of which is highly automated with a user-friendly graphical user interface (GUI). BrainQuake also supports remote communications with a public server, which is facilitated with automated and standardized preprocessing pipelines, high-performance computing power, and data curation management to provide a time-saving and compatible platform for neurosurgeons and researchers.",
                "authors": [
                    {
                        "name": "Cai F."
                    },
                    {
                        "name": "Hong B."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Zhao T."
                    },
                    {
                        "name": "Zhou W."
                    }
                ],
                "date": "2022-01-07T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "BrainQuake: An Open-Source Python Toolbox for the Stereoelectroencephalography Spatiotemporal Analysis"
            },
            "pmcid": "PMC8782204",
            "pmid": "35069168"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
