{
    "additionDate": "2018-07-19T20:31:47Z",
    "biotoolsCURIE": "biotools:hicrep",
    "biotoolsID": "hicrep",
    "collectionID": [
        "BioConductor"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xadmyangt@gmail.com",
            "name": "Tao Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Hi-C is a powerful technology for studying genome-wide chromatin interactions. However, current methods for assessing Hi-C data reproducibility can produce misleading results because they ignore spatial features in Hi-C data. We present a novel reproducibility measure that systematically takes these features into consideration. This measure can assess pairwise differences between Hi-C matrices under a wide range of settings, and can be used to determine optimal sequencing depth.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/manuals/hicrep/man/hicrep.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://bioconductor.org/packages/release/bioc/src/contrib/hicrep_1.4.0.tar.gz"
        },
        {
            "type": "Source code",
            "url": "http://bioconductor.org/packages/release/bioc/vignettes/hicrep/inst/doc/hicrep-vigenette.R"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/hicrep.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://bioconductor.org/packages/hicrep/"
        }
    ],
    "name": "hicrep",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1101/gr.220640.117",
            "metadata": {
                "abstract": "© 2017 Yang et al.Hi-C is a powerful technology for studying genome-wide chromatin interactions. However, current methods for assessing Hi-C data reproducibility can produce misleading results because they ignore spatial features in Hi-C data, such as domain structure and distance dependence. We present HiCRep, a framework for assessing the reproducibility of Hi-C data that systematically accounts for these features. In particular, we introduce a novel similarity measure, the stratum adjusted correlation coefficient (SCC), for quantifying the similarity between Hi-C interaction matrices. Not only does it provide a statistically sound and reliable evaluation of reproducibility, SCC can also be used to quantify differences between Hi-C contact matrices and to determine the optimal sequencing depth for a desired resolution. The measure consistently shows higher accuracy than existing approaches in distinguishing subtle differences in reproducibility and depicting interrelationships of cell lineages. The proposed measure is straightforward to interpret and easy to compute, making it well-suited for providing standardized, interpretable, automatable, and scalable quality control. The freely available R package HiCRep implements our approach.",
                "authors": [
                    {
                        "name": "Hardison R.C."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Noble W.S."
                    },
                    {
                        "name": "Song F."
                    },
                    {
                        "name": "Yang T."
                    },
                    {
                        "name": "Yardimci G.G."
                    },
                    {
                        "name": "Yue F."
                    },
                    {
                        "name": "Zhang F."
                    }
                ],
                "citationCount": 100,
                "date": "2017-11-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "HiCRep: assessing the reproducibility of Hi-C data using a stratum-adjusted correlation coefficient"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.0"
    ]
}
