{
    "additionDate": "2016-05-04T15:36:53Z",
    "biotoolsCURIE": "biotools:inps",
    "biotoolsID": "inps",
    "collectionID": [
        "Bologna Biocomputing group"
    ],
    "credit": [
        {
            "name": "ELIXIR-ITA-BOLOGNA",
            "typeEntity": "Division",
            "typeRole": [
                "Provider"
            ],
            "url": "http://www.biocomp.unibo.it"
        },
        {
            "email": "savojard@biocomp.unibo.it",
            "name": "Castrense Savojardo",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "piero@biocomp.unibo.it",
            "name": "Piero Fariselli",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "savojard@biocomp.unibo.it",
            "name": "Castrense Savojardo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biocomp.unibo.it/savojard/"
        }
    ],
    "description": "Predicting the impact of mutations on protein stability from sequence",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://inpsmd.biocomp.unibo.it/inpsSuite"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-BOLOGNA",
            "savo"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence (raw)",
                        "uri": "http://edamontology.org/data_2974"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Prediction of the impact of non-synonymous polymorphisms on protein stability",
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein report",
                        "uri": "http://edamontology.org/data_0896"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://inps.biocomp.unibo.it",
    "lastUpdate": "2021-03-31T16:03:26Z",
    "name": "INPS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-BOLOGNA",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv291",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Motivation: A tool for reliably predicting the impact of variations on protein stability is extremely important for both protein engineering and for understanding the effects of Mendelian and somatic mutations in the genome. Next Generation Sequencing studies are constantly increasing the number of protein sequences. Given the huge disproportion between protein sequences and structures, there is a need for tools suited to annotate the effect of mutations starting from protein sequence without relying on the structure. Here, we describe INPS, a novel approach for annotating the effect of non-synonymous mutations on the protein stability from its sequence. INPS is based on SVM regression and it is trained to predict the thermodynamic free energy change upon single-point variations in protein sequences. Results: We show that INPS performs similarly to the state-of-the-art methods based on protein structure when tested in cross-validation on a non-redundant dataset. INPS performs very well also on a newly generated dataset consisting of a number of variations occurring in the tumor suppressor protein p53. Our results suggest that INPS is a tool suited for computing the effect of non-synonymous polymorphisms on protein stability when the protein structure is not available. We also show that INPS predictions are complementary to those of the state-of-the-art, structure-based method mCSM. When the two methods are combined, the overall prediction on the p53 set scores significantly higher than those of the single methods.",
                "authors": [
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Savojardo C."
                    },
                    {
                        "name": "Casadio R."
                    }
                ],
                "citationCount": 53,
                "date": "2015-02-06T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "INPS: Predicting the impact of non-synonymous variations on protein stability from sequence"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btw192",
            "metadata": {
                "abstract": "© 2016 The Author 2016. Published by Oxford University Press. All rights reserved.Motivation: Protein function depends on its structural stability. The effects of single point variations on protein stability can elucidate the molecular mechanisms of human diseases and help in developing new drugs. Recently, we introduced INPS, a method suited to predict the effect of variations on protein stability from protein sequence and whose performance is competitive with the available state-of-the-art tools. Results: In this article, we describe INPS-MD (Impact of Non synonymous variations on Protein Stability-Multi-Dimension), a web server for the prediction of protein stability changes upon single point variation from protein sequence and/or structure. Here, we complement INPS with a new predictor (INPS3D) that exploits features derived from protein 3D structure. INPS3D scores with Pearson's correlation to experimental ΔΔG values of 0.58 in cross validation and of 0.72 on a blind test set. The sequence-based INPS scores slightly lower than the structure-based INPS3D and both on the same blind test sets well compare with the state-of-the-art methods.",
                "authors": [
                    {
                        "name": "Savojardo C."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Casadio R."
                    }
                ],
                "citationCount": 61,
                "date": "2016-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "INPS-MD: A web server to predict stability of protein variants from sequence and structure"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}