{
    "additionDate": "2017-08-03T19:03:19Z",
    "biotoolsCURIE": "biotools:tilingscan",
    "biotoolsID": "tilingscan",
    "credit": [
        {
            "email": "J.Miguel.Juanes@uv.es",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://tilingscan.uv.es/support"
        }
    ],
    "description": "An application for the identification of differentially expressed DNA regions in Tiling Microarray data.",
    "documentation": [
        {
            "type": "General",
            "url": "http://tilingscan.uv.es/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://tilingscan.uv.es/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tilingscan-analyze-tiling-array-results-online.html"
        }
    ],
    "name": "TilingScan",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015.Genomic technologies allow laboratories to produce large-scale data sets, either through the use of next-generation sequencing or microarray platforms. To explore these data sets and obtain maximum value from the data, researchers view their results alongside all the known features of a given reference genome. To study transcriptional changes that occur under a given condition, researchers search for regions of the genome that are differentially expressed between different experimental conditions. In order to identify these regions several algorithms have been developed over the years, along with some bioinformatic platforms that enable their use. However, currently available applications for comparative microarray analysis exclusively focus on changes in gene expression within known transcribed regions of predicted protein-coding genes, the changes that occur in non-predictable genetic elements, such as non-coding RNAs. Here, we present a web application for the visualization of strand-specific tiling microarray or next-generation sequencing data that allows customized detection of differentially expressed regions all along the genome in an unspecific manner, that allows identification of all RNA sequences, predictable or not.",
                "authors": [
                    {
                        "name": "Juanes J.M."
                    },
                    {
                        "name": "Miguel A."
                    },
                    {
                        "name": "Morales L.J."
                    },
                    {
                        "name": "Perez-Ortin J.E."
                    },
                    {
                        "name": "Arnau V."
                    }
                ],
                "date": "2015-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A web application for the unspecific detection of differentially expressed DNA regions in strand-specific expression data"
            },
            "pmid": "26040457"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}