{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T11:05:29.153241Z",
    "biotoolsCURIE": "biotools:metabovariation",
    "biotoolsID": "metabovariation",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lorraine.brennan@ucd.ie",
            "name": "Lorraine Brennan",
            "orcidid": "https://orcid.org/0000-0002-7711-7499",
            "typeEntity": "Person"
        },
        {
            "name": "Shubbham Gupta"
        },
        {
            "name": "Isobel Claire Gormley",
            "orcidid": "https://orcid.org/0000-0001-7713-681X"
        }
    ],
    "description": "Exploring Individual Variation in Metabolite Levels.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/shubbham28/MetaboVariation",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-03-19T11:05:29.158249Z",
    "license": "MIT",
    "name": "MetaboVariation",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/METABO13020164",
            "metadata": {
                "abstract": "To date, most metabolomics biomarker research has focused on identifying disease biomarkers. However, there is a need for biomarkers of early metabolic dysfunction to identify individuals who would benefit from lifestyle interventions. Concomitantly, there is a need to develop strategies to analyse metabolomics data at an individual level. We propose “MetaboVariation”, a method that models repeated measurements on individuals to explore fluctuations in metabolite levels at an individual level. MetaboVariation employs a Bayesian generalised linear model to flag individuals with intra-individual variations in their metabolite levels across multiple measurements. MetaboVariation models repeated metabolite levels as a function of explanatory variables while accounting for intra-individual variation. The posterior predictive distribution of metabolite levels at the individual level is available, and is used to flag individuals with observed metabolite levels outside the 95% highest posterior density prediction interval at a given time point. MetaboVariation was applied to a dataset containing metabolite levels for 20 metabolites, measured once every four months, in 164 individuals. A total of 28% of individuals with intra-individual variations in three or more metabolites were flagged. An R package for MetaboVariation was developed with an embedded R Shiny web application. To summarize, MetaboVariation has made considerable progress in developing strategies for analysing metabolomics data at the individual level, thus paving the way toward personalised healthcare.",
                "authors": [
                    {
                        "name": "Brennan L."
                    },
                    {
                        "name": "Gormley I.C."
                    },
                    {
                        "name": "Gupta S."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "MetaboVariation: Exploring Individual Variation in Metabolite Levels"
            },
            "pmcid": "PMC9965648",
            "pmid": "36837783"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
