{
    "accessibility": "Open access",
    "additionDate": "2021-11-28T20:52:24.735800Z",
    "biotoolsCURIE": "biotools:phosidn",
    "biotoolsID": "phosidn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mhwang@ustc.edu.cn",
            "name": "Minghui Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Ao Li"
        },
        {
            "name": "Xia Liu"
        },
        {
            "name": "Hangyuan Yang",
            "orcidid": "https://orcid.org/0000-0001-8406-3129"
        },
        {
            "name": "Xing-Ming Zhao",
            "orcidid": "https://orcid.org/0000-0002-4531-3970"
        }
    ],
    "description": "An integrated deep neural network for improving protein phosphorylation site prediction by combining sequence and protein-protein interaction information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ustchangyuanyang/PhosIDN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:15:56.476587Z",
    "license": "Not licensed",
    "name": "PhosIDN",
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab551",
            "metadata": {
                "abstract": "Motivation: Phosphorylation is one of the most studied post-translational modifications, which plays a pivotal role in various cellular processes. Recently, deep learning methods have achieved great success in prediction of phosphorylation sites, but most of them are based on convolutional neural network that may not capture enough information about long-range dependencies between residues in a protein sequence. In addition, existing deep learning methods only make use of sequence information for predicting phosphorylation sites, and it is highly desirable to develop a deep learning architecture that can combine heterogeneous sequence and protein-protein interaction (PPI) information for more accurate phosphorylation site prediction. Results: We present a novel integrated deep neural network named PhosIDN, for phosphorylation site prediction by extracting and combining sequence and PPI information. In PhosIDN, a sequence feature encoding sub-network is proposed to capture not only local patterns but also long-range dependencies from protein sequences. Meanwhile, useful PPI features are also extracted in PhosIDN by a PPI feature encoding sub-network adopting a multi-layer deep neural network. Moreover, to effectively combine sequence and PPI information, a heterogeneous feature combination sub-network is introduced to fully exploit the complex associations between sequence and PPI features, and their combined features are used for final prediction. Comprehensive experiment results demonstrate that the proposed PhosIDN significantly improves the prediction performance of phosphorylation sites and compares favorably with existing general and kinase-specific phosphorylation site prediction methods.",
                "authors": [
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Zhao X.-M."
                    }
                ],
                "citationCount": 45,
                "date": "2021-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PhosIDN: An integrated deep neural network for improving protein phosphorylation site prediction by combining sequence and protein-protein interaction information"
            },
            "pmcid": "PMC8665744",
            "pmid": "34320631"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ],
    "validated": 1
}
