{
    "additionDate": "2022-09-14T06:03:09.311970Z",
    "biotoolsCURIE": "biotools:evorator",
    "biotoolsID": "evorator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Natan Nagar"
        },
        {
            "name": "Nir Ben Tal"
        },
        {
            "name": "Tal Pupko"
        }
    ],
    "description": "EvoRator employs machine-learning for prediction of residue-level evolutionary rates from protein structure. This prediction is based on various features comprising the structural information characterizing the protein.",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "https://evorator.tau.ac.il/overview.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "https://evorator.tau.ac.il/",
    "lastUpdate": "2024-11-24T15:39:35.067618Z",
    "license": "Not licensed",
    "name": "EvoRator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2022.167538",
            "metadata": {
                "abstract": "Measuring evolutionary rates at the residue level is indispensable for gaining structural and functional insights into proteins. State-of-the-art tools for estimating rates take as input a large set of homologous proteins, a probabilistic model of evolution and a phylogenetic tree. However, a gap exists when only few or no homologous proteins can be found, e.g., orphan proteins. In addition, such tools do not take the three-dimensional (3D) structure of the protein into account. The association between the 3D structure and site-specific rates can be learned using machine-learning regression tools from a cohort of proteins for which both the structure and a large set of homologs exist. Here we present EvoRator, a user-friendly web server that implements a machine-learning regression algorithm to predict site-specific evolutionary rates from protein structures. We show that EvoRator outperforms predictions obtained using traditional physicochemical features, such as relative solvent accessibility and weighted contact number. We also demonstrate the application of EvoRator in three common scenarios that arise in protein evolution research: (1) orphan proteins for which no (or few) homologs exist; (2) When homologous sequences exist, our algorithm contrasts structure-based estimates of the evolutionary rates and the phylogeny-based estimates. This allows detecting sites that are likely conserved due to functional rather than structural constraints; (3) Algorithms that only rely on homologous sequence often fail to accurately measure the evolutionary rates of positions in gapped sequence alignments, which frequently occurs as a result of a clade-specific insertion. Our algorithm makes use of training data and known 3D structure of such gapped positions to predict their evolutionary rates. EvoRator is freely available for all users at: https://evorator.tau.ac.il/.",
                "authors": [
                    {
                        "name": "Ben Tal N."
                    },
                    {
                        "name": "Nagar N."
                    },
                    {
                        "name": "Pupko T."
                    }
                ],
                "citationCount": 8,
                "date": "2022-06-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "EvoRator: Prediction of Residue-level Evolutionary Rates from Protein Structures Using Machine Learning"
            },
            "pmid": "35662466"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}
