{
    "additionDate": "2021-01-18T09:52:30Z",
    "biotoolsCURIE": "biotools:mirpls",
    "biotoolsID": "mirpls",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hliang@gwu.edu",
            "name": "Hua Liang",
            "typeEntity": "Person"
        }
    ],
    "description": "A partial linear structure identifier method for cancer subtyping using microRNAs.\n\nThe R package for ‘mirPLS: a partial linear structure identifier method for cancer subtyping using MicroRNAs’.\n\nRun cv_mirPLS to determine the regularization parameters: lambda1 and lambda2. We suggest to search lambda1 and lambda2 in the ranges of (0, 1) and (0, 10), respectively. With lambda1 and lambda2, run mirPLS to select miRNAs linearly or non-linearly associated with disease outcomes. Finally, run sp_clustering to conduct spectral clustering on patients using the selected non-linearly associated miRNAs. In the whole process, cv_mirPLS are time consuming. It may take hours to run the whole process for a typical miRNA data from TCGA.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pfruan/mirPLS",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-24T08:17:41Z",
    "name": "mirPLS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA606",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: MicroRNAs (miRNAs) are small non-coding RNAs that have been successfully identified to be differentially expressed in various cancers. However, some miRNAs were reported to be up-regulated in one subtype of a cancer but down-regulated in another, making overall associations between these miRNAs and the heterogeneous cancer non-linear. These non-linearly associated miRNAs, if identified, are thus informative for cancer subtyping. Results: Here, we propose mirPLS, a Partial Linear Structure identifier for miRNA data that simultaneously identifies miRNAs of linear or non-linear associations with cancer status when non-linearly associated miRNAs can then be used for subsequent cancer subtyping. Simulation studies showed that mirPLS can identify both non-linearly and linearly outcome-associated miRNAs more accurately than the comparison methods. Using the identified nonlinearly associated miRNAs much improves the cancer subtyping accuracy. Applications to miRNA data of three different cancer types suggest that the cancer subtypes defined by the non-linearly associated miRNAs identified by mirPLS are consistently more predictive of patient survival and more biological meaningful. Availability and implementation: The R package mirPLS is available for downloading from https://github.com/ pfruan/mirPLS.",
                "authors": [
                    {
                        "name": "Ruan P."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Liang H."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MirPLS: A partial linear structure identifier method for cancer subtyping using microRNAs"
            },
            "pmid": "32609318"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}