{
    "additionDate": "2017-08-03T18:44:20Z",
    "biotoolsCURIE": "biotools:gidetector",
    "biotoolsID": "gidetector",
    "credit": [
        {
            "email": "dche@po-box.esu.edu",
            "name": "Dongsheng Che",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software that is used to detect genomic islands in prokaryotic genomes. It collects prokaryotic genome data from public websites based on users’ specification, analyzes genome features using multiple sources, including embedded third-party software Alien_hunter and REPuter, and predict genomic islands based on our trained models, which are decision-tree based ensemble classifiers.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www5.esu.edu/cpsc/bioinfo/software/GIDetector/faq.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "http://www5.esu.edu/cpsc/bioinfo/software/GIDetector/",
    "language": [
        "C#",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gidetector-detect-genomic-islands-prokaryotic-genomes.html"
        }
    ],
    "maturity": "Legacy",
    "name": "GIDetector",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Genomic islands (GIs) are clusters of alien genes in some bacterial genomes, but not be seen in the genomes of other strains within the same genus. The detection of GIs is extremely important to the medical and environmental communities. Despite the discovery of the GI associated features, accurate detection of GIs is still far from satisfactory.Results: In this paper, we combined multiple GI-associated features, and applied and compared various machine learning approaches to evaluate the classification accuracy of GIs datasets on three genera: Salmonella, Staphylococcus, Streptococcus, and their mixed dataset of all three genera. The experimental results have shown that, in general, the decision tree approach outperformed better than other machine learning methods according to five performance evaluation metrics. Using J48 decision trees as base classifiers, we further applied four ensemble algorithms, including adaBoost, bagging, multiboost and random forest, on the same datasets. We found that, overall, these ensemble classifiers could improve classification accuracy.Conclusions: We conclude that decision trees based ensemble algorithms could accurately classify GIs and non-GIs, and recommend the use of these methods for the future GI data analysis. The software package for detecting GIs can be accessed at http://www.esu.edu/cpsc/che_lab/software/GIDetector/. © 2010 Che et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Che D."
                    },
                    {
                        "name": "Hockenbury C."
                    },
                    {
                        "name": "Marmelstein R."
                    },
                    {
                        "name": "Rasheed K."
                    }
                ],
                "citationCount": 17,
                "date": "2010-11-02T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Classification of genomic islands using decision trees and their ensemble algorithms"
            },
            "pmid": "21047376"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
