{
    "additionDate": "2022-10-04T08:24:47.723049Z",
    "biotoolsCURIE": "biotools:degron-related",
    "biotoolsID": "degron-related",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "litt@hsc.pku.edu.cn",
            "name": "Tingting Li",
            "orcidid": "https://orcid.org/0000-0003-4266-0317",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning model to predict E3 binding sites (degrons) on protein substrates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://degron.phasep.pro/data_summary/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://degron.phasep.pro/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-04T08:24:47.725503Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CHAOHOU-97/degpred"
        }
    ],
    "name": "degron-related",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12915-022-01364-6",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Degrons are short linear motifs, bound by E3 ubiquitin ligase to target protein substrates to be degraded by the ubiquitin-proteasome system. Mutations leading to deregulation of degron functionality disrupt control of protein abundance due to mistargeting of proteins destined for degradation and often result in pathologies. Targeting degrons by small molecules also emerges as an exciting drug design strategy to upregulate the expression of specific proteins. Despite their essential function and disease targetability, reliable identification of degrons remains a conundrum. Here, we developed a deep learning-based model named Degpred that predicts general degrons directly from protein sequences. Results: We showed that the BERT-based model performed well in predicting degrons singly from protein sequences. Then, we used the deep learning model Degpred to predict degrons proteome-widely. Degpred successfully captured typical degron-related sequence properties and predicted degrons beyond those from motif-based methods which use a handful of E3 motifs to match possible degrons. Furthermore, we calculated E3 motifs using predicted degrons on the substrates in our collected E3-substrate interaction dataset and constructed a regulatory network of protein degradation by assigning predicted degrons to specific E3s with calculated motifs. Critically, we experimentally verified that a predicted SPOP binding degron on CBX6 prompts CBX6 degradation and mediates the interaction with SPOP. We also showed that the protein degradation regulatory system is important in tumorigenesis by surveying degron-related mutations in TCGA. Conclusions: Degpred provides an efficient tool to proteome-wide prediction of degrons and binding E3s singly from protein sequences. Degpred successfully captures typical degron-related sequence properties and predicts degrons beyond those from previously used motif-based methods, thus greatly expanding the degron landscape, which should advance the understanding of protein degradation, and allow exploration of uncharacterized alterations of proteins in diseases. To make it easier for readers to access collected and predicted datasets, we integrated these data into the website http://degron.phasep.pro/.",
                "authors": [
                    {
                        "name": "Hou C."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Wu H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Biology",
                "title": "Systematic prediction of degrons and E3 ubiquitin ligase binding via deep learning"
            },
            "pmcid": "PMC9281121",
            "pmid": "35836176"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
