{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T13:41:26Z",
    "biotoolsCURIE": "biotools:iDEP",
    "biotoolsID": "iDEP",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Xijin.Ge@SDSTATE.EDU",
            "name": "X. Ge",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Integrated web application for differential expression and pathway analysis of RNA-Seq.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.sdstate.edu/idep/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/iDEP-SDSU/idep"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/iDEP-SDSU/idep/issues"
        }
    ],
    "maturity": "Mature",
    "name": "iDEP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2486-6",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: RNA-seq is widely used for transcriptomic profiling, but the bioinformatics analysis of resultant data can be time-consuming and challenging, especially for biologists. We aim to streamline the bioinformatic analyses of gene-level data by developing a user-friendly, interactive web application for exploratory data analysis, differential expression, and pathway analysis. Results: iDEP (integrated Differential Expression and Pathway analysis) seamlessly connects 63 R/Bioconductor packages, 2 web services, and comprehensive annotation and pathway databases for 220 plant and animal species. The workflow can be reproduced by downloading customized R code and related pathway files. As an example, we analyzed an RNA-Seq dataset of lung fibroblasts with Hoxa1 knockdown and revealed the possible roles of SP1 and E2F1 and their target genes, including microRNAs, in blocking G1/S transition. In another example, our analysis shows that in mouse B cells without functional p53, ionizing radiation activates the MYC pathway and its downstream genes involved in cell proliferation, ribosome biogenesis, and non-coding RNA metabolism. In wildtype B cells, radiation induces p53-mediated apoptosis and DNA repair while suppressing the target genes of MYC and E2F1, and leads to growth and cell cycle arrest. iDEP helps unveil the multifaceted functions of p53 and the possible involvement of several microRNAs such as miR-92a, miR-504, and miR-30a. In both examples, we validated known molecular pathways and generated novel, testable hypotheses. Conclusions: Combining comprehensive analytic functionalities with massive annotation databases, iDEP ( http://ge-lab.org/idep/ ) enables biologists to easily translate transcriptomic and proteomic data into actionable insights.",
                "authors": [
                    {
                        "name": "Ge S.X."
                    },
                    {
                        "name": "Son E.W."
                    },
                    {
                        "name": "Yao R."
                    }
                ],
                "citationCount": 93,
                "date": "2018-12-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "iDEP: An integrated web application for differential expression and pathway analysis of RNA-Seq data"
            },
            "pmcid": "PMC6299935",
            "pmid": "30567491",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}