{
    "additionDate": "2021-01-18T07:10:20Z",
    "biotoolsCURIE": "biotools:smash-swap",
    "biotoolsID": "smash-swap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bundschuh@mps.ohio-state.edu",
            "name": "Ralf Bundschuh",
            "typeEntity": "Person"
        }
    ],
    "description": "Sample matching using SNPs in humans.\n\nA tool for sample swap identification in high throughput sequencing studies.\n\nSample swaps are a real concern in high throughput sequencing studies. SMaSH helps detect such sample swaps by integrating the information from over 6000 carefully selected single nucleotide polymorphism (SNP) sites from across the human genome to identify which samples in a group of sequencing data sets are derived from the same human individual. Importantly, SMaSH is able to verify sample identity between different data types, such as RNA-Seq, exome, and MethylCap-Seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://github.com/rbundschuh/SMaSH",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-19T16:10:13Z",
    "name": "SMASH",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6332-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Inadvertent sample swaps are a real threat to data quality in any medium to large scale omics studies. While matches between samples from the same individual can in principle be identified from a few well characterized single nucleotide polymorphisms (SNPs), omics data types often only provide low to moderate coverage, thus requiring integration of evidence from a large number of SNPs to determine if two samples derive from the same individual or not. Methods: We select about six thousand SNPs in the human genome and develop a Bayesian framework that is able to robustly identify sample matches between next generation sequencing data sets. Results: We validate our approach on a variety of data sets. Most importantly, we show that our approach can establish identity between different omics data types such as Exome, RNA-Seq, and MethylCap-Seq. We demonstrate how identity detection degrades with sample quality and read coverage, but show that twenty million reads of a fairly low quality RNA-Seq sample are still sufficient for reliable sample identification. Conclusion: Our tool, SMASH, is able to identify sample mismatches in next generation sequencing data sets between different sequencing modalities and for low quality sequencing data.",
                "authors": [
                    {
                        "name": "Westphal M."
                    },
                    {
                        "name": "Frankhouser D."
                    },
                    {
                        "name": "Sonzone C."
                    },
                    {
                        "name": "Shields P.G."
                    },
                    {
                        "name": "Yan P."
                    },
                    {
                        "name": "Bundschuh R."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "SMaSH: Sample matching using SNPs in humans"
            },
            "pmcid": "PMC6936078",
            "pmid": "31888490"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}