{
    "additionDate": "2020-01-14T09:34:27Z",
    "biotoolsCURIE": "biotools:ML-Force",
    "biotoolsID": "ML-Force",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "till.koester@uni-rostock.de",
            "name": "Till Köster",
            "typeEntity": "Person"
        }
    ],
    "description": "Potential based, spatial simulation of dynamically nested particles.\n\nSource repository for the publication \"Potential based, spatial simulation of dynamically nested particles\" in BMV Bioinformatics.\n\nML-Force source code added · 1e971b94.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://git.informatik.uni-rostock.de/mosi/ml-force-publication",
    "lastUpdate": "2020-12-29T09:28:30Z",
    "name": "ML-Force",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3092-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: To study cell biological phenomena which depend on diffusion, active transport processes, or the locations of species, modeling and simulation studies need to take space into account. To describe the system as a collection of discrete objects moving and interacting in continuous space, various particle-based reaction diffusion simulators for cell-biological system have been developed. So far the focus has been on particles as solid spheres or points. However, spatial dynamics might happen at different organizational levels, such as proteins, vesicles or cells with interrelated dynamics which requires spatial approaches that take this multi-levelness of cell biological systems into account. Results: Based on the perception of particles forming hollow spheres, ML-Force contributes to the family of particle-based simulation approaches: in addition to excluded volumes and forces, it also supports compartmental dynamics and relating dynamics between different organizational levels explicitly. Thereby, compartmental dynamics, e.g., particles entering and leaving other particles, and bimolecular reactions are modeled using pair-wise potentials (forces) and the Langevin equation. In addition, forces that act independently of other particles can be applied to direct the movement of particles. Attributes and the possibility to define arbitrary functions on particles, their attributes and content, to determine the results and kinetics of reactions add to the expressiveness of ML-Force. Its implementation comprises a rudimentary rule-based embedded domain-specific modeling language for specifying models and a simulator for executing models continuously. Applications inspired by cell biological models from literature, such as vesicle transport or yeast growth, show the value of the realized features. They facilitate capturing more complex spatial dynamics, such as the fission of compartments or the directed movement of particles, and enable the integration of non-spatial intra-compartmental dynamics as stochastic events. Conclusions: By handling all dynamics based on potentials (forces) and the Langevin equation, compartmental dynamics, such as dynamic nesting, fusion and fission of compartmental structures are handled continuously and are seamlessly integrated with traditional particle-based reaction-diffusion dynamics within the cell. Thereby, attributes and arbitrary functions allow to flexibly describe diverse spatial phenomena, and relate dynamics across organizational levels. Also they prove crucial in modeling intra-cellular or intra-compartmental dynamics in a non-spatial manner, and, thus, to abstract from spatial dynamics, on demand which increases the range of multi-compartmental processes that can be captured.",
                "authors": [
                    {
                        "name": "Henning P."
                    },
                    {
                        "name": "Koster T."
                    },
                    {
                        "name": "Uhrmacher A.M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Potential based, spatial simulation of dynamically nested particles"
            },
            "pmcid": "PMC6880518",
            "pmid": "31775608"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1
}
