{
    "additionDate": "2017-02-14T09:34:58Z",
    "biotoolsCURIE": "biotools:gendoo",
    "biotoolsID": "gendoo",
    "credit": [
        {
            "email": "nakazato@dbcls.jp",
            "name": "Takeru Nakazato",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Gene Disease Features Ontology-based Overview System (Gendoo) is a web tool for visualizing disease feature profiles generated from the assignment of MeSH vocabulary for associated drugs, biological phenomena and anatomy to OMIM data. This approach assists in interpreting -omic data for its molecular and clinical aspects.",
    "documentation": [
        {
            "type": "General",
            "url": "http://gendoo.dbcls.jp/help/help-en.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "http://gendoo.dbcls.jp",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "Gendoo",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Genome-wide data enables us to clarify the underlying molecular mechanisms of complex phenotypes. The Online Mendelian Inheritance in Man (OMIM) is a widely employed knowledge base of human genes and genetic disorders for biological researchers. However, OMIM has not been fully exploited for omics analysis because its bibliographic data structure is not suitable for computer automation. Here, we characterized diseases and genes by generating feature profiles of associated drugs, biological phenomena and anatomy with the MeSH (Medical Subject Headings) vocabulary. We obtained 1 760 054 pairs of OMIM entries and MeSH terms by utilizing the full set of MEDLINE articles. We developed a web-based application called Gendoo (gene, disease features ontology-based overview system) to visualize these profiles. By comparing feature profiles of types 1 and 2 diabetes, we clearly illustrated their differences: type 1 diabetes is an autoimmune disease (P-value = 4.55 × 10-5) and type 2 diabetes is related to obesity (P-value = 1.18 × 10-15). Gendoo and the developed feature profiles should be useful for omics analysis from molecular and clinical viewpoints. Gendoo is available at http://gendoo.dbcls.jp/.",
                "authors": [
                    {
                        "name": "Nakazato T."
                    },
                    {
                        "name": "Bono H."
                    },
                    {
                        "name": "Matsuda H."
                    },
                    {
                        "name": "Takagi T."
                    }
                ],
                "citationCount": 22,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Gendoo: Functional profiling of gene and disease features using MeSH vocabulary"
            },
            "pmid": "19498079"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}