{
    "additionDate": "2022-11-03T07:31:28.467707Z",
    "biotoolsCURIE": "biotools:enhancer-frl",
    "biotoolsID": "enhancer-frl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Hua Shi",
            "orcidid": "https://orcid.org/0000-0001-8812-5737"
        },
        {
            "name": "Wang Shao",
            "orcidid": "https://orcid.org/0000-0002-4649-3176"
        }
    ],
    "description": "Enhancer-FRL, a two-layer predictor proposed for identifying enhancers (enhancers or non-enhancers) and their activities (strong and weak) using the feature representation learning scheme.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://lab.malab.cn/~wangchao/softwares/Enhancer-FRL/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-11-03T07:31:28.470184Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/wangchao-malab/Enhancer-FRL/"
        }
    ],
    "name": "Enhancer-FRL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TCBB.2022.3204365",
            "metadata": {
                "abstract": "IEEEEnhancers are crucial for precise regulation of gene expression, while enhancer identification and strength prediction are challenging because of their free distribution and tremendous number of similar fractions in the genome. Although several bioinformatics tools have been developed, shortfalls in these models remain, and their performances need further improvement. In the present study, a two-layer predictor called Enhancer-FRL was proposed for identifying enhancers (enhancers or nonenhancers) and their activities (strong and weak). More specifically, to build an efficient model, the feature representation learning scheme was applied to generate a 50D probabilistic vector based on 10 feature encodings and five machine learning algorithms. Subsequently, the multiview probabilistic features were integrated to construct the final prediction model. Compared with the single feature-based model, Enhancer-FRL showed significant performance improvement and model robustness. Performance assessment on the independent test dataset indicated that the proposed model outperformed state-of-the-art available toolkits. The webserver Enhancer-FRL is freely accessible at <uri>http://lab.malab.cn/&#x223C;wangchao/softwares/Enhancer-FRL/</uri>, The code and datasets can be downloaded at the webserver page or at the Github <uri>https://github.com/wangchao-malab/Enhancer-FRL/</uri>.",
                "authors": [
                    {
                        "name": "Ju Y."
                    },
                    {
                        "name": "Shi H."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Enhancer-FRL: Improved and Robust Identification of Enhancers and Their Activities Using Feature Representation Learning"
            },
            "pmid": "36063523"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
