{
    "additionDate": "2019-11-14T19:32:15Z",
    "biotoolsCURIE": "biotools:EWCA",
    "biotoolsID": "EWCA",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "liugx@jlu.edu.cn",
            "name": "Guixia Liu",
            "orcidid": "https://orcid.org/0000-0002-3375-9561",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying protein complexes based on an edge weight algorithm and core-attachment structure | Identifying protein complexes based on an edge weighted algorithm and core-attachment structure | this is a graph clustering algorithm for detection protein complexes or functional modules from biological networks",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RongquanWang/EWCA",
    "lastUpdate": "2019-11-14T19:32:15Z",
    "name": "EWCA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3007-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Protein complex identification from protein-protein interaction (PPI) networks is crucial for understanding cellular organization principles and functional mechanisms. In recent decades, numerous computational methods have been proposed to identify protein complexes. However, most of the current state-of-the-art studies still have some challenges to resolve, including their high false-positives rates, incapability of identifying overlapping complexes, lack of consideration for the inherent organization within protein complexes, and absence of some biological attachment proteins. Results: In this paper, to overcome these limitations, we present a protein complex identification method based on an edge weight method and core-attachment structure (EWCA) which consists of a complex core and some sparse attachment proteins. First, we propose a new weighting method to assess the reliability of interactions. Second, we identify protein complex cores by using the structural similarity between a seed and its direct neighbors. Third, we introduce a new method to detect attachment proteins that is able to distinguish and identify peripheral proteins and overlapping proteins. Finally, we bind attachment proteins to their corresponding complex cores to form protein complexes and discard redundant protein complexes. The experimental results indicate that EWCA outperforms existing state-of-the-art methods in terms of both accuracy and p-value. Furthermore, EWCA could identify many more protein complexes with statistical significance. Additionally, EWCA could have better balance accuracy and efficiency than some state-of-the-art methods with high accuracy. Conclusions: In summary, EWCA has better performance for protein complex identification by a comprehensive comparison with twelve algorithms in terms of different evaluation metrics. The datasets and software are freely available for academic research at https://github.com/RongquanWang/EWCA.",
                "authors": [
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Wang C."
                    }
                ],
                "citationCount": 2,
                "date": "2019-09-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Identifying protein complexes based on an edge weight algorithm and core-attachment structure"
            },
            "pmcid": "PMC6744658",
            "pmid": "31521132"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3557"
        }
    ]
}