{
    "additionDate": "2020-01-09T18:09:00Z",
    "biotoolsCURIE": "biotools:PRJNA421075",
    "biotoolsID": "PRJNA421075",
    "confidence_flag": "medium",
    "description": "Bovine milk transcriptome analysis reveals microRNAs and RNU2 involved in mastitis.\n\nA BioProject is a collection of biological data related to a single initiative, originating from a single organization or from a consortium. A BioProject record provides users a single place to find links to the diverse data types generated for that project.\n\nAccession: PRJNA421075 ID: 421075.\n\n||| NAME (PRJNA421075) SIMILAR TO (PUB. DIFFERENT) bio.tools/PRJNA562212 (PRJNA562212).\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/bioproject (NLM.NIH.GOV/bioproject).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'bovine mastitis', 'mastitis', 'miR-1246', 'RNU2'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/bioproject/PRJNA421075",
    "lastUpdate": "2020-01-09T18:09:00Z",
    "name": "PRJNA421075",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/FEBS.15114",
            "metadata": {
                "abstract": "© 2019 Federation of European Biochemical SocietiesMastitis is a common inflammatory infectious disease in dairy cows. To understand the microRNA (miRNA) expression profile changes during bovine mastitis, we undertook a genome-wide miRNA study of normal milk and milk that tested positive on the California mastitis test for bovine mastitis (CMT+). Twenty-five miRNAs were differentially expressed (23 miRNAs upregulated and two downregulated) during bovine mastitis relative to their expression in normal milk. Upregulated mature miR-1246 probably derived from a U2 small nuclear RNA rather than an miR-1246 precursor. The significantly upregulated miRNA precursors and RNU2 were significantly enriched on bovine chromosome 19, which is homologous to human chromosome 17. A gene ontology analysis of the putative mRNA targets of the significantly upregulated miRNAs showed that these miRNAs were involved in binding target mRNA transcripts and regulating target gene expression, and a Kyoto Encyclopedia of Genes and Genomes pathway analysis showed that the upregulated miRNAs were predominantly related to cancer and immune system pathways. Three novel miRNAs were associated with bovine mastitis and were relatively highly expressed in milk. We confirmed that one of the novel mastitis-related miRNAs was significantly upregulated using a digital PCR system. The differentially expressed miRNAs were involved in human cancers, infections, and immune-related diseases. The genome-wide analysis of miRNA profiles in this study provides insight into bovine mastitis and inflammatory diseases. Databases: The miRNAseq generated for this study can be found in the Sequence Read Archive (SRA) under BioProject Number PRJNA421075 and SRA Study Number SRP126134 (https://www.ncbi.nlm.nih.gov/bioproject/PRJNA421075).",
                "authors": [
                    {
                        "name": "Lai Y.-C."
                    },
                    {
                        "name": "Lai Y.-T."
                    },
                    {
                        "name": "Rahman M.M."
                    },
                    {
                        "name": "Chen H.-W."
                    },
                    {
                        "name": "Husna A.A."
                    },
                    {
                        "name": "Fujikawa T."
                    },
                    {
                        "name": "Ando T."
                    },
                    {
                        "name": "Kitahara G."
                    },
                    {
                        "name": "Koiwa M."
                    },
                    {
                        "name": "Kubota C."
                    },
                    {
                        "name": "Miura N."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "FEBS Journal",
                "title": "Bovine milk transcriptome analysis reveals microRNAs and RNU2 involved in mastitis"
            },
            "pmid": "31663680"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}