{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:20:28Z",
    "biotoolsCURIE": "biotools:Gigwa",
    "biotoolsID": "Gigwa",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guilhem.sempere@cirad.fr",
            "name": "Guilhem Sempéré",
            "orcidid": "https://orcid.org/0000-0001-7429-2091",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "gigwa@cirad.fr",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Gigwa application, which stands for “Genotype Investigator for Genome-Wide Analyses”, provides an easy and intuitive way to explore large amounts of genotyping data by filtering it not only on the basis of variant features, including functional annotations, but also matching genotype patterns. It is a fairly lightweight, web-based, platform-independent solution that may be deployed on a workstation or as a data portal. It allows to feed a MongoDB database with VCF, PLINK or HapMap files containing up to tens of billions of genotypes, and provides a user-friendly interface to filter data in real time. Gigwa provides the means to export filtered data into several popular formats and features connectivity not only with online genomic tools, but also with standalone software such as FlapJack or IGV. Additionnally, Gigwa-hosted datasets are interoperable via two standard REST APIs: GA4GH and BrAPI.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://gigwa.southgreen.fr/gigwa/docs/gigwa_docs.html"
        }
    ],
    "download": [
        {
            "note": "Easy install via bundles provided for Ubuntu, Windows and OSX",
            "type": "Downloads page",
            "url": "https://www.southgreen.fr/content/gigwa",
            "version": "2.2"
        }
    ],
    "editPermission": {
        "authors": [
            "mrouard"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://www.southgreen.fr/content/gigwa",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-09-14T08:25:17Z",
    "license": "AGPL-3.0",
    "link": [
        {
            "note": "Live service",
            "type": [
                "Other"
            ],
            "url": "https://gigwa.southgreen.fr/gigwa/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SouthGreenPlatform/Gigwa2"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/SouthGreenPlatform/Gigwa2/issues"
        }
    ],
    "maturity": "Mature",
    "name": "Gigwa",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "guilhems",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ051",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Background: The study of genetic variations is the basis of many research domains in biology. From genome structure to population dynamics, many applications involve the use of genetic variants. The advent of next-generation sequencing technologies led to such a flood of data that the daily work of scientists is often more focused on data management than data analysis. This mass of genotyping data poses several computational challenges in terms of storage, search, sharing, analysis, and visualization. While existing tools try to solve these challenges, few of them offer a comprehensive and scalable solution. Results: Gigwa v2 is an easy-to-use, species-agnostic web application for managing and exploring high-density genotyping data. It can handle multiple databases and may be installed on a local computer or deployed as an online data portal. It supports various standard import and export formats, provides advanced filtering options, and offers means to visualize density charts or push selected data into various stand-alone or online tools. It implements 2 standard RESTful application programming interfaces, GA4GH, which is health-oriented, and BrAPI, which is breeding-oriented, thus offering wide possibilities of interaction with third-party applications. The project home page provides a list of live instances allowing users to test the system on public data (or reasonably sized user-provided data). Conclusions: This new version of Gigwa provides a more intuitive and more powerful way to explore large amounts of genotyping data by offering a scalable solution to search for genotype patterns, functional annotations, or more complex filtering. Furthermore, its user-friendliness and interoperability make it widely accessible to the life science community.",
                "authors": [
                    {
                        "name": "Sempere G."
                    },
                    {
                        "name": "Petel A."
                    },
                    {
                        "name": "Rouard M."
                    },
                    {
                        "name": "Frouin J."
                    },
                    {
                        "name": "Hueber Y."
                    },
                    {
                        "name": "De Bellis F."
                    },
                    {
                        "name": "Larmande P."
                    }
                ],
                "citationCount": 6,
                "date": "2019-05-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Gigwa v2—Extended and improved genotype investigator"
            },
            "pmcid": "PMC6511067",
            "pmid": "31077313",
            "type": [
                "Primary"
            ],
            "version": "2"
        },
        {
            "doi": "10.1186/s13742-016-0131-8",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Exploring the structure of genomes and analyzing their evolution is essential to understanding the ecological adaptation of organisms. However, with the large amounts of data being produced by next-generation sequencing, computational challenges arise in terms of storage, search, sharing, analysis and visualization. This is particularly true with regards to studies of genomic variation, which are currently lacking scalable and user-friendly data exploration solutions. Description: Here we present Gigwa, a web-based tool that provides an easy and intuitive way to explore large amounts of genotyping data by filtering it not only on the basis of variant features, including functional annotations, but also on genotype patterns. The data storage relies on MongoDB, which offers good scalability properties. Gigwa can handle multiple databases and may be deployed in either single- or multi-user mode. In addition, it provides a wide range of popular export formats. Conclusions: The Gigwa application is suitable for managing large amounts of genomic variation data. Its user-friendly web interface makes such processing widely accessible. It can either be simply deployed on a workstation or be used to provide a shared data portal for a given community of researchers.",
                "authors": [
                    {
                        "name": "Sempere G."
                    },
                    {
                        "name": "Philippe F."
                    },
                    {
                        "name": "Dereeper A."
                    },
                    {
                        "name": "Ruiz M."
                    },
                    {
                        "name": "Sarah G."
                    },
                    {
                        "name": "Larmande P."
                    }
                ],
                "citationCount": 14,
                "date": "2016-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Gigwa-Genotype investigator for genomewide analyses"
            },
            "pmcid": "PMC4897896",
            "pmid": "27267926",
            "type": [
                "Primary"
            ],
            "version": "1"
        }
    ],
    "relation": [
        {
            "biotoolsID": "southgreen",
            "type": "includedIn"
        },
        {
            "biotoolsID": "south_green_genome_hubs",
            "type": "usedBy"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "2.3"
    ]
}