{
    "accessibility": "Open access",
    "additionDate": "2022-03-11T15:44:40.471192Z",
    "biotoolsCURIE": "biotools:metabolizer",
    "biotoolsID": "metabolizer",
    "collectionID": [
        "pathway or network visualisation"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "joaquin.dopazo@juntadeandalucia.es",
            "name": "Joaquin Dopazo",
            "orcidid": "https://orcid.org/0000-0003-3318-120X",
            "url": "https://www.clinbioinfosspa.es/"
        }
    ],
    "description": "Metabolizer is a web tool for analysis of modular architecture of metabolic pathways using transcriptomic data. Metabolizer calculates impact of modules on production of metabolites. These modules are conserved part of metabolism which starts with substrate(s) and ends with a product.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://metabolizer.babelomics.org/doc/doku.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Spain"
    ],
    "homepage": "http://metabolizer.babelomics.org/",
    "language": [
        "JavaScript",
        "R",
        "SQL"
    ],
    "lastUpdate": "2022-03-14T12:13:18.866201Z",
    "maturity": "Mature",
    "name": "Metabolizer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "kinza",
    "publication": [
        {
            "doi": "10.1038/s41540-019-0087-2",
            "metadata": {
                "abstract": "© 2019, The Author(s).In spite of the increasing availability of genomic and transcriptomic data, there is still a gap between the detection of perturbations in gene expression and the understanding of their contribution to the molecular mechanisms that ultimately account for the phenotype studied. Alterations in the metabolism are behind the initiation and progression of many diseases, including cancer. The wealth of available knowledge on metabolic processes can therefore be used to derive mechanistic models that link gene expression perturbations to changes in metabolic activity that provide relevant clues on molecular mechanisms of disease and drug modes of action (MoA). In particular, pathway modules, which recapitulate the main aspects of metabolism, are especially suitable for this type of modeling. We present Metabolizer, a web-based application that offers an intuitive, easy-to-use interactive interface to analyze differences in pathway metabolic module activities that can also be used for class prediction and in silico prediction of knock-out (KO) effects. Moreover, Metabolizer can automatically predict the optimal KO intervention for restoring a diseased phenotype. We provide different types of validations of some of the predictions made by Metabolizer. Metabolizer is a web tool that allows understanding molecular mechanisms of disease or the MoA of drugs within the context of the metabolism by using gene expression measurements. In addition, this tool automatically suggests potential therapeutic targets for individualized therapeutic interventions.",
                "authors": [
                    {
                        "name": "Amadoz A."
                    },
                    {
                        "name": "Carbonell-Caballero J."
                    },
                    {
                        "name": "Cubuk C."
                    },
                    {
                        "name": "Dopazo J."
                    },
                    {
                        "name": "Herranz C."
                    },
                    {
                        "name": "Hidalgo M.R."
                    },
                    {
                        "name": "Mateo F."
                    },
                    {
                        "name": "Pujana M.A."
                    },
                    {
                        "name": "Rian K."
                    },
                    {
                        "name": "Salavert F."
                    }
                ],
                "citationCount": 15,
                "date": "2019-12-01T00:00:00Z",
                "journal": "npj Systems Biology and Applications",
                "title": "Differential metabolic activity and discovery of therapeutic targets using summarized metabolic pathway models"
            },
            "pmcid": "PMC6397295",
            "pmid": "30854222"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "version": [
        "1.7.0"
    ]
}
