
{
    "credit": [
        {
            "email": "jvillasenor@bren.ucsb.edu",
            "name": "Juan Carlos Villaseñor-Derbez",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/turfeffect/MAREA/blob/master/README.md"
        },
        {
            "type": "Other",
            "url": "https://www.researchgate.net/publication/317840581_A_guide_to_evaluate_the_effectiveness_of_no-take_marine_reserves_in_Mexico"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Marine biology",
                "uri": "http://edamontology.org/topic_3387"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 Villaseñor-Derbez et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Marine reserves are implemented to achieve a variety of objectives, but are seldom rigorously evaluated to determine whether those objectives are met. In the rare cases when evaluations do take place, they typically focus on ecological indicators and ignore other relevant objectives such as socioeconomics and governance. And regardless of the objectives, the diversity of locations, monitoring protocols, and analysis approaches hinder the ability to compare results across case studies. Moreover, analysis and evaluation of reserves is generally conducted by outside researchers, not the reserve managers or users, plausibly thereby hindering effective local management and rapid response to change. We present a framework and tool, called “MAREA”, to overcome these challenges. Its purpose is to evaluate the extent to which any given reserve has achieved its stated objectives. MAREA provides specific guidance on data collection and formatting, and then conducts rigorous causal inference analysis based on data input by the user, providing real-time outputs about the effectiveness of the reserve. MAREA’s ease of use, standardization of state-of-the-art inference methods, and ability to analyze marine reserve effectiveness across ecological, socioeconomic, and governance objectives could dramatically further our understanding and support of effective marine reserve management.",
            "authors": [
                "Villasenor-Derbez J.C.",
                "Faro C.",
                "Wright M.",
                "Martinez J.",
                "Fitzgerald S.",
                "Fulton S.",
                "del Mar Mancha-Cisneros M.",
                "McDonald G.",
                "Micheli F.",
                "Suarez A.",
                "Torre J.",
                "Costello C."
            ],
            "cit_count": 0,
            "doi": "10.1371/journal.pone.0191821",
            "journal": "PLoS ONE",
            "title": "A user-friendly tool to evaluate the effectiveness of no-take marine reserves",
            "type": "Primary",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:marea",
        "biotoolsID": "marea",
        "description": "Tool to evaluate the effectiveness of no-take marine reserves.",
        "homepage": "https://github.com/turfeffect/MAREA",
        "name": "MAREA"
    }
}