
{
    "credit": [
        {
            "email": "louca@zoology.ubc.ca",
            "name": "Stilianos Louca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://cran.r-project.org/web/packages/castor/castor.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "CRAN"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation Biodiversity databases now comprise hundreds of thousands of sequences and trait records. For example, the Open Tree of Life includes over 1 491 000 metazoan and over 300 000 bacterial taxa. These data provide unique opportunities for analysis of phylogenetic trait distribution and reconstruction of ancestral biodiversity. However, existing tools for comparative phylogenetics scale poorly to such large trees, to the point of being almost unusable. Results Here we present a new R package, named'castor', for comparative phylogenetics on large trees comprising millions of tips. On large trees castor is often 100-1000 times faster than existing tools. Availability and implementation The castor source code, compiled binaries, documentation and usage examples are freely available at the Comprehensive R Archive Network (CRAN). Contact louca.research@gmail.com Supplementary informationSupplementary dataare available at Bioinformatics online.",
            "authors": [
                "Louca S.",
                "Doebeli M."
            ],
            "cit_count": 4,
            "doi": "10.1093/bioinformatics/btx701",
            "journal": "Bioinformatics",
            "title": "Efficient comparative phylogenetics on large trees",
            "year": "2018-03-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:castor",
        "biotoolsID": "castor",
        "description": "Efficient tree manipulations for large phylogenies, including pruning, rerooting, calculation of most-recent common ancestors, calculating distances from the tree root and calculating pairwise distances. Calculation of phylogenetic signal and mean trait depth (trait conservatism), ancestral state reconstruction and hidden character prediction of discrete characters.",
        "homepage": "https://cran.r-project.org/web/packages/castor/index.html",
        "name": "castor",
        "version": [
            "1.3.3"
        ]
    }
}