{
    "accessibility": "Open access",
    "additionDate": "2022-10-11T20:52:48.193090Z",
    "biotoolsCURIE": "biotools:mobileog-db",
    "biotoolsID": "mobileog-db",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Liqing Zhang"
        },
        {
            "name": "Amy Pruden",
            "orcidid": "https://orcid.org/0000-0002-3191-6244"
        },
        {
            "name": "Connor L. Brown",
            "orcidid": "https://orcid.org/0000-0001-5171-0211"
        }
    ],
    "description": "A Manually Curated Database of Protein Families Mediating the Life Cycle of Bacterial Mobile Genetic Elements.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://fralinlifesci.vt.edu/content/dam/fralinlifesci_vt_edu/ciwars/mobileOG-db_UserGuidance_v1.6.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "priyagill123"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Plasmid map drawing",
                    "uri": "http://edamontology.org/operation_0578"
                },
                {
                    "term": "Transposon prediction",
                    "uri": "http://edamontology.org/operation_0427"
                }
            ]
        }
    ],
    "homepage": "http://mobileogdb.flsi.cloud.vt.edu/",
    "lastUpdate": "2024-11-24T15:17:24.224670Z",
    "name": "mobileOG-db",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1128/aem.00991-22",
            "metadata": {
                "abstract": "Bacterial mobile genetic elements (MGEs) encode functional modules that perform both core and accessory functions for the element, the latter of which are often only transiently associated with the element. The presence of these accessory genes, which are often close homologs to primarily immobile genes, incur high rates of false positives and, therefore, limits the usability of these databases for MGE annotation. To overcome this limitation, we analyzed 10,776,849 protein sequences derived from eight MGE databases to compile a comprehensive set of 6,140 manually curated protein families that are linked to the “life cycle” (integration/excision, replication/recombination/repair, transfer, stability/transfer/defense, and phage-specific processes) of plasmids, phages, integrative, transposable, and conjugative elements. We overlay experimental information where available to create a tiered annotation scheme of high-quality annotations and annotations inferred exclusively through bioinformatic evidence. We additionally provide an MGE-class label for each entry (e.g., plasmid or integrative element), and assign to each entry a major and minor category. The resulting database, mobileOG-db (for mobile orthologous groups), comprises over 700,000 deduplicated sequences encompassing five major mobileOG categories and more than 50 minor categories, providing a structured language and interpretable basis for an array of MGE-centered analyses. mobileOG-db can be accessed at mobileogdb.flsi.cloud.vt.edu/, where users can select, refine, and analyze custom subsets of the dynamic mobilome. IMPORTANCE The analysis of bacterial mobile genetic elements (MGEs) in genomic data is a critical step toward profiling the root causes of antibiotic resistance, phenotypic or metabolic diversity, and the evolution of bacterial genera. Existing methods for MGE annotation pose high barriers of biological and computational expertise to properly harness. To bridge this gap, we systematically analyzed 10,776,849 proteins derived from eight databases of MGEs to identify 6,140 MGE protein families that can serve as candidate hallmarks, i.e., proteins that can be used as “signatures” of MGEs to aid annotation. The resulting resource, mobileOG-db, provides a multilevel classification scheme that encompasses plasmid, phage, integrative, and transposable element protein families categorized into five major mobileOG categories and more than 50 minor categories. mobileOG-db thus provides a rich resource for simple and intuitive element annotation that can be integrated seamlessly into existing MGE detection pipelines and colocalization analyses.",
                "authors": [
                    {
                        "name": "Brown C.L."
                    },
                    {
                        "name": "Choi M."
                    },
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Hindi F."
                    },
                    {
                        "name": "Keenum I."
                    },
                    {
                        "name": "Mullet J."
                    },
                    {
                        "name": "Pruden A."
                    },
                    {
                        "name": "Stoll J.E."
                    },
                    {
                        "name": "Vikesland P."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 110,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Applied and Environmental Microbiology",
                "title": "mobileOG-db: a Manually Curated Database of Protein Families Mediating the Life Cycle of Bacterial Mobile Genetic Elements"
            },
            "pmcid": "PMC9499024",
            "pmid": "36036594"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1
}
