{
    "name": "AspWood", 
    "description": "Whole-genome annotation and functional analyses based on RNA expression data.", 
    "homepage": "http://aspwood.popgenie.org/aspwood-v3.0/", 
    "biotoolsID": "AspWood", 
    "biotoolsCURIE": "biotools:AspWood", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3501", 
                    "term": "Enrichment analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0780", 
            "term": "Plant biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0152", 
            "term": "Carbohydrates"
        }, 
        {
            "uri": "http://edamontology.org/topic_3172", 
            "term": "Metabolomics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": "Unlicense", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1111/TPJ.14417", 
            "pmid": "31111606", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Poplar carbohydrate-active enzymes: whole-genome annotation and functional analyses based on RNA expression data", 
                "abstract": "© 2019 The Authors. The Plant Journal published by Society for Experimental Biology and John Wiley & Sons LtdCarbohydrate-active enzymes (CAZymes) catalyze the formation and modification of glycoproteins, glycolipids, starch, secondary metabolites and cell wall biopolymers. They are key enzymes for the biosynthesis of food and renewable biomass. Woody biomass is particularly important for long-term carbon storage and as an abundant renewable natural resource for many industrial applications. This study presents a re-annotation of CAZyme genes in the current Populus trichocarpa genome assembly and in silico functional characterization, based on high-resolution RNA-Seq data sets. Altogether, 1914 CAZyme and expansin genes were annotated in 101 families. About 1797 of these genes were found expressed in at least one Populus organ. We identified genes involved in the biosynthesis of different cell wall polymers and their paralogs. Whereas similar families exist in poplar and Arabidopsis thaliana (with the exception of CBM13 found only in poplar), a few families had significantly different copy numbers between the two species. To identify the transcriptional coordination and functional relatedness within the CAZymes and other proteins, we performed co-expression network analysis of CAZymes in wood-forming tissues using the AspWood database (http://aspwood.popgenie.org/aspwood-v3.0/) for Populus tremula. This provided an overview of the transcriptional changes in CAZymes during the transition from primary to secondary wall formation, and the clustering of transcripts into potential regulons. Candidate enzymes involved in the biosynthesis of polysaccharides were identified along with many tissue-specific uncharacterized genes and transcription factors. These collections offer a rich source of targets for the modification of secondary cell wall biosynthesis and other developmental processes in woody plants.", 
                "date": "2019-01-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Kumar V."
                    }, 
                    {
                        "name": "Hainaut M."
                    }, 
                    {
                        "name": "Delhomme N."
                    }, 
                    {
                        "name": "Mannapperuma C."
                    }, 
                    {
                        "name": "Immerzeel P."
                    }, 
                    {
                        "name": "Street N.R."
                    }, 
                    {
                        "name": "Henrissat B."
                    }, 
                    {
                        "name": "Mellerowicz E.J."
                    }
                ], 
                "journal": "Plant Journal"
            }
        }
    ], 
    "credit": [
        {
            "name": "Ewa Mellerowicz", 
            "email": "ewa.mellerowicz@slu.se", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "hans", 
    "additionDate": "2019-08-09T13:16:04Z", 
    "lastUpdate": "2019-10-31T11:44:14Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}