{
    "additionDate": "2020-01-14T09:12:36Z",
    "biotoolsCURIE": "biotools:AFND",
    "biotoolsID": "AFND",
    "confidence_flag": "tool",
    "description": "The Allele Frequency Net Database (AFND) provides the scientific community with a freely available repository for the storage of frequency data (alleles, genes, haplotypes and genotypes) related to human leukocyte antigens (HLA), killer-cell immunoglobulin-like receptors (KIR), major histocompatibility complex Class I chain related genes (MIC) and a number of cytokine gene polymorphisms in worldwide populations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.allelefrequencies.net/",
    "lastUpdate": "2021-01-14T15:11:46Z",
    "name": "The Allele Frequency Net Database (AFND)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1029",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.The Allele Frequency Net Database (AFND, www.allelefrequencies.net) provides the scientific community with a freely available repository for the storage of frequency data (alleles, genes, haplotypes and genotypes) related to human leukocyte antigens (HLA), killer-cell immunoglobulin-like receptors (KIR), major histocompatibility complex Class I chain related genes (MIC) and a number of cytokine gene polymorphisms in worldwide populations. In the last five years, AFND has become more popular in terms of clinical and scientific usage, with a recent increase in genotyping data as a necessary component of Short Population Report article submissions to another scientific journal. In addition, we have developed a user-friendly desktop application for HLA and KIR genotype/population data submissions. We have also focused on classification of existing and new data into 'gold-silver-bronze' criteria, allowing users to filter and query depending on their needs. Moreover, we have also continued to expand other features, for example focussed on HLA associations with adverse drug reactions. At present, AFND contains >1600 populations from >10 million healthy individuals, making AFND a valuable resource for the analysis of some of the most polymorphic regions in the human genome.",
                "authors": [
                    {
                        "name": "Gonzalez-Galarza F.F."
                    },
                    {
                        "name": "McCabe A."
                    },
                    {
                        "name": "Santos E.J.M.D."
                    },
                    {
                        "name": "Jones J."
                    },
                    {
                        "name": "Takeshita L."
                    },
                    {
                        "name": "Ortega-Rivera N.D."
                    },
                    {
                        "name": "Cid-Pavon G.M.D."
                    },
                    {
                        "name": "Ramsbottom K."
                    },
                    {
                        "name": "Ghattaoraya G."
                    },
                    {
                        "name": "Alfirevic A."
                    },
                    {
                        "name": "Middleton D."
                    },
                    {
                        "name": "Jones A.R."
                    }
                ],
                "citationCount": 97,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Allele frequency net database (AFND) 2020 update: Gold-standard data classification, open access genotype data and new query tools"
            },
            "pmid": "31722398"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}