{
    "additionDate": "2017-08-03T18:55:47Z",
    "biotoolsCURIE": "biotools:phylo-mlogo",
    "biotoolsID": "phylo-mlogo",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.iis.sinica.edu.tw/~arthur/people_PI.htm"
        }
    ],
    "description": "Interactive multiple-logo visualization tool for large-number sequence alignments which allows the user to visualize the global profile of whole multiple sequence alignment and to hierarchically visualize homologous logos of each clade simultaneously.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cg1.iis.sinica.edu.tw/new/phylomlogo/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://cg1.iis.sinica.edu.tw/new/phylomlogo/",
    "homepage_status": 1,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phylo-mlogo-2-3-large-number-alignment-visualization-tool.html"
        }
    ],
    "name": "Phylo-mLogo",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: When aligning several hundreds or thousands of sequences, such as epidemic virus sequences or homologous/orthologous sequences of some big gene families, to reconstruct the epidemiological history or their phylogenies, how to analyze and visualize the alignment results of many sequences has become a new challenge for computational biologists. Although there are several tools available for visualization of very long sequence alignments, few of them are applicable to the alignments of many sequences. Results: A multiple-logo alignment visualization tool, called Phylo-mLogo, is presented in this paper. Phylo-mLogo calculates the variabilities and homogeneities of alignment sequences by base frequencies or entropies. Different from the traditional representations of sequence logos, Phylo-mLogo not only displays the global logo patterns of the whole alignment of multiple sequences, but also demonstrates their local homologous logos for each clade hierarchically. In addition, Phylo-mLogo also allows the user to focus only on the analysis of some important, structurally or functionally constrained sites in the alignment selected by the user or by built-in automatic calculation. Conclusion: With Phylo-mLogo, the user can symbolically and hierarchically visualize hundreds of aligned sequences simultaneously and easily check the changes of their amino acid sites when analyzing many homologous/orthologous or influenza virus sequences. More information of Phylo-mLogo can be found at URL http://biocomp.iis.sinica.edu.tw/phylomlogo. © 2007 Shih et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Shih A.C.-C."
                    },
                    {
                        "name": "Lee D.T."
                    },
                    {
                        "name": "Peng C.-L."
                    },
                    {
                        "name": "Wu Y.-W."
                    }
                ],
                "citationCount": 18,
                "date": "2007-03-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Phylo-mLogo: An interactive and hierarchical multiple-logo visualization tool for alignment of many sequences"
            },
            "pmid": "17319966"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}