{
    "additionDate": "2020-01-14T19:54:17Z",
    "biotoolsCURIE": "biotools:CNN-T4SE",
    "biotoolsID": "CNN-T4SE",
    "confidence_flag": "tool",
    "description": "Convolutional neural network-based annotation of bacterial type IV secretion system effectors with enhanced accuracy and reduced false discovery.\n\nCNN-based Annotation of Bacterial Type IV Secretion System Effectors.\n\nThe CNN-T4SE is a tool that can be run in windows and linux operating systems. It is used to identify effector proteins through the amino acid sequence, evolutionary information in the form of a position-specific scoring matrix, secondary structure and solvent accessibility information of the proteins.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://idrblab.org/cnnt4se/download/User_Manual_of_CNN-T4SE.pdf"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://idrblab.org/cnnt4se/",
    "lastUpdate": "2020-12-16T16:00:27Z",
    "name": "CNN-T4SE",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ120",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.The type IV bacterial secretion system (SS) is reported to be one of the most ubiquitous SSs in nature and can induce serious conditions by secreting type IV SS effectors (T4SEs) into the host cells. Recent studies mainly focus on annotating new T4SE from the huge amount of sequencing data, and various computational tools are therefore developed to accelerate T4SE annotation. However, these tools are reported as heavily dependent on the selected methods and their annotation performance need to be further enhanced. Herein, a convolution neural network (CNN) technique was used to annotate T4SEs by integrating multiple protein encoding strategies. First, the annotation accuracies of nine encoding strategies integrated with CNN were assessed and compared with that of the popular T4SE annotation tools based on independent benchmark. Second, false discovery rates of various models were systematically evaluated by (1) scanning the genome of Legionella pneumophila subsp. ATCC 33152 and (2) predicting the real-world non-T4SEs validated using published experiments. Based on the above analyses, the encoding strategies, (a) position-specific scoring matrix (PSSM), (b) protein secondary structure & solvent accessibility (PSSSA) and (c) one-hot encoding scheme (Onehot), were identified as well-performing when integrated with CNN. Finally, a novel strategy that collectively considers the three well-performing models (CNN-PSSM, CNN-PSSSA and CNN-Onehot) was proposed, and a new tool (CNN-T4SE, https://idrblab.org/cnnt4se/) was constructed to facilitate T4SE annotation. All in all, this study conducted a comprehensive analysis on the performance of a collection of encoding strategies when integrated with CNN, which could facilitate the suppression of T4SS in infection and limit the spread of antimicrobial resistance.",
                "authors": [
                    {
                        "name": "Hong J."
                    },
                    {
                        "name": "Luo Y."
                    },
                    {
                        "name": "Mou M."
                    },
                    {
                        "name": "Fu J."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Xue W."
                    },
                    {
                        "name": "Xie T."
                    },
                    {
                        "name": "Tao L."
                    },
                    {
                        "name": "Lou Y."
                    },
                    {
                        "name": "Zhu F."
                    }
                ],
                "citationCount": 16,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Convolutional neural network-based annotation of bacterial type IV secretion system effectors with enhanced accuracy and reduced false discovery"
            },
            "pmid": "31860715"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}