{
    "additionDate": "2017-08-03T19:06:41Z",
    "biotoolsCURIE": "biotools:lncrnator",
    "biotoolsID": "lncrnator",
    "credit": [
        {
            "email": "ercsb@ewha.ac.kr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ercsb.ewha.ac.kr/glter/wiki/Overview"
        }
    ],
    "description": "This tool aims to be the lncRNA (long non-coding RNA) portal encompassing expression profile, interacting (binding) protein, integrated sequence curation, evolutionary scores, and coding potential. Data sets were collected from TCGA, GEO, ENCODE, and modENCODE (Organism: Human, Mouse, Fly, Worm, and Yeast).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lncrnator.ewha.ac.kr/help.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://lncrnator.ewha.ac.kr/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/lncrnator-functional-investigation-of-long-noncoding-rnas.html"
        }
    ],
    "name": "lncRNAtor",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: A number of long non-coding RNAs (lncRNAs) have been identified by deep sequencing methods, but their molecular and cellular functions are known only for a limited number of lncRNAs. Current databases on lncRNAs are mostly for cataloging purpose without providing in-depth information required to infer functions. A comprehensive resource on lncRNA function is an immediate need. Results: We present a database for functional investigation of lncRNAs that encompasses annotation, sequence analysis, gene expression, protein binding and phylogenetic conservation. We have compiled lncRNAs for six species (human, mouse, zebrafish, fruit fly, worm and yeast) from ENSEMBL, HGNC, MGI and lncRNAdb. Each lncRNA was analyzed for coding potential and phylogenetic conservation in different lineages. Gene expression data of 208 RNA-Seq studies (4995 samples), collected from GEO, ENCODE, modENCODE and TCGA databases, were used to provide expression profiles in various tissues, diseases and developmental stages. Importantly, we analyzed RNA-Seq data to identify coexpressed mRNAs that would provide ample insights on lncRNA functions. The resulting gene list can be subject to enrichment analysis such as Gene Ontology or KEGG pathways. Furthermore, we compiled protein-lncRNA interactions by collecting and analyzing publicly available CLIP-seq or PAR-CLIP sequencing data. Finally, we explored evolutionarily conserved lncRNAs with correlated expression between human and six other organisms to identify functional lncRNAs. The whole contents are provided in a user-friendly web interface. © The Author 2014. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Park C."
                    },
                    {
                        "name": "Yu N."
                    },
                    {
                        "name": "Choi I."
                    },
                    {
                        "name": "Kim W."
                    },
                    {
                        "name": "Lee S."
                    }
                ],
                "citationCount": 62,
                "date": "2014-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LncRNAtor: A comprehensive resource for functional investigation of long non-coding RNAs"
            },
            "pmid": "24813212"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}