{
    "name": "MultiPhen", 
    "description": "Performs genetic association tests between SNPs (one-at-a-time) and multiple phenotypes (separately or in joint model)", 
    "homepage": "https://cran.r-project.org/web/packages/MultiPhen/index.html", 
    "biotoolsID": "MultiPhen", 
    "biotoolsCURIE": "biotools:MultiPhen", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction and recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "DNA polymorphism"
        }, 
        {
            "uri": "http://edamontology.org/topic_0625", 
            "term": "Genotype and phenotype"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/multiphen-0-3-genetic-association-testing-multiple-phenotypes.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://cran.r-project.org/web/packages/MultiPhen/MultiPhen.pdf", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "22567092", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MultiPhen: Joint model of multiple phenotypes can increase discovery in GWAS", 
                "abstract": "The genome-wide association study (GWAS) approach has discovered hundreds of genetic variants associated with diseases and quantitative traits. However, despite clinical overlap and statistical correlation between many phenotypes, GWAS are generally performed one-phenotype-at-a-time. Here we compare the performance of modelling multiple phenotypes jointly with that of the standard univariate approach. We introduce a new method and software, MultiPhen, that models multiple phenotypes simultaneously in a fast and interpretable way. By performing ordinal regression, MultiPhen tests the linear combination of phenotypes most associated with the genotypes at each SNP, and thus potentially captures effects hidden to single phenotype GWAS. We demonstrate via simulation that this approach provides a dramatic increase in power in many scenarios. There is a boost in power for variants that affect multiple phenotypes and for those that affect only one phenotype. While other multivariate methods have similar power gains, we describe several benefits of MultiPhen over these. In particular, we demonstrate that other multivariate methods that assume the genotypes are normally distributed, such as canonical correlation analysis (CCA) and MANOVA, can have highly inflated type-1 error rates when testing case-control or non-normal continuous phenotypes, while MultiPhen produces no such inflation. To test the performance of MultiPhen on real data we applied it to lipid traits in the Northern Finland Birth Cohort 1966 (NFBC1966). In these data MultiPhen discovers 21% more independent SNPs with known associations than the standard univariate GWAS approach, while applying MultiPhen in addition to the standard approach provides 37% increased discovery. The most associated linear combinations of the lipids estimated by MultiPhen at the leading SNPs accurately reflect the Friedewald Formula, suggesting that MultiPhen could be used to refine the definition of existing phenotypes or uncover novel heritable phenotypes. © 2012 O'Reilly et al.", 
                "date": "2012-05-02T00:00:00Z", 
                "citationCount": 133, 
                "authors": [
                    {
                        "name": "O'Reilly P.F."
                    }, 
                    {
                        "name": "Hoggart C.J."
                    }, 
                    {
                        "name": "Pomyen Y."
                    }, 
                    {
                        "name": "Calboli F.C.F."
                    }, 
                    {
                        "name": "Elliott P."
                    }, 
                    {
                        "name": "Jarvelin M.-R."
                    }, 
                    {
                        "name": "Coin L.J.M."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Lachlan Coin", 
            "email": "l.coin@imb.uq.edu.au", 
            "url": "http://www.imperial.ac.uk/people/l.coin", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:52:02Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}