{
    "additionDate": "2020-01-14T09:22:51Z",
    "biotoolsCURIE": "biotools:PreSNO",
    "biotoolsID": "PreSNO",
    "confidence_flag": "tool",
    "description": "Prediction of S-nitrosylation sites by integrating support vector machines and random forest.\n\nPreSNO is only available to academic users",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://kurata14.bio.kyutech.ac.jp/PreSNO/",
    "lastUpdate": "2020-12-06T10:12:08.753984Z",
    "name": "PreSNO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1039/C9MO00098D",
            "metadata": {
                "abstract": "© 2019 The Royal Society of Chemistry.Cysteine S-nitrosylation is a type of reversible post-translational modification of proteins, which controls diverse biological processes. It is associated with redox-based cellular signaling to protect against oxidative stress. The identification of S-nitrosylation sites is an important step to reveal the function of proteins; however, experimental identification of S-nitrosylation is expensive and time-consuming work. Hence, sequence-based computational prediction of potential S-nitrosylation sites is highly sought before experimentation. Herein, a novel predictor PreSNO has been developed that integrates multiple encoding schemes by the support vector machine and random forest algorithms. The PreSNO achieved an accuracy and Matthews correlation coefficient value of 0.752 and 0.252 respectively in classifying between SNO and non-SNO sites when evaluated on the independent dataset, outperforming the existing methods. The web application of the PreSNO and its associated datasets are freely available at http://kurata14.bio.kyutech.ac.jp/PreSNO/.",
                "authors": [
                    {
                        "name": "Hasan M.M."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Khatun M.S."
                    },
                    {
                        "name": "Kurata H."
                    }
                ],
                "citationCount": 12,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Omics",
                "title": "Prediction of: S -nitrosylation sites by integrating support vector machines and random forest"
            },
            "pmid": "31710075"
        }
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}