{
    "additionDate": "2018-08-17T18:41:42Z",
    "biotoolsCURIE": "biotools:sybil-metabolic",
    "biotoolsID": "sybil-metabolic",
    "credit": [
        {
            "email": "mayo.roettger@hhu.de",
            "name": "Mayo Roettger",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Implements algorithms for constraint based analyses of metabolic networks, e.g. flux-balance analysis (FBA), minimization of metabolic adjustment (MOMA), regulatory on/off minimization (ROOM), robustness analysis and flux variability analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/sybil/sybil.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service invocation",
                    "uri": "http://edamontology.org/operation_3763"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/sybil/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:29:00.774361Z",
    "license": "GPL-3.0",
    "name": "sybil",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-7-125",
            "metadata": {
                "abstract": "Background: Constraint-based analyses of metabolic networks are widely used to simulate the properties of genome-scale metabolic networks. Publicly available implementations tend to be slow, impeding large scale analyses such as the genome-wide computation of pairwise gene knock-outs, or the automated search for model improvements. Furthermore, available implementations cannot easily be extended or adapted by users.Results: Here, we present sybil, an open source software library for constraint-based analyses in R; R is a free, platform-independent environment for statistical computing and graphics that is widely used in bioinformatics. Among other functions, sybil currently provides efficient methods for flux-balance analysis (FBA), MOMA, and ROOM that are about ten times faster than previous implementations when calculating the effect of whole-genome single gene deletions in silico on a complete E. coli metabolic model.Conclusions: Due to the object-oriented architecture of sybil, users can easily build analysis pipelines in R or even implement their own constraint-based algorithms. Based on its highly efficient communication with different mathematical optimisation programs, sybil facilitates the exploration of high-dimensional optimisation problems on small time scales. Sybil and all its dependencies are open source. Sybil and its documentation are available for download from the comprehensive R archive network (CRAN). © 2013 Gelius-Dietrich et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Desouki A.A."
                    },
                    {
                        "name": "Fritzemeier C.J."
                    },
                    {
                        "name": "Gelius-Dietrich G."
                    },
                    {
                        "name": "Lercher M.J."
                    }
                ],
                "citationCount": 89,
                "date": "2013-11-13T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "Sybil - Efficient constraint-based modelling in R"
            },
            "pmcid": "PMC3843580",
            "pmid": "24224957"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
