{
    "accessibility": "Open access",
    "additionDate": "2019-05-22T08:47:42Z",
    "biotoolsCURIE": "biotools:PASCCA",
    "biotoolsID": "PASCCA",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "573355254@qq.com",
            "name": "Yuqi Long",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "nikou123456@163.com",
            "name": "Wenbin Ye",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for analyses of alternative polyadenylation (APA) related gene expression, including the characterization of poly(A) sites, quantification of association between genes with/without repeated measurements, clustering of APA-related genes to infer significant APA specific gene modules, and the evaluation of clustering performance with a variety of indexes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BMILAB/PASCCA/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BMILAB/PASCCA",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/BMILAB/PASCCA/issues"
        }
    ],
    "maturity": "Mature",
    "name": "PASCCA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12864-019-5433-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Alternative polyadenylation (APA) has emerged as a pervasive mechanism that contributes to the transcriptome complexity and dynamics of gene regulation. The current tsunami of whole genome poly(A) site data from various conditions generated by 3′ end sequencing provides a valuable data source for the study of APA-related gene expression. Cluster analysis is a powerful technique for investigating the association structure among genes, however, conventional gene clustering methods are not suitable for APA-related data as they fail to consider the information of poly(A) sites (e.g., location, abundance, number, etc.) within each gene or measure the association among poly(A) sites between two genes. Results: Here we proposed a computational framework, named PASCCA, for clustering genes from replicated or unreplicated poly(A) site data using canonical correlation analysis (CCA). PASCCA incorporates multiple layers of gene expression data from both the poly(A) site level and gene level and takes into account the number of replicates and the variability within each experimental group. Moreover, PASCCA characterizes poly(A) sites in various ways including the abundance and relative usage, which can exploit the advantages of 3′ end deep sequencing in quantifying APA sites. Using both real and synthetic poly(A) site data sets, the cluster analysis demonstrates that PASCCA outperforms other widely-used distance measures under five performance metrics including connectivity, the Dunn index, average distance, average distance between means, and the biological homogeneity index. We also used PASCCA to infer APA-specific gene modules from recently published poly(A) site data of rice and discovered some distinct functional gene modules. We have made PASCCA an easy-to-use R package for APA-related gene expression analyses, including the characterization of poly(A) sites, quantification of association between genes, and clustering of genes. Conclusions: By providing a better treatment of the noise inherent in repeated measurements and taking into account multiple layers of poly(A) site data, PASCCA could be a general tool for clustering and analyzing APA-specific gene expression data. PASCCA could be used to elucidate the dynamic interplay of genes and their APA sites among various biological conditions from emerging 3′ end sequencing data to address the complex biological phenomenon.",
                "authors": [
                    {
                        "name": "Ye W."
                    },
                    {
                        "name": "Long Y."
                    },
                    {
                        "name": "Ji G."
                    },
                    {
                        "name": "Su Y."
                    },
                    {
                        "name": "Ye P."
                    },
                    {
                        "name": "Fu H."
                    },
                    {
                        "name": "Wu X."
                    }
                ],
                "date": "2019-01-22T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Cluster analysis of replicated alternative polyadenylation data using canonical correlation analysis"
            },
            "pmcid": "PMC6343338",
            "pmid": "30669970",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1,
    "version": [
        "0.1.0"
    ]
}