{
    "additionDate": "2017-12-18T00:15:43Z",
    "biotoolsCURIE": "biotools:targetedretrieval",
    "biotoolsID": "targetedretrieval",
    "credit": [
        {
            "email": "Elisabeth.Georgii@aalto.fi",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://users.ics.aalto.fi/georgii/"
        }
    ],
    "description": "targetedRetrieval is a model for the regulation of specific genes from a data repository and exploit it to construct a similarity metric for an information retrieval task.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://research.cs.aalto.fi/pml/software/rex12/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://research.ics.aalto.fi/mi/software/rex12/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/targetedretrieval-120705-targeted-retrieval-gene-expression-measurements-regulatory-models.html"
        }
    ],
    "name": "targetedRetrieval",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts361",
            "metadata": {
                "abstract": "Motivation: Large public repositories of gene expression measurements offer the opportunity to position a new experiment into the context of earlier studies. While previous methods rely on experimental annotation or global similarity of expression profiles across genes or gene sets, we compare experiments by measuring similarity based on an unsupervised, data-driven regulatory model around pre-specified genes of interest. Our experiment retrieval approach is novel in two conceptual respects: (i) targetable focus and interpretability: the analysis is targeted at regulatory relationships of genes that are relevant to the analyst or come from prior knowledge; (ii) regulatory model-based similarity measure: related experiments are retrieved based on the strength of inferred regulatory links between genes. Results: We learn a model for the regulation of specific genes from a data repository and exploit it to construct a similarity metric for an information retrieval task. We use the Fisher kernel, a rigorous similarity measure that typically has been applied to use generative models in discriminative classifiers. Results on human and plant microarray collections indicate that our method is able to substantially improve the retrieval of related experiments against standard methods. Furthermore, it allows the user to interpret biological conditions in terms of changes in link activity patterns. Our study of the osmotic stress network for Arabidopsis thaliana shows that the method successfully identifies relevant relationships around given key genes. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Brosche M."
                    },
                    {
                        "name": "Georgii E."
                    },
                    {
                        "name": "Kangasjarvi J."
                    },
                    {
                        "name": "Kaski S."
                    },
                    {
                        "name": "Salojarvi J."
                    }
                ],
                "citationCount": 17,
                "date": "2012-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Targeted retrieval of gene expression measurements using regulatory models"
            },
            "pmid": "22743225",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "120705"
    ]
}
