{
    "additionDate": "2018-08-09T10:43:34Z",
    "biotoolsCURIE": "biotools:tictrainer",
    "biotoolsID": "tictrainer",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://tictrainer.com/error/report.html"
        },
        {
            "email": "TicTrainer@theblacks.us",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tic suppression training meant to help you build your ability to fight tics. Implements a strategy called reward-enhanced exposure and response prevention (RE–ERP), focusing only on increasing the duration of time for which the user can suppress tics through automated differential reinforcement of tic-free periods (DRO).",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://tictrainer.com/howto.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://tictrainer.com",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jonkb/TicTrainer-node"
        }
    ],
    "name": "TicTrainer",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/f1000research.13460.2",
            "metadata": {
                "abstract": "© 2018 Black JK and Black KJ. Exposure and response prevention (ERP) is a first-line behavior therapy for obsessive-compulsive disorder and Tourette syndrome (TS). However, ERP for tic disorders requires intentional tic suppression, which for some patients is difficult even for brief periods. Additionally, practical access to behavior therapy is difficult for many patients, especially those in rural areas. The authors present a simple, working web platform (TicTrainer) that implements a strategy called reward-enhanced exposure and response prevention (RE–ERP). This strategy sacrifices most expert therapist components of ERP, focusing only on increasing the duration of time for which the user can suppress tics through automated differential reinforcement of tic-free periods (DRO). RE–ERP requires an external tic monitor, such as a parent, during training sessions. The user sees increasing digital rewards for longer and longer periods of successful tic suppression, similar to a video game score. TicTrainer is designed with security in mind, storing no personally identifiable health information, and has features to facilitate research, including optional masked comparison of tics during DRO vs. noncontingent reward conditions. A working instance of TicTrainer is available from https://tictrainer.com/.",
                "authors": [
                    {
                        "name": "Black J.K."
                    },
                    {
                        "name": "Black K.J."
                    }
                ],
                "citationCount": 1,
                "date": "2018-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Software for web-based tic suppression training [version 2; referees: 2 approved, 1 approved with reservations]"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Complementary medicine",
            "uri": "http://edamontology.org/topic_3423"
        }
    ],
    "validated": 1
}