
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.moseslab.csb.utoronto.ca/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.moseslab.csb.utoronto.ca/phylo_HMM/help.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/phylohmm-proteome-wide-discovery-evolutionary-conserved-sequences-disordered-regions.html"
        }
    ],
    "publication": [
        {
            "abstract": "At least 30% of human proteins are thought to contain intrinsically disordered regions, which lack stable structural conformation. Despite lacking enzymatic functions and having few protein domains, disordered regions are functionally important for protein regulation and contain short linear motifs (short peptide sequences involved in protein-protein interactions), but in most disordered regions, the functional amino acid residues remain unknown. We searched for evolutionarily conserved sequences within disordered regions according to the hypothesis that conservation would indicate functional residues. Using a phylogenetic hidden Markov model (phylo-HMM), we made accurate, specific predictions of functional elements in disordered regions even when these elements are only two or three amino acids long. Among the conserved sequences that we identified were previously known and newly identified short linear motifs, and we experimentally verified key examples, including a motif that may mediate interaction between protein kinase Cbk1 and its substrates.We also observed that hub proteins, which interact with many partners in a protein interaction network, are highly enriched in these conserved sequences. Our analysis enabled the systematic identification of the functional residues in disordered regions and suggested that at least 5% of amino acids in disordered regions are important for function.",
            "authors": [
                "Nguyen Ba A.N.",
                "Yeh B.J.",
                "Van Dyk D.",
                "Davidson A.R.",
                "Andrews B.J.",
                "Weiss E.L.",
                "Moses A.M."
            ],
            "cit_count": 69,
            "doi": "10.1126/scisignal.2002515",
            "journal": "Science Signaling",
            "title": "Proteome-wide discovery of evolutionary conserved sequences in disordered regions",
            "type": "Primary",
            "year": "2012-03-13"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phylohmm",
        "biotoolsID": "phylohmm",
        "description": "PhyloHMM (phylogenetic hidden Markov model) is a website with data, software and supporting materials for conserved sequences in disordered regions",
        "homepage": "http://www.moseslab.csb.utoronto.ca/phylo_HMM/",
        "name": "PhyloHMM",
        "version": [
            "v2"
        ]
    }
}