{
    "accessibility": "Open access",
    "additionDate": "2022-11-03T20:20:28.034504Z",
    "biotoolsCURIE": "biotools:psmpy",
    "biotoolsID": "psmpy",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Adrienne Kline"
        },
        {
            "name": "Yuan Luo"
        }
    ],
    "description": "A Package for Retrospective Cohort Matching in Python.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/psmpy/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:23:36.396826Z",
    "license": "MIT",
    "name": "PsmPy",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/embc48229.2022.9871333",
            "metadata": {
                "abstract": "Propensity score matching (PSM) is a technique used in retrospective investigation of cohort matching as an alternative approach to the prospective matching that is typically used by a randomized control trial (RCT). The process of selecting untreated cases that are the best match to the treated cases is the focus of this research. We created a PSM package for the python environment, termed PsmPy, to carry out this task. The PsmPy package debuted and proposed here is based on a logistic regression logit score where a match is selected using k-nearest neighbors (k-NN). Additional plotting and arguments are available to the user and are also described. To benchmark our method, we compared it with the existing R package, MatchIt, and evaluated our covariates' residual effect sizes with respect to the treatment condition before and after matching. Using a Mann-Whitney statistical test, we showed that our method significantly outperformed MatchIt in cohort matching (U=49, p<0.0001) when comparing residual effect sizes of the covariates. The PsmPy demonstrated a 10-fold average improvement in residual effect sizes amongst covariates when compared with the package MatchIt, suggesting that it is a viable alternative for use in propensity matching studies.",
                "authors": [
                    {
                        "name": "Kline A."
                    },
                    {
                        "name": "Luo Y."
                    }
                ],
                "citationCount": 35,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS",
                "title": "PsmPy: A Package for Retrospective Cohort Matching in Python"
            },
            "pmid": "36086543"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ],
    "validated": 1
}
