{
    "additionDate": "2019-11-14T19:47:07Z",
    "biotoolsCURIE": "biotools:nomogram",
    "biotoolsID": "nomogram",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hcmlr2002@163.com",
            "name": "Chang-Ming Huang",
            "orcidid": "https://orcid.org/0000-0002-0019-885X",
            "typeEntity": "Person"
        },
        {
            "email": "wwkzch@163.com",
            "name": "Chao-Hui Zheng",
            "typeEntity": "Person"
        }
    ],
    "description": "Dynamic prediction of long-term survival in patients with primary gastric diffuse large B-cell lymphoma | BACKGROUND:This study investigated a large number of patients to develop a predictive nomogram for survival and a web-based survival rate calculator that can dynamically predict the long-term survival of patients with primary gastric diffuse large B-cell lymphoma. METHODS:A total of 2647 patients diagnosed with primary gastric diffuse large B-cell lymphoma from 1998 to 2014 were extracted from the SEER database. We used the Lasso Cox regression model to identify independent risk factors for long-term survival and to develop a predictive nomogram for survival and a web-based survival rate calculator. RESULTS:The median (mean) follow-up time was 30 months (52.8 months). Cancer-specific survival rates decreased with time, while the 5-year conditional survival increased with time",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://linjuli1991.shinyapps.io/dynnomapp/",
    "lastUpdate": "2021-01-04T08:44:23Z",
    "name": "nomogram",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12885-019-5993-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: This study investigated a large number of patients to develop a predictive nomogram for survival and a web-based survival rate calculator that can dynamically predict the long-term survival of patients with primary gastric diffuse large B-cell lymphoma. Methods: A total of 2647 patients diagnosed with primary gastric diffuse large B-cell lymphoma from 1998 to 2014 were extracted from the SEER database. We used the Lasso Cox regression model to identify independent risk factors for long-term survival and to develop a predictive nomogram for survival and a web-based survival rate calculator. Results: The median (mean) follow-up time was 30 months (52.8 months). Cancer-specific survival rates decreased with time, while the 5-year conditional survival increased with time. Cancer-specific deaths were not constant. Cancer-specific deaths of patients within the first 2 years were high, while the risk remained relatively constant after 2 years. The independent risk factors included surgery, chemotherapy, tumor stage and age, according to the Lasso Cox regression analysis. We developed a predictive nomogram and a web-based survival rate calculator (https://linjuli1991.shinyapps.io/dynnomapp/). The calibration plot suggested that the actual value exhibited good agreement with the predicted value. Conclusions: We found that patients with primary gastric diffuse large B-cell lymphoma had a high risk of death during the first 2 years. Additional active follow-up strategies should be provided during this period. This is the first study to develop a predictive nomogram and a web-based survival rate calculator that can provide evidence for individual treatment and follow-up.",
                "authors": [
                    {
                        "name": "Lin J.-L."
                    },
                    {
                        "name": "Lin J.-X."
                    },
                    {
                        "name": "Li P."
                    },
                    {
                        "name": "Xie J.-W."
                    },
                    {
                        "name": "Wang J.-B."
                    },
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "Chen Q.-Y."
                    },
                    {
                        "name": "Cao L.-L."
                    },
                    {
                        "name": "Huang C.-M."
                    },
                    {
                        "name": "Zheng C.-H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-03T00:00:00Z",
                "journal": "BMC Cancer",
                "title": "Dynamic prediction of long-term survival in patients with primary gastric diffuse large B-cell lymphoma: A SEER population-based study"
            },
            "pmcid": "PMC6724291",
            "pmid": "31481021"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}