{
    "accessibility": "Open access",
    "additionDate": "2022-05-20T22:33:41.703035Z",
    "biotoolsCURIE": "biotools:msup6_supa",
    "biotoolsID": "msup6_supa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Bowen Song"
        },
        {
            "name": "Daiyun Huang"
        },
        {
            "name": "Haoting Chen"
        },
        {
            "name": "Lei Zhang"
        },
        {
            "name": "Zhanmin Liang"
        }
    ],
    "description": "A centralized online platform for predicting the m6A methylation degree of mRNA and the SNP-related traits in Maize.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://www.xjtlu.edu.cn/biologicalsciences/maize",
    "lastUpdate": "2022-05-20T22:33:41.706199Z",
    "name": "msup6 supA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2021.11.010",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.With the rapid development of high-throughput sequencing techniques nowadays, extensive attention has been paid to epitranscriptomics, which covers more than 150 distinct chemical modifications to date. Among that, N6-methyladenosine (m6A) modification has the most abundant existence, and it is also significantly related to varieties of biological processes. Meanwhile, maize is the most important food crop and cultivated throughout the world. Therefore, the study of m6A modification in maize has both economic and academic value. In this research, we proposed a weakly supervised learning model to predict the situation of m6A modification in maize. The proposed model learns from low-resolution epitranscriptome datasets (e.g., MeRIP-seq), which predicts the m6A methylation status of given fragments or regions. By taking advantage of our prediction model, we further identified traits-associated SNPs that may affect (add or remove) m6A modifications in maize, which may provide potential regulatory mechanisms at epitranscriptome layer. Additionally, a centralized online-platform was developed for m6A study in maize, which contains 58,838 experimentally validated maize m6A-containing regions including training and testing datasets, and a database for 2,578 predicted traits-associated m6A-affecting maize mutations. Furthermore, the online web server based on proposed weakly supervised model is available for predicting putative m6A sites from user-uploaded maize sequences, as well as accessing the epitranscriptome impact of user-interested maize SNPs on m6A modification. In all, our work provided a useful resource for the study of m6A RNA methylation in maize species. It is freely accessible at www.xjtlu.edu.cn/biologicalsciences/maize.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Huang D."
                    },
                    {
                        "name": "Liang Z."
                    },
                    {
                        "name": "Song B."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Methods",
                "title": "m6A-Maize: Weakly supervised prediction of m6A-carrying transcripts and m6A-affecting mutations in maize (Zea mays)"
            },
            "pmid": "34843978"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
