
{
    "credit": [
        {
            "email": "julien.chiquet@inra.fr",
            "name": "Julien Chiquet",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/jchiquet/multivarNetwork/issues"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature.This chapter addresses the problem of reconstructing regulatory networks in molecular biology by integrating multiple sources of data. We consider data sets measured from diverse technologies all related to the same set of variables and individuals. This situation is becoming more and more common in molecular biology, for instance, when both proteomic and transcriptomic data related to the same set of “genes” are available on a given cohort of patients. To infer a consensus network that integrates both proteomic and transcriptomic data, we introduce a multivariate extension of Gaussian graphical models (GGM), which we refer to as multiattribute GGM. Indeed, the GGM framework offers a good proxy for modeling direct links between biological entities. We perform the inference of our multivariate GGM with a neighborhood selection procedure that operates at a multiscale level. This procedure employs a group-Lasso penalty in order to select interactions which operate both at the proteomic and at the transcriptomic level between two genes. We end up with a consensus network embedding information shared at multiple scales of the cell. We illustrate this method on two breast cancer data sets. An R-package is publicly available on github at https://github.com/jchiquet/multivarNetwork to promote reproducibility.",
            "authors": [
                "Chiquet J.",
                "Rigaill G.",
                "Sundqvist M."
            ],
            "cit_count": 0,
            "doi": "10.1007/978-1-4939-8882-2_6",
            "journal": "Methods in Molecular Biology",
            "pmid": "30547399",
            "title": "A Multiattribute Gaussian Graphical Model for Inferring Multiscale Regulatory Networks: An Application in Breast Cancer",
            "type": "Primary",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:multivarNetwork",
        "biotoolsID": "multivarNetwork",
        "description": "R package for inferring multi-variate/multi-attribute Gaussian graphical models.",
        "homepage": "https://github.com/jchiquet/multivarNetwork",
        "name": "multivarNetwork"
    }
}