{
    "accessibility": "Open access",
    "additionDate": "2024-05-01T09:12:32.628028Z",
    "biotoolsCURIE": "biotools:celldialog",
    "biotoolsID": "celldialog",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Lihong Peng",
            "typeEntity": "Person"
        }
    ],
    "description": "Computational framework for ligand-receptor-mediated cell-cell communication analysis III.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/plhhnu/CellDialog",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:02:18.065507Z",
    "name": "CellDialog",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/jbhi.2023.3333828",
            "metadata": {
                "abstract": "Intercellularcommunication significantly influences tumor progression, metastasis, and therapy resistance. An intercellular communication inference method includes two main procedures: ligand-receptor interaction (LRI) curation and LRI-mediated intercellular communication strength measurement. The construction of a comprehensive, high-confident and well-organized LRI database contributes to intercellular communication inference. Here, we developed a computational framework named CellDialog to reconstruct an intercellular connectivity network based on the combined expression of ligands and receptors involved in sender and receiver cells. CellDialog first captures high-confident LRIs through LRI feature extraction, feature selection, and classification. Furthermore, CellDialog uses a three-point estimation approach to measure the LRI-mediated intercellular communication strength by combining LRI filtering and single-cell RNA sequencing data. A comparison analysis of CellDialog and the other tools was conducted, and it was found that CellDialog can efficiently decode intercellular communications. Additionally, CellDialog offers a heatmap view and network view for intercellular communication visualization. In summary, CellDialog provides a tool that allows researchers to analyze intercellular signal transduction.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Han C."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Peng L."
                    },
                    {
                        "name": "Xiong W."
                    }
                ],
                "citationCount": 18,
                "date": "2024-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "CellDialog: A Computational Framework for Ligand-Receptor-Mediated Cell-Cell Communication Analysis"
            },
            "pmid": "37976192"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
