{
    "additionDate": "2017-03-30T22:04:20Z",
    "biotoolsCURIE": "biotools:mbgd",
    "biotoolsID": "mbgd",
    "credit": [
        {
            "email": "uchiyama@nibb.ac.jp",
            "name": "Ikuo Uchiyama",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The microbial genome database for comparative analysis is a platform for microbial comparative genomics based on automated ortholog group identification. A prominent feature is that it allows users to create ortholog groups using a specified subgroup of organisms.",
    "documentation": [
        {
            "type": "General",
            "url": "http://mbgd.genome.ad.jp/doc/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome feature comparison",
                    "uri": "http://edamontology.org/operation_3194"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://mbgd.genome.ad.jp/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "Microbial Genome Database (MBGD)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The microbial genome database (MBGD) for comparative analysis is a platform for microbial comparative genomics based on automated ortholog group identification. A prominent feature of MBGD is that it allows users to create ortholog groups using a specified subgroup of organisms. The database is constantly updated and now contains almost 1000 genomes. To utilize the MBGD database as a comprehensive resource for investigating microbial genome diversity, we have developed the following advanced functionalities: (i) enhanced assignment of functional annotation, including external database links to each orthologous group, (ii) interface for choosing a set of genomes to compare based on phenotypic properties, (iii) the addition of more eukaryotic microbial genomes (fungi and protists) and some higher eukaryotes as references and (iv) enhancement of the MyMBGD mode, which allows users to add their own genomes to MBGD and now accepts raw genomic sequences without any annotation (in such a case, it runs a gene-finding procedure before identifying the orthologs). Some analysis functions, such as the function to find orthologs with similar phylogenetic patterns, have also been improved. MBGD is accessible at http://mbgd.genome.ad.jp/. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Uchiyama I."
                    },
                    {
                        "name": "Higuchi T."
                    },
                    {
                        "name": "Kawai M."
                    }
                ],
                "citationCount": 49,
                "date": "2009-11-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MBGD update 2010: Toward a comprehensive resource for exploring microbial genome diversity"
            },
            "pmid": "19906735"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}