{
    "additionDate": "2022-10-07T09:22:41.669705Z",
    "biotoolsCURIE": "biotools:mucormydb",
    "biotoolsID": "mucormydb",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/mucormydb/index.html"
        }
    ],
    "description": "Mucormydb is a web server that enables the scientific community to fight opportunistic fungal infections caused by a group of molds",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/mucormydb/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/mucormydb/index.html",
    "lastUpdate": "2024-07-24T11:08:20.588062Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/mucormydb/index.html"
        }
    ],
    "name": "mucormydb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1016/bs.apcsb.2023.11.014",
            "metadata": {
                "abstract": "An uncommon opportunistic fungal infection known as mucormycosis is caused by a class of molds called mucoromycetes. Currently, antifungal therapy and surgical debridement are the primary treatment options for mucormycosis. Despite the importance of comprehensive knowledge on mucormycosis, there is a lack of well-annotated databases that provide all relevant information. In this study, we have gathered and organized all available information related to mucormycosis that include disease's genome, proteins, diagnostic methods. Furthermore, using the AlphaFold2.0 prediction tool, we have predicted the tertiary structures of potential drug targets. We have categorized the information into three major sections: “genomics/proteomics,” “immunotherapy,” and “drugs.” The genomics/proteomics module contains information on different strains responsible for mucormycosis. The immunotherapy module includes putative sequence-based therapeutics predicted using established tools. Drugs module provides information on available drugs for treating the disease. Additionally, the drugs module also offers prerequisite information for designing computationally aided drugs, such as putative targets and predicted structures. In order to provide comprehensive information over internet, we developed a web-based platform MucormyDB (https://webs.iiitd.edu.in/raghava/mucormydb/).",
                "authors": [
                    {
                        "name": "Choudhury S."
                    },
                    {
                        "name": "Kaur D."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Tomer R."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Advances in Protein Chemistry and Structural Biology",
                "title": "Genome-based solutions for managing mucormycosis"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
