{
    "additionDate": "2021-01-18T11:02:16Z",
    "biotoolsCURIE": "biotools:rck",
    "biotoolsID": "rck",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "braphael@princeton.edu",
            "name": "Sergey Aganezov",
            "typeEntity": "Person"
        }
    ],
    "description": "Reconstruction of clone- and haplotype-specific cancer genome karyotypes from bulk tumor samples.\n\nReconstruction of clone- and haplotype-specific Cancer Karyotypes.\n\nNOTE: this repository contains only the initial version of RCK at the time of its publication.\n\nRCK - is a method for Reconstruction of clone- and haplotype-specific Cancer Karyotypes from tumor mixtures, distributed both as a standalone software package and as a Python library under the MIT licence.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/raphael-group/RCK",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-04T14:40:17Z",
    "license": "MIT",
    "name": "RCK",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1101/GR.256701.119",
            "metadata": {
                "abstract": "© 2020 Aganezov and Raphael This article is distributed exclusively by Cold Spring Harbor Laboratory Press for the first six months after the full-issue publication date (see http://genome.cshlp.org/site/misc/terms.xhtml). After six months, it is available under a Creative Commons License (Attribution-NonCommercial 4.0 International), as described at http://creativecommons.org/licenses/by-nc/4.0/.Many cancer genomes are extensively rearranged with aberrant chromosomal karyotypes. Deriving these karyotypes from high-throughput DNA sequencing of bulk tumor samples is complicated because most tumors are a heterogeneous mixture of normal cells and subpopulations of cancer cells, or clones, that harbor distinct somatic mutations. We introduce a new algorithm, Reconstructing Cancer Karyotypes (RCK), to reconstruct haplotype-specific karyotypes of one or more rearranged cancer genomes from DNA sequencing data from a bulk tumor sample. RCK leverages evolutionary constraints on the somatic mutational process in cancer to reduce ambiguity in the deconvolution of admixed sequencing data into multiple haplotype-specific cancer karyotypes. RCK models mixtures containing an arbitrary number of derived genomes and allows the incorporation of information both from short-read and long-read DNA sequencing technologies. We compare RCK to existing approaches on 17 primary and metastatic prostate cancer samples. We find that RCK infers cancer karyotypes that better explain the DNA sequencing data and conform to a reasonable evolutionary model. RCK's reconstructions of clone- and haplotype-specific karyotypes will aid further studies of the role of intra-tumor heterogeneity in cancer development and response to treatment. RCK is freely available as open source software.",
                "authors": [
                    {
                        "name": "Aganezov S."
                    },
                    {
                        "name": "Raphael B.J."
                    }
                ],
                "citationCount": 3,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Reconstruction of clone- And haplotype-specific cancer genome karyotypes from bulk tumor samples"
            },
            "pmcid": "PMC7545144",
            "pmid": "32887685"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}