{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-06-19T10:07:53.760167Z",
    "biotoolsCURIE": "biotools:lineage",
    "biotoolsID": "lineage",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cyyang@xmu.edu.cn",
            "name": "Chaoyong Yang",
            "orcidid": "https://orcid.org/0000-0002-2374-5342",
            "typeEntity": "Person"
        },
        {
            "email": "li_jin_lifescience@fudan.edu.cn",
            "name": "Jin Li",
            "orcidid": "https://orcid.org/0000-0002-7957-1476",
            "typeEntity": "Person"
        },
        {
            "email": "songjiajia2010@shsmu.edu.cn",
            "name": "Jia Song",
            "typeEntity": "Person"
        }
    ],
    "description": "A lineage analysis algorithm called Label-free IdeNtification of Endogenous informAtive sinGle cell mitochondrial RNA mutation for lineage analysis and clonal Evolution (LINEAGE) by integrating the low cross-entropy subspaces identification with a consensus clustering method.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/songjiajia2018/LINEAGE",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-19T10:07:53.763591Z",
    "license": "GPL-3.0",
    "name": "lineage",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1073/PNAS.2119767119",
            "metadata": {
                "abstract": "© 2022 National Academy of Sciences. All rights reserved.Single-cell RNA-sequencing (scRNA-seq) has become a powerful tool for biomedical research by providing a variety of valuable information with the advancement of computational tools. Lineage analysis based on scRNA-seq provides key insights into the fate of individual cells in various systems. However, such analysis is limited by several technical challenges. On top of the considerable computational expertise and resources, these analyses also require specific types of matching data such as exogenous barcode information or bulk assay for transposase-accessible chromatin with high throughput sequencing (ATAC-seq) data. To overcome these technical challenges, we developed a user-friendly computational algorithm called “LINEAGE” (label-free identification of endogenous informative single-cell mitochondrial RNA mutation for lineage analysis). Aiming to screen out endogenous markers of lineage located on mitochondrial reads from label-free scRNA-seq data to conduct lineage inference, LINEAGE integrates a marker selection strategy by feature subspace separation and de novo “low cross-entropy subspaces” identification. In this process, the mutation type and subspace-subspace “cross-entropy” of features were both taken into consideration. LINEAGE outperformed three other methods, which were designed for similar tasks as testified with two standard datasets in terms of biological accuracy and computational efficiency. Applied on a label-free scRNA-seq dataset of BRAF-mutated cancer cells, LINEAGE also revealed genes that contribute to BRAF inhibitor resistance. LINEAGE removes most of the technical hurdles of lineage analysis, which will remarkably accelerate the discovery of the important genes or cell-lineage clusters from scRNA-seq data.",
                "authors": [
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Lin F."
                    },
                    {
                        "name": "Lin L."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Lu G."
                    },
                    {
                        "name": "Qian W."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Song Y."
                    },
                    {
                        "name": "Sun D."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2022-02-01T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "LINEAGE: Label-free identification of endogenous informative single-cell mitochondrial RNA mutation for lineage analysis"
            },
            "pmcid": "PMC8812554",
            "pmid": "35086932"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
