{
    "additionDate": "2021-01-18T07:00:17Z",
    "biotoolsCURIE": "biotools:cyby2",
    "biotoolsID": "cyby2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rainer.riedl@zhaw.ch",
            "name": "Rainer Riedl",
            "orcidid": "https://orcid.org/0000-0003-2534-1963",
            "typeEntity": "Person"
        }
    ],
    "description": "CyBy2 is a library for writing chemical and biological data management systems. It is a strongly typed, purely functional framework for chemical data management. This library provides a set of utility functions and data types for writing purely functional client/server applications for handling and querying chemical and biological data. It is split into several modules and comes with an example implementation of a HTTP-server and web client for a fully functional chemical data management system.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/stefan-hoeck/cyby2",
    "language": [
        "Scala"
    ],
    "lastUpdate": "2021-02-18T19:08:39Z",
    "license": "GPL-3.0",
    "name": "CyBy2",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13321-019-0403-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).We present the development of CyBy 2, a versatile framework for chemical data management written in purely functional style in Scala, a modern multi-paradigm programming language. Together with the core libraries we provide a fully functional example implementation of a HTTP server together with a single page web client with powerful querying and visualization capabilities, providing essential functionality for people working in the field of organic and medicinal chemistry. The main focus of CyBy 2 are the diverse needs of different research groups in the field and therefore the flexibility required from the underlying data model. Techniques for writing type level specifications giving strong guarantees about the correctness of the implementation are described, together with the resulting gain in confidence during refactoring. Finally we talk about the advantages of using a single code base from which the server, the client and the software's documentation pages are being generated. We conclude with a comparison with existing open source solutions. All code described in this article is published under version 3 of the GNU General Public License and available from GitHub including an example implementation of both backend and frontend together with documentation how to download and compile the software (available at https://github.com/stefan-hoeck/cyby2).",
                "authors": [
                    {
                        "name": "Hock S."
                    },
                    {
                        "name": "Riedl R."
                    }
                ],
                "date": "2019-12-30T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "CyBy2: A strongly typed, purely functional framework for chemical data management"
            },
            "pmcid": "PMC6937922"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        }
    ]
}