{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-07-20T07:13:15.795574Z",
    "biotoolsCURIE": "biotools:deepspectrumlite",
    "biotoolsID": "deepspectrumlite",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shahin.amiriparian@informatik.uni-augsburg.de",
            "name": "Shahin Amiriparian",
            "typeEntity": "Person"
        },
        {
            "name": "Björn Wolfgang Schuller"
        }
    ],
    "description": "DeepSpectrumLite is a Python toolkit to design and train light-weight Deep Neural Networks (DNNs) for classification tasks from raw audio data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DeepSpectrum/DeepSpectrumLite",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-20T07:13:15.798289Z",
    "license": "GPL-3.0",
    "name": "DeepSpectrumLite",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FRAI.2022.856232",
            "metadata": {
                "abstract": "Copyright © 2022 Amiriparian, Hübner, Karas, Gerczuk, Ottl and Schuller.Deep neural speech and audio processing systems have a large number of trainable parameters, a relatively complex architecture, and require a vast amount of training data and computational power. These constraints make it more challenging to integrate such systems into embedded devices and utilize them for real-time, real-world applications. We tackle these limitations by introducing DeepSpectrumLite, an open-source, lightweight transfer learning framework for on-device speech and audio recognition using pre-trained image Convolutional Neural Networks (CNNs). The framework creates and augments Mel spectrogram plots on the fly from raw audio signals which are then used to finetune specific pre-trained CNNs for the target classification task. Subsequently, the whole pipeline can be run in real-time with a mean inference lag of 242.0 ms when a DenseNet121 model is used on a consumer-grade Motorola moto e7 plus smartphone. DeepSpectrumLite operates decentralized, eliminating the need for data upload for further processing. We demonstrate the suitability of the proposed transfer learning approach for embedded audio signal processing by obtaining state-of-the-art results on a set of paralinguistic and general audio tasks, including speech and music emotion recognition, social signal processing, COVID-19 cough and COVID-19 speech analysis, and snore sound classification. We provide an extensive command-line interface for users and developers which is comprehensively documented and publicly available at https://github.com/DeepSpectrum/DeepSpectrumLite.",
                "authors": [
                    {
                        "name": "Amiriparian S."
                    },
                    {
                        "name": "Gerczuk M."
                    },
                    {
                        "name": "Hubner T."
                    },
                    {
                        "name": "Karas V."
                    },
                    {
                        "name": "Ottl S."
                    },
                    {
                        "name": "Schuller B.W."
                    }
                ],
                "date": "2022-03-17T00:00:00Z",
                "journal": "Frontiers in Artificial Intelligence",
                "title": "DeepSpectrumLite: A Power-Efficient Transfer Learning Framework for Embedded Speech and Audio Processing From Decentralized Data"
            },
            "pmcid": "PMC8969434",
            "pmid": "35372830"
        }
    ],
    "toolType": [
        "Suite",
        "Workbench",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
