
{
    "credit": [
        {
            "email": "treegenesdb@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://dendrome.ucdavis.edu/cartogratree/about.html#credits"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://dendrome.ucdavis.edu/cartogratree/about.html#credits"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            },
            {
                "term": "Ecology",
                "uri": "http://edamontology.org/topic_0610"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/cartogratree-connecting-tree-genomes-phenotypes-and-environment.html"
        }
    ],
    "publication": [
        {
            "abstract": "Today, researchers spend a tremendous amount of time gathering, formatting, filtering and visualizing data collected from disparate sources. Under the umbrella of forest tree biology, we seek to provide a platform and leverage modern technologies to connect biotic and abiotic data. Our goal is to provide an integrated web-based workspace that connects environmental, genomic and phenotypic data via geo-referenced coordinates. Here, we connect the genomic query web-based workspace, DiversiTree and a novel geographical interface called CartograTree to data housed on the TreeGenes database. To accomplish this goal, we implemented Simple Semantic Web Architecture and Protocol to enable the primary genomics database, TreeGenes, to communicate with semantic web services regardless of platform or back-end technologies. The novelty of CartograTree lies in the interactive workspace that allows for geographical visualization and engagement of high performance computing (HPC) resources. The application provides a unique tool set to facilitate research on the ecology, physiology and evolution of forest tree species. CartograTree can be accessed at: http://dendrome.ucdavis.edu/cartogratree. © 2013 Blackwell Publishing Ltd.",
            "authors": [
                "Vasquez-Gross H.A.",
                "Yu J.J.",
                "Figueroa B.",
                "Gessler D.D.G.",
                "Neale D.B.",
                "Wegrzyn J.L."
            ],
            "cit_count": 3,
            "journal": "Molecular Ecology Resources",
            "pmid": "23433187",
            "title": "CartograTree: Connecting tree genomes, phenotypes and environment",
            "year": "2013-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cartogratree",
        "biotoolsID": "cartogratree",
        "description": "CartograTree is a web-based application that allows researchers to identify, filter, compare, and visualize geo-referenced biotic and abiotic data. Its goal is to support numerous multi-disciplinary research endeavors including: phylogenetics, population structure, and association studies.",
        "homepage": "http://dendrome.ucdavis.edu/cartogratree/",
        "name": "CartograTree"
    }
}