{
    "accessibility": "Open access",
    "additionDate": "2022-06-09T08:09:12.849754Z",
    "biotoolsCURIE": "biotools:bayesctdesign",
    "biotoolsID": "bayesctdesign",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "beggleston@rti.org",
            "name": "Barry S. Eggleston",
            "typeEntity": "Person"
        }
    ],
    "description": "An R Package for Bayesian Trial Design Using Historical Control Data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=BayesCTDesign",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-09T08:09:12.852531Z",
    "license": "GPL-3.0",
    "name": "BayesCTDesign",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.18637/JSS.V100.I21",
            "metadata": {
                "abstract": "© 2021, American Statistical Association. All rights reserved.This article introduces the R package BayesCTDesign for two-arm randomized Bayesian trial design using historical control data when available, and simple two-arm randomized Bayesian trial design when historical control data is not available. The package BayesCTDesign, which is available from the Comprehensive R Archive Network, has two simulation functions, historic_sim() and simple_sim() for studying trial characteristics under user-defined scenarios, and two methods print() and plot() for displaying summaries of the simulated trial characteristics. The package BayesCTDesign works with two-arm trials with equal sample sizes per arm. The package BayesCTDesign allows a user to study Gaussian, Poisson, Bernoulli, Weibull, lognormal, and piecewise exponen-tial outcomes. Power for two-sided hypothesis tests at a user-defined α is estimated via simulation using a test within each simulation replication that involves comparing a 95% credible interval for the outcome specific treatment effect measure to the null case value. If the 95% credible interval excludes the null case value, then the null hypothesis is re-jected, else the null hypothesis is accepted. In the article, the idea of including historical control data in a Bayesian analysis is reviewed, the estimation process of BayesCTDesign is explained, and the user interface is described. Finally, the BayesCTDesign is illustrated via several examples.",
                "authors": [
                    {
                        "name": "Catellier D."
                    },
                    {
                        "name": "Eggleston B.S."
                    },
                    {
                        "name": "Ibrahim J.G."
                    },
                    {
                        "name": "McNeil B."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Statistical Software",
                "title": "BayesCTDesign: An R Package for Bayesian Trial Design Using Historical Control Data"
            },
            "pmcid": "PMC8715862",
            "pmid": "34975350"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
