{
    "additionDate": "2021-01-18T08:30:15Z",
    "biotoolsCURIE": "biotools:piano-server",
    "biotoolsID": "piano-server",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kunqi.chen@xjtlu.edu.cn",
            "name": "Kunqi Chen",
            "typeEntity": "Person"
        },
        {
            "name": "Bowen Song",
            "typeEntity": "Person"
        },
        {
            "name": "Yujiao Tang",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web Server for Pseudouridine-Site (Ψ) Identification and Functional Annotation.\n\nRetrieve the results by the job ID.\n\nΨ-WHISTLE is a prediction framework dedicated for transcriptome-wide Ψ RNA methylation site prediction using a machine learning approach.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://piano.rnamd.com",
    "lastUpdate": "2021-01-23T16:15:57Z",
    "name": "PIANO",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00088",
            "metadata": {
                "abstract": "© Copyright © 2020 Song, Tang, Wei, Liu, Su, Meng and Chen.Known as the “fifth RNA nucleotide”, pseudouridine (Ψ or psi) is the first-discovered and most abundant RNA modification occurring at the Uridine site, and it plays a prominent role in a number of biological processes. Thousands of Ψ sites have been identified within different biological contexts thanks to the advancement in high-throughput sequencing technology; nevertheless, the transcriptome-wide distribution, biomolecular functions, regulatory mechanisms, and disease relevance of pseudouridylation are largely elusive. We report here a web server—PIANO—for pseudouridine site (Ψ) identification and functional annotation. PIANO was built upon a high-accuracy predictor that takes advantage of both conventional sequence features and 42 additional genomic features. When tested on six independent datasets generated from four independent Ψ-profiling technologies (Ψ-seq, RBS-seq, Pseudo-seq, and CeU-seq) as benchmarks, PIANO achieved an average AUC of 0.955 and 0.838 under the full transcript and mature mRNA models, respectively, marking a substantial improvement in accuracy compared to the existing in silico Ψ-site prediction methods, i.e., PPUS (0.713 and 0.707), iRNA-PseU (0.713 and 0.712), and PseUI (0.634 and 0.652). Besides, PIANO web server systematically annotates the predicted Ψ sites with post-transcriptional regulatory mechanisms (miRNA-targets, RBP-binding regions, and splicing sites) in its prediction report to help the users explore potential machinery of Ψ. Moreover, a concise query interface was also built for 4,303 known Ψ sites, which is currently the largest collection of experimentally validated human Ψ sites. The PIANO website is freely accessible at: http://piano.rnamd.com.",
                "authors": [
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Meng J."
                    },
                    {
                        "name": "Song B."
                    },
                    {
                        "name": "Su J."
                    },
                    {
                        "name": "Tang Y."
                    },
                    {
                        "name": "Wei Z."
                    }
                ],
                "citationCount": 13,
                "date": "2020-03-12T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "PIANO: A Web Server for Pseudouridine-Site (Ψ) Identification and Functional Annotation"
            },
            "pmcid": "PMC7080813",
            "pmid": "32226440"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
