{
    "additionDate": "2024-02-23T08:53:49.895100Z",
    "biotoolsCURIE": "biotools:debbi",
    "biotoolsID": "debbi",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "lfiedler@informatik.uni-leipzig.de",
            "name": "Lisa Fiedler",
            "typeEntity": "Person"
        }
    ],
    "description": "Detecting gene breakpoints in noisy genome sequences using position-annotated colored de-Bruijn graphs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                },
                {
                    "term": "Reverse complement",
                    "uri": "http://edamontology.org/operation_0363"
                }
            ]
        }
    ],
    "homepage": "https://git.informatik.uni-leipzig.de/lfiedler/debbi-tool-for-gene-breakpoint-identification",
    "lastUpdate": "2024-11-24T14:13:52.887024Z",
    "name": "DeBBI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05371-4",
            "metadata": {
                "abstract": "Background: Identifying the locations of gene breakpoints between species of different taxonomic groups can provide useful insights into the underlying evolutionary processes. Given the exact locations of their genes, the breakpoints can be computed without much effort. However, often, existing gene annotations are erroneous, or only nucleotide sequences are available. Especially in mitochondrial genomes, high variations in gene orders are usually accompanied by a high degree of sequence inconsistencies. This makes accurately locating breakpoints in mitogenomic nucleotide sequences a challenging task. Results: This contribution presents a novel method for detecting gene breakpoints in the nucleotide sequences of complete mitochondrial genomes, taking into account possible high substitution rates. The method is implemented in the software package DeBBI. DeBBI allows to analyze transposition- and inversion-based breakpoints independently and uses a parallel program design, allowing to make use of modern multi-processor systems. Extensive tests on synthetic data sets, covering a broad range of sequence dissimilarities and different numbers of introduced breakpoints, demonstrate DeBBI ’s ability to produce accurate results. Case studies using species of various taxonomic groups further show DeBBI ’s applicability to real-life data. While (some) multiple sequence alignment tools can also be used for the task at hand, we demonstrate that especially gene breaks between short, poorly conserved tRNA genes can be detected more frequently with the proposed approach. Conclusion: The proposed method constructs a position-annotated de-Bruijn graph of the input sequences. Using a heuristic algorithm, this graph is searched for particular structures, called bulges, which may be associated with the breakpoint locations. Despite the large size of these structures, the algorithm only requires a small number of graph traversal steps.",
                "authors": [
                    {
                        "name": "Bernt M."
                    },
                    {
                        "name": "Fiedler L."
                    },
                    {
                        "name": "Middendorf M."
                    },
                    {
                        "name": "Stadler P.F."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Detecting gene breakpoints in noisy genome sequences using position-annotated colored de-Bruijn graphs"
            },
            "pmcid": "PMC10243065",
            "pmid": "37277700"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}
