{
    "additionDate": "2021-03-19T08:48:35Z",
    "biotoolsCURIE": "biotools:birds",
    "biotoolsID": "birds",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "feipeng@hust.edu.cn",
            "name": "Peng Fei",
            "orcidid": "https://orcid.org/0000-0003-3764-817X",
            "typeEntity": "Person"
        },
        {
            "email": "yhan@hust.edu.cn",
            "name": "Yunyun Han",
            "typeEntity": "Person"
        }
    ],
    "description": "Bi-channel image registration and deep-learning segmentation (BIRDS) is a tool for efficient, versatile 3D mapping of mouse brain. It is an open source automation pipeline suitable for brain data from different microscopy platforms.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://github.com/bleach1by1/BIRDS_demo"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bleach1by1/BIRDS_plugin",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2021-04-21T08:21:24Z",
    "license": "MIT",
    "name": "BIRDS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7554/ELIFE.63455",
            "metadata": {
                "abstract": "© Wang et al.We have developed an open-source software called bi-channel image registration and deep-learning segmentation (BIRDS) for the mapping and analysis of 3D microscopy data and applied this to the mouse brain. The BIRDS pipeline includes image preprocessing, bi-channel registration, automatic annotation, creation of a 3D digital frame, high-resolution visualization, and expandable quantitative analysis. This new bi-channel registration algorithm is adaptive to various types of whole-brain data from different microscopy platforms and shows dramatically improved registration accuracy. Additionally, as this platform combines registration with neural networks, its improved function relative to the other platforms lies in the fact that the registration procedure can readily provide training data for network construction, while the trained neural network can efficiently segment-incomplete/defective brain data that is otherwise difficult to register. Our software is thus optimized to enable either minute-timescale registration-based segmentation of cross-modality, whole-brain datasets or real-time inference-based image segmentation of various brain regions of interest. Jobs can be easily submitted and implemented via a Fiji plugin that can be adapted to most computing environments.",
                "authors": [
                    {
                        "name": "Fang C."
                    },
                    {
                        "name": "Fei P."
                    },
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zeng W."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "eLife",
                "title": "Bi-channel image registration and deep-learning segmentation (Birds) for efficient, versatile 3d mapping of mouse brain"
            },
            "pmcid": "PMC7840180",
            "pmid": "33459255"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
