
{
    "credit": [
        {
            "email": "lchen@systemsbiology.org",
            "name": "Leroy E. Hood",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://hood.systemsbiology.net/RNASEQR/RNASEQR_manual.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Workflow"
        ],
        "topic": [
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Next-generation sequencing (NGS) technologies-based transcriptomic profiling method often called RNA-seq has been widely used to study global gene expression, alternative exon usage, new exon discovery, novel transcriptional isoforms and genomic sequence variations. However, this technique also poses many biological and informatics challenges to extracting meaningful biological information. The RNA-seq data analysis is built on the foundation of high quality initial genome localization and alignment information for RNA-seq sequences. Toward this goal, we have developed RNASEQR to accurately and effectively map millions of RNA-seq sequences. We have systematically compared RNASEQR with four of the most widely used tools using a simulated data set created from the Consensus CDS project and two experimental RNA-seq data sets generated from a human glioblastoma patient. Our results showed that RNASEQR yields more accurate estimates for gene expression, complete gene structures and new transcript isoforms, as well as more accurate detection of single nucleotide variants (SNVs). RNASEQR analyzes raw data from RNA-seq experiments effectively and outputs results in a manner that is compatible with a wide variety of specialized downstream analyses on desktop computers. © 2011 The Author(s).",
            "authors": [
                "Chen L.Y.",
                "Wei K.-C.",
                "Huang A.C.-Y.",
                "Wang K.",
                "Huang C.-Y.",
                "Yi D.",
                "Tang C.Y.",
                "Galas D.J.",
                "Hood L.E."
            ],
            "cit_count": 16,
            "journal": "Nucleic Acids Research",
            "pmid": "22199257",
            "title": "RNASEQR-a streamlined and accurate RNA-seq sequence analysis program",
            "year": "2012-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rnaseqr",
        "biotoolsID": "rnaseqr",
        "description": "a streamlined and accurate RNA-seq sequence analysis program",
        "homepage": "http://hood.systemsbiology.net/rnaseqr.php",
        "name": "RNASEQR"
    }
}