{
    "additionDate": "2020-01-09T17:49:44Z",
    "biotoolsCURIE": "biotools:DrugCombDB",
    "biotoolsID": "DrugCombDB",
    "confidence_flag": "tool",
    "description": "DrugCombDB is a comprehensive database dedicated to integrating drug combinations from various data sources, include 1) high-throughput screening assays of drug combinations, 2) external databases, and 3) manual curations from PubMed literature.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://drugcombdb.denglab.org/tutorial"
        }
    ],
    "download": [
        {
            "note": "Datasets - For acedemic usage only.",
            "type": "Other",
            "url": "http://drugcombdb.denglab.org/download"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://drugcombdb.denglab.org/",
    "lastUpdate": "2021-01-14T19:03:41Z",
    "name": "DrugCombDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ1007",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Drug combinations have demonstrated high efficacy and low adverse side effects compared to single drug administration in cancer therapies and thus have drawn intensive attention from researchers and pharmaceutical enterprises. Due to the rapid development of high-Throughput screening (HTS), the number of drug combination datasets available has increased tremendously in recent years. Therefore, there is an urgent need for a comprehensive database that is crucial to both experimental and computational screening of synergistic drug combinations. In this paper, we present DrugCombDB, a comprehensive database devoted to the curation of drug combinations from various data sources: (i) HTS assays of drug combinations; (ii) manual curations from the literature; and (iii) FDA Orange Book and external databases. Specifically, DrugCombDB includes 448 555 drug combinations derived from HTS assays, covering 2887 unique drugs and 124 human cancer cell lines. In particular, DrugCombDB has more than 6000 000 quantitative dose responses from which we computed multiple synergy scores to determine the overall synergistic or antagonistic effects of drug combinations. In addition to the combinations extracted from existing databases, we manually curated 457 drug combinations from thousands of PubMed publications. To benefit the further experimental validation and development of computational models, multiple datasets that are ready to train prediction models for classification and regression analysis were constructed and other significant related data were gathered. A website with a user-friendly graphical visualization has been developed for users to access the wealth of data and download prebuilt datasets. Our database is available at http://drugcombdb.denglab.org/.",
                "authors": [
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zou B."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Deng Y."
                    },
                    {
                        "name": "Deng L."
                    }
                ],
                "citationCount": 16,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DrugCombDB: A comprehensive database of drug combinations toward the discovery of combinatorial therapy"
            },
            "pmid": "31665429"
        }
    ],
    "toolType": [
        "Database portal",
        "Web API"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}