{
    "additionDate": "2017-08-03T18:48:31Z",
    "biotoolsCURIE": "biotools:localali",
    "biotoolsID": "localali",
    "credit": [
        {
            "email": "jialu.hu@fu-berlin.de",
            "name": "Jialu Hu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/screamer/localali/blob/master/README"
        }
    ],
    "description": "Fast and scalable local network alignment tool for the identification of functionally conserved modules in multiple networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/screamer/localali/blob/master/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alignment",
                    "uri": "http://edamontology.org/operation_2928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/screamer/localali",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/localali-local-alignment-tool-for-multiple-networks.html"
        }
    ],
    "name": "LocalAli",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: Sequences and protein interaction data are of significance to understand the underlying molecular mechanism of organisms. Local network alignment is one of key systematic ways for predicting protein functions, identifying functional modules and understanding the phylogeny from these data. Most of currently existing tools, however, encounter their limitations, which are mainly concerned with scoring scheme, speed and scalability. Therefore, there are growing demands for sophisticated network evolution models and efficient local alignment algorithms. Results: We developed a fast and scalable local network alignment tool called LocalAli for the identification of functionally conserved modules in multiple networks. In this algorithm, we firstly proposed a new framework to reconstruct the evolution history of conserved modules based on a maximum-parsimony evolutionary model. By relying on this model, LocalAli facilitates interpretation of resulting local alignments in terms of conserved modules, which have been evolved from a common ancestral module through a series of evolutionary events. A meta-heuristic method simulated annealing was used to search for the optimal or near-optimal inner nodes (i.e. ancestral modules) of the evolutionary tree. To evaluate the performance and the statistical significance, LocalAli were tested on 26 real datasets and 1040 randomly generated datasets. The results suggest that LocalAli outperforms all existing algorithms in terms of coverage, consistency and scalability, meanwhile retains a high precision in the identification of functionally coherent subnetworks.",
                "authors": [
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Reinert K."
                    }
                ],
                "citationCount": 13,
                "date": "2015-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LocalAli: An evolutionary-based local alignment approach to identify functionally conserved modules in multiple networks"
            },
            "pmid": "25282642"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}