{
    "additionDate": "2017-03-27T12:32:33Z",
    "biotoolsCURIE": "biotools:trip",
    "biotoolsID": "trip",
    "credit": [
        {
            "email": "jhjeon2@snu.ac.kr",
            "name": "Ju-Hong Jeon",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "Dongseop@mju.ac.kr",
            "name": "Dongseop Kwon",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TRansient receptor potential channel-Interacting Protein Database is a manually curated database that aims to offer comprehensive information on protein-protein interactions (PPIs) of mammalian transient receptor protein (TRP) channels. The database provides a detailed summary of PPI data that fit into four categories: screening, validation, characterization and functional consequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.trpchannel.org/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Protein-protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2464"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.trpchannel.org",
    "language": [
        "JavaScript",
        "Ruby"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "TRIP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Transient receptor potential (TRP) channels are a superfamily of Ca 2+-permeable cation channels that translate cellular stimuli into electrochemical signals. Aberrant activity of TRP channels has been implicated in a variety of human diseases, such as neurological disorders, cardiovascular disease and cancer. To facilitate the understanding of the molecular network by which TRP channels are associated with biological and disease processes, we have developed the TRIP (TRansient receptor potential channel-Interacting Protein) Database (http://www.trpchannel.org), a manually curated database that aims to offer comprehensive information on protein-protein interactions (PPIs) of mammalian TRP channels. The TRIP Database was created by systematically curating 277 peerreviewed literature; the current version documents 490 PPI pairs, 28 TRP channels and 297 cellular proteins. The TRIP Database provides a detailed summary of PPI data that fit into four categories: screening, validation, characterization and functional consequence. Users can find in-depth information specified in the literature on relevant analytical methods and experimental resources, such as gene constructs and cell/tissue types. The TRIP Database has user-friendly web interfaces with helpful features, including a search engine, an interaction map and a function for cross-referencing useful external databases. Our TRIP Database will provide a valuable tool to assist in understanding the molecular regulatory network of TRP channels. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Shin Y.-C."
                    },
                    {
                        "name": "Shin S.-Y."
                    },
                    {
                        "name": "So I."
                    },
                    {
                        "name": "Kwon D."
                    },
                    {
                        "name": "Jeon J.-H."
                    }
                ],
                "citationCount": 21,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TRIP Database: A manually curated database of protein-protein interactions for mammalian TRP channels"
            },
            "pmid": "20851834"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        }
    ],
    "validated": 1
}