{
    "additionDate": "2021-01-18T12:29:52Z",
    "biotoolsCURIE": "biotools:hifi-se",
    "biotoolsID": "hifi-se",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shanlin1115@gmail.com",
            "name": "Shanlin Liu",
            "typeEntity": "Person"
        },
        {
            "email": "zhangab2008@mail.cnu.edu.cn",
            "name": "Ai-bing Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficient COI barcoding using high throughput single-end 400 bp sequencing.\n\nThe BGISEQ-500 platform has launched a new test sequencing kits capable of single-end 400 bp sequencing (SE400), which offers a simple and reliable way to achieve DNA barcodes efficiently. In this study, we explored the potential of the BGISEQ-500 SE400 sequencing in DNA barcode reference construction, meanwhile provided an updated HIFI-Barcode software package that can generate COI barcode assemblies using HTS reads of length >= 400 bp.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA barcoding",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/HIFI-SE/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T11:39:01Z",
    "license": "GPL-3.0",
    "name": "HIFI-SE",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07255-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Over the last decade, the rapid development of high-throughput sequencing platforms has accelerated species description and assisted morphological classification through DNA barcoding. However, the current high-throughput DNA barcoding methods cannot obtain full-length barcode sequences due to read length limitations (e.g. a maximum read length of 300 bp for the Illumina’s MiSeq system), or are hindered by a relatively high cost or low sequencing output (e.g. a maximum number of eight million reads per cell for the PacBio’s SEQUEL II system). Results: Pooled cytochrome c oxidase subunit I (COI) barcodes from individual specimens were sequenced on the MGISEQ-2000 platform using the single-end 400 bp (SE400) module. We present a bioinformatic pipeline, HIFI-SE, that takes reads generated from the 5′ and 3′ ends of the COI barcode region and assembles them into full-length barcodes. HIFI-SE is written in Python and includes four function modules of filter, assign, assembly and taxonomy. We applied the HIFI-SE to a set of 845 samples (30 marine invertebrates, 815 insects) and delivered a total of 747 fully assembled COI barcodes as well as 70 Wolbachia and fungi symbionts. Compared to their corresponding Sanger sequences (72 sequences available), nearly all samples (71/72) were correctly and accurately assembled, including 46 samples that had a similarity score of 100% and 25 of ca. 99%. Conclusions: The HIFI-SE pipeline represents an efficient way to produce standard full-length barcodes, while the reasonable cost and high sensitivity of our method can contribute considerably more DNA barcodes under the same budget. Our method thereby advances DNA-based species identification from diverse ecosystems and increases the number of relevant applications.",
                "authors": [
                    {
                        "name": "Bourne D.G."
                    },
                    {
                        "name": "Chen A."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Jia X."
                    },
                    {
                        "name": "Liao S."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Meng G."
                    },
                    {
                        "name": "O'Brien P.A."
                    },
                    {
                        "name": "Rao W."
                    },
                    {
                        "name": "Tan S."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Zhang A.-B."
                    },
                    {
                        "name": "Zheng Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Efficient COI barcoding using high throughput single-end 400 bp sequencing"
            },
            "pmcid": "PMC7716423",
            "pmid": "33276723"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
