
{
    "credit": [
        {
            "email": "zhiwu.zhang@wsu.edu",
            "name": "Zhiwu Zhang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://zzlab.net/iPat/iPat_manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press. The ultimate goal of genomic research is to effectively predict phenotypes from genotypes so that medical management can improve human health and molecular breeding can increase agricultural production. Genomic prediction or selection (GS) plays a complementary role to genome-wide association studies (GWAS), which is the primary method to identify genes underlying phenotypes. Unfortunately, most computing tools cannot perform data analyses for both GWAS and GS. Furthermore, the majority of these tools are executed through a command-line interface (CLI), which requires programming skills. Non-programmers struggle to use them efficiently because of the steep learning curves and zero tolerance for data formats and mistakes when inputting keywords and parameters. To address these problems, this study developed a software package, named the Intelligent Prediction and Association Tool (iPat), with a user-friendly graphical user interface. With iPat, GWAS or GS can be performed using a pointing device to simply drag and/or click on graphical elements to specify input data files, choose input parameters and select analytical models. Models available to users include those implemented in third party CLI packages such as GAPIT, PLINK, FarmCPU, BLINK, rrBLUP and BGLR. Users can choose any data format and conduct analyses with any of these packages. File conversions are automatically conducted for specified input data and selected packages. A GWAS-assisted genomic prediction method was implemented to perform genomic prediction using any GWAS method such as FarmCPU. iPat was written in Java for adaptation to multiple operating systems including Windows, Mac and Linux.",
            "authors": [
                "Chen C.J.",
                "Zhang Z."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty015",
            "journal": "Bioinformatics",
            "title": "IPat: Intelligent prediction and association tool for genomic research",
            "year": "2018-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ipat",
        "biotoolsID": "ipat",
        "description": "Intelligent prediction and association tool for genomic research.",
        "homepage": "http://zzlab.net/iPat/",
        "name": "iPat"
    }
}