{"credit":[{"email":"danny.incarnato@hugef-torino.org","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://epigenetics.hugef-research.org/index.php"}],"documentation":[{"type":"GENERAL","url":"http://mredictor.hugef-research.org/"}],"function":[{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Zoology","uri":"http://edamontology.org/topic_3500"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mredictor-microrna-recognition-elements-prediction-tool.html"}],"publication":[{"abstract":"The prediction of pairing between microRNAs (miRNAs) and the miRNA recognition elements (MREs) on mRNAs is expected to be an important tool for understanding gene regulation. Here, we show that mRNAs that contain Pumilio recognition elements (PRE) in the proximity of predicted miRNA-binding sites are more likely to form stable secondary structures within their 3′-UTR, and we demonstrated using a PUM1 and PUM2 double knockdown that Pumilio proteins are general regulators of miRNA accessibility. On the basis of these findings, we developed a computational method for predicting miRNA targets that accounts for the presence of PRE in the proximity of seed-match sequences within poorly accessible structures. Moreover, we implement the miRNA-MRE duplex pairing as a two-step model, which better fits the available structural data. This algorithm, called MREdictor, allows for the identification of miRNA targets in poorly accessible regions and is not restricted to a perfect seed-match; these features are not present in other computational prediction methods. © 2013 The Author(s). Published by Oxford University Press.","authors":["Incarnato D.","Neri F.","Diamanti D.","Oliviero S."],"cit_count":13,"journal":"Nucleic Acids Research","pmid":"23863844","title":"MREdictor: A two-step dynamic interaction model that accounts for mRNA accessibility and Pumilio binding accurately predicts microRNA targets","year":"2013-10-01"}],"summary":{"biotoolsCURIE":"biotools:mredictor","biotoolsID":"mredictor","description":"Highly accurate method for the identification of bona-fide microRNAs targets within mammalian genes.","homepage":"http://mredictor.hugef-research.org/","name":"MREdictor"}}