{
    "accessibility": "Open access",
    "additionDate": "2024-05-06T09:47:46.843170Z",
    "biotoolsCURIE": "biotools:antdas-dda",
    "biotoolsID": "antdas-dda",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Xing-Cai Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A New Platform for Data-Dependent Acquisition Mode-Based Untargeted Metabolomic Profiling Analysis with Advantage of Recognizing Insource Fragment Ions to Improve Compound Identification.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://www.pmdb.org.cn/antdasdda",
    "lastUpdate": "2024-11-24T14:01:23.237954Z",
    "name": "AntDAS-DDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.2c01795",
            "metadata": {
                "abstract": "Data-dependent acquisition (DDA) mode in ultra-high-performance liquid chromatography-high-resolution mass spectrometry (UHPLC-HRMS) can provide massive amounts of MS1 and MS/MS information of compounds in untargeted metabolomics and can thus facilitate compound identification greatly. In this work, we developed a new platform called AntDAS-DDA for the automatic processing of UHPLC-HRMS data sets acquired under the DDA mode. Several algorithms, including extracted ion chromatogram extraction, feature extraction, MS/MS spectrum construction, fragment ion identification, and MS1 spectrum construction, were developed within the platform. The performance of AntDAS-DDA was investigated comprehensively with a mixture of standard and complex plant data sets. Results suggested that features in complex sample matrices can be extracted effectively, and the constructed MS1 and MS/MS spectra can benefit in compound identification greatly. The efficiency of compound identification can be improved by about 20%. AntDAS-DDA can take full advantage of MS/MS information in multiple sample analyses and provide more MS/MS spectra than single sample analysis. A comparison with advanced data analysis tools indicated that AntDAS-DDA may be used as an alternative for routine UHPLC-HRMS-based untargeted metabolomics. AntDAS-DDA is freely available at http://www.pmdb.org.cn/antdasdda.",
                "authors": [
                    {
                        "name": "Fu H.-Y."
                    },
                    {
                        "name": "Guo X.-M."
                    },
                    {
                        "name": "Li S.-F."
                    },
                    {
                        "name": "Liu P.-P."
                    },
                    {
                        "name": "Lu P."
                    },
                    {
                        "name": "She Y."
                    },
                    {
                        "name": "Wang X.-C."
                    },
                    {
                        "name": "Yu Y.-J."
                    },
                    {
                        "name": "Zhang J.-N."
                    },
                    {
                        "name": "Zhao J.-J."
                    },
                    {
                        "name": "Zheng Q.-X."
                    }
                ],
                "citationCount": 8,
                "date": "2023-01-17T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "AntDAS-DDA: A New Platform for Data-Dependent Acquisition Mode-Based Untargeted Metabolomic Profiling Analysis with Advantage of Recognizing Insource Fragment Ions to Improve Compound Identification"
            },
            "pmid": "36599407"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
