{
    "additionDate": "2019-11-14T19:54:34Z",
    "biotoolsCURIE": "biotools:thurstonianIRT",
    "biotoolsID": "thurstonianIRT",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paul.buerkner@gmail.com",
            "name": "Paul-Christian Bürkner",
            "orcidid": "https://orcid.org/0000-0001-5765-8995",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Thurstonian IRT' | On the Statistical and Practical Limitations of Thurstonian IRT Models | Fit Thurstonian IRT models in R using Stan, lavaan, or Mplus | The thurstonianIRT package allows to fit various models from Item Response Theory (IRT) for forced-choice questionnaires, most notably the Thurstonian IRT model originally proposed by (Brown & Maydeu-Olivares, 2011)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/paul-buerkner/thurstonianIRT",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-28T12:52:55Z",
    "license": "GPL-3.0",
    "name": "thurstonianIRT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1177/0013164419832063",
            "metadata": {
                "abstract": "© The Author(s) 2019.Forced-choice questionnaires have been proposed to avoid common response biases typically associated with rating scale questionnaires. To overcome ipsativity issues of trait scores obtained from classical scoring approaches of forced-choice items, advanced methods from item response theory (IRT) such as the Thurstonian IRT model have been proposed. For convenient model specification, we introduce the thurstonianIRT R package, which uses Mplus, lavaan, and Stan for model estimation. Based on practical considerations, we establish that items within one block need to be equally keyed to achieve similar social desirability, which is essential for creating forced-choice questionnaires that have the potential to resist faking intentions. According to extensive simulations, measuring up to five traits using blocks of only equally keyed items does not yield sufficiently accurate trait scores and inter-trait correlation estimates, neither for frequentist nor for Bayesian estimation methods. As a result, persons’ trait scores remain partially ipsative and, thus, do not allow for valid comparisons between persons. However, we demonstrate that trait scores based on only equally keyed blocks can be improved substantially by measuring a sizable number of traits. More specifically, in our simulations of 30 traits, scores based on only equally keyed blocks were non-ipsative and highly accurate. We conclude that in high-stakes situations where persons are motivated to give fake answers, Thurstonian IRT models should only be applied to tests measuring a sizable number of traits.",
                "authors": [
                    {
                        "name": "Burkner P.-C."
                    },
                    {
                        "name": "Schulte N."
                    },
                    {
                        "name": "Holling H."
                    }
                ],
                "citationCount": 8,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Educational and Psychological Measurement",
                "title": "On the Statistical and Practical Limitations of Thurstonian IRT Models"
            },
            "pmcid": "PMC6713979",
            "pmid": "31488915"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}