{
    "accessibility": "Open access",
    "additionDate": "2022-11-05T19:16:35.396561Z",
    "biotoolsCURIE": "biotools:pla-more",
    "biotoolsID": "pla-more",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Lianlian Wu"
        },
        {
            "name": "Xiaochang Zhang"
        },
        {
            "name": "Xiaochen Bo"
        },
        {
            "name": "Qingyu Li",
            "orcidid": "https://orcid.org/0000-0002-7901-0433"
        }
    ],
    "description": "A Protein-Ligand Binding Affinity Prediction Model via Comprehensive Molecular Representations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QingyuLiaib/PLA-MoRe",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:22:50.601961Z",
    "license": "Not licensed",
    "name": "PLA-MoRe",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c00960",
            "metadata": {
                "abstract": "Accurately predicting the binding affinity of protein-ligand pairs is an essential part of drug discovery. Since wet laboratory experiments to determine the binding affinity are expensive and time-consuming, several computational methods for binding affinity prediction have been proposed. In the representation of compounds, most methods only focus on the structural properties such as SMILES and ignore the bioactive properties. In this study, we proposed a novel model named PLA-MoRe to predict protein-ligand binding affinity, which represents compounds based on both structural and bioactive properties and mainly contains three feature extractors. First, a structure feature extractor based on the graph isomorphism network was constructed to learn the representations of the molecular graphs. Second, we designed an Autoencoder-based bioactive feature extractor to integrate the multisource bioactive information including chemical, target, network, cellular, and clinical. The above two parts aimed to learn representations of compounds in terms of structures and bioactivities, respectively. Then, we constructed a sequence feature extractor to learn embeddings for protein sequences. The output of the three extractors was concatenated and fed into a fully connected network for affinity prediction. We compared PLA-MoRe with three state-of-the-art methods, and an ablation study was conducted to test the role of each part of the model. Further attention visualization showed that our model had the potential to locate the binding sites, which might help explain the mechanism of interaction. These results prove that PLA-MoRe is competitive and reliable. The resource codes are freely available at the GitHub repository https://github.com/QingyuLiaib/PLA-MoRe.",
                "authors": [
                    {
                        "name": "Bo X."
                    },
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wu L."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 5,
                "date": "2022-09-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "PLA-MoRe: A Protein-Ligand Binding Affinity Prediction Model via Comprehensive Molecular Representations"
            },
            "pmid": "36054653"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
