{
    "additionDate": "2020-01-14T09:44:38Z",
    "biotoolsCURIE": "biotools:Caregiver_Decision_Guide",
    "biotoolsID": "Caregiver_Decision_Guide",
    "confidence_flag": "low",
    "description": "Development and Implementation of the Family Caregiver Decision Guide.\n\nThe purpose of this website is to guide us through the decisions that we make every day as we care for a family member or friend who has a serious illness.\n\nI am a caregiver for a family member living with a life-limiting illness.\n\nI would like to plan for possible changes in caregiving for my family member.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Caregiver', 'FCDG'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.caregiverdecisionguide.ca",
    "lastUpdate": "2020-01-14T09:44:38Z",
    "name": "Caregiver Decision Guide",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1177/1049732319887166",
            "metadata": {
                "abstract": "© The Author(s) 2019.Care provided by family is the backbone of palliative care in Canada. The critical roles performed by caregivers can at the same time be intensely meaningful and intensely stressful. However, experiences of caregiving can be enhanced when caregivers feel they are making informed and reflective decisions about the options available to them. With this in mind, the purpose of this five-phase research project was to create a Family Caregiver Decision Guide (FCDG). The Guide entails four steps: thinking about the current caregiving situation, imagining how the caregiving situation may change, exploring available options, and considering best options if caregiving needs change. The FCDG was based on available evidence and was developed and refined using focus groups, cognitive interviewing, and a feasibility and acceptability study. Finally, an interactive version of the Guide was created for online use (https://www.caregiverdecisionguide.ca). In this article, we describe the development, evaluation, and utility of the FCDG.",
                "authors": [
                    {
                        "name": "Robinson C.A."
                    },
                    {
                        "name": "Bottorff J.L."
                    },
                    {
                        "name": "Pesut B."
                    },
                    {
                        "name": "Zerr J."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Qualitative Health Research",
                "title": "Development and Implementation of the Family Caregiver Decision Guide"
            },
            "pmid": "31744378"
        }
    ],
    "topic": [
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        }
    ]
}