{
    "additionDate": "2017-08-03T18:52:13Z",
    "biotoolsCURIE": "biotools:nasca",
    "biotoolsID": "nasca",
    "credit": [
        {
            "email": "nasca@cs.duke.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.duke.edu/donaldlab/index.php"
        }
    ],
    "description": "Automated program for side-chain resonance assignment and nuclear Overhauser effect (NOE) assignment from NOESY data. It does not require data from TOCSY experiments.NASCA casts the assignment problem into a Markov Random Field (MRF), and extends and applies combinatorial protein design algorithms to compute optimal assignments that best interpret the NMR data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cs.duke.edu/donaldlab/software/nasca/nasca_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://www.cs.duke.edu/donaldlab/software/nasca/index.php",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/nasca-20110516-side-chain-resonance-assignment-noe-assignment.html"
        }
    ],
    "name": "NASCA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "One bottleneck in NMR structure determination lies in the laborious and time-consuming process of side-chain resonance and NOE assignments. Compared to the well-studied backbone resonance assignment problem, automated side-chain resonance and NOE assignments are relatively less explored. Most NOE assignment algorithms require nearly complete side-chain resonance assignments from a series of through-bond experiments such as HCCH-TOCSY or HCCCONH. Unfortunately, these TOCSY experiments perform poorly on large proteins. To overcome this deficiency, we present a novel algorithm, called Nasca (NOE Assignment and Side-Chain Assignment), to automate both side-chain resonance and NOE assignments and to perform high-resolution protein structure determination in the absence of any explicit through-bond experiment to facilitate side-chain resonance assignment, such as HCCH-TOCSY. After casting the assignment problem into a Markov Random Field (MRF), Nasca extends and applies combinatorial protein design algorithms to compute optimal assignments that best interpret the NMR data. The MRF captures the contact map information of the protein derived from NOESY spectra, exploits the backbone structural information determined by RDCs, and considers all possible side-chain rotamers. The complexity of the combinatorial search is reduced by using a dead-end elimination (DEE) algorithm, which prunes side-chain resonance assignments that are provably not part of the optimal solution. Then an A*search algorithm is employed to find a set of optimal side-chain resonance assignments that best fit the NMR data. These side-chain resonance assignments are then used to resolve the NOE assignment ambiguity and compute high-resolution protein structures. Tests on five proteins show that Nasca assigns resonances for more than 90% of side-chain protons, and achieves about 80% correct assignments. The final structures computed using the NOE distance restraints assigned by Nasca have backbone RMSD 0.8-1.5 Å from the reference structures determined by traditional NMR approaches. © 2011 Springer Science+Business Media B.V.",
                "authors": [
                    {
                        "name": "Donald B.R."
                    },
                    {
                        "name": "Zeng J."
                    },
                    {
                        "name": "Zhou P."
                    }
                ],
                "citationCount": 12,
                "date": "2011-08-01T00:00:00Z",
                "journal": "Journal of Biomolecular NMR",
                "title": "Protein side-chain resonance assignment and NOE assignment using RDC-defined backbones without TOCSY data"
            },
            "pmid": "21706248"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}
