{
    "additionDate": "2019-11-14T18:39:46Z",
    "biotoolsCURIE": "biotools:AMi",
    "biotoolsID": "AMi",
    "confidence_flag": "tool",
    "description": "A GUI-based, open-source system for imaging samples in multi-well plates | Described here are instructions for building and using an inexpensive automated microscope (AMi) that has been specifically designed for viewing and imaging the contents of multi-well plates. The X, Y, Z translation stage is controlled through dedicated software (AMiGUI) that is being made freely available. Movements are controlled by an Arduino-based board running grbl, and the graphical user interface and image acquisition are controlled via a Raspberry Pi microcomputer running Python. Images can be written to the Raspberry Pi or to a remote disk. Plates with multiple sample wells at each row column position are supported, and a script file for automated z-stack depth-of-field enhancement is written along with the images",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://doi.org/10.1107/S2053230X19009853",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T13:16:08Z",
    "name": "AMi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1107/S2053230X19009853",
            "metadata": {
                "abstract": "© 2019 International Union of Crystallography.Described here are instructions for building and using an inexpensive automated microscope (AMi) that has been specifically designed for viewing and imaging the contents of multi-well plates. The X, Y, Z translation stage is controlled through dedicated software (AMiGUI) that is being made freely available. Movements are controlled by an Arduino-based board running grbl, and the graphical user interface and image acquisition are controlled via a Raspberry Pi microcomputer running Python. Images can be written to the Raspberry Pi or to a remote disk. Plates with multiple sample wells at each row/column position are supported, and a script file for automated z-stack depth-of-field enhancement is written along with the images. The graphical user interface and real-time imaging also make it easy to manually inspect and capture images of individual samples.",
                "authors": [
                    {
                        "name": "Andrew B."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-01T00:00:00Z",
                "journal": "Acta Crystallographica Section F: Structural Biology Communications",
                "title": "AMi: A GUI-based, open-source system for imaging samples in multi-well plates"
            },
            "pmcid": "PMC6688666",
            "pmid": "31397323"
        }
    ],
    "topic": [
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ],
    "validated": 1
}
