{
    "additionDate": "2021-01-18T09:28:31Z",
    "biotoolsCURIE": "biotools:adepro",
    "biotoolsID": "adepro",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nicole.mentenich@bayer.com",
            "name": "Nicole Mentenich",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Maintainer"
            ]
        }
    ],
    "description": "AdEPro (Animation of Adverse Event Profiles) is an app that (audio-)visualizes adverse events occurring in clinical trials. As this data is usually considered sensitive, this tool is provided as a stand-alone application that can be launched from any local machine on which the data is stored.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/adepro/adepro.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=adepro",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-21T13:09:27Z",
    "license": "GPL-3.0",
    "name": "Animation of Adverse Event Profiles (AdEPro)",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S43441-020-00178-4",
            "metadata": {
                "abstract": "© 2020, The Drug Information Association, Inc.Motivation: Reviewing the adverse event data collected in clinical trials is a lengthy and tedious process when these data are presented in the form of tables, data listings, and static graphs. Thus, to enable anyone interested in exploring adverse event data efficiently and relatively independently, we developed AdEPro, a compact, powerful, and easy-to-use interactive app. Description and Use of the App: AdEPro is an app for (audio-)visualizing adverse event data from clinical trials. The app dynamically displays the onset, severity, and development of selected adverse events on the individual subject level and on the treatment group level. This paper illustrates that there are numerous questions related to adverse events that can be approached by means of AdEPro, e.g., questions about temporal aspects of adverse events, associations between adverse events, and the influence of subject characteristics. AdEPro provides quick first answers to such questions; however, it does not provide statistical proof. Essentially, it acts as a versatile “hypothesis generator,” helping the user to decide whether further analyses are indicated. No programming knowledge is required for exploring data by means of AdEPro. However, the user needs some basic knowledge of the software R and of extracting data from a clinical data base. The software code is open source, allowing modifications and expansions of the app, if desired. Availability and Implementation: AdEPro can be freely obtained from https://cran.r-project.org/package=adepro. It runs on any computer on which R is installed. Patient data are stored and processed locally.",
                "authors": [
                    {
                        "name": "Becker B."
                    },
                    {
                        "name": "Mentenich N."
                    },
                    {
                        "name": "Tasto C."
                    }
                ],
                "date": "2020-11-01T00:00:00Z",
                "journal": "Therapeutic Innovation and Regulatory Science",
                "title": "AdEPro: Animation of Adverse Event Profiles—Presentation of an Easy-to-Use App for Visually Exploring Individual Study Data"
            },
            "pmid": "32529631"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
