{
    "additionDate": "2021-01-18T11:34:43Z",
    "biotoolsCURIE": "biotools:pmidcite",
    "biotoolsID": "pmidcite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wnd22@drexel.edu",
            "name": "Will Dampier",
            "typeEntity": "Person"
        }
    ],
    "description": "Evaluating retrieval qualities of Google Scholar and PubMed.\n\nAugment your PubMed literature search from the command-line by linking data downloaded from NIH's Open Citation Collection (NIH-OCC), which includes scientific influence, translation, and citation counts, with PubMed IDs (PMIDs), rather than clicking and clicking and clicking on Google Scholar Cited by N links.\n\n1) Get citation counts, given PMIDs.\n\nCommand-line users can immediately augment their PubMed search results using the pmidcite scripts and library, which download citation data from the National Institutes of Health Open Citation Collection (NIH-OCC) database using NIH's \"iCite\" Application Programming Interface (API). We have found PubMed plus NIH-OCC citation data combined using pmidcite is a \"Better\" experience than using Google Scholar if your research is in the health sciences and you are amenable to consider working from the command line.\n\n2) Sort citation counts, given PMIDs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dvklopfenstein/pmidcite",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-24T13:58:40Z",
    "license": "LGPL-3.0",
    "name": "pmidcite",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/JRSM.1456",
            "metadata": {
                "abstract": "© 2020 The Authors. Research Synthesis Methods published by John Wiley & Sons Ltd.We read with considerable interest the study by Gusenbauer and Haddaway (Gusenbauer and Haddaway, 2020, Research Synthesis Methods, doi:10.1002/jrsm.1378) comparing the systematic search qualities of 28 search systems, including Google Scholar (GS) and PubMed. Google Scholar and PubMed are the two most popular free academic search tools in biology and chemistry, with GS being the number one search tool in the world. Those academics using GS as their principal system for literature searches may be unaware of research which enumerates five critical features for scientific literature tools that greatly influenced Gusenbauer's 2020 study. Using this list as the framework for a targeted comparison between just GS and PubMed, we found stark differences which overwhelmingly favored PubMed. In this comment, we show that by comparing the characteristics of the two search tools, features that are particularly useful in one search tool, but are missing in the other, are strikingly spotlighted. One especially popular feature that ubiquitously appears in GS, but not in PubMed, is the forward citation search found under every citation as a clickable Cited by N link. We seek to improve the PubMed search experience using two approaches. First, we request that PubMed add Cited by N links, making them as omnipresent as the GS links. Second, we created an open-source command-line tool, pmidcite, which is used alongside PubMed to give information to researchers to help with the choice of the next paper to examine, analogous to how GS's Cited by N links help to guide users. Find pmidcite at https://github.com/dvklopfenstein/pmidcite.",
                "authors": [
                    {
                        "name": "Dampier W."
                    },
                    {
                        "name": "Klopfenstein D.V."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Research Synthesis Methods",
                "title": "Commentary to Gusenbauer and Haddaway 2020: Evaluating retrieval qualities of Google Scholar and PubMed"
            },
            "pmid": "33031632"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}
