
{
    "credit": [
        {
            "email": "ffzhou@ustc.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.biocuckoo.org/"
        },
        {
            "email": "xueyu@ustc.edu.cn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "luhualei@ustc.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://ssp.biocuckoo.org/faq.php"
        }
    ],
    "function": [
        {
            "note": "SUMO Substrate Prediction",
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Delphi"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Protein modifications",
                "uri": "http://edamontology.org/topic_0601"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/ssp-1-0-sumo-substrates-prediction.html"
        }
    ],
    "publication": [
        {
            "abstract": "Protein sumoylation is an important reversible post-translational modification of proteins in the nucleus, and it orchestrates a variety of the cellular processes. Genome-wide analysis of functional abundance and distribution of Small Ubiquitin-related MOdifier (SUMO) substrates may shed a light on how sumoylation is involved in nuclear biological processes and functions. Two interesting questions about sumoylation have emerged: (1) how many SUMO substrates exist in mammalian proteomes, such as human and mouse, (2) and what are their functions and how are they involved in a variety of biological processes? To address these two questions,we present an in silico genome-scale analysis for SUMO substrates in human. Based on the pattern recognition and phylogenetic conservation, we retrieved a list of 2683 potential SUMO substrates conserved in both human and mouse. Then, by functional enrichment analysis, we surveyed the over-represented GO terms and functional domains of them against the whole human proteome. Besides the consistence between our analyses and in vivo or in vitro work, the in silico predicted candidates also point to several potential roles of sumoylation, e.g., perception of sound. These potential SUMO substrates in human are of great value for further in vivo or in vitro experimental analysis. © 2005 Federation of European Biochemical Societies. Published by Elsevier B.V. All rights reserved.",
            "authors": [
                "Zhou F.",
                "Xue Y.",
                "Lu H.",
                "Chen G.",
                "Yao X."
            ],
            "cit_count": 39,
            "journal": "FEBS Letters",
            "pmid": "15922331",
            "title": "A genome-wide analysis of sumoylation-related biological processes and functions in human nucleus",
            "year": "2005-06-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ssp",
        "biotoolsID": "ssp",
        "description": "A software of SUMO Substrates Prediction. Small Ubiquitin-related MOdifier (SUMO) proteins are ubiquitously expressed in eukaryotic cells , and implicatedly regulate various cellular processes, e.g. stress responsing , cell-cycle progression, and gene expression , etc.",
        "homepage": "http://ssp.biocuckoo.org/",
        "name": "SSP"
    }
}