{
    "additionDate": "2019-11-14T18:20:15Z",
    "biotoolsCURIE": "biotools:HD-BET",
    "biotoolsID": "HD-BET",
    "confidence_flag": "tool",
    "description": "Automated brain extraction of multisequence MRI using artificial neural networks | Brain extraction is a critical preprocessing step in the analysis of neuroimaging studies conducted with magnetic resonance imaging (MRI) and influences the accuracy of downstream analyses. The majority of brain extraction algorithms are, however, optimized for processing healthy brains and thus frequently fail in the presence of pathologically altered brain or when applied to heterogeneous MRI datasets. Here we introduce a new, rigorously validated algorithm (termed HD-BET) relying on artificial neural networks that aim to overcome these limitations",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/NeuroAI-HD",
    "lastUpdate": "2020-12-07T09:24:57Z",
    "name": "HD-BET",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/HBM.24750",
            "metadata": {
                "abstract": "© 2019 The Authors. Human Brain Mapping published by Wiley Periodicals, Inc.Brain extraction is a critical preprocessing step in the analysis of neuroimaging studies conducted with magnetic resonance imaging (MRI) and influences the accuracy of downstream analyses. The majority of brain extraction algorithms are, however, optimized for processing healthy brains and thus frequently fail in the presence of pathologically altered brain or when applied to heterogeneous MRI datasets. Here we introduce a new, rigorously validated algorithm (termed HD-BET) relying on artificial neural networks that aim to overcome these limitations. We demonstrate that HD-BET outperforms six popular, publicly available brain extraction algorithms in several large-scale neuroimaging datasets, including one from a prospective multicentric trial in neuro-oncology, yielding state-of-the-art performance with median improvements of +1.16 to +2.50 points for the Dice coefficient and −0.66 to −2.51 mm for the Hausdorff distance. Importantly, the HD-BET algorithm, which shows robust performance in the presence of pathology or treatment-induced tissue alterations, is applicable to a broad range of MRI sequence types and is not influenced by variations in MRI hardware and acquisition parameters encountered in both research and clinical practice. For broader accessibility, the HD-BET prediction algorithm is made freely available (www.neuroAI-HD.org) and may become an essential component for robust, automated, high-throughput processing of MRI neuroimaging data.",
                "authors": [
                    {
                        "name": "Bendszus M."
                    },
                    {
                        "name": "Bonekamp D."
                    },
                    {
                        "name": "Brugnara G."
                    },
                    {
                        "name": "Heiland S."
                    },
                    {
                        "name": "Isensee F."
                    },
                    {
                        "name": "Kickingereder P."
                    },
                    {
                        "name": "Maier-Hein K.H."
                    },
                    {
                        "name": "Neuberger U."
                    },
                    {
                        "name": "Pflueger I."
                    },
                    {
                        "name": "Schell M."
                    },
                    {
                        "name": "Schlemmer H.-P."
                    },
                    {
                        "name": "Wick A."
                    },
                    {
                        "name": "Wick W."
                    }
                ],
                "citationCount": 35,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Human Brain Mapping",
                "title": "Automated brain extraction of multisequence MRI using artificial neural networks"
            },
            "pmid": "31403237"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
