
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell",
            "Python"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.One of the key challenges in the field of genetics is the inference of haplotypes from next generation sequencing data. The MinION Oxford Nanopore sequencer allows sequencing long reads, with the potential of sequencing complete genes, and even complete genomes of viruses, in individual reads. However, MinION suffers from high error rates, rendering the detection of true variants difficult. Here, we propose a new statistical approach named AssociVar, which differentiates between true mutations and sequencing errors from direct RNA/DNA sequencing using MinION. Our strategy relies on the assumption that sequencing errors will be dispersed randomly along sequencing reads, and hence will not be associated with each other, whereas real mutations will display a non-random pattern of association with other mutations. We demonstrate our approach using direct RNA sequencing data from evolved populations of the MS2 bacteriophage, whose small genome makes it ideal for MinION sequencing. AssociVar inferred several mutations in the phage genome, which were corroborated using parallel Illumina sequencing. This allowed us to reconstruct full genome viral haplotypes constituting different strains that were present in the sample. Our approach is applicable to long read sequencing data from any organism for accurate detection of bona fide mutations and inter-strain polymorphisms.",
            "authors": [
                "Harel N.",
                "Meir M.",
                "Gophna U.",
                "Stern A."
            ],
            "cit_count": 0,
            "doi": "10.1093/NAR/GKZ907",
            "journal": "Nucleic acids research",
            "pmid": "31665473",
            "title": "Direct sequencing of RNA with MinION Nanopore: detecting mutations based on associations",
            "year": "2019-12-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:AssociVar",
        "biotoolsID": "AssociVar",
        "description": "Direct sequencing of RNA with MinION Nanopore.\n\nFinding associated variants in MinION data.\n\nThis is the repository accompanying the paper Sequencing Complete Genomes of RNA Viruses With MinION Nanopore: Finding Associations Between Mutations (bioRxiv 2019; DOI https://doi.org/10.1101/575480) and is subject to the paper user license",
        "homepage": "https://github.com/SternLabTAU/AssociVar",
        "name": "AssociVar"
    }
}