{
    "additionDate": "2023-03-15T16:04:25.847639Z",
    "biotoolsCURIE": "biotools:cov2_tcr",
    "biotoolsID": "cov2_tcr",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jianxingxing@foxmail.com",
            "name": "Xingxing Jian",
            "typeEntity": "Person"
        },
        {
            "email": "xielu@sibpt.com",
            "name": "Lu Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "A web server for screening TCR CDR3 from TCR immune repertoire of COVID-19 patients and their recognized SARS-CoV-2 epitopes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "http://www.biostatistics.online/CoV2-TCR/#/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:55:19.078878Z",
    "license": "Other",
    "name": "CoV2-TCR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2023.01.038",
            "metadata": {
                "abstract": "Although multiple vaccines have been developed and widely administered, several severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) variants have been reported to evade immune responses and spread diffusely. Here, 108 RNA-seq files from coronavirus disease 2019 (COVID-19) patients and healthy donors (HD) were downloaded to extract their TCR immune repertoire by MiXCR. Those extracted TCR repertoire were compared and it was found that disease progression was related negatively with diversity and positively with clonality. Specifically, greater proportions of high-abundance clonotypes were observed in active and severe COVID-19 samples, probably resulting from strong stimulation of SARS-CoV-2 epitopes and a continued immune response in host. To investigate the specific recognition between TCR CDR3 and SARS-CoV-2 epitopes, we constructed an accurate classifier CoV2-TCR with an AUC of 0.967 in an independent dataset, which outperformed several similar tools. Based on this model, we observed a huge range in the number of those TCR CDR3 recognizing those different peptides, including 28 MHC-I epitopes from SARS-CoV-2 and 22 immunogenic peptides from SARS-CoV-2 variants. Interestingly, their proportions of high-abundance, low-abundance and rare clonotypes were close for each peptide. To expand the potential application of this model, we established the webserver, CoV2-TCR, in which users can obtain those recognizing CDR3 sequences from the TCR repertoire of COVID-19 patients based on the 9-mer peptides containing mutation site(s) on the four main proteins of SARS-CoV-2 variants. Overall, this study provides preliminary screening for candidate antigen epitopes and the TCR CDR3 that recognizes them, and should be helpful for vaccine design on SARS-CoV-2 variants.",
                "authors": [
                    {
                        "name": "Jian X."
                    },
                    {
                        "name": "Lu M."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "CoV2-TCR: A web server for screening TCR CDR3 from TCR immune repertoire of COVID-19 patients and their recognized SARS-CoV-2 epitopes"
            },
            "pmcid": "PMC9882952",
            "pmid": "36741787"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Vaccinology",
            "uri": "http://edamontology.org/topic_3966"
        }
    ]
}
