{
    "additionDate": "2020-01-09T18:21:34Z",
    "biotoolsCURIE": "biotools:QSAR",
    "biotoolsID": "QSAR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sryoon@snu.ac.kr",
            "name": "Sungroh Yoon",
            "orcidid": "https://orcid.org/0000-0002-2367-197X",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive ensemble in QSAR prediction for drug discovery.\n\nThere exist a new type of QSAR individual classifier that is an end-to-end neural network model based on 1D-CNN and RNN. It extracts sequential features automatically from the SMILES.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://data.snu.ac.kr/QSAR/",
    "lastUpdate": "2021-01-15T18:37:07Z",
    "name": "QSAR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3135-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Quantitative structure-activity relationship (QSAR) is a computational modeling method for revealing relationships between structural properties of chemical compounds and biological activities. QSAR modeling is essential for drug discovery, but it has many constraints. Ensemble-based machine learning approaches have been used to overcome constraints and obtain reliable predictions. Ensemble learning builds a set of diversified models and combines them. However, the most prevalent approach random forest and other ensemble approaches in QSAR prediction limit their model diversity to a single subject. Results: The proposed ensemble method consistently outperformed thirteen individual models on 19 bioassay datasets and demonstrated superiority over other ensemble approaches that are limited to a single subject. The comprehensive ensemble method is publicly available at http://data.snu.ac.kr/QSAR/. Conclusions: We propose a comprehensive ensemble method that builds multi-subject diversified models and combines them through second-level meta-learning. In addition, we propose an end-to-end neural network-based individual classifier that can automatically extract sequential features from a simplified molecular-input line-entry system (SMILES). The proposed individual models did not show impressive results as a single model, but it was considered the most important predictor when combined, according to the interpretation of the meta-learning.",
                "authors": [
                    {
                        "name": "Kwon S."
                    },
                    {
                        "name": "Bae H."
                    },
                    {
                        "name": "Jo J."
                    },
                    {
                        "name": "Yoon S."
                    }
                ],
                "citationCount": 7,
                "date": "2019-10-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Comprehensive ensemble in QSAR prediction for drug discovery"
            },
            "pmcid": "PMC6815455",
            "pmid": "31655545"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ],
    "validated": 1
}