{
    "additionDate": "2018-06-06T19:49:32Z",
    "biotoolsCURIE": "biotools:regresshaplo",
    "biotoolsID": "regresshaplo",
    "credit": [
        {
            "email": "sr286@georgetown.edu",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Penalized regression approach to haplotype reconstruction of viral populations arising in early HIV/SIV infection.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/SLeviyang/RegressHaplo"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype reconstruction",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SLeviyang/RegressHaplo",
    "language": [
        "MATLAB",
        "R"
    ],
    "lastUpdate": "2024-11-25T14:39:10.867691Z",
    "name": "RegressHaplo",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx187",
            "metadata": {
                "abstract": "Motivation: Next generation sequencing (NGS) has been increasingly applied to characterize viral evolution during HIV and SIV infections. In particular, NGS datasets sampled during the initial months of infection are characterized by relatively low levels of diversity as well as convergent evolution at multiple loci dispersed across the viral genome. Consequently, fully characterizing viral evolution from NGS datasets requires haplotype reconstruction across large regions of the viral genome. Existing haplotype reconstruction algorithms have not been developed with the particular characteristics of early HIV/SIV infection in mind, raising the possibility that better performance could be achieved through a specifically designed algorithm. Results: Here, we introduce a haplotype reconstruction algorithm, RegressHaplo, specifically designed for low diversity and convergent evolution regimes. The algorithm uses a penalized regression that balances a data fitting term with a penalty term that encourages solutions with few haplotypes. The regression covariates are a large set of potential haplotypes and fitting the regression is made computationally feasible by the low diversity setting. Using simulated and in vivo datasets, we compare RegressHaplo to PredictHaplo and QuRe, two existing haplotype reconstruction algorithms. RegressHaplo performs better than these algorithms on simulated datasets with relatively low diversity levels. We suggest RegressHaplo as a novel tool for the investigation of early infection HIV/SIV datasets and, more generally, low diversity viral NGS datasets. Contact: sr286@georgetown.edu",
                "authors": [
                    {
                        "name": "Griva I."
                    },
                    {
                        "name": "Ita S."
                    },
                    {
                        "name": "Johnson W.E."
                    },
                    {
                        "name": "Leviyang S."
                    }
                ],
                "citationCount": 14,
                "date": "2017-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A penalized regression approach to haplotype reconstruction of viral populations arising in early HIV/SIV infection"
            },
            "pmcid": "PMC5870767",
            "pmid": "28379346"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
