{
    "additionDate": "2021-01-18T10:21:49Z",
    "biotoolsCURIE": "biotools:dsaas",
    "biotoolsID": "dsaas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alessio.mancini@unicam.it",
            "name": "Alessio Mancini",
            "typeEntity": "Person"
        }
    ],
    "description": "DSaaS (Data Science as a Service) is an easy-to-use cloud platform well suited for hospital structures, where healthcare operators might not have specific competences in using programming languages but still, they do need to analyze data as a continuous process. It is able to predict patients risk to contract a multidrug resistant urinary tract infection (MDR UTI) after hospitalization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://dsaas-demo.shinyapps.io/Server/",
    "lastUpdate": "2021-03-03T20:03:19Z",
    "name": "DSaaS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03566-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The scope of this work is to build a Machine Learning model able to predict patients risk to contract a multidrug resistant urinary tract infection (MDR UTI) after hospitalization. To achieve this goal, we used different popular Machine Learning tools. Moreover, we integrated an easy-to-use cloud platform, called DSaaS (Data Science as a Service), well suited for hospital structures, where healthcare operators might not have specific competences in using programming languages but still, they do need to analyze data as a continuous process. Moreover, DSaaS allows the validation of data analysis models based on supervised Machine Learning regression and classification algorithms. Results: We used DSaaS on a real antibiotic stewardship dataset to make predictions about antibiotic resistance in the Clinical Pathology Operative Unit of the Principe di Piemonte Hospital in Senigallia, Marche, Italy. Data related to a total of 1486 hospitalized patients with nosocomial urinary tract infection (UTI). Sex, age, age class, ward and time period, were used to predict the onset of a MDR UTI. Machine Learning methods such as Catboost, Support Vector Machine and Neural Networks were utilized to build predictive models. Among the performance evaluators, already implemented in DSaaS, we used accuracy (ACC), area under receiver operating characteristic curve (AUC-ROC), area under Precision-Recall curve (AUC-PRC), F1 score, sensitivity (SEN), specificity and Matthews correlation coefficient (MCC). Catboost exhibited the best predictive results (MCC 0.909; SEN 0.904; F1 score 0.809; AUC-PRC 0.853, AUC-ROC 0.739; ACC 0.717) with the highest value in every metric. Conclusions: the predictive model built with DSaaS may serve as a useful support tool for physicians treating hospitalized patients with a high risk to acquire MDR UTIs. We obtained these results using only five easy and fast predictors accessible for each patient hospitalization. In future, DSaaS will be enriched with more features like unsupervised Machine Learning techniques, streaming data analysis, distributed calculation and big data storage and management to allow researchers to perform a complete data analysis pipeline. The DSaaS prototype is available as a demo at the following address: https://dsaas-demo.shinyapps.io/Server/.",
                "authors": [
                    {
                        "name": "De Leone R."
                    },
                    {
                        "name": "Mancini A."
                    },
                    {
                        "name": "Marcelli E."
                    },
                    {
                        "name": "Merelli E."
                    },
                    {
                        "name": "Piangerelli M."
                    },
                    {
                        "name": "Pucciarelli S."
                    },
                    {
                        "name": "Vito L."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Machine learning models predicting multidrug resistant urinary tract infections using \"dsaaS\""
            },
            "pmcid": "PMC7446147",
            "pmid": "32838752"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
