{
    "additionDate": "2018-07-28T09:13:45Z",
    "biotoolsCURIE": "biotools:sidr",
    "biotoolsID": "sidr",
    "credit": [
        {
            "email": "jlfierst@ua.edu",
            "name": "Janna L. Fierst",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool to filter Next Generation Sequencing (NGS) data based on a chosen target organism. It uses data fron BLAST (or similar classifiers) to train a Decision Tree model to classify sequence data as either belonging to the target organism, or belonging to something else. This classification can be used to filter the data for later assembly.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sidr.readthedocs.io/en/latest/#documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://sidr.readthedocs.io/en/latest/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "SIDR",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1941-0",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: High-throughput sequencing has made it theoretically possible to obtain high-quality de novo assembled genome sequences but in practice DNA extracts are often contaminated with sequences from other organisms. Currently, there are few existing methods for rigorously decontaminating eukaryotic assemblies. Those that do exist filter sequences based on nucleotide similarity to contaminants and risk eliminating sequences from the target organism. Results: We introduce a novel application of an established machine learning method, a decision tree, that can rigorously classify sequences. The major strength of the decision tree is that it can take any measured feature as input and does not require a priori identification of significant descriptors. We use the decision tree to classify de novo assembled sequences and compare the method to published protocols. Conclusions: A decision tree performs better than existing methods when classifying sequences in eukaryotic de novo assemblies. It is efficient, readily implemented, and accurately identifies target and contaminant sequences. Importantly, a decision tree can be used to classify sequences according to measured descriptors and has potentially many uses in distilling biological datasets.",
                "authors": [
                    {
                        "name": "Fierst J.L."
                    },
                    {
                        "name": "Murdock D.A."
                    }
                ],
                "date": "2017-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Decontaminating eukaryotic genome assemblies with machine learning"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}