{
    "additionDate": "2018-08-27T15:21:32Z",
    "biotoolsCURIE": "biotools:consent",
    "biotoolsID": "consent",
    "credit": [
        {
            "email": "berenger@bioreg.kyushu-u.ac.jp",
            "name": "Francois Berenger",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Ligand-based virtual screening with consensus queries.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/UnixJunkie/consent"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual ligand screening",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UnixJunkie/consent",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "Consent",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0248-5",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: In ligand-based virtual screening experiments, a known active ligand is used in similarity searches to find putative active compounds for the same protein target. When there are several known active molecules, screening using all of them is more powerful than screening using a single ligand. A consensus query can be created by either screening serially with different ligands before merging the obtained similarity scores, or by combining the molecular descriptors (i.e. chemical fingerprints) of those ligands. Results: We report on the discriminative power and speed of several consensus methods, on two datasets only made of experimentally verified molecules. The two datasets contain a total of 19 protein targets, 3776 known active and ~ 2 × 106 inactive molecules. Three chemical fingerprints are investigated: MACCS 166 bits, ECFP4 2048 bits and an unfolded version of MOLPRINT2D. Four different consensus policies and five consensus sizes were benchmarked. Conclusions: The best consensus method is to rank candidate molecules using the maximum score obtained by each candidate molecule versus all known actives. When the number of actives used is small, the same screening performance can be approached by a consensus fingerprint. However, if the computational exploration of the chemical space is limited by speed (i.e. throughput), a consensus fingerprint allows to outperform this consensus of scores.",
                "authors": [
                    {
                        "name": "Berenger F."
                    },
                    {
                        "name": "Vu O."
                    },
                    {
                        "name": "Meiler J."
                    }
                ],
                "citationCount": 6,
                "date": "2017-11-28T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Consensus queries in ligand-based virtual screening experiments"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Protein-ligand interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}