{
    "additionDate": "2021-01-18T07:42:19Z",
    "biotoolsCURIE": "biotools:ccsbase",
    "biotoolsID": "ccsbase",
    "confidence_flag": "tool",
    "description": "CCSbase is an all-in-one web interface for querying the CCS database and accessing the predictive model to support unknown compound identifications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                }
            ]
        }
    ],
    "homepage": "https://CCSbase.net",
    "lastUpdate": "2021-02-09T08:11:49Z",
    "name": "CCSbase",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.9B05772",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Identification of unknowns is a bottleneck for large-scale untargeted analyses like metabolomics or drug metabolite identification. Ion mobility-mass spectrometry (IM-MS) provides rapid two-dimensional separation of ions based on their mobility through a neutral buffer gas. The mobility of an ion is related to its collision cross section (CCS) with the buffer gas, a physical property that is determined by the size and shape of the ion. This structural dependency makes CCS a promising characteristic for compound identification, but this utility is limited by the availability of high-quality reference CCS values. CCS prediction using machine learning (ML) has recently shown promise in the field, but accurate and broadly applicable models are still lacking. Here we present a novel ML approach that employs a comprehensive collection of CCS values covering a wide range of chemical space. Using this diverse database, we identified the structural characteristics, represented by molecular quantum numbers (MQNs), that contribute to variance in CCS and assessed the performance of a variety of ML algorithms in predicting CCS. We found that by breaking down the chemical structural diversity using unsupervised clustering based on the MQNs, specific and accurate prediction models for each cluster can be trained, which showed superior performance than a single model trained with all data. Using this approach, we have robustly trained and characterized a CCS prediction model with high accuracy on diverse chemical structures. An all-in-one web interface (https://CCSbase.net) was built for querying the CCS database and accessing the predictive model to support unknown compound identifications.",
                "authors": [
                    {
                        "name": "Ross D.H."
                    },
                    {
                        "name": "Cho J.H."
                    },
                    {
                        "name": "Xu L."
                    }
                ],
                "citationCount": 10,
                "date": "2020-03-17T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Breaking down Structural Diversity for Comprehensive Prediction of Ion-Neutral Collision Cross Sections"
            },
            "pmid": "32096630"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}