{
    "additionDate": "2015-12-02T16:31:52Z",
    "biotoolsCURIE": "biotools:norsnet",
    "biotoolsID": "norsnet",
    "collectionID": [
        "PredictProtein",
        "Rostlab tools"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "help@predictprotein.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Jinfeng Liu",
            "orcidid": "http://orcid.org/0000-0002-0343-8222",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "Avner Schlessinger",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Columbia University",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Grant 2R01-LM07329-01 from the National Library of Medicine",
            "typeEntity": "Funding agency",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "RostLab",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "University of California San Diego",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "Burkhard Rost",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Identification unstructured loops from sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://rostlab.org/owiki/index.php/Norsnet"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://rostlab.org/owiki/index.php/Packages"
        },
        {
            "type": "Source code",
            "url": "https://rostlab.org/owiki/index.php/Packages"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence record",
                        "uri": "http://edamontology.org/data_2886"
                    }
                }
            ],
            "note": "NORSnet is a neural network based method that focuses on the identification of unstructured loops.\n\nNORSnet was trained to distinguish between very long contiguous segments with non-regular secondary structure (NORS regions) and well-folded proteins. NORSnet was trained on predicted information rather than on experimental data. Therefore, it was optimized on a large data, which is not biased by today's experimental means of capturing disorder. Thus, NORSnet reached into regions in sequence space that are not covered by the specialized disorder predictors. One disadvantage of this approach is that it is not optimal for the identification of the \"average\" disordered region. Protein amino-acid sequence in fasta format",
            "operation": [
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein report",
                        "uri": "http://edamontology.org/data_0896"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://ppopen.informatik.tu-muenchen.de/",
    "lastUpdate": "2024-11-25T14:18:37.601604Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://rostlab.org/owiki/index.php/Packages"
        }
    ],
    "name": "NorsNet",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "RostLab",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.0030140",
            "metadata": {
                "abstract": "Natively unstructured or disordered protein regions may increase the functional complexity of an organism; they are particularly abundant in eukaryotes and often evade structure determination. Many computational methods predict unstructured regions by training on outliers in otherwise well-ordered structures. Here, we introduce an approach that uses a neural network in a very different and novel way. We hypothesize that very long contiguous segments with nonregular secondary structure (NORS regions) differ significantly from regular, well-structured loops, and that a method detecting such features could predict natively unstructured regions. Training our new method, NORSnet, on predicted information rather than on experimental data yielded three major advantages: it removed the overlap between testing and training, it systematically covered entire proteomes, and it explicitly focused on one particular aspect of unstructured regions with a simple structural interpretation, namely that they are loops. Our hypothesis was correct: well-structured and unstructured loops differ so substantially that NORSnet succeeded in their distinction. Benchmarks on previously used and new experimental data of unstructured regions revealed that NORSnet performed very well. Although it was not the best single prediction method, NORSnet was sufficiently accurate to flag unstructured regions in proteins that were previously not annotated. In one application, NORSnet revealed previously undetected unstructured regions in putative targets for structural genomics and may thereby contribute to increasing structural coverage of large eukaryotic families. NORSnet found unstructured regions more often in domain boundaries than expected at random. In another application, we estimated that 50%-70% of all worm proteins observed to have more than seven protein-protein interaction partners have unstructured regions. The comparative analysis between NORSnet and DISOPRED2 suggested that long unstructured loops are a major part of unstructured regions in molecular networks. © 2007 Schlessinger et al.",
                "authors": [
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Rost B."
                    },
                    {
                        "name": "Schlessinger A."
                    }
                ],
                "citationCount": 85,
                "date": "2007-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Natively unstructured loops differ from other loops"
            },
            "pmcid": "PMC1924875",
            "pmid": "17658943",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.16"
    ]
}
