{
    "additionDate": "2018-08-22T10:50:08Z",
    "biotoolsCURIE": "biotools:pssa",
    "biotoolsID": "pssa",
    "credit": [
        {
            "email": "iti@udistrital.edu.co",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Pathogen Sequence Signature Analysis. Computational analysis of nucleotides sequences of different microorganisms. It uses phylogenetic analysis to identify the Serotype/Clade and Genotype of selected microorganisms. Analyses may be performed on very large data sets. The report of the analysis per sequence contains a brief overview of the nucleotide changes that produce an amino acid change, followed by details of the phylogenetic analysis including a phylogenetic tree.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://pssa.itiud.org",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/florezfernandez/pssa"
        }
    ],
    "name": "PSSA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.10393.1",
            "metadata": {
                "abstract": "© 2017 Salvatierra K and Florez H. Introduction The chikungunya virus (CHIKV) is an arbovirus vectored by Aedes mosquitoes that infects humans in tropical and sub-tropical areas of Asia and Africa. Recently, outbreaks have been reported in tropical and sub-tropical areas of countries that were previously unaffected (e.g., Brazil, Colombia). Currently, the following geographical genotypes have been identified through phylogenetic analysis of CHIKV E1 gene sequences: the West African (WAf), East/Central/South African (ECSA), and Asian genotypes. Outbreaks in a geographical area can happen with the same or different genotypes. Determining which genotypes are circulating in an outbreak is important for public health management. Objectives To create a computer-based system available online that is suitable for detecting changes in CHIKV nucleotide and amino acid sequences and identifying their corresponding geographical genotype. Methods We used several computer frameworks, tools, programming languages, algorithms, and infrastructure systems to build a software tool that analyzes changes in nucleotide and amino acid sequences and identifies different geographical genotypes through phylogenetic analysis. Results We have built an online software tool called Pathogen Sequence Signature Analysis (PSSA) that allows researchers to analyze nucleotide and amino acid sequence variations between sample CHIKV sequences taken from infected patients and obtained through conventional Sanger sequencing, to identify their corresponding geographical genotype. Conclusion PSSA is able to analyze sequences in a simple and effective manner, and includes proper documentation (i.e., UML diagrams) and also basic examples that serve to test the algorithm. Furthermore, PSSA provides various ways to visualize the data in order to aid understanding and interpretation of results. Results provided by PSSA will be useful for the identification of circulating CHIKV genotypes and public health surveillance.",
                "authors": [
                    {
                        "name": "Salvatierra K."
                    },
                    {
                        "name": "Florez H."
                    }
                ],
                "citationCount": 1,
                "date": "2017-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Pathogen Sequence Signature Analysis (PSSA): A software tool for analyzing sequences to identify microorganism genotypes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}