{
    "additionDate": "2022-10-11T07:18:25.895479Z",
    "biotoolsCURIE": "biotools:srf",
    "biotoolsID": "srf",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/srf/"
        }
    ],
    "description": "Spectral Repeat Finder (SRF) is a program to find repeats through an analysis of the power spectrum of a given DNA sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/srf/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/srf/",
    "lastUpdate": "2022-10-11T07:18:31.217961Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/srf/"
        }
    ],
    "name": "srf",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bth103",
            "metadata": {
                "abstract": "Motivation: Repetitive DNA sequences, besides having a variety of regulatory functions, are one of the principal causes of genomic instability. Understanding their origin and evolution is of fundamental importance for genome studies. The identification of repeats and their units helps in deducing the intra-genomic dynamics as an important feature of comparative genomics. A major difficulty in identification of repeats arises from the fact that the repeat units can be either exact or imperfect, in tandem or dispersed, and of unspecified length. Results: The Spectral Repeat Finder program circumvents these problems by using a discrete Fourier transformation to identify significant periodicities present in a sequence. The specific regions of the sequence that contribute to a given periodicity are located through a sliding window analysis, and an exact search method is then used to find the repetitive units. Efficient and complete detection of repeats is provided together with interactive and detailed visualization of the spectral analysis of input sequence. We demonstrate the utility of our method with various examples that contain previously unannotated repeats. A Web server has been developed for convenient access to the automated program. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Issac B."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Ramaswamy R."
                    },
                    {
                        "name": "Sharma D."
                    }
                ],
                "citationCount": 139,
                "date": "2004-06-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Spectral repeat finders (SRF): Identification of repetitive sequences using Fourier transformation"
            },
            "pmid": "14976032"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
