{
    "accessibility": "Open access",
    "additionDate": "2023-08-11T06:04:10.440349Z",
    "biotoolsCURIE": "biotools:multiwgcna",
    "biotoolsID": "multiwgcna",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bfogel@ucla.edu",
            "name": "Brent L. Fogel",
            "orcidid": "https://orcid.org/0000-0001-9831-1576",
            "typeEntity": "Person"
        },
        {
            "name": "Dario Tommasini",
            "typeEntity": "Person"
        }
    ],
    "description": "R package for deep mining gene co-expression networks in multi-trait expression data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fogellab/multiWGCNA",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-08-11T06:04:10.443017Z",
    "name": "multiWGCNA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05233-Z",
            "metadata": {
                "abstract": "Background: Gene co-expression networks represent modules of genes with shared biological function, and have been widely used to model biological pathways in gene expression data. Co-expression networks associated with a specific trait can be constructed and identified using weighted gene co-expression network analysis (WGCNA), which is especially useful for the study of transcriptional signatures in disease. WGCNA networks are typically constructed using both disease and wildtype samples, so molecular pathways associated with disease are identified. However, it would be advantageous to study such co-expression networks in their disease context across spatiotemporal conditions, but currently there is no comprehensive software implementation for this type of analysis. Results: Here, we introduce a WGCNA-based procedure, multiWGCNA, that is tailored to datasets with variable spatial or temporal traits. As well as constructing the combined network, multiWGCNA also generates a network for each condition separately, and subsequently maps these modules between and across designs, and performs relevant downstream analyses, including module-trait correlation and module preservation. When applied to astrocyte-specific RNA-sequencing (RNA-seq) data from various brain regions of mice with experimental autoimmune encephalitis, multiWGCNA resolved the de novo formation of the neurotoxic astrocyte transcriptional program exclusively in the disease setting. Using time-course RNA-seq from mice with tau pathology (rTg4510), we demonstrate how multiWGCNA can also be used to study the temporal evolution of pathological modules over the course of disease progression. Conclusion: The multiWGCNA R package can be applied to expression data with two dimensions, which is especially useful for the study of disease-associated modules across time or space. The source code and functions are freely available at: https://github.com/fogellab/multiWGCNA.",
                "authors": [
                    {
                        "name": "Fogel B.L."
                    },
                    {
                        "name": "Tommasini D."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "multiWGCNA: an R package for deep mining gene co-expression networks in multi-trait expression data"
            },
            "pmcid": "PMC10039544",
            "pmid": "36964502"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
