{
    "additionDate": "2017-08-03T18:47:37Z",
    "biotoolsCURIE": "biotools:klab-pcr",
    "biotoolsID": "klab-pcr",
    "credit": [
        {
            "email": "steve@compbio.med.wayne.edu",
            "name": "Stephen A.Krawetz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://compbio.med.wayne.edu/"
        }
    ],
    "description": "Tool that implements two algorithms to quantify the starting template in a PCR reaction. The first is a modified Ct strategy that assumes an ideal efficiency and is calculated for reference. The second employs a parametric fitting approach to construct a non-linear approximation to the reaction efficiency that is regressed backwards to establish a peak efficiency.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://compbio.med.wayne.edu/software/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://compbio.med.wayne.edu/software/index.html",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/klab-pcr-quantify-starting-template-pcr-reaction.html"
        }
    ],
    "name": "KLab-PCR",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The quantitative real-time polymerase chain reaction (PCR) remains a cornerstone technique in gene expression analysis and sequence characterization. Despite the importance of the approach to experimental biology, the confident assignment of reaction efficiency to the early cycles of real-time PCR reactions remains problematic. Considerable noise may be generated when few cycles in the amplification are available to estimate peak efficiency. An alternate approach that uses data from beyond the log-linear amplification phase is explored in this article with the aim of reducing noise and adding confidence to efficiency estimates. PCR reaction efficiency is regressed to estimate the per-cycle profile of an asymptotically departed peak efficiency even when this is not closely approximated in the measurable cycles. The process can be repeated over replicates to develop a robust estimate of peak reaction efficiency. This leads to an estimate of the maximum reaction efficiency that may be considered primer design specific. Using a series of biological scenarios, we demonstrate that this approach can provide an accurate estimate of initial template concentration. © 2008 Elsevier Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "Platts A.E."
                    },
                    {
                        "name": "Johnson G.D."
                    },
                    {
                        "name": "Linnemann A.K."
                    },
                    {
                        "name": "Krawetz S.A."
                    }
                ],
                "citationCount": 18,
                "date": "2008-09-15T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "Real-time PCR quantification using a variable reaction efficiency model"
            },
            "pmid": "18570886"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        }
    ],
    "validated": 1
}