{
    "additionDate": "2017-12-18T00:10:52Z",
    "biotoolsCURIE": "biotools:pepexplorer",
    "biotoolsID": "pepexplorer",
    "credit": [
        {
            "email": "felipe@leprevost.com.br",
            "name": "Felipe da Veiga Leprevost",
            "orcidid": "http://orcid.org/0000-0002-8228-5374",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ],
            "url": "http://www.leprevost.com.br/"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://proteomics.fiocruz.br/"
        }
    ],
    "description": "PepExplorer – Statistically Filtering and Organising de novo Sequencing Results",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.mcponline.org/content/13/9/2480"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "http://proteomics.fiocruz.br/software.html",
    "language": [
        "C#"
    ],
    "lastUpdate": "2019-01-10T15:02:04Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pepexplorer-0-1-0-52-statistically-filtering-and-organising-de-novo-sequencing-results.html"
        }
    ],
    "name": "PepExplorer",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1074/mcp.M113.037002",
            "metadata": {
                "abstract": "© 2014 by The American Society for Biochemistry and Molecular Biology, Inc.Peptide spectrum matching is the current gold standard for protein identification via mass-spectrometry-based proteomics. Peptide spectrum matching compares experimental mass spectra against theoretical spectra generated from a protein sequence database to perform identification, but protein sequences not present in a database cannot be identified unless their sequences are in part conserved. The alternative approach, de novo sequencing, can make it possible to infer a peptide sequence directly from a mass spectrum, but interpreting long lists of peptide sequences resulting from large-scale experiments is not trivial. With this as motivation, PepExplorer was developed to use rigorous pattern recognition to assemble a list of homologue proteins using de novo sequencing data coupled to sequence alignment to allow biological interpretation of the data. PepExplorer can read the output of various widely adopted de novo sequencing tools and converge to a list of proteins with a global false-discovery rate. To this end, it employs a radial basis function neural network that considers precursor charge states, de novo sequencing scores, peptide lengths, and alignment scores to select similar protein candidates, from a target-decoy database, usually obtained from phylogenetically related species. Alignments are performed using a modified Smith-Waterman algorithm tailored for the task at hand. We verified the effectiveness of our approach using a reference set of identifications generated by ProLuCID when searching for Pyrococcus furiosus mass spectra on the corresponding NCBI RefSeq database. We then modified the sequence database by swapping amino acids until ProLuCID was no longer capable of identifying any proteins. By searching the mass spectra using PepExplorer on the modified database, we were able to recover most of the identifications at a 1% false-discovery rate. Finally, we employed PepExplorer to disclose a comprehensive proteomic assessment of the Bothrops jararaca plasma, a known biological source of natural inhibitors of snake toxins. PepExplorer is integrated into the PatternLab for Proteomics environment, which makes available various tools for downstream data analysis, including resources for quantitative and differential proteomics.",
                "authors": [
                    {
                        "name": "Barbosa V.C."
                    },
                    {
                        "name": "Carvalho P.C."
                    },
                    {
                        "name": "Junqueira M."
                    },
                    {
                        "name": "Leprevost F.V."
                    },
                    {
                        "name": "Lima D.B."
                    },
                    {
                        "name": "Melani R."
                    },
                    {
                        "name": "Perales J."
                    },
                    {
                        "name": "Valente R.H."
                    },
                    {
                        "name": "Yates J.R."
                    }
                ],
                "citationCount": 26,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "PepExplorer: A similarity-driven tool for analyzing de novo sequencing results"
            },
            "pmcid": "PMC4159663",
            "pmid": "24878498",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "0.1.0.78"
    ]
}
