{
    "additionDate": "2022-10-19T19:47:53.834145Z",
    "biotoolsCURIE": "biotools:hypix",
    "biotoolsID": "hypix",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "dlangenk@cebitec.uni-bielefeld.de",
            "name": "Daniel Langenkämper",
            "orcidid": "https://orcid.org/0000-0003-1857-5040",
            "typeEntity": "Person"
        },
        {
            "name": "Tim Wilhelm Nattkemper"
        }
    ],
    "description": "Exploring time series of hyperspectral images for cold water coral stress response analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://webserver.biodtmin.projects.bi.denbi.de/hypix",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:26:40.166321Z",
    "name": "HypIX",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0272408",
            "metadata": {
                "abstract": "Hyperspectral imaging (HSI) is a promising technology for environmental monitoring with a lot of undeveloped potential due to the high dimensionality and complexity of the data. If temporal effects are studied, such as in a monitoring context, the analysis becomes more challenging as time is added to the dimensions of space (image coordinates) and wavelengths. We conducted a series of laboratory experiments to investigate the impact of different stressor exposure patterns on the spectrum of the cold water coral Desmophyllum pertusum. 65 coral samples were divided into 12 groups, each group being exposed to different types and levels of particles. Hyperspectral images of the coral samples were collected at four time points from prior to exposure to 6 weeks after exposure. To investigate the relationships between the corals’ spectral signatures and controlled experimental parameters, a new software tool for interactive visual exploration was developed and applied, the HypIX (Hyperspectral Image eXplorer) web tool. HypIX combines principles from exploratory data analysis, information visualization and machine learning-based dimension reduction. This combination enables users to select regions of interest (ROI) in all dimensions (2D space, time point and spectrum) for a flexible integrated inspection. We propose two HypIX workflows to find relationships in time series of hyperspectral datasets, namely morphology-based filtering workflow and embedded driven response analysis workflow. With these HypIX workflows three users identified different temporal and spatial patterns in the spectrum of corals exposed to different particle stressor conditions. Corals exposed to particles tended to have a larger change rate than control corals, which was evident as a shifted spectrum. The responses, however, were not uniform for coral samples undergoing the same exposure treatments, indicating individual tolerance levels. We also observed a good inter-observer agreement between the three HyPIX users, indicating that the proposed workflow can be applied to obtain reproducible HSI analysis results.",
                "authors": [
                    {
                        "name": "Baussant T."
                    },
                    {
                        "name": "Bergsagel O."
                    },
                    {
                        "name": "Frost T.K."
                    },
                    {
                        "name": "Hansen I.M."
                    },
                    {
                        "name": "Langenkamper D."
                    },
                    {
                        "name": "Mogstad A.A."
                    },
                    {
                        "name": "Nattkemper T.W."
                    },
                    {
                        "name": "Nilssen I."
                    }
                ],
                "citationCount": 2,
                "date": "2022-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Exploring time series of hyperspectral images for cold water coral stress response analysis"
            },
            "pmcid": "PMC9359567",
            "pmid": "35939502"
        }
    ],
    "toolType": [
        "Script",
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
