{
    "accessibility": "Open access",
    "additionDate": "2019-03-16T17:36:23Z",
    "biotoolsCURIE": "biotools:4DGenome",
    "biotoolsID": "4DGenome",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "4dgenome@gmail.com",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Curated database of chromatin interaction data covering five organisms: Homo sapiens, Mus musculus, Drosophila melanogaster, Plasmodium falciparum, and Saccharomyces cerevisiae.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://4dgenome.research.chop.edu/About.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://4dgenome.research.chop.edu/Download.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://4dgenome.research.chop.edu",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "CC-BY-NC-3.0",
    "maturity": "Mature",
    "name": "4DGenome",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv158",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: The 3D structure of the genome plays a critical role in regulating gene expression. Recent progress in mapping technologies for chromatin interactions has led to a rapid increase in this kind of interaction data. This trend will continue as research in this burgeoning field intensifies. Results: We describe the 4DGenome database that stores chromatin interaction data compiled through comprehensive literature curation. The database currently covers both low- and highthroughput assays, including 3C, 4C-Seq, 5C, Hi-C, ChIA-PET and Capture-C. To complement the set of interactions detected by experimental assays, we also include interactions predicted by a recently developed computational method with demonstrated high accuracy. The database currently contains ∼8 million records, covering 102 cell/tissue types in five organisms. Records in the database are described using a standardized file format, facilitating data exchange. The vast major of the interactions were assigned a confidence score. Using the web interface, users can query and download database records via a number of annotation dimensions. Query results can be visualized along with other genomics datasets via links to the UCSC genome browser. We anticipate that 4DGenome will be a valuable resource for investigating the spatial structure-and-function relationship of genomes.",
                "authors": [
                    {
                        "name": "Teng L."
                    },
                    {
                        "name": "He B."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Tan K."
                    }
                ],
                "citationCount": 56,
                "date": "2015-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "4DGenome: A comprehensive database of chromatin interactions"
            },
            "pmcid": "PMC4514924",
            "pmid": "25788621",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Immunoprecipitation experiment",
            "uri": "http://edamontology.org/topic_3656"
        }
    ],
    "validated": 1
}