{
    "additionDate": "2018-05-29T12:23:48Z",
    "biotoolsCURIE": "biotools:ortholugedb",
    "biotoolsID": "ortholugedb",
    "credit": [
        {
            "email": "ortholugedb-mail@sfu.ca",
            "name": "Brinkman lab at Simon Fraser University",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Ortholuge-based orthology predictions for completely sequenced bacterial and archaeal genomes. Also contains reciprocal best hit-based ortholog predictions, in-paralog predictions (recently duplicated genes) and proposed ortholog groups.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.pathogenomics.sfu.ca/ortholugedb/?page=about"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://www.pathogenomics.sfu.ca/ortholugedb/?page=faq"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Phylogenetic footprinting / shadowing",
                    "uri": "http://edamontology.org/operation_0327"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://www.pathogenomics.sfu.ca/ortholugedb/",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "OrtholugeDB",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gks1241",
            "metadata": {
                "abstract": "Prediction of orthologs (homologous genes that diverged because of speciation) is an integral component of many comparative genomics methods. Although orthologs are more likely to have similar function versus paralogs (genes that diverged because of duplication), recent studies have shown that their degree of functional conservation is variable. Also, there are inherent problems with several large-scale ortholog prediction approaches. To address these issues, we previously developed Ortholuge, which uses phylogenetic distance ratios to provide more precise ortholog assessments for a set of predicted orthologs. However, the original version of Ortholuge required manual intervention and was not easily accessible; therefore, we now report the development of OrtholugeDB, available online at http://www.pathogenomics.sfu.ca/ ortholugedb. OrtholugeDB provides ortholog predictions for completely sequenced bacterial and archaeal genomes from NCBI based on reciprocal best Basic Local Alignment Search Tool hits, supplemented with further evaluation by the more precise Ortholuge method. The OrtholugeDB web interface facilitates user-friendly and flexible ortholog analysis, from single genes to genomes, plus flexible data download options. We compare Ortholuge with similar methods, showing how it may more consistently identify orthologs with conserved features across a wide range of taxonomic distances. OrtholugeDB facilitates rapid, and more accurate, bacterial and archaeal comparative genomic analysis and large-scale ortholog predictions. © The Author(s) 2012.",
                "authors": [
                    {
                        "name": "Whiteside M.D."
                    },
                    {
                        "name": "Winsor G.L."
                    },
                    {
                        "name": "Laird M.R."
                    },
                    {
                        "name": "Brinkman F.S.L."
                    }
                ],
                "citationCount": 52,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OrtholugeDB: A bacterial and archaeal orthology resource for improved comparative genomic analysis"
            },
            "pmcid": "PMC3531125",
            "pmid": "23203876"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}