{
    "additionDate": "2021-03-19T08:38:22Z",
    "biotoolsCURIE": "biotools:human-disease-genes",
    "biotoolsID": "human-disease-genes",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bert.devries@radboudumc.nl",
            "name": "Bert B. A. de Vries",
            "typeEntity": "Person"
        }
    ],
    "description": "An international, open and dynamic library for up-to-date clinical information.\n\nCollect information about clinic management and research projects.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://www.humandiseasegenes.info",
    "lastUpdate": "2021-03-31T17:52:06Z",
    "name": "Human-Disease-Genes",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/AJMG.A.62057",
            "metadata": {
                "abstract": "© 2021 The Authors. American Journal of Medical Genetics Part A published by Wiley Periodicals LLC.Since the introduction of next-generation sequencing, an increasing number of disorders have been discovered to have genetic etiology. To address diverse clinical questions and coordinate research activities that arise with the identification of these rare disorders, we developed the Human Disease Genes website series (HDG website series): an international digital library that records detailed information on the clinical phenotype of novel genetic variants in the human genome (https://humandiseasegenes.info/). Each gene website is moderated by a dedicated team of clinicians and researchers, focused on specific genes, and provides up-to-date—including unpublished—clinical information. The HDG website series is expanding rapidly with 424 genes currently adopted by 325 moderators from across the globe. On average, a gene website has detailed phenotypic information of 14.4 patients. There are multiple examples of added value, one being the ARID1B gene website, which was recently utilized in research to collect clinical information of 81 new patients. Additionally, several gene websites have more data available than currently published in the literature. In conclusion, the HDG website series provides an easily accessible, open and up-to-date clinical data resource for patients with pathogenic variants of individual genes. This is a valuable resource not only for clinicians dealing with rare genetic disorders such as developmental delay and autism, but other professionals working in diagnostics and basic research. Since the HDG website series is a dynamic platform, its data also include the phenotype of yet unpublished patients curated by professionals providing higher quality clinical detail to improve management of these rare disorders.",
                "authors": [
                    {
                        "name": "Brunner H.G."
                    },
                    {
                        "name": "Dingemans A.J.M."
                    },
                    {
                        "name": "Eichler E.E."
                    },
                    {
                        "name": "Ewals J."
                    },
                    {
                        "name": "Gecz J."
                    },
                    {
                        "name": "Jansen S."
                    },
                    {
                        "name": "Jonis N."
                    },
                    {
                        "name": "Koolen D.A."
                    },
                    {
                        "name": "Nabais Sa M.J."
                    },
                    {
                        "name": "Stremmelaar D.E."
                    },
                    {
                        "name": "Truijen K."
                    },
                    {
                        "name": "Verbruggen M."
                    },
                    {
                        "name": "Vissers L.E.L.M."
                    },
                    {
                        "name": "de Vries B.B.A."
                    },
                    {
                        "name": "van Remortele A."
                    },
                    {
                        "name": "van de Ven S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-01T00:00:00Z",
                "journal": "American Journal of Medical Genetics, Part A",
                "title": "Human disease genes website series: An international, open and dynamic library for up-to-date clinical information"
            },
            "pmid": "33439542"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}
