{
    "additionDate": "2018-05-20T09:26:17Z",
    "biotoolsCURIE": "biotools:uqlust",
    "biotoolsID": "uqlust",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/uQlust"
        }
    ],
    "description": "Combining profile hashing with linear-time ranking for efficient clustering and analysis of big macromolecular data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/uQlust/uQlust-ver2.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "homepage": "https://github.com/uQlust",
    "language": [
        "C#",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "uQlust",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1381-2",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Advances in computing have enabled current protein and RNA structure prediction and molecular simulation methods to dramatically increase their sampling of conformational spaces. The quickly growing number of experimentally resolved structures, and databases such as the Protein Data Bank, also implies large scale structural similarity analyses to retrieve and classify macromolecular data. Consequently, the computational cost of structure comparison and clustering for large sets of macromolecular structures has become a bottleneck that necessitates further algorithmic improvements and development of efficient software solutions. Results: uQlust is a versatile and easy-to-use tool for ultrafast ranking and clustering of macromolecular structures. uQlust makes use of structural profiles of proteins and nucleic acids, while combining a linear-time algorithm for implicit comparison of all pairs of models with profile hashing to enable efficient clustering of large data sets with a low memory footprint. In addition to ranking and clustering of large sets of models of the same protein or RNA molecule, uQlust can also be used in conjunction with fragment-based profiles in order to cluster structures of arbitrary length. For example, hierarchical clustering of the entire PDB using profile hashing can be performed on a typical laptop, thus opening an avenue for structural explorations previously limited to dedicated resources. The uQlust package is freely available under the GNU General Public License at https://github.com/uQlust. Conclusion: uQlust represents a drastic reduction in the computational complexity and memory requirements with respect to existing clustering and model quality assessment methods for macromolecular structure analysis, while yielding results on par with traditional approaches for both proteins and RNAs.",
                "authors": [
                    {
                        "name": "Adamczak R."
                    },
                    {
                        "name": "Meller J."
                    }
                ],
                "date": "2016-12-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "UQlust: Combining profile hashing with linear-time ranking for efficient clustering and analysis of big macromolecular data"
            },
            "pmcid": "PMC5198500",
            "pmid": "28031034"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
