{
    "additionDate": "2017-08-20T14:56:04Z",
    "biotoolsCURIE": "biotools:abcd",
    "biotoolsID": "abcd",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "yunli@med.unc.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jiankang@umich.edu",
            "name": "Jian Kang",
            "orcidid": "http://orcid.org/0000-0002-5643-2668",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "Providides pre-estimated effective sample sizes, specific to each minor allele frequency (MAF) category, for designs with arbitrary coverage (0.5 - 30X) and sample size (20-20,000), and for four major ethnic groups (Europeans, Africans, Asians and African Americans).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.unc.edu/~yunmli/abcd.tutorial.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://yunliweb.its.unc.edu/AbCD.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "AbCD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt041",
            "metadata": {
                "abstract": "Recent advances in sequencing technologies have revolutionized genetic studies. Although high-coverage sequencing can uncover most variants present in the sequenced sample, low-coverage sequencing is appealing for its cost effectiveness. Here, we present AbCD (arbitrary coverage design) to aid the design of sequencing-based studies. AbCD is a user-friendly interface providing pre-estimated effective sample sizes, specific to each minor allele frequency category, for designs with arbitrary coverage (0.5-30×) and sample size (20-10 000), and for four major ethnic groups (Europeans, Africans, Asians and African Americans). In addition, we also present two software tools: ShotGun and DesignPlanner, which were used to generate the estimates behind AbCD. ShotGun is a flexible short-read simulator for arbitrary user-specified read length and average depth, allowing cycle-specific sequencing error rates and realistic read depth distributions. DesignPlanner is a full pipeline that uses ShotGun to generate sequence data and performs initial SNP discovery, uses our previously presented linkage disequilibrium-aware method to call genotypes, and, finally, provides minor allele frequency-specific effective sample sizes. ShotGun plus DesignPlanner can accommodate effective sample size estimate for any combination of high-depth and low-depth data (for example, whole-genome low-depth plus exonic high-depth) or combination of sequence and genotype data [for example, whole-exome sequencing plus genotyping from existing Genomewide Association Study (GWAS)]. © The Author 2013.",
                "authors": [
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "Huang K.-C."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Abecasis G.R."
                    },
                    {
                        "name": "Li Y."
                    }
                ],
                "citationCount": 8,
                "date": "2013-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AbCD: Arbitrary coverage design for sequencing-based genetic studies"
            },
            "pmcid": "PMC3597143",
            "pmid": "23357921",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}