{"credit":[{"email":"chiusano@unina.it","typeEntity":"Person","typeRoles":["Primary contact"]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","license":"Unlicense","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Database portal"],"topic":[{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"},{"term":"Functional genomics","uri":"http://edamontology.org/topic_0085"}]},"publication":[{"abstract":"© 2018 The Author(s). Background: \"Omics\" approaches may provide useful information for a deeper understanding of speciation events, diversification and function innovation. This can be achieved by investigating the molecular similarities at sequence level between species, allowing the definition of ortholog and paralog genes. However, the spreading of sequenced genome, often endowed with still preliminary annotations, requires suitable bioinformatics to be appropriately exploited in this framework. Results: We presented here a multilevel comparative approach to investigate on genome evolutionary relationships and peculiarities of two fleshy fruit species of relevant agronomic interest, Solanum lycopersicum (tomato) and Vitis vinifera (grapevine). We defined 17,823 orthology relationships between tomato and grapevine reference gene annotations. The resulting orthologs are associated with the detected paralogs in each species, permitting the definition of gene networks, useful to investigate the different relationships. The reconciliation of the compared collections in terms of an updating of the functional descriptions was also exploited. All the results were made accessible in ComParaLogs, a dedicated bioinformatics platform available at http://biosrv.cab.unina.it/comparalogs/gene/search. Conclusions: The aim of the work was to suggest a reliable approach to detect all similarities of gene loci between two species based on the integration of results from different levels of information, such as the gene, the transcript and the protein sequences, overcoming possible limits due to exclusive protein versus protein comparisons. This to define reliable ortholog and paralog genes, as well as species specific gene loci in the two species, overcoming limits due to the possible draft nature of preliminary gene annotations. Moreover, reconciled functional descriptions, as well as common or peculiar enzymatic classes and protein domains from tomato and grapevine, together with the definition of species-specific gene sets after the pairwise comparisons, contributed a comprehensive set of information useful to comparatively exploit the two species gene annotations and investigate on differences between species with climacteric and non-climacteric fruits. In addition, the definition of networks of ortholog genes and of associated paralogs, and the organization of web-based interfaces for the exploration of the results, defined a friendly computational bench-work in support of comparative analyses between two species.","authors":["Ambrosino L.","Ruggieri V.","Bostan H.","Miralto M.","Vitulo N.","Zouine M.","Barone A.","Bouzayen M.","Frusciante L.","Pezzotti M.","Valle G.","Chiusano M.L."],"cit_count":0,"doi":"10.1186/s12859-018-2420-y","journal":"BMC Bioinformatics","title":"Multilevel comparative bioinformatics to investigate evolutionary relationships and specificities in gene annotations: An example for tomato and grapevine","type":"Primary","year":"2018-11-30"}],"summary":{"biotoolsCURIE":"biotools:ComParaLogS_-_A_comparative_platform_of_paralog_and_ortholog_genes_from_Tomato_and_Grapevine","biotoolsID":"ComParaLogS_-_A_comparative_platform_of_paralog_and_ortholog_genes_from_Tomato_and_Grapevine","description":"A comparative platform on grapevine and tomato reporting paralog and related ortholog genes identified with an analytical, dedicated, procedure. It provides an update on functional annotations from the two species and it represents an internationally unique platform. It is in expansion in order to include other species, useful to study fruit development.","homepage":"http://biosrv.cab.unina.it/comparalogs/gene/search","name":"ComParaLogS","version":["1"]}}