{
    "additionDate": "2021-11-01T14:58:22.036812Z",
    "biotoolsCURIE": "biotools:pinet-ppi",
    "biotoolsID": "pinet-ppi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cbk@cs.dartmouth.edu",
            "name": "Chris Bailey-Kellogg",
            "orcidid": "https://orcid.org/0000-0003-1860-0912",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PInet is a point cloud patch-wise attention base Protein-Protein Interaction interface predictor.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://github.com/FTD007/PInet",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:16:59.431050Z",
    "name": "PInet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab154",
            "metadata": {
                "abstract": "Motivation: Protein-protein interactions drive wide-ranging molecular processes, and characterizing at the atomic level how proteins interact (beyond just the fact that they interact) can provide key insights into understanding and controlling this machinery. Unfortunately, experimental determination of three-dimensional protein complex structures remains difficult and does not scale to the increasingly large sets of proteins whose interactions are of interest. Computational methods are thus required to meet the demands of large-scale, high-throughput prediction of how proteins interact, but unfortunately, both physical modeling and machine learning methods suffer from poor precision and/or recall. Results: In order to improve performance in predicting protein interaction interfaces, we leverage the best properties of both data- and physics-driven methods to develop a unified Geometric Deep Neural Network, 'PInet' (Protein Interface Network). PInet consumes pairs of point clouds encoding the structures of two partner proteins, in order to predict their structural regions mediating interaction. To make such predictions, PInet learns and utilizes models capturing both geometrical and physicochemical molecular surface complementarity. In application to a set of benchmarks, PInet simultaneously predicts the interface regions on both interacting proteins, achieving performance equivalent to or even much better than the state-of-the-art predictor for each dataset. Furthermore, since PInet is based on joint segmentation of a representation of a protein surfaces, its predictions are meaningful in terms of the underlying physical complementarity driving molecular recognition.",
                "authors": [
                    {
                        "name": "Bailey-Kellogg C."
                    },
                    {
                        "name": "Dai B."
                    }
                ],
                "citationCount": 67,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Protein interaction interface region prediction by geometric deep learning"
            },
            "pmcid": "PMC8428585",
            "pmid": "33693581",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ]
}
