{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-06-14T07:18:22.392490Z",
    "biotoolsCURIE": "biotools:hesml",
    "biotoolsID": "hesml",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "jlastra@invi.uned.es",
            "name": "Juan J. Lastra-Díaz",
            "orcidid": "https://orcid.org/0000-0003-2522-4222",
            "typeEntity": "Person"
        }
    ],
    "description": "HESML is an efficient, scalable and large Java software library of ontology-based semantic similarity measures and Information Content (IC) models based on WordNet, SNOMED-CT, MeSH or any other OBO-based ontology.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://hesml.lsi.uned.es/",
    "language": [
        "Java",
        "R"
    ],
    "lastUpdate": "2022-06-14T07:18:22.395303Z",
    "license": "CC-BY-NC-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jjlastra/HESML"
        }
    ],
    "name": "HESML",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04539-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Ontology-based semantic similarity measures based on SNOMED-CT, MeSH, and Gene Ontology are being extensively used in many applications in biomedical text mining and genomics respectively, which has encouraged the development of semantic measures libraries based on the aforementioned ontologies. However, current state-of-the-art semantic measures libraries have some performance and scalability drawbacks derived from their ontology representations based on relational databases, or naive in-memory graph representations. Likewise, a recent reproducible survey on word similarity shows that one hybrid IC-based measure which integrates a shortest-path computation sets the state of the art in the family of ontology-based semantic measures. However, the lack of an efficient shortest-path algorithm for their real-time computation prevents both their practical use in any application and the use of any other path-based semantic similarity measure. Results: To bridge the two aforementioned gaps, this work introduces for the first time an updated version of the HESML Java software library especially designed for the biomedical domain, which implements the most efficient and scalable ontology representation reported in the literature, together with a new method for the approximation of the Dijkstra’s algorithm for taxonomies, called Ancestors-based Shortest-Path Length (AncSPL), which allows the real-time computation of any path-based semantic similarity measure. Conclusions: We introduce a set of reproducible benchmarks showing that HESML outperforms by several orders of magnitude the current state-of-the-art libraries in the three aforementioned biomedical ontologies, as well as the real-time performance and approximation quality of the new AncSPL shortest-path algorithm. Likewise, we show that AncSPL linearly scales regarding the dimension of the common ancestor subgraph regardless of the ontology size. Path-based measures based on the new AncSPL algorithm are up to six orders of magnitude faster than their exact implementation in large ontologies like SNOMED-CT and GO. Finally, we provide a detailed reproducibility protocol and dataset as supplementary material to allow the exact replication of all our experiments and results.",
                "authors": [
                    {
                        "name": "Garcia-Serrano A."
                    },
                    {
                        "name": "Lara-Clares A."
                    },
                    {
                        "name": "Lastra-Diaz J.J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HESML: a real-time semantic measures library for the biomedical domain with a reproducible survey"
            },
            "pmcid": "PMC8734250",
            "pmid": "34991460"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
