{
    "additionDate": "2017-08-03T18:49:07Z",
    "biotoolsCURIE": "biotools:mdiv",
    "biotoolsID": "mdiv",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://people.binf.ku.dk/rasmus/webpage/"
        }
    ],
    "description": "MDIV is a program that will simultaneously estimate divergence times and migration rates between two populations under the infinite sites model and under a finite sites model (HKY). The program can be used to test if there is evidence for migration between two populations or evidence for shared recent common ancestry. In addition, you get maximum likelihood estimates of the demographic parameters.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://people.binf.ku.dk/rasmus/webpage/program_files/mdiv/readme.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://people.binf.ku.dk/rasmus/webpage/mdiv.html",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mdiv-estimate-divergence-times-migration-rates-populations.html"
        }
    ],
    "name": "MDIV",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A Markov chain Monte Carlo method for estimating the relative effects of migration and isolation on genetic diversity in a pair of populations from DNA sequence data is developed and tested using simulations. The two populations are assumed to be descended from a panmictic ancestral population at some time in the past and may (or may not) after that be connected by migration. The use of a Markov chain Monte Carlo method allows the joint estimation of multiple demographic parameters in either a Bayesian or a likelihood framework. The parameters estimated include the migration rate for each population, the time since the two populations diverged from a common ancestral population, and the relative size of each of the two current populations and of the common ancestral population. The results show that even a single nonrecombining genetic locus can provide substantial power to test the hypothesis of no ongoing migration and/or to test models of symmetric migration between the two populations. The use of the method is illustrated in an application to mitochondrial DNA sequence data from a fish species: the threespine stickleback (Gasterosteus aculeatus).",
                "authors": [
                    {
                        "name": "Nielsen R."
                    },
                    {
                        "name": "Wakeley J."
                    }
                ],
                "citationCount": 1065,
                "date": "2001-07-03T00:00:00Z",
                "journal": "Genetics",
                "title": "Distinguishing migration from isolation: A Markov chain Monte Carlo approach"
            },
            "pmid": "11404349"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1
}