{
    "additionDate": "2021-01-18T11:45:30Z",
    "biotoolsCURIE": "biotools:gpcr-pendb",
    "biotoolsID": "gpcr-pendb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kbegum@utep.edu",
            "name": "Khodeza Begum",
            "typeEntity": "Person"
        }
    ],
    "description": "A database of protein sequences and derived features to facilitate prediction and classification of G protein-coupled receptors.\n\nTo analyze the sequence either upload a file with the sequences in FASTA format, or copy and paste the sequence(s) inside the text area below.",
    "editPermission": {
        "authors": [
            "mbermudez1"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://gpcr.utep.edu",
    "language": [
        "SQL"
    ],
    "lastUpdate": "2024-02-14T13:13:29.618153Z",
    "name": "GPCR-PEnDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA087",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press.G protein-coupled receptors (GPCRs) constitute the largest group of membrane receptor proteins in eukaryotes. Due to their significant roles in various physiological processes such as vision, smell and inflammation, GPCRs are the targets of many prescription drugs. However, the functional and sequence diversity of GPCRs has kept their prediction and classification based on amino acid sequence data as a challenging bioinformatics problem. There are existing computational approaches, mainly using machine learning and statistical methods, to predict and classify GPCRs based on amino acid sequence and sequence derived features. In this paper, we describe a searchable MySQL database, named GPCR-PEnDB (GPCR Prediction Ensemble Database), of confirmed GPCRs and non-GPCRs. It was constructed with the goal of allowing users to conveniently access useful information of GPCRs in a wide range of organisms and to compile reliable training and testing datasets for different combinations of computational tools. This database currently contains 3129 confirmed GPCR and 3575 non-GPCR sequences collected from the UniProtKB/Swiss-Prot protein database, encompassing over 1200 species. The non-GPCR entries include transmembrane proteins for evaluating various prediction programs' abilities to distinguish GPCRs from other transmembrane proteins. Each protein is linked to information about its source organism, classification, sequence lengths and composition, and other derived sequence features. We present examples of using this database along with its graphical user interface, to query for GPCRs with specific sequence properties and to compare the accuracies of five tools for GPCR prediction. This initial version of GPCR-PEnDB will provide a framework for future extensions to include additional sequence and feature data to facilitate the design and assessment of software tools and experimental studies to help understand the functional roles of GPCRs. Database URL: gpcr.utep.edu/database.",
                "authors": [
                    {
                        "name": "Ayivor F."
                    },
                    {
                        "name": "Begum K."
                    },
                    {
                        "name": "Leung M.-Y."
                    },
                    {
                        "name": "Mohl J.E."
                    },
                    {
                        "name": "Perez E.E."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "GPCR-PEnDB: A database of protein sequences and derived features to facilitate prediction and classification of G protein-coupled receptors"
            },
            "pmcid": "PMC7678784",
            "pmid": "33216895"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
