{
    "additionDate": "2019-05-07T07:24:00Z",
    "biotoolsCURIE": "biotools:LAS",
    "biotoolsID": "LAS",
    "credit": [
        {
            "email": "patrick.petrossians@chu.ulg.ac.be",
            "name": "Patrick Petrossians",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Liege Acromegaly Survey (LAS) database includes anonymous historical and prospective data on liege acromegaly patients, pathophysiology, clinical features, responses to therapy and long term outcomes of acromegaly.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://catalogue.rd-connect.eu/web/liege-acromegaly-survey-las-database",
    "lastUpdate": "2019-06-05T13:18:37Z",
    "maturity": "Mature",
    "name": "LAS database",
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1016/j.ando.2012.05.001",
            "metadata": {
                "abstract": "Acromegaly is a chronic rare disease associated with negative pathological effects on multiple systems and organs. We designed a new informatics tool to study data from patients with acromegaly, the Liege Acromegaly Survey (LAS). This relational database permits the inclusion of anonymous historical and prospective data on patients and includes pathophysiology, clinical features, responses to therapy and long term outcomes of acromegaly. We deployed the LAS in a validation study at a single center in order to study the characteristics of patients with acromegaly diagnosed at our center from 1970-2011. A total of 290 patients with acromegaly were included (147 males and 143 females). There was a linear relationship between age at diagnosis and the date of diagnosis, indicating that older patients are being diagnosed with acromegaly more frequently. A majority presented with macroadenomas (77.5%) and the median diameter was 14. mm. Patients with macroadenomas were significantly younger than patients with microadenomas (P=0.01). GH values at diagnosis decreased with the age of the patients (P=0.01) and there was a correlation between GH values and tumor size at diagnosis (P=0.02). No correlation existed between insulin-like growth factor 1 (IGF-1) levels and tumor characteristics. The prevalence of diabetes was 21.4% in this population and 41.0% had hypertension. The presence of hypertension and diabetes were significantly associated with one another (P<0.001). There was a linear relation between initial GH and IGF-1 levels at diagnosis and those obtained during SSA analog treatment and the lowest GH and IGF-1 values following SSA therapy were obtained in older patients (GH: P<0.001; IGF-1: P<0.001). The LAS is a new relational database that is feasible to use in the clinical research setting and permits ready pooling of anonymous patient data from multiple study sites to undertake robust statistical analyses of clinical and therapeutic characteristics. © 2012 Elsevier Masson SAS.",
                "authors": [
                    {
                        "name": "Petrossians P."
                    },
                    {
                        "name": "Tichomirowa M.A."
                    },
                    {
                        "name": "Stevenaert A."
                    },
                    {
                        "name": "Martin D."
                    },
                    {
                        "name": "Daly A.F."
                    },
                    {
                        "name": "Beckers A."
                    }
                ],
                "citationCount": 18,
                "date": "2012-06-01T00:00:00Z",
                "journal": "Annales d'Endocrinologie",
                "title": "The Liege Acromegaly Survey (LAS): A new software tool for the study of acromegaly"
            },
            "pmid": "22682917"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}