{
    "accessibility": "Open access",
    "additionDate": "2024-03-08T09:16:21.096230Z",
    "biotoolsCURIE": "biotools:polyq-db",
    "biotoolsID": "polyq-db",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cdnobrega@ualg.pt",
            "name": "Clévio Nóbrega",
            "orcidid": "https://orcid.org/0000-0002-8312-5292",
            "typeEntity": "Person"
        },
        {
            "name": "Bernardo Estevam",
            "typeEntity": "Person"
        },
        {
            "name": "Carlos A Matos",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrated database on polyglutamine diseases.\n\nInformation on the 9 known different diseases that result from increased number of CAG triplets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "https://polyq.pt/",
    "lastUpdate": "2024-03-08T09:16:21.098851Z",
    "license": "CC-BY-4.0",
    "name": "PolyQ",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAD060",
            "metadata": {
                "abstract": "Polyglutamine (polyQ) diseases are neurodegenerative disorders caused by abnormally expanded Cytosine, Adenine, Guanine (CAG) triplet repeat sequences in the coding region of otherwise unrelated genes. Until now, nine different polyQ diseases have been described: Huntington's disease, dentatorubral-pallidoluysian atrophy, spinal and bulbar muscular atrophy and six types of spinocerebellar ataxias - 1, 2, 3, 6, 7 and 17. The pathogenic expansion translates into an aberrant tract of glutamines in the encoded proteins, compromising several cellular functions and biological processes. There is currently no cure available for the progressive neurodegenerative disorders caused by the ensuing cytotoxic alterations. Although each disease is considered rare, polyQ diseases constitute the largest group of monogenic neurodegenerative disorders. Information about these disorders is scattered among several books, articles and general databases, hindering exploration by students and researchers, but also by patients and their families. Therefore, we aimed to develop a free online database to fill this gap, by centralizing relevant available information. The PolyQ Database is a platform that focuses on all nine polyQ diseases and offers information about topics that are pertinent for scientists, clinicians and the general public, including epidemiology, the characteristics of the causative genes and the codified proteins, the pathophysiology of the diseases and the main clinical manifestations. The database is available at https://polyq.pt/, and it is the first of its kind, focusing exclusively on this group of rare diseases. The database was conceived to be continuously updated and allow incorporation and dissemination of the latest information on polyQ diseases.",
                "authors": [
                    {
                        "name": "Estevam B."
                    },
                    {
                        "name": "Matos C.A."
                    },
                    {
                        "name": "Nobrega C."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Database",
                "title": "PolyQ Database - an integrated database on polyglutamine diseases"
            },
            "pmcid": "PMC10440501",
            "pmid": "37599593"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
