{
    "additionDate": "2021-07-06T17:01:12Z",
    "biotoolsCURIE": "biotools:crossmap",
    "biotoolsID": "crossmap",
    "description": "An efficient tool for converting genome coordinates between assemblies. CrossMap supports most of the commonly used file formats, including BAM, sequence alignment map, Wiggle, BigWig, browser extensible data, general feature format, gene transfer format and variant call format.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence coordinate conversion",
                    "uri": "http://edamontology.org/operation_3267"
                }
            ]
        }
    ],
    "homepage": "http://crossmap.sourceforge.net/",
    "lastUpdate": "2021-07-06T17:01:12Z",
    "name": "CrossMap",
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt730",
            "metadata": {
                "abstract": "Motivation: Reference genome assemblies are subject to change and refinement from time to time. Generally, researchers need to convert the results that have been analyzed according to old assemblies to newer versions, or vice versa, to facilitate meta-analysis, direct comparison, data integration and visualization. Several useful conversion tools can convert genome interval files in browser extensible data or general feature format, but none have the functionality to convert files in sequence alignment map or BigWig format. This is a significant gap in computational genomics tools, as these formats are the ones most widely used for representing high-throughput sequencing data, such as RNA-seq, chromatin immunoprecipitation sequencing, DNA-seq, etc. Results: Here we developed CrossMap, a versatile and efficient tool for converting genome coordinates between assemblies. CrossMap supports most of the commonly used file formats, including BAM, sequence alignment map, Wiggle, BigWig, browser extensible data, general feature format, gene transfer format and variant call format.© 2013 The Author 2013. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Kocher J.-P."
                    },
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 159,
                "date": "2014-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CrossMap: A versatile tool for coordinate conversion between genome assemblies"
            }
        }
    ]
}
