{
    "additionDate": "2018-07-06T13:56:31Z",
    "biotoolsCURIE": "biotools:stargazer",
    "biotoolsID": "stargazer",
    "credit": [
        {
            "email": "stargazer@uw.edu",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Calling star alleles of polymorphic pharmacogenes from next-generation sequencing (NGS) data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://stargazer.gs.washington.edu/stargazerweb/res/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://stargazer.gs.washington.edu/stargazerweb/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-3.0",
    "name": "Stargazer",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/s41436-018-0054-0",
            "metadata": {
                "abstract": "© 2018, American College of Medical Genetics and Genomics.Purpose: Genotyping CYP2D6 is important for precision drug therapy because the enzyme it encodes metabolizes approximately 25% of drugs, and its activity varies considerably among individuals. Genotype analysis of CYP2D6 is challenging due to its highly polymorphic nature. Over 100 haplotypes (star alleles) have been defined for CYP2D6, some involving a gene conversion with its nearby nonfunctional but highly homologous paralog CYP2D7. We present Stargazer, a new bioinformatics tool that uses next-generation sequencing (NGS) data to call star alleles for CYP2D6 (https://stargazer.gs.washington.edu/stargazerweb/). Stargazer is currently being extended for other pharmacogenes. Methods: Stargazer identifies star alleles from NGS data by detecting single nucleotide variants, insertion-deletion variants, and structural variants. Stargazer detects structural variation, including gene deletions, duplications, and conversions, by calculating paralog-specific copy numbers from read depths. Results: We applied Stargazer to the NGS data of 32 ethnically diverse HapMap trios that were genotyped by TaqMan assays, long-range polymerase chain reaction, quantitative multiplex polymerase chain reaction, high-resolution melting analysis, and/or Sanger sequencing. CYP2D6 genotyping by Stargazer was 99.0% concordant with the data obtained by these methods, and showed that 28.1% of the samples had structural variation including CYP2D6/CYP2D7 hybrids. Conclusion: Accurate genotyping of pharmacogenes with NGS and subsequent allele calling with Stargazer will aid the implementation of precision drug therapy.",
                "authors": [
                    {
                        "name": "Dalton R."
                    },
                    {
                        "name": "Gaedigk A."
                    },
                    {
                        "name": "Lee S.-B."
                    },
                    {
                        "name": "McGee S."
                    },
                    {
                        "name": "Nickerson D.A."
                    },
                    {
                        "name": "Patterson K."
                    },
                    {
                        "name": "Thummel K.E."
                    },
                    {
                        "name": "Wheeler M.M."
                    },
                    {
                        "name": "Woodahl E.L."
                    }
                ],
                "citationCount": 29,
                "date": "2019-02-01T00:00:00Z",
                "journal": "Genetics in Medicine",
                "title": "Stargazer: a software tool for calling star alleles from next-generation sequencing data using CYP2D6 as a model"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "NGS",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
