{
    "additionDate": "2019-11-14T18:02:50Z",
    "biotoolsCURIE": "biotools:MetaBAT_2",
    "biotoolsID": "MetaBAT_2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhongwang@lbl.gov",
            "name": "Zhong Wang",
            "orcidid": "https://orcid.org/0000-0002-6307-0458",
            "typeEntity": "Person"
        }
    ],
    "description": "an adaptive binning algorithm for robust and efficient genome reconstruction from metagenome assemblies | MetaBAT2 clusters metagenomic contigs into different \"bins\", each of which should correspond to a putative genome | MetaBAT2 uses nucleotide composition information and source strain abundance (measured by depth-of-coverage by aligning the reads to the contigs) to perform binning",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/metabat/metabat"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/berkeleylab/metabat",
    "lastUpdate": "2024-11-24T15:57:24.008036Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://kbase.us/applist/apps/metabat/run_metabat/release"
        }
    ],
    "name": "MetaBAT 2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/peerj.1165",
            "metadata": {
                "abstract": "Grouping large genomic fragments assembled fromshotgun metagenomic sequences to deconvolute complex microbial communities, or metagenome binning, enables the study of individual organisms and their interactions. Because of the complex nature of these communities, existing metagenome binning methods often miss a large number of microbial species. In addition, most of the tools are not scalable to large datasets. Here we introduce automated software calledMetaBAT that integrates empirical probabilistic distances of genome abundance and tetranucleotide frequency for accurate metagenome binning. MetaBAT outperforms alternative methods in accuracy and computational efficiency on both synthetic and real metagenome datasets. It automatically forms hundreds of high quality genome bins on a very large assembly consisting millions of contigs in a matter of hours on a single node. MetaBAT is open source software and available at https://bitbucket.org/ berkeleylab/metabat.",
                "authors": [
                    {
                        "name": "Egan R."
                    },
                    {
                        "name": "Froula J."
                    },
                    {
                        "name": "Kang D.D."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 1198,
                "date": "2015-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "MetaBAT, an efficient tool for accurately reconstructing single genomes from complex microbial communities"
            },
            "pmcid": "PMC4556158",
            "pmid": "26336640"
        },
        {
            "doi": "10.7717/peerj.7359",
            "metadata": {
                "abstract": "We previously reported on MetaBAT, an automated metagenome binning software tool to reconstruct single genomes from microbial communities for subsequent analyses of uncultivated microbial species. MetaBAT has become one of the most popular binning tools largely due to its computational efficiency and ease of use, especially in binning experiments with a large number of samples and a large assembly. MetaBAT requires users to choose parameters to fine-tune its sensitivity and specificity. If those parameters are not chosen properly, binning accuracy can suffer, especially on assemblies of poor quality. Here, we developed MetaBAT 2 to overcome this problem. MetaBAT 2 uses a new adaptive binning algorithm to eliminate manual parameter tuning. We also performed extensive software engineering optimization to increase both computational and memory efficiency. Comparing MetaBAT 2 to alternative software tools on over 100 real world metagenome assemblies shows superior accuracy and computing speed. Binning a typical metagenome assembly takes only a few minutes on a single commodity workstation. We therefore recommend the community adopts MetaBAT 2 for their metagenome binning experiments. MetaBAT 2 is open source software and available at https://bitbucket.org/berkeleylab/metabat.",
                "authors": [
                    {
                        "name": "An H."
                    },
                    {
                        "name": "Egan R."
                    },
                    {
                        "name": "Kang D.D."
                    },
                    {
                        "name": "Kirton E."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Thomas A."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 1646,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "MetaBAT 2: An adaptive binning algorithm for robust and efficient genome reconstruction from metagenome assemblies"
            },
            "pmcid": "PMC6662567",
            "pmid": "31388474"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
