{
    "additionDate": "2021-11-28T13:11:22.266359Z",
    "biotoolsCURIE": "biotools:floorlevel-net",
    "biotoolsID": "floorlevel-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Mengyang Wu",
            "orcidid": "https://orcid.org/0000-0001-9989-7118"
        }
    ],
    "description": "Recognizing Floor-Level Lines With Height-Attention-Guided Multi-Task Learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://wumengyangok.github.io/Project/FloorLevelNet",
    "lastUpdate": "2021-11-28T13:11:22.269056Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/wumengyangok/FloorLevelNet"
        }
    ],
    "name": "FloorLevel-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TIP.2021.3096090",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.The ability to recognize the position and order of the floor-level lines that divide adjacent building floors can benefit many applications, for example, urban augmented reality (AR). This work tackles the problem of locating floor-level lines in street-view images, using a supervised deep learning approach. Unfortunately, very little data is available for training such a network - current street-view datasets contain either semantic annotations that lack geometric attributes, or rectified facades without perspective priors. To address this issue, we first compile a new dataset and develop a new data augmentation scheme to synthesize training samples by harassing (i) the rich semantics of existing rectified facades and (ii) perspective priors of buildings in diverse street views. Next, we design FloorLevel-Net, a multi-task learning network that associates explicit features of building facades and implicit floor-level lines, along with a height-attention mechanism to help enforce a vertical ordering of floor-level lines. The generated segmentations are then passed to a second-stage geometry post-processing to exploit self-constrained geometric priors for plausible and consistent reconstruction of floor-level lines. Quantitative and qualitative evaluations conducted on assorted facades in existing datasets and street views from Google demonstrate the effectiveness of our approach. Also, we present context-aware image overlay results and show the potentials of our approach in enriching AR-related applications. Project website: https://wumengyangok.github.io/Project/FloorLevelNet.",
                "authors": [
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Zeng W."
                    },
                    {
                        "name": "Fu C.-W."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "FloorLevel-Net: Recognizing Floor-Level Lines with Height-Attention-Guided Multi-Task Learning"
            },
            "pmid": "34310282"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}