{
    "accessibility": "Open access",
    "additionDate": "2022-07-26T10:31:04.662523Z",
    "biotoolsCURIE": "biotools:ospred_tool",
    "biotoolsID": "ospred_tool",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shameer.khader@astrazeneca.com",
            "name": "Khader Shameer",
            "orcidid": "https://orcid.org/0000-0002-9982-1911",
            "typeEntity": "Person"
        },
        {
            "name": "Youyi Zhang"
        },
        {
            "name": "Faisal M. Khan",
            "orcidid": "https://orcid.org/0000-0002-5116-7471"
        },
        {
            "name": "Imran Khan A. N",
            "orcidid": "https://orcid.org/0000-0002-9175-9279"
        }
    ],
    "description": "A Digital Health Aid for Rapid Predictive Analysis of Correlations Between Early End Points and Overall Survival in Non-Small-Cell Lung Cancer Clinical Trials.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AstraZeneca/OSPred",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-07-26T10:31:04.666352Z",
    "license": "Apache-2.0",
    "name": "OSPred tool",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1200/CCI.21.00173",
            "metadata": {
                "abstract": "© American Society of Clinical Oncology.PURPOSEOverall survival (OS) is the gold standard end point for establishing clinical benefits in phase III oncology trials. However, these trials are associated with low success rates, largely driven by failure to meet the primary end point. Surrogate end points such as progression-free survival (PFS) are increasingly being used as indicators of biologic drug activity and to inform early go/no-go decisions in oncology drug development. We developed OSPred, a digital health aid that combines actual clinical data and machine intelligence approaches to visualize correlation trends between early (PFS-based) and late (OS) end points and provide support for shared decision making in the drug development pipeline.METHODSOSPred is based on a trial-level data set of 81 reports (35 anticancer drugs with various mechanisms of action; 156 observations) in non-small-cell lung cancer (NSCLC). OSPred was developed using R Shiny, with packages ggplot2, metafor, boot, dplyr, and mvtnorm, to analyze and visualize correlation results and predict OS hazard ratio (HR OS) on the basis of user-inputted PFS-based data, namely, HR PFS, or the odds ratio of PFS at 4 (OR PFS4) or 6 (OR PFS6) months.RESULTSThe three main features of the tool are as follows: prediction of HR OS on the basis of user-inputted early end point values; visualization of comparisons of the user's investigational drug with other drugs in the NSCLC setting, including by specific MoA; and creation of a probability density chart, providing point prediction and CIs for HR OS. A working version of the tool for download is linked.CONCLUSIONThe OSPred tool offers interactive visualization of clinical trial end point correlations with reference to a large pool of historical NSCLC studies. Its focused capability has the potential to digitally transform and accelerate data-driven decision making as part of the drug development process.",
                "authors": [
                    {
                        "name": "Iacona R.B."
                    },
                    {
                        "name": "Imran Khan A.N."
                    },
                    {
                        "name": "Khan F.M."
                    },
                    {
                        "name": "Nampally S."
                    },
                    {
                        "name": "Prokop A."
                    },
                    {
                        "name": "Shameer K."
                    },
                    {
                        "name": "Weatherall J."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "OSPred Tool: A Digital Health Aid for Rapid Predictive Analysis of Correlations between Early End Points and Overall Survival in Non-Small-Cell Lung Cancer Clinical Trials"
            },
            "pmcid": "PMC9067362",
            "pmid": "35467964"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
