{
    "additionDate": "2022-08-28T12:38:28.362485Z",
    "biotoolsCURIE": "biotools:ilncda-ltr",
    "biotoolsID": "ilncda-ltr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu"
        },
        {
            "email": "wuhao123@bit.edu.cn",
            "name": "Hao Wu"
        }
    ],
    "description": "A Learning to Rank (LTR)-based method called iLncDA-LTR to predict diseases related with newly detected lncRNAs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/iLncDA-LTR/",
    "lastUpdate": "2022-08-28T12:38:28.366026Z",
    "license": "Not licensed",
    "name": "iLncDA-LTR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2022.105605",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdIdentifying the associations between lncRNAs and diseases is helpful for the treatment and diagnosis of complex diseases. The existing computational methods mainly focus on the identification of associations between known lncRNAs and known diseases. However, with the application of high-throughput sequencing in lncRNA research, more and more lncRNAs have been detected. Predicting diseases related with newly detected lncRNAs has not been fully explored. Therefore, there is an urgent need for developing powerful computational methods to predict diseases related with newly detected lncRNAs. In this paper, we propose a Learning to Rank (LTR)-based method called iLncDA-LTR to predict diseases related with newly detected lncRNAs. iLncDA-LTR treats this task as an information retrieval task. The newly detected lncRNAs and diseases are considered as queries and documents, respectively. For a given newly detected lncRNA (query), iLncDA-LTR integrates multiple relevant information into LTR for predicting candidate diseases associated with query lncRNA. Experimental results show that iLncDA-LTR outperforms the other exiting state-of-the-art predictors on independent dataset. The corresponding web server of iLncDA-LTR has been constructed as well (http://bliulab.net/iLncDA-LTR/).",
                "authors": [
                    {
                        "name": "El-Latif Hesham A."
                    },
                    {
                        "name": "Liang Q."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "iLncDA-LTR: Identification of lncRNA-disease associations by learning to rank"
            },
            "pmid": "35594681"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
