{
    "name": "PeakTrace", 
    "description": "Alternative basecaller for improving the quality and read length of Sanger DNA sequencing traces. The basecaller works with trace files produced by the ABI 310, 3700, 3100, 3130, 3730, and 3500 DNA sequencers. MegBACE sequencers are also supported.", 
    "homepage": "http://www.peaktrace.com", 
    "biotoolsID": "peaktrace", 
    "biotoolsCURIE": "biotools:peaktrace", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3185", 
                    "term": "Base-calling"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.peaktrace.com/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.4103/0974-777X.170496", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Identification of invasive Salmonella enterica serovar Typhimurium ST313 in ambulatory HIV-infected adults in Mozambique", 
                "abstract": "© Mary Ann Liebert, Inc.Introduction: Despite evidence describing the burden of invasive non-typhoidal salmonella (iNTS) disease in sub-Saharan Africa, iNTS is not recognized as a priority within global health policy institutions. Recently, Salmonella enterica serovar Typhimurium, sequence type (ST) 313, has been identified as the predominant cause of iNTS disease in multiple sub-Saharan African countries. Materials and Methods: We conducted multilocus sequence typing (MLST) to determine the prevalence of the ST313 genotype in a sample of blood isolates from ambulatory HIV-infected Mozambican adults with iNTS disease. Results: Of the 29 samples of NTS obtained and analyzed by MLST, all (29/29) were assigned the ST313 sequence type based on the set of allele types derived from each of the seven loci. For quality control, five randomly selected strains taken from the original cultures were confirmed as ST313, and the positive control strain SL3261 (taken from the original culture) was categorized as S. Typhimurium ST19. Conclusion: S. Typhimurium ST313 is an important example of a widely distributed pathogen that lacks a coordinated strategy for control. The highly vulnerable populations at risk for ST313 infection in Mozambique, and within the region, would benefit greatly from the development of new policy and on-the-ground capacity to support increased surveillance, prevention, and treatment initiatives.", 
                "date": "2015-10-01T00:00:00Z", 
                "citationCount": 1, 
                "authors": [
                    {
                        "name": "Moon T.D."
                    }, 
                    {
                        "name": "Johnson M."
                    }, 
                    {
                        "name": "Foster M.A."
                    }, 
                    {
                        "name": "Silva W.P."
                    }, 
                    {
                        "name": "Buene M."
                    }, 
                    {
                        "name": "Valverde E."
                    }, 
                    {
                        "name": "Morais L."
                    }, 
                    {
                        "name": "Williams J.V."
                    }, 
                    {
                        "name": "Vermund S.H."
                    }, 
                    {
                        "name": "Brentlinger P.E."
                    }
                ], 
                "journal": "Journal of Global Infectious Diseases"
            }
        }
    ], 
    "credit": [], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:15:50Z", 
    "lastUpdate": "2018-12-10T12:58:53Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}