{
    "additionDate": "2018-10-06T11:08:23Z",
    "biotoolsCURIE": "biotools:micropie",
    "biotoolsID": "micropie",
    "credit": [
        {
            "email": "maojin@email.arizona.edu",
            "name": "Jin Mao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Microbial Phenomics Information Extractor (MicroPIE) is a natural language processing application that uses a robust supervised classification algorithm (Support Vector Machine) to identify characters from sentences in prokaryotic taxonomic descriptions, followed by a combination of algorithms applying linguistic rules with groups of known terms to extract characters as well as character states.",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "https://github.com/biosemantics/micropie2/blob/0.1.0/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biosemantics/micropie2/tree/0.1.0",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/biosemantics/micropie2/issues"
        }
    ],
    "name": "MicroPIE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1396-8",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: The large-scale analysis of phenomic data (i.e., full phenotypic traits of an organism, such as shape, metabolic substrates, and growth conditions) in microbial bioinformatics has been hampered by the lack of tools to rapidly and accurately extract phenotypic data from existing legacy text in the field of microbiology. To quickly obtain knowledge on the distribution and evolution of microbial traits, an information extraction system needed to be developed to extract phenotypic characters from large numbers of taxonomic descriptions so they can be used as input to existing phylogenetic analysis software packages. Results: We report the development and evaluation of Microbial Phenomics Information Extractor (MicroPIE, version 0.1.0). MicroPIE is a natural language processing application that uses a robust supervised classification algorithm (Support Vector Machine) to identify characters from sentences in prokaryotic taxonomic descriptions, followed by a combination of algorithms applying linguistic rules with groups of known terms to extract characters as well as character states. The input to MicroPIE is a set of taxonomic descriptions (clean text). The output is a taxon-by-character matrix-with taxa in the rows and a set of 42 pre-defined characters (e.g., optimum growth temperature) in the columns. The performance of MicroPIE was evaluated against a gold standard matrix and another student-made matrix. Results show that, compared to the gold standard, MicroPIE extracted 21 characters (50%) with a Relaxed F1 score > 0.80 and 16 characters (38%) with Relaxed F1 scores ranging between 0.50 and 0.80. Inclusion of a character prediction component (SVM) improved the overall performance of MicroPIE, notably the precision. Evaluated against the same gold standard, MicroPIE performed significantly better than the undergraduate students. Conclusion: MicroPIE is a promising new tool for the rapid and efficient extraction of phenotypic character information from prokaryotic taxonomic descriptions. However, further development, including incorporation of ontologies, will be necessary to improve the performance of the extraction for some character types.",
                "authors": [
                    {
                        "name": "Mao J."
                    },
                    {
                        "name": "Moore L.R."
                    },
                    {
                        "name": "Blank C.E."
                    },
                    {
                        "name": "Wu E.H.-H."
                    },
                    {
                        "name": "Ackerman M."
                    },
                    {
                        "name": "Ranade S."
                    },
                    {
                        "name": "Cui H."
                    }
                ],
                "citationCount": 7,
                "date": "2016-12-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Microbial phenomics information extractor (MicroPIE): A natural language processing tool for the automated acquisition of prokaryotic phenotypic characters from text sources"
            },
            "pmcid": "PMC5153691",
            "pmid": "27955641",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1,
    "version": [
        "0.1.0"
    ]
}