{
    "additionDate": "2021-11-29T07:43:24.858348Z",
    "biotoolsCURIE": "biotools:protgear",
    "biotoolsID": "protgear",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kmwai@kemri-wellcome.org",
            "name": "Kennedy Mwai",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "protGear is a protein microarray data pre-processing suite. protGear is a package for protein micro-array data processing just before the main analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://keniajin.github.io/protGear/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T07:43:24.860808Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Keniajin/protGear"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Keniajin/protGear/issues"
        }
    ],
    "name": "protGear",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.04.044",
            "metadata": {
                "abstract": "© 2021 The AuthorsProtein microarrays are versatile tools for high throughput study of the human proteome, but systematic and non-systematic sources of bias constrain optimal interpretation and the ultimate utility of the data. Published guidelines to limit technical variability whilst maintaining important biological variation favour DNA-based microarrays that often differ fundamentally in their experimental design. Rigorous tools to guide background correction, the quantification of within-sample variation, normalisation, and batch correction specifically for protein microarrays are limited, require extensive investigation and are not centrally accessible. Here, we develop a generic one-stop-shop pre-processing suite for protein microarrays that is compatible with data from the major protein microarray scanners. Our graphical and tabular interfaces facilitate a detailed inspection of data and are coupled with supporting guidelines that enable users to select the most appropriate algorithms to systematically address bias arising in customized experiments. The localization and distribution of background signal intensities determine the optimal correction strategy. A novel function overcomes the limitations in the interpretation of the coefficient of variation when signal intensities are at the lower end of the detection threshold. We demonstrate essential considerations in the experimental design and their impact on a range of algorithms for normalization and minimization of batch effects. Our user-friendly interactive web-based platform eliminates the need for prowess in programming. The open-source R interface includes illustrative examples, generates an auditable record, enables reproducibility, and can incorporate additional custom scripts through its online repository. This versatility will enhance its broad uptake in the infectious disease and vaccine development community.",
                "authors": [
                    {
                        "name": "Mwai K."
                    },
                    {
                        "name": "Kibinge N."
                    },
                    {
                        "name": "Tuju J."
                    },
                    {
                        "name": "Kamuyu G."
                    },
                    {
                        "name": "Kimathi R."
                    },
                    {
                        "name": "Mburu J."
                    },
                    {
                        "name": "Chepsat E."
                    },
                    {
                        "name": "Nyamako L."
                    },
                    {
                        "name": "Chege T."
                    },
                    {
                        "name": "Nkumama I."
                    },
                    {
                        "name": "Kinyanjui S."
                    },
                    {
                        "name": "Musenge E."
                    },
                    {
                        "name": "Osier F."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "protGear: A protein microarray data pre-processing suite"
            },
            "pmcid": "PMC8114118",
            "pmid": "34025940",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        }
    ]
}