{
    "additionDate": "2020-01-14T19:32:04Z",
    "biotoolsCURIE": "biotools:VCF2PopTree_autogenerated",
    "biotoolsID": "VCF2PopTree_autogenerated",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "ssankara@usc.edu.au",
            "name": "Sankar Subramanian",
            "typeEntity": "Person"
        }
    ],
    "description": "a client-side software to construct population phylogeny from genome-wide SNPs.\n\nVCF2PopTree is a client-side software written in Javascript and it runs.\n\npurely within the user’s computer/browser. VCF2PopTree is compatible",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sansubs/vcf2pop",
    "lastUpdate": "2020-01-14T19:32:04Z",
    "license": "MIT",
    "name": "VCF2PopTree_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.8213",
            "metadata": {
                "abstract": "Copyright 2019 Subramanian et al.In the past decades a number of software programs have been developed to infer phylogenetic relationships between populations. However, most of these programs typically use alignments of sequences from genes to build phylogeny. Recently, many standalone or web applications have been developed to handle large-scale whole genome data, but they are either computationally intensive, dependent on third party software or required significant time and resource of a web server. In the post-genomic era, researchers are able to obtain bioinformatically processed high-quality publication-ready whole genome data for many individuals in a population from next generation sequencing companies due to the reduction in the cost of sequencing and analysis. Such genotype data is typically presented in the Variant Call Format (VCF) and there is no simple software available that directly uses this data format to construct the phylogeny of populations in a short time. To address this limitation, we have developed a user-friendly software, VCF2PopTree that uses genome-wide SNPs to construct and display phylogenetic trees in seconds to minutes. For example, it reads a VCF file containing 4 million SNPs and draws a tree in less than 30 seconds. VCF2PopTree accepts genotype data from a local machine, constructs a tree using UPGMA and Neighbour-Joining algorithms and displays it on a web-browser. It also produces pairwise-diversity matrix in MEGA and PHYLIP file formats as well as trees in the Newick format which could be directly used by other popular phylogenetic software programs. The software including the source code, a test VCF file and a documentation are available at: https://github.com/sansubs/vcf2pop.",
                "authors": [
                    {
                        "name": "Subramanian S."
                    },
                    {
                        "name": "Ramasamy U."
                    },
                    {
                        "name": "Chen D."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "VCF2PopTree: A client-side software to construct population phylogeny from genome-wide SNPs"
            },
            "pmcid": "PMC6901002",
            "pmid": "31824783"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}