{"credit":[],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Text annotation","uri":"http://edamontology.org/operation_3778"},{"term":"Named-entity and concept recognition","uri":"http://edamontology.org/operation_3280"}]}],"labels":{"license":"CC-BY-3.0","topic":[{"term":"Natural language processing","uri":"http://edamontology.org/topic_0218"},{"term":"Ontology and terminology","uri":"http://edamontology.org/topic_0089"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Data submission, annotation and curation","uri":"http://edamontology.org/topic_0219"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"}]},"publication":[{"abstract":"© The Author(s) 2017. Published by Oxford University Press.Gold-standard annotated corpora have become important resources for the training and testing of natural-language-processing (NLP) systems designed to support biocuration efforts, and ontologies are increasingly used to facilitate curational consistency and semantic integration across disparate resources. Bringing together the respective power of these, the Colorado Richly Annotated Full-Text (CRAFT) Corpus, a collection of full-length, open-access biomedical journal articles with extensive manually created syntactic, formatting and semantic markup, was previously created and released. This initial public release has already been used in multiple projects to drive development of systems focused on a variety of biocuration, search, visualization, and semantic and syntactic NLP tasks. Building on its demonstrated utility, we have expanded the CRAFT Corpus with a large set of manually created semantic annotations relying on Uberon, an ontology representing anatomical entities and life-cycle stages of multicellular organisms across species as well as types of multicellular organisms defined in terms of life-cycle stage and sexual characteristics. This newly created set of annotations, which has been added for v2.1 of the corpus, is by far the largest publicly available collection of gold-standard anatomical markup and is the first large-scale effort at manual markup of biomedical text relying on the entirety of an anatomical terminology, as opposed to annotation with a small number of high-level anatomical categories, as performed in previous corpora. In addition to presenting and discussing this newly available resource, we apply it to provide a performance baseline for the automatic annotation of anatomical concepts in biomedical text using a prominent concept recognition system. The full corpus, released with a CC BY 3.0 license, may be downloaded from http://bionlp-corpora.sourceforge.net/CRAFT/index.shtml. Database URL: http://bionlp-corpora.sourceforge.net/CRAFT/index.shtml.","authors":["Bada M.","Vasilevsky N.","Baumgartner W.A.","Haendel M.","Hunter L.E."],"cit_count":0,"doi":"10.1093/DATABASE/BAX087","journal":"Database : the journal of biological databases and curation","pmid":"31725864","title":"Gold-standard ontology-based anatomical annotation in the CRAFT Corpus","year":"2017-01-01"}],"summary":{"biotoolsCURIE":"biotools:CRAFT","biotoolsID":"CRAFT","description":"Gold-standard ontology-based anatomical annotation in the CRAFT Corpus.\n\nCRAFT: THE COLORADO RICHLY ANNOTATED FULL TEXT CORPUS.\n\nNOTE: This site hosts CRAFT v2.0 and below. For more recent versions of the corpus, including the most recent version, please go to the CRAFT GitHub site .\n\nThe Colorado Richly Annotated Full Text Corpus (CRAFT) is a manually annotated corpus consisting of 67 full-text biomedical journal articles. Each article is a member of the PubMed Central Open Access Subset.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'CRAFT Corpus', 'Colorado Richly Annotated Full-Text'","homepage":"http://bionlp-corpora.sourceforge.net/CRAFT/index.shtml","name":"CRAFT"}}