{
    "additionDate": "2020-01-14T19:55:35Z",
    "biotoolsCURIE": "biotools:NeuroPostureApp",
    "biotoolsID": "NeuroPostureApp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "g.deuschl@neurologie.uni-kiel.de",
            "name": "Günther Deuschl",
            "typeEntity": "Person"
        }
    ],
    "description": "The Effect of Medication and Deep Brain Stimulation on Posture in Parkinson's Disease.\n\nNeuroPostureApp©, Klinik f&uumlr Neurologie, UKSH Campus Kiel.\n\nWebApp to measure bending angle in camptocormia patients. Based on the article **to be published** from Nils Margraf and Günther Deuschl et al.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.neuroimaging.uni-kiel.de/NeuroPostureApp/",
    "lastUpdate": "2021-01-04T08:03:07Z",
    "name": "NeuroPostureApp",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FNEUR.2019.01254",
            "metadata": {
                "abstract": "© Copyright © 2019 Schlenstedt, Gavriliuc, Boße, Wolke, Granert, Deuschl and Margraf.Introduction: Postural abnormalities are common in Parkinson's disease (PD) and increasing with disease progression. While many studies focus on balance and gait, postural alignment is only infrequently studied. Purpose: The aim of the present study was to examine the immediate and long-term effects of medication and deep brain stimulation (DBS) in the subthalamic nucleus on postural alignment in PD. Materials and Methods: PD patients (n = 192) in an advanced stage of disease were videotaped during a standardized l-dopa trial before and after DBS. The patients were tested with and without medication pre-surgical and retested post-surgical (6–24 months) in all treatment combinations of medication and DBS regarding the on and off conditions. The forward bending as total camptocormia (TCC) and upper camptocormia (UCC) angles and lateral bending as Pisa angle were assessed with the free downloadable NeuroPostureApp (http://www.neuroimaging.uni-kiel.de/NeuroPostureApp/). Three subgroups were defined according to normative values of healthy controls and according to clinical criteria: patients with normal posture, with stooped posture, and with postural disorders. Results: A stooped posture was found in 82% of the patients with regard to the TCC angle and in 54% for the UCC angle. Sixty-two percent had an abnormal Pisa angle. Camptocormia was diagnosed in ~7% and a Pisa syndrome in 1% of the patients. Medication and DBS both significantly improved postural alignment in the entire cohort. Female and male patients benefit similarly by medication and stimulation. Subgroup analyses revealed that the effects were also significant for patients with stooped posture, and the effects were strongest for patients with camptocormia: they led to angles below the diagnostical criterion for camptocormia for 13 of 14 patients with TCC and 11 of 26 patients with UCC. DBS had an additional effect to medication over time for the Pisa angle. Conclusion: Medication and DBS both improved postural alignment in PD patients, but effects were small for the entire cohort. Patients with camptocormia according to the TCC angle benefit strongest. The large differences of the treatment effects may indicate distinct pathological mechanisms for stooped posture and postural disorders. The TCC angle was shown to be sensitive to change. The UCC angle was less sensitive but may be a useful assessment tool for a subgroup.",
                "authors": [
                    {
                        "name": "Bosse K."
                    },
                    {
                        "name": "Deuschl G."
                    },
                    {
                        "name": "Gavriliuc O."
                    },
                    {
                        "name": "Granert O."
                    },
                    {
                        "name": "Margraf N.G."
                    },
                    {
                        "name": "Schlenstedt C."
                    },
                    {
                        "name": "Wolke R."
                    }
                ],
                "citationCount": 6,
                "date": "2019-12-03T00:00:00Z",
                "journal": "Frontiers in Neurology",
                "title": "The Effect of Medication and Deep Brain Stimulation on Posture in Parkinson's Disease"
            },
            "pmcid": "PMC6901659",
            "pmid": "31849818"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
