{
    "additionDate": "2020-01-09T17:46:40Z",
    "biotoolsCURIE": "biotools:EPIVAN",
    "biotoolsID": "EPIVAN",
    "confidence_flag": "tool",
    "description": "Identifying enhancer-promoter interactions with neural network based on pre-trained DNA vectors and attention mechanism.\n\nEPIVAN(Promoter-Enhancer Interaction predictor with pre-trained Vector and Attention based neural Networks).\n\nEPIVAN is a new deep learning method that enables predicting long-range EPIs using only genomic sequences",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hzy95/EPIVAN",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-25T15:33:26Z",
    "name": "EPIVAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ694",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Identification of enhancer-promoter interactions (EPIs) is of great significance to human development. However, experimental methods to identify EPIs cost too much in terms of time, manpower and money. Therefore, more and more research efforts are focused on developing computational methods to solve this problem. Unfortunately, most existing computational methods require a variety of genomic data, which are not always available, especially for a new cell line. Therefore, it limits the large-scale practical application of methods. As an alternative, computational methods using sequences only have great genome-scale application prospects. Results: In this article, we propose a new deep learning method, namely EPIVAN, that enables predicting long-range EPIs using only genomic sequences. To explore the key sequential characteristics, we first use pre-trained DNA vectors to encode enhancers and promoters; afterwards, we use one-dimensional convolution and gated recurrent unit to extract local and global features; lastly, attention mechanism is used to boost the contribution of key features, further improving the performance of EPIVAN. Benchmarking comparisons on six cell lines show that EPIVAN performs better than state-of-the-art predictors. Moreover, we build a general model, which has transfer ability and can be used to predict EPIs in various cell lines.",
                "authors": [
                    {
                        "name": "Hong Z."
                    },
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Wei L."
                    },
                    {
                        "name": "Liu X."
                    }
                ],
                "citationCount": 41,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifying enhancer-promoter interactions with neural network based on pre-trained DNA vectors and attention mechanism"
            },
            "pmid": "31588505"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}