{
    "additionDate": "2019-11-14T18:34:51Z",
    "biotoolsCURIE": "biotools:VCF-DART",
    "biotoolsID": "VCF-DART",
    "confidence_flag": "tool",
    "description": "A Customizable Analysis Pipeline for Identification of Clinically Relevant Genetic Variants in Next-Generation Sequencing Data | In this article, we introduce the variant call format-diagnostic annotation and reporting tool (VCF-DART), a customized analysis pipeline tool for the rapid annotation of variants from exome or genome sequencing and the generation of reports for genetic diagnostics. VCF-DART uses custom gene lists to categorize variants into specific analysis tiers and to subcategorize them on the basis of standard parameters to facilitate the rapid interrogation of potentially pathogenic variants by human operators",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sirselim/diagnostics_exome_reporting",
    "lastUpdate": "2021-01-02T11:46:49Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sirselim/WES_ShinyDiscover"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sirselim/VCF-DART_example_exomes"
        }
    ],
    "name": "VCF-DART",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JMOLDX.2019.07.001",
            "metadata": {
                "abstract": "© 2019 American Society for Investigative Pathology and the Association for Molecular PathologyIn this article, we introduce the variant call format–diagnostic annotation and reporting tool (VCF-DART), a customized analysis pipeline tool for the rapid annotation of variants from exome or genome sequencing and the generation of reports for genetic diagnostics. VCF-DART uses custom gene lists to categorize variants into specific analysis tiers and to subcategorize them on the basis of standard parameters to facilitate the rapid interrogation of potentially pathogenic variants by human operators. The tool uses publicly available databases to identify a range of data to assist with variant classification and curation processes and includes robust logging of parameters and database versions to allow comparison of analyses performed at different times. VCF-DART—an online analysis pipeline for next-generation sequencing data—is a platform agnostic tool that leverages the use of publicly available databases to improve a laboratory's calling ability and reduce analysis times long-term. It also runs highly efficiently and scales from desk and laptop machines to servers. Overall, VCF-DART provides a simple, customizable, and entirely open-source method to identify genetic variants that may be of clinical importance in a variety of genetically important conditions.",
                "authors": [
                    {
                        "name": "Benton M.C."
                    },
                    {
                        "name": "Smith R.A."
                    },
                    {
                        "name": "Haupt L.M."
                    },
                    {
                        "name": "Sutherland H.G."
                    },
                    {
                        "name": "Dunn P.J."
                    },
                    {
                        "name": "Albury C.L."
                    },
                    {
                        "name": "Maksemous N."
                    },
                    {
                        "name": "Lea R."
                    },
                    {
                        "name": "Griffiths L."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of Molecular Diagnostics",
                "title": "Variant Call Format–Diagnostic Annotation and Reporting Tool: A Customizable Analysis Pipeline for Identification of Clinically Relevant Genetic Variants in Next-Generation Sequencing Data"
            },
            "pmid": "31442673"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ],
    "validated": 1
}