{
    "additionDate": "2021-01-18T09:59:51Z",
    "biotoolsCURIE": "biotools:hla-arena",
    "biotoolsID": "hla-arena",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kavraki@rice.edu",
            "name": "Lydia E. Kavraki",
            "typeEntity": "Person"
        }
    ],
    "description": "A Customizable Environment for the Structural Modeling and Analysis of Peptide-HLA Complexes for Cancer Immunotherapy.\n\nA customizable environment for the structural modeling and analysis of peptide-HLA complexes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/KavrakiLab/hla-arena",
    "lastUpdate": "2021-01-30T11:51:27Z",
    "name": "HLA-Arena",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1200/CCI.19.00123",
            "metadata": {
                "abstract": "© 2020 by American Society of Clinical Oncology.PURPOSE HLA protein receptors play a key role in cellular immunity. They bind intracellular peptides and display them for recognition by T-cell lymphocytes. Because T-cell activation is partially driven by structural features of these peptide-HLA complexes, their structural modeling and analysis are becoming central components of cancer immunotherapy projects. Unfortunately, this kind of analysis is limited by the small number of experimentally determined structures of peptide-HLA complexes. Overcoming this limitation requires developing novel computational methods to model and analyze peptide-HLA structures. METHODS Here we describe a new platform for the structural modeling and analysis of peptide-HLA complexes, called HLA-Arena, which we have implemented using Jupyter Notebook and Docker. It is a customizable environment that facilitates the use of computational tools, such as APE-Gen and DINC, which we have previously applied to peptide-HLA complexes. By integrating other commonly used tools, such as MODELLER and MHCflurry, this environment includes support for diverse tasks in structural modeling, analysis, and visualization. RESULTS To illustrate the capabilities of HLA-Arena, we describe 3 example workflows applied to peptide-HLA complexes. Leveraging the strengths of our tools, DINC and APE-Gen, the first 2 workflows show how to perform geometry prediction for peptide-HLA complexes and structure-based binding prediction, respectively. The third workflow presents an example of large-scale virtual screening of peptides for multiple HLA alleles. CONCLUSION These workflows illustrate the potential benefits of HLA-Arena for the structural modeling and analysis of peptide-HLA complexes. Because HLA-Arena can easily be integrated within larger computational pipelines, we expect its potential impact to vastly increase. For instance, it could be used to conduct structural analyses for personalized cancer immunotherapy, neoantigen discovery, or vaccine development.",
                "authors": [
                    {
                        "name": "Antunes D.A."
                    },
                    {
                        "name": "Abella J.R."
                    },
                    {
                        "name": "Hall-Swan S."
                    },
                    {
                        "name": "Devaurs D."
                    },
                    {
                        "name": "Conev A."
                    },
                    {
                        "name": "Moll M."
                    },
                    {
                        "name": "Lizee G."
                    },
                    {
                        "name": "Kavraki L.E."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "HLA-Arena: A customizable environment for the structural modeling and analysis of peptide-HLA complexes for cancer immunotherapy"
            },
            "pmcid": "PMC7397777",
            "pmid": "32667823"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}