{
    "accessibility": "Open access",
    "additionDate": "2024-03-15T16:00:13.669021Z",
    "biotoolsCURIE": "biotools:revoluzer",
    "biotoolsID": "revoluzer",
    "collectionID": [
        "revoluzer"
    ],
    "description": "Various tools for genome rearrangement analysis. CREx, TreeREx, etc",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://gitlab.com/Bernt/revoluzer/-/tags"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene order",
                        "uri": "http://edamontology.org/data_3479"
                    },
                    "format": [
                        {
                            "term": "FASTA-like (text)",
                            "uri": "http://edamontology.org/format_2200"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Distance matrix",
                        "uri": "http://edamontology.org/data_2855"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/Bernt/revoluzer/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:09:09.098551Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/Bernt/revoluzer/"
        }
    ],
    "name": "revoluzer",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "m.bernt",
    "publication": [
        {
            "doi": "10.1007/978-3-540-87989-3_11",
            "metadata": {
                "abstract": "Given the mitochondrial gene orders and the phylogenetic relationship of a set of unichromosomal taxa, we study the problem of finding a plausible and parsimonious assignment of genomic rearrangement events to the edges of the given phylogenetic tree. An algorithm called algorithm TreeREx (tree rearrangement explorer) is proposed for solving this problem heuristically. TreeREx is based on an extended version of algorithm CREx (common interval rearrangement explorer, [4]) that heuristically computes pairwise rearrangement scenarios for gene order data. As phylogenetic events in such scenarios reversals, transpositions, reverse transpositions, and tandem duplication random loss (TDRL) operations are considered. CREx can detect such events as patterns in the signed strong interval tree, a data structure representing gene groups that appear consecutively in a set of two gene orders. TreeREx then tries to assign events to the edges of the phylogenetic tree, such that the pairwise scenarios are reflected on the paths of the tree. It is shown that TreeREx can automatically infer the events and the ancestral gene orders for realistic biological examples of mitochondrial gene orders. In an analysis of gene order data for teleosts, algorithm TreeREx is able to identify a yet undocumented TDRL towards species Bregmaceros nectabanus. © 2008 Springer-Verlag.",
                "authors": [
                    {
                        "name": "Bernt M."
                    },
                    {
                        "name": "Merkle D."
                    },
                    {
                        "name": "Middendorf M."
                    }
                ],
                "citationCount": 56,
                "date": "2008-12-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "An algorithm for inferring mitogenome rearrangements in a phylogenetic tree"
            }
        },
        {
            "doi": "10.1093/bioinformatics/btm468",
            "metadata": {
                "abstract": "Summary: We present the web-based program CREx for heuristically determining pairwise rearrangement events in unichromosomal genomes. CREx considers transpositions, reverse transpositions, reversals and tandem-duplication-random-loss (TDRL) events. It supports the user in finding parsimonious rearrangement scenarios given a phylogenetic hypothesis. CREx is based on common intervals, which reflect genes that appear consecutively in several of the input gene orders. © The Author 2007. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Bernhard D."
                    },
                    {
                        "name": "Bernt M."
                    },
                    {
                        "name": "Fritzsch G."
                    },
                    {
                        "name": "Merkle D."
                    },
                    {
                        "name": "Middendorf M."
                    },
                    {
                        "name": "Perseke M."
                    },
                    {
                        "name": "Ramsch K."
                    },
                    {
                        "name": "Schlegel M."
                    },
                    {
                        "name": "Stadler P.F."
                    }
                ],
                "citationCount": 272,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CREx: Inferring genomic rearrangements based on common intervals"
            },
            "pmid": "17895271"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular evolution",
            "uri": "http://edamontology.org/topic_3945"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ]
}
