{
    "additionDate": "2017-12-18T00:07:49Z",
    "biotoolsCURIE": "biotools:ipknot",
    "biotoolsID": "ipknot",
    "credit": [
        {
            "email": "satoken@bio.keio.ac.jp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "IPknot provides services for predicting RNA secondary structures including a wide class of pseudoknots. IPknot can also predict the consensus secondary structure when a multiple alignment of RNA sequences is given. IPknot runs fast and predicts the maximum expected accuracy (MEA) structure using integer programming (IP) with threshold cut.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rtips.dna.bio.keio.ac.jp/ipknot/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structure prediction",
                    "uri": "http://edamontology.org/operation_0271"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://rtips.dna.bio.keio.ac.jp/ipknot/",
    "language": [
        "JavaScript",
        "PHP",
        "C++",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ipknot-0-0-2-rna-secondary-structure-prediction-including-pseudoknots.html"
        }
    ],
    "name": "IPknot",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/nar/gks412",
            "metadata": {
                "abstract": "We present a web-based tool set Rtips for fast and accurate prediction of RNA 2D complex structures. Rtips comprises two computational tools based on integer programming, IPknot for predicting RNA secondary structures with pseudoknots and RactIP for predicting RNA-RNA interactions with kissing hairpins. Both servers can run much faster than existing services with the same purpose on large data sets as well as being at least comparable in prediction accuracy. The Rtips web server along with the stand-alone programs is freely accessible at http://rna.naist.jp/. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Kato Y."
                    },
                    {
                        "name": "Sato K."
                    },
                    {
                        "name": "Asai K."
                    },
                    {
                        "name": "Akutsu T."
                    }
                ],
                "citationCount": 7,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Rtips: Fast and accurate tools for RNA 2D structure prediction using integer programming"
            },
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btr215",
            "metadata": {
                "abstract": "Motivation: Pseudoknots found in secondary structures of a number of functional RNAs play various roles in biological processes. Recent methods for predicting RNA secondary structures cover certain classes of pseudoknotted structures, but only a few of them achieve satisfying predictions in terms of both speed and accuracy. Results: We propose IPknot, a novel computational method for predicting RNA secondary structures with pseudoknots based on maximizing expected accuracy of a predicted structure. IPknot decomposes a pseudoknotted structure into a set of pseudoknot-free substructures and approximates a base-pairing probability distribution that considers pseudoknots, leading to the capability of modeling a wide class of pseudoknots and running quite fast. In addition, we propose a heuristic algorithm for refining base-paring probabilities to improve the prediction accuracy of IPknot. The problem of maximizing expected accuracy is solved by using integer programming with threshold cut. We also extend IPknot so that it can predict the consensus secondary structure with pseudoknots when a multiple sequence alignment is given. IPknot is validated through extensive experiments on various datasets, showing that IPknot achieves better prediction accuracy and faster running time as compared with several competitive prediction methods. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Sato K."
                    },
                    {
                        "name": "Kato Y."
                    },
                    {
                        "name": "Hamada M."
                    },
                    {
                        "name": "Akutsu T."
                    },
                    {
                        "name": "Asai K."
                    }
                ],
                "citationCount": 118,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IPknot: Fast and accurate prediction of RNA secondary structures with pseudoknots using integer programming"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "1.3.1"
    ]
}