
{
    "credit": [
        {
            "email": "olivier.gevaert@gmail.com",
            "name": "Olivier Gevaert",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/MethylMix.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MethylMix_1.8.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Methylated DNA immunoprecipitation",
                "uri": "http://edamontology.org/topic_3674"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. Summary: DNA methylation is an important mechanism regulating gene transcription, and its role in carcinogenesis has been extensively studied. Hyper and hypomethylation of genes is an alternative mechanism to deregulate gene expression in a wide range of diseases. At the same time, high-throughput DNA methylation assays have been developed generating vast amounts of genome wide DNA methylation measurements. Yet, few tools exist that can formally identify hypo and hypermethylated genes that are predictive of transcription and thus functionally relevant for a particular disease. To accommodate this lack of tools, we developed MethylMix, an algorithm implemented in R to identify disease specific hyper and hypomethylated genes. MethylMix is based on a beta mixture model to identify methylation states and compares them with the normal DNA methylation state. MethylMix introduces a novel metric, the 'Differential Methylation value' or DM-value defined as the difference of a methylation state with the normal methylation state. Finally, matched gene expression data are used to identify, besides differential, transcriptionally predictive methylation states by focusing on methylation changes that effect gene expression. Availability and implementation: MethylMix was implemented as an R package and is available in bioconductor.",
            "authors": [
                "Gevaert O."
            ],
            "cit_count": 18,
            "doi": "10.1093/bioinformatics/btv020",
            "journal": "Bioinformatics",
            "title": "MethylMix: An R package for identifying DNA methylation-driven genes",
            "type": "Primary",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:methylmix",
        "biotoolsID": "methylmix",
        "description": "Algorithm implemented to identify hyper/hypomethylated genes for a disease. Based on a beta mixture model to identify methylation states and compares them with the normal DNA methylation state. It uses the Differential Methylation value or DM-value defined as the difference of a methylation state with the normal methylation state. Matched gene expression data is used to identify, besides differential, functional methylation states by focusing on methylation changes that effect gene expression.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/MethylMix.html",
        "name": "MethylMix",
        "version": [
            "1.8.0"
        ]
    }
}