{
    "additionDate": "2017-01-17T15:01:57Z",
    "biotoolsCURIE": "biotools:casper",
    "biotoolsID": "casper",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "rosselldavid@gmail.com",
            "name": "David Rossell",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Infer alternative splicing from paired-end RNA-seq data. The model is based on counting paths across exons, rather than pairwise exon connections, and estimates the fragment size and start distributions non-parametrically, which improves estimation precision.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/casper.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/casper_2.8.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splicing model analysis",
                    "uri": "http://edamontology.org/operation_2499"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/casper.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T05:24:07Z",
    "license": "GPL-2.0",
    "name": "casper",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1214/13-AOAS687",
            "metadata": {
                "abstract": "RNA-sequencing has revolutionized biomedical research and, in particular, our ability to study gene alternative splicing. The problem has important implications for human health, as alternative splicing may be involved in malfunctions at the cellular level and multiple diseases. However, the highdimensional nature of the data and the existence of experimental biases pose serious data analysis challenges. We find that the standard data summaries used to study alternative splicing are severely limited, as they ignore a substantial amount of valuable information. Current data analysis methods are based on such summaries and are hence suboptimal. Further, they have limited flexibility in accounting for technical biases.We propose novel data summaries and a Bayesian modeling framework that overcome these limitations and determine biases in a nonparametric, highly flexible manner. These summaries adapt naturally to the rapid improvements in sequencing technology. We provide efficient point estimates and uncertainty assessments. The approach allows to study alternative splicing patterns for individual samples and can also be the basis for downstream analyses. We found a severalfold improvement in estimation mean square error compared popular approaches in simulations, and substantially higher consistency between replicates in experimental data. Our findings indicate the need for adjusting the routine summarization and analysis of alternative splicing RNA-seq studies. We provide a software implementation in the R package casper.4. © Institute of Mathematical Statistics, 2014.",
                "authors": [
                    {
                        "name": "Attolini C.S.-O."
                    },
                    {
                        "name": "Kroiss M."
                    },
                    {
                        "name": "Rossell D."
                    },
                    {
                        "name": "Stocker A."
                    }
                ],
                "citationCount": 18,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Annals of Applied Statistics",
                "title": "Quantifying alternative splicing from paired-end RNA-sequencing data"
            },
            "pmcid": "PMC4005600",
            "pmid": "24795787",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        }
    ],
    "validated": 1,
    "version": [
        "2.8.0"
    ]
}
