{
    "additionDate": "2017-12-18T00:03:33Z",
    "biotoolsCURIE": "biotools:alphabet",
    "biotoolsID": "alphabet",
    "credit": [
        {
            "email": "brutlag@cmgm.stanford.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Alphabet takes a database of aligned protein sequences in BLOCKS+ format and examines the alignments column-wise looking for groups of amino acids that co-occur in columns more frequently than expected based on overall amino acid composition. These groups of amino acids can form a reduced alphabet for building sequence motifs (eMOTIFs) or for detecting correlations between columns of amino acids (MCSeq).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://motif.stanford.edu/distributions/alphabet/index.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-11T19:06:59Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/alphabet-find-groups-amino-acids-co-occur-columns-frequently.html"
        }
    ],
    "name": "Alphabet",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "This paper introduces a method for identifying empirically conserved amino acid substitution groups. In contrast with existing approaches that view amino acid substitution as a pairwise phenomenon, the method presented here identifies conserved groups of amino acids using a data structure called a conditional distribution matrix. The conditional distribution matrix extends the concept of a pairwise substitution matrix by changing the context of substitution from a single amino acid to a group of amino acids. The matrix tabulates information from a database of protein families that contains numerous aligned positions. Each row in the matrix contains the distribution of amino acids in those aligned positions that contain a given conditioning group of amino acids. The method converts a database of protein families into a conditional distribution matrix and then examines each possible substitution group for evidence of conservation. The algorithm is applied to the BLOCKS and HSSP databases. Twenty amino acid substitution groups are found to be conserved empirically in both databases. These groups provide insight into biochemical properties that are conserved in protein evolution.",
                "authors": [
                    {
                        "name": "Wu T.D."
                    },
                    {
                        "name": "Brutlag D.L."
                    }
                ],
                "citationCount": 26,
                "date": "1996-01-01T00:00:00Z",
                "journal": "Proceedings / ... International Conference on Intelligent Systems for Molecular Biology ; ISMB. International Conference on Intelligent Systems for Molecular Biology",
                "title": "Discovering empirically conserved amino acid substitution groups in databases of protein families."
            },
            "pmid": "8877523",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Amino acids",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}