{
    "additionDate": "2022-10-03T05:08:52.130800Z",
    "biotoolsCURIE": "biotools:dnabinder",
    "biotoolsID": "dnabinder",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/dnabinder/developers.html"
        }
    ],
    "description": "DNAbinder is a webserver developed for predicting DNA-binding proteins from their amino acid sequence using various compositional features of proteins. The SVM models have been developed on following datasets using following protein features.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/dnabinder/developers.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/dnabinder/developers.html",
    "lastUpdate": "2022-10-03T05:09:18.249085Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/dnabinder/developers.html"
        }
    ],
    "name": "dnabinder",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-463",
            "metadata": {
                "abstract": "Background: Identification of DNA-binding proteins is one of the major challenges in the field of genome annotation, as these proteins play a crucial role in gene-regulation. In this paper, we developed various SVM modules for predicting DNA-binding domains and proteins. All models were trained and tested on multiple datasets of non-redundant proteins. Results: SVM models have been developed on DNAaset, which consists of 1153 DNA-binding and equal number of non DNA-binding proteins, and achieved the maximum accuracy of 72.42% and 71.59% using amino acid and dipeptide compositions, respectively. The performance of SVM model improved from 72.42% to 74.22%, when evolutionary information in form of PSSM profiles was used as input instead of amino acid composition. In addition, SVM models have been developed on DNAset, which consists of 146 DNA-binding and 250 non-binding chains/domains, and achieved the maximum accuracy of 79.80% and 86.62% using amino acid composition and PSSM profiles. The SVM models developed in this study perform better than existing methods on a blind dataset. Conclusion: A highly accurate method has been developed for predicting DNA-binding proteins using SVM and PSSM profiles. This is the first study in which evolutionary information in form of PSSM profiles has been used successfully for predicting DNA-binding proteins. A web-server DNAbinder has been developed for identifying DNA-binding proteins and domains from query amino acid sequences http://www.imtech.res.in/raghava/ dnabinder/. © 2007 Kumar et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Kumar M."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 196,
                "date": "2007-11-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Identification of DNA-binding proteins using support vector machines and evolutionary profiles"
            },
            "pmcid": "PMC2216048",
            "pmid": "18042272"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
