{
    "additionDate": "2021-01-18T11:02:19Z",
    "biotoolsCURIE": "biotools:js-ms",
    "biotoolsID": "js-ms",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "robert.smith@mso.umt.edu",
            "name": "Rob Smith",
            "orcidid": "https://orcid.org/0000-0002-1864-9110",
            "typeEntity": "Person"
        }
    ],
    "description": "A web-based system for creating, viewing, and editing precursor mass spectrometry ground truth data.\n\nJavaScript Mass Spectrometry, a visualization GUI for Mass Spectrometry signal data. Presents a robust, 3-dimensional graph view that allows the creation, editing, and saving of XIC and envelope annotations in addition to panning, rotating, and zooming actions. Interfaces via HTTP to the MsDataServer API for access to MS data stored in the MzTree format.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://github.com/optimusmoose/jsms",
    "language": [
        "Java",
        "JavaScript"
    ],
    "lastUpdate": "2021-02-12T10:06:46Z",
    "license": "MIT",
    "name": "JS-MS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03752-7",
            "metadata": {
                "abstract": "BACKGROUND: Mass spectrometry (MS) uses mass-to-charge ratios of measured particles to decode the identities and quantities of molecules in a sample. Interpretation of raw MS depends upon data processing algorithms that render it human-interpretable. Quantitative MS workflows are complex experimental chains and it is crucial to know the performance and bias of each data processing method as they impact accuracy, coverage, and statistical significance of the result. Creation of the ground truth necessary for quantitatively evaluating MS1-aware algorithms is difficult and tedious task, and better software for creating such datasets would facilitate more extensive evaluation and improvement of MS data processing algorithms. RESULTS: We present JS-MS 2.0, a software suite that provides a dependency-free, browser-based, one click, cross-platform solution for creating MS1 ground truth. The software retains the first version's capacity for loading, viewing, and navigating MS1 data in 2- and 3-D, and adds tools for capturing, editing, saving, and viewing isotopic envelope and extracted isotopic chromatogram features. The software can also be used to view and explore the results of feature finding algorithms. CONCLUSIONS: JS-MS 2.0 enables faster creation and inspection of MS1 ground truth data. It is publicly available with an MIT license at github.com/optimusmoose/jsms.",
                "authors": [
                    {
                        "name": "Henning J."
                    },
                    {
                        "name": "Smith R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-23T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "A web-based system for creating, viewing, and editing precursor mass spectrometry ground truth data"
            },
            "pmcid": "PMC7517820",
            "pmid": "32972355"
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}