{
    "additionDate": "2020-01-14T19:43:58Z",
    "biotoolsCURIE": "biotools:DeepRiPP",
    "biotoolsID": "DeepRiPP",
    "confidence_flag": "tool",
    "description": "DeepRiPP integrates multiomics data to automate discovery of novel ribosomally synthesized natural products.\n\nDeepginsen is a lantipeptide that is genomically encoded distantly from its modification enzymes and discovered directly as a result of DeepRiPP within the genome and metabolome of Flavobacterium ginsengiterrae JCM 17337.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "http://deepripp.magarveylab.ca",
    "lastUpdate": "2020-12-20T11:29:27Z",
    "name": "DeepRiPP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1073/PNAS.1901493116",
            "metadata": {
                "abstract": "© 2020 National Academy of Sciences. All rights reserved.Microbial natural products represent a rich resource of evolved chemistry that forms the basis for the majority of pharmacotherapeutics. Ribosomally synthesized and posttranslationally modified peptides (RiPPs) are a particularly interesting class of natural products noted for their unique mode of biosynthesis and biological activities. Analyses of sequenced microbial genomes have revealed an enormous number of biosynthetic loci encoding RiPPs but whose products remain cryptic. In parallel, analyses of bacterial metabolomes typically assign chemical structures to only a minority of detected metabolites. Aligning these 2 disparate sources of data could provide a comprehensive strategy for natural product discovery. Here we present DeepRiPP, an integrated genomic and metabolomic platform that employs machine learning to automate the selective discovery and isolation of novel RiPPs. DeepRiPP includes 3 modules. The first, NLPPrecursor, identifies RiPPs independent of genomic context and neighboring biosynthetic genes. The second module, BARLEY, prioritizes loci that encode novel compounds, while the third, CLAMS, automates the isolation of their corresponding products from complex bacterial extracts. DeepRiPP pinpoints target metabolites using large-scale comparative metabolomics analysis across a database of 10,498 extracts generated from 463 strains. We apply the DeepRiPP platform to expand the landscape of novel RiPPs encoded within sequenced genomes and to discover 3 novel RiPPs, whose structures are exactly as predicted by our platform. By building on advances in machine learning technologies, DeepRiPP integrates genomic and metabolomic data to guide the isolation of novel RiPPs in an automated manner.",
                "authors": [
                    {
                        "name": "Cannon M.J."
                    },
                    {
                        "name": "Dejong C.A."
                    },
                    {
                        "name": "Dial K."
                    },
                    {
                        "name": "Gunabalasingam M."
                    },
                    {
                        "name": "Johnston C."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Magarvey N.A."
                    },
                    {
                        "name": "Merwin N.J."
                    },
                    {
                        "name": "Mousa W.K."
                    },
                    {
                        "name": "Skinnider M.A."
                    }
                ],
                "citationCount": 25,
                "date": "2020-01-07T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "DeepRiPP integrates multiomics data to automate discovery of novel ribosomally synthesized natural products"
            },
            "pmid": "31871149"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
