{
    "additionDate": "2020-01-14T19:38:19Z",
    "biotoolsCURIE": "biotools:UNI-EM",
    "biotoolsID": "UNI-EM",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "hurakubo@gmail.com",
            "name": "Hidetoshi Urakubo",
            "typeEntity": "Person"
        }
    ],
    "description": "An Environment for Deep Neural Network-Based Automated Segmentation of Neuronal Electron Microscopic Images.\n\nA unified environment for DNN-based automated segmentation of neuronal EM images.\n\nCheck the following pages after installation.\n\nClick the link \"main.exe\" in [UNI-EM] to launch the control panel.\n\nUrakubo, H., Bullmann, T., Kubota, Y., Oba, S., Ishii, S., UNI-EM: An Environment for Deep Neural Network-Based Automated Segmentation of Neuronal Electron Microscopic Images. Scientific Reports 9, 19413 (2019) doi:10.1038/s41598-019-55431-0",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/urakubo/UNI-EM",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2020-01-14T19:38:19Z",
    "license": "GPL-3.0",
    "name": "UNI-EM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-55431-0",
            "metadata": {
                "abstract": "© 2019, The Author(s).Recently, there has been rapid expansion in the field of micro-connectomics, which targets the three-dimensional (3D) reconstruction of neuronal networks from stacks of two-dimensional (2D) electron microscopy (EM) images. The spatial scale of the 3D reconstruction increases rapidly owing to deep convolutional neural networks (CNNs) that enable automated image segmentation. Several research teams have developed their own software pipelines for CNN-based segmentation. However, the complexity of such pipelines makes their use difficult even for computer experts and impossible for non-experts. In this study, we developed a new software program, called UNI-EM, for 2D and 3D CNN-based segmentation. UNI-EM is a software collection for CNN-based EM image segmentation, including ground truth generation, training, inference, postprocessing, proofreading, and visualization. UNI-EM incorporates a set of 2D CNNs, i.e., U-Net, ResNet, HighwayNet, and DenseNet. We further wrapped flood-filling networks (FFNs) as a representative 3D CNN-based neuron segmentation algorithm. The 2D- and 3D-CNNs are known to demonstrate state-of-the-art level segmentation performance. We then provided two example workflows: mitochondria segmentation using a 2D CNN and neuron segmentation using FFNs. By following these example workflows, users can benefit from CNN-based segmentation without possessing knowledge of Python programming or CNN frameworks.",
                "authors": [
                    {
                        "name": "Urakubo H."
                    },
                    {
                        "name": "Bullmann T."
                    },
                    {
                        "name": "Kubota Y."
                    },
                    {
                        "name": "Oba S."
                    },
                    {
                        "name": "Ishii S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "UNI-EM: An Environment for Deep Neural Network-Based Automated Segmentation of Neuronal Electron Microscopic Images"
            },
            "pmcid": "PMC6923391",
            "pmid": "31857624"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}