{
    "name": "SymCurv", 
    "description": "SymCurv is a computational ab initio method for nucleosome positioning prediction. It is based on the structural property of natural nucleosome forming sequences, to be symmetrically curved around a local minimum of curvature.", 
    "homepage": "http://genome.crg.es/cgi-bin/SymCurv/SymCurv.pl", 
    "biotoolsID": "symcurv", 
    "biotoolsCURIE": "biotools:symcurv", 
    "version": [
        "1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2478", 
                    "term": "Nucleic acid sequence analysis"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2977", 
                        "term": "Nucleic acid sequence"
                    }, 
                    "format": []
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_1255", 
                        "term": "Sequence features"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2330", 
                            "term": "Textual format"
                        }
                    ]
                }
            ], 
            "note": "SymCurv is a computational ab initio method for nucleosome positioning prediction. It is based on the structural property of natural nucleosome forming sequences, to be symmetrically curved around a local minimum of curvature. The method takes as input the primary DNA sequence, calculates the expected curvature from which it deduces possible centers of nucleosomal sequences, by imposing symmetry constraints. SymCurv's performance is comparable to existing tools but offers the additional advantages of predicting nucleosome positions under two assumed-states (stationary and dynamic) providing insight on the remodelling potential of nucleosomes of possible regulatory function.", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0160", 
            "term": "Sequence sites, features and motifs"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://genome.crg.es/SymCurv/documentation.html", 
            "type": "Repository", 
            "note": null
        }
    ], 
    "download": [
        {
            "url": "http://genome.crg.es/SymCurv/documentation.html", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }, 
        {
            "url": "http://genome.crg.es/SymCurv/documentation.html", 
            "type": "Binaries", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://genome.crg.es/SymCurv/tutorial.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1038/nsmb.1658", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Nucleosome positioning as a determinant of exon recognition", 
                "abstract": "Chromatin structure influences transcription, but its role in subsequent RNA processing is unclear. Here we present analyses of high-throughput data that imply a relationship between nucleosome positioning and exon definition. First, we have found stable nucleosome occupancy within human and Caenorhabditis elegans exons that is stronger in exons with weak splice sites. Conversely, we have found that pseudoexons-intronic sequences that are not included in mRNAs but are flanked by strong splice sites-show nucleosome depletion. Second, the ratio between nucleosome occupancy within and upstream from the exons correlates with exon-inclusion levels. Third, nucleosomes are positioned central to exons rather than proximal to splice sites. These exonic nucleosomal patterns are also observed in non-expressed genes, suggesting that nucleosome marking of exons exists in the absence of transcription. Our analysis provides a framework that contributes to the understanding of splicing on the basis of chromatin architecture. © 2009 Nature America, Inc. All rights reserved.", 
                "date": "2009-09-01T00:00:00Z", 
                "citationCount": 285, 
                "authors": [
                    {
                        "name": "Tilgner H."
                    }, 
                    {
                        "name": "Nikolaou C."
                    }, 
                    {
                        "name": "Althammer S."
                    }, 
                    {
                        "name": "Sammeth M."
                    }, 
                    {
                        "name": "Beato M."
                    }, 
                    {
                        "name": "Valcarcel J."
                    }, 
                    {
                        "name": "Guigo R."
                    }
                ], 
                "journal": "Nature Structural and Molecular Biology"
            }
        }, 
        {
            "doi": "10.1093/nar/gkt707", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Topoisomerase II regulates yeast genes with singular chromatin architectures", 
                "abstract": "Eukaryotic topoisomerase II (topo II) is the essential decatenase of newly replicated chromosomes and the main relaxase of nucleosomal DNA. Apart from these general tasks, topo II participates in more specialized functions. In mammals, topo IIa interacts with specific RNA polymerases and chromatin-remodeling complexes, whereas topo IIb regulates developmental genes in conjunction with chromatin remodeling and heterochromatin transitions. Here we show that in budding yeast, topo II regulates the expression of specific gene subsets. To uncover this, we carried out a genomic transcription run-on shortly after the thermal inactivation of topo II. We identified a modest number of genes not involved in the general stress response but strictly dependent on topo II. These genes present distinctive functional and structural traits in comparison with the genome average. Yeast topo II is a positive regulator of genes with well-defined promoter architecture that associates to chromatin remodeling complexes; it is a negative regulator of genes extremely hypo-acetylated with complex promoters and undefined nucleosome positioning, many of which are involved in polyamine transport. These findings indicate that yeast topo II operates on singular chromatin architectures to activate or repress DNA transcription and that this activity produces functional responses to ensure chromatin stability. © The Author(s) 2013. Published by Oxford University Press.", 
                "date": "2013-11-01T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Nikolaou C."
                    }, 
                    {
                        "name": "Bermudez I."
                    }, 
                    {
                        "name": "Manichanh C."
                    }, 
                    {
                        "name": "Garcia-Martinez J."
                    }, 
                    {
                        "name": "Guigo R."
                    }, 
                    {
                        "name": "Perez-Ortin J.E."
                    }, 
                    {
                        "name": "Roca J."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": "10.1186/1756-8935-3-20", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Structural constraints revealed in consistent nucleosome positions in the genome of S. cerevisiae", 
                "abstract": "Background. Recent advances in the field of high-throughput genomics have rendered possible the performance of genome-scale studies to define the nucleosomal landscapes of eukaryote genomes. Such analyses are aimed towards providing a better understanding of the process of nucleosome positioning, for which several models have been suggested. Nevertheless, questions regarding the sequence constraints of nucleosomal DNA and how they may have been shaped through evolution remain open. In this paper, we analyze in detail different experimental nucleosome datasets with the aim of providing a hypothesis for the emergence of nucleosome-forming sequences. Results. We compared the complete sets of nucleosome positions for the budding yeast (Saccharomyces cerevisiae) as defined in the output of two independent experiments with the use of two different experimental techniques. We found that < 10% of the experimentally defined nucleosome positions were consistently positioned in both datasets. This subset of well-positioned nucleosomes, when compared with the bulk, was shown to have particular properties at both sequence and structural levels. Consistently positioned nucleosomes were also shown to occur preferentially in pairs of dinucleosomes, and to be surprisingly less conserved compared with their adjacent nucleosome-free linkers. Conclusion. Our findings may be combined into a hypothesis for the emergence of a weak nucleosome-positioning code. According to this hypothesis, consistent nucleosomes may be partly guided by nearby nucleosome-free regions through statistical positioning. Once established, a set of well-positioned consistent nucleosomes may impose secondary constraints that further shape the structure of the underlying DNA. We were able to capture these constraints through the application of a recently introduced structural property that is related to the symmetry of DNA curvature. Furthermore, we found that both consistently positioned nucleosomes and their adjacent nucleosome-free regions show an increased tendency towards conservation of this structural feature. © 2010 Nikolaou et al; licensee BioMed Central Ltd.", 
                "date": "2010-11-15T00:00:00Z", 
                "citationCount": 13, 
                "authors": [
                    {
                        "name": "Nikolaou C."
                    }, 
                    {
                        "name": "Althammer S."
                    }, 
                    {
                        "name": "Beato M."
                    }, 
                    {
                        "name": "Guigo R."
                    }
                ], 
                "journal": "Epigenetics and Chromatin"
            }
        }
    ], 
    "credit": [
        {
            "name": "Christoforos Nikolau", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Sonja Althammer", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Developer"
            ], 
            "note": null
        }, 
        {
            "name": "Lab Roderic Guigo Group", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": "Computational Biology of RNA processing @ Centre for Genomic Regulation Parc de Recerca Biomedica: Dr. Aiguader, 88, 08003 Barcelona"
        }, 
        {
            "name": "crg.eu", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Sonja Althammer", 
            "email": "sonja.althammer@gmail.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "francisco.camara@crg.eu", 
    "additionDate": "2016-04-22T13:42:59Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}