{
    "additionDate": "2015-02-16T10:07:53Z",
    "biotoolsCURIE": "biotools:maxocc",
    "biotoolsID": "maxocc",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Web portal for maximum occurrence analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.wenmr.eu/wenmr/maximum-occurrence-calculations-maxocc-web-portal"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Maximum Occurrence (MaxOcc) refers to a method for making rigorous numerical assessments about the maximum percent of time that a conformer of a flexible macromolecule can exist and still be compatible with the experimental data. Maximum Occurrence of a conformer is defined as the maximum weight that it can have in one ensemble that matches the average experimental data. To evaluate the Maximum Occurrence, an ensemble is sought so that the conformation under investigation is contained up to a certain value. At the Maximum Occurrence, no solution will be found fulfilling both the requisites of containing the desired conformation and of being compatible with the experimental data. Such process is exemplified in figure: the four boxes represent 4 different ensembles, containing the desired conformation (represented as a red star) at different weight (represented by the dimension of the red star): the fourth one is no more compatible with the experimental data.",
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "http://py-enmr.cerm.unifi.it/access/index/maxocc",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "MaxOcc",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1021/ja1063923",
            "metadata": {
                "abstract": "The concept of maximum occurrence (MO), i.e., the maximum percent of time that flexible proteins can spend in any given conformation, is introduced, and a rigorous method is developed to extensively sample the conformational space and to construct MO maps from experimental data. The method is tested in a case study, the flexible two-domain protein calmodulin (CaM), using SAXS and NMR data (i.e., pseudocontact shifts and self-orientation residual dipolar couplings arising from the presence of paramagnetic lanthanide ions), revealing that the \"closed\" and \"fully extended\" conformations trapped in the crystalline forms of CaM have MOs of only 5 and 15%, respectively. Compact conformations in general have small MOs, whereas some extended conformations have MO as high as 35%, strongly suggesting these conformations to be most abundant in solution. The method is universally applicable as it requires only standard SAXS data and specific NMR data on lanthanide derivatives of the protein (using native metal sites or lanthanide tagging). The computer program is publicly available using the grid computing infrastructure through the authors' Web portal. © 2010 American Chemical Society.",
                "authors": [
                    {
                        "name": "Bertini I."
                    },
                    {
                        "name": "Giachetti A."
                    },
                    {
                        "name": "Luchinat C."
                    },
                    {
                        "name": "Parigi G."
                    },
                    {
                        "name": "Petoukhov M.V."
                    },
                    {
                        "name": "Pierattelli R."
                    },
                    {
                        "name": "Ravera E."
                    },
                    {
                        "name": "Svergun D.I."
                    }
                ],
                "citationCount": 129,
                "date": "2010-09-29T00:00:00Z",
                "journal": "Journal of the American Chemical Society",
                "title": "Conformational space of flexible biological macromolecules from average data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
