
{
    "credit": [
        {
            "email": "tim28@pitt.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.pitt.edu/~tsengweb/MetaOmicsManual.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Quality control",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Studies",
                "uri": "http://edamontology.org/topic_3678"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/metaqc-0-1-6-quality-control-diagnosis-microarray-meta-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Genomic meta-analysis to combine relevant and homogeneous studies has been widely applied, but the quality control (QC) and objective inclusion/exclusion criteria have been largely overlooked. Currently, the inclusion/exclusion criteria mostly depend on ad-hoc expert opinion or naïve threshold by sample size or platform. There are pressing needs to develop a systematic QC methodology as the decision of study inclusion greatly impacts the final meta-analysis outcome. In this article, we propose six quantitative quality control measures, covering internal homogeneity of coexpression structure among studies, external consistency of coexpression pattern with pathway database, and accuracy and consistency of differentially expressed gene detection or enriched pathway identification. Each quality control index is defined as the minus log transformed P values from formal hypothesis testing. Principal component analysis biplots and a standardized mean rank are applied to assist visualization and decision. We applied the proposed method to 4 large-scale examples, combining 7 brain cancer, 9 prostate cancer, 8 idiopathic pulmonary fibrosis and 17 major depressive disorder studies, respectively. The identified problematic studies were further scrutinized for potential technical or biological causes of their lower quality to determine their exclusion from meta-analysis. The application and simulation results concluded a systematic quality assessment framework for genomic meta-analysis. © The Author(s) 2011. Published by Oxford University Press.",
            "authors": [
                "Kang D.D.",
                "Sibille E.",
                "Kaminski N.",
                "Tseng G.C."
            ],
            "cit_count": 37,
            "doi": "10.1093/nar/gkr1071",
            "journal": "Nucleic Acids Research",
            "title": "MetaQC: Objective quality control and inclusion/exclusion criteria for genomic meta-analysis",
            "type": "Primary",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metaqc",
        "biotoolsID": "metaqc",
        "description": "MetaQC: A diagnosis tool for assessing quality of genomic studies for meta-analysis and determining inclusion/exclusion criteria.",
        "homepage": "http://www.pitt.edu/~tsengweb/MetaOmicsHome.htm",
        "name": "MetaQC",
        "version": [
            "0.1.13"
        ]
    }
}