{
    "accessibility": "Open access",
    "additionDate": "2019-02-23T11:12:08Z",
    "biotoolsCURIE": "biotools:easyFRAP-web",
    "biotoolsID": "easyFRAP-web",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "easyfrap@upatras.gr",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "EasyFRAP-web is a web-based application which enables fast and interactive qualitative and quantitative analysis of Fluorecence Recovery After Photobleaching (FRAP) data. EasyFRAP-web allows large data-sets to be rapidly evaluated and normalized fluorescence recovery curves to be generated and exported. It also performs curve fitting and provides quantitative parameters (mobile fraction and recovery half time) necessary for comparison across data-sets.",
    "documentation": [
        {
            "note": "How to use guide",
            "type": [
                "User manual"
            ],
            "url": "https://easyfrap.vmnet.upatras.gr/GettingStarted/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://easyfrap.vmnet.upatras.gr/easyfrap_web_manual_appendix.pdf"
        },
        {
            "type": [
                "FAQ"
            ],
            "url": "https://easyfrap.vmnet.upatras.gr/FAQ/"
        },
        {
            "note": "About easyFRAP-web",
            "type": [
                "General"
            ],
            "url": "https://easyfrap.vmnet.upatras.gr/About"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Experimental measurement",
                        "uri": "http://edamontology.org/data_3108"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://easyfrap.vmnet.upatras.gr/",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "note": "Stand-alone version for batch analysis",
            "type": [
                "Other"
            ],
            "url": "http://ccl.med.upatras.gr/index.php?id=easyfrap"
        }
    ],
    "maturity": "Mature",
    "name": "easyFRAP-web",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "lygerou",
    "publication": [
        {
            "doi": "10.1093/nar/gky508",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.Understanding protein dynamics is crucial in order to elucidate protein function and interactions. Advances in modern microscopy facilitate the exploration of the mobility of fluorescently tagged proteins within living cells. Fluorescence recovery after photobleaching (FRAP) is an increasingly popular functional live-cell imaging technique which enables the study of the dynamic properties of proteins at a single-cell level. As an increasing number of labs generate FRAP datasets, there is a need for fast, interactive and user-friendly applications that analyze the resulting data. Here we present easyFRAP-web, a web application that simplifies the qualitative and quantitative analysis of FRAP datasets. EasyFRAP-web permits quick analysis of FRAP datasets through an intuitive web interface with interconnected analysis steps (experimental data assessment, different types of normalization and estimation of curve-derived quantitative parameters). In addition, easyFRAP-web provides dynamic and interactive data visualization and data and figure export for further analysis after every step. We test easyFRAP-web by analyzing FRAP datasets capturing the mobility of the cell cycle regulator Cdt2 in the presence and absence of DNA damage in cultured cells. We show that easyFRAP-web yields results consistent with previous studies and highlights cell-to-cell heterogeneity in the estimated kinetic parameters. EasyFRAP-web is platform-independent and is freely accessible at: https://easyfrap.vmnet.upatras.gr/.",
                "authors": [
                    {
                        "name": "Koulouras G."
                    },
                    {
                        "name": "Panagopoulos A."
                    },
                    {
                        "name": "Rapsomaniki M.A."
                    },
                    {
                        "name": "Giakoumakis N.N."
                    },
                    {
                        "name": "Taraviras S."
                    },
                    {
                        "name": "Lygerou Z."
                    }
                ],
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EasyFRAP-web: A web-based tool for the analysis of fluorescence recovery after photobleaching data"
            },
            "pmcid": "PMC6030846",
            "pmid": "29901776",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "validated": 1
}