{
    "additionDate": "2021-01-18T09:44:03Z",
    "biotoolsCURIE": "biotools:qdrip",
    "biotoolsID": "qdrip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cimprich@stanford.edu",
            "name": "Karlene A Cimprich",
            "orcidid": "https://orcid.org/0000-0002-1937-2969",
            "typeEntity": "Person"
        }
    ],
    "description": "a method to quantitatively assess RNA-DNA hybrid formation genome-wide.\n\nR-loops are dynamic, co-transcriptional nucleic acid structures that facilitate physiological processes but can also cause DNA damage in certain contexts. Perturbations of transcription or R-loop resolution are expected to change their genomic distribution. Next-generation sequencing approaches to map RNA-DNA hybrids, a component of R-loops, have so far not allowed quantitative comparisons between such conditions. Here, we describe quantitative differential DNA-RNA immunoprecipitation (qDRIP), a method combining synthetic RNA-DNA-hybrid internal standards with high-resolution, strand-specific sequencing. We show that qDRIP avoids biases inherent to read-count normalization by accurately profiling signal in regions unaffected by transcription inhibition in human cells, and by facilitating accurate differential peak calling between conditions",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cimprichlab/crossley_et_al_2019",
    "lastUpdate": "2021-03-19T16:05:12Z",
    "name": "qDRIP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA500",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.R-loops are dynamic, co-transcriptional nucleic acid structures that facilitate physiological processes but can also cause DNA damage in certain contexts. Perturbations of transcription or R-loop resolution are expected to change their genomic distribution. Next-generation sequencing approaches to map RNA-DNA hybrids, a component of R-loops, have so far not allowed quantitative comparisons between such conditions. Here, we describe quantitative differential DNA-RNA immunoprecipitation (qDRIP), a method combining synthetic RNA-DNA-hybrid internal standards with high-resolution, strand-specific sequencing. We show that qDRIP avoids biases inherent to read-count normalization by accurately profiling signal in regions unaffected by transcription inhibition in human cells, and by facilitating accurate differential peak calling between conditions. We also use these quantitative comparisons to make the first estimates of the absolute count of RNA-DNA hybrids per cell and their half-lives genome-wide. Finally, we identify a subset of RNA-DNA hybrids with high GC skew which are partially resistant to RNase H. Overall, qDRIP allows for accurate normalization in conditions where R-loops are perturbed and for quantitative measurements that provide previously unattainable biological insights.",
                "authors": [
                    {
                        "name": "Crossley M.P."
                    },
                    {
                        "name": "Bocek M.J."
                    },
                    {
                        "name": "Hamperl S."
                    },
                    {
                        "name": "Swigut T."
                    },
                    {
                        "name": "Cimprich K.A."
                    }
                ],
                "citationCount": 4,
                "date": "2020-08-20T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "QDRIP: A method to quantitatively assess RNA-DNA hybrid formation genome-wide"
            },
            "pmcid": "PMC7641308",
            "pmid": "32544226"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ]
}