{
    "additionDate": "2019-11-14T18:38:31Z",
    "biotoolsCURIE": "biotools:SUAPRO",
    "biotoolsID": "SUAPRO",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'sustainability' | Sustainability assessment procedure for operations and production processes (SUAPRO) | Sustainability assessment is a fundamental step to support decisions towards sustainable development, and several procedures to assess the sustainability of antrophic production systems have been suggested. However, most of them lack a scientific-based construct supporting their conceptual model of sustainability, which usually results in a choice of indicator(s) without criterion that can best represent a fraction of the larger and deeper concept of sustainability. This work proposes a novel framework, named Sustainability Assessment Procedure for Operations and Production Processes (SUAPRO), supported by the PDCA four-step management method (plan, do, check, and act) and the five sectors sustainability (5SEnSU) model",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31390692",
    "lastUpdate": "2019-11-14T18:38:31Z",
    "name": "SUAPRO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.SCITOTENV.2019.06.261",
            "metadata": {
                "abstract": "© 2019Sustainability assessment is a fundamental step to support decisions towards sustainable development, and several procedures to assess the sustainability of antrophic production systems have been suggested. However, most of them lack a scientific-based construct supporting their conceptual model of sustainability, which usually results in a choice of indicator(s) without criterion that can best represent a fraction of the larger and deeper concept of sustainability. This work proposes a novel framework, named Sustainability Assessment Procedure for Operations and Production Processes (SUAPRO), supported by the PDCA four-step management method (plan, do, check, and act) and the five sectors sustainability (5SEnSU) model. Grounded on scientific bases, SUAPRO provides the steps for a sustainability assessment, including its contextualization (objectives, functional unit, boundaries, energy diagram), the choice of indicators based on the 5SEnSU model, the quantification step including goal programming as a multicriteria tool, and conclude the first cycle with a sensitivity analysis. To illustrate an application of SUAPRO, the road and railroad transportation options for soybean in Brazil are considered as a case study. Results show that the railroad mode has better performance as for the Sustainability Synthetic Indicator (SSIS of 3.6 ± 0.4) than the road mode (SSIS of 4.0 ± 0.3). Towards a SSIS improvement, the sensitivity analysis highlights that public policies or even private actions should be mainly focused on reducing the emergy invested in the railroad system, while the road transportation option claims effort in reducing its global warming and acidification potentials. SUAPRO is the main contribution in this work, as it tries to overcome shortcomings as usually found in scientific papers aiming to assess the sustainability of antrophic systems. The subjectivity inherent in any multicriteria method is present as the main limitation, thus all criteria used in choosing weights must be clearly presented.",
                "authors": [
                    {
                        "name": "Agostinho F."
                    },
                    {
                        "name": "Richard Silva T."
                    },
                    {
                        "name": "Almeida C.M.V.B."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Giannetti B.F."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "Science of the Total Environment",
                "title": "Sustainability assessment procedure for operations and production processes (SUAPRO)"
            },
            "pmid": "31390692"
        }
    ]
}