{
    "additionDate": "2020-09-07T11:40:01Z",
    "biotoolsCURIE": "biotools:binsanity",
    "biotoolsID": "binsanity",
    "credit": [
        {
            "email": "egraham147@gmail.com",
            "name": "Elaina Graham"
        }
    ],
    "description": "Unsupervised Clustering of Environmental Microbial Assemblies Using Coverage and Affinity Propagation",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://github.com/edgraham/BinSanity/wiki"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://groups.google.com/forum/#!forum/binsanity"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/edgraham/BinSanity/wiki"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/edgraham/BinSanity"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "homepage": "https://github.com/edgraham/BinSanity",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-09-07T11:40:01Z",
    "license": "GPL-3.0",
    "name": "BinSanity",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Gensoft @Institut Pasteur",
    "publication": [
        {
            "doi": "10.7717/peerj.3035",
            "metadata": {
                "abstract": "© 2017 Graham et al.Metagenomics has become an integral part of defining microbial diversity in various environments. Many ecosystems have characteristically low biomass and few cultured representatives. Linking potential metabolisms to phylogeny in environmental microorganisms is important for interpreting microbial community functions and the impacts these communities have on geochemical cycles. However, with metagenomic studies there is the computational hurdle of 'binning' contigs into phylogenetically related units or putative genomes. Binning methods have been implemented with varying approaches such as k-means clustering, Gaussian mixture models, hierarchical clustering, neural networks, and two-way clustering however, many of these suffer from biases against low coverage/abundance organisms and closely related taxa/strains. We are introducing a new binning method, BinSanity, that utilizes the clustering algorithm affinity propagation (AP), to cluster assemblies using coverage with compositional based refinement (tetranucleotide frequency and percent GC content) to optimize bins containing multiple source organisms. This separation of composition and coverage based clustering reduces bias for closely related taxa. BinSanity was developed and tested on artificial metagenomes varying in size and complexity. Results indicate that BinSanity has a higher precision, recall, and Adjusted Rand Index compared to five commonly implemented methods. When tested on a previously published environmental metagenome, BinSanity generated high completion and low redundancy bins corresponding with the published metagenome-assembled genomes.",
                "authors": [
                    {
                        "name": "Graham E.D."
                    },
                    {
                        "name": "Heidelberg J.F."
                    },
                    {
                        "name": "Tully B.J."
                    }
                ],
                "citationCount": 43,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Binsanity: Unsupervised clustering of environmental microbial assemblies using coverage and affinity propagation"
            }
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}