{"credit":[{"name":"Contact Form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://genofab.com/contact-genofab/"}],"function":[{"operation":[{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"},{"term":"Genetic mapping","uri":"http://edamontology.org/operation_0282"}]}],"labels":{"language":["JavaScript","PHP","C++"],"operatingSystem":["Linux"],"toolType":["Web application"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"}]},"publication":[{"abstract":"Chemical synthesis of custom DNA made to order calls for software streamlining the design of synthetic DNA sequences. GenoCAD™ (www.genocad.org) is a free web-based application to design protein expression vectors, artificial gene networks and other genetic constructs composed of multiple functional blocks called genetic parts. By capturing design strategies in grammatical models of DNA sequences, GenoCAD guides the user through the design process. By successively clicking on icons representing structural features or actual genetic parts, complex constructs composed of dozens of functional blocks can be designed in a matter of minutes. GenoCAD automatically derives the construct sequence from its comprehensive libraries of genetic parts. Upon completion of the design process, users can download the sequence for synthesis or further analysis. Users who elect to create a personal account on the system can customize their workspace by creating their own parts libraries, adding new parts to the libraries, or reusing designs to quickly generate sets of related constructs.","authors":["Czar M.J.","Cai Y.","Peccoud J."],"cit_count":90,"journal":"Nucleic Acids Research","pmid":"19429897","title":"Writing DNA with genoCAD™","year":"2009-08-04"},{"abstract":"Motivation: The sequence of artificial genetic constructs is composed of multiple functional fragments, or genetic parts, involved in different molecular steps of gene expression mechanisms. Biologists have deciphered structural rules that the design of genetic constructs needs to follow in order to ensure a successful completion of the gene expression process, but these rules have not been formalized, making it challenging for non-specialists to benefit from the recent progress in gene synthesis. Results: We show that context-free grammars (CFG) can formalize these design principles. This approach provides a path to organizing libraries of genetic parts according to their biological functions, which correspond to the syntactic categories of the CFG. It also provides a framework for the systematic design of new genetic constructs consistent with the design principles expressed in the CFG. Using parsing algorithms, this syntactic model enables the verification of existing constructs. We illustrate these possibilities by describing a CFG that generates the most common architectures of genetic constructs in Escherichia coli. © The Author 2007. Published by Oxford University Press. All rights reserved.","authors":["Cai Y.","Hartnett B.","Gustafsson C.","Peccoud J."],"cit_count":66,"journal":"Bioinformatics","pmid":"17804435","title":"A syntactic model to design and verify synthetic genetic constructs derived from standard biological parts","year":"2007-10-15"},{"abstract":"One of the foundations of synthetic biology is the project to develop libraries of standardized genetic parts that could be assembled quickly and cheaply into large systems. The limitations of the initial BioBrick standard have prompted the development of multiple new standards proposing different avenues to overcome these shortcomings. The lack of compatibility between standards, the compliance of parts with only some of the standards or even the type of constructs that each standard supports have significantly increased the complexity of assembling constructs from standardized parts. Here, we describe computer tools to facilitate the rigorous description of part compositions in the context of a rapidly changing landscape of physical construction methods and standards. A contextfree grammar has been developed to model the structure of constructs compliant with six popular assembly standards. Its implementation in GenoCAD makes it possible for users to quickly assemble from a rich library of genetic parts, constructs compliant with any of six existing standards. © The Author(s) 2010. Published by Oxford University Press.","authors":["Cai Y.","Wilson M.L.","Peccoud J."],"cit_count":49,"journal":"Nucleic Acids Research","pmid":"20167639","title":"GenoCAD for iGEM: A grammatical approach to the design of standard-compliant constructs","year":"2010-02-18"},{"abstract":"GenoCAD is an open source web-based system that provides a streamlined, rule-driven process for designing genetic sequences. GenoCAD provides a graphical interface that allows users to design sequences consistent with formalized design strategies specific to a domain, organization, or project. Design strategies include limited sets of user-defined parts and rules indicating how these parts are to be combined in genetic constructs. In addition to reducing design time to minutes, GenoCAD improves the quality and reliability of the finished sequence by ensuring that the designs follow established rules of sequence construction. GenoCAD.org is a publicly available instance of GenoCAD that can be found at www.genocad.org. The source code and latest build are available from SourceForge to allow advanced users to install and customize GenoCAD for their unique needs. This chapter focuses primarily on how the GenoCAD tools can be used to organize genetic parts into customized personal libraries, then how these libraries can be used to design sequences. In addition, GenoCAD's parts management system and search capabilities are described in detail. Instructions are provided for installing a local instance of GenoCAD on a server. Some of the future enhancements of this rapidly evolving suite of applications are briefly described. © 2011 Elsevier Inc. All rights reserved.","authors":["Wilson M.L.","Hertzberg R.","Adam L.","Peccoud J."],"cit_count":4,"journal":"Methods in Enzymology","pmid":"21601678","title":"A step-by-step introduction to rule-based design of synthetic genetic constructs using GenoCAD","year":"2011-05-30"}],"summary":{"biotoolsCURIE":"biotools:genocad","biotoolsID":"genocad","description":"Web-based application for designing protein expression vectors, artificial gene networks and other genetic constructs composed of multiple functional blocks. Users can download the designed sequence for synthesis or further analysis. Users can also create personal accounts and thus can customize their workspace.","homepage":"http://www.genocad.org","name":"GenoCAD"}}