{
    "additionDate": "2021-09-28T17:48:35.611567Z",
    "biotoolsCURIE": "biotools:ingap-family",
    "biotoolsID": "ingap-family",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qij@fudan.edu.cn",
            "name": "Ji Qi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "inGAP-family is a tool for accurate detection of meiotic recombination loci and causal mutations by filtering out artificial variants due to genome complexities. inGAP-family provides an efficient and effective framework to discover, filter and visualize DNA polymorphisms and structural variants from alignment of short reads. Applying this method on polymorphism detection on real datasets shows that elimination of artificial variants greatly facilitates the precise identification of meiotic recombination points, recognizing causal mutations in mutant genomes or QTL loci. In addition, inGAP-family provides user-friendly graphical interface for detection of polymorphisms and structural variants, and for further evaluation of predicted variants and identification of mutations related to genotypes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/ingap-family/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-24T20:18:53.119013Z",
    "name": "inGAP-family",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2019.11.014",
            "metadata": {
                "abstract": "Accurately identifying DNA polymorphisms can bridge the gap between phenotypes and genotypes and is essential for molecular marker assisted genetic studies. Genome complexities, including large-scale structural variations, bring great challenges to bioinformatic analysis for obtaining high-confidence genomic variants, as sequence differences between non-allelic loci of two or more genomes can be misinterpreted as polymorphisms. It is important to correctly filter out artificial variants to avoid false genotyping or estimation of allele frequencies. Here, we present an efficient and effective framework, inGAP-family, to discover, filter, and visualize DNA polymorphisms and structural variants (SVs) from alignment of short reads. Applying this method to polymorphism detection on real datasets shows that elimination of artificial variants greatly facilitates the precise identification of meiotic recombination points as well as causal mutations in mutant genomes or quantitative trait loci. In addition, inGAP-family provides a user-friendly graphical interface for detecting polymorphisms and SVs, further evaluating predicted variants and identifying mutations related to genotypes. It is accessible at https://sourceforge.net/projects/ingap-family/.",
                "authors": [
                    {
                        "name": "Chang F."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Lian Q."
                    },
                    {
                        "name": "Qi J."
                    }
                ],
                "citationCount": 9,
                "date": "2022-06-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "inGAP-family: Accurate Detection of Meiotic Recombination Loci and Causal Mutations by Filtering Out Artificial Variants due to Genome Complexities"
            },
            "pmcid": "PMC9801030",
            "pmid": "33711466",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
