{
    "additionDate": "2018-05-03T17:46:47Z",
    "biotoolsCURIE": "biotools:elviz",
    "biotoolsID": "elviz",
    "credit": [
        {
            "name": "Contact form (Comments / Questions)",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://genome.jgi.doe.gov/viz/#"
        }
    ],
    "description": "Exploration of metagenome assemblies with an interactive visualization tool",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://genome.jgi.doe.gov/viz/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "https://genome.jgi.doe.gov/viz/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "Elviz",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0566-4",
            "metadata": {
                "abstract": "© 2015 Cantor et al.; licensee BioMed Central.Background: Metagenomics, the sequencing of DNA collected from an entire microbial community, enables the study of natural microbial consortia in their native habitats. Metagenomics studies produce huge volumes of data, including both the sequences themselves and metadata describing their abundance, assembly, predicted functional characteristics and environmental parameters. The ability to explore these data visually is critically important to meaningful biological interpretation. Current genomics applications cannot effectively integrate sequence data, assembly metadata, and annotation to support both genome and community-level inquiry. Results: Elviz (Environmental Laboratory Visualization) is an interactive web-based tool for the visual exploration of assembled metagenomes and their complex metadata. Elviz allows scientists to navigate metagenome assemblies across multiple dimensions and scales, plotting parameters such as GC content, relative abundance, phylogenetic affiliation and assembled contig length. Furthermore Elviz enables interactive exploration using real-time plot navigation, search, filters, axis selection, and the ability to drill from a whole-community profile down to individual gene annotations. Thus scientists engage in a rapid feedback loop of visual pattern identification, hypothesis generation, and hypothesis testing. Conclusions: Compared to the current alternative of generating a succession of static figures, Elviz can greatly accelerate the speed of metagenome analysis. Elviz can be used to explore both user-submitted datasets and numerous metagenome studies publicly available at the Joint Genome Institute (JGI). Elviz is freely available at http://genome.jgi.doe.gov/vizand runs on most current web-browsers.",
                "authors": [
                    {
                        "name": "Cantor M."
                    },
                    {
                        "name": "Nordberg H."
                    },
                    {
                        "name": "Smirnova T."
                    },
                    {
                        "name": "Hess M."
                    },
                    {
                        "name": "Tringe S."
                    },
                    {
                        "name": "Dubchak I."
                    }
                ],
                "citationCount": 6,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Elviz - exploration of metagenome assemblies with an interactive visualization tool"
            },
            "pmcid": "PMC4432942",
            "pmid": "25928663"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}