{
    "additionDate": "2021-03-19T09:20:26Z",
    "biotoolsCURIE": "biotools:semicomprisks",
    "biotoolsID": "semicomprisks",
    "confidence_flag": "tool",
    "description": "An R Package for the Analysis of Independent and Cluster-correlated Semi-competing Risks Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=SemiCompRisks",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-08T12:12:01Z",
    "license": "GPL-2.0",
    "name": "SemiCompRisks",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.32614/RJ-2019-038",
            "metadata": {
                "abstract": "© 2019, Technische Universitaet Wien.Semi-competing risks refer to the setting where primary scientific interest lies in estimation and inference with respect to a non-terminal event, the occurrence of which is subject to a terminal event. In this paper, we present the R package SemiCompRisks that provides functions to perform the analysis of independent/clustered semi-competing risks data under the illness-death multi-state model. The package allows the user to choose the specification for model components from a range of options giving users substantial flexibility, including: accelerated failure time or proportional hazards regression models; parametric or non-parametric specifications for baseline survival functions; parametric or non-parametric specifications for random effects distributions when the data are clustercorrelated; and, a Markov or semi-Markov specification for terminal event following non-terminal event. While estimation is mainly performed within the Bayesian paradigm, the package also provides the maximum likelihood estimation for select parametric models. The package also includes functions for univariate survival analysis as complementary analysis tools.",
                "authors": [
                    {
                        "name": "Alvares D."
                    },
                    {
                        "name": "Haneuse S."
                    },
                    {
                        "name": "Lee C."
                    },
                    {
                        "name": "Lee K.H."
                    }
                ],
                "citationCount": 5,
                "date": "2019-06-01T00:00:00Z",
                "journal": "R Journal",
                "title": "SemiCompRisks: An R package for the analysis of independent and cluster-correlated semi-competing risks data"
            },
            "pmcid": "PMC7889044",
            "pmid": "33604061"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
