{"credit":[{"email":"khan@inha.ac.kr","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bclab.inha.ac.kr/"}],"documentation":[{"type":"GENERAL","url":"http://bclab.inha.ac.kr/ModuleSearch/"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/modulesearch-finding-functional-modules-in-protein-protein-interaction-network.html"}],"publication":[{"abstract":"Many biological processes are performed by a group of proteins rather than by individual proteins. Proteins involved in the same biological process often form a densely connected sub-graph in a protein-protein interaction network. Therefore, finding a dense sub-graph provides useful information to predict the function or protein complex of uncharacterised proteins in the sub-graph. We developed a heuristic algorithm that finds functional modules in a protein-protein interaction network and visualises the modules. The algorithm has been implemented in a platform-independent, standalone program called ModuleSearch. In an interaction network of yeast proteins, ModuleSearch found 366 overlapping modules. Of the modules, 71% have a function shared by more than half the proteins in the module and 58% have a function shared by all proteins in the module. Comparison of ModuleSearch with other programs shows that ModuleSearch finds more sub-graphs than most other programs, yet a higher proportion of the sub-graphs correspond to known functional modules. ModuleSearch and sample data are freely available to academics at http://bclab.inha.ac.kr/ModuleSearch. © 2012 Copyright Taylor and Francis Group, LLC.","authors":["Cui G.","Shrestha R.","Han K."],"cit_count":3,"journal":"Computer Methods in Biomechanics and Biomedical Engineering","pmid":"21827286","title":"ModuleSearch: Finding functional modules in a protein-protein interaction network","year":"2012-07-01"}],"summary":{"biotoolsCURIE":"biotools:modulesearch","biotoolsID":"modulesearch","description":"Software for finding cliques and near-cliques in a protein-protein interaction network.","homepage":"http://bclab.inha.ac.kr/ModuleSearch/","name":"ModuleSearch"}}