{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:56:15Z",
    "biotoolsCURIE": "biotools:primor",
    "biotoolsID": "primor",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Juan Felipe Pérez Juste Abascal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/7537582-juan-felipe-perez-juste-abascal"
        }
    ],
    "description": "PRIMOR method combines image respiratory gated CT reconstruction and motion estimation in a single algorithm",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/60102-hggm-lim-prior-motion-reconstruction-ct",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T20:23:38.419165Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/HGGM-LIM/prior-motion-reconstruction-CT/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/HGGM-LIM/prior-motion-reconstruction-CT"
        }
    ],
    "name": "PRIMOR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0149841",
            "metadata": {
                "abstract": "Low-dose protocols for respiratory gating in cardiothoracic small-animal imaging lead to streak artifacts in the images reconstructed with a Feldkamp-Davis-Kress (FDK) method. We propose a novel prior- and motion-based reconstruction (PRIMOR) method, which improves prior-based reconstruction (PBR) by adding a penalty function that includes a model of motion. The prior image is generated as the average of all the respiratory gates, reconstructed with FDK. Motion between respiratory gates is estimated using a nonrigid registration method based on hierarchical B-splines. We compare PRIMOR with an equivalent PBR method without motion estimation using as reference the reconstruction of high dose data. From these data acquired with a micro-CT scanner, different scenarios were simulated by changing photon flux and number of projections. Methods were evaluated in terms of contrast-to-noise-ratio (CNR), mean square error (MSE), streak artefact indicator (SAI), solution error norm (SEN), and correction of respiratory motion. Also, to evaluate the effect of each method on lung studies quantification, we have computed the Jaccard similarity index of the mask obtained from segmenting each image as compared to those obtained from the high dose reconstruction. Both iterative methods greatly improved FDK reconstruction in all cases. PBR was prone to streak artifacts and presented blurring effects in bone and lung tissues when using both a low number of projections and low dose. Adopting PBR as a reference, PRIMOR increased CNR up to 33% and decreased MSE, SAI and SEN up to 20%, 4% and 13%, respectively. PRIMOR also presented better compensation for respiratory motion and higher Jaccard similarity index. In conclusion, the new method proposed for low-dose respiratory gating in small-animal scanners shows an improvement in image quality and allows a reduction of dose or a reduction of the number of projections between two and three times with respect to previous PBR approaches.",
                "authors": [
                    {
                        "name": "Abascal J.F.P.J."
                    },
                    {
                        "name": "Abella M."
                    },
                    {
                        "name": "Desco M."
                    },
                    {
                        "name": "Marinetto E."
                    },
                    {
                        "name": "Pascau J."
                    }
                ],
                "citationCount": 11,
                "date": "2016-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A novel prior- and motion-based compressed sensing method for small-animal respiratory gated CT"
            },
            "pmcid": "PMC4784891",
            "pmid": "26959370",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "version": [
        "1.0.0.0"
    ]
}
