{
    "accessibility": "Open access",
    "additionDate": "2023-02-28T14:05:18.412675Z",
    "biotoolsCURIE": "biotools:coxmkf",
    "biotoolsID": "coxmkf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhhliu@hku.hk",
            "name": "Zhonghua Liu",
            "typeEntity": "Person"
        },
        {
            "name": "Minhao Yao"
        },
        {
            "name": "Peixin Tian"
        },
        {
            "name": "Tao Huang"
        }
    ],
    "description": "A Knockoff Filter for High-Dimensional Mediation Analysis with a Survival Outcome in Epigenetic Studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MinhaoYaooo/CoxMKF",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-02-28T14:05:18.415043Z",
    "license": "Not licensed",
    "name": "CoxMKF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac687",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: It is of scientific interest to identify DNA methylation CpG sites that might mediate the effect of an environmental exposure on a survival outcome in high-dimensional mediation analysis. However, there is a lack of powerful statistical methods that can provide a guarantee of false discovery rate (FDR) control in finite-sample settings. RESULTS: In this article, we propose a novel method called CoxMKF, which applies aggregation of multiple knockoffs to a Cox proportional hazards model for a survival outcome with high-dimensional mediators. The proposed CoxMKF can achieve FDR control even in finite-sample settings, which is particularly advantageous when the sample size is not large. Moreover, our proposed CoxMKF can overcome the randomness of the unstable model-X knockoffs. Our simulation results show that CoxMKF controls FDR well in finite samples. We further apply CoxMKF to a lung cancer dataset from The Cancer Genome Atlas (TCGA) project with 754 subjects and 365 306 DNA methylation CpG sites, and identify four DNA methylation CpG sites that might mediate the effect of smoking on the overall survival among lung cancer patients. AVAILABILITY AND IMPLEMENTATION: The R package CoxMKF is publicly available at https://github.com/MinhaoYaooo/CoxMKF. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Tian P."
                    },
                    {
                        "name": "Yao M."
                    }
                ],
                "citationCount": 1,
                "date": "2022-11-30T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "CoxMKF: a knockoff filter for high-dimensional mediation analysis with a survival outcome in epigenetic studies"
            },
            "pmid": "36255264"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
