{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-06-08T08:29:10.588581Z",
    "biotoolsCURIE": "biotools:2b-alert_web",
    "biotoolsID": "2b-alert_web",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "jaques.reifman.civ@mail.mil",
            "name": "Jaques Reifman",
            "orcidid": "https://orcid.org/0000-0001-7292-2029",
            "typeEntity": "Person"
        }
    ],
    "description": "2B-Alert Web, an open-access tool for predicting neurobehavioral performance, which accounts for the effects of sleep/wake schedules, time of day, and caffeine consumption, while incorporating the latest scientific findings in sleep restriction, sleep extension, and recovery sleep.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://2b-alert-web.bhsai.org",
    "lastUpdate": "2022-06-08T08:29:10.591453Z",
    "name": "2B-Alert Web",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.2196/29595",
            "metadata": {
                "abstract": "©Jaques Reifman, Kamal Kumar, Luke Hartman, Andrew Frock, Tracy J Doty, Thomas J Balkin, Sridhar Ramakrishnan, Francisco G Vital-Lopez.Background: One-third of the US population experiences sleep loss, with the potential to impair physical and cognitive performance, reduce productivity, and imperil safety during work and daily activities. Computer-based fatigue-management systems with the ability to predict the effects of sleep schedules on alertness and identify safe and effective caffeine interventions that maximize its stimulating benefits could help mitigate cognitive impairment due to limited sleep. To provide these capabilities to broad communities, we previously released 2B-Alert Web, a publicly available tool for predicting the average alertness level of a group of individuals as a function of time of day, sleep history, and caffeine consumption. Objective: In this study, we aim to enhance the capability of the 2B-Alert Web tool by providing the means for it to automatically recommend safe and effective caffeine interventions (time and dose) that lead to optimal alertness levels at user-specified times under any sleep-loss condition. Methods: We incorporated a recently developed caffeine-optimization algorithm into the predictive models of the original 2B-Alert Web tool, allowing the system to search for and identify viable caffeine interventions that result in user-specified alertness levels at desired times of the day. To assess the potential benefits of this new capability, we simulated four sleep-deprivation conditions (sustained operations, restricted sleep with morning or evening shift, and night shift with daytime sleep) and compared the alertness levels resulting from the algorithm’s recommendations with those based on the US Army caffeine-countermeasure guidelines. In addition, we enhanced the usability of the tool by adopting a drag-and-drop graphical interface for the creation of sleep and caffeine schedules. Results: For the 4 simulated conditions, the 2B-Alert Web–proposed interventions increased mean alertness by 36% to 94% and decreased peak alertness impairment by 31% to 71% while using equivalent or smaller doses of caffeine as the corresponding US Army guidelines. Conclusions: The enhanced capability of this evidence-based, publicly available tool increases the efficiency by which diverse communities of users can identify safe and effective caffeine interventions to mitigate the effects of sleep loss in the design of research studies and work and rest schedules.",
                "authors": [
                    {
                        "name": "Balkin T.J."
                    },
                    {
                        "name": "Doty T.J."
                    },
                    {
                        "name": "Frock A."
                    },
                    {
                        "name": "Hartman L."
                    },
                    {
                        "name": "Kumar K."
                    },
                    {
                        "name": "Ramakrishnan S."
                    },
                    {
                        "name": "Reifman J."
                    },
                    {
                        "name": "Vital-Lopez F.G."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Medical Internet Research",
                "title": "2B-Alert Web 2.0, an Open-Access Tool for Predicting Alertness and Optimizing the Benefits of Caffeine: Utility Study"
            },
            "pmcid": "PMC8832274",
            "pmid": "35084336"
        },
        {
            "doi": "10.5665/sleep.6318",
            "metadata": {
                "abstract": "Study Objectives: Computational tools that predict the effects of daily sleep/wake amounts on neurobehavioral performance are critical components of fatigue management systems, allowing for the identification of periods during which individuals are at increased risk for performance errors. However, none of the existing computational tools is publicly available, and the commercially available tools do not account for the beneficial effects of caffeine on performance, limiting their practical utility. Here, we introduce 2B-Alert Web, an open-access tool for predicting neurobehavioral performance, which accounts for the effects of sleep/wake schedules, time of day, and caffeine consumption, while incorporating the latest scientific findings in sleep restriction, sleep extension, and recovery sleep. Methods: We combined our validated Unified Model of Performance and our validated caffeine model to form a single, integrated modeling framework instantiated as a Web-enabled tool. 2B-Alert Web allows users to input daily sleep/wake schedules and caffeine consumption (dosage and time) to obtain group-average predictions of neurobehavioral performance based on psychomotor vigilance tasks. 2B-Alert Web is accessible at: https://2b-alert-web.bhsai.org. Results: The 2B-Alert Web tool allows users to obtain predictions for mean response time, mean reciprocal response time, and number of lapses. The graphing tool allows for simultaneous display of up to seven different sleep/wake and caffeine schedules. The schedules and corresponding predicted outputs can be saved as a Microsoft Excel file; the corresponding plots can be saved as an image file. The schedules and predictions are erased when the user logs off, thereby maintaining privacy and confidentiality. Conclusions: The publicly accessible 2B-Alert Web tool is available for operators, schedulers, and neurobehavioral scientists as well as the general public to determine the impact of any given sleep/wake schedule, caffeine consumption, and time of day on performance of a group of individuals. This evidencebased tool can be used as a decision aid to design effective work schedules, guide the design of future sleep restriction and caffeine studies, and increase public awareness of the effects of sleep amounts, time of day, and caffeine on alertness.",
                "authors": [
                    {
                        "name": "Balkin T.J."
                    },
                    {
                        "name": "Kumar K."
                    },
                    {
                        "name": "Ramakrishnan S."
                    },
                    {
                        "name": "Reifman J."
                    },
                    {
                        "name": "Tountas N.A."
                    },
                    {
                        "name": "Wesensten N.J."
                    }
                ],
                "citationCount": 14,
                "date": "2016-12-01T00:00:00Z",
                "journal": "Sleep",
                "title": "2B-alert web: An open-access tool for predicting the effects of sleep/wake schedules and caffeine consumption on neurobehavioral performance"
            },
            "pmcid": "PMC5103804",
            "pmid": "27634801",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
