{
    "additionDate": "2024-04-19T09:07:21.373340Z",
    "biotoolsCURIE": "biotools:lmdist",
    "biotoolsID": "lmdist",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dknights@umn.edu",
            "name": "Dan Knights",
            "orcidid": "https://orcid.org/0000-0002-8205-2511",
            "typeEntity": "Person"
        }
    ],
    "description": "Local manifold distance accurately measures beta diversity in ecological gradients.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://github.com/knights-lab/LMdist",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:03:28.128647Z",
    "license": "AGPL-3.0",
    "name": "LMdist",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad727",
            "metadata": {
                "abstract": "Motivation: Differentiating ecosystems poses a complex, high-dimensional problem constrained by capturing relevant variation across species profiles. Researchers use pairwise distances and subsequent dimensionality reduction to highlight variation in a few dimensions. Despite popularity in analysis of ecological data, these low-dimensional visualizations can contain geometric abnormalities such as \"arch\"and \"horseshoe\"effects, potentially obscuring the impact of environmental gradients. These abnormalities appear in ordination but are in fact a product of oversaturated large pairwise distances. Results: We present Local Manifold distance (LMdist), an unsupervised algorithm which adjusts pairwise beta diversity measures to better represent true ecological distances between samples. Beta diversity measures can have a bounded dynamic range in depicting long environmental gradients with high species turnover. Using a graph structure, LMdist projects pairwise distances onto a manifold and traverses the manifold surface to adjust pairwise distances at the upper end of the beta diversity measure's dynamic range. This allows for values beyond the range of the original measure. Not all datasets will have oversaturated pairwise distances, nor will capture variation that resembles a manifold, so LMdist adjusts only those pairwise values which may be undervalued in the presence of a sampled gradient. The adjusted distances serve as input for ordination and statistical testing. We demonstrate on real and simulated data that LMdist effectively recovers distances along known gradients and along complex manifolds such as the Swiss roll dataset. LMdist enables more powerful statistical tests for gradient effects and reveals variation orthogonal to the gradient.",
                "authors": [
                    {
                        "name": "Hoops S.L."
                    },
                    {
                        "name": "Knights D."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LMdist: Local Manifold distance accurately measures beta diversity in ecological gradients"
            },
            "pmcid": "PMC10713119",
            "pmid": "38060267"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Freshwater biology",
            "uri": "http://edamontology.org/topic_3573"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
