{
    "additionDate": "2017-08-03T18:48:47Z",
    "biotoolsCURIE": "biotools:mak",
    "biotoolsID": "mak",
    "credit": [
        {
            "email": "admin@idmb.tamu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This tool is designed to facilitate automated analysis of miniature inverted repeat transposable elements (MITEs).",
    "documentation": [
        {
            "type": "General",
            "url": "http://perl.idmb.tamu.edu/mak.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure analysis",
                    "uri": "http://edamontology.org/operation_2481"
                }
            ]
        }
    ],
    "homepage": "http://perl.idmb.tamu.edu/mak.htm",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mak-1-8-automated-mite-analysis.html"
        }
    ],
    "name": "MAK",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Miniature inverted repeat transposable elements (MITEs) are ubiquitous and numerous in higher eukaryotic genomes. Analysis of MITE families is laborious and time consuming, especially when multiple MITE families are involved in the study. Based on the structural characteristics of MITEs and genetic principles for transposable elements (TEs), we have developed a computational tool kit named MITE analysis kit (MAK) to automate the processes (http://perl.idmb.tamu.edu/mak.htm). In addition to its ability to routinely retrieve family member sequences and to report the positions of these elements relative to the closest neighboring genes, MAK is a powerful tool for revealing anchor elements that link MITE families to known transposable element families. Implementation of the MAK is described, as are genetic principles and algorithms used in its derivation. Test runs of the programs for several MITE families yielded anchor sequences that retain TIRs and coding regions reminiscent of transposases. These anchor sequences are consistent with previously reported putative autonomous elements for these MITE families. Furthermore, analysis of two MITE families with no known links to any transposon family revealed two novel transposon families, namely Math and Kid, belonging to the IS5/Harbinger/PIF superfamily.",
                "authors": [
                    {
                        "name": "Yang G."
                    },
                    {
                        "name": "Hall T.C."
                    }
                ],
                "citationCount": 39,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MAK, a computational tool kit for automated MITE analysis"
            },
            "pmid": "12824388"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1
}