{
    "additionDate": "2019-11-14T20:09:01Z",
    "biotoolsCURIE": "biotools:crispy",
    "biotoolsID": "crispy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tiwe@biosustain.dtu.dk",
            "name": "Tilmann Weber",
            "orcidid": "https://orcid.org/0000-0002-8260-5120",
            "typeEntity": "Person"
        },
        {
            "email": "leesy@kaist.ac.kr",
            "name": "Sang Yup Lee",
            "orcidid": "https://orcid.org/0000-0003-0599-3091",
            "typeEntity": "Person"
        }
    ],
    "description": "Highly efficient DSB-free base editing for streptomycetes with CRISPR-BEST | CRISPy-web now detects potential amino acid changes introducable by CRISPR-BEST",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://crispy.secondarymetabolites.org",
    "lastUpdate": "2021-04-15T21:27:58.367573Z",
    "name": "crispy",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_017970"
        }
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1073/PNAS.1913493116",
            "metadata": {
                "abstract": "© 2019 National Academy of Sciences. All rights reserved.Streptomycetes serve as major producers of various pharmacologically and industrially important natural products. Although CRISPR-Cas9 systems have been developed for more robust genetic manipulations, concerns of genome instability caused by the DNA double-strand breaks (DSBs) and the toxicity of Cas9 remain. To overcome these limitations, here we report development of the DSB-free, single-nucleotide–resolution genome editing system CRISPR-BEST (CRISPR-Base Editing SysTem), which comprises a cytidine (CRISPR-cBEST) and an adenosine (CRISPR-aBEST) deaminase-based base editor. Specifically targeted by an sgRNA, CRISPR-cBEST can efficiently convert a C:G base pair to a T:A base pair and CRISPR-aBEST can convert an A:T base pair to a G:C base pair within a window of approximately 7 and 6 nucleotides, respectively. CRISPR-BEST was validated and successfully used in different Streptomyces species. Particularly in nonmodel actinomycete Streptomyces collinus Tü365, CRISPR-cBEST efficiently inactivated the 2 copies of kirN gene that are in the duplicated kirromycin biosynthetic pathways simultaneously by STOP codon introduction. Generating such a knockout mutant repeatedly failed using the conventional DSB-based CRISPR-Cas9. An unbiased, genome-wide off-target evaluation indicates the high fidelity and applicability of CRISPR-BEST. Furthermore, the system supports multiplexed editing with a single plasmid by providing a Csy4-based sgRNA processing machinery. To simplify the protospacer identification process, we also updated the CRISPy-web (https://crispy.secondarymetabolites.org), and now it allows designing sgRNAs specifically for CRISPR-BEST applications.",
                "authors": [
                    {
                        "name": "Tong Y."
                    },
                    {
                        "name": "Whitford C.M."
                    },
                    {
                        "name": "Robertsen H.L."
                    },
                    {
                        "name": "Blin K."
                    },
                    {
                        "name": "Jorgensen T.S."
                    },
                    {
                        "name": "Klitgaard A.K."
                    },
                    {
                        "name": "Gren T."
                    },
                    {
                        "name": "Jiang X."
                    },
                    {
                        "name": "Weber T."
                    },
                    {
                        "name": "Lee S.Y."
                    }
                ],
                "citationCount": 30,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Highly efficient DSB-free base editing for streptomycetes with CRISPR-BEST"
            },
            "pmcid": "PMC6789908",
            "pmid": "31548381"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ],
    "validated": 1
}