{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T09:52:02Z",
    "biotoolsCURIE": "biotools:TeraPCA",
    "biotoolsID": "TeraPCA",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bose6@purdue.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "kalan019@umn.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Package to study genetic variation in tera-scale genotypes as it performs PCA of large-scale datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aritra90/TeraPCA",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "TeraPCA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz157",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Principal Component Analysis is a key tool in the study of population structure in human genetics. As modern datasets become increasingly larger in size, traditional approaches based on loading the entire dataset in the system memory (Random Access Memory) become impractical and out-of-core implementations are the only viable alternative. Results: We present TeraPCA, a C++ implementation of the Randomized Subspace Iteration method to perform Principal Component Analysis of large-scale datasets. TeraPCA can be applied both in-core and out-of-core and is able to successfully operate even on commodity hardware with a system memory of just a few gigabytes. Moreover, TeraPCA has minimal dependencies on external libraries and only requires a working installation of the BLAS and LAPACK libraries. When applied to a dataset containing a million individuals genotyped on a million markers, TeraPCA requires <5 h (in multi-threaded mode) to accurately compute the 10 leading principal components. An extensive experimental analysis shows that TeraPCA is both fast and accurate and is competitive with current state-of-the-art software for the same task. Availability and implementation: Source code and documentation are both available at https://github.com/aritra90/TeraPCA. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Bose A."
                    },
                    {
                        "name": "Drineas P."
                    },
                    {
                        "name": "Elkady M."
                    },
                    {
                        "name": "Kalantzis V."
                    },
                    {
                        "name": "Kontopoulou E.-M."
                    },
                    {
                        "name": "Paschou P."
                    }
                ],
                "citationCount": 5,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TeraPCA: A fast and scalable software package to study genetic variation in tera-scale genotypes"
            },
            "pmid": "30957838",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ],
    "validated": 1
}
