{
    "additionDate": "2022-10-19T19:29:54.040622Z",
    "biotoolsCURIE": "biotools:htt-omni",
    "biotoolsID": "htt-omni",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Bokai Song"
        },
        {
            "name": "Ileana M Cristea"
        },
        {
            "name": "Michelle A Kennedy"
        },
        {
            "name": "Todd M Greco"
        }
    ],
    "description": "HTT-OMNI (HTT OMics and Network Integration) a web-based application for HIP network analysis, visualization, and omics data exploration.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://htt-omni.princeton.edu:5006/run_app",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:26:44.919735Z",
    "license": "Not licensed",
    "name": "HTT-OMNI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.mcpro.2022.100275",
            "metadata": {
                "abstract": "Huntington's disease (HD) is a progressive neurological disorder that is caused by polyglutamine expansion of the huntingtin (HTT) protein. With the hope to uncover key modifiers of disease, a focus of the field of HD research has been on characterizing HTT-interacting proteins (HIPs) and the effect of the HTT polyglutamine expansion on the cellular omics landscape. However, while hundreds of studies have uncovered over 3000 potential HIPs to date, a means to interrogate these complementary interaction and omics datasets does not exist. The lack of a unified platform for exploring this breadth of potential HIPs and associated omics data represents a substantial barrier toward understanding the impact of HTT polyQ expansion and identifying interactions proximal to HD pathogenesis. Here, we describe the development of a web-based platform called HTT-OMNI (HTT OMics and Network Integration). This application facilitates the visualization and exploration of ~3400 potential HTT interactors (from the HINT database) and their associated polyQ-dependent omics measurements, such as transcriptome and proteome abundances. Additionally, HTT-OMNI allows for the integration of user-generated datasets with existing HIPs and omic measurements. We first demonstrate the utility of HTT-OMNI for filtering existing HTT PPIs based on a variety of experimental metadata parameters, highlighting its capacity to select for HIPs detected in specific model organisms and tissues. Next, we leverage our application to visualize the relationships between HTT PPIs, genetic disease modifiers, and their multiomic landscape. Finally, we generate and analyze a previously unreported dataset of HTT PPIs, aimed at defining tissue-specific HTT interactions and the polyQ-dependent modulation of their relative stabilities in the cortex and striatum of HD mouse models.",
                "authors": [
                    {
                        "name": "Cristea I.M."
                    },
                    {
                        "name": "Greco T.M."
                    },
                    {
                        "name": "Kennedy M.A."
                    },
                    {
                        "name": "Song B."
                    }
                ],
                "citationCount": 5,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "HTT-OMNI: A Web-based Platform for Huntingtin Interaction Exploration and Multi-omics Data Integration"
            },
            "pmcid": "PMC9540350",
            "pmid": "35932982"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
