{
    "additionDate": "2021-01-18T09:01:07Z",
    "biotoolsCURIE": "biotools:mephas",
    "biotoolsID": "mephas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yushi-tian@phs.osaka-u.ac.jp",
            "name": "Yu-Shi Tian",
            "orcidid": "https://orcid.org/0000-0002-8988-9453",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive graphical user interface for medical and pharmaceutical statistical analysis with R and Shiny.\n\nMedical and Pharmaceutical Statistics Based on Shiny.\n\nMEPHAS is a shiny-based statistical software that was developed to support statistical data analyses for medical and pharmaceutical students, researchers, and doctors.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://alain003.phs.osaka-u.ac.jp/mephas/MEPHAS_flow.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "https://alain003.phs.osaka-u.ac.jp/mephas/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-20T18:04:17Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://mephas.github.io/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://mephas.github.io/reference/index.html"
        }
    ],
    "name": "MEPHAS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3494-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Even though R is one of the most commonly used statistical computing environments, it lacks a graphical user interface (GUI) that appeals to students, researchers, lecturers, and practitioners in medicine and pharmacy for conducting standard data analytics. Current GUIs built on top of R, such as EZR and R-Commander, aim to facilitate R coding and visualization, but most of the functionalities are still accessed through a command-line interface (CLI). To assist practitioners of medicine and pharmacy and researchers to run most routines in fundamental statistical analysis, we developed an interactive GUI; i.e., MEPHAS, to support various web-based systems that are accessible from laptops, workstations, or tablets, under Windows, macOS (and IOS), or Linux. In addition to fundamental statistical analysis, advanced statistics such as the extended Cox regression and dimensional analyses including partial least squares regression (PLS-R) and sparse partial least squares regression (SPLS-R), are also available in MEPHAS. Results: MEPHAS is a web-based GUI (https://alain003.phs.osaka-u.ac.jp/mephas/) that is based on a shiny framework. We also created the corresponding R package mephas (https://mephas.github.io/). Thus far, MEPHAS has supported four categories of statistics, including probability, hypothesis testing, regression models, and dimensional analyses. Instructions and help menus were accessible during the entire analytical process via the web-based GUI, particularly advanced dimensional data analysis that required much explanation. The GUI was designed to be intuitive for non-technical users to perform various statistical functions, e.g., managing data, customizing plots, setting parameters, and monitoring real-time results, without any R coding from users. All generated graphs can be saved to local machines, and tables can be downloaded as CSV files. Conclusion: MEPHAS is a free and open-source web-interactive GUI that was designed to support statistical data analyses and prediction for medical and pharmaceutical practitioners and researchers. It enables various medical and pharmaceutical statistical analyses through interactive parameter settings and dynamic visualization of the results.",
                "authors": [
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Leung S.-W."
                    },
                    {
                        "name": "Mizutani S."
                    },
                    {
                        "name": "Takagi T."
                    },
                    {
                        "name": "Tian Y.-S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MEPHAS: An interactive graphical user interface for medical and pharmaceutical statistical analysis with R and Shiny"
            },
            "pmcid": "PMC7216538",
            "pmid": "32393166"
        }
    ],
    "toolType": [
        "Web application",
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}