{
    "additionDate": "2020-01-09T17:51:02Z",
    "biotoolsCURIE": "biotools:NNLDA",
    "biotoolsID": "NNLDA",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "shang@nwpu.edu.cn",
            "name": "Xuequn Shang",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep Learning Enables Accurate Prediction of Interplay Between lncRNA and Disease.\n\nDeep learning enables accurate prediction of interplay between lncRNA and disaeas.\n\n###########################################################################################.\n\nNNLDA is implemented in Python 3.5 and use Tensorflow 1.12.0. Package numpy and pandas are also required.\n\nThe experimental data are downloaded from LncRNADiseas2.0 database",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gao793583308/NNLDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-09T17:51:02Z",
    "name": "NNLDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00937",
            "metadata": {
                "abstract": "© Copyright © 2019 Hu, Gao, Li and Shang.Many studies have suggested that lncRNAs are involved in distinct and diverse biological processes. The mutation of lncRNAs plays a major role in a wide range of diseases. A comprehensive information of lncRNA-disease associations would improve our understanding of the underlying molecular mechanism that can explain the development of disease. However, the discovery of the relationship between lncRNA and disease in biological experiment is costly and time-consuming. Although many computational algorithms have been proposed in the last decade, there still exists much room to improve because of diverse computational limitations. In this paper, we proposed a deep-learning framework, NNLDA, to predict potential lncRNA-disease associations. We compared it with other two widely-used algorithms on a network with 205,959 interactions between 19,166 lncRNAs and 529 diseases. Results show that NNLDA outperforms other existing algorithm in the prediction of lncRNA-disease association. Additionally, NNLDA can be easily applied to large-scale datasets using the technique of mini-batch stochastic gradient descent. To our best knowledge, NNLDA is the first algorithm that uses deep neural networks to predict lncRNA-disease association. The source code of NNLDA can be freely accessed at https://github.com/gao793583308/NNLDA.",
                "authors": [
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Shang X."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-09T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Deep Learning Enables Accurate Prediction of Interplay Between lncRNA and Disease"
            },
            "pmcid": "PMC6795129",
            "pmid": "31649723"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}