{
    "additionDate": "2021-01-18T11:27:06Z",
    "biotoolsCURIE": "biotools:ip4m",
    "biotoolsID": "ip4m",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wjia@sjtu.edu.cn",
            "name": "Wei Jia",
            "typeEntity": "Person"
        },
        {
            "email": "xieguoxiang@hmibiotech.com",
            "name": "Guoxiang Xie",
            "typeEntity": "Person"
        },
        {
            "email": "chentianlu@sjtu.edu.cn",
            "name": "Tianlu Chen",
            "orcidid": "https://orcid.org/0000-0003-1798-5435",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated platform for mass spectrometry-based metabolomics data mining.\n\nBACKGROUND:Metabolomics data analyses rely on the use of bioinformatics tools. Many integrated multi-functional tools have been developed for untargeted metabolomics data processing and have been widely used. More alternative platforms are expected for both basic and advanced users. RESULTS:Integrated mass spectrometry-based untargeted metabolomics data mining (IP4M) software was designed and developed",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/IP4M",
    "lastUpdate": "2021-02-05T07:49:55Z",
    "name": "IP4M",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03786-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Metabolomics data analyses rely on the use of bioinformatics tools. Many integrated multi-functional tools have been developed for untargeted metabolomics data processing and have been widely used. More alternative platforms are expected for both basic and advanced users. Results: Integrated mass spectrometry-based untargeted metabolomics data mining (IP4M) software was designed and developed. The IP4M, has 62 functions categorized into 8 modules, covering all the steps of metabolomics data mining, including raw data preprocessing (alignment, peak de-convolution, peak picking, and isotope filtering), peak annotation, peak table preprocessing, basic statistical description, classification and biomarker detection, correlation analysis, cluster and sub-cluster analysis, regression analysis, ROC analysis, pathway and enrichment analysis, and sample size and power analysis. Additionally, a KEGG-derived metabolic reaction database was embedded and a series of ratio variables (product/substrate) can be generated with enlarged information on enzyme activity. A new method, GRaMM, for correlation analysis between metabolome and microbiome data was also provided. IP4M provides both a number of parameters for customized and refined analysis (for expert users), as well as 4 simplified workflows with few key parameters (for beginners who are unfamiliar with computational metabolomics). The performance of IP4M was evaluated and compared with existing computational platforms using 2 data sets derived from standards mixture and 2 data sets derived from serum samples, from GC-MS and LC-MS respectively. Conclusion: IP4M is powerful, modularized, customizable and easy-to-use. It is a good choice for metabolomics data processing and analysis. Free versions for Windows, MAC OS, and Linux systems are provided.",
                "authors": [
                    {
                        "name": "Liang D."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Zhou K."
                    },
                    {
                        "name": "Jia W."
                    },
                    {
                        "name": "Xie G."
                    },
                    {
                        "name": "Chen T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "IP4M: An integrated platform for mass spectrometry-based metabolomics data mining"
            },
            "pmcid": "PMC7542974",
            "pmid": "33028191"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}