{
    "additionDate": "2021-01-18T07:27:27Z",
    "biotoolsCURIE": "biotools:nucbreak",
    "biotoolsID": "nucbreak",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "torognes@ifi.uio.no",
            "name": "Torbjørn Rognes",
            "orcidid": "https://orcid.org/0000-0002-9329-9974",
            "typeEntity": "Person"
        }
    ],
    "description": "Location of structural errors in a genome assembly by using paired-end Illumina reads.\n\nNucBreak detects structural errors in assemblies and structural variants between pairs of genomes when only a genome of one organism and Illumina paired-end reads from another organism are available. It is able to detect insertions, deletions, different inter- and intra-chromosomal translocations, and inversions. However, the types of detected breakpoints are not specified. It was written in Python and uses Bowtie2 for reads alignment. The tool is described in the manuscript mentioned in Section 5.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                }
            ]
        }
    ],
    "homepage": "https://github.com/uio-bmi/NucBreak",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-13T18:45:54Z",
    "license": "MPL-2.0",
    "name": "NucBreak",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3414-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Advances in whole genome sequencing strategies have provided the opportunity for genomic and comparative genomic analysis of a vast variety of organisms. The analysis results are highly dependent on the quality of the genome assemblies used. Assessment of the assembly accuracy may significantly increase the reliability of the analysis results and is therefore of great importance. Results: Here, we present a new tool called NucBreak aimed at localizing structural errors in assemblies, including insertions, deletions, duplications, inversions, and different inter- and intra-chromosomal rearrangements. The approach taken by existing alternative tools is based on analysing reads that do not map properly to the assembly, for instance discordantly mapped reads, soft-clipped reads and singletons. NucBreak uses an entirely different and unique method to localise the errors. It is based on analysing the alignments of reads that are properly mapped to an assembly and exploit information about the alternative read alignments. It does not annotate detected errors. We have compared NucBreak with other existing assembly accuracy assessment tools, namely Pilon, REAPR, and FRCbam as well as with several structural variant detection tools, including BreakDancer, Lumpy, and Wham, by using both simulated and real datasets. Conclusions: The benchmarking results have shown that NucBreak in general predicts assembly errors of different types and sizes with relatively high sensitivity and with lower false discovery rate than the other tools. Such a balance between sensitivity and false discovery rate makes NucBreak a good alternative to the existing assembly accuracy assessment tools and SV detection tools. NucBreak is freely available at http://github.com/uio-bmi/NucBreak under the MPL license.",
                "authors": [
                    {
                        "name": "Khelik K."
                    },
                    {
                        "name": "Sandve G.K."
                    },
                    {
                        "name": "Nederbragt A.J."
                    },
                    {
                        "name": "Rognes T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NucBreak: Location of structural errors in a genome assembly by using paired-end Illumina reads"
            },
            "pmcid": "PMC7035700",
            "pmid": "32085722"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}