{
    "additionDate": "2020-01-09T17:31:42Z",
    "biotoolsCURIE": "biotools:PhaSepDB",
    "biotoolsID": "PhaSepDB",
    "confidence_flag": "tool",
    "description": "PhaSepDB is a novel database that provides a collection of phase separation related proteins manually curated from publications and public database.\n\nIn addition to curated proteins, PhaSepDB also provides the researchers with molecular signatures that may facilitate phase separation related proteins identification for all human proteins.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://db.phasep.pro/",
    "lastUpdate": "2024-11-24T20:50:17.415168Z",
    "name": "PhaSepDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz847",
            "metadata": {
                "abstract": "It's widely appreciated that liquid-liquid phase separation (LLPS) underlies the formation of membraneless organelles, which function to concentrate proteins and nucleic acids. In the past few decades, major efforts have been devoted to identify the phase separation associated proteins and elucidate their functions. To better utilize the knowledge dispersed in published literature, we developed PhaSepDB (http://db.phasep.pro/), a manually curated database of phase separation associated proteins. Currently, PhaSepDB includes 2914 non-redundant proteins localized in different organelles curated from published literature and database. PhaSepDB provides protein summary, publication reference and sequence features of phase separation associated proteins. The sequence features which reflect the LLPS behavior are also available for other human protein candidates. The online database provides a convenient interface for the research community to easily browse, search and download phase separation associated proteins. As a centralized resource, we believe PhaSepDB will facilitate the future study of phase separation.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Hermjakob H."
                    },
                    {
                        "name": "Huang Q."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Sevilla C."
                    },
                    {
                        "name": "Shen B."
                    },
                    {
                        "name": "Shi M."
                    },
                    {
                        "name": "You K."
                    },
                    {
                        "name": "Yu C."
                    }
                ],
                "citationCount": 140,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhaSepDB: A database of liquid-liquid phase separation related proteins"
            },
            "pmcid": "PMC6943039",
            "pmid": "31584089"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
