{
    "accessibility": "Open access",
    "additionDate": "2024-05-18T15:25:26.545304Z",
    "biotoolsCURIE": "biotools:circsi-ssl",
    "biotoolsID": "circsi-ssl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "orcidid": "https://orcid.org/0000-0001-6406-1142",
            "typeEntity": "Person"
        },
        {
            "name": "Chao Cao",
            "typeEntity": "Person"
        }
    ],
    "description": "circRNA-binding site identification based on self-supervised learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cc646201081/CircSI-SSL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:57:18.176307Z",
    "license": "MIT",
    "name": "CircSI-SSL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btae004",
            "metadata": {
                "abstract": "Motivation: In recent years, circular RNAs (circRNAs), the particular form of RNA with a closed-loop structure, have attracted widespread attention due to their physiological significance (they can directly bind proteins), leading to the development of numerous protein site identification algorithms. Unfortunately, these studies are supervised and require the vast majority of labeled samples in training to produce superior performance. But the acquisition of sample labels requires a large number of biological experiments and is difficult to obtain. Results: To resolve this matter that a great deal of tags need to be trained in the circRNA-binding site prediction task, a self-supervised learning binding site identification algorithm named CircSI-SSL is proposed in this article. According to the survey, this is unprecedented in the research field. Specifically, CircSI-SSL initially combines multiple feature coding schemes and employs RNA_Transformer for cross-view sequence prediction (self-supervised task) to learn mutual information from the multi-view data, and then fine-tuning with only a few sample labels. Comprehensive experiments on six widely used circRNA datasets indicate that our CircSI-SSL algorithm achieves excellent performance in comparison to previous algorithms, even in the extreme case where the ratio of training data to test data is 1:9. In addition, the transplantation experiment of six linRNA datasets without network modification and hyperparameter adjustment shows that CircSI-SSL has good scalability. In summary, the prediction algorithm based on self-supervised learning proposed in this article is expected to replace previous supervised algorithms and has more extensive application value.",
                "authors": [
                    {
                        "name": "Cao C."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 3,
                "date": "2024-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CircSI-SSL: CircRNA-binding site identification based on self-supervised learning"
            },
            "pmcid": "PMC10789309",
            "pmid": "38180876"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ]
}
