{"collectionID": [], "accessibility": [], "topic": [{"term": "Gene expression", "uri": "http://edamontology.org/topic_0203"}, {"term": "Genetics", "uri": "http://edamontology.org/topic_3053"}, {"term": "DNA", "uri": "http://edamontology.org/topic_0654"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "16336639", "type": null, "pmcid": null, "metadata": {"title": "GenClust: A genetic algorithm for clustering gene expression data", "abstract": "Background: Clustering is a key step in the analysis of gene expression data, and in fact, many classical clustering algorithms are used, or more innovative ones have been designed and validated for the task. Despite the widespread use of artificial intelligence techniques in bioinformatics and, more generally, data analysis, there are very few clustering algorithms based on the genetic paradigm, yet that paradigm has great potential in finding good heuristic solutions to a difficult optimization problem such as clustering. Results: GenClust is a new genetic algorithm for clustering gene expression data. It has two key features: (a) a novel coding of the search space that is simple, compact and easy to update; (b) it can be used naturally in conjunction with data driven internal validation methods. We have experimented with the FOM methodology, specifically conceived for validating clusters of gene expression data. The validity of GenClust has been assessed experimentally on real data sets, both with the use of validation measures and in comparison with other algorithms, i.e., Average Link, Cast, Click and K-means. Conclusions: Experiments show that none of the algorithms we have used is markedly superior to the others across data sets and validation measures; i.e., in many cases the observed differences between the worst and best performing algorithm may be statistically insignificant and they could be considered equivalent. However, there are cases in which an algorithm may be better than others and therefore worthwhile. In particular, experiments for GenClust show that, although simple in its data representation, it converges very rapidly to a local optimum and that its ability to identify meaningful clusters is comparable, and sometimes superior, to that of more sophisticated algorithms. In addition, it is well suited for use in conjunction with data driven internal validation measures and, in particular, the FOM methodology. © 2005 Di Gesu et al., licensee BioMed Central Ltd.", "citationCount": 32, "authors": [{"name": "Di Gesu V."}, {"name": "Giancarlo R."}, {"name": "Lo Bosco G."}, {"name": "Raimondi A."}, {"name": "Scaturro D."}], "date": "2005-12-07T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 1, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.math.unipa.it/~lobosco/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:genclust", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.math.unipa.it/~lobosco/genclust/", "function": [{"note": null, "input": [], "operation": [{"term": "Gene expression clustering", "uri": "http://edamontology.org/operation_0313"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:52Z", "otherID": [], "description": "New genetic algorithm for clustering gene expression data. It has two key features: (a) a novel coding of the search space that is simple, compact and easy to update; (b) it can be used naturally in conjunction with data driven internal validation methods.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["C++"], "link": [{"url": "http://www.mybiosoftware.com/genclust-clustering-gene-expression-data.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "genclust", "additionDate": "2017-08-03T18:45:01Z", "name": "GenClust", "license": null, "documentation": [{"url": "http://www.math.unipa.it/~lobosco/genclust/DOCUMENTATION.txt", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}