{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cs.ucr.edu/~yyang027/"}],"documentation":[{"url":"http://www-huber.embl.de/users/anders/DESeq/"}],"function":[{"operation":[{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["R"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mrfseq-0-1-gene-expression-analysis-using-coexpression-and-rna-seq-data.html"}],"publication":[{"abstract":"Motivation: RNA-Seq is increasingly being used for differential gene expression analysis, which was dominated by the microarray technology in the past decade. However, inferring differential gene expression based on the observed difference of RNA-Seq read counts has unique challenges that were not present in microarray-based analysis. The differential expression estimation may be biased against low read count values such that the differential expression of genes with high read counts is more easily detected. The estimation bias may further propagate in downstream analyses at the systems biology level if it is not corrected.Results: To obtain a better inference of differential gene expression, we propose a new efficient algorithm based on a Markov random field (MRF) model, called MRFSeq, that uses additional gene coexpression data to enhance the prediction power. Our main technical contribution is the careful selection of the clique potential functions in the MRF so its maximum a posteriori estimation can be reduced to the well-known maximum flow problem and thus solved in polynomial time. Our extensive experiments on simulated and real RNA-Seq datasets demonstrate that MRFSeq is more accurate and less biased against genes with low read counts than the existing methods based on RNA-Seq data alone. For example, on the well-studied MAQC dataset, MRFSeq improved the sensitivity from 11.6 to 38.8% for genes with low read counts. Availability: MRFSeq is implemented in C and available at http://www.cs.ucr.edu/~yyang027/ mrfseq.htmContact: or jiang@cs.ucr.eduSupplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author.","authors":["Yang E.-W.","Girke T.","Jiang T."],"cit_count":11,"doi":"10.1093/bioinformatics/btt363","journal":"Bioinformatics","title":"Differential gene expression analysis using coexpression and RNA-Seq data","type":"Primary","year":"2013-09-01"}],"summary":{"biotoolsCURIE":"biotools:mrfseq","biotoolsID":"mrfseq","description":"MRFSeq is a new efficient algorithm based on a Markov random field (MRF) model that uses additional gene coexpression data to enhance the prediction power.","homepage":"http://www.cs.ucr.edu/~yyang027/mrfseq.htm","name":"MRFSeq","version":["0.1"]}}