{"collectionID": [], "accessibility": [], "topic": [{"term": "Systems biology", "uri": "http://edamontology.org/topic_2259"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/1471-2105-12-24", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "GraphCrunch 2: Software tool for network modeling, alignment and clustering", "abstract": "Background: Recent advancements in experimental biotechnology have produced large amounts of protein-protein interaction (PPI) data. The topology of PPI networks is believed to have a strong link to their function. Hence, the abundance of PPI data for many organisms stimulates the development of computational techniques for the modeling, comparison, alignment, and clustering of networks. In addition, finding representative models for PPI networks will improve our understanding of the cell just as a model of gravity has helped us understand planetary motion. To decide if a model is representative, we need quantitative comparisons of model networks to real ones. However, exact network comparison is computationally intractable and therefore several heuristics have been used instead. Some of these heuristics are easily computable \"network properties,\" such as the degree distribution, or the clustering coefficient. An important special case of network comparison is the network alignment problem. Analogous to sequence alignment, this problem asks to find the \"best\" mapping between regions in two networks. It is expected that network alignment might have as strong an impact on our understanding of biology as sequence alignment has had. Topology-based clustering of nodes in PPI networks is another example of an important network analysis problem that can uncover relationships between interaction patterns and phenotype.Results: We introduce the GraphCrunch 2 software tool, which addresses these problems. It is a significant extension of GraphCrunch which implements the most popular random network models and compares them with the data networks with respect to many network properties. Also, GraphCrunch 2 implements the GRAph ALigner algorithm (\"GRAAL\") for purely topological network alignment. GRAAL can align any pair of networks and exposes large, dense, contiguous regions of topological and functional similarities far larger than any other existing tool. Finally, GraphCruch 2 implements an algorithm for clustering nodes within a network based solely on their topological similarities. Using GraphCrunch 2, we demonstrate that eukaryotic and viral PPI networks may belong to different graph model families and show that topology-based clustering can reveal important functional similarities between proteins within yeast and human PPI networks.Conclusions: GraphCrunch 2 is a software tool that implements the latest research on biological network analysis. It parallelizes computationally intensive tasks to fully utilize the potential of modern multi-core CPUs. It is open-source and freely available for research use. It runs under the Windows and Linux platforms. © 2011 Kuchaiev et al; licensee BioMed Central Ltd.", "citationCount": 49, "authors": [{"name": "Kuchaiev O."}, {"name": "Stevanovic A."}, {"name": "Hayes W."}, {"name": "Przulj N."}], "date": "2011-01-19T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "http://www.doc.ic.ac.uk/~natasha//index.html", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:graphcrunch", "elixirPlatform": [], "elixirNode": [], "version": ["2.1.1"], "elixir_badge": 0, "homepage": "http://bio-nets.doc.ic.ac.uk/graphcrunch2/", "function": [{"note": null, "input": [], "operation": [{"term": "Pathway or network analysis", "uri": "http://edamontology.org/operation_2497"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Alignment", "uri": "http://edamontology.org/operation_2928"}], "cmd": null, "output": []}, {"note": null, "input": [], "operation": [{"term": "Clustering", "uri": "http://edamontology.org/operation_3432"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:57Z", "otherID": [], "description": "Software tool for network analysis, modeling and alignment. It automates tasks of finding the best fitting model for the network data, pairwise comparisons of networks, alignment of two networks using GRAAL algorithm (a better network alignment algorithm, MI-GRAAL, is also available for download), and provides capabilities of clustering network nodes based on their topological surrounding in the network.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Java", "C++"], "link": [{"url": "http://www.mybiosoftware.com/graphcrunch-2-1-1-network-modeling-alignment-clustering.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "graphcrunch", "additionDate": "2017-12-18T00:07:19Z", "name": "GraphCrunch", "license": null, "documentation": [{"url": "http://www0.cs.ucl.ac.uk/staff/natasa/graphcrunch2/usage.html", "note": null, "type": "User manual"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows"]}