{
    "additionDate": "2019-08-15T15:08:40Z",
    "biotoolsCURIE": "biotools:ROHan",
    "biotoolsID": "ROHan",
    "description": "Joint inference of Runs of Homozygosity and rates of heterozygosity",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://grenaud.github.io/ROHan/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-25T14:06:42.229512Z",
    "maturity": "Mature",
    "name": "ROHan",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "grenaud",
    "publication": [
        {
            "doi": "10.1534/genetics.119.302057",
            "metadata": {
                "abstract": "Both the total amount and the distribution of heterozygous sites within individual genomes are informative about the genetic diversity of the population they belong to. Detecting true heterozygous sites in ancient genomes is complicated by the generally limited coverage achieved and the presence of post-mortem damage inflating sequencing errors. Additionally, large runs of homozygosity found in the genomes of particularly inbred individuals and of domestic animals can skew estimates of genome-wide heterozygosity rates. Current computational tools aimed at estimating runs of homozygosity and genome-wide heterozygosity levels are generally sensitive to such limitations. Here, we introduce ROHan, a probabilistic method which substantially improves the estimate of heterozygosity rates both genome-wide and for genomic local windows. It combines a local Bayesian model and a Hidden Markov Model at the genome-wide level and can work both on modern and ancient samples. We show that our algorithm outperforms currently available methods for predicting heterozygosity rates for ancient samples. Specifically, ROHan can delineate large runs of homozygosity (at megabase scales) and produce a reliable confidence interval for the genome-wide rate of heterozygosity outside of such regions from modern genomes with a depth of coverage as low as 5-6X and down to 7-8X for ancient samples showing moderate DNA damage. We apply ROHan to a series of modern and ancient genomes previously published and revise available estimates of heterozygosity for humans, chimpanzees and horses.",
                "authors": [
                    {
                        "name": "Hanghoj K."
                    },
                    {
                        "name": "Korneliussen T.S."
                    },
                    {
                        "name": "Orlando L."
                    },
                    {
                        "name": "Renaud G."
                    },
                    {
                        "name": "Willerslev E."
                    }
                ],
                "citationCount": 42,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Joint estimates of heterozygosity and runs of homozygosity for modern and ancient samples"
            },
            "pmcid": "PMC6614887",
            "pmid": "31088861"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
