{"credit":[{"email":"till-antoni.soerensen@charite.de","name":"Till Soerensen","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/immunoClust.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/immunoClust_1.6.0.tar.gz"}],"function":[{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"Artistic-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"},{"term":"Laboratory techniques","uri":"http://edamontology.org/topic_3361"},{"term":"Biomarkers","uri":"http://edamontology.org/topic_3360"},{"term":"Immunology","uri":"http://edamontology.org/topic_0804"}]},"publication":[{"abstract":"© 2015 International Society for Advancement of Cytometry.Multiparametric fluorescence and mass cytometry offers new perspectives to disclose and to monitor the high diversity of cell populations in the peripheral blood for biomarker research. While high-end cytometric devices are currently available to detect theoretically up to 120 individual parameters at the single cell level, software tools are needed to analyze these complex datasets automatically in acceptable time and without operator bias or knowledge. We developed an automated analysis pipeline, immunoClust, for uncompensated fluorescence and mass cytometry data, which consists of two parts. First, cell events of each sample are grouped into individual clusters. Subsequently, a classification algorithm assorts these cell event clusters into populations comparable between different samples. The clustering of cell events is designed for datasets with large event counts in high dimensions as a global unsupervised method, sensitive to identify rare cell types even when next to large populations. Both parts use model-based clustering with an iterative expectation maximization algorithm and the integrated classification likelihood to obtain the clusters. A detailed description of both algorithms is presented. Testing and validation was performed using 1) blood cell samples of defined composition that were depleted of particular cell subsets by magnetic cell sorting, 2) datasets of the FlowCAP III challenges to identify populations of rare cell types and 3) high-dimensional fluorescence and mass-cytometry datasets for comparison with conventional manual gating procedures. In conclusion, the immunoClust-algorithm is a promising tool to standardize and automate the analysis of high-dimensional cytometric datasets. As a prerequisite for interpretation of such data, it will support our efforts in developing immunological biomarkers for chronic inflammatory disorders and therapy recommendations in personalized medicine. immunoClust is implemented as an R-package and is provided as source code from www.bioconductor.org.","authors":["Sorensen T.","Baumgart S.","Durek P.","Grutzkau A.","Haupl T."],"cit_count":23,"doi":"10.1002/cyto.a.22626","journal":"Cytometry Part A","title":"immunoClust-An automated analysis pipeline for the identification of immunophenotypic signatures in high-dimensional cytometric datasets","type":"Primary","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:immunoclust","biotoolsID":"immunoclust","description":"Model based clustering and meta-clustering of Flow Cytometry Data.","homepage":"http://bioconductor.org/packages/release/bioc/html/immunoClust.html","name":"immunoClust","version":["1.6.0"]}}