
{
    "credit": [
        {
            "email": "veronique.giudicelli@igh.cnrs.fr",
            "name": "Véronique Giudicelli",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        },
        {
            "email": "patrice.duroux@igh.cnrs.fr",
            "name": "Patrice Duroux",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        },
        {
            "email": "marie-paule.lefranc@igh.cnrs.fr",
            "name": "Marie-Paule Lefranc",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        },
        {
            "email": "sofia.kossida@igh.cnrs.fr",
            "name": "Sofia Kossida",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.imgt.org/IMGTindex/ontology.php"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "http://www.imgt.org/download/IMGT-ONTOLOGY/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Ontology"
        ],
        "topic": [
            {
                "term": "Immunogenetics",
                "uri": "http://edamontology.org/topic_3930"
            },
            {
                "term": "Immunoinformatics",
                "uri": "http://edamontology.org/topic_3948"
            }
        ]
    },
    "link": [
        {
            "note": "IMGT-ONTOLOGY on NCBO BioPortal",
            "type": "REPOSITORY",
            "url": "http://bioportal.bioontology.org/ontologies/IMGT-ONTOLOGY"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: IMGT, the international ImMunoGeneTics database (http://imgt.cines.fr:8104), created by M.-P. Lefranc, is an integrated database specializing in antigen receptors (immunoglobulins and T-cell receptors) and major histocompatibility complex (MHC) of all vertebrate species. IMGT accurate immunogenetics data are based on the standardization of the biological knowledge provided by the 'ImMunoGeneTics' IMGT-ONTOLOGY. The IMGT-ONTOLOGY describes the classification and specification of terms needed for immunogenetics and bioinformatics. IMGT-ONTOLOGY covers four main concepts: 'IDENTIFICATION', 'DESCRIPTION', 'CLASSIFICATION' and 'OBTENTION'. These concepts allow an extensive and standardized description and characterization of immunoglobulin and T-cell receptor data. The controlled vocabulary and the annotation rules are indispensable to ensure accuracy, consistency and coherence in IMGT. IMGT-ONTOLOGY allows scientists and clinicians to use, for the first time, identical terms with the same meaning in immunogenetics. It provides a semantic repository that will improve interoperability between specialist and generalist databases. Availability: Controlled vocabulary and annotation rules are described in the IMGT Scientific chart from the IMGT Marie-Paule page at http://imgt.cines.fr:8104. Contact: lefranc@ligm.igh.cnrs.fr.",
            "authors": [
                "Giudicelli V.",
                "Lefranc M.-P."
            ],
            "cit_count": 129,
            "journal": "Bioinformatics",
            "pmid": "10745995",
            "title": "Ontology for immunogenetics: The IMGT-ONTOLOGY",
            "year": "1999-01-01"
        },
        {
            "abstract": "IMGT, the international ImMunoGeneTics information system® (http://imgt.cines.fr), is a high quality integrated knowledge resource specialized in immunoglobulins (IG), T cell receptors (TR), major histocompatibility complex (MHC) and related proteins of the immune system (RPI) of human and other vertebrates, created in 1989, by the Laboratoire d'ImmunoGénétique Moléculaire LIGM. IMGT provides a common access to standardized data which include nucleotide and protein sequences, oligonucleotide primers, gene maps, genetic polymorphisms, specificities, 2D and 3D structures. IMGT consists of several sequence databases (IMGT/LIGM-DB, IMGT/MHC-DB, IMGT/PRIMER-DB), one genome database (IMGT/GENE-DB) and one three-dimensional structure database (IMGT/3Dstructure-DB), interactive tools for sequence analysis (IMGT/V-QUEST, IMGT/JunctionAnalysis, IMGT/PhyloGene, IMGT/Allele-Align), for genome analysis (IMGT/GeneSearch, IMGT/GeneView, IMGT/LocusView) and for 3D structure analysis (IMGT/StructuralQuery), and Web resources (\"IMGT Marie-Paule page\") comprising 8000 HTML pages. IMGT other accesses include SRS, FTP, search by BLAST, etc. By its high quality and its easy data distribution, IMGT has important implications in medical research (repertoire in autoimmune diseases, AIDS, leukemias, lymphomas, myelomas), veterinary research, genome diversity and genome evolution studies of the adaptive immune responses, biotechnology related to antibody engineering (scFv, phage displays, combinatorial libraries) and therapeutical approaches (grafts, immunotherapy). IMGT is freely available at http://imgt.cines.fr. © 2004 - IOS Press, Bioinformation Systems e.V. and the authors. All rights reserved.",
            "authors": [
                "Lefranc M.-P.",
                "Giudicelli V.",
                "Ginestoux C.",
                "Bosc N.",
                "Folch G.",
                "Guiraudou D.",
                "Jabado-Michaloud J.",
                "Magris S.",
                "Scaviner D.",
                "Thouvenin V.",
                "Combres K.",
                "Girod D.",
                "Jeanjean S.",
                "Protat C.",
                "Monod M.Y.",
                "Duprat E.",
                "Kaas Q.",
                "Pommie C.",
                "Chaume D.",
                "Lefranc G."
            ],
            "cit_count": 76,
            "journal": "In Silico Biology",
            "pmid": "15089751",
            "title": "IMGT-ontology for immunogenetics and immunoinformatics",
            "year": "2004-06-14"
        },
        {
            "abstract": "IMGT®, the international ImMunoGeneTics information system® (http://imgt.cines.fr), is the reference in immunogenetics and immunoinformatics. IMGT standardizes and manages the complex immunogenetic data which include the immunoglobulins (IG) or antibodies, the T cell receptors (TR), the major histocompatibility complex (MHC) and the related proteins of the immune system (RPI) which belong to the immunoglobulin superfamily (IgSF) and the MHC superfamily (MhcSF). The accuracy and consistency of IMGT data and the coherence between the different IMGT components (databases, tools and Web resources) are based on IMGT-ONTOLOGY, the first ontology for immunogenetics and immunoinformatics. IMGT-ONTOLOGY manages the immunogenetics knowledge through diverse facets relying on seven axioms, \"IDENTIFICATION\", \"DESCRIPTION\", \"CLASSIFICATION\", \"NUMEROTATION\", \"LOCALIZATION\", \"ORIENTATION\" and \"OBTENTION\", that postulate that objects, processes and relations have to be identified, described, classified, numerotated, localized, orientated, and that the way they are obtained has to be determined. These axioms constitute the Formal IMGT-ONTOLOGY, also designated as IMGT-Kaleidoscope. Through the example of the IG molecular synthesis, the concepts generated from the \"IDENTIFICATION\", \"DESCRIPTION\", \"CLASSIFICATION\" and \"NUMEROTATION\" axioms are detailed with their main instances and semantic relations. The axioms have been essential for the conceptualization of the molecular immunogenetics knowledge and can be used to generate concepts for multi scale approaches at the molecule, cell, tissue, organ, organism or population level, emphasizing the generalization of the application domain. In that way the Formal IMGT-ONTOLOGY represents a paradigm for the elaboration of ontologies in system biology. © 2007 Elsevier Masson SAS. All rights reserved.",
            "authors": [
                "Duroux P.",
                "Kaas Q.",
                "Brochet X.",
                "Lane J.",
                "Ginestoux C.",
                "Lefranc M.-P.",
                "Giudicelli V."
            ],
            "cit_count": 38,
            "journal": "Biochimie",
            "pmid": "17949886",
            "title": "IMGT-Kaleidoscope, the formal IMGT-ONTOLOGY paradigm",
            "year": "2008-04-01"
        },
        {
            "abstract": "",
            "authors": [
                "Lefranc M.-P."
            ],
            "cit_count": 25,
            "journal": "mAbs",
            "pmid": "21099347",
            "title": "Antibody nomenclature: From IMGT-ONTOLOGY to INN definition",
            "year": "2011-01-01"
        },
        {
            "doi": "10.16966/2470-102",
            "pmid": "22654892"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:IMGT-ONTOLOGY",
        "biotoolsID": "IMGT-ONTOLOGY",
        "description": "IMGT-ONTOLOGY is the first ontology for immunogenetics and immunoinformatics. It provides a semantic specification of the terms to be used in immunogenetics and immunoinformatics and manages the related knowledge, thus allowing the standardization for immunogenetics data from genome, proteome, genetics, two-dimensional (2D) and three-dimensional (3D) structures. IMGT-ONTOLOGY manages the knowledge through diverse facets relying on seven axioms, \"IDENTIFICATION\", \"CLASSIFICATION\", \"DESCRIPTION\", \"NUMEROTATION\", \"LOCALIZATION\", \"ORIENTATION\" and \"OBTENTION\". These axioms postulate that any object, any process and any relation can be identified, classified, described, numbered, localized and orientated, and the way it is obtained can be characterized.",
        "homepage": "http://www.imgt.org/IMGTindex/ontology.php",
        "name": "IMGT-ONTOLOGY"
    }
}