{
    "accessibility": "Open access",
    "additionDate": "2024-03-07T16:15:17.593912Z",
    "biotoolsCURIE": "biotools:hocort",
    "biotoolsID": "hocort",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "t.b.rounge@farmasi.uio.no",
            "name": "Trine B. Rounge",
            "typeEntity": "Person"
        },
        {
            "email": "torognes@ifi.uio.no",
            "name": "Torbjørn Rognes",
            "typeEntity": "Person"
        }
    ],
    "description": "Open-source tool for host contamination removal. It offers a one-step option for genome indexing.  The tool employs a variety of well-known mapping, classification, and alignment methods to classify reads.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ignasrum/hocort",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:11:17.708624Z",
    "license": "MIT",
    "name": "HoCoRT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05492-w",
            "metadata": {
                "abstract": "Background: Shotgun metagenome sequencing data obtained from a host environment will usually be contaminated with sequences from the host organism. Host sequences should be removed before further analysis to avoid biases, reduce downstream computational load, or ensure privacy in the case of a human host. The tools that we identified, as designed specifically to perform host contamination sequence removal, were either outdated, not maintained, or complicated to use. Consequently, we have developed HoCoRT, a fast and user-friendly tool that implements several methods for optimised host sequence removal. We have evaluated the speed and accuracy of these methods. Results: HoCoRT is an open-source command-line tool for host contamination removal. It is designed to be easy to install and use, offering a one-step option for genome indexing. HoCoRT employs a variety of well-known mapping, classification, and alignment methods to classify reads. The user can select the underlying classification method and its parameters, allowing adaptation to different scenarios. Based on our investigation of various methods and parameters using synthetic human gut and oral microbiomes, and on assessment of publicly available data, we provide recommendations for typical datasets with short and long reads. Conclusions: To decontaminate a human gut microbiome with short reads using HoCoRT, we found the optimal combination of speed and accuracy with BioBloom, Bowtie2 in end-to-end mode, and HISAT2. Kraken2 consistently demonstrated the highest speed, albeit with a trade-off in accuracy. The same applies to an oral microbiome, but here Bowtie2 was notably slower than the other tools. For long reads, the detection of human host reads is more difficult. In this case, a combination of Kraken2 and Minimap2 achieved the highest accuracy and detected 59% of human reads. In comparison to the dedicated DeconSeq tool, HoCoRT using Bowtie2 in end-to-end mode proved considerably faster and slightly more accurate. HoCoRT is available as a Bioconda package, and the source code can be accessed at https://github.com/ignasrum/hocort along with the documentation. It is released under the MIT licence and is compatible with Linux and macOS (except for the BioBloom module).",
                "authors": [
                    {
                        "name": "Rognes T."
                    },
                    {
                        "name": "Rounge T.B."
                    },
                    {
                        "name": "Rumbavicius I."
                    }
                ],
                "citationCount": 6,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HoCoRT: host contamination removal tool"
            },
            "pmcid": "PMC10544359",
            "pmid": "37784008"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ]
}
