{
    "additionDate": "2021-01-18T09:42:32Z",
    "biotoolsCURIE": "biotools:spgpcw",
    "biotoolsID": "spgpcw",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "joshua.warren@yale.edu",
            "name": "Joshua L. Warren",
            "typeEntity": "Person"
        }
    ],
    "description": "SpGPCW: Spatially Varying Gaussian Process Model for Critical Window Estimation.\nA spatially varying distributed lag model with application to an air pollution and term low birth weight study.\n\nThis package implements a hierarchical Bayesian logistic regression analysis to estimate spatially varying critical windows of susceptibility corresponding to exposure from a single time-varying covariate. The method relies on a spatiotemporally structured Gaussian process and is fit using Markov chain Monte Carlo sampling techniques. Please see the \"SpGPCW_Example\" folder for more specific information regarding package use details.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/warrenjl/SpGPCW",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-02-21T13:48:41Z",
    "name": "SpGPCW",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1111/RSSC.12407",
            "metadata": {
                "abstract": "© 2020 Royal Statistical SocietyDistributed lag models have been used to identify critical pregnancy periods of exposure (i.e. critical exposure windows) to air pollution in studies of pregnancy outcomes. However, much of the previous work in this area has ignored the possibility of spatial variability in the lagged health effect parameters that may result from exposure characteristics and/or residual confounding. We develop a spatially varying Gaussian process model for critical windows called ‘SpGPCW’ and use it to investigate geographic variability in the association between term low birth weight and average weekly concentrations of ozone and PM2.5 during pregnancy by using birth records from North Carolina. SpGPCW is designed to accommodate areal level spatial correlation between lagged health effect parameters and temporal smoothness in risk estimation across pregnancy. Through simulation and a real data application, we show that the consequences of ignoring spatial variability in the lagged health effect parameters include less reliable inference for the parameters and diminished ability to identify true critical window sets, and we investigate the use of existing Bayesian model comparison techniques as tools for determining the presence of spatial variability. We find that exposure to PM2.5 is associated with elevated term low birth weight risk in selected weeks and counties and that ignoring spatial variability results in null associations during these periods. An R package (SpGPCW) has been developed to implement the new method.",
                "authors": [
                    {
                        "name": "Chang H.H."
                    },
                    {
                        "name": "Luben T.J."
                    },
                    {
                        "name": "Warren J.L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Journal of the Royal Statistical Society. Series C: Applied Statistics",
                "title": "A spatially varying distributed lag model with application to an air pollution and term low birth weight study"
            },
            "pmcid": "PMC7319179",
            "pmid": "32595237"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gynaecology and obstetrics",
            "uri": "http://edamontology.org/topic_3411"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
