{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-12-19T16:40:26.656871Z",
    "biotoolsCURIE": "biotools:co-amppred",
    "biotoolsID": "co-amppred",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "emilysu@tmu.edu.tw",
            "name": "Emily Chia-Yu Su",
            "orcidid": "https://orcid.org/0000-0003-4801-5159",
            "typeEntity": "Person"
        }
    ],
    "description": "Co-AMPpred (composition-based antimicrobial peptide prediction); in silico-aided predictions of antimicrobial peptides by integrating composition-based features",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                }
            ]
        }
    ],
    "homepage": "https://github.com/onkarS23/CoAMPpred",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-19T16:40:26.659719Z",
    "name": "Co-AMPpred",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04305-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Antimicrobial peptides (AMPs) are oligopeptides that act as crucial components of innate immunity, naturally occur in all multicellular organisms, and are involved in the first line of defense function. Recent studies showed that AMPs perpetuate great potential that is not limited to antimicrobial activity. They are also crucial regulators of host immune responses that can modulate a wide range of activities, such as immune regulation, wound healing, and apoptosis. However, a microorganism's ability to adapt and to resist existing antibiotics triggered the scientific community to develop alternatives to conventional antibiotics. Therefore, to address this issue, we proposed Co-AMPpred, an in silico-aided AMP prediction method based on compositional features of amino acid residues to classify AMPs and non-AMPs. Results: In our study, we developed a prediction method that incorporates composition-based sequence and physicochemical features into various machine-learning algorithms. Then, the boruta feature-selection algorithm was used to identify discriminative biological features. Furthermore, we only used discriminative biological features to develop our model. Additionally, we performed a stratified tenfold cross-validation technique to validate the predictive performance of our AMP prediction model and evaluated on the independent holdout test dataset. A benchmark dataset was collected from previous studies to evaluate the predictive performance of our model. Conclusions: Experimental results show that combining composition-based and physicochemical features outperformed existing methods on both the benchmark training dataset and a reduced training dataset. Finally, our proposed method achieved 80.8% accuracies and 0.871 area under the receiver operating characteristic curve by evaluating on independent test set. Our code and datasets are available at https://github.com/onkarS23/CoAMPpred.",
                "authors": [
                    {
                        "name": "Hsu W.-L."
                    },
                    {
                        "name": "Singh O."
                    },
                    {
                        "name": "Su E.C.-Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Co-AMPpred for in silico-aided predictions of antimicrobial peptides by integrating composition-based features"
            },
            "pmcid": "PMC8325260",
            "pmid": "34330209"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
