{
    "additionDate": "2024-07-18T11:11:04.445873Z",
    "biotoolsCURIE": "biotools:genomycanalyzer",
    "biotoolsID": "genomycanalyzer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hyun@catholic.ac.kr",
            "name": "Seung-Hyun Jung",
            "typeEntity": "Person"
        }
    ],
    "description": "Web-based tool for species and drug resistance prediction for Mycobacterium genomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deletion detection",
                    "uri": "http://edamontology.org/operation_3962"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://www.mycochase.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-07-18T11:11:04.448861Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/IRCGP-Lab/GenoMycAnalyzer_Source"
        }
    ],
    "name": "GenoMycAnalyzer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12864-024-10320-3",
            "metadata": {
                "abstract": "Background: Drug-resistant tuberculosis (TB) is a major threat to global public health. Whole-genome sequencing (WGS) is a useful tool for species identification and drug resistance prediction, and many clinical laboratories are transitioning to WGS as a routine diagnostic tool. However, user-friendly and high-confidence automated bioinformatics tools are needed to rapidly identify M. tuberculosis complex (MTBC) and non-tuberculous mycobacteria (NTM), detect drug resistance, and further guide treatment options. Results: We developed GenoMycAnalyzer, a web-based software that integrates functions for identifying MTBC and NTM species, lineage and spoligotype prediction, variant calling, annotation, drug-resistance determination, and data visualization. The accuracy of GenoMycAnalyzer for genotypic drug susceptibility testing (gDST) was evaluated using 5,473 MTBC isolates that underwent phenotypic DST (pDST). The GenoMycAnalyzer database was built to predict the gDST for 15 antituberculosis drugs using the World Health Organization mutational catalogue. Compared to pDST, the sensitivity of drug susceptibilities by the GenoMycAnalyzer for first-line drugs ranged from 95.9% for rifampicin (95% CI 94.8–96.7%) to 79.6% for pyrazinamide (95% CI 76.9–82.2%), whereas those for second-line drugs ranged from 98.2% for levofloxacin (95% CI 90.1–100.0%) to 74.9% for capreomycin (95% CI 69.3–80.0%). Notably, the integration of large deletions of the four resistance-conferring genes increased gDST sensitivity. The specificity of drug susceptibilities by the GenoMycAnalyzer ranged from 98.7% for amikacin (95% CI 97.8–99.3%) to 79.5% for ethionamide (95% CI 76.4–82.3%). The incorporated Kraken2 software identified 1,284 mycobacterial species with an accuracy of 98.8%. GenoMycAnalyzer also perfectly predicted lineages for 1,935 MTBC and spoligotypes for 54 MTBC. Conclusions: GenoMycAnalyzer offers both web-based and graphical user interfaces, which can help biologists with limited access to high-performance computing systems or limited bioinformatics skills. By streamlining the interpretation of WGS data, the GenoMycAnalyzer has the potential to significantly impact TB management and contribute to global efforts to combat this infectious disease. GenoMycAnalyzer is available at http://www.mycochase.org.",
                "authors": [
                    {
                        "name": "Cho W.Y."
                    },
                    {
                        "name": "Chu J."
                    },
                    {
                        "name": "Chung Y.-J."
                    },
                    {
                        "name": "Jo S."
                    },
                    {
                        "name": "Jung S.-H."
                    },
                    {
                        "name": "Kim D."
                    },
                    {
                        "name": "Park Y.-J."
                    },
                    {
                        "name": "Shin J.-I."
                    },
                    {
                        "name": "Shin S.-H."
                    },
                    {
                        "name": "Yoo I.Y."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GenoMycAnalyzer: a web-based tool for species and drug resistance prediction for Mycobacterium genomes"
            },
            "pmcid": "PMC11031912",
            "pmid": "38643090"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
