{
    "additionDate": "2021-01-18T07:31:24Z",
    "biotoolsCURIE": "biotools:rmsiproc",
    "biotoolsID": "rmsiproc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pere.rafols@urv.cat",
            "name": "Pere Ràfols",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for mass spectrometry imaging data processing.\n\nMass spectrometry imaging (MSI) can reveal biochemical information directly from a tissue section. MSI generates a large quantity of complex spectral data which is still challenging to translate into relevant biochemical information. Here, we present rMSIproc, an open-source R package that implements a full data processing workflow for MSI experiments performed using TOF or FT-based mass spectrometers. The package provides a novel strategy for spectral alignment and recalibration, which allows to process multiple datasets simultaneously",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                }
            ]
        }
    ],
    "homepage": "https://github.com/prafols/rMSIproc",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-07T11:57:57Z",
    "name": "rMSIproc",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA142",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Mass spectrometry imaging (MSI) can reveal biochemical information directly from a tissue section. MSI generates a large quantity of complex spectral data which is still challenging to translate into relevant biochemical information. Here, we present rMSIproc, an open-source R package that implements a full data processing workflow for MSI experiments performed using TOF or FT-based mass spectrometers. The package provides a novel strategy for spectral alignment and recalibration, which allows to process multiple datasets simultaneously. This enables to perform a confident statistical analysis with multiple datasets from one or several experiments. rMSIproc is designed to work with files larger than the computer memory capacity and the algorithms are implemented using a multi-threading strategy. rMSIproc is a powerful tool able to take full advantage of modern computer systems to completely develop the whole MSI potential. Contact: pere.rafols@urv.cat",
                "authors": [
                    {
                        "name": "Rafols P."
                    },
                    {
                        "name": "Heijs B."
                    },
                    {
                        "name": "Del Castillo E."
                    },
                    {
                        "name": "Yanes O."
                    },
                    {
                        "name": "McDonnell L.A."
                    },
                    {
                        "name": "Brezmes J."
                    },
                    {
                        "name": "Perez-Taboada I."
                    },
                    {
                        "name": "Vallejo M."
                    },
                    {
                        "name": "Garcia-Altares M."
                    },
                    {
                        "name": "Correig X."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RMSIproc: An R package for mass spectrometry imaging data processing"
            },
            "pmid": "32108859"
        }
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}