
{
    "credit": [
        {
            "email": "saikat@iicb.res.in",
            "name": "Saikat Chakrabarti",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.hpppi.iicb.res.in/ss/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein binding sites",
                "uri": "http://edamontology.org/topic_3534"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Sites that show specific conservation patterns within subsets of proteins in a protein family are likely to be involved in the development of functional specificity. These sites, generally termed specificity determining sites (SDS), might play a crucial role in binding to a specific substrate or proteins. Identification of SDS through experimental techniques is a slow, difficult and tedious job. Hence, it is very important to develop efficient computational methods that can more expediently identify SDS. Herein, we present Specificity prediction using amino acids' Properties, Entropy and Evolution Rate (SPEER)-SERVER, a web server that predicts SDS by analyzing quantitative measures of the conservation patterns of protein sites based on their physico-chemical properties and the heterogeneity of evolutionary changes between and within the protein subfamilies. This web server provides an improved representation of results, adds useful input and output options and integrates a wide range of analysis and data visualization tools when compared with the original standalone version of the SPEER algorithm. Extensive benchmarking finds that SPEER-SERVER exhibits sensitivity and precision performance that, on average, meets or exceeds that of other currently available methods. SPEER-SERVER is available at http://www.hpppi.iicb.res.in/ss/. © 2012 The Author(s).",
            "authors": [
                "Chakraborty A.",
                "Mandloi S.",
                "Lanczycki C.J.",
                "Panchenko A.R.",
                "Chakrabarti S."
            ],
            "cit_count": 15,
            "journal": "Nucleic Acids Research",
            "pmid": "22689646",
            "title": "SPEER-SERVER: A web server for prediction of protein specificity determining sites",
            "year": "2012-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:speer-server",
        "biotoolsID": "speer-server",
        "description": "Web server that encodes the specific conservation pattern of amino acid types in a protein family to identify the specificity determining sites (SDS). The specific conservation pattern is predicted using amino acids_?? physico-chemical properties, relative entropy and the evolutionary rates between the protein subfamilies.",
        "homepage": "http://www.hpppi.iicb.res.in/ss/",
        "name": "SPEER-SERVER"
    }
}