{
    "additionDate": "2021-01-18T09:21:10Z",
    "biotoolsCURIE": "biotools:falsecolor-python",
    "biotoolsID": "falsecolor-python",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jonliu@uw.edu",
            "name": "Jonathan T. C Liu",
            "typeEntity": "Person"
        },
        {
            "email": "serrob23@uw.edu",
            "name": "Robert Serafin",
            "typeEntity": "Person"
        }
    ],
    "description": "FalseColor-Python is a rapid intensity-leveling and digital-staining package for fluorescence-based slide-free digital pathology. It can be used for translating two-channel fluorescence images (i.e. a nuclear and cytoplasmic stain) to the traditional H&E histopathology color space.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/serrob23/falsecolor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-10T19:37:48Z",
    "license": "AGPL-3.0",
    "name": "FalseColor-Python",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.05.03.074955"
        },
        {
            "doi": "10.1371/journal.pone.0233198",
            "metadata": {
                "abstract": "Copyright: © 2020 Serafin et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Slide-free digital pathology techniques, including nondestructive 3D microscopy, are gaining interest as alternatives to traditional slide-based histology. In order to facilitate clinical adoption of these fluorescence-based techniques, software methods have been developed to convert grayscale fluorescence images into color images that mimic the appearance of standard absorptive chromogens such as hematoxylin and eosin (H&E). However, these false-coloring algorithms often require manual and iterative adjustment of parameters, with results that can be inconsistent in the presence of intensity nonuniformities within an image and/or between specimens (intra- and inter-specimen variability). Here, we present an open-source (Python-based) rapid intensity-leveling and digital-staining package that is specifically designed to render two-channel fluorescence images (i.e. a fluorescent analog of H&E) to the traditional H&E color space for 2D and 3D microscopy datasets. However, this method can be easily tailored for other false-coloring needs. Our package offers (1) automated and uniform false coloring in spite of uneven staining within a large thick specimen, (2) consistent color-space representations that are robust to variations in staining and imaging conditions between different specimens, and (3) GPU-accelerated data processing to allow these methods to scale to large datasets. We demonstrate this platform by generating H&E-like images from cleared tissues that are fluorescently imaged in 3D with open-top light-sheet (OTLS) microscopy, and quantitatively characterizing the results in comparison to traditional slide-based H&E histology.",
                "authors": [
                    {
                        "name": "Glaser A.K."
                    },
                    {
                        "name": "Liu J.T.C."
                    },
                    {
                        "name": "Serafin R."
                    },
                    {
                        "name": "Xie W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FalseColor-Python: A rapid intensity-leveling and digital-staining package for fluorescence-based slide-free digital pathology"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
