{
    "additionDate": "2019-11-14T19:42:05Z",
    "biotoolsCURIE": "biotools:T-MTSCCA",
    "biotoolsID": "T-MTSCCA",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "dulei@nwpu.edu.cn",
            "name": "Lei Du",
            "typeEntity": "Person"
        },
        {
            "email": "li.shen@pennmedicine.upenn.edu",
            "name": "Li Shen",
            "typeEntity": "Person"
        }
    ],
    "description": "Identifying progressive imaging genetic patterns via multi-task sparse canonical correlation analysis | temporal multi-task sparse canonical correlation analysis | T-MTSCCA: temporal multi-task SCCA model for longitudinal brain imagign genetics",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dulei323/TMTSCCA",
    "language": [
        "MATLAB",
        "C++",
        "C"
    ],
    "lastUpdate": "2019-11-14T19:42:05Z",
    "license": "GPL-3.0",
    "name": "T-MTSCCA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ320",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Identifying the genetic basis of the brain structure, function and disorder by using the imaging quantitative traits (QTs) as endophenotypes is an important task in brain science. Brain QTs often change over time while the disorder progresses and thus understanding how the genetic factors play roles on the progressive brain QT changes is of great importance and meaning. Most existing imaging genetics methods only analyze the baseline neuroimaging data, and thus those longitudinal imaging data across multiple time points containing important disease progression information are omitted. Results: We propose a novel temporal imaging genetic model which performs the multi-task sparse canonical correlation analysis (T-MTSCCA). Our model uses longitudinal neuroimaging data to uncover that how single nucleotide polymorphisms (SNPs) play roles on affecting brain QTs over the time. Incorporating the relationship of the longitudinal imaging data and that within SNPs, T-MTSCCA could identify a trajectory of progressive imaging genetic patterns over the time. We propose an efficient algorithm to solve the problem and show its convergence. We evaluate T-MTSCCA on 408 subjects from the Alzheimer's Disease Neuroimaging Initiative database with longitudinal magnetic resonance imaging data and genetic data available. The experimental results show that T-MTSCCA performs either better than or equally to the state-of-the-art methods. In particular, T-MTSCCA could identify higher canonical correlation coefficients and capture clearer canonical weight patterns. This suggests that T-MTSCCA identifies time-consistent and time-dependent SNPs and imaging QTs, which further help understand the genetic basis of the brain QT changes over the time during the disease progression.",
                "authors": [
                    {
                        "name": "Du L."
                    },
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Zhu L."
                    },
                    {
                        "name": "Yao X."
                    },
                    {
                        "name": "Risacher S.L."
                    },
                    {
                        "name": "Guo L."
                    },
                    {
                        "name": "Saykin A.J."
                    },
                    {
                        "name": "Shen L."
                    }
                ],
                "citationCount": 6,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifying progressive imaging genetic patterns via multi-task sparse canonical correlation analysis: A longitudinal study of the ADNI cohort"
            },
            "pmcid": "PMC6613037",
            "pmid": "31510645"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}