{
    "additionDate": "2020-01-14T20:17:32Z",
    "biotoolsCURIE": "biotools:Metabolic_Disassembler",
    "biotoolsID": "Metabolic_Disassembler",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "maskot@chemsys.t.u-tokyo.ac.jp",
            "name": "Masaaki Kotera",
            "orcidid": "https://orcid.org/0000-0001-8188-3623",
            "typeEntity": "Person"
        }
    ],
    "description": "Metabolic disassembler for understanding and predicting the biosynthetic units of natural products.\n\nThe Metabolic Disassembler is a Python package to automatically predict a combination of biosynthetic units in a natural product. This software would help to reveal the starting materials of the target natural product.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "https://github.com/the-metabolic-disassembler/metadisassembler",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T09:03:01Z",
    "license": "MIT",
    "name": "Metabolic Disassembler",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3183-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Natural products are the source of various functional materials such as medicines, and understanding their biosynthetic pathways can provide information that is helpful for their effective production through the synthetic biology approach. A number of studies have aimed to predict biosynthetic pathways from their chemical structures in a retrosynthesis manner; however, sometimes the calculation finishes without reaching the starting material from the target molecule. In order to address this problem, the method to find suitable starting materials is required. Results: In this study, we developed a predictive workflow named the Metabolic Disassembler that automatically disassembles the target molecule structure into relevant biosynthetic units (BUs), which are the substructures that correspond to the starting materials in the biosynthesis pathway. This workflow uses a biosynthetic unit library (BUL), which contains starting materials, key intermediates, and their derivatives. We obtained the starting materials from the KEGG PATHWAY database, and 765 BUs were registered in the BUL. We then examined the proposed workflow to optimize the combination of the BUs. To evaluate the performance of the proposed Metabolic Disassembler workflow, we used 943 molecules that are included in the secondary metabolism maps of KEGG PATHWAY. About 95.8% of them (903 molecules) were correctly disassembled by our proposed workflow. For comparison, we also implemented a genetic algorithm-based workflow, and found that the accuracy was only about 52.0%. In addition, for 90.7% of molecules, our workflow finished the calculation within one minute. Conclusions: The Metabolic Disassembler enabled the effective disassembly of natural products in terms of both correctness and computational time. It also outputs automatically highlighted color-coded substructures corresponding to the BUs to help users understand the calculation results. The users do not have to specify starting molecules in advance, and can input any target molecule, even if it is not in databases. Our workflow will be very useful for understanding and predicting the biosynthesis of natural products.",
                "authors": [
                    {
                        "name": "Amano K."
                    },
                    {
                        "name": "Matsumoto T."
                    },
                    {
                        "name": "Tanaka K."
                    },
                    {
                        "name": "Funatsu K."
                    },
                    {
                        "name": "Kotera M."
                    }
                ],
                "date": "2019-12-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Metabolic disassembler for understanding and predicting the biosynthetic units of natural products"
            },
            "pmcid": "PMC6929434",
            "pmid": "31870296"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1
}