{
    "additionDate": "2021-01-18T10:58:47Z",
    "biotoolsCURIE": "biotools:ebwt2indel",
    "biotoolsID": "ebwt2indel",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "giovanna.rosone@unipi.it",
            "name": "Giovanna Rosone",
            "orcidid": "https://orcid.org/0000-0001-5075-1214",
            "typeEntity": "Person"
        }
    ],
    "description": "ebwt2InDel is a tool for finding SNPs and InDels from the BWT of a FASTA read set.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://github.com/nicolaprezza/ebwt2InDel",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-05T15:12:27Z",
    "license": "MIT",
    "name": "ebwt2InDel",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03586-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: In [Prezza et al., AMB 2019], a new reference-free and alignment-free framework for the detection of SNPs was suggested and tested. The framework, based on the Burrows-Wheeler Transform (BWT), significantly improves sensitivity and precision of previous de Bruijn graphs based tools by overcoming several of their limitations, namely: (i) the need to establish a fixed value, usually small, for the order k, (ii) the loss of important information such as k-mer coverage and adjacency of k-mers within the same read, and (iii) bad performance in repeated regions longer than k bases. The preliminary tool, however, was able to identify only SNPs and it was too slow and memory consuming due to the use of additional heavy data structures (namely, the Suffix and LCP arrays), besides the BWT. Results: In this paper, we introduce a new algorithm and the corresponding tool ebwt2InDel that (i) extend the framework of [Prezza et al., AMB 2019] to detect also INDELs, and (ii) implements recent algorithmic findings that allow to perform the whole analysis using just the BWT, thus reducing the working space by one order of magnitude and allowing the analysis of full genomes. Finally, we describe a simple strategy for effectively parallelizing our tool for SNP detection only. On a 24-cores machine, the parallel version of our tool is one order of magnitude faster than the sequential one. The tool ebwt2InDel is available at github.com/nicolaprezza/ebwt2InDel. Conclusions: Results on a synthetic dataset covered at 30x (Human chromosome 1) show that our tool is indeed able to find up to 83% of the SNPs and 72% of the existing INDELs. These percentages considerably improve the 71% of SNPs and 51% of INDELs found by the state-of-the art tool based on de Bruijn graphs. We furthermore report results on larger (real) Human whole-genome sequencing experiments. Also in these cases, our tool exhibits a much higher sensitivity than the state-of-the art tool.",
                "authors": [
                    {
                        "name": "Prezza N."
                    },
                    {
                        "name": "Pisanti N."
                    },
                    {
                        "name": "Sciortino M."
                    },
                    {
                        "name": "Rosone G."
                    }
                ],
                "citationCount": 3,
                "date": "2020-09-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Variable-order reference-free variant discovery with the Burrows-Wheeler Transform"
            },
            "pmcid": "PMC7493873",
            "pmid": "32938358"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}