{
    "additionDate": "2021-01-18T08:59:52Z",
    "biotoolsCURIE": "biotools:pretimeth",
    "biotoolsID": "pretimeth",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shicaifan@uestc.edu.cn",
            "name": "Shicai Fan",
            "typeEntity": "Person"
        }
    ],
    "description": "PretiMeth is a precise computational prediction method of the CpG site-specific methylation level in multiple tissues or cells, it provides continuous methylation prediction values rather than methylation status and provides an independent accuracy for each CpG locus to allow users to screen high quality models(or CpGs).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JxTang-bioinformatics/PretiMeth",
    "language": [
        "Python",
        "C++",
        "R"
    ],
    "lastUpdate": "2021-01-27T16:53:11Z",
    "license": "MIT",
    "name": "PretiMeth",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6768-9",
            "metadata": {
                "abstract": "BACKGROUND: The computational prediction of methylation levels at single CpG resolution is promising to explore the methylation levels of CpGs uncovered by existing array techniques, especially for the 450 K beadchip array data with huge reserves. General prediction models concentrate on improving the overall prediction accuracy for the bulk of CpG loci while neglecting whether each locus is precisely predicted. This leads to the limited application of the prediction results, especially when performing downstream analysis with high precision requirements. RESULTS: Here we reported PretiMeth, a method for constructing precise prediction models for each single CpG locus. PretiMeth used a logistic regression algorithm to build a prediction model for each interested locus. Only one DNA methylation feature that shared the most similar methylation pattern with the CpG locus to be predicted was applied in the model. We found that PretiMeth outperformed other algorithms in the prediction accuracy, and kept robust across platforms and cell types. Furthermore, PretiMeth was applied to The Cancer Genome Atlas data (TCGA), the intensive analysis based on precise prediction results showed that several CpG loci and genes (differentially methylated between the tumor and normal samples) were worthy for further biological validation. CONCLUSION: The precise prediction of single CpG locus is important for both methylation array data expansion and downstream analysis of prediction results. PretiMeth achieved precise modeling for each CpG locus by using only one significant feature, which also suggested that our precise prediction models could be probably used for reference in the probe set design when the DNA methylation beadchip update. PretiMeth is provided as an open source tool via https://github.com/JxTang-bioinformatics/PretiMeth.",
                "authors": [
                    {
                        "name": "Tang J."
                    },
                    {
                        "name": "Zou J."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Fan M."
                    },
                    {
                        "name": "Tian Q."
                    },
                    {
                        "name": "Fu S."
                    },
                    {
                        "name": "Gao S."
                    },
                    {
                        "name": "Fan S."
                    }
                ],
                "date": "2020-05-15T00:00:00Z",
                "journal": "BMC genomics",
                "title": "PretiMeth: precise prediction models for DNA methylation based on single methylation mark"
            },
            "pmcid": "PMC7227319",
            "pmid": "32414326"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}