{
    "additionDate": "2021-10-04T11:26:19.312786Z",
    "biotoolsCURIE": "biotools:ligadvisor",
    "biotoolsID": "ligadvisor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "giulio.rastelli@unimore.it",
            "name": "Giulio Rastelli",
            "orcidid": "https://orcid.org/0000-0002-2474-0607",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "LigAdvisor is a a versatile and user-friendly web-platform for drug design. Although several tools facilitating in silico drug design are available, their results are usually difficult to integrate with publicly available information or require further processing to be fully exploited. The rational design of multi-target ligands (polypharmacology) and the repositioning of known drugs towards unmet therapeutic needs (drug repurposing) have raised increasing attention in drug discovery, although they usually require careful planning of tailored drug design strategies. Computational tools and data-driven approaches can help to reveal novel valuable opportunities in these contexts, as they enable to efficiently mine publicly available chemical, biological, clinical, and disease-related data",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://ligadvisor.unimore.it/tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://ligadvisor.unimore.it/",
    "lastUpdate": "2021-10-04T11:26:19.315355Z",
    "name": "LigAdvisor",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB385",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press on behalf of Nucleic Acids Research.Although several tools facilitating in silico drug design are available, their results are usually difficult to integrate with publicly available information or require further processing to be fully exploited. The rational design of multi-target ligands (polypharmacology) and the repositioning of known drugs towards unmet therapeutic needs (drug repurposing) have raised increasing attention in drug discovery, although they usually require careful planning of tailored drug design strategies. Computational tools and data-driven approaches can help to reveal novel valuable opportunities in these contexts, as they enable to efficiently mine publicly available chemical, biological, clinical, and disease-related data. Based on these premises, we developed LigAdvisor, a data-driven webserver which integrates information reported in DrugBank, Protein Data Bank, UniProt, Clinical Trials and Therapeutic Target Database into an intuitive platform, to facilitate drug discovery tasks as drug repurposing, polypharmacology, target fishing and profiling. As designed, LigAdvisor enables easy integration of similarity estimation results with clinical data, thereby allowing a more efficient exploitation of information in different drug discovery contexts. Users can also develop customizable drug design tasks on their own molecules, by means of ligand- and target-based search modes, and download their results. LigAdvisor is publicly available at https://ligadvisor.unimore.it/.",
                "authors": [
                    {
                        "name": "Pinzi L."
                    },
                    {
                        "name": "Tinivella A."
                    },
                    {
                        "name": "Gagliardelli L."
                    },
                    {
                        "name": "Beneventano D."
                    },
                    {
                        "name": "Rastelli G."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LigAdvisor: A versatile and user-friendly web-platform for drug design"
            },
            "pmid": "34023895",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}