{
    "additionDate": "2021-03-19T08:52:21Z",
    "biotoolsCURIE": "biotools:seqcor",
    "biotoolsID": "seqcor",
    "confidence_flag": "tool",
    "description": "SeqCor is a tool for correcting the effect of guide RNA sequences in clustered regularly interspaced short palindromic repeats/Cas9 screening by machine learning algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangyi-fudan/SeqCor",
    "lastUpdate": "2021-04-08T12:33:52Z",
    "name": "SeqCor",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JGG.2020.10.007",
            "metadata": {
                "abstract": "© 2020 Institute of Genetics and Developmental Biology, Chinese Academy of Sciences, and Genetics Society of ChinaClustered regularly interspaced short palindromic repeats (CRISPR)/Cas9-based screening using various guide RNA (gRNA) libraries has been executed to identify functional components for a wide range of phenotypes with regard to numerous cell types and organisms. Using data from public CRISPR/Cas9-based screening experiments, we found that the sequences of gRNAs in the library influence CRISPR/Cas9-based screening. As building a standard strategy for correcting results of all gRNA libraries is impractical, we developed SeqCor, an open-source programming bundle that enables researchers to address the result bias potentially triggered by the composition of gRNA sequences via the organization of gRNA in the library used in CRISPR/Cas9-based screening. Furthermore, SeqCor completely computerizes the extraction of sequence features that may influence single-guide RNA knockout efficiency using a machine learning approach. Taken together, we have developed a software program bundle that ought to be beneficial to the CRISPR/Cas9-based screening platform.",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Qiu Y."
                    },
                    {
                        "name": "Reyad-ul-ferdous M."
                    },
                    {
                        "name": "Ding Q."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2020-11-20T00:00:00Z",
                "journal": "Journal of Genetics and Genomics",
                "title": "SeqCor: correct the effect of guide RNA sequences in clustered regularly interspaced short palindromic repeats/Cas9 screening by machine learning algorithm"
            },
            "pmid": "33451939"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ]
}