{
    "additionDate": "2021-06-14T12:30:13Z",
    "biotoolsCURIE": "biotools:comsuc",
    "biotoolsID": "comsuc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "boxc@bmi.ac.cn",
            "name": "Xiaochen Bo",
            "orcidid": "https://orcid.org/0000-0003-1911-7922",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "COMSUC web server for identification of COnsensus Molecular SUbtype of Cancer allows users to identify Consensus Molecular Subtypes (CMS) by integrating multiple clustering results based on multiple platform, multiple omics data and multiple methods. The COMSUC web server has the goal of fusion, clustering and interactive visualization of multi-omics data for patient samples.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://comsuc.bioinforai.tech/manualTab/Html/General"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://comsuc.bioinforai.tech/",
    "lastUpdate": "2021-08-23T14:06:26Z",
    "name": "COMSUC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008769",
            "metadata": {
                "abstract": "© 2021 He et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Extensive amounts of multi-omics data and multiple cancer subtyping methods have been developed rapidly, and generate discrepant clustering results, which poses challenges for cancer molecular subtype research. Thus, the development of methods for the identification of cancer consensus molecular subtypes is essential. The lack of intuitive and easy-to-use analytical tools has posed a barrier. Here, we report on the development of the COnsensus Molecular SUbtype of Cancer (COMSUC) web server. With COMSUC, users can explore consensus molecular subtypes of more than 30 cancers based on eight clustering methods, five types of omics data from public reference datasets or users' private data, and three consensus clustering methods. The web server provides interactive and modifiable visualization, and publishable output of analysis results. Researchers can also exchange consensus subtype results with collaborators via project IDs. COMSUC is now publicly and freely available with no login requirement at http://comsuc.bioinforai.tech/ (IP address: http://59.110.25.27/). For a video summary of this web server, see S1 Video and S1 File.",
                "authors": [
                    {
                        "name": "Bo X."
                    },
                    {
                        "name": "Feng J."
                    },
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Wen Y."
                    },
                    {
                        "name": "Wu L."
                    },
                    {
                        "name": "Yan B."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Yu J."
                    }
                ],
                "date": "2021-03-18T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "COMSUC: A web server for the identification of consensus molecular subtypes of cancer based on multiple methods and multi-omics data"
            },
            "pmcid": "PMC8009357",
            "pmid": "33735194",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
