{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T07:28:46Z",
    "biotoolsCURIE": "biotools:fhldb",
    "biotoolsID": "fhldb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rcolobran@vhebron.net",
            "name": "Roger Colobran",
            "typeEntity": "Person"
        }
    ],
    "description": "FLHdb is database of variants of Familial Hemophagocytic Lymphohistiocytosis from the Clinical and Translational Bioinformatics Research Group at Vall Hebron Institute of Research (VHIR).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://www.biotoclin.org/FHLdb",
    "language": [
        "SQL",
        "Python"
    ],
    "lastUpdate": "2021-03-11T08:42:44Z",
    "name": "FHLdb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2020.00107",
            "metadata": {
                "abstract": "© Copyright © 2020 Viñas-Giménez, Padilla, Batlle-Masó, Casals, Rivière, Martínez-Gallo, de la Cruz and Colobran.Background: Primary immunodeficiencies (PIDs) are a heterogeneous group of disorders. The lack of comprehensive disease-specific mutation databases may hinder or delay classification of the genetic variants found in samples from these patients. This is especially true for familial hemophagocytic lymphohistiocytosis (FHL), a life-threatening PID classically considered an autosomal recessive condition, but with increasingly demonstrated genetic heterogeneity. Objective: The aim of this study was to build an open-access repository to collect detailed information on the known genetic variants reported in FHL. Methods: We manually reviewed more than 120 articles to identify all reported variants related to FHL. We retrieved relevant information about the allelic status, the number of patients with the same variant, and whether functional assays were done. We stored all the data retrieved in a PostgreSQL database and then built a website on top of it, using the Django framework. Results: The database designed (FHLdb) (https://www.biotoclin.org/FHLdb) contains comprehensive information on reported variants in the 4 genes related to FHL (PRF1, UNC13D, STXBP2, STX11). It comprises 240 missense, 69 frameshift, 51 nonsense, 51 splicing, 10 in-frame indel, 7 deep intronic, and 5 large rearrangement variants together with their allelic status, carrier(s) information, and functional evidence. All genetic variants have been classified as pathogenic, likely pathogenic, uncertain significance, likely benign or benign, according to the American College of Medical Genetics guidelines. Additionally, it integrates information from other relevant databases: clinical evidence from ClinVar and UniProt, population allele frequency from ExAC and gnomAD, and pathogenicity predictions from well-recognized tools (e.g., PolyPhen-2, SIFT). Finally, a diagram depicts the location of the variant relative to the gene exon and protein domain structures. Conclusion: FHLdb includes a broad range of data on the reported genetic variants in familial HLH genes. It is a free-access and easy-to-use resource that will facilitate the interpretation of molecular results of FHL patients, and it illustrates the potential value of disease-specific databases for other PIDs.",
                "authors": [
                    {
                        "name": "Vinas-Gimenez L."
                    },
                    {
                        "name": "Padilla N."
                    },
                    {
                        "name": "Batlle-Maso L."
                    },
                    {
                        "name": "Casals F."
                    },
                    {
                        "name": "Riviere J.G."
                    },
                    {
                        "name": "Martinez-Gallo M."
                    },
                    {
                        "name": "de la Cruz X."
                    },
                    {
                        "name": "Colobran R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-31T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "FHLdb: A Comprehensive Database on the Molecular Basis of Familial Hemophagocytic Lymphohistiocytosis"
            },
            "pmcid": "PMC7006814",
            "pmid": "32076423"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}