{
    "additionDate": "2020-01-14T09:48:04Z",
    "biotoolsCURIE": "biotools:latent_Gaussian_copula_model",
    "biotoolsID": "latent_Gaussian_copula_model",
    "confidence_flag": "tool",
    "description": "A Latent Gaussian Copula Model for Mixed Data Analysis in Brain Imaging Genetics.\n\nThis gives the code for the latent Gaussian copula model.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Aiying0512/LGCM",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:53:54.960510Z",
    "name": "latent Gaussian copula model",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/tcbb.2019.2950904",
            "metadata": {
                "abstract": "Recent advances in imaging genetics make it possible to combine different types of data including medical images like functional magnetic resonance imaging (fMRI) and genetic data like single nucleotide polymorphisms (SNPs) for comprehensive diagnosis of mental disorders. Understanding complex interactions among these heterogeneous data may give rise to a new perspective, while at the same time demand statistical models for their integration. Various graphical models have been proposed for the study of interaction or association networks with continuous, binary, and count data as well as the mixture of them. However, limited efforts have been made for the multinomial case, for instance, SNP data. Our goal is therefore to fill the void by developing a graphical model for the integration of fMRI image and SNP data, which can provide deeper understanding of the unknown neurogenetic mechanism. In this article, we propose a latent Gaussian copula model for mixed data containing multinomial components. We assume that the discrete variable is obtained by discretizing a latent (unobserved) continuous variable and then create a semi-rank based estimator of the graph structure. The simulation results demonstrate that the proposed latent correlation has more steady and accurate performance than several existing methods in detecting graph structure. When applying to a real schizophrenia data consisting of SNP array and fMRI image collected by the Mind Clinical Imaging Consortium (MCIC), the proposed method reveals a set of distinct SNP-brain associations, which are verified to be biologically significant. The proposed model is statistically promising in handling mixed types of data including multinomial components, which can find widespread applications. To promote reproducible research, the R code is available at https://github.com/Aiying0512/LGCM.",
                "authors": [
                    {
                        "name": "Calhoun V.D."
                    },
                    {
                        "name": "Fang J."
                    },
                    {
                        "name": "Hu W."
                    },
                    {
                        "name": "Wang Y.-P."
                    },
                    {
                        "name": "Zhang A."
                    }
                ],
                "citationCount": 3,
                "date": "2021-07-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "A Latent Gaussian Copula Model for Mixed Data Analysis in Brain Imaging Genetics"
            },
            "pmcid": "PMC7756188",
            "pmid": "31689199"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
