{
    "additionDate": "2017-08-03T18:48:11Z",
    "biotoolsCURIE": "biotools:lpcf",
    "biotoolsID": "lpcf",
    "credit": [
        {
            "email": "kvodski@bu.edu",
            "name": "Konstantin Voevodski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://xialab.bu.edu/"
        }
    ],
    "description": "Allows the user to quickly find a high-quality community close to a queried protein in any network available from BioGRID or specified by the user.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gaussian.bu.edu/lpcf.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "http://gaussian.bu.edu/lpcf.html",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/lpcf-local-protein-community-finder.html"
        }
    ],
    "name": "LPCF",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Protein-protein interactions (PPIs) play fundamental roles in nearly all biological processes, and provide major insights into the inner workings of cells. A vast amount of PPI data for various organisms is available from BioGRID and other sources. The identification of communities in PPI networks is of great interest because they often reveal previously unknown functional ties between proteins. A large number of global clustering algorithms have been applied to protein networks, where the entire network is partitioned into clusters. Here we take a different approach by looking for local communities in PPI networks. Results: We develop a tool, named Local Protein Community Finder, which quickly finds a community close to a queried protein in any network available from BioGRID or specified by the user. Our tool uses two new local clustering algorithms Nibble and PageRank-Nibble, which look for a good cluster among the most popular destinations of a short random walk from the queried vertex. The quality of a cluster is determined by proportion of outgoing edges, known as conductance, which is a relative measure particularly useful in undersampled networks. We show that the two local clustering algorithms find communities that not only form excellent clusters, but are also likely to be biologically relevant functional components. We compare the performance of Nibble and PageRank-Nibble to other popular and effective graph partitioning algorithms, and show that they find better clusters in the graph. Moreover, Nibble and PageRank-Nibble find communities that are more functionally coherent. Conclusion: The Local Protein Community Finder, accessible at http://xialab.bu.edu/resources/lpcf, allows the user to quickly find a high-quality community close to a queried protein in any network available from BioGRID or specified by the user. We show that the communities found by our tool form good clusters and are functionally coherent, making our application useful for biologists who wish to investigate functional modules that a particular protein is a part of. © 2009 Voevodski et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Voevodski K."
                    },
                    {
                        "name": "Teng S.-H."
                    },
                    {
                        "name": "Xia Y."
                    }
                ],
                "citationCount": 50,
                "date": "2009-09-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Finding local communities in protein networks"
            },
            "pmid": "19765306"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}