{
    "additionDate": "2021-12-13T13:15:39.948586Z",
    "biotoolsCURIE": "biotools:vgaelda",
    "biotoolsID": "vgaelda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhanghan@nankai.edu.cn",
            "name": "Han Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "VGAELDA is a representation learning model based on variational inference and graph autoencoder for predicting lncRNA-disease associations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhanglabNKU/VGAELDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-13T13:15:39.951251Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/zhanglabNKU/VGAELDA/issues"
        }
    ],
    "name": "VGAELDA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04073-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Numerous studies have demonstrated that long non-coding RNAs are related to plenty of human diseases. Therefore, it is crucial to predict potential lncRNA-disease associations for disease prognosis, diagnosis and therapy. Dozens of machine learning and deep learning algorithms have been adopted to this problem, yet it is still challenging to learn efficient low-dimensional representations from high-dimensional features of lncRNAs and diseases to predict unknown lncRNA-disease associations accurately. Results: We proposed an end-to-end model, VGAELDA, which integrates variational inference and graph autoencoders for lncRNA-disease associations prediction. VGAELDA contains two kinds of graph autoencoders. Variational graph autoencoders (VGAE) infer representations from features of lncRNAs and diseases respectively, while graph autoencoders propagate labels via known lncRNA-disease associations. These two kinds of autoencoders are trained alternately by adopting variational expectation maximization algorithm. The integration of both the VGAE for graph representation learning, and the alternate training via variational inference, strengthens the capability of VGAELDA to capture efficient low-dimensional representations from high-dimensional features, and hence promotes the robustness and preciseness for predicting unknown lncRNA-disease associations. Further analysis illuminates that the designed co-training framework of lncRNA and disease for VGAELDA solves a geometric matrix completion problem for capturing efficient low-dimensional representations via a deep learning approach. Conclusion: Cross validations and numerical experiments illustrate that VGAELDA outperforms the current state-of-the-art methods in lncRNA-disease association prediction. Case studies indicate that VGAELDA is capable of detecting potential lncRNA-disease associations. The source code and data are available at https://github.com/zhanglabNKU/VGAELDA.",
                "authors": [
                    {
                        "name": "Shi Z."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Jin C."
                    },
                    {
                        "name": "Quan X."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "citationCount": 4,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A representation learning model based on variational inference and graph autoencoder for predicting lncRNA-disease associations"
            },
            "pmcid": "PMC7983260",
            "pmid": "33745450",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}