{
    "additionDate": "2021-01-18T07:57:30Z",
    "biotoolsCURIE": "biotools:lcqs",
    "biotoolsID": "lcqs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sbdong@scut.edu.cn",
            "name": "Shoubin Dong",
            "typeEntity": "Person"
        }
    ],
    "description": "An efficient lossless compression tool of quality scores with random access functionality.\n\nThis software implements the LCQS algorithm described in: Fu J , Ke B , Dong S . “LCQS: an efficient lossless compression tool of quality scores with random access functionality” [J]. BMC Bioinformatics, 2020, 21(1).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SCUT-CCNL/LCQS",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-12T11:20:42Z",
    "name": "LCQS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3428-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Advanced sequencing machines dramatically speed up the generation of genomic data, which makes the demand of efficient compression of sequencing data extremely urgent and significant. As the most difficult part of the standard sequencing data format FASTQ, compression of the quality score has become a conundrum in the development of FASTQ compression. Existing lossless compressors of quality scores mainly utilize specific patterns generated by specific sequencer and complex context modeling techniques to solve the problem of low compression ratio. However, the main drawbacks of these compressors are the problem of weak robustness which means unstable or even unavailable results of sequencing files and the problem of slow compression speed. Meanwhile, some compressors attempt to construct a fine-grained index structure to solve the problem of slow random access decompression speed. However, they solve the problem at the sacrifice of compression speed and at the expense of large index files, which makes them inefficient and impractical. Therefore, an efficient lossless compressor of quality scores with strong robustness, high compression ratio, fast compression and random access decompression speed is urgently needed and of great significance. Results: In this paper, based on the idea of maximizing the use of hardware resources, LCQS, a lossless compression tool specialized for quality scores, was proposed. It consists of four sequential processing steps: Partitioning, indexing, packing and parallelizing. Experimental results reveal that LCQS outperforms all the other state-of-the-art compressors on all criteria except for the compression speed on the dataset SRR1284073. Furthermore, LCQS presents strong robustness on all the test datasets, with its acceleration ratios of compression speed increasing by up to 29.1x, its file size reducing by up to 28.78%, and its random access decompression speed increasing by up to 2.1x. Additionally, LCQS also exhibits strong scalability. That is, the compression speed increases almost linearly as the size of input dataset increases. Conclusion: The ability to handle all different kinds of quality scores and superiority in compression ratio and compression speed make LCQS a high-efficient and advanced lossless quality score compressor, along with its strength of fast random access decompression. Our tool LCQS can be downloaded from https://github.com/SCUT-CCNL/LCQS and freely available for non-commercial usage.",
                "authors": [
                    {
                        "name": "Fu J."
                    },
                    {
                        "name": "Ke B."
                    },
                    {
                        "name": "Dong S."
                    }
                ],
                "date": "2020-03-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LCQS: An efficient lossless compression tool of quality scores with random access functionality"
            },
            "pmcid": "PMC7079445",
            "pmid": "32183707"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}