{"credit":[{"email":"webmaster@ms-utils.org","typeEntity":"Person","typeRoles":["Documentor"],"url":"http://ms-utils.org"},{"email":"xwliu@iupui.edu","name":"Xiaowen Liu","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://proteomics.informatics.iupui.edu/software/toppic/tutorial.html"}],"function":[{"input":[{"data":{"term":"Mass spectrometry spectra","uri":"http://edamontology.org/data_0943"},"format":[{"term":"Mass spectrometry data format","uri":"http://edamontology.org/format_3245"}]},{"data":{"term":"Protein sequence","uri":"http://edamontology.org/data_2976"},"format":[{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]}],"operation":[{"term":"PTM localisation","uri":"http://edamontology.org/operation_3755"},{"term":"PTM identification","uri":"http://edamontology.org/operation_3645"},{"term":"Protein identification","uri":"http://edamontology.org/operation_3767"},{"term":"Peptide identification","uri":"http://edamontology.org/operation_3631"},{"term":"Peptide database search","uri":"http://edamontology.org/operation_3646"},{"term":"Validation of peptide-spectrum matches","uri":"http://edamontology.org/operation_3648"},{"term":"Filtering","uri":"http://edamontology.org/operation_3695"}],"output":[{"data":{"term":"Peptide identification","uri":"http://edamontology.org/data_0945"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"}]},{"data":{"term":"Protein sequence record","uri":"http://edamontology.org/data_2886"},"format":[{"term":"HTML","uri":"http://edamontology.org/format_2331"}]}]}],"labels":{"collectionID":["ms-utils","Proteomics"],"language":["C++"],"license":"Apache-2.0","operatingSystem":["Windows"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"},{"term":"Protein modifications","uri":"http://edamontology.org/topic_0601"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://ms-utils.org"}],"publication":[{"abstract":"In the last two years, because of advances in protein separation and mass spectrometry, top-down mass spectrometry moved from analyzing single proteins to analyzing complex samples and identifying hundreds and even thousands of proteins. However, computational tools for database search of top-down spectra against protein databases are still in their infancy. We describe MS-Align+, a fast algorithm for top-down protein identification based on spectral alignment that enables searches for unexpected post-translational modifications. We also propose a method for evaluating statistical significance of top-down protein identifications and further benchmark various software tools on two top-down data sets from Saccharomyces cerevisiae and Salmonella typhimurium. We demonstrate that MS-Align+ significantly increases the number of identified spectra as compared with MASCOT and OMSSA on both data sets. Although MS-Align+ and ProSightPC have similar performance on the Salmonella typhimurium data set, MS-Align+ outperforms Pro- SightPC on the (more complex) Saccharomyces cerevisiae data set. © 2012 by The American Society for Biochemistry and Molecular Biology, Inc.","authors":["Liu X.","Sirotkin Y.","Shen Y.","Anderson G.","Tsai Y.S.","Ting Y.S.","Goodlett D.R.","Smith R.D.","Bafna V.","Pevzner P.A."],"cit_count":74,"journal":"Molecular and Cellular Proteomics","pmid":"22027200","title":"Protein identification using top-down","year":"2012-06-01"},{"abstract":"Motivation: Tandem mass spectrometry (MS/MS) has been routinely used in proteomics studies. Post-translational modification (PTM) identification is a challenging problem in tandem mass spectral analysis. Results: In this article, we define two scoring functions for identifying peptides/proteins with PTMs from MS/MS spectra: match scores and diagonal scores, as well as two spectral identification problems based on the two scores. We propose several index-based algorithms for the two problems. Both theoretical and experimental analyses show that the index-based algorithms significantly improve on speed when compared with existing algorithms. © The Author 2012. Published by Oxford University Press. All rights reserved.","authors":["Liu X.","Mammana A.","Bafna V."],"cit_count":7,"journal":"Bioinformatics","pmid":"22543365","title":"Speeding up tandem mass spectral identification using indexes","year":"2012-07-01"},{"abstract":"© 2014 Liu et al. Background: In mass spectrometry-based proteomics, the statistical significance of a peptide-spectrum or proteinspectrum match is an important indicator of the correctness of the peptide or protein identification. In bottom-up mass spectrometry, probabilistic models, such as the generating function method, have been successfully applied to compute the statistical significance of peptide-spectrum matches for short peptides containing no posttranslational modifications. As top-down mass spectrometry, which often identifies intact proteins with posttranslational modifications, becomes available in many laboratories, the estimation of statistical significance of topdown protein identification results has come into great demand. Results: In this paper, we study an extended generating function method for accurately computing the statistical significance of protein-spectrum matches with post-translational modifications. Experiments show that the extended generating function method achieves high accuracy in computing spectral probabilities and false discovery rates. Conclusions: The extended generating function method is a non-trivial extension of the generating function method for bottom-up mass spectrometry. It can be used to choose the correct protein-spectrum match from several candidate protein-spectrum matches for a spectrum, as well as separate correct protein-spectrum matches from incorrect ones identified from a large number of tandem mass spectra.","authors":["Liu X.","Segar M.W.","Li S.C.","Kim S."],"cit_count":8,"journal":"BMC Genomics","pmid":"24564718","title":"Spectral probabilities of top-down tandem mass spectra","year":"2014-01-24"}],"summary":{"biotoolsCURIE":"biotools:toppic","biotoolsID":"toppic","description":"Proteoform identification/characterizaion at the proteome level using database search.","homepage":"http://proteomics.informatics.iupui.edu/software/toppic/","name":"TopPIC"}}