{
    "additionDate": "2017-08-03T18:51:42Z",
    "biotoolsCURIE": "biotools:modent",
    "biotoolsID": "modent",
    "credit": [
        {
            "email": "guykarle@post.tau.ac.il",
            "name": "Guy Karlebach",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://tau.ac.il/~guykarle/"
        }
    ],
    "description": "Computational tool that reconstructs gene regulatory networks from high throughput experimental data.",
    "documentation": [
        {
            "type": "General",
            "url": "http://acgt.cs.tau.ac.il/modent/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://acgt.cs.tau.ac.il/modent/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/modent-reconstructing-gene-regulatory-networks.html"
        }
    ],
    "name": "ModEnt",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Models of gene regulatory networks (GRNs) attempt to explain the complex processes that determine cells' behavior, such as differentiation, metabolism, and the cell cycle. The advent of high-throughput data generation technologies has allowed researchers to fit theoretical models to experimental data on gene-expression profiles. GRNs are often represented using logical models. These models require that real-valued measurements be converted to discrete levels, such as on/off, but the discretization often introduces inconsistencies into the data. Dimitrova et al. posed the problem of efficiently finding a parsimonious resolution of the introduced inconsistencies. We show that reconstruction of a logical GRN that minimizes the errors is NP-complete, so that an efficient exact algorithm for the problem is not likely to exist. We present a probabilistic formulation of the problem that circumvents discretization of expression data. We phrase the problem of error reduction as a minimum entropy problem, develop a heuristic algorithm for it, and evaluate its performance on mouse embryonic stem cell data. The constructed model displays high consistency with prior biological knowledge. Despite the oversimplification of a discrete model, we show that it is superior to raw experimental measurements and demonstrates a highly significant level of identical regulatory logic among co-regulated genes. A software implementing the method is freely available at: http://acgt.cs.tau. ac.il/modent. © 2012 Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Karlebach G."
                    },
                    {
                        "name": "Shamir R."
                    }
                ],
                "citationCount": 21,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "Constructing logical models of gene regulatory networks by integrating transcription factor-DNA interactions with expression data: An entropy-based approach"
            },
            "pmid": "22216865"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1
}