{
    "additionDate": "2022-01-17T13:02:38.501764Z",
    "biotoolsCURIE": "biotools:exstra",
    "biotoolsID": "exstra",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "indhu.babu@bcchr.ca",
            "name": "Indhu-Shree Rajan-Babu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "exSTRa is an R package for the detection of repeat expansions with Illumina next-generation sequencing (NGS) data of cases and controls. exSTRa supports both whole-genome and whole-exome sequencing (WGS and WES). Only paired-end data is supported.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bahlolab.github.io/exSTRa/doc/exSTRa.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bahlolab/exSTRa",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-01-17T13:03:17.346653Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/bahlolab/exSTRa/issues"
        }
    ],
    "name": "exSTRa",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13073-021-00932-9",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Screening for short tandem repeat (STR) expansions in next-generation sequencing data can enable diagnosis, optimal clinical management/treatment, and accurate genetic counseling of patients with repeat expansion disorders. We aimed to develop an efficient computational workflow for reliable detection of STR expansions in next-generation sequencing data and demonstrate its clinical utility. Methods: We characterized the performance of eight STR analysis methods (lobSTR, HipSTR, RepeatSeq, ExpansionHunter, TREDPARSE, GangSTR, STRetch, and exSTRa) on next-generation sequencing datasets of samples with known disease-causing full-mutation STR expansions and genomes simulated to harbor repeat expansions at selected loci and optimized their sensitivity. We then used a machine learning decision tree classifier to identify an optimal combination of methods for full-mutation detection. In Burrows-Wheeler Aligner (BWA)-aligned genomes, the ensemble approach of using ExpansionHunter, STRetch, and exSTRa performed the best (precision = 82%, recall = 100%, F1-score = 90%). We applied this pipeline to screen 301 families of children with suspected genetic disorders. Results: We identified 10 individuals with full-mutations in the AR, ATXN1, ATXN8, DMPK, FXN, or HTT disease STR locus in the analyzed families. Additional candidates identified in our analysis include two probands with borderline ATXN2 expansions between the established repeat size range for reduced-penetrance and full-penetrance full-mutation and seven individuals with FMR1 CGG repeats in the intermediate/premutation repeat size range. In 67 probands with a prior negative clinical PCR test for the FMR1, FXN, or DMPK disease STR locus, or the spinocerebellar ataxia disease STR panel, our pipeline did not falsely identify aberrant expansion. We performed clinical PCR tests on seven (out of 10) full-mutation samples identified by our pipeline and confirmed the expansion status in all, showing absolute concordance between our bioinformatics and molecular findings. Conclusions: We have successfully demonstrated the application of a well-optimized bioinformatics pipeline that promotes the utility of genome-wide sequencing as a first-tier screening test to detect expansions of known disease STRs. Interrogating clinical next-generation sequencing data for pathogenic STR expansions using our ensemble pipeline can improve diagnostic yield and enhance clinical outcomes for patients with repeat expansion disorders.",
                "authors": [
                    {
                        "name": "Rajan-Babu I.-S."
                    },
                    {
                        "name": "Peng J.J."
                    },
                    {
                        "name": "Chiu R."
                    },
                    {
                        "name": "Adam S."
                    },
                    {
                        "name": "Souich C.D."
                    },
                    {
                        "name": "Elliott A."
                    },
                    {
                        "name": "Lehman A."
                    },
                    {
                        "name": "Mwenifumbo J."
                    },
                    {
                        "name": "Nelson T."
                    },
                    {
                        "name": "van Karnebeek C."
                    },
                    {
                        "name": "Friedman J."
                    },
                    {
                        "name": "Birch P."
                    },
                    {
                        "name": "Couse M."
                    },
                    {
                        "name": "Guimond C."
                    },
                    {
                        "name": "Mwenifumbo J."
                    },
                    {
                        "name": "van Karnebeek C."
                    },
                    {
                        "name": "Friedman J."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Mohajeri A."
                    },
                    {
                        "name": "Dolzhenko E."
                    },
                    {
                        "name": "Eberle M.A."
                    },
                    {
                        "name": "Birol I."
                    },
                    {
                        "name": "Friedman J.M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Genome-wide sequencing as a first-tier screening test for short tandem repeat expansions"
            },
            "pmcid": "PMC8351082",
            "pmid": "34372915",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}