{
    "additionDate": "2021-01-18T11:21:26Z",
    "biotoolsCURIE": "biotools:palmer",
    "biotoolsID": "palmer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chung.911@osu.edu",
            "name": "Dongjun Chung",
            "orcidid": "https://orcid.org/0000-0002-8072-5671",
            "typeEntity": "Person"
        }
    ],
    "description": "Improving pathway annotation based on the biomedical literature mining with a constrained latent block model.\n\nPALMER: A Constrained Biclustering Algorithm to Improve Pathway Annotation Based on the Biomedical Literature Mining.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://dongjunchung.github.io/palmer/",
    "lastUpdate": "2021-03-15T14:48:25Z",
    "name": "PALMER",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03756-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: In systems biology, it is of great interest to identify previously unreported associations between genes. Recently, biomedical literature has been considered as a valuable resource for this purpose. While classical clustering algorithms have popularly been used to investigate associations among genes, they are not tuned for the literature mining data and are also based on strong assumptions, which are often violated in this type of data. For example, these approaches often assume homogeneity and independence among observations. However, these assumptions are often violated due to both redundancies in functional descriptions and biological functions shared among genes. Latent block models can be alternatives in this case but they also often show suboptimal performances, especially when signals are weak. In addition, they do not allow to utilize valuable prior biological knowledge, such as those available in existing databases. Results: In order to address these limitations, here we propose PALMER, a constrained latent block model that allows to identify indirect relationships among genes based on the biomedical literature mining data. By automatically associating relevant Gene Ontology terms, PALMER facilitates biological interpretation of novel findings without laborious downstream analyses. PALMER also allows researchers to utilize prior biological knowledge about known gene-pathway relationships to guide identification of gene-gene associations. We evaluated PALMER with simulation studies and applications to studies of pathway-modulating genes relevant to cancer signaling pathways, while utilizing biological pathway annotations available in the KEGG database as prior knowledge. Conclusions: We showed that PALMER outperforms traditional latent block models and it provides reliable identification of novel gene-gene associations by utilizing prior biological knowledge, especially when signals are weak in the biomedical literature mining dataset. We believe that PALMER and its relevant user-friendly software will be powerful tools that can be used to improve existing pathway annotations and identify novel pathway-modulating genes.",
                "authors": [
                    {
                        "name": "Chung D."
                    },
                    {
                        "name": "Couch D."
                    },
                    {
                        "name": "Da Silveira W.A."
                    },
                    {
                        "name": "Nam J.H."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "date": "2020-10-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PALMER: Improving pathway annotation based on the biomedical literature mining with a constrained latent block model"
            },
            "pmcid": "PMC7532116",
            "pmid": "33008309"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
