{
    "additionDate": "2017-08-03T18:44:37Z",
    "biotoolsCURIE": "biotools:gppat",
    "biotoolsID": "gppat",
    "credit": [
        {
            "email": "zidingzhang@cau.edu.cn",
            "name": "Ziding Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://protein.cau.edu.cn/zzdlab/"
        }
    ],
    "description": "Web server for comparison of linear gap penalties and profile-based variable gap penalties in profile-profile alignments",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://protein.cau.edu.cn/gppat/about.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence profile alignment",
                    "uri": "http://edamontology.org/operation_0300"
                }
            ]
        }
    ],
    "homepage": "http://protein.cau.edu.cn/gppat/",
    "homepage_status": 1,
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gppat-gapped-profile-profile-alignment-tool.html"
        }
    ],
    "name": "GPPAT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Profile-profile alignment algorithms have proven powerful for recognizing remote homologs and generating alignments by effectively integrating sequence evolutionary information into scoring functions. In comparison to scoring function, the development of gap penalty functions has rarely been addressed in profile-profile alignment algorithms. Although indel frequency profiles have been used to construct profile-based variable gap penalties in some profile-profile alignment algorithms, there is still no fair comparison between variable gap penalties and traditional linear gap penalties to quantify the improvement of alignment accuracy. We compared two linear gap penalty functions, the traditional affine gap penalty (AGP) and the bilinear gap penalty (BGP), with two profile-based variable gap penalty functions, the Profile-based Gap Penalty used in SP 5 (SPGP) and a new Weighted Profile-based Gap Penalty (WPGP) developed by us, on some well-established benchmark datasets. Our results show that profile-based variable gap penalties get limited improvements than linear gap penalties, whether incorporated with secondary structure information or not. Secondary structure information appears less powerful to be incorporated into gap penalties than into scoring functions. Analysis of gap length distributions indicates that gap penalties could stably maintain corresponding distributions of gap lengths in their alignments, but the distribution difference from reference alignments does not reflect the performance of gap penalties. There is useful information in indel frequency profiles, but it is still not good enough for improving alignment accuracy when used in profile-based variable gap penalties. All of the methods tested in this work are freely accessible at http://protein.cau.edu.cn/gppat/. © 2011 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Yan R.-X."
                    },
                    {
                        "name": "Wang X.-F."
                    },
                    {
                        "name": "Si J.-N."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 5,
                "date": "2011-10-12T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "Comparison of linear gap penalties and profile-based variable gap penalties in profile-profile alignments"
            },
            "pmid": "22000802"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}