{
    "additionDate": "2017-02-10T11:33:57Z",
    "biotoolsCURIE": "biotools:pseudoviewer",
    "biotoolsID": "pseudoviewer",
    "credit": [
        {
            "email": "khan@inha.ac.kr",
            "name": "PseudoViewer3 Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PSEUDOVIEWER is a tool for visualizing RNA pseudoknot structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pseudoviewer.inha.ac.kr/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2439"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Structured RNA prediction and optimisation",
                    "uri": "http://edamontology.org/operation_0483"
                }
            ]
        }
    ],
    "homepage": "http://pseudoviewer.inha.ac.kr/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "PSEUDOVIEWER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "MOTIVATION: Several algorithms have been developed for drawing RNA secondary structures, however none of these can be used to draw RNA pseudoknot structures. In the sense of graph theory, a drawing of RNA secondary structures is a tree, whereas a drawing of RNA pseudoknots is a graph with inner cycles within a pseudoknot as well as possible outer cycles formed between a pseudoknot and other structural elements. Thus, RNA pseudoknots are more difficult to visualize than RNA secondary structures. Since no automatic method for drawing RNA pseudoknots exists, visualizing RNA pseudoknots relies on significant amount of manual work and does not yield satisfactory results. The task of visualizing RNA pseudoknots by hand becomes more challenging as the size and complexity of the RNA pseudoknots increase. RESULTS: We have developed a new representation and an algorithm for drawing H-type pseudoknots with RNA secondary structures. Compared to existing representations of H-type pseudoknots, the new representation ensures uniform and clear drawings with no edge crossing for any H-type pseudoknots. To the best of our knowledge, this is the first algorithm for automatically drawing RNA pseudoknots with RNA secondary structures. The algorithm has been implemented in a Java program, which can be executed on any computing system. Experimental results demonstrate that the algorithm generates an aesthetically pleasing drawing of all H-type pseudoknots. The results have also shown that the drawing has high readability, enabling the user to quickly and easily recognize the whole RNA structure as well as the pseudoknots themselves.",
                "authors": [
                    {
                        "name": "Han K."
                    },
                    {
                        "name": "Kim W."
                    },
                    {
                        "name": "Lee Y."
                    }
                ],
                "citationCount": 26,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "PseudoViewer: automatic visualization of RNA pseudoknots."
            },
            "pmid": "12169562"
        },
        {
            "metadata": {
                "abstract": "Motivation: Pseudoknots in RNA structures make visualization of RNA structures difficult. Even if a pseudoknot itself is represented without a crossing, visualization of the entire RNA structure with a pseudoknot often results in a drawing with crossings between the pseudoknot and other structural elements, and requires additional intervention by the user to ensure that the structure graph is overlap-free. Many programs such as web services prefer to obtain an overlap-free graph in one-shot rather than get a graph with overlaps to be edited. There are few programs for visualizing RNA pseudoknots, and PseudoViewer has been the almost only program that automatically draws RNA secondary structures with pseudoknots. The previous version of PseudoViewer visualizes all the known types of RNA pseudoknots as planar drawings, but visualizes some hypothetical pseudoknots as non-planar drawings. Results: We developed a new version of PseudoViewer for efficiently visualizing large RNA structures with any types of pseudoknots, both known and hypothetical, as planar drawings in one-shot. It is about 10 times faster than the previous algorithm, and produces a more compact and aesthetic structure drawing. PseudoViewer3 supports both web services and web applications. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Byun Y."
                    },
                    {
                        "name": "Han K."
                    }
                ],
                "citationCount": 99,
                "date": "2009-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PseudoViewer3: Generating planar drawings of large-scale RNA structures with pseudoknots"
            },
            "pmid": "19369500"
        },
        {
            "metadata": {
                "abstract": "Visualizing RNA pseudoknot structures is computationally more difficult than depicting RNA secondary structures, because a drawing of a pseudoknot structure is a graph (and possibly a nonplanar graph) with inner cycles within the pseudoknot, and possibly outer cycles formed between the pseudoknot and other structural elements. We previously developed PseudoViewer for visualizing H-type pseudoknots. PseudoViewer2 improves on the first version in many ways: (i) PseudoViewer2 is more general because it can visualize a pseudoknot of any type, including H-type pseudoknots, as a planar graph; (ii) PseudoViewer2 computes a drawing of RNA structures much more efficiently and is an order of magnitude faster in actual running time; and (iii) PseudoViewer2 is a web-based application program. Experimental results demonstrate that PseudoViewer2 generates an aesthetically pleasing drawing of pseudoknots of any type and that the new representation offered by PseudoViewer2 ensures uniform and clear drawings, with no edge crossing, for all types of pseudoknots. The PseudoViewer2 algorithm is the first developed for the automatic drawing of RNA secondary structures, including pseudoknots of any type. PseudoViewer2 is accessible at http://wilab.inha.ac.kr/pseudoviewer2/.",
                "authors": [
                    {
                        "name": "Byun Y."
                    },
                    {
                        "name": "Han K."
                    }
                ],
                "citationCount": 57,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PSEUDOVIEWER2: Visualization of RNA pseudoknots of any type"
            },
            "pmid": "12824341"
        },
        {
            "metadata": {
                "abstract": "Visualizing RNA secondary structures and pseudoknot structures is essential to bioinformatics systems that deal with RNA structures. However, many bioinformatics systems use heterogeneous data structures and incompatible software components, so integration of software components (including a visualization component) into a system can be hindered by incompatibilities between the components of the system. This paper presents an XML web service and web application program for visualizing RNA secondary structures with pseudoknots. Experimental results show that the PseudoViewer web service and web application are useful for resolving many problems with incompatible software components as well as for visualizing large-scale RNA secondary-structures with pseudoknots of any type. The web service and web application are available at http://pseudoviewer.inha.ac.kr/. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Byun Y."
                    },
                    {
                        "name": "Han K."
                    }
                ],
                "citationCount": 66,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PseudoViewer: Web application and web service for visualizing RNA pseudoknots and secondary structures"
            },
            "pmid": "16845039"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
