{
    "additionDate": "2017-08-03T18:51:19Z",
    "biotoolsCURIE": "biotools:methylextract",
    "biotoolsID": "methylextract",
    "credit": [
        {
            "email": "bartg01@gmail.com",
            "name": "Guillermo Barturen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "oliver@ugr.es",
            "name": "José L. Oliver",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "rlebron@ugr.es",
            "name": "Ricardo Lebrón",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "mlhack@gmail.com",
            "name": "Michael Hackenberg",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo2.ugr.es/bioinfoUGR"
        }
    ],
    "description": "User friendly tool to generate i) high quality, whole genome methylation maps and ii) to detect sequence variation within the same sample preparation.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinfo2.ugr.es/MethylExtract/downloads/ManualMethylExtract.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo2.ugr.es/MethylExtract/",
    "lastUpdate": "2024-11-24T20:29:21.411387Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/methylextract-1-3-methylation-maps-snv-calling-genome-bisulfite-sequencing-data.html"
        }
    ],
    "name": "MethylExtract",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_005446"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.12688/f1000research.2-217.v2",
            "metadata": {
                "abstract": "Whole genome methylation profiling at a single cytosine resolution is now feasible due to the advent of high-throughput sequencing techniques together with bisulfite treatment of the DNA. To obtain the methylation value of each individual cytosine, the bisulfite-treated sequence reads are first aligned to a reference genome, and then the profiling of the methylation levels is done from the alignments. A huge effort has been made to quickly and correctly align the reads and many different algorithms and programs to do this have been created. However, the second step is just as crucial and non-trivial, but much less attention has been paid to the final inference of the methylation states. Important error sources do exist, such as sequencing errors, bisulfite failure, clonal reads, and single nucleotide variants. We developed MethylExtract, a user friendly tool to: i) generate high quality, whole genome methylation maps and ii) detect sequence variation within the same sample preparation. The program is implemented into a single script and takes into account all major error sources. MethylExtract detects variation (SNVs - Single Nucleotide Variants) in a similar way to VarScan, a very sensitive method extensively used in SNV and genotype calling based on non-bisulfite-treated reads. The usefulness of MethylExtract is shown by means of extensive benchmarking based on artificial bisulfite-treated reads and a comparison to a recently published method, called Bis-SNP. MethylExtract is able to detect SNVs within High-Throughput Sequencing experiments of bisulfite treated DNA at the same time as it generates high quality methylation maps. This simultaneous detection of DNA methylation and sequence variation is crucial for many downstream analyses, for example when deciphering the impact of SNVs on differential methylation. An exclusive feature of MethylExtract, in comparison with existing software, is the possibility to assess the bisulfite failure in a statistical way. The source code, tutorial and artificial bisulfite datasets are available at http://bioinfo2.ugr.es/MethylExtract/ and http://sourceforge.net/projects/methylextract/, and also permanently accessible from 10.5281/zenodo.7144.",
                "authors": [
                    {
                        "name": "Barturen G."
                    },
                    {
                        "name": "Hackenberg M."
                    },
                    {
                        "name": "Oliver J.L."
                    },
                    {
                        "name": "Rueda A."
                    }
                ],
                "citationCount": 32,
                "date": "2014-02-21T00:00:00Z",
                "journal": "F1000Research",
                "title": "MethylExtract: High-Quality methylation maps and SNV calling from whole genome bisulfite sequencing data"
            },
            "pmcid": "PMC3938178",
            "pmid": "24627790"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
