{
    "additionDate": "2018-07-04T14:18:39Z",
    "biotoolsCURIE": "biotools:cavityplus",
    "biotoolsID": "cavityplus",
    "credit": [
        {
            "email": "BioinfoF@cqb.pku.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jfpei@pku.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Protein cavity detection and various functional analyses. Using protein three-dimensional structural information as the input, CavityPlus applies CAVITY to detect potential binding sites on the surface of a given protein structure and rank them based on ligandability and druggability scores. These potential binding sites can be further analysed using three submodules, CavPharmer, CorrSite, and CovCys.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://162.105.160.28:2017/cavityplus/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface analysis",
                    "uri": "http://edamontology.org/operation_3351"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://repharma.pku.edu.cn/cavityplus",
    "lastUpdate": "2024-11-24T14:20:10.141773Z",
    "name": "CavityPlus",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky380",
            "metadata": {
                "abstract": "CavityPlus is a web server that offers protein cavity detection and various functional analyses. Using protein three-dimensional structural information as the input, CavityPlus applies CAVITY to detect potential binding sites on the surface of a given protein structure and rank them based on ligandability and druggability scores. These potential binding sites can be further analysed using three submodules, CavPharmer, CorrSite, and CovCys. CavPharmer uses a receptor-based pharmacophore modelling program, Pocket, to automatically extract pharmacophore features within cavities. CorrSite identifies potential allosteric ligand-binding sites based on motion correlation analyses between cavities. CovCys automatically detects druggable cysteine residues, which is especially useful to identify novel binding sites for designing covalent allosteric ligands. Overall, CavityPlus provides an integrated platform for analysing comprehensive properties of protein binding cavities. Such analyses are useful for many aspects of drug design and discovery, including target selection and identification, virtual screening, de novo drug design, and allosteric and covalent-binding drug design. The CavityPlus web server is freely available at http://repharma.pku.edu.cn/cavityplus or http://www.pkumdl.cn/cavityplus.",
                "authors": [
                    {
                        "name": "Chen F."
                    },
                    {
                        "name": "Gao S."
                    },
                    {
                        "name": "Hu Q."
                    },
                    {
                        "name": "Lai L."
                    },
                    {
                        "name": "Ma X."
                    },
                    {
                        "name": "Pei J."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 237,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CavityPlus: A web server for protein cavity detection with pharmacophore modelling, allosteric site identification and covalent ligand binding ability prediction"
            },
            "pmcid": "PMC6031032",
            "pmid": "29750256",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1016/j.jmb.2023.168141",
            "metadata": {
                "abstract": "Ligand binding sites provide essential information for uncovering protein functions and structure-based drug discovery. To facilitate cavity detection and property analysis process, we developed a comprehensive web server, CavityPlus in 2018. CavityPlus applies the CAVITY program to detect potential binding sites in a given protein structure. The CavPharmer, CorrSite, and CovCys tools can then be applied to generate receptor-based pharmacophore models, identify potential allosteric sites, or detect druggable cysteine residues for covalent drug design. While CavityPlus has been widely used, the constantly evolving knowledge and methods make it necessary to improve and extend its functions. This study presents a new version of CavityPlus, CavityPlus 2022 through a series of upgrades. We upgraded the CAVITY tool to greatly speed up cavity detection calculation. We optimized the CavPharmer tool for fast speed and more accurate results. We integrated the newly developed CorrSite2.0 into the CavityPlus 2022 web server for its improved performance of allosteric site prediction. We also added a new CavityMatch module for drug repurposing and protein function studies by searching similar cavities to a given cavity from pre-constructed cavity databases. The new version of CavityPlus is freely available at http://pkumdl.cn:8000/cavityplus/.",
                "authors": [
                    {
                        "name": "Lai L."
                    },
                    {
                        "name": "Pei J."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Xie J."
                    }
                ],
                "citationCount": 31,
                "date": "2023-07-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "CavityPlus 2022 Update: An Integrated Platform for Comprehensive Protein Cavity Detection and Property Analyses with User-friendly Tools and Cavity Databases"
            },
            "pmid": "37356903"
        }
    ],
    "toolType": [
        "Suite",
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
