{
    "additionDate": "2021-10-04T06:02:13.492473Z",
    "biotoolsCURIE": "biotools:irgo",
    "biotoolsID": "irgo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Mohieddin.jafari@helsinki.fi",
            "name": "Mohieddin Jafari",
            "orcidid": "https://orcid.org/0000-0002-6991-8587",
            "typeEntity": "Person"
        }
    ],
    "description": "Iranian traditional medicine General Ontology (IrGO) and knowledge base. Iranian traditional medicine (also called Persian Medicine), is an elaborate holistic system of healing grounded in a philosophical basis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://ir-go.net/user-manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://ir-go.net/",
    "lastUpdate": "2021-10-04T06:02:13.495149Z",
    "name": "IrGO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13326-021-00237-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Iranian traditional medicine, also known as Persian Medicine, is a holistic school of medicine with a long prolific history. It describes numerous concepts and the relationships between them. However, no unified language system has been proposed for the concepts of this medicine up to the present time. Considering the extensive terminology in the numerous textbooks written by the scholars over centuries, comprehending the totality of concepts is obviously a very challenging task. To resolve this issue, overcome the obstacles, and code the concepts in a reusable manner, constructing an ontology of the concepts of Iranian traditional medicine seems a necessity. Construction and content: Makhzan al-Advieh, an encyclopedia of materia medica compiled by Mohammad Hossein Aghili Khorasani, was selected as the resource to create an ontology of the concepts used to describe medicinal substances. The steps followed to accomplish this task included (1) compiling the list of classes via examination of textbooks, and text mining the resource followed by manual review to ensure comprehensiveness of extracted terms; (2) arranging the classes in a taxonomy; (3) determining object and data properties; (4) specifying annotation properties including ID, labels (English and Persian), alternative terms, and definitions (English and Persian); (5) ontology evaluation. The ontology was created using Protégé with adherence to the principles of ontology development provided by the Open Biological and Biomedical Ontology (OBO) foundry. Utility and discussion: The ontology was finalized with inclusion of 3521 classes, 15 properties, and 20,903 axioms in the Iranian traditional medicine General Ontology (IrGO) database, freely available at http://ir-go.net/. An indented list and an interactive graph view using WebVOWL were used to visualize the ontology. All classes were linked to their instances in UNaProd database to create a knowledge base of ITM materia medica. Conclusion: We constructed an ontology-based knowledge base of ITM concepts in the domain of materia medica to help offer a shared and common understanding of this concept, enable reuse of the knowledge, and make the assumptions explicit. This ontology will aid Persian medicine practitioners in clinical decision-making to select drugs. Extending IrGO will bridge the gap between traditional and conventional schools of medicine, helping guide future research in the process of drug discovery.",
                "authors": [
                    {
                        "name": "Naghizadeh A."
                    },
                    {
                        "name": "Salamat M."
                    },
                    {
                        "name": "Hamzeian D."
                    },
                    {
                        "name": "Akbari S."
                    },
                    {
                        "name": "Rezaeizadeh H."
                    },
                    {
                        "name": "Vaghasloo M.A."
                    },
                    {
                        "name": "Karbalaei R."
                    },
                    {
                        "name": "Mirzaie M."
                    },
                    {
                        "name": "Karimi M."
                    },
                    {
                        "name": "Jafari M."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Journal of Biomedical Semantics",
                "title": "IrGO: Iranian traditional medicine General Ontology and knowledge base"
            },
            "pmcid": "PMC8052758",
            "pmid": "33863373"
        }
    ],
    "toolType": [
        "Ontology",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Complementary medicine",
            "uri": "http://edamontology.org/topic_3423"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Systems medicine",
            "uri": "http://edamontology.org/topic_3396"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        }
    ]
}