{
    "additionDate": "2022-08-15T10:31:53.188327Z",
    "biotoolsCURIE": "biotools:d2-net",
    "biotoolsID": "d2-net",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Qiushi YangQiushi Yang"
        },
        {
            "name": "Yixuan Yuan"
        }
    ],
    "description": "Dual Disentanglement Network (D2-Net) for brain tumor segmentation with missing modalities, which consists of a modality disentanglement stage (MD-Stage) and a tumor-region disentanglement stage (TDStage).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CityU-AIM-Group/D2Net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:49:38.695160Z",
    "license": "Apache-2.0",
    "name": "D2-Net",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/tmi.2022.3175478",
            "metadata": {
                "abstract": "Multi-modal Magnetic Resonance Imaging (MRI) can provide complementary information for automatic brain tumor segmentation, which is crucial for diagnosis and prognosis. While missing modality data is common in clinical practice and it can result in the collapse of most previous methods relying on complete modality data. Current state-of-the-art approaches cope with the situations of missing modalities by fusing multi-modal images and features to learn shared representations of tumor regions, which often ignore explicitly capturing the correlations among modalities and tumor regions. Inspired by the fact that modality information plays distinct roles to segment different tumor regions, we aim to explicitly exploit the correlations among various modality-specific information and tumor-specific knowledge for segmentation. To this end, we propose a Dual Disentanglement Network (D2-Net) for brain tumor segmentation with missing modalities, which consists of a modality disentanglement stage (MD-Stage) and a tumor-region disentanglement stage (TD-Stage). In the MD-Stage, a spatial-frequency joint modality contrastive learning scheme is designed to directly decouple the modality-specific information from MRI data. To decompose tumor-specific representations and extract discriminative holistic features, we propose an affinity-guided dense tumor-region knowledge distillation mechanism in the TD-Stage through aligning the features of a disentangled binary teacher network with a holistic student network. By explicitly discovering relations among modalities and tumor regions, our model can learn sufficient information for segmentation even if some modalities are missing. Extensive experiments on the public BraTS-2018 database demonstrate the superiority of our framework over state-of-the-art methods in missing modalities situations. Codes are available at https://github.com/CityU-AIM-Group/D2Net.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Woo P.Y.M."
                    },
                    {
                        "name": "Yang Q."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "citationCount": 51,
                "date": "2022-10-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "D2-Net: Dual Disentanglement Network for Brain Tumor Segmentation With Missing Modalities"
            },
            "pmid": "35576425"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}
