{
    "additionDate": "2020-01-09T17:48:57Z",
    "biotoolsCURIE": "biotools:GenGraph",
    "biotoolsID": "GenGraph",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Jon.Ambler@uct.ac.za",
            "name": "Jon Mitchell Ambler",
            "orcidid": "https://orcid.org/0000-0001-7583-0963",
            "typeEntity": "Person"
        }
    ],
    "description": "a python module for the simple generation and manipulation of genome graphs.\n\nA repository for the GenGraph toolkit for the creation and manipulation of graph genomes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jambler24/GenGraph",
    "language": [
        "R",
        "Java",
        "Python"
    ],
    "lastUpdate": "2020-12-03T08:10:08Z",
    "license": "GPL-3.0",
    "name": "GenGraph",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3115-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: As sequencing technology improves, the concept of a single reference genome is becoming increasingly restricting. In the case of Mycobacterium tuberculosis, one must often choose between using a genome that is closely related to the isolate, or one that is annotated in detail. One promising solution to this problem is through the graph based representation of collections of genomes as a single genome graph. Though there are currently a handful of tools that can create genome graphs and have demonstrated the advantages of this new paradigm, there still exists a need for flexible tools that can be used by researchers to overcome challenges in genomics studies. Results: We present GenGraph, a Python toolkit and accompanying modules that use existing multiple sequence alignment tools to create genome graphs. Python is one of the most popular coding languages for the biological sciences, and by providing these tools, GenGraph makes it easier to experiment and develop new tools that utilise genome graphs. The conceptual model used is highly intuitive, and as much as possible the graph structure represents the biological relationship between the genomes. This design means that users will quickly be able to start creating genome graphs and using them in their own projects. We outline the methods used in the generation of the graphs, and give some examples of how the created graphs may be used. GenGraph utilises existing file formats and methods in the generation of these graphs, allowing graphs to be visualised and imported with widely used applications, including Cytoscape, R, and Java Script. Conclusions: GenGraph provides a set of tools for generating graph based representations of sets of sequences with a simple conceptual model, written in the widely used coding language Python, and publicly available on Github.",
                "authors": [
                    {
                        "name": "Ambler J.M."
                    },
                    {
                        "name": "Mulaudzi S."
                    },
                    {
                        "name": "Mulder N."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GenGraph: A python module for the simple generation and manipulation of genome graphs"
            },
            "pmcid": "PMC6894214",
            "pmid": "31653197"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}