{
    "additionDate": "2017-08-03T18:38:03Z",
    "biotoolsCURIE": "biotools:camur",
    "biotoolsID": "camur",
    "credit": [
        {
            "email": "paola.bertolazzi@iasi.cnr.it",
            "name": "Paola Bertolazzi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dmb.iasi.cnr.it/about_us.php"
        }
    ],
    "description": "New method and software package able to extract multiple, alternative, and equivalent classification models.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://dmb.iasi.cnr.it/Downloads/CAMUR/Camur_User_Guide.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "http://dmb.iasi.cnr.it/camur.php",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/camur-classifier-with-alternative-and-multiple-rule-based-models.html"
        }
    ],
    "name": "CAMUR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. Motivation: Nowadays, knowledge extraction methods from Next Generation Sequencing data are highly requested. In this work, we focus on RNA-seq gene expression analysis and specifically on case-control studies with rule-based supervised classification algorithms that build a model able to discriminate cases from controls. State of the art algorithms compute a single classification model that contains few features (genes). On the contrary, our goal is to elicit a higher amount of knowledge by computing many classification models, and therefore to identify most of the genes related to the predicted class. Results: We propose CAMUR, a new method that extracts multiple and equivalent classification models. CAMUR iteratively computes a rule-based classification model, calculates the power set of the genes present in the rules, iteratively eliminates those combinations from the data set, and performs again the classification procedure until a stopping criterion is verified. CAMUR includes an ad-hoc knowledge repository (database) and a querying tool. We analyze three different types of RNA-seq data sets (Breast, Head and Neck, and Stomach Cancer) from The Cancer Genome Atlas (TCGA) and we validate CAMUR and its models also on non-TCGA data. Our experimental results show the efficacy of CAMUR: we obtain several reliable equivalent classification models, from which the most frequent genes, their relationships, and the relation with a particular cancer are deduced.",
                "authors": [
                    {
                        "name": "Cestarelli V."
                    },
                    {
                        "name": "Fiscon G."
                    },
                    {
                        "name": "Felici G."
                    },
                    {
                        "name": "Bertolazzi P."
                    },
                    {
                        "name": "Weitschek E."
                    }
                ],
                "citationCount": 17,
                "date": "2016-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CAMUR: Knowledge extraction from RNA-seq cancer data through equivalent classification rules"
            },
            "pmid": "26519501"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}