{
    "additionDate": "2020-01-14T20:11:21Z",
    "biotoolsCURIE": "biotools:MHPCI",
    "biotoolsID": "MHPCI",
    "confidence_flag": "low",
    "description": "Development and validation of the mental health professional culture inventory.\n\nAIMS:No instrument has been developed to explicitly assess the professional culture of mental health workers interacting with severely mentally ill people in publicly or privately run mental health care services. Because of theoretical and methodological concerns, we designed a self-administered questionnaire to assess the professional culture of mental health services workers. The study aims to validate this tool, named the Mental Health Professional Culture Inventory (MHPCI). The MHPCI adopts the notion of 'professional culture' as a hybrid construct between the individual and the organisational level that could be directly associated with the professional practices of mental health workers.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31839026",
    "lastUpdate": "2020-01-14T20:11:21Z",
    "name": "MHPCI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1017/S2045796019000787",
            "metadata": {
                "abstract": "Copyright © The Author(s) 2019.No instrument has been developed to explicitly assess the professional culture of mental health workers interacting with severely mentally ill people in publicly or privately run mental health care services. Because of theoretical and methodological concerns, we designed a self-administered questionnaire to assess the professional culture of mental health services workers. The study aims to validate this tool, named the Mental Health Professional Culture Inventory (MHPCI). The MHPCI adopts the notion of 'professional culture' as a hybrid construct between the individual and the organisational level that could be directly associated with the professional practices of mental health workers.Methods The MHPCI takes into consideration a multidimensional definition of professional culture and a discrete number of psychometrically derived dimensions related to meaningful professional behaviour. The questionnaire was created and developed by a conjoint Italian-Canadian research team with the purpose of obtaining a fully cross-cultural questionnaire and was pretested in a pilot study. Subsequently, a validation survey was conducted in northern Italy and in Canada (Montreal area, Quebec). Data analysis was conducted in different steps designed to maximise the cross-cultural adaptation of the questionnaire through a recursive procedure consisting of performing a principal component analysis (PCA) on the Italian sample (N = 221) and then testing the resulting factorial model on the Canadian sample (N = 237). Reliability was also assessed with a test-retest design.Results Four dimensions emerged in the PCA and were verified in the confirmatory factor analysis: family involvement, users' sexuality, therapeutic framework and management of aggression risk. All the scales displayed good internal consistency and reliability.Conclusions This study suggests the MHPCI could be a valid and reliable instrument to measure the professional behaviour of mental health services workers. The content of the four scales is consistent with the literature on psychosocial rehabilitation, suggesting that the instrument could be used to evaluate staff behaviour regarding four crucial dimensions of mental health care.",
                "authors": [
                    {
                        "name": "Rapisarda F."
                    },
                    {
                        "name": "Corbiere M."
                    },
                    {
                        "name": "Lesage A.D."
                    },
                    {
                        "name": "De Benedictis L."
                    },
                    {
                        "name": "Pelletier J.F."
                    },
                    {
                        "name": "Felx A."
                    },
                    {
                        "name": "Leblanc Y."
                    },
                    {
                        "name": "Vallarino M."
                    },
                    {
                        "name": "Miglioretti M."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Epidemiology and Psychiatric Sciences",
                "title": "Development and validation of the mental health professional culture inventory"
            },
            "pmid": "31839026"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        }
    ]
}