{
    "additionDate": "2015-05-04T12:30:57Z",
    "biotoolsCURIE": "biotools:snptree",
    "biotoolsID": "snptree",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.dtu.dk/english/Service/Contact"
        }
    ],
    "description": "SNPs phylogenetic tree from assembled genomes or sets of reads.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cge.cbs.dtu.dk//services/snpTree/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA-like",
                            "uri": "http://edamontology.org/format_2546"
                        },
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Phylogenetic tree construction from assembled genomes or sets of reads",
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "Phylogenetic tree format",
                            "uri": "http://edamontology.org/format_2006"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://cge.cbs.dtu.dk/services/snpTree/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://cbs.dtu.dk/services"
        }
    ],
    "maturity": "Emerging",
    "name": "snpTree",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1186/1471-2164-13-S7-S6",
            "metadata": {
                "abstract": "The advances and decreasing economical cost of whole genome sequencing (WGS), will soon make this technology available for routine infectious disease epidemiology. In epidemiological studies, outbreak isolates have very little diversity and require extensive genomic analysis to differentiate and classify isolates. One of the successfully and broadly used methods is analysis of single nucletide polymorphisms (SNPs). Currently, there are different tools and methods to identify SNPs including various options and cut-off values. Furthermore, all current methods require bioinformatic skills. Thus, we lack a standard and simple automatic tool to determine SNPs and construct phylogenetic tree from WGS data. Here we introduce snpTree, a server for online-automatic SNPs analysis. This tool is composed of different SNPs analysis suites, perl and python scripts. snpTree can identify SNPs and construct phylogenetic trees from WGS as well as from assembled genomes or contigs. WGS data in fastq format are aligned to reference genomes by BWA while contigs in fasta format are processed by Nucmer. SNPs are concatenated based on position on reference genome and a tree is constructed from concatenated SNPs using FastTree and a perl script. The online server was implemented by HTML, Java and python script.The server was evaluated using four published bacterial WGS data sets (V. cholerae, S. aureus CC398, S. Typhimurium and M. tuberculosis). The evaluation results for the first three cases was consistent and concordant for both raw reads and assembled genomes. In the latter case the original publication involved extensive filtering of SNPs, which could not be repeated using snpTree. The snpTree server is an easy to use option for rapid standardised and automatic SNP analysis in epidemiological studies also for users with limited bioinformatic experience. The web server is freely accessible at http://www.cbs.dtu.dk/services/snpTree-1.0/.",
                "authors": [
                    {
                        "name": "Leekitcharoenphon P."
                    },
                    {
                        "name": "Kaas R.S."
                    },
                    {
                        "name": "Thomsen M.C."
                    },
                    {
                        "name": "Friis C."
                    },
                    {
                        "name": "Rasmussen S."
                    },
                    {
                        "name": "Aarestrup F.M."
                    }
                ],
                "citationCount": 64,
                "date": "2012-01-01T00:00:00Z",
                "journal": "BMC genomics",
                "title": "snpTree--a web-server to identify and construct SNP trees from whole genome sequence data."
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}