{
    "additionDate": "2018-04-22T11:40:13Z",
    "biotoolsCURIE": "biotools:icover",
    "biotoolsID": "icover",
    "credit": [
        {
            "email": "magdalena.calusinska@list.lu",
            "name": "Magdalena Calusinska",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Interactive Contig-bin Verification and Refinement tool, which allows the visualization of genome bins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://git.list.lu/eScience/ICoVeR/wikis/home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sample visualisation",
                    "uri": "http://edamontology.org/operation_3744"
                }
            ]
        }
    ],
    "homepage": "https://git.list.lu/eScience/ICoVeR",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "ICoVeR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1653-5",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Recent advances in high-throughput sequencing allow for much deeper exploitation of natural and engineered microbial communities, and to unravel so-called \"microbial dark matter\" (microbes that until now have evaded cultivation). Metagenomic analyses result in a large number of genomic fragments (contigs) that need to be grouped (binned) in order to reconstruct draft microbial genomes. While several contig binning algorithms have been developed in the past 2 years, they often lack consensus. Furthermore, these software tools typically lack a provision for the visualization of data and bin characteristics. Results: We present ICoVeR, the Interactive Contig-bin Verification and Refinement tool, which allows the visualization of genome bins. More specifically, ICoVeR allows curation of bin assignments based on multiple binning algorithms. Its visualization window is composed of two connected and interactive main views, including a parallel coordinates view and a dimensionality reduction plot. To demonstrate ICoVeR's utility, we used it to refine disparate genome bins automatically generated using MetaBAT, CONCOCT and MyCC for an anaerobic digestion metagenomic (AD microbiome) dataset. Out of 31 refined genome bins, 23 were characterized with higher completeness and lower contamination in comparison to their respective, automatically generated, genome bins. Additionally, to benchmark ICoVeR against a previously validated dataset, we used Sharon's dataset representing an infant gut metagenome. Conclusions: ICoVeR is an open source software package that allows curation of disparate genome bins generated with automatic binning algorithms. It is freely available under the GPLv3 license at https://git.list.lu/eScience/ICoVeR. The data management and analytical functions of ICoVeR are implemented in R, therefore the software can be easily installed on any system for which R is available. Installation and usage guide together with the example files ready to be visualized are also provided via the project wiki. ICoVeR running instance preloaded with AD microbiome and Sharon's datasets can be accessed via the website.",
                "authors": [
                    {
                        "name": "Broeksema B."
                    },
                    {
                        "name": "Calusinska M."
                    },
                    {
                        "name": "McGee F."
                    },
                    {
                        "name": "Winter K."
                    },
                    {
                        "name": "Bongiovanni F."
                    },
                    {
                        "name": "Goux X."
                    },
                    {
                        "name": "Wilmes P."
                    },
                    {
                        "name": "Delfosse P."
                    },
                    {
                        "name": "Ghoniem M."
                    }
                ],
                "citationCount": 8,
                "date": "2017-05-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ICoVeR - an interactive visualization tool for verification and refinement of metagenomic bins"
            },
            "pmcid": "PMC5414344",
            "pmid": "28464793"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}