{
    "additionDate": "2017-12-18T00:04:49Z",
    "biotoolsCURIE": "biotools:contrafold",
    "biotoolsID": "contrafold",
    "credit": [
        {
            "email": "chuongdo@cs.stanford.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A novel secondary structure prediction method based on conditional log-linear models, a flexible class of probabilistic models which generalize upon SCFGs by using discriminative training and feature-rich scoring. The result closes the gap between probabilistic and thermodynamic models, demonstrating that statistical learning procedures provide an effective alternative to empirical measurement of thermodynamic parameters for RNA secondary structure prediction.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://contra.stanford.edu/contrafold/raf_manual_v1_00.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structure prediction",
                    "uri": "http://edamontology.org/operation_0271"
                }
            ]
        }
    ],
    "homepage": "http://contra.stanford.edu/contrafold/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-25T14:36:06.991651Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/contrafold-2-02-rna-secondary-structure-prediction.html"
        }
    ],
    "name": "CONTRAfold",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btn177",
            "metadata": {
                "abstract": "Motivation: The need for accurate and efficient tools for computational RNA structure analysis has become increasingly apparent over the last several years: RNA folding algorithms underlie numerous applications in bioinformatics, ranging from microarray probe selection to de novo non-coding RNA gene prediction. In this work, we present RAF (RNA Alignment and Folding), an efficient algorithm for simultaneous alignment and consensus folding of unaligned RNA sequences. Algorithmically, RAF exploits sparsity in the set of likely pairing and alignment candidates for each nucleotide (as identified by the CONTRAfold or CONTRAlign programs) to achieve an effectively quadratic running time for simultaneous pairwise alignment and folding. RAF's fast sparse dynamic programming, in turn, serves as the inference engine within a discriminative machine learning algorithm for parameter estimation. Results: In cross-validated benchmark tests, RAF achieves accuracies equaling or surpassing the current best approaches for RNA multiple sequence secondary structure prediction. However, RAF requires nearly an order of magnitude less time than other simultaneous folding and alignment methods, thus making it especially appropriate for high-throughput studies. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Batzoglou S."
                    },
                    {
                        "name": "Do C.B."
                    },
                    {
                        "name": "Foo C.-S."
                    }
                ],
                "citationCount": 67,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A max-margin model for efficient simultaneous alignment and folding of RNA sequences"
            },
            "pmcid": "PMC2718655",
            "pmid": "18586747",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": [
        "2.02"
    ]
}
