
{
    "credit": [
        {
            "email": "andreyto@gmail.com",
            "name": "Andrey Tovchigrechko",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "Terms of use",
            "url": "http://vakser.compbio.ku.edu/resources/gramm/grammx/#ConditionsOfUse"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Immunoproteins, genes and antigens",
                "uri": "http://edamontology.org/topic_2830"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Protein docking software GRAMM-X and its web interface (http://vakser.bioinformatics.ku.edu/resources/ gramm/grammx) extend the original GRAMM Fast Fourier Transformation methodology by employing smoothedpotentials, refinement stage,and knowledge-based scoring. The web server frees users from complex installation of database-dependent parallel software and maintaining large hardware resources needed for protein docking simulations. Docking problems submitted to GRAMM-X server are processed by a 320 processor Linux cluster. The server was extensively tested by benchmarking, several months of public use, and participation in the CAPRI server track. © The Author 2006. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Tovchigrechko A.",
                "Vakser I.A."
            ],
            "cit_count": 380,
            "journal": "Nucleic Acids Research",
            "pmid": "16845016",
            "title": "GRAMM-X public web server for protein-protein docking",
            "year": "2006-07-01"
        },
        {
            "abstract": "A single protein-protein pair, the complex of the influenza virus hemagglutinin with an antibody (Fab BH151), was suggested for prediction at the second experiment on the Critical Assessment of Techniques for Protein Structure Prediction. To predict the structure of the complex, we applied our docking program GRAMM at a decreased resolution (to accommodate the conformational inaccuracies). The lowest-energy match showed a remarkable 'low-resolution' surface complementarity between the molecular structures. After receiving the experimental structure of the complex we had a chance to verify our assumptions and results. The analysis of the hemagglutinin- antibody interface revealed several significant conformational changes in the side chains, which resulted in deep interpenetrations of the hemagglutinin and the antibody structures. This confirmed our initial assumption that the structural changes will be beyond the tolerance of high-resolution rigid- body docking. The comparison of the predicted low-resolution match, submitted as the solution, and the experimentally determined complex showed significant structural discrepancies in the orientation of the antibody, due to the low- resolution character of the docking. Because of the severe structural errors, no residue-residue contacts were predicted correctly. However, a significant part of the antigenic site was determined. This illustrates the practical value of the present methodology for the initial prediction of the binding site, as well as points out the problem of transition from the low-resolution predictions of protein-protein complexes to the accurate structure.",
            "authors": [
                "Vakser I.A."
            ],
            "cit_count": 89,
            "journal": "Proteins: Structure, Function and Genetics",
            "pmid": "9485517",
            "title": "Evaluation of GRAMM low-resolution docking methodology on the hemagglutinin-antibody complex",
            "year": "1997-12-01"
        },
        {
            "abstract": "A new version of GRAMM was applied to Targets 14, 18, and 19 in CAPRI Round 5. The predictions were generated without manual intervention. Ten top-ranked matches for each target were submitted. The docking was performed by a rigid-body procedure with a smoothed potential function to accommodate conformational changes. The first stage was a global search on a fine grid with a projection of a smoothed Lennard-Jones potential. The top predictions from the first stage were subjected to the conjugate gradient minimization with the same smoothed potential. The resulting local minima were reranked according to the weighted sum of Lennard-Jones potential, pairwise residue-residue statistical preferences, cluster occupancy, and the degree of the evolutionary conservation of the predicted interface. For Targets 14 and 18, the conformation of the complex was predicted with root-mean-square deviation (RMSD) of the ligand interface atoms 0.68 Å and 1.88 Å correspondingly. For Target 19, the interface areas on both proteins were correctly predicted. The performance of the procedure was also analyzed on the benchmark of bound-unbound protein complexes. The results show that, on average, conformations of only 3 side-chains need to be optimized during docking of unbound structures before the backbone changes become a limiting factor. © 2005 Wiley-Liss, Inc.",
            "authors": [
                "Tovchigrechko A.",
                "Vakser I.A."
            ],
            "cit_count": 100,
            "journal": "Proteins: Structure, Function and Genetics",
            "pmid": "15981259",
            "title": "Development and testing of an automated approach to protein docking",
            "year": "2005-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gramm-x",
        "biotoolsID": "gramm-x",
        "description": "GRAMM-X is a protein docking server.",
        "homepage": "http://vakser.bioinformatics.ku.edu/resources/gramm/grammx",
        "name": "GRAMM-X"
    }
}