{
    "additionDate": "2017-01-13T13:13:30Z",
    "biotoolsCURIE": "biotools:age",
    "biotoolsID": "age",
    "credit": [
        {
            "email": "Abyzov.Alexej@mayo.edu",
            "name": "Abyzov Alexej",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool that implements an algorithm for optimal alignment of sequences with SVs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sv.gersteinlab.org/age/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://sv.gersteinlab.org/age",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "CC-BY-NC-4.0",
    "name": "AGE",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Defining the precise location of structural variations (SVs) at single-nucleotide breakpoint resolution is an important problem, as it is a prerequisite for classifying SVs, evaluating their functional impact and reconstructing personal genome sequences. Given approximate breakpoint locations and a bridging assembly or split read, the problem essentially reduces to finding a correct sequence alignment. Classical algorithms for alignment and their generalizations guarantee finding the optimal (in terms of scoring) global or local alignment of two sequences. However, they cannot generally be applied to finding the biologically correct alignment of genomic sequences containing SVs because of the need to simultaneously span the SV (e.g. make a large gap) and perform precise local alignments at the flanking ends. Results: Here, we formulate the computations involved in this problem and describe a dynamic-programming algorithm for its solution. Specifically, our algorithm, called AGE for Alignment with Gap Excision, finds the optimal solution by simultaneously aligning the 5' and 3' ends of two given sequences and introducing a 'large-gap jump' between the local end alignments to maximize the total alignment score. We also describe extensions allowing the application of AGE to tandem duplications, inversions and complex events involving two large gaps. We develop a memory-efficient implementation of AGE (allowing application to long contigs) and make it available as a downloadable software package. Finally, we applied AGE for breakpoint determination and standardization in the 1000 Genomes Project by aligning locally assembled contigs to the human genome. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Abyzov A."
                    },
                    {
                        "name": "Gerstein M."
                    }
                ],
                "citationCount": 65,
                "date": "2011-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AGE: Defining breakpoints of genomic structural variants at single-nucleotide resolution, through optimal alignments with gap excision"
            },
            "pmid": "21233167"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}