{
    "additionDate": "2017-09-29T05:05:29Z",
    "biotoolsCURIE": "biotools:potamos",
    "biotoolsID": "potamos",
    "credit": [
        {
            "email": "gpapamokos@seas.harvard.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Post-Translational Modifications Mass Spectrometry Calculator is a free web application that simplifies mass spectrometry calculations for post-translationally modified (PTM) proteins. The application is able to calculate: a) the kind, the number and the combinations of  possible PTMs for a  peptide or protein sequence and the corresponding mass, b) the charge of a peptide, protein or protein fragment in  their modified or  unmodified state, c) the protein fragments produced upon proteolytic cleavage of PTM modified proteins and their masses. A particular focus is on PTM-modified histones. A histone variant browser is included in the web application. It could be useful in analysis of mass-spec data for epigenetically  modified histones and other proteins.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://potamos.med.uoi.gr/Manual.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "PTM identification",
                    "uri": "http://edamontology.org/operation_3645"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    }
                }
            ]
        }
    ],
    "homepage": "https://potamos.med.uoi.gr/",
    "lastUpdate": "2021-05-20T08:26:30.429749Z",
    "name": "POTAMOS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "apolitou",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2014.10.002",
            "metadata": {
                "abstract": "© 2014 Elsevier Ltd.Mass spectrometry is a widely used technique for protein identification and it has also become the method of choice in order to detect and characterize the post-translational modifications (PTMs) of proteins. Many software tools have been developed to deal with this complication. In this paper we introduce a new, free and user friendly online software tool, named POTAMOS Mass Spectrometry Calculator, which was developed in the open source application framework Ruby on Rails. It can provide calculated mass spectrometry data in a time saving manner, independently of instrumentation. In this web application we have focused on a well known protein family of histones whose PTMs are believed to play a crucial role in gene regulation, as suggested by the so called \"histone code\" hypothesis. The PTMs implemented in this software are: methylations of arginines and lysines, acetylations of lysines and phosphorylations of serines and threonines. The application is able to calculate the kind, the number and the combinations of the possible PTMs corresponding to a given peptide sequence and a given mass along with the full set of the unique primary structures produced by the possible distributions along the amino acid sequence. It can also calculate the masses and charges of a fragmented histone variant, which carries predefined modifications already implemented. Additional functionality is provided by the calculation of the masses of fragments produced upon protein cleavage by the proteolytic enzymes that are most widely used in proteomics studies.",
                "authors": [
                    {
                        "name": "Vlachopanos A."
                    },
                    {
                        "name": "Soupsana E."
                    },
                    {
                        "name": "Politou A.S."
                    },
                    {
                        "name": "Papamokos G.V."
                    }
                ],
                "citationCount": 1,
                "date": "2014-12-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "POTAMOS mass spectrometry calculator: Computer aided mass spectrometry to the post-translational modifications of proteins. A focus on histones"
            },
            "pmid": "25450216",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1,
    "version": [
        "v2.0"
    ]
}