{
    "accessibility": "Open access",
    "additionDate": "2022-11-15T08:18:19.232233Z",
    "biotoolsCURIE": "biotools:nsf4sl",
    "biotoolsID": "nsf4sl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhengjie@shanghaitech.edu.cn",
            "name": "Jie Zheng",
            "typeEntity": "Person"
        }
    ],
    "description": "NSF4SL is a negative-sample-free model for prediction of synthetic lethality (SL) based on a self-supervised contrastive learning framework.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JieZheng-ShanghaiTech/NSF4SL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:21:03.189943Z",
    "license": "MIT",
    "name": "NSF4SL",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac462",
            "metadata": {
                "abstract": "Motivation: Detecting synthetic lethality (SL) is a promising strategy for identifying anti-cancer drug targets. Targeting SL partners of a primary gene mutated in cancer is selectively lethal to cancer cells. Due to high cost of wet-lab experiments and availability of gold standard SL data, supervised machine learning for SL prediction has been popular. However, most of the methods are based on binary classification and thus limited by the lack of reliable negative data. Contrastive learning can train models without any negative sample and is thus promising for finding novel SLs. Results: We propose NSF4SL, a negative-sample-free SL prediction model based on a contrastive learning framework. It captures the characteristics of positive SL samples by using two branches of neural networks that interact with each other to learn SL-related gene representations. Moreover, a feature-wise data augmentation strategy is used to mitigate the sparsity of SL data. NSF4SL significantly outperforms all baselines which require negative samples, even in challenging experimental settings. To the best of our knowledge, this is the first time that SL prediction is formulated as a gene ranking problem, which is more practical than the current formulation as binary classification. NSF4SL is the first contrastive learning method for SL prediction and its success points to a new direction of machine-learning methods for identifying novel SLs.",
                "authors": [
                    {
                        "name": "Feng Y."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "citationCount": 6,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NSF4SL: Negative-sample-free contrastive learning for ranking synthetic lethal partner genes in human cancers"
            },
            "pmid": "36124790"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
