{
    "additionDate": "2019-11-14T18:24:07Z",
    "biotoolsCURIE": "biotools:CoDReS",
    "biotoolsID": "CoDReS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "georges@cing.ac.cy",
            "name": "George M. Spyrou",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web Tool for Ranking Candidate Drugs Against a Selected Disease Based on a Combination of Functional and Structural Criteria | Computational Drug Repositioning Score",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://bioinformatics.cing.ac.cy/codres",
    "lastUpdate": "2020-12-16T16:25:09Z",
    "name": "CoDReS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2019.05.010",
            "metadata": {
                "abstract": "© 2019 The AuthorsDrug repurposing techniques allow existing drugs to be tested against diseases outside their initial spectrum, resulting in reduced cost and eliminating the long time-frames of new drug development. In silico drug repurposing further speeds up the process either by proposing drugs suitable to invert the transcriptomic profile of a disease or by indicating drugs based on their common targets or structural similarity with other drugs with similar mode of action. Such methods usually return a number of potential repurposed drugs that need to be tested against the disease in in vitro, pre-clinical and clinical studies. Thus, it is crucial to have a more sophisticated candidate drug ranking in order to start testing from the most promising chemical substances. As a means to enhance the above decision process, we present CoDReS (Composite Drug Reranking Scoring), a drug (re-)ranking web-based tool, which combines an initial drug ranking (i.e. repurposing score or hypothesis/potentiality score) with a functional score of each drug considered in conjunction with the disease under study as well as with a structural score derived from potential drugability violations. Furthermore, a structural similarity clustering is applied on the considered drugs and a handful of structural exemplars are suggested for further in vitro and in vivo validation. The user is able to filter the results further, through structural similarity examination of the candidate drugs with drugs that have failed against the queried disease where related clinical trials have been carried out. CoDReS is publicly available online at http://bioinformatics.cing.ac.cy/codres.",
                "authors": [
                    {
                        "name": "Karatzas E."
                    },
                    {
                        "name": "Minadakis G."
                    },
                    {
                        "name": "Kolios G."
                    },
                    {
                        "name": "Delis A."
                    },
                    {
                        "name": "Spyrou G.M."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "A Web Tool for Ranking Candidate Drugs Against a Selected Disease Based on a Combination of Functional and Structural Criteria"
            },
            "pmcid": "PMC6637175",
            "pmid": "31360332"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        }
    ],
    "validated": 1
}