{
    "additionDate": "2021-06-20T15:08:04Z",
    "biotoolsCURIE": "biotools:effective_brain_connectivity",
    "biotoolsID": "effective_brain_connectivity",
    "description": "Tools for combining structural MRI (tractography/connectome) to functional MRI\nhttps://doi.org/10.1016/j.neuroimage.2021.118288",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/alecrimi/effective_connectivity_toolbox",
    "lastUpdate": "2024-11-24T15:19:27.739632Z",
    "name": "Effective Brain Connectivity",
    "owner": "alecrimi",
    "publication": [
        {
            "doi": "10.1016/j.neuroimage.2021.118288",
            "metadata": {
                "abstract": "The relationship between structure and function is of interest in many research fields involving the study of complex biological processes. In neuroscience in particular, the fusion of structural and functional data can help to understand the underlying principles of the operational networks in the brain. To address this issue, this paper proposes a constrained autoregressive model leading to a representation of effective connectivity that can be used to better understand how the structure modulates the function. Or simply, it can be used to find novel biomarkers characterizing groups of subjects. In practice, an initial structural connectivity representation is re-weighted to explain the functional co-activations. This is obtained by minimizing the reconstruction error of an autoregressive model constrained by the structural connectivity prior. The model has been designed to also include indirect connections, allowing to split direct and indirect components in the functional connectivity, and it can be used with raw and deconvoluted BOLD signal. The derived representation of dependencies was compared to the well known dynamic causal model, giving results closer to known ground-truth. Further evaluation of the proposed effective network was performed on two typical tasks. In a first experiment the direct functional dependencies were tested on a community detection problem, where the brain was partitioned using the effective networks across multiple subjects. In a second experiment the model was validated in a case-control task, which aimed at differentiating healthy subjects from individuals with autism spectrum disorder. Results showed that using effective connectivity leads to clusters better describing the functional interactions in the community detection task, while maintaining the original structural organization, and obtaining a better discrimination in the case-control classification task.",
                "authors": [
                    {
                        "name": "Crimi A."
                    },
                    {
                        "name": "Dodero L."
                    },
                    {
                        "name": "Murino V."
                    },
                    {
                        "name": "Sambataro F."
                    },
                    {
                        "name": "Sona D."
                    }
                ],
                "citationCount": 22,
                "date": "2021-10-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Structurally constrained effective brain connectivity"
            },
            "pmid": "34147631",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ]
}
