{
    "accessibility": "Open access",
    "additionDate": "2023-03-03T10:25:03.255599Z",
    "biotoolsCURIE": "biotools:scorpios",
    "biotoolsID": "scorpios",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "camille.berthelot@bio.ens.psl.eu",
            "name": "Camille Berthelot",
            "orcidid": "https://orcid.org/0000-0001-5054-2690",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hrc@ens.fr",
            "name": "Hugues Roest Crollius",
            "orcidid": "https://orcid.org/0000-0002-8209-173X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "parey@bio.ens.psl.eu",
            "name": "Elise Parey",
            "orcidid": "https://orcid.org/0000-0003-3394-2697",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "IBENS - DYOGEN Team",
            "typeEntity": "Institute",
            "url": "http://www.ibens.ens.fr/?rubrique43"
        }
    ],
    "description": "SCORPiOs - Synteny-guided CORrection of Paralogies and Orthologies\n\nSCORPiOs is a synteny-guided gene tree correction pipeline for clades that have undergone a whole-genome duplication event. SCORPiOs identifies gene trees where the whole-genome duplication is missing or incorrectly placed, based on the genomic locations of the duplicated genes across the different species. SCORPiOs then builds an optimized gene tree consistent with the known WGD event, the species tree, local synteny context, as well as gene sequence evolution.",
    "documentation": [
        {
            "type": [
                "Quick start guide"
            ],
            "url": "https://scorpios.readthedocs.io/en/latest/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/DyogenIBENS/SCORPIOS/",
            "version": "2.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DyogenIBENS/SCORPIOS",
    "language": [
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T14:56:21.806004Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "GitHub repository",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/DyogenIBENS/SCORPIOS"
        },
        {
            "note": "Software Heritage",
            "type": [
                "Repository"
            ],
            "url": "https://archive.softwareheritage.org/swh:1:dir:95ed6b42a8b0c3ecfbc259428f722f6e1fedcb90;origin=https://github.com/DyogenIBENS/SCORPIOS;visit=swh:1:snp:b940763c20dedeeda4434db70ecd76e8669190b4;anchor=swh:1:rev:5996f93da6129c3b6490e13c29128f9700657a9f"
        }
    ],
    "maturity": "Mature",
    "name": "SCORPiOs",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "alouis",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-2561-3_8",
            "metadata": {
                "abstract": "Phylogenetic gene trees recapitulate the evolutionary history of genes across species, forming an essential framework for comparative genomic studies. In particular, within the context of whole-genome duplications (WGDs), they serve as a basis to investigate patterns of duplicate gene retention and loss, timing of genome rediploidization, and, more generally, to explore the functional consequences of the duplication in descending species. Yet, despite ever more sophisticated models to describe the evolution of gene sequences, building accurate gene trees remains a challenge in ancient polyploid taxons. WGDs generate complex gene families with many duplicated copies and recurrent gene losses, which complicate this task even more. Here, we describe how to use SCORPiOs, a novel method that leverages synteny conservation to provide more accurate phylogenies in the presence of a known WGD event.",
                "authors": [
                    {
                        "name": "Berthelot C."
                    },
                    {
                        "name": "Parey E."
                    },
                    {
                        "name": "Roest Crollius H."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "SCORPiOs, a Novel Method to Reconstruct Gene Phylogenies in the Context of a Known WGD Event"
            },
            "pmid": "36720812",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1093/molbev/msaa149",
            "metadata": {
                "abstract": "Whole-genome duplications (WGDs) have major impacts on the evolution of species, as they produce new gene copies contributing substantially to adaptation, isolation, phenotypic robustness, and evolvability. They result in large, complex gene families with recurrent gene losses in descendant species that sequence-based phylogenetic methods fail to reconstruct accurately. As a result, orthologs and paralogs are difficult to identify reliably in WGD-descended species, which hinders the exploration of functional consequences of WGDs. Here, we present Synteny-guided CORrection of Paralogies and Orthologies (SCORPiOs), a novel method to reconstruct gene phylogenies in the context of a known WGD event. WGDs generate large duplicated syntenic regions, which SCORPiOs systematically leverages as a complement to sequence evolution to infer the evolutionary history of genes. We applied SCORPiOs to the 320-My-old WGD at the origin of teleost fish. We find that almost one in four teleost gene phylogenies in the Ensembl database (3,394) are inconsistent with their syntenic contexts. For 70% of these gene families (2,387), we were able to propose an improved phylogenetic tree consistent with both the molecular substitution distances and the local syntenic information. We show that these synteny-guided phylogenies are more congruent with the species tree, with sequence evolution and with expected expression conservation patterns than those produced by state-of-the-art methods. Finally, we show that synteny-guided gene trees emphasize contributions of WGD paralogs to evolutionary innovations in the teleost clade.",
                "authors": [
                    {
                        "name": "Berthelot C."
                    },
                    {
                        "name": "Cabau C."
                    },
                    {
                        "name": "Guiguen Y."
                    },
                    {
                        "name": "Louis A."
                    },
                    {
                        "name": "Parey E."
                    },
                    {
                        "name": "Roest Crollius H."
                    }
                ],
                "citationCount": 26,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Synteny-guided resolution of gene trees clarifies the functional impact of whole-genome duplications"
            },
            "pmid": "32556216",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "version": [
        "2.0"
    ]
}
