{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2024-05-03T08:16:00.213863Z",
    "biotoolsCURIE": "biotools:mmpatho",
    "biotoolsID": "mmpatho",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "njyudj@njust.edu.cn",
            "name": "Dong-Jun Yu",
            "orcidid": "https://orcid.org/0000-0002-6786-8053",
            "typeEntity": "Person"
        },
        {
            "email": "watshara.sho@mahidol.ac.th",
            "name": "Watshara Shoombuatong",
            "orcidid": "https://orcid.org/0000-0002-3394-8709",
            "typeEntity": "Person"
        }
    ],
    "description": "MMPatho: Interpretable Model with Multilevel Consensus and Evolutionary Information for Missense Mutation Pathogenic Prediction and Annotation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://csbio.njust.edu.cn/bioinf/mmpatho/",
    "lastUpdate": "2024-11-24T14:02:01.194084Z",
    "name": "MMPatho",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.3c00950",
            "metadata": {
                "abstract": "Understanding the pathogenicity of missense mutation (MM) is essential for shed light on genetic diseases, gene functions, and individual variations. In this study, we propose a novel computational approach, called MMPatho, for enhancing missense mutation pathogenic prediction. First, we established a large-scale nonredundant MM benchmark data set based on the entire Ensembl database, complemented by a focused blind test set specifically for pathogenic GOF/LOF MM. Based on this data set, for each mutation, we utilized Ensembl VEP v104 and dbNSFP v4.1a to extract variant-level, amino acid-level, individuals’ outputs, and genome-level features. Additionally, protein sequences were generated using ENSP identifiers with the Ensembl API, and then encoded. The mutant sites’ ESM-1b and ProtTrans-T5 embeddings were subsequently extracted. Then, our model group (MMPatho) was developed by leveraging upon these efforts, which comprised ConsMM and EvoIndMM. To be specific, ConsMM employs individuals’ outputs and XGBoost with SHAP explanation analysis, while EvoIndMM investigates the potential enhancement of predictive capability by incorporating evolutionary information from ESM-1b and ProtT5-XL-U50, large protein language embeddings. Through rigorous comparative experiments, both ConsMM and EvoIndMM were capable of achieving remarkable AUROC (0.9836 and 0.9854) and AUPR (0.9852 and 0.9902) values on the blind test set devoid of overlapping variations and proteins from the training data, thus highlighting the superiority of our computational approach in the prediction of MM pathogenicity. Our Web server, available at http://csbio.njust.edu.cn/bioinf/mmpatho/, allows researchers to predict the pathogenicity (alongside the reliability index score) of MMs using the ConsMM and EvoIndMM models and provides extensive annotations for user input. Additionally, the newly constructed benchmark data set and blind test set can be accessed via the data page of our web server.",
                "authors": [
                    {
                        "name": "Alahmadi H."
                    },
                    {
                        "name": "Arif M."
                    },
                    {
                        "name": "Ge F."
                    },
                    {
                        "name": "Shoombuatong W."
                    },
                    {
                        "name": "Worachartcheewan A."
                    },
                    {
                        "name": "Yan Z."
                    },
                    {
                        "name": "Yu D.-J."
                    }
                ],
                "citationCount": 4,
                "date": "2023-11-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "MMPatho: Leveraging Multilevel Consensus and Evolutionary Information for Enhanced Missense Mutation Pathogenic Prediction"
            },
            "pmcid": "PMC10685454",
            "pmid": "37947586"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
