{
    "additionDate": "2021-01-18T11:14:11Z",
    "biotoolsCURIE": "biotools:rmdisease",
    "biotoolsID": "rmdisease",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jia.meng@xjtlu.edu.cn",
            "name": "Jia Meng",
            "typeEntity": "Person"
        },
        {
            "email": "zhen.wei01@xjtlu.edu.cn",
            "name": "Zhen Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "a database of genetic variants that affect RNA modifications, with implications for epitranscriptome pathogenesis.\n\nRMDisease a database of genetic variants that affect RNA modifications, with implications for epitranscriptome pathogenesis.\n\nDeciphering the biological impacts of millions of single nucleotide variants remains a major challenge.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "http://www.xjtlu.edu.cn/biologicalsciences/rmd",
    "lastUpdate": "2024-11-24T20:45:12.009412Z",
    "name": "RMDisease",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa790",
            "metadata": {
                "abstract": "Deciphering the biological impacts of millions of single nucleotide variants remains a major challenge. Recent studies suggest that RNA modifications play versatile roles in essential biological mechanisms, and are closely related to the progression of various diseases including multiple cancers. To comprehensively unveil the association between disease-associated variants and their epitranscriptome disturbance, we built RMDisease, a database of genetic variants that can affect RNA modifications. By integrating the prediction results of 18 different RNA modification prediction tools and also 303,426 experimentally-validated RNA modification sites, RMDisease identified a total of 202,307 human SNPs that may affect (add or remove) sites of eight types of RNA modifications (m6A, m5C, m1A, m5U, ψ, m6Am, m7G and Nm). These include 4,289 disease-associated variants that may imply disease pathogenesis functioning at the epitranscriptome layer. These SNPs were further annotated with essential information such as post-transcriptional regulations (sites for miRNA binding, interaction with RNA-binding proteins and alternative splicing) revealing putative regulatory circuits. A convenient graphical user interface was constructed to support the query, exploration and download of the relevant information. RMDisease should make a useful resource for studying the epitranscriptome impact of genetic variants via multiple RNA modifications with emphasis on their potential disease relevance. RMDisease is freely accessible at: www.xjtlu.edu.cn/biologicalsciences/rmd.",
                "authors": [
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "De Magalhaes J.P."
                    },
                    {
                        "name": "Meng J."
                    },
                    {
                        "name": "Rigden D.J."
                    },
                    {
                        "name": "Song B."
                    },
                    {
                        "name": "Su J."
                    },
                    {
                        "name": "Tang Y."
                    },
                    {
                        "name": "Wei Z."
                    },
                    {
                        "name": "Xu Q."
                    }
                ],
                "citationCount": 69,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RMDisease: A database of genetic variants that affect RNA modifications, with implications for epitranscriptome pathogenesis"
            },
            "pmcid": "PMC7778951",
            "pmid": "33010174"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
