{
    "accessibility": "Open access",
    "additionDate": "2023-02-04T01:37:44.788586Z",
    "biotoolsCURIE": "biotools:mrasleepnet",
    "biotoolsID": "mrasleepnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Shuicai Wu"
        },
        {
            "name": "Xiaorong Gao"
        },
        {
            "name": "Guangyu Bin",
            "orcidid": "https://orcid.org/0000-0002-0823-179X"
        },
        {
            "name": "Rui Yu",
            "orcidid": "https://orcid.org/0000-0001-9303-3570"
        },
        {
            "name": "Zhuhuang Zhou",
            "orcidid": "https://orcid.org/0000-0003-0570-8473"
        }
    ],
    "description": "A multi-resolution attention network for sleep stage classification using single-channel EEG.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YuRui8879/MRASleepNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-04T01:37:44.791128Z",
    "license": "Not licensed",
    "name": "MRASleepNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1088/1741-2552/ACA2DE",
            "metadata": {
                "abstract": "© 2022 IOP Publishing Ltd.Objective. Computerized classification of sleep stages based on single-lead electroencephalography (EEG) signals is important, but still challenging. In this paper, we proposed a deep neural network called MRASleepNet for automatic sleep stage classification using single-channel EEG signals. Approach. The proposed MRASleepNet model consisted of a feature extraction (FE) module, a multi-resolution attention (MRA) module, and a gated multilayer perceptron (gMLP) module, as well as a direct pathway for computing statistical features. The FE, MRA, and gMLP modules were used to extract features, establish feature attention, and obtain temporal relationships between features, respectively. EEG signals were normalized and cut into 30 s segments, and enhanced by incorporating contextual information from adjacent data segments. After data enhancement, the 40 s data segments were input to the MRASleepNet model. The model was evaluated on the SleepEDF and the cyclic alternating pattern (CAP) databases, using such metrics as the accuracy, Kappa, and macro-F1 (MF1). Main results. For the SleepEDF-20 database, the proposed model had an accuracy of 84.5%, an MF1 of 0.789, and a Kappa of 0.786. For the SleepEDF-78 database, the model had an accuracy of 81.4%, an MF1 of 0.754, and a Kappa of 0.743. For the CAP database, the model had an accuracy of 74.3%, an MF1 of 0.656, and a Kappa of 0.652. The proposed model achieved satisfactory performance in automatic sleep stage classification tasks. Significance. The time- and frequency-domain features extracted by the FE module and filtered by the MRA module, together with the temporal features extracted by the gMLP module and the statistical features extracted by the statistical highway, enabled the proposed model to obtain a satisfying performance in sleep staging. The proposed MRASleepNet model may be used as a new deep learning method for automatic sleep stage classification. The code of MRASleepNet will be made available publicly on https://github.com/YuRui8879/.",
                "authors": [
                    {
                        "name": "Bin G."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Yu R."
                    },
                    {
                        "name": "Zhou Z."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Neural Engineering",
                "title": "MRASleepNet: a multi-resolution attention network for sleep stage classification using single-channel EEG"
            },
            "pmid": "36379059"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
