{
    "additionDate": "2017-08-03T18:44:42Z",
    "biotoolsCURIE": "biotools:gre4zn",
    "biotoolsID": "gre4zn",
    "credit": [
        {
            "email": "hyliu@ustc.edu.cn",
            "name": "Haiyan Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biocomp.ustc.edu.cn/"
        }
    ],
    "description": "Novel computational program to characterize the zinc-binding sites in protein structures, by restricting the distances between zinc and its coordinating atoms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gre4zn.biocuckoo.org/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "http://gre4zn.biocuckoo.org/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gre4zn-geometric-restriction-for-zinc-binding.html"
        }
    ],
    "name": "GRE4Zn",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Zinc is one of the most essential metals utilized by organisms, and zinc-binding proteins play an important role in a variety of biological processes such as transcription regulation, cell metabolism and apoptosis. Thus, characterizing the precise zinc-binding sites is fundamental to an elucidation of the biological functions and molecular mechanisms of zinc-binding proteins. Using systematic analyses of structural characteristics, we observed that 4-residue and 3-residue zinc-binding sites have distinctly specific geometric features. Based on the results, we developed the novel computational program Geometric REstriction for Zinc-binding (GRE4Zn) to characterize the zinc-binding sites in protein structures, by restricting the distances between zinc and its coordinating atoms. The comparison between GRE4Zn and analogous tools revealed that it achieved a superior performance. A large-scale prediction for structurally characterized proteins was performed with this powerful predictor, and statistical analyses for the results indicated zinc-binding proteins have come to be significantly involved in more complicated biological processes in higher species than simpler species during the course of evolution. Further analyses suggested that zinc-binding proteins are preferentially implicated in a variety of diseases and highly enriched in known drug targets, and the prediction of zinc-binding sites can be helpful for the investigation of molecular mechanisms. In this regard, these prediction and analysis results should prove to be highly useful be helpful for further biomedical study and drug design. The online service of GRE4Zn is freely available at: http://biocomp.ustc.edu.cn/gre4zn/. This article is part of a Special Issue entitled: Computational Proteomics, Systems Biology & Clinical Implications. Guest Editor: Yudong Cai. © 2013 Elsevier B.V.",
                "authors": [
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xue Y."
                    },
                    {
                        "name": "Zhao W."
                    },
                    {
                        "name": "Zhou C."
                    }
                ],
                "citationCount": 12,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - Proteins and Proteomics",
                "title": "Computationally characterizing and comprehensive analysis of zinc-binding sites in proteins"
            },
            "pmid": "23499845"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}
