{
    "additionDate": "2020-01-14T09:36:01Z",
    "biotoolsCURIE": "biotools:QPA",
    "biotoolsID": "QPA",
    "confidence_flag": "tool",
    "description": "The roles of Qishen granules recipes, Qingre Jiedu, Wenyang Yiqi and Huo Xue, in the treatment of heart failure.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://github.com/github-gs/QPA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-15T18:36:36Z",
    "name": "QPA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JEP.2019.112372",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Ethnopharmacological relevance: Recipes (Qingre Jiedu (QJ), Wenyang Yiqi (WYYQ) and Huo Xue (HX)) in Qishen granules (QSG) are believed to synergistically exert cardio-protective effects. However, the underlying pattern of each decomposed recipe in QSG and their synergistic effects in the treatment of heart failure (HF) are not clear. Objective: The purpose of this study is to explore the biological contributions of decomposed recipes to therapeutic effects of QSG and reveal the pharmacological mechanism of QSG in treating HF. Materials and methods: The therapeutic effects of QSG or its recipes on heart failure were examined in wet-lab at both transcription and phenotypic level using HF Sprague-Dawley rats. Sequencing and transcriptome analyses were performed using in silico approaches including identification of differentially expressed genes, pathway enrichment and protein-protein interaction network studies. Specially, an optimized in silico quantitative pathway analysis that maximally extracted gene expression information was developed to reveal differentially expressed pathways (DEPs) among various groups, and is publicly available as R package QPA on GitHub (https://github.com/github-gs/QPA). Finally, the HF-related genes predicted using DEP approach were validated by quantitative real-time polymerase chain reaction and western blot. Results: Multiple key genes and the associated signaling pathways were shown to be highly relevant for the therapeutic effect of QSG. Decreased expression of Spp1 gene required for inflammatory signaling and profibrotic signaling were observed in failing hearts treated with QJ, WYYQ and HX. Decreased expression of Cx3cr1 gene required for inflammatory signaling was observed in failing hearts treated with WYYQ and HX. Decreased expression of Myc gene required for oxidative stress and Fgfr2 gene required for profibrotic signaling were observed in failing hearts treated with HX and WYYQ, respectively. Increased expression of Adcy1 gene required for cAMP-PKA signaling cascade was observed in failing hearts treated with WYYQ and HX. Conclusions: Our study suggests that QJ, WYYQ and HX recipes in QSG achieve synergistic and complementary therapeutic effects through alleviating inflammatory responses, attenuating ventricular remodeling and enhancing myocardial energy supply.",
                "authors": [
                    {
                        "name": "Gao S."
                    },
                    {
                        "name": "Zhang Q."
                    },
                    {
                        "name": "Tian C."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Gao W."
                    },
                    {
                        "name": "Wu D."
                    },
                    {
                        "name": "Jiao N."
                    },
                    {
                        "name": "Zhu L."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Zhu R."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Journal of Ethnopharmacology",
                "title": "The roles of Qishen granules recipes, Qingre Jiedu, Wenyang Yiqi and Huo Xue, in the treatment of heart failure"
            },
            "pmid": "31683036"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}