{
    "accessibility": "Open access",
    "additionDate": "2022-10-06T09:15:47.653804Z",
    "biotoolsCURIE": "biotools:bimm_sc",
    "biotoolsID": "bimm_sc",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Minghan Chen"
        },
        {
            "name": "Qianqian Song"
        }
    ],
    "description": "A novel Bioinformatic Inference and Multiscale Modeling (BIMM) method that can  discovers hub genes of TGFβ, MYC, and SMAD3 varied underlie DEX treatment",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chenm19/BIMM",
    "language": [
        "MATLAB",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:29:37.665683Z",
    "license": "Not licensed",
    "name": "BIMM",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.105999",
            "metadata": {
                "abstract": "Lung cancer is one of the leading causes of cancer-related death, with a five-year survival rate of 18%. It is a priority for us to understand the underlying mechanisms affecting lung cancer therapeutics' implementation and effectiveness. In this study, we combine the power of Bioinformatics and Systems Biology to comprehensively uncover functional and signaling pathways of drug treatment using bioinformatics inference and multiscale modeling of both scRNA-seq data and proteomics data. Based on a time series of lung adenocarcinoma derived A549 cells after DEX treatment, we first identified the differentially expressed genes (DEGs) in those lung cancer cells. Through the interrogation of regulatory network of those DEGs, we identified key hub genes including TGFβ, MYC, and SMAD3 varied underlie DEX treatment. Further gene set enrichment analysis revealed the TGFβ signaling pathway as the top enriched term. Those genes involved in the TGFβ pathway and their crosstalk with the ERBB pathway presented a strong survival prognosis in clinical lung cancer samples. With the basis of biological validation and literature-based curation, a multiscale model of tumor regulation centered on both TGFβ-induced and ERBB-amplified signaling pathways was developed to characterize the dynamic effects of DEX therapy on lung cancer cells. Our simulation results were well matched to available data of SMAD2, FOXO3, TGFβ1, and TGFβR1 over the time course. Moreover, we provided predictions of different doses to illustrate the trend and therapeutic potential of DEX treatment. The innovative and cross-disciplinary approach can be further applied to other computational studies in tumorigenesis and oncotherapy. We released the approach as a user-friendly tool named BIMM (Bioinformatic Inference and Multiscale Modeling), with all the key features available at https://github.com/chenm19/BIMM.",
                "authors": [
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "He W."
                    },
                    {
                        "name": "Song Q."
                    },
                    {
                        "name": "Su J."
                    },
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 1,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Uncovering the dynamic effects of DEX treatment on lung cancer by integrating bioinformatic inference and multiscale modeling of scRNA-seq and proteomics data"
            },
            "pmcid": "PMC9717711",
            "pmid": "35998480"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
