{
    "name": "Maxillary-Sinus-Quantification", 
    "description": "Automated tool for quantifying the total and air-free volume of the maxillary sinus based on computed tomography images. The quantification tool seeks to standardize maxillary sinus volume measurements, thus allowing better comparisons and determinations of factors that influence maxillary sinus size. The automated tool utilized image processing techniques (watershed, threshold, and morphological operators).", 
    "homepage": "https://github.com/dianapina/Maxillary-Sinus-Quantification", 
    "biotoolsID": "maxillary-sinus-quantification", 
    "biotoolsCURIE": "biotools:maxillary-sinus-quantification", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3443", 
                    "term": "Image analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Plug-in"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3384", 
            "term": "Medical imaging"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/dianapina/Maxillary-Sinus-Quantification/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0190770", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Computed tomography-based volumetric tool for standardized measurement of the maxillary sinus", 
                "abstract": "Copyright: © 2018 Giacomini et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Volume measurements of maxillary sinus may be useful to identify diseases affecting paranasal sinuses. However, literature shows a lack of consensus in studies measuring the volume. This may be attributable to different computed tomography data acquisition techniques, segmentation methods, focuses of investigation, among other reasons. Furthermore, methods for volumetrically quantifying the maxillary sinus are commonly manual or semiautomated, which require substantial user expertise and are time-consuming. The purpose of the present study was to develop an automated tool for quantifying the total and air-free volume of the maxillary sinus based on computed tomography images. The quantification tool seeks to standardize maxillary sinus volume measurements, thus allowing better comparisons and determinations of factors that influence maxillary sinus size. The automated tool utilized image processing techniques (watershed, threshold, and morphological operators). The maxillary sinus volume was quantified in 30 patients. To evaluate the accuracy of the automated tool, the results were compared with manual segmentation that was performed by an experienced radiologist using a standard procedure. The mean percent differences between the automated and manual methods were 7.19% ± 5.83% and 6.93% ± 4.29% for total and air-free maxillary sinus volume, respectively. Linear regression and Bland-Altman statistics showed good agreement and low dispersion between both methods. The present automated tool for maxillary sinus volume assessment was rapid, reliable, robust, accurate, and reproducible and may be applied in clinical practice. The tool may be used to standardize measurements of maxillary volume. Such standardization is extremely important for allowing comparisons between studies, providing a better understanding of the role of the maxillary sinus, and determining the factors that influence maxillary sinus size under normal and pathological conditions.", 
                "date": "2018-01-01T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Giacomini G."
                    }, 
                    {
                        "name": "Pavan A.L.M."
                    }, 
                    {
                        "name": "Altemani J.M.C."
                    }, 
                    {
                        "name": "Duarte S.B."
                    }, 
                    {
                        "name": "Fortaleza C.M.C.B."
                    }, 
                    {
                        "name": "Miranda J.R.D.A."
                    }, 
                    {
                        "name": "De Pina D.R."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Diana Rodrigues de Pina", 
            "email": "drpina@fmb.unesp.br", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "migle_sur", 
    "additionDate": "2018-06-04T20:07:00Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}