{
    "additionDate": "2017-08-03T18:48:12Z",
    "biotoolsCURIE": "biotools:lpicom",
    "biotoolsID": "lpicom",
    "credit": [
        {
            "email": "raghava@imtech.res.in",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://crdd.osdd.net/raghava/lpicom/team.html"
        }
    ],
    "description": "Web server developed for understanding protein-ligand interaction for almost all ligands available in Protein Data Bank.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/raghava/lpicom/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                }
            ]
        }
    ],
    "homepage": "http://crdd.osdd.net/raghava/lpicom/",
    "lastUpdate": "2018-12-10T12:58:46Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/lpicom-analysis-comparison-and-prediction-of-protein-ligand-binding-sites.html"
        }
    ],
    "name": "LPIcom",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 Singh et al.Background: One of the major challenges in the field of system biology is to understand the interaction between a wide range of proteins and ligands. In the past, methods have been developed for predicting binding sites in a protein for a limited number of ligands. Results: In order to address this problem, we developed a web server named 'LPIcom' to facilitate users in understanding protein-ligand interaction. Analysis, comparison and prediction modules are available in the \"LPIcom' server to predict protein-ligand interacting residues for 824 ligands. Each ligand must have at least 30 protein binding sites in PDB. Analysis module of the server can identify residues preferred in interaction and binding motif for a given ligand; for example residues glycine, lysine and arginine are preferred in ATP binding sites. Comparison module of the server allows comparing protein-binding sites of multiple ligands to understand the similarity between ligands based on their binding site. This module indicates that ATP, ADP and GTP ligands are in the same cluster and thus their binding sites or interacting residues exhibit a high level of similarity. Propensity-based prediction module has been developed for predicting ligand-interacting residues in a protein for more than 800 ligands. In addition, a number of web-based tools have been integrated to facilitate users in creating web logo and two-sample between ligand interacting and non-interacting residues. Conclusions: In summary, this manuscript presents a web-server for analysis of ligand interacting residue. This server is available for public use from URL http://crdd.osdd.net/raghava/lpicom. Reviewers: This article was reviewed by Prof Michael Gromiha, Prof Vladimir Poroikov and Prof Zlatko Trajanoski.",
                "authors": [
                    {
                        "name": "Singh H."
                    },
                    {
                        "name": "Srivastava H.K."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 9,
                "date": "2016-03-25T00:00:00Z",
                "journal": "Biology Direct",
                "title": "A web server for analysis, comparison and prediction of protein ligand binding sites"
            },
            "pmid": "27016210"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3557"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}