{
    "accessibility": "Open access",
    "additionDate": "2022-10-01T20:53:47.740248Z",
    "biotoolsCURIE": "biotools:mdgf-mcec",
    "biotoolsID": "mdgf-mcec",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dengzhaohong@jiangnan.edu.cn",
            "name": "Zhaohong Deng",
            "orcidid": "https://orcid.org/0000-0001-8045-2426",
            "typeEntity": "Person"
        },
        {
            "name": "Qunzhuo Wu"
        },
        {
            "name": "Dong-Jun Yu",
            "orcidid": "https://orcid.org/0000-0002-6786-8053"
        },
        {
            "name": "Xiaoyong Pan",
            "orcidid": "https://orcid.org/0000-0001-5010-464X"
        }
    ],
    "description": "A multi-view dual attention embedding model with cooperative ensemble learning for CircRNA-disease association prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ABard0/MDGF-MCEC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:32:24.047575Z",
    "license": "Not licensed",
    "name": "MDGF-MCEC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbac289",
            "metadata": {
                "abstract": "Circular RNA (circRNA) is closely involved in physiological and pathological processes of many diseases. Discovering the associations between circRNAs and diseases is of great significance. Due to the high-cost to verify the circRNA-disease associations by wet-lab experiments, computational approaches for predicting the associations become a promising research direction. In this paper, we propose a method, MDGF-MCEC, based on multi-view dual attention graph convolution network (GCN) with cooperative ensemble learning to predict circRNA-disease associations. First, MDGF-MCEC constructs two disease relation graphs and two circRNA relation graphs based on different similarities. Then, the relation graphs are fed into a multi-view GCN for representation learning. In order to learn high discriminative features, a dual-attention mechanism is introduced to adjust the contribution weights, at both channel level and spatial level, of different features. Based on the learned embedding features of diseases and circRNAs, nine different feature combinations between diseases and circRNAs are treated as new multi-view data. Finally, we construct a multi-view cooperative ensemble classifier to predict the associations between circRNAs and diseases. Experiments conducted on the CircR2Disease database demonstrate that the proposed MDGF-MCEC model achieves a high area under curve of 0.9744 and outperforms the state-of-the-art methods. Promising results are also obtained from experiments on the circ2Disease and circRNADisease databases. Furthermore, the predicted associated circRNAs for hepatocellular carcinoma and gastric cancer are supported by the literature. The code and dataset of this study are available at https://github.com/ABard0/MDGF-MCEC.",
                "authors": [
                    {
                        "name": "Choi K.-S."
                    },
                    {
                        "name": "Deng Z."
                    },
                    {
                        "name": "Pan X."
                    },
                    {
                        "name": "Shen H.-B."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Yu D.-J."
                    }
                ],
                "citationCount": 6,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "MDGF-MCEC: A multi-view dual attention embedding model with cooperative ensemble learning for CircRNA-disease association prediction"
            },
            "pmid": "35907779"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ],
    "validated": 1
}
