{
    "additionDate": "2021-01-18T10:35:20Z",
    "biotoolsCURIE": "biotools:mlefgn",
    "biotoolsID": "mlefgn",
    "confidence_flag": "tool",
    "description": "Multilevel Edge Features Guided Network for Image Denoising.\n\nThis repository is an official PyTorch implementation of the paper ''Multi-level Edge Features Guided Network for Image Denoising''. (TNNLS 2020).\n\nThe paper can be downloaded from MLEFGN.\n\nImage denoising is a challenging inverse problem due to the complex scenes and information loss.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MIVRC/MLEFGN-PyTorch",
    "language": [
        "Python",
        "MATLAB"
    ],
    "lastUpdate": "2021-02-26T08:50:14Z",
    "name": "MLEFGN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TNNLS.2020.3016321",
            "metadata": {
                "abstract": "© 2012 IEEE.Image denoising is a challenging inverse problem due to complex scenes and information loss. Recently, various methods have been considered to solve this problem by building a well-designed convolutional neural network (CNN) or introducing some hand-designed image priors. Different from previous works, we investigate a new framework for image denoising, which integrates edge detection, edge guidance, and image denoising into an end-to-end CNN model. To achieve this goal, we propose a multilevel edge features guided network (MLEFGN). First, we build an edge reconstruction network (Edge-Net) to directly predict clear edges from the noisy image. Then, the Edge-Net is embedded as part of the model to provide edge priors, and a dual-path network is applied to extract the image and edge features, respectively. Finally, we introduce a multilevel edge features guidance mechanism for image denoising. To the best of our knowledge, the Edge-Net is the first CNN model specially designed to reconstruct image edges from the noisy image, which shows good accuracy and robustness on natural images. Extensive experiments clearly illustrate that our MLEFGN achieves favorable performance against other methods and plenty of ablation studies demonstrate the effectiveness of our proposed Edge-Net and MLEFGN. The code is available at https://github.com/MIVRC/MLEFGN-PyTorch.",
                "authors": [
                    {
                        "name": "Fang F."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Zeng T."
                    },
                    {
                        "name": "Zhang G."
                    }
                ],
                "citationCount": 2,
                "date": "2021-09-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "Multilevel Edge Features Guided Network for Image Denoising"
            },
            "pmid": "32845847"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}