{
    "additionDate": "2022-10-05T18:04:11.945691Z",
    "biotoolsCURIE": "biotools:asthmakgxe",
    "biotoolsID": "asthmakgxe",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Chaimae Asaad"
        },
        {
            "name": "Mounir Ghogho"
        }
    ],
    "description": "An asthma-environment interaction knowledge graph leveraging public databases and scientific literature.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bibliography generation",
                    "uri": "http://edamontology.org/operation_3349"
                }
            ]
        }
    ],
    "homepage": "http://asthmakgxe.moreair.info/",
    "lastUpdate": "2022-10-05T18:04:11.948175Z",
    "license": "Not licensed",
    "name": "AsthmaKGxE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2022.105933",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdMotivation: Asthma is a complex heterogeneous disease resulting from intricate interactions between genetic and non-genetic factors related to environmental and psychosocial aspects. Discovery of such interactions can provide insights into the pathophysiology and etiology of asthma. In this paper, we propose an asthma knowledge graph (KG) built using a hybrid methodology for graph-based modeling of asthma complexity with a focus on environmental interactions. Using a heterogeneous set of public sources, we construct a genetic and pharmacogenetic asthma knowledge graph. The construction of this KG allowed us to shed more light on the lack of curated resources focused on environmental influences related to asthma. To remedy the lack of environmental data in our KG, we exploit the biomedical literature using state-of-the-art natural language processing and construct the first Asthma–Environment interaction catalog incorporating a continuously updated ensemble of environmental, psychological, nutritional and socio-economic influences. The catalog's most substantiated results are then integrated into the KG. Results: The resulting environmentally rich knowledge graph ”AsthmaKGxE” aims to provide a resource for several potential applications of artificial intelligence and allows for a multi-perspective study of asthma. Our insight extraction results indicate that stress is the most frequent asthma association in the corpus, followed by allergens and obesity. We contend that studying asthma–environment interactions in more depth holds the key to curbing the complexity and heterogeneity of asthma. Availability: A user interface to browse and download the extracted catalog as well as the KG are available at http://asthmakgxe.moreair.info/. The code and supplementary data are available on github (https://github.com/ChaiAsaad/MoreAIRAsthmaKGxE).",
                "authors": [
                    {
                        "name": "Asaad C."
                    },
                    {
                        "name": "Ghogho M."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "AsthmaKGxE: An asthma–environment interaction knowledge graph leveraging public databases and scientific literature"
            },
            "pmid": "35963184"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        }
    ]
}
