{
    "accessibility": "Open access",
    "additionDate": "2023-12-18T20:09:45.555832Z",
    "biotoolsCURIE": "biotools:cropgf",
    "biotoolsID": "cropgf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mchen@zju.edu.cn",
            "name": "Ming Chen",
            "orcidid": "https://orcid.org/0000-0002-9677-1699",
            "typeEntity": "Person"
        },
        {
            "email": "haoyuchao@zju.edu.cn",
            "name": "Haoyu Chao",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive visual platform for crop gene family mining and analysis. The platform encompasses six important crops (rice, wheat, maize, barley, sorghum and foxtail millet) and one model plant (Arabidopsis), as well as genomics, transcriptomics and proteomics data for gene family mining and analysis, covering a total of 314 611 genes and 4399 types of domains. CropGF provides a search system that allows for the identification of gene families and their members in a single crop or multiple crops.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Phylogenetic inference (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                }
            ]
        }
    ],
    "homepage": "https://bis.zju.edu.cn/cropgf",
    "lastUpdate": "2024-11-24T14:28:04.003385Z",
    "license": "CC-BY-4.0",
    "name": "CropGF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/database/baad051",
            "metadata": {
                "abstract": "A gene family refers to a group of genes that share a common ancestry and encode proteins or RNA molecules with similar functions or structural features. Gene families play a crucial role in determining the traits of plants and can be utilized to develop new crop varieties. Therefore, a comprehensive database of gene family is significant for gaining deep insight into crops. To address this need, we have developed CropGF (https://bis.zju.edu.cn/cropgf), a comprehensive visual platform that encompasses six important crops (rice, wheat, maize, barley, sorghum and foxtail millet) and one model plant (Arabidopsis), as well as genomics, transcriptomics and proteomics data for gene family mining and analysis, covering a total of 314 611 genes and 4399 types of domains. CropGF provides a versatile search system that allows for the identification of gene families and their members in a single crop or multiple crops. Users can customize their search based on gene family domains and/or homology using keywords or BLAST. To enhance usability, we have collected the corresponding ID information from various public databases for both genes and domains. Furthermore, CropGF comprises numerous downstream analysis modules, such as ka/ks analysis, phylogenetic tree construction, subcellular localization analysis and more. These visually-displayed modules provide intuitive insights into gene expression patterns, gene family expansion and functional relationships across different molecular levels and different species. We believe that CropGF will be a valuable resource for deep mining and analysis in future studies of crop gene families. Database URL https://bis.zju.edu.cn/cropgf.",
                "authors": [
                    {
                        "name": "Chao H."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Su M."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhu C."
                    }
                ],
                "citationCount": 3,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Database",
                "title": "CropGF: a comprehensive visual platform for crop gene family mining and analysis"
            },
            "pmcid": "PMC10325484",
            "pmid": "37410917"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
