{
    "additionDate": "2020-01-14T20:20:22Z",
    "biotoolsCURIE": "biotools:expression_variability",
    "biotoolsID": "expression_variability",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "jlee@uottawa.ca",
            "name": "Jonathan M. Lee",
            "orcidid": "https://orcid.org/0000-0002-7627-7829",
            "typeEntity": "Person"
        }
    ],
    "description": "Human gene expression variability and its dependence on methylation and aging.\n\nSource code for \"Human Gene Expression Variability and its Dependence on Methylation and Aging\".\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'BACKGROUND:Phenotypic', 'Hypo-Variability', 'sex-dependent', 'Hyper-Variability'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Treemap visualisation",
                    "uri": "http://edamontology.org/operation_2942"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nbashkeel/EV",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T20:20:22Z",
    "name": "expression variability",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6308-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Phenotypic variability of human populations is partly the result of gene polymorphism and differential gene expression. As such, understanding the molecular basis for diversity requires identifying genes with both high and low population expression variance and identifying the mechanisms underlying their expression control. Key issues remain unanswered with respect to expression variability in human populations. The role of gene methylation as well as the contribution that age, sex and tissue-specific factors have on expression variability are not well understood. Results: Here we used a novel method that accounts for sampling error to classify human genes based on their expression variability in normal human breast and brain tissues. We find that high expression variability is almost exclusively unimodal, indicating that variance is not the result of segregation into distinct expression states. Genes with high expression variability differ markedly between tissues and we find that genes with high population expression variability are likely to have age-, but not sex-dependent expression. Lastly, we find that methylation likely has a key role in controlling expression variability insofar as genes with low expression variability are likely to be non-methylated. Conclusions: We conclude that gene expression variability in the human population is likely to be important in tissue development and identity, methylation, and in natural biological aging. The expression variability of a gene is an important functional characteristic of the gene itself and the classification of a gene as one with Hyper-Variability or Hypo-Variability in a human population or in a specific tissue should be useful in the identification of important genes that functionally regulate development or disease.",
                "authors": [
                    {
                        "name": "Bashkeel N."
                    },
                    {
                        "name": "Perkins T.J."
                    },
                    {
                        "name": "Kaern M."
                    },
                    {
                        "name": "Lee J.M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-07T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Human gene expression variability and its dependence on methylation and aging"
            },
            "pmcid": "PMC6898959",
            "pmid": "31810449"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ]
}