{
    "additionDate": "2017-02-14T09:34:31Z",
    "biotoolsCURIE": "biotools:mmia",
    "biotoolsID": "mmia",
    "description": "Web server that integrates miRNA and mRNA expression data with predicted miRNA target information. It incorporates miRNA prediction algorithms (TargetScan, PITA, PicTar).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "microRNA detection",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://cancer.informatics.indiana.edu/mmia",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "MMIA",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "MicroRNAs (miRNAs) are small (19-24 nt), nonprotein-coding nucleic acids that regulate specific 'target' gene products via hybridization to mRNA transcripts, resulting in translational blockade or transcript degradation. Although miRNAs have been implicated in numerous developmental and adult diseases, their specific impact on biological pathways and cellular phenotypes, in addition to miRNA gene promoter regulation, remain largely unknown. To improve and facilitate research of miRNA functions and regulation, we have developed MMIA (microRNA and mRNA integrated analysis), a versatile and user-friendly web server. By incorporating three commonly used and accurate miRNA prediction algorithms, TargetScan, PITA and PicTar, MMIA integrates miRNA and mRNA expression data with predicted miRNA target information for analyzing miRNA-associated phenotypes and biological functions by gene set analysis, in addition to analysis of miRNA primary transcript gene promoters. To assign biological relevance to the integrated miRNA/mRNA profiles, MMIA uses exhaustive human genome coverage, including classification into various disease-associated genes as well as conventional canonical pathways and Gene Ontology. In summary, this novel web server (cancer.informatics.indiana.edu/mmia) will provide life science researchers with a valuable tool for the study of the biological (and pathological) causes and effects of the expression of this class of interesting protein regulators.",
                "authors": [
                    {
                        "name": "Nam S."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Choi K."
                    },
                    {
                        "name": "Balch C."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Nephew K.P."
                    }
                ],
                "citationCount": 131,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MicroRNA and mRNA integrated analysis (MMIA): A web tool for examining biological functions of microRNA expression"
            },
            "pmid": "19420067"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}