{
    "additionDate": "2021-01-18T12:34:02Z",
    "biotoolsCURIE": "biotools:dataman",
    "biotoolsID": "dataman",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tony.vanderweerden@agresearch.co.nz",
            "name": "Tony J. van der Weerden",
            "typeEntity": "Person"
        }
    ],
    "description": "DATAMAN is a global database of nitrous oxide and ammonia emission factors for excreta deposited by livestock and land-applied manure. The overall aim of DATAMAN is to provide access to the most up-to-date knowledge on managing manure GHG emissions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "http://www.dataman.co.nz",
    "lastUpdate": "2021-02-22T15:05:41Z",
    "name": "DATAMAN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/JEQ2.20186",
            "metadata": {
                "abstract": "© 2020 The Authors. Journal of Environmental Quality published by Wiley Periodicals LLC on behalf of American Society of Agronomy, Crop Science Society of America, and Soil Science Society of AmericaNitrous oxide (N2O), ammonia (NH3), and methane (CH4) emissions from the manure management chain of livestock production systems are important contributors to greenhouse gases (GHGs) and NH3 emitted by human activities. Several studies have evaluated manure-related emissions and associated key variables at regional, national, or continental scales. However, there have been few studies focusing on the drivers of these emissions using a global dataset. An international project was created (DATAMAN) to develop a global database on GHG and NH3 emissions from the manure management chain (housing, storage, and field) to identify key variables influencing emissions and ultimately to refine emission factors (EFs) for future national GHG inventories and NH3 emission reporting. This paper describes the “field” database that focuses on N2O and NH3 EFs from land-applied manure and excreta deposited by grazing livestock. We collated relevant information (EFs, manure characteristics, soil properties, and climatic conditions) from published peer-reviewed research, conference papers, and existing databases. The database, containing 5,632 observations compiled from 184 studies, was relatively evenly split between N2O and NH3 (56 and 44% of the EF values, respectively). The N2O data were derived from studies conducted in 21 countries on five continents, with New Zealand, the United Kingdom, Kenya, and Brazil representing 86% of the data. The NH3 data originated from studies conducted in 17 countries on four continents, with the United Kingdom, Denmark, Canada, and The Netherlands representing 79% of the data. Wet temperate climates represented 90% of the total database. The DATAMAN field database is available at http://www.dataman.co.nz.",
                "authors": [
                    {
                        "name": "Alfaro M.A."
                    },
                    {
                        "name": "Amon B."
                    },
                    {
                        "name": "Beltran I."
                    },
                    {
                        "name": "Grace P."
                    },
                    {
                        "name": "Hafner S."
                    },
                    {
                        "name": "Hassouna M."
                    },
                    {
                        "name": "Hutchings N."
                    },
                    {
                        "name": "Krol D.J."
                    },
                    {
                        "name": "Leytem A.B."
                    },
                    {
                        "name": "Noble A."
                    },
                    {
                        "name": "Salazar F."
                    },
                    {
                        "name": "Thorman R.E."
                    },
                    {
                        "name": "Velthof G.L."
                    },
                    {
                        "name": "de Klein C.A.M."
                    },
                    {
                        "name": "van der Weerden T.J."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Journal of Environmental Quality",
                "title": "DATAMAN: A global database of nitrous oxide and ammonia emission factors for excreta deposited by livestock and land-applied manure"
            },
            "pmid": "33331653"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}
