{
    "additionDate": "2024-01-26T10:47:19.201696Z",
    "biotoolsCURIE": "biotools:replaybg",
    "biotoolsID": "replaybg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Giacomo Cappon",
            "orcidid": "https://orcid.org/0000-0003-4358-9268"
        }
    ],
    "description": "A digital twin-based methodology to identify a personalized model from type 1 diabetes data and simulate glucose concentrations to assess alternative therapies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gcappon/replay-bg",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T14:19:43.420634Z",
    "license": "GPL-3.0",
    "name": "ReplayBG",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/tbme.2023.3286856",
            "metadata": {
                "abstract": "—Objective: Design and assessment of new therapies for type 1 diabetes (T1D) management can be greatly facilitated by in silico simulations. The ReplayBG simulation methodology here proposed allows “replaying” the scenario behind data already collected by simulating the glucose concentration obtained in response to alternative insulin/carbohydrate therapies and evaluate their efficacy leveraging the concept of digital twin. Methods: ReplayBG is based on two steps. First, a personalized model of glucose-insulin dynamics is identified using insulin, carbohydrate, and continuous glucose monitoring (CGM) data. Then, this model is used to simulate the glucose concentration that would have been obtained by “replaying” the same portion of data using a different therapy. The validity of the methodology was evaluated on 100 virtual subjects using the UVa/Padova T1D Simulator (T1DS). In particular, the glucose concentration traces simulated by ReplayBG are compared with those provided by T1DS in five different scenarios of insulin and carbohydrate treatment modifications. Furthermore, we compared ReplayBG with a state-of-the-art methodology for the scope. Finally, two case studies using real data are also presented. Results: ReplayBG simulates with high accuracy the effect of the considered insulin and carbohydrate treatment alterations, performing significantly better than state-of-art method in almost all considered situations. Conclusion: ReplayBG proved to be a reliable and robust tool to retrospectively explore the effect of new treatments for T1D on the glucose dynamics. It is freely available as open source software at https://github.com/gcappon/ replay-bg. Significance: ReplayBG offers a new approach to preliminary evaluate new therapies for T1D management before clinical trials.",
                "authors": [
                    {
                        "name": "Cappon G."
                    },
                    {
                        "name": "Del Favero S."
                    },
                    {
                        "name": "Facchinetti A."
                    },
                    {
                        "name": "Sparacino G."
                    },
                    {
                        "name": "Vettoretti M."
                    }
                ],
                "citationCount": 9,
                "date": "2023-11-01T00:00:00Z",
                "journal": "IEEE Transactions on Biomedical Engineering",
                "title": "ReplayBG: A Digital Twin-Based Methodology to Identify a Personalized Model From Type 1 Diabetes Data and Simulate Glucose Concentrations to Assess Alternative Therapies"
            },
            "pmid": "37368794"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
