{"credit":[{"email":"sdavis2@mail.nih.gov","name":"Sean Davis","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/GEOquery.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/GEOquery_2.40.0.tar.gz"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Data management","uri":"http://edamontology.org/topic_3071"}]},"link":[{"type":"MIRROR","url":"https://github.com/seandavi/GEOquery"}],"publication":[{"abstract":"Microarray technology has become a standard molecular biology tool. Experimental data have been generated on a huge number of organisms, tissue types, treatment conditions and disease states. The Gene Expression Omnibus (Barrett et al., 2005), developed by the National Center for Bioinformatics (NCBI) at the National Institutes of Health is a repository of nearly 140 000 gene expression experiments. The BioConductor project (Gentleman et al., 2004) is an open-source and open-development software project built in the R statistical programming environment (R Development core Team, 2005) for the analysis and comprehension of genomic data. The tools contained in the BioConductor project represent many state-of-the-art methods for the analysis of microarray and genomics data. We have developed a software tool that allows access to the wealth of information within GEO directly from BioConductor, eliminating many the formatting and parsing problems that have made such analyses labor-intensive in the past. The software, called GEOquery, effectively establishes a bridge between GEO and BioConductor. Easy access to GEO data from BioConductor will likely lead to new analyses of GEO data using novel and rigorous statistical and bioinformatic tools. Facilitating analyses and meta-analyses of microarray data will increase the efficiency with which biologically important conclusions can be drawn from published genomic data. © Published by Oxford University Press 2007.","authors":["Sean D.","Meltzer P.S."],"cit_count":342,"doi":"10.1093/bioinformatics/btm254","journal":"Bioinformatics","pmid":"17496320","title":"GEOquery: A bridge between the Gene Expression Omnibus (GEO) and BioConductor","type":"Primary","year":"2007-07-15"}],"summary":{"biotoolsCURIE":"biotools:geoquery","biotoolsID":"geoquery","description":"The NCBI Gene Expression Omnibus (GEO) is a public repository of microarray data. Given the rich and varied nature of this resource, it is only natural to want to apply BioConductor tools to these data. This tool is the bridge between GEO and BioConductor.","homepage":"http://bioconductor.org/packages/release/bioc/html/GEOquery.html","name":"GEOquery","version":["2.40.0"]}}