{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://lbm.ab.a.u-tokyo.ac.jp/~iwata/index_e.html"}],"documentation":[{"url":"http://lbm.ab.a.u-tokyo.ac.jp/~iwata/antmap/index.html#tutorial"}],"function":[{"operation":[{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]},{"operation":[{"term":"Linkage mapping","uri":"http://edamontology.org/operation_0282"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Linkage mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Linkage","uri":"http://edamontology.org/topic_0102"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Genetic linkage","uri":"http://edamontology.org/topic_0102"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/antmap-1-2-software-constructing-genetic-linkage-maps.html"}],"publication":[{"abstract":"High-throughput assay of molecular markers enables to utilize large amounts of markers in linkage mapping. To incorporate numerous markers into a linkage map, the development of a highly efficient method for linkage mapping is indispensable. When the number of loci is large, locus ordering is a major difficulty in linkage mapping, since the number of possible orders becomes very large. To address this problem, we developed a new algorithm for locus ordering and used it in a newly developed computer program called AntMap. The algorithm is based on ant colony optimization, which is a set of metaheuristic algorithms inspired by the cooperative behavior of real ants in finding the shortest path from their nest to a food source. Using this algorithm, AntMap seeks the linear order of loci that minimizes the sum of adjacent recombination fractions or that maximizes the log likelihood of locus order. Analyses based on simulated data sets indicated that our algorithm displayed a high efficiency level. The high performance of the algorithm enabled to save time and labor, and also to validate an estimated order by bootstrap tests. Our algorithm and AntMap should enable to construct high-throughput systems for linkage mapping. AntMap is available under a GNU general public license at http://cse.naro.affrc.go.jp/ iwatah/antmap/index.html. Source codes and executables of AntMap can be obtained there.","authors":["Iwata H.","Ninomiya S."],"cit_count":68,"doi":"10.1270/jsbbs.56.371","journal":"Breeding Science","title":"AntMap: Constructing genetic linkage maps using an ant colony optimization algorithm","type":"Primary","year":"2006-12-27"}],"summary":{"biotoolsCURIE":"biotools:antmap","biotoolsID":"antmap","description":"It is a software for constructing genetic linkage maps using an ant colony optimization algorithm. It seeks the linear order of loci that minimizes the sum of adjacent recombination fractions or that maximizes the log likelihood of locus order. Analyses based on simulated data sets indicated that the algorithm displayed a high efficiency level. The high performance of the algorithm enabled to save time and labor, and also to validate an estimated order by bootstrap tests.","homepage":"http://lbm.ab.a.u-tokyo.ac.jp/~iwata/antmap/index.html","name":"AntMap","version":["1.2"]}}