{
    "additionDate": "2020-01-09T18:21:52Z",
    "biotoolsCURIE": "biotools:ExaStoLog",
    "biotoolsID": "ExaStoLog",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "emmanuel.barillot@curie.fr",
            "name": "Emmanuel Barillot",
            "orcidid": "https://orcid.org/0000-0003-2724-2002",
            "typeEntity": "Person"
        },
        {
            "email": "mihaly.koltai@curie.fr",
            "name": "Mihály Koltai",
            "orcidid": "https://orcid.org/0000-0002-7341-5114",
            "typeEntity": "Person"
        }
    ],
    "description": "Exact calculation of stationary solution and parameter sensitivity analysis of stochastic continuous time Boolean models.\n\nAbstract Motivation Solutions to stochastic Boolean models are usually estimated by Monte Carlo simulations, but as the state space of these models can be enormous, there is an inherent uncertainty about the accuracy of Monte Carlo estimates and whether simulations have reached all asymptotic solutions. Moreover, these models have timescale parameters (transition rates) that the probability values of stationary solutions depend on in complex ways that have not been analyzed yet in the literature. These two fundamental uncertainties call for an exact calculation method for this class of models.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sysbio-curie/exact-stoch-log-mod",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-28T14:52:22Z",
    "license": "LGPL-3.0",
    "name": "ExaStoLog",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/794230"
        },
        {
            "doi": "10.1186/s12859-020-03548-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Solutions to stochastic Boolean models are usually estimated by Monte Carlo simulations, but as the state space of these models can be enormous, there is an inherent uncertainty about the accuracy of Monte Carlo estimates and whether simulations have reached all attractors. Moreover, these models have timescale parameters (transition rates) that the probability values of stationary solutions depend on in complex ways, raising the necessity of parameter sensitivity analysis. We address these two issues by an exact calculation method for this class of models. Results: We show that the stationary probability values of the attractors of stochastic (asynchronous) continuous time Boolean models can be exactly calculated. The calculation does not require Monte Carlo simulations, instead it uses graph theoretical and matrix calculation methods previously applied in the context of chemical kinetics. In this version of the asynchronous updating framework the states of a logical model define a continuous time Markov chain and for a given initial condition the stationary solution is fully defined by the right and left nullspace of the master equation's kinetic matrix. We use topological sorting of the state transition graph and the dependencies between the nullspaces and the kinetic matrix to derive the stationary solution without simulations. We apply this calculation to several published Boolean models to analyze the under-explored question of the effect of transition rates on the stationary solutions and show they can be sensitive to parameter changes. The analysis distinguishes processes robust or, alternatively, sensitive to parameter values, providing both methodological and biological insights. Conclusion: Up to an intermediate size (the biggest model analyzed is 23 nodes) stochastic Boolean models can be efficiently solved by an exact matrix method, without using Monte Carlo simulations. Sensitivity analysis with respect to the model's timescale parameters often reveals a small subset of all parameters that primarily determine the stationary probability of attractor states.",
                "authors": [
                    {
                        "name": "Barillot E."
                    },
                    {
                        "name": "Barillot E."
                    },
                    {
                        "name": "Barillot E."
                    },
                    {
                        "name": "Calzone L."
                    },
                    {
                        "name": "Calzone L."
                    },
                    {
                        "name": "Calzone L."
                    },
                    {
                        "name": "Koltai M."
                    },
                    {
                        "name": "Koltai M."
                    },
                    {
                        "name": "Koltai M."
                    },
                    {
                        "name": "Noel V."
                    },
                    {
                        "name": "Noel V."
                    },
                    {
                        "name": "Noel V."
                    },
                    {
                        "name": "Zinovyev A."
                    },
                    {
                        "name": "Zinovyev A."
                    },
                    {
                        "name": "Zinovyev A."
                    }
                ],
                "date": "2020-06-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Exact solving and sensitivity analysis of stochastic continuous time Boolean models"
            },
            "pmcid": "PMC7291460",
            "pmid": "32527218"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
