{
    "accessibility": "Open access",
    "additionDate": "2024-05-24T10:15:57.965434Z",
    "biotoolsCURIE": "biotools:mseqdr",
    "biotoolsID": "mseqdr",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "xgai@chla.usc.edu",
            "name": "Xiaowu Gai",
            "typeEntity": "Person"
        },
        {
            "name": "Lishuang Shen",
            "typeEntity": "Person"
        },
        {
            "name": "Marni J. Falk",
            "typeEntity": "Person"
        }
    ],
    "description": "The international Mitochondrial Disease Sequence Data Resource Consortium (MSeqDR) Quick-Mitome (QM) is a web-based platform enabling automated variant interpretation of whole-exome sequencing (WES) datasets for the genetic diagnosis of primary mitochondrial diseases (PMD).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://mseqdr.org/quickmitome.php",
    "lastUpdate": "2024-05-24T10:15:57.967824Z",
    "name": "MSeqDR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/cpz1.955",
            "metadata": {
                "abstract": "The international Mitochondrial Disease Sequence Data Resource Consortium (MSeqDR) Quick-Mitome (QM) is a web-based platform enabling automated variant interpretation of whole-exome sequencing (WES) datasets for the genetic diagnosis of primary mitochondrial diseases (PMD). Designed specifically to address the unique dual genome nature of PMD etiologies, QM includes features for both nuclear and mitochondrial DNA (mtDNA) genome analysis. QM requires VCF variant lists, HPO ID clinical phenotypes, and pedigree files for multiple-sample VCF inputs. QM maps phenotypes to HPO terms before analysis. QM analysis requires 2 to 20 min for 100,000 variants on an 8-vCPU AWS server using Exomiser's “PASS_ONLY” mode for nuclear variants. QM ranks variants based on allele frequency, phenotype-gene association, functional impact, and inheritance mode. Variants are further annotated with multiple data sources such as OMIM, ClinVar, dbNSFP, gnoMAD, MITOMAP, and MSeqDR. In addition to standard Exomiser results, QM generates an Analysis Report and QM Integrated Report with add-on mtDNA-specific analyses, including haplogroup prediction with Phy-Mer, heteroplasmy calculation, and mvTool annotations. We developed the Mitochondrial Disease Variant (MDV) classifier using XGBoost to predict variant pathogenicity for PMD. The MDV classifier was trained on >120 features and performance benchmarking showed that it correctly classified >98% of nuclear gene variants as being pathogenic or benign, and predicted PMD-causing variants with 94% precision. The MSeqDR QM server is an open-access resource for phenotype-driven dual-genome analyses for PMD diagnosis by the global mitochondrial disease community. It is publicly available for non-commercial, non-clinical research use at https://mseqdr.org/quickmitome.php. © 2024 Wiley Periodicals LLC. Basic Protocol 1: Standardizing clinical phenotypes into human phenotype ontology (HPO) terms as the phenotype input for Quick-Mitome (QM). Basic Protocol 2: Prepare the pedigree input for multiple-sample VCF. Basic Protocol 3: Quick-Mitome (QM) analysis. Basic Protocol 4: Reviewing and understanding the QM Integrated Report and Analysis Report.",
                "authors": [
                    {
                        "name": "Falk M.J."
                    },
                    {
                        "name": "Gai X."
                    },
                    {
                        "name": "Shen L."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Current Protocols",
                "title": "MSeqDR Quick-Mitome (QM): Combining Phenotype-Guided Variant Interpretation and Machine Learning Classifiers to Aid Primary Mitochondrial Disease Genetic Diagnosis"
            },
            "pmid": "38284225"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
