
{
    "credit": [
        {
            "email": "victor@softberry.com",
            "name": "Victor V. Solovyev",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "TERMS_OF_USE",
            "url": "http://www.softberry.com/berry.phtml?topic=termsofuse"
        },
        {
            "type": "GENERAL",
            "url": "http://www.softberry.com/berry.phtml?topic=promhg&group=help&subgroup=promoter"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Accurate prediction of promoters is fundamental for understanding gene expression patterns, cell specificity and development. In the studies of conserved features of regulatory regions of orthologous genes, it was observed that major promoter functional components such as transcription start points, TATA-boxes and regulatory motifs, are significantly more conservative than the sequences around them (70-100% compared with 30-50%). To improve promoter identification accuracy, we employed these findings in a new program, PromH, created by extending the TSSW program feature set. PromH uses linear discriminant functions that take into account conservation features and nucleotide sequences of promoter regions in pairs of orthologous genes. The program was tested on two sets of pairs of orthologous, mostly human and rodent, sequences with known transcription start sites (TSS), annotated to have TATA (21 genes, 11 orthologous pairs) and TATA-less (38 genes, 19 pairs) promoters, respectively. The program correctly predicted TSS for all 21 genes of the first set with a median deviation of 2 bp from true site location. Only for two genes, was there significant (46 and 105 bp) discrepancy between predicted and annotated TSS positions. For 38 TATA-less promoters from the second set, TSS was predicted for 27 genes, in 14 cases within 10 bp distance from annotated TSS, and in 21 cases - within 100 bp distance. Despite more discrepancies between predicted and annotated TSS for genes from the second set, these results are consistent with observations of much higher occurrence of multiple TSS in TATA-less promoters. In any case, our results show that PromH identifies TSS positions significantly more accurately than any other published promoter prediction method. The PromH program is available at http://www.softberry.com/berry.phtml?topic=promh.",
            "authors": [
                "Solovyev V.V.",
                "Shahmuradov I.A."
            ],
            "cit_count": 74,
            "journal": "Nucleic Acids Research",
            "pmid": "12824362",
            "title": "PromH: Promoters identification using orthologous genomic sequences",
            "year": "2003-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:promh",
        "biotoolsID": "promh",
        "description": "Predicts transcription start sites (TSS), TATA boxes, and transcription factor binding sites (TFBS) in promoter regions using pairs of orthologous sequences.",
        "homepage": "http://www.softberry.com/berry.phtml?topic=promhg&group=programs&subgroup=promoter",
        "name": "PromH"
    }
}