{
    "additionDate": "2018-06-20T15:36:29Z",
    "biotoolsCURIE": "biotools:qrcme",
    "biotoolsID": "qrcme",
    "credit": [
        {
            "email": "jhuang@bwh.harvard.edu",
            "name": "Jie Huang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "yunli@med.unc.edu",
            "name": "Yun Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Yun Li Statistical Genetics Group",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://yunliweb.its.unc.edu//contact.html"
        }
    ],
    "description": "Simple and reliable way to ensure that multiple DNA sequence data files represent the same individual person. This tool will identify any swaps that may have been made during wet lab processing or data file handling by ensuring that that two different DNA sequence data files represent the same person.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://qrcme.tech/Home/About"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://qrcme.tech/",
    "lastUpdate": "2024-11-25T14:42:58.081235Z",
    "name": "QR Concordance (QRC)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0182438",
            "metadata": {
                "abstract": "In the current precision medicine era, more and more samples get genotyped and sequenced. Both researchers and commercial companies expend significant time and resources to reduce the error rate. However, it has been reported that there is a sample mix-up rate of between 0.1% and 1%, not to mention the possibly higher mix-up rate during the down-stream genetic reporting processes. Even on the low end of this estimate, this translates to a significant number of mislabeled samples, especially over the projected one billion people that will be sequenced within the next decade. Here, we first describe a method to identify a small set of Single nucleotide polymorphisms (SNPs) that can uniquely identify a personal genome, which utilizes allele frequencies of five major continental populations reported in the 1000 genomes project and the ExAC Consortium. To make this panel more informative, we added four SNPs that are commonly used to predict ABO blood type, and another two SNPs that are capable of predicting sex. We then implement a web interface (http://qrcme.tech), nicknamed QRC (for QR code based Concordance check), which is capable of extracting the relevant ID SNPs from a raw genetic data, coding its genotype as a quick response (QR) code, and comparing QR codes to report the concordance of underlying genetic datasets. The resulting 80 fingerprinting SNPs represent a significant decrease in complexity and the number of markers used for genetic data labelling and tracking. Our method and web tool is easily accessible to both researchers and the general public who consider the accuracy of complex genetic data as a prerequisite towards precision medicine.",
                "authors": [
                    {
                        "name": "Du Y."
                    },
                    {
                        "name": "Geihs M."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Kong X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liu E.Y."
                    },
                    {
                        "name": "Martin J.S."
                    },
                    {
                        "name": "McGee J."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhou E.L."
                    }
                ],
                "citationCount": 7,
                "date": "2017-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A SNP panel and online tool for checking genotype concordance through comparing QR codes"
            },
            "pmcid": "PMC5604942",
            "pmid": "28926565",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1
}
