{
    "name": "IMTRBM", 
    "description": "Inferring MiRNA Targets based on Restricted Boltzmann Machines (IMTRBM) for prediction of miRNA-target interactions (MTIs).", 
    "homepage": "https://github.com/liuying201705/IMTRBM", 
    "biotoolsID": "IMTRBM", 
    "biotoolsCURIE": "biotools:IMTRBM", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0463", 
                    "term": "microRNA detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Script"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0659", 
            "term": "Functional, regulatory and non-coding RNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_3518", 
            "term": "Microarray experiment"
        }, 
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-seq"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": "Unlicense", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1109/JBHI.2018.2814609", 
            "pmid": "29993787", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Inferring MicroRNA targets based on restricted boltzmann machines", 
                "abstract": "© 2013 IEEE. Predicting the miRNA-target interactions (MTIs) is a critical task for elucidating mechanistic roles of miRNAs in pathophysiology. However, most existing techniques have a higher false positive because the precise miRNA target mechanisms are poorly known. Considering that ensemble methods can take advantage of the complementary knowledge in different methods, we propose an alternative optimization framework, Inferring MiRNA Targets based on Restricted Boltzmann Machines (IMTRBM), to enhance the accuracy of previous prediction results. First, the proposed method directly constructs a weighted MTI network though the results predicted by individual methods and each miRNA target pair is weighted based on the frequency appearing in these results. Second, we transform the miRNA-target prediction problem into a complete bipartite graph model, named restricted Boltzmann machine, and utilize a practical learning procedure to train our model and make predictions. Our results show that the algorithm outperforms individual miRNA-target prediction approach in the number of validated miRNA targets at cutoffs of top list. Moreover, our framework can tolerate the decrease and increase of predicted MTIs and even discover new miRNA targets, which have been a challenge to predict for any individual methods. Finally, for the miRNAs that are not appearing in IMTRBM, we design a new method to supplement IMTRBM based on the intuition that similar miRNAs have similar functions, which also achieves a comparable result. The source code of IMTRBM is available at https://github.com/liuying201705/IMTRBM.", 
                "date": "2019-01-01T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Liu Y."
                    }, 
                    {
                        "name": "Luo J."
                    }, 
                    {
                        "name": "Ding P."
                    }
                ], 
                "journal": "IEEE Journal of Biomedical and Health Informatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Y. Liu", 
            "email": null, 
            "url": "https://github.com/liuying201705", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "Ruta", 
    "additionDate": "2019-06-01T14:21:07Z", 
    "lastUpdate": "2019-06-01T14:22:37Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}