{"credit":[{"email":"sekretariat@mucosa.de","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.ikmb.uni-kiel.de/resources/download-tools/software/genomizer"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"},{"term":"Genome visualisation","uri":"http://edamontology.org/operation_3208"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows"],"toolType":["Desktop application"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/genomizer-1-2-0-analysis-genome-wide-association-experiments.html"}],"publication":[{"abstract":"Genome-wide association analysis appears to be a promising way to identify heritable susceptibility factors for complex human disorders. However, the feasibility of large-scale genotyping experiments is currently limited by an incomplete marker coverage of the genome, a restricted understanding of the functional role of given genomic regions, and the small sample sizes used. Thus, genome-wide association analysis will be a screening tool to facilitate subsequent gene discovery rather than a means to completely resolve individual genetic risk profiles. The validation of association findings will continue to rely upon the replication of \"leads\" in independent samples from either the same or different populations. Even under such pragmatic conditions, the timely analysis of the large data sets in question poses serious technical challenges. We have therefore developed public-domain software, GENOMIZER, that implements the workflow of an association experiment, including data management, single-point and haplotype analysis, \"lead\" definition, and data visualization. GENOMIZER (www.ikmb.uni-kiel.de/genomizer) comes with a complete user manual, and is open-source software licensed under the GNU Lesser General Public License. We suggest that the use of this software will facilitate the handling and interpretation of the currently emerging genome-wide association data. © 2006 Wiley-Liss, Inc.","authors":["Franke A.","Wollstein A.","Teuber M.","Wittig M.","Lu T.","Hoffmann K.","Nurnberg P.","Krawczak M.","Schreiber S.","Hampe J."],"cit_count":16,"journal":"Human Mutation","pmid":"16652332","title":"GENOMIZER: An integrated analysis system for genome-wide association data","year":"2006-06-01"}],"summary":{"biotoolsCURIE":"biotools:genomizer","biotoolsID":"genomizer","description":"Platform independent Java program for the analysis of genome wide association experiments. The software implements the workflow of an association experiment, including data management, single-point and haplotype analysis, “lead” definition, and data visualization.","homepage":"http://www.ikmb.uni-kiel.de/resources/download-tools/software/genomizer","name":"Genomizer"}}