{
    "additionDate": "2021-10-04T11:50:46.875365Z",
    "biotoolsCURIE": "biotools:linflow",
    "biotoolsID": "linflow",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vinatzer@vt.edu",
            "name": "Boris A. Vinatzer",
            "orcidid": "https://orcid.org/0000-0003-4612-225X",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "LINflow a computational pipeline that combines an alignment-free with an alignment-based method to accelerate generation of similarity matrices for prokaryotic genomes.  Genomic similarity was first computed as Average Nucleotide Identity (ANI) values based on the alignment of genomic fragments.",
    "download": [
        {
            "type": "Biological data",
            "url": "https://code.vt.edu/linbaseproject/linflow_datasets"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "https://code.vt.edu/linbaseproject/LINflow/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-04T11:51:55.334759Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://code.vt.edu/linbaseproject/LINflow/-/issues"
        }
    ],
    "name": "LINflow",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.10906",
            "metadata": {
                "abstract": "Copyright 2021 Tian et al.Background: Computing genomic similarity between strains is a prerequisite for genome-based prokaryotic classification and identification. Genomic similarity was first computed as Average Nucleotide Identity (ANI) values based on the alignment of genomic fragments. Since this is computationally expensive, faster and computationally cheaper alignment-free methods have been developed to estimate ANI. However, these methods do not reach the level of accuracy of alignment-based methods. Methods: Here we introduce LINflow, a computational pipeline that infers pairwise genomic similarity in a set of genomes. LINflow takes advantage of the speed of the alignment-free sourmash tool to identify the genome in a dataset that is most similar to a query genome and the precision of the alignment-based pyani software to precisely compute ANI between the query genome and the most similar genome identified by sourmash. This is repeated for each new genome that is added to a dataset. The sequentially computed ANI values are stored as Life Identification Numbers (LINs), which are then used to infer all other pairwise ANI values in the set. We tested LINflow on four sets, 484 genomes in total, and compared the needed time and the generated similarity matrices with other tools. Results: LINflow is up to 150 times faster than pyani and pairwise ANI values generated by LINflow are highly correlated with those computed by pyani. However, because LINflow infers most pairwise ANI values instead of computing them directly, ANI values occasionally depart from the ANI values computed by pyani. In conclusion, LINflow is a fast and memory-efficient pipeline to infer similarity among a large set of prokaryotic genomes. Its ability to quickly add new genome sequences to an already computed similarity matrix makes LINflow particularly useful for projects when new genome sequences need to be regularly added to an existing dataset.",
                "authors": [
                    {
                        "name": "Tian L."
                    },
                    {
                        "name": "Mazloom R."
                    },
                    {
                        "name": "Heath L.S."
                    },
                    {
                        "name": "Vinatzer B.A."
                    }
                ],
                "date": "2021-03-24T00:00:00Z",
                "journal": "PeerJ",
                "title": "LINflow: a computational pipeline that combines an alignment-free with an alignment-based method to accelerate generation of similarity matrices for prokaryotic genomes"
            },
            "pmcid": "PMC8000461",
            "pmid": "33828908",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}