
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://shmulevich.systemsbiology.net/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://xerad.systemsbiology.net/simcluster/tutorial.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/simcluster-0-9-2-clustering-enumeration-gene-expression-data-simplex-space.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Transcript enumeration methods such as SAGE, MPSS, and sequencing-by-synthesis EST \"digital northern\", are important high-throughput techniques for digital gene expression measurement. As other counting or voting processes, these measurements constitute compositional data exhibiting properties particular to the simplex space where the summation of the components is constrained. These properties are not present on regular Euclidean spaces, on which hybridization-based microarray data is often modeled. Therefore, pattern recognition methods commonly used for microarray data analysis may be non-informative for the data generated by transcript enumeration techniques since they ignore certain fundamental properties of this space. Results: Here we present a software tool, Simcluster, designed to perform clustering analysis for data on the simplex space. We present Simcluster as a stand-alone command-line C package and as a user-friendly on-line tool. Both versions are available at: http://xerad.systemsbiology.net/simcluster. Conclusion: Simcluster is designedin accordance with a well-established mathematical framework for compositional data analysis, which provides principled procedures for dealing with the simplex space, and is thus applicable in a number of contexts, including enumeration-based gene expression data. © 2007 Vêncio et al; licensee BioMed Central Ltd.",
            "authors": [
                "Vencio R.Z.N.",
                "Varuzza L.",
                "Pereira C.A. de B.",
                "Brentani H.",
                "Shmulevich I."
            ],
            "cit_count": 10,
            "journal": "BMC Bioinformatics",
            "pmid": "17625017",
            "title": "Simcluster: Clustering enumeration gene expression data on the simplex space",
            "year": "2007-07-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:simcluster",
        "biotoolsID": "simcluster",
        "description": "A package for clustering analysis of transcript enumeration data on the simplex space.",
        "homepage": "http://xerad.systemsbiology.net/simcluster/",
        "name": "Simcluster"
    }
}