{"credit":[],"function":[{"operation":[{"term":"Quantification","uri":"http://edamontology.org/operation_3799"}]}],"labels":{"topic":[{"term":"Psychiatry","uri":"http://edamontology.org/topic_3419"},{"term":"Paediatrics","uri":"http://edamontology.org/topic_3418"},{"term":"Preclinical and clinical studies","uri":"http://edamontology.org/topic_3379"}]},"publication":[{"abstract":"Copyright © 2019 Society for the Study of School Psychology. Published by Elsevier Ltd. All rights reserved.Treatment engagement is a significant challenge in school mental health services. Despite a growing evidence base on effective interventions for treatment engagement, attempts to address these challenges rarely leverage the available relevant research. To close this gap, this pilot study examined the feasibility, acceptability, and initial implementation outcomes of a coordinated knowledge system (CKS) designed to support the efforts of school mental health (SMH) professionals to address treatment engagement challenges. A sample of four supervisors and their supervisees (n = 17) with master's of social work degrees serving youth within an urban SMH program were randomly assigned to either (a) a CKS condition that offered a unified set of resources to structure decisions about treatment engagement or (b) a survey plus practice guidelines (SPG) condition, in which resources were provided without an explicit model for their coordinated use. Feasibility was assessed quantitatively, acceptability was assessed quantitatively and qualitatively, and initial implementation outcomes were evaluated using a behavioral observation coding system. Results provided strong support for the feasibility and acceptability of the study design, instrumentation, and interventions. It appears that the CKS can be feasibly implemented with good acceptability. Patterns of initial implementation strongly suggested that, relative to the SPG, the CKS supports identification of engagement problems as well as intervention selection and planning. Findings also identified modifications to study procedures that would be necessary in a future study. A larger trial using similar methodology and instrumentation could yield important findings about the effectiveness of the CKS in clinical practice and could articulate the mechanisms by which it operates.","authors":["Becker K.D.","Park A.L.","Boustani M.M.","Chorpita B.F."],"cit_count":2,"doi":"10.1016/J.JSP.2019.07.013","journal":"Journal of school psychology","pmid":"31759471","title":"A pilot study to examine the feasibility and acceptability of a coordinated intervention design to address treatment engagement challenges in school mental health services","year":"2019-10-01"}],"summary":{"biotoolsCURIE":"biotools:CKS","biotoolsID":"CKS","description":"A pilot study to examine the feasibility and acceptability of a coordinated intervention design to address treatment engagement challenges in school mental health services.\n\nTreatment engagement is a significant challenge in school mental health services. Despite a growing evidence base on effective interventions for treatment engagement, attempts to address these challenges rarely leverage the available relevant research. To close this gap, this pilot study examined the feasibility, acceptability, and initial implementation outcomes of a coordinated knowledge system (CKS) designed to support the efforts of school mental health (SMH) professionals to address treatment engagement challenges.\n\n||| HOMEPAGE MISSING!","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31759471","name":"CKS"}}