{
    "additionDate": "2018-06-01T15:22:23Z",
    "biotoolsCURIE": "biotools:drl4cellmovement",
    "biotoolsID": "drl4cellmovement",
    "credit": [
        {
            "email": "dwang7@utk.edu",
            "name": "Dali Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "baoz@mskcc.org",
            "name": "Zhirong Bao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Deep reinforcement learning of cell movement in the early stage of C.elegans embryogenesis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/zwang84/drl4cellmovement"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zwang84/drl4cellmovement",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "drl4cellmovement",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty323",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved. Motivation: Cell movement in the early phase of Caenorhabditis elegans development is regulated by a highly complex process in which a set of rules and connections are formulated at distinct scales. Previous efforts have demonstrated that agent-based, multi-scale modeling systems can integrate physical and biological rules and provide new avenues to study developmental systems. However, the application of these systems to model cell movement is still challenging and requires a comprehensive understanding of regulatory networks at the right scales. Recent developments in deep learning and reinforcement learning provide an unprecedented opportunity to explore cell movement using 3D time-lapse microscopy images. Results: We present a deep reinforcement learning approach within an agent-based modeling system to characterize cell movement in the embryonic development of C.elegans. Our modeling system captures the complexity of cell movement patterns in the embryo and overcomes the local optimization problem encountered by traditional rule-based, agent-based modeling that uses greedy algorithms. We tested our model with two real developmental processes: the anterior movement of the Cpaaa cell via intercalation and the rearrangement of the superficial left-right asymmetry. In the first case, the model results suggested that Cpaaa’s intercalation is an active directional cell movement caused by the continuous effects from a longer distance (farther than the length of two adjacent cells), as opposed to a passive movement caused by neighbor cell movements. In the second case, a leader-follower mechanism well explained the collective cell movement pattern in the asymmetry rearrangement. These results showed that our approach to introduce deep reinforcement learning into agent-based modeling can test regulatory mechanisms by exploring cell migration paths in a reverse engineering perspective. This model opens new doors to explore the large datasets generated by live imaging.",
                "authors": [
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Bao Z."
                    }
                ],
                "date": "2018-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Deep reinforcement learning of cell movement in the early stage of C.elegans embryogenesis"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}