{
    "additionDate": "2019-11-14T20:06:02Z",
    "biotoolsCURIE": "biotools:MESSA",
    "biotoolsID": "MESSA",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "archana.bhat@utsouthwestern.edu",
            "name": "Archana S. Bhat",
            "typeEntity": "Person"
        },
        {
            "email": "grishin@chop.swmed.edu",
            "name": "Nick V. Grishin",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | Predicting Sequence Features, Function, and Structure of Proteins Using MESSA | MEta-Server for protein Sequence Analysis (MESSA) is a tool that facilitates widespread protein sequence analysis by gathering structural (local sequence properties and three-dimensional structure) and functional (annotations from SWISS-PROT, Gene Ontology terms, and enzyme classification) predictions for a query protein of interest. MESSA uses multiple well-established tools to offer consensus-based predictions on important aspects of protein sequence analysis. Being freely available for noncommercial users and with a user-friendly interface, MESSA serves as an umbrella platform that overcomes the absence of a comprehensive tool for predictive protein analysis. This article reveals how to access MESSA via the Web and shows how to input a protein sequence to analyze using the MESSA web server",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31524991",
    "lastUpdate": "2019-11-14T20:06:02Z",
    "name": "MESSA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/CPBI.84",
            "metadata": {
                "abstract": "© 2019 John Wiley & Sons, Inc.MEta-Server for protein Sequence Analysis (MESSA) is a tool that facilitates widespread protein sequence analysis by gathering structural (local sequence properties and three-dimensional structure) and functional (annotations from SWISS-PROT, Gene Ontology terms, and enzyme classification) predictions for a query protein of interest. MESSA uses multiple well-established tools to offer consensus-based predictions on important aspects of protein sequence analysis. Being freely available for noncommercial users and with a user-friendly interface, MESSA serves as an umbrella platform that overcomes the absence of a comprehensive tool for predictive protein analysis. This article reveals how to access MESSA via the Web and shows how to input a protein sequence to analyze using the MESSA web server. It also includes a detailed explanation of the output from MESSA to aid in better interpretation of results. © 2019 by John Wiley & Sons, Inc.",
                "authors": [
                    {
                        "name": "Bhat A.S."
                    },
                    {
                        "name": "Grishin N.V."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Current Protocols in Bioinformatics",
                "title": "Predicting Sequence Features, Function, and Structure of Proteins Using MESSA"
            },
            "pmcid": "PMC6750024",
            "pmid": "31524991"
        }
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}