{
    "accessibility": [],
    "additionDate": "2017-02-10T11:35:19Z",
    "biotoolsCURIE": "biotools:dnannotator",
    "biotoolsID": "dnannotator",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [],
    "description": "Tool that performs de novo annotation of SNPs, STSs, and exons. It also allows for the migration of user-defined annotations onto different versions of genomic sequences (&lt,30Kb size limit).",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://bioapp.psych.uic.edu/DNannotator.htm",
    "homepage_status": 1,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:39Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "DNannotator",
    "operatingSystem": [],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Sequence annotation is essential for genomics-based research. Investigators of a specific genomic region who have developed abundant local discoveries such as genes and genetic markers, or have collected annotations from multiple resources, can be overwhelmed by the difficulty in creating local annotation and the complexity of integrating all the annotations. Presenting such integrated data in a form suitable for data mining and high-throughput experimental design is even more daunting. DNannotator, a web application, was designed to perform batch annotation on a sizeable genomic region. It takes annotation source data, such as SNPs, genes, primers, and so on, prepared by the end-user and/or a specified target of genomic DNA, and performs de novo annotation. DNannotator can also robustly migrate existing annotations in GenBank format from one sequence to another. Annotation results are provided in GenBank format and in tab-delimited text, which can be imported and managed in a database or spread-sheet and combined with existing annotation as desired. Graphic viewers, such as Genome Browser or Artemis, can display the annotation results. Reference data (reports on the process) facilitating the user's evaluation of annotation quality are optionally provided. DNannotator can be accessed at http://sky.bsd.uchicago.edu/DNannotator.htm.",
                "authors": [
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Bonner T.I."
                    },
                    {
                        "name": "Nguyen T."
                    },
                    {
                        "name": "Lyons J.L."
                    },
                    {
                        "name": "Christian S.L."
                    },
                    {
                        "name": "Gershon E.S."
                    }
                ],
                "citationCount": 4,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DNannotator: Annotation software tool kit for regional genomic sequences"
            },
            "note": null,
            "pmcid": null,
            "pmid": "12824405",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Summary: Publicly available single nucleotide polymorphism (SNP) allele frequencies are an important resource for the selection of genetic markers that may be most useful for gene mapping and association studies. Data mining these allele frequencies through disparate public databases and Websites is time consuming and can result in inconsistent findings. We have developed a web-based software tool, Frequency Finder, to acquire SNP allele frequencies from multiple public data sources and return a summarized result to the user. Our software optimizes and automates the search of candidate markers, decreasing the amount of time it would take to extract pertinent data manually. We have included several methods to output the data, including on-screen and as a compressed text file. We show that Frequency Finder accurately retrieves available frequency data from the available sources. Using this tool, we detect significant differences between Asian, African and Caucasian populations in the allele frequency spectra of 246 097 SNPs. While limited to public databases that provide web-based access to allele frequencies, Frequency Finder provides a single, user-friendly interface for retrieving allele frequencies for large batches of SNPs from multiple data sources. © Oxford University Press 2004; All rights reserved.",
                "authors": [
                    {
                        "name": "Nguyen T.H."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Gershon E.S."
                    },
                    {
                        "name": "McMahon F.J."
                    }
                ],
                "citationCount": 7,
                "date": "2004-02-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Frequency Finders: A multi-source web application for collection of public allele frequencies of SNP markers"
            },
            "note": null,
            "pmcid": null,
            "pmid": "14960477",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1,
    "version": []
}