{
    "accessibility": "Open access",
    "additionDate": "2022-03-09T12:46:25.018553Z",
    "biotoolsCURIE": "biotools:webtwas",
    "biotoolsID": "webtwas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "orcidid": "https://orcid.org/0000-0001-6406-1142",
            "typeEntity": "Person"
        },
        {
            "name": "Devin Kwok"
        },
        {
            "name": "Jianhua Wang"
        },
        {
            "name": "Chen Cao",
            "orcidid": "https://orcid.org/0000-0001-5343-808X"
        },
        {
            "name": "Zilong Zhang",
            "orcidid": "https://orcid.org/0000-0002-4934-1258"
        }
    ],
    "description": "The webTWAS integrates large number of GWAS summary level data for disease, and this number will be constantly increasing according to our timely curation. The webTWAS calculates the causal genes using single tissue expression imputation (MetaXcan and FUSION) or cross-tissue expression imputation (UTMOST) methods. Users can compare causal relations on gene-level and trait-level across studies of distinct sample size or population. In addition, users can upload their own GWAS summary statistic data and select the model to perform the customed TWAS analysis. Currently, we provide six models and the number of models will also be constantly increasing according to the development of TWAS research. The objective of this database is to ensure that its convenience and precision for researchers to select and prioritize causal genes for further study. In addition, our web could popularize TWAS in analysis by letting users easily applying TWAS tools online.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.webtwas.net",
    "lastUpdate": "2022-03-09T12:46:25.021228Z",
    "name": "webTWAS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB957",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press on behalf of Nucleic Acids Research.The development of transcriptome-wide association studies (TWAS) has enabled researchers to better identify and interpret causal genes in many diseases. However, there are currently no resources providing a comprehensive listing of gene-disease associations discovered by TWAS from published GWAS summary statistics. TWAS analyses are also difficult to conduct due to the complexity of TWAS software pipelines. To address these issues, we introduce a new resource called webTWAS, which integrates a database of the most comprehensive disease GWAS datasets currently available with credible sets of potential causal genes identified by multiple TWAS software packages. Specifically, a total of 235 064 gene-diseases associations for a wide range of human diseases are prioritized from 1298 high-quality downloadable European GWAS summary statistics. Associations are calculated with seven different statistical models based on three popular and representative TWAS software packages. Users can explore associations at the gene or disease level, and easily search for related studies or diseases using the MeSH disease tree. Since the effects of diseases are highly tissue-specific, webTWAS applies tissue-specific enrichment analysis to identify significant tissues. A user-friendly web server is also available to run custom TWAS analyses on user-provided GWAS summary statistics data. webTWAS is freely available at http://www.webtwas.net.",
                "authors": [
                    {
                        "name": "Cao C."
                    },
                    {
                        "name": "Cui F."
                    },
                    {
                        "name": "Kwok D."
                    },
                    {
                        "name": "Li M.J."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhao D."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-07T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "webTWAS: a resource for disease candidate susceptibility genes identified by transcriptome-wide association study"
            },
            "pmcid": "PMC8728162",
            "pmid": "34669946"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
