{
    "additionDate": "2017-01-13T13:13:41Z",
    "biotoolsCURIE": "biotools:bcbio-nextgen",
    "biotoolsID": "bcbio-nextgen",
    "credit": [
        {
            "email": "chapmanb@fastmail.com",
            "name": "Brad Chapman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Python scripts and modules for automated next gen sequencing analysis. These provide a fully automated pipeline for taking sequencing results from an Illumina sequencer, converting them to standard Fastq format, aligning to a reference genome, doing SNP calling, and producing a summary PDF of results.",
    "documentation": [
        {
            "type": "General",
            "url": "https://bcbio-nextgen.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chapmanb/bcbb/blob/master/nextgen/README.md",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "Bcbio-nextgen",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv061",
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Omics Pipe (http://sulab.scripps.edu/omicspipe) is a computational framework that automates multi-omics data analysis pipelines on high performance compute clusters and in the cloud. It supports best practice published pipelines for RNA-seq, miRNA-seq, Exome-seq, Whole- Genome sequencing, ChIP-seq analyses and automatic processing of data from The Cancer Genome Atlas (TCGA). Omics Pipe provides researchers with a tool for reproducible, open source and extensible next generation sequencing analysis. The goal of Omics Pipe is to democratize next-generation sequencing analysis by dramatically increasing the accessibility and reproducibility of best practice computational pipelines, which will enable researchers to generate biologically meaningful and interpretable results. Results: Using Omics Pipe, we analyzed 100 TCGA breast invasive carcinoma paired tumor-normal datasets based on the latest UCSC hg19 RefSeq annotation. Omics Pipe automatically downloaded and processed the desired TCGA samples on a high throughput compute cluster to produce a results report for each sample. We aggregated the individual sample results and compared them to the analysis in the original publications. This comparison revealed high overlap between the analyses, as well as novel findings due to the use of updated annotations and methods. Availability and implementation: Source code for Omics Pipe is freely available on the web (https://bitbucket.org/sulab/omics-pipe). Omics Pipe is distributed as a standalone Python package for installation (https://pypi.python.org/pypi/omics-pipe) and as an Amazon Machine Image in Amazon Web Services Elastic Compute Cloud that contains all necessary third-party software dependencies and databases (https://pythonhosted.org/omics-pipe/AWS-installation.html).",
                "authors": [
                    {
                        "name": "Fisch K.M."
                    },
                    {
                        "name": "Meissner T."
                    },
                    {
                        "name": "Gioia L."
                    },
                    {
                        "name": "Ducom J.-C."
                    },
                    {
                        "name": "Carland T.M."
                    },
                    {
                        "name": "Loguercio S."
                    },
                    {
                        "name": "Su A.I."
                    }
                ],
                "citationCount": 27,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Omics Pipe: A community-based framework for reproducible multi-omics data analysis"
            },
            "type": "Review"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}