{
    "additionDate": "2018-08-05T09:07:57Z",
    "biotoolsCURIE": "biotools:metacomp",
    "biotoolsID": "metacomp",
    "credit": [
        {
            "email": "ylsrommel@gmail.com",
            "name": "Longshu Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hqzhu@pku.edu.cn",
            "name": "Huaiqiu Zhu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zhaipeng2006@gmail.com",
            "name": "Peng Zhai",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for meta-omics comparative analysis.",
    "documentation": [
        {
            "type": "General",
            "url": "http://cqb.pku.edu.cn/ZhuLab/MetaComp/manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sample visualisation",
                    "uri": "http://edamontology.org/operation_3744"
                },
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://cqb.pku.edu.cn/ZhuLab/MetaComp/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "MetaComp",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1849-8",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: During the past decade, the development of high throughput nucleic sequencing and mass spectrometry analysis techniques have enabled the characterization of microbial communities through metagenomics, metatranscriptomics, metaproteomics and metabolomics data. To reveal the diversity of microbial communities and interactions between living conditions and microbes, it is necessary to introduce comparative analysis based upon integration of all four types of data mentioned above. Comparative meta-omics, especially comparative metageomics, has been established as a routine process to highlight the significant differences in taxon composition and functional gene abundance among microbiota samples. Meanwhile, biologists are increasingly concerning about the correlations between meta-omics features and environmental factors, which may further decipher the adaptation strategy of a microbial community. Results: We developed a graphical comprehensive analysis software named MetaComp comprising a series of statistical analysis approaches with visualized results for metagenomics and other meta-omics data comparison. This software is capable to read files generated by a variety of upstream programs. After data loading, analyses such as multivariate statistics, hypothesis testing of two-sample, multi-sample as well as two-group sample and a novel function-regression analysis of environmental factors are offered. Here, regression analysis regards meta-omic features as independent variable and environmental factors as dependent variables. Moreover, MetaComp is capable to automatically choose an appropriate two-group sample test based upon the traits of input abundance profiles. We further evaluate the performance of its choice, and exhibit applications for metagenomics, metaproteomics and metabolomics samples. Conclusion: MetaComp, an integrative software capable for applying to all meta-omics data, originally distills the influence of living environment on microbial community by regression analysis. Moreover, since the automatically chosen two-group sample test is verified to be outperformed, MetaComp is friendly to users without adequate statistical training. These improvements are aiming to overcome the new challenges under big data era for all meta-omics data. MetaComp is available at: http://cqb.pku.edu.cn/ZhuLab/MetaComp/ and https://github.com/pzhaipku/MetaComp/.",
                "authors": [
                    {
                        "name": "Zhai P."
                    },
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zhu H."
                    }
                ],
                "citationCount": 4,
                "date": "2017-10-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MetaComp: Comprehensive analysis software for comparative meta-omics including comparative metagenomics"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}