{
    "accessibility": "Open access",
    "additionDate": "2022-11-15T08:03:53.759689Z",
    "biotoolsCURIE": "biotools:nanocross",
    "biotoolsID": "nanocross",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Zhiyan Zhang"
        },
        {
            "name": "Zuoquan Chen"
        }
    ],
    "description": "A pipeline that detecting recombinant crossover using ONT sequencing data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zuoquanchen/NanoCross",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2022-11-15T08:03:53.762206Z",
    "license": "Other",
    "name": "NanoCross",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.YGENO.2022.110499",
            "metadata": {
                "abstract": "© 2022 The AuthorsMeiotic recombination is crucial for eukaryotes but varies among taxonomic scales (between individuals, groups, species, etc.) and genome resolutions. Studying how and why recombination rates change can help us understand the molecular basis and mechanisms of genetics and evolution. We introduce a genome-wide identification script called NanoCross, which uses ONT sequences to detect pooled gamete DNA cross recombination events. NanoCross first reduced sequencing errors and then constructed individual haplotypes based on homopolymer-filtered ONT sequences. Then, each molecule read is used to estimate cross recombination. In the case of moderate heterozygous variation density and sequencing depth, simulations revealed that our technique offers a good level of sensitivity and specificity. We constructed a high-resolution recombination map of wild boar genomes using NanoCross and compared it to recombination maps of male breeding pig populations. NanoCross provides us with a method and scripts for constructing a high-resolution individual genome recombination map utilizing long-read sequencing, as well as a novel approach for examining the variation in individual recombination rate. The source code and data mechanism are hosted on GitHub (https://github.com/zuoquanchen/NanoCross).",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Tang X."
                    },
                    {
                        "name": "Xie L."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "date": "2022-11-01T00:00:00Z",
                "journal": "Genomics",
                "title": "NanoCross: A pipeline that detecting recombinant crossover using ONT sequencing data"
            },
            "pmid": "36174880"
        }
    ],
    "toolType": [
        "Script",
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA replication and recombination",
            "uri": "http://edamontology.org/topic_3127"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
