{
    "accessibility": "Open access",
    "additionDate": "2022-02-11T20:03:10.535026Z",
    "biotoolsCURIE": "biotools:bexis2",
    "biotoolsID": "bexis2",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "roman.gerlach@uni-jena.de",
            "name": "Roman Gerlach",
            "orcidid": "https://orcid.org/0000-0001-5104-4247",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact",
                "Support"
            ],
            "url": "https://www.uni-jena.de/en/"
        },
        {
            "email": "jitendra.gaikwad@uni-jena.de",
            "name": "Jitendra Gaikwad",
            "orcidid": "https://orcid.org/0000-0002-7565-4389",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact",
                "Support"
            ],
            "url": "https://www.uni-jena.de/en/"
        },
        {
            "email": "chamanara@l3s.de",
            "name": "Javad Chamanara",
            "orcidid": "https://orcid.org/0000-0001-6390-1584",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "birgitta.koenig-ries@uni-jena.de",
            "name": "Birgitta König-Ries",
            "orcidid": "https://orcid.org/0000-0002-2382-9722",
            "typeEntity": "Person",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.uni-jena.de/en/"
        }
    ],
    "description": "BEXIS2 is an open-source community-driven research data management system to support research data management needs of mid to large-scale research projects with multiple sub-projects and up to several hundred researchers. It is a modular and extensible system providing a range of functions to realise the complete data lifecycle from data structure design to data collection, data discovery, dissemination, integration, quality assurance and research planning. Also, it’s an extensible and customisable system that allows for the development of new functions and customisation of its various components from database schemas to the user interface layout, elements and look and feel. BEXIS2 support making research data compatible with Findable, Accessible, Interoperable and Reusable (FAIR) data principles.  The software is developed based on requirements of the biodiversity and ecology domain that mostly deal with tabular data but is generic enough to serve other domains and data types as well.",
    "documentation": [
        {
            "note": "BEXIS2 Tech Talks are available at https://www.youtube.com/channel/UC_yQqVdDxYoygk6snNcuAmw\n\nBEXIS2 demo website- https://demo.bexis2.uni-jena.de/",
            "type": [
                "Installation instructions",
                "General",
                "Release notes",
                "API documentation"
            ],
            "url": "https://github.com/BEXIS2"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/BEXIS2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://bexis2.uni-jena.de/",
    "language": [
        "C#",
        "JavaScript"
    ],
    "lastUpdate": "2022-02-11T20:19:55.522781Z",
    "license": "LGPL-3.0",
    "link": [
        {
            "type": [
                "Repository",
                "Issue tracker"
            ],
            "url": "https://github.com/BEXIS2"
        }
    ],
    "maturity": "Mature",
    "name": "BEXIS2",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "bexis2_rdm",
    "publication": [
        {
            "doi": "10.3897/BDJ.9.e72901",
            "metadata": {
                "abstract": "© 2021. Chamanara J et al.Background Obtaining fit-to-use data associated with diverse aspects of biodiversity, ecology and environment is challenging since often it is fragmented, sub-optimally managed and available in heterogeneous formats. Recently, with the universal acceptance of the FAIR data principles, the requirements and standards of data publications have changed substantially. Researchers are encouraged to manage the data as per the FAIR data principles and ensure that the raw data, metadata, processed data, software, codes and associated material are securely stored and the data be made available with the completion of the research. New information We have developed BEXIS2 as an open-source community-driven web-based research data management system to support research data management needs of mid to large-scale research projects with multiple sub-projects and up to several hundred researchers. BEXIS2 is a modular and extensible system providing a range of functions to realise the complete data lifecycle from data structure design to data collection, data discovery, dissemination, integration, quality assurance and research planning. It is an extensible and customisable system that allows for the development of new functions and customisation of its various components from database schemas to the user interface layout, elements and look and feel. During the development of BEXIS2, we aimed to incorporate key aspects of what is encoded in FAIR data principles. To investigate the extent to which BEXIS2 conforms to these principles, we conducted the self-assessment using the FAIR indicators, definitions and criteria provided in the FAIR Data Maturity Model. Even though the FAIR data maturity model is developed initially to judge the conformance of datasets, the self-assessment results indicated that BEXIS2 remarkably conforms and supports FAIR indicators. BEXIS2 strongly conforms to the indicators Findability and Accessibility. The indicator Interoperability is moderately supported as of now; however, for many of the lesssupported facets, we have concrete plans for improvement. Reusability (as defined by the FAIR data principles) is partially achieved. This paper also illustrates community deployment examples of the BEXIS2 instances as success stories to exemplify its capacity to meet the biodiversity and ecological data management needs of differently sized projects and serve as an organisational research data management system.",
                "authors": [
                    {
                        "name": "Chamanara J."
                    },
                    {
                        "name": "Gaikwad J."
                    },
                    {
                        "name": "Gerlach R."
                    },
                    {
                        "name": "Algergawy A."
                    },
                    {
                        "name": "Ostrowski A."
                    },
                    {
                        "name": "Konig-Ries B."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Biodiversity Data Journal",
                "title": "BEXIS2: A FAIR-aligned data management system for biodiversity, ecology and environmental data"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "version": [
        "2.14"
    ]
}