{"credit":[],"labels":{"language":["C++"],"topic":[{"term":"Surgery","uri":"http://edamontology.org/topic_3421"},{"term":"Neurology","uri":"http://edamontology.org/topic_3334"},{"term":"MRI","uri":"http://edamontology.org/topic_3444"}]},"publication":[{"abstract":"© 2019Twin-to-twin transfusion syndrome (TTTS) is a serious condition that may occur in pregnancies when two or more fetuses share the same placenta. It is characterized by abnormal vascular connections in the placenta that cause blood to flow unevenly between the babies. If left untreated, perinatal mortality occurs in 90% of cases, whilst neurological injuries are still present in TTTS survivors. Minimally invasive fetoscopic laser surgery is the standard and optimal treatment for this condition, but is technically challenging and can lead to complications. Acquiring and maintaining the required surgical skills need consistent practice, and a steep learning curve. An accurate preoperative planning is thus vital for complex TTTS cases. To this end, we propose the first TTTS fetal surgery planning and simulation platform. The soft tissue of the mother, the uterus, the umbilical cords, the placenta and its vascular tree are segmented and registered automatically from magnetic resonance imaging and 3D ultrasound using computer vision and deep learning techniques. The proposed state-of-the-art technology is integrated into a flexible C++ and MITK-based application to provide a full exploration of the intrauterine environment by simulating the fetoscope camera as well as the laser ablation, determining the correct entry point, training doctors’ movements and trajectory ahead of operation, which allows improving upon current practice. A comprehensive usability study is reported. Experienced surgeons rated highly our TTTS planner and simulator, thus being a potential tool to be implemented in real and complex TTTS surgeries.","authors":["Torrents-Barrena J.","Lopez-Velazco R.","Piella G.","Masoller N.","Valenzuela-Alcaraz B.","Gratacos E.","Eixarch E.","Ceresa M.","Angel Gonzalez Ballester M."],"cit_count":0,"doi":"10.1016/J.CMPB.2019.104993","journal":"Computer Methods and Programs in Biomedicine","pmid":"31443866","title":"TTTS-GPS: Patient-specific preoperative planning and simulation platform for twin-to-twin transfusion syndrome fetal surgery","year":"2019-10-01"}],"summary":{"biotoolsCURIE":"biotools:TTTS-GPS","biotoolsID":"TTTS-GPS","description":"> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'TTTS', 'TTTS planner', 'twin-to-twin', 'TTTS surgeries' | Patient-specific preoperative planning and simulation platform for twin-to-twin transfusion syndrome fetal surgery | Twin-to-twin transfusion syndrome (TTTS) is a serious condition that may occur in pregnancies when two or more fetuses share the same placenta. It is characterized by abnormal vascular connections in the placenta that cause blood to flow unevenly between the babies. If left untreated, perinatal mortality occurs in 90% of cases, whilst neurological injuries are still present in TTTS survivors. Minimally invasive fetoscopic laser surgery is the standard and optimal treatment for this condition, but is technically challenging and can lead to complications. Acquiring and maintaining the required surgical skills need consistent practice, and a steep learning curve. An accurate preoperative planning is thus vital for complex TTTS cases","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31443866","name":"TTTS-GPS"}}