{
    "additionDate": "2021-01-18T07:39:54Z",
    "biotoolsCURIE": "biotools:qubils-midas",
    "biotoolsID": "qubils-midas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cesarrjacas1985@gmail.com",
            "typeEntity": "Person"
        },
        {
            "email": "crgarcia@cicese.mx",
            "typeEntity": "Person"
        },
        {
            "email": "cesar.garcia@conacyt.mx",
            "typeEntity": "Person"
        }
    ],
    "description": "Computing chiral, fuzzy, weighted and truncated geometrical molecular descriptors based on tensor algebra.\n\nQuBiLs-MIDAS software is for the calculation of 3D molecular descriptors based on the two-linear (bilinear), three-lineal and four-linear (multi-linear or.\n\nQuBiLs-MIDAS software is for the calculation of 3D molecular descriptors based on the two-linear (bilinear), three-lineal and four-linear (multi-linear or N-linear) algebraic forms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://tomocomd.com/qubils-midas",
    "lastUpdate": "2021-02-03T12:07:00Z",
    "name": "QuBiLS-MIDAS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/JCC.26167",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals, Inc.Advances to the distributed, multi-core and fully cross-platform QuBiLS-MIDAS software v2.0 (http://tomocomd.com/qubils-midas) are reported in this article since the v1.0 release. The QuBiLS-MIDAS software is the only one that computes atom-pair and alignment-free geometrical MDs (3D-MDs) from several distance metrics other than the Euclidean distance, as well as alignment-free 3D-MDs that codify structural information regarding the relations among three and four atoms of a molecule. The most recent features added to the QuBiLS-MIDAS software v2.0 are related (a) to the calculation of atomic weightings from indices based on the vertex-degree invariant (e.g., Alikhanidi index); (b) to consider central chirality during the molecular encoding; (c) to use measures based on clustering methods and statistical functions to codify structural information among more than two atoms; (d) to the use of a novel method based on fuzzy membership functions to spherically truncate inter-atomic relations; and (e) to the use of weighted and fuzzy aggregation operators to compute global 3D-MDs according to the importance and/or interrelation of the atoms of a molecule during the molecular encoding. Moreover, a novel module to compute QuBiLS-MIDAS 3D-MDs from their headings was also developed. This module can be used either by the graphical user interface or by means of the software library. By using the library, both the predictive models built with the QuBiLS-MIDAS 3D-MDs and the QuBiLS-MIDAS 3D-MDs calculation can be embedded in other tools. A set of predefined QuBiLS-MIDAS 3D-MDs with high information content and low redundancy on a set comprised of 20,469 compounds is also provided to be employed in further cheminformatics tasks. This set of predefined 3D-MDs evidenced better performance than all the universe of Dragon (v5.5) and PaDEL 0D-to-3D MDs in variability studies, whereas a linear independence study proved that these QuBiLS-MIDAS 3D-MDs codify chemical information orthogonal to the Dragon 0D-to-3D MDs. This set of predefined 3D-MDs would be periodically updated as long as new results be achieved. In general, this report highlights our continued efforts to provide a better tool for a most suitable characterization of compounds, and in this way, to contribute to obtaining better outcomes in future applications.",
                "authors": [
                    {
                        "name": "Garcia-Jacas C.R."
                    },
                    {
                        "name": "Marrero-Ponce Y."
                    },
                    {
                        "name": "Vivas-Reyes R."
                    },
                    {
                        "name": "Suarez-Lezcano J."
                    },
                    {
                        "name": "Martinez-Rios F."
                    },
                    {
                        "name": "Teran J.E."
                    },
                    {
                        "name": "Aguilera-Mendoza L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-05T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "Distributed and multicore QuBiLS-MIDAS software v2.0: Computing chiral, fuzzy, weighted and truncated geometrical molecular descriptors based on tensor algebra"
            },
            "pmid": "32058625"
        }
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}