
{
    "credit": [
        {
            "name": "ELIXIR-ITA-TORVERGATA",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "citterich@uniroma2.it",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure comparison",
                    "uri": "http://edamontology.org/operation_2483"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            }
        ]
    },
    "publication": [
        {
            "abstract": "pdbFun http://pdbfun.uniroma2.it) is a web server for structural and functional analysis of proteins at the residue level. pdbFun gives fast access to the whole Protein Data Bank (PDB) organized as a database of annotated residues. The available data (features) range from solvent exposure to ligand binding ability, location in a protein cavity, secondary structure, residue type, sequence functional pattern, protein domain and catalytic activity. Users can select any residue subset (even including any number of PDB structures) by combining the available features. Selections can be used as probe and target in multiple structure comparison searches. For example a search could involve, as a query, all solvent-exposed, hydrophylic residues that are not in alpha-helices and are involved in nucleotide binding. Possible examples of targets are represented by another selection, a single structure or a dataset composed of many structures. The output is a list of aligned structural matches offered in tabular and also graphical format. © 2005 Oxford University Press.",
            "authors": [
                "Ausiello G.",
                "Zanzoni A.",
                "Peluso D.",
                "Via A.",
                "Helmer-Citterich M."
            ],
            "cit_count": 29,
            "doi": "10.1093/nar/gki499",
            "journal": "Nucleic Acids Research",
            "title": "pdbFun: Mass selection and fast comparison of annotated PDB residues",
            "type": "Primary",
            "year": "2005-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pdbfun",
        "biotoolsID": "pdbfun",
        "description": "Mass selection and fast comparison of annotated PDB residues.",
        "homepage": "http://pdbfun.uniroma2.it",
        "name": "pdbFun",
        "version": [
            "1"
        ]
    }
}