{
    "additionDate": "2021-01-18T10:56:04Z",
    "biotoolsCURIE": "biotools:gsufsort",
    "biotoolsID": "gsufsort",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "louza@ufu.br",
            "name": "Felipe A. Louza",
            "orcidid": "https://orcid.org/0000-0003-2931-1470",
            "typeEntity": "Person"
        },
        {
            "email": "giovanna.rosone@unipi.it",
            "name": "Giovanna Rosone",
            "typeEntity": "Person"
        }
    ],
    "description": "Constructing suffix arrays, LCP arrays and BWTs for string collections.\n\ngsufsort [1] is a fast, portable and lightweight tool for constructing the suffix array and related data structures for string collections.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/felipelouza/gsufsort",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-01-25T11:47:26Z",
    "license": "GPL-3.0",
    "name": "gsufsort",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13015-020-00177-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The construction of a suffix array for a collection of strings is a fundamental task in Bioinformatics and in many other applications that process strings. Related data structures, as the Longest Common Prefix array, the Burrows-Wheeler transform, and the document array, are often needed to accompany the suffix array to efficiently solve a wide variety of problems. While several algorithms have been proposed to construct the suffix array for a single string, less emphasis has been put on algorithms to construct suffix arrays for string collections. Result: In this paper we introduce gsufsort, an open source software for constructing the suffix array and related data indexing structures for a string collection with N symbols in O(N) time. Our tool is written in ANSI/C and is based on the algorithm gSACA-K (Louza et al. in Theor Comput Sci 678:22-39, 2017), the fastest algorithm to construct suffix arrays for string collections. The tool supports large fasta, fastq and text files with multiple strings as input. Experiments have shown very good performance on different types of strings. Conclusions: gsufsort is a fast, portable, and lightweight tool for constructing the suffix array and additional data structures for string collections.",
                "authors": [
                    {
                        "name": "Gog S."
                    },
                    {
                        "name": "Louza F.A."
                    },
                    {
                        "name": "Prezza N."
                    },
                    {
                        "name": "Rosone G."
                    },
                    {
                        "name": "Telles G.P."
                    }
                ],
                "date": "2020-09-22T00:00:00Z",
                "journal": "Algorithms for Molecular Biology",
                "title": "Gsufsort: Constructing suffix arrays, LCP arrays and BWTs for string collections"
            },
            "pmcid": "PMC7507297",
            "pmid": "32973918"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
