{
    "additionDate": "2024-01-22T11:24:57.262092Z",
    "biotoolsCURIE": "biotools:reconstructor",
    "biotoolsID": "reconstructor",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "papin@virginia.edu",
            "name": "Jason A Papin",
            "orcidid": "https://orcid.org/0000-0002-2769-5805",
            "typeEntity": "Person"
        }
    ],
    "description": "COBRApy compatible tool for automated genome-scale metabolic network reconstruction with parsimonious flux-based gap-filling.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://github.com/emmamglass/reconstructor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:20:57.144773Z",
    "name": "Reconstructor",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad367",
            "metadata": {
                "abstract": "Motivation: Genome-scale metabolic network reconstructions (GENREs) are valuable for understanding cellular metabolism in silico. Several tools exist for automatic GENRE generation. However, these tools frequently (i) do not readily integrate with some of the widely-used suites of packaged methods available for network analysis, (ii) lack effective network curation tools, (iii) are not sufficiently user-friendly, and (iv) often produce low-quality draft reconstructions. Results: Here, we present Reconstructor, a user-friendly, COBRApy-compatible tool that produces high-quality draft reconstructions with reaction and metabolite naming conventions that are consistent with the ModelSEED biochemistry database and includes a gap-filling technique based on the principles of parsimony. Reconstructor can generate SBML GENREs from three input types: annotated protein. fasta sequences (Type 1 input), a BLASTp output (Type 2), or an existing SBML GENRE that can be further gap-filled (Type 3). While Reconstructor can be used to create GENREs of any species, we demonstrate the utility of Reconstructor with bacterial reconstructions. We demonstrate how Reconstructor readily generates high-quality GENRES that capture strain, species, and higher taxonomic differences in functional metabolism of bacteria and are useful for further biological discovery.",
                "authors": [
                    {
                        "name": "Glass E.M."
                    },
                    {
                        "name": "Jenior M.L."
                    },
                    {
                        "name": "Papin J.A."
                    }
                ],
                "citationCount": 4,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Reconstructor: a COBRApy compatible tool for automated genome-scale metabolic network reconstruction with parsimonious flux-based gap-filling"
            },
            "pmcid": "PMC10275916",
            "pmid": "37279743"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
