{
    "additionDate": "2017-01-17T15:07:59Z",
    "biotoolsCURIE": "biotools:raxml",
    "biotoolsID": "raxml",
    "collectionID": [
        "EBI Training Tools"
    ],
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sco.h-its.org/exelixis/contact.html"
        }
    ],
    "description": "A tool for Phylogenetic Analysis and Post-Analysis of Large Phylogenies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sco.h-its.org/exelixis/web/software/raxml/#documentation"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://sco.h-its.org/exelixis/web/software/raxml/",
    "lastUpdate": "2024-11-24T14:34:11.214548Z",
    "link": [
        {
            "note": "RAxML-NG, the complete re-design of RAxML",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/amkozlov/raxml-ng"
        },
        {
            "note": "Standard RAxML",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/stamatak/standard-RAxML"
        }
    ],
    "name": "RAxML",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "SIB",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu033",
            "metadata": {
                "abstract": "Motivation: Phylogenies are increasingly used in all fields of medical and biological research. Moreover, because of the next-generation sequencing revolution, datasets used for conducting phylogenetic analyses grow at an unprecedented pace. RAxML (Randomized Axelerated Maximum Likelihood) is a popular program for phylogenetic analyses of large datasets under maximum likelihood. Since the last RAxML paper in 2006, it has been continuously maintained and extended to accommodate the increasingly growing input datasets and to serve the needs of the user community. Results: I present some of the most notable new features and extensions of RAxML, such as a substantial extension of substitution models and supported data types, the introduction of SSE3, AVX and AVX2 vector intrinsics, techniques for reducing the memory requirements of the code and a plethora of operations for conducting postanalyses on sets of trees. In addition, an up-to-date 50-page user manual covering all new RAxML options is available. © The Author 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Stamatakis A."
                    }
                ],
                "citationCount": 24183,
                "date": "2014-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RAxML version 8: A tool for phylogenetic analysis and post-analysis of large phylogenies"
            },
            "pmcid": "PMC3998144",
            "pmid": "24451623"
        },
        {
            "doi": "10.1093/bioinformatics/btl446",
            "metadata": {
                "abstract": "Summary: RAxML-VI-HPC (randomized axelerated maximum likelihood for high performance computing) is a sequential and parallel program for inference of large phylogenies with maximum likelihood (ML). Low-level technical optimizations, a modification of the search algorithm, and the use of the GTR+CAT approximation as replacement for GTR+Γ yield a program that is between 2.7 and 52 times faster than the previous version of RAxML. A large-scale performance comparison with GARLI, PHYML, IQPNNI and MrBayes on real data containing 1000 up to 6722 taxa shows that RAxML requires at least 5.6 times less main memory and yields better trees in similar times than the best competing program (GARLI) on datasets up to 2500 taxa. On datasets ≥4000 taxa it also runs 2-3 times faster than GARLI. RAxML has been parallelized with MPI to conduct parallel multiple bootstraps and inferences on distinct starting trees. The program has been used to compute ML trees on two of the largest alignments to date containing 25 057 (1463 bp) and 2182 (51 089 bp) taxa, respectively. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Stamatakis A."
                    }
                ],
                "citationCount": 14007,
                "date": "2006-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RAxML-VI-HPC: Maximum likelihood-based phylogenetic analyses with thousands of taxa and mixed models"
            },
            "pmid": "16928733"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
