{"credit":[{"name":"SIB Swiss Institute of Bioinformatics","typeEntity":"Institute","typeRoles":[]},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://sco.h-its.org/exelixis/contact.html"}],"documentation":[{"type":"GENERAL","url":"https://sco.h-its.org/exelixis/web/software/raxml/#documentation"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"},{"term":"Phylogenetic tree analysis","uri":"http://edamontology.org/operation_0324"}]}],"labels":{"collectionID":["EBI Training Tools"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Desktop application"],"topic":[{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"Motivation: Phylogenies are increasingly used in all fields of medical and biological research. Moreover, because of the next-generation sequencing revolution, datasets used for conducting phylogenetic analyses grow at an unprecedented pace. RAxML (Randomized Axelerated Maximum Likelihood) is a popular program for phylogenetic analyses of large datasets under maximum likelihood. Since the last RAxML paper in 2006, it has been continuously maintained and extended to accommodate the increasingly growing input datasets and to serve the needs of the user community. Results: I present some of the most notable new features and extensions of RAxML, such as a substantial extension of substitution models and supported data types, the introduction of SSE3, AVX and AVX2 vector intrinsics, techniques for reducing the memory requirements of the code and a plethora of operations for conducting postanalyses on sets of trees. In addition, an up-to-date 50-page user manual covering all new RAxML options is available. © The Author 2013. Published by Oxford University Press.","authors":["Stamatakis A."],"cit_count":6392,"doi":"10.1093/bioinformatics/btu033","journal":"Bioinformatics","title":"RAxML version 8: A tool for phylogenetic analysis and post-analysis of large phylogenies","year":"2014-05-01"}],"summary":{"biotoolsCURIE":"biotools:raxml","biotoolsID":"raxml","description":"A tool for Phylogenetic Analysis and Post-Analysis of Large Phylogenies.","homepage":"http://sco.h-its.org/exelixis/web/software/raxml/","name":"RAxML"}}