{
    "accessibility": "Open access",
    "additionDate": "2023-12-01T13:22:33.309670Z",
    "biotoolsCURIE": "biotools:gelfap_v2.0",
    "biotoolsID": "gelfap_v2.0",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xqqiao2021@163.com",
            "name": "Qiaoqiao Xiao",
            "typeEntity": "Person"
        }
    ],
    "description": "Improved platform for Gene functional analysis in Gastrodia elata.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.gzybioinformatics.cn/Gelv2",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2024-11-24T14:29:48.329733Z",
    "name": "GelFAP v2.0",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12864-023-09260-1",
            "metadata": {
                "abstract": "Background: Gastrodia elata (tianma), a well-known medicinal orchid, is widely used to treat various kinds of diseases with its dried tuber. In recent years, new chromosome-level genomes of G.elata have been released in succession, which offer an enormous resource pool for understanding gene function. Previously we have constructed GelFAP for gene functional analysis of G.elata. As genomes are updated and transcriptome data is accumulated, collection data in GelFAP cannot meet the need of researchers. Results: Based on new chromosome-level genome and transcriptome data, we constructed co-expression network of G. elata, and then we annotated genes by aligning with sequences from NR, TAIR, Uniprot and Swissprot database. GO (Gene Ontology) and KEGG (Kyoto Encylopaedia of Genes and Genomes) annotations were predicted by InterProScan and GhostKOALA software. Gene families were further predicted by iTAK (Plant Transcription factor and Protein kinase Identifier and Classifier), HMMER (hidden Markov models), InParanoid. Finally, we developed an improved platform for gene functional analysis in G. elata (GelFAP v2.0) by integrating new genome, transcriptome data and processed functional annotation. Several tools were also introduced to platform including BLAST (Basic Local Alignment Search Tool), GSEA (Gene Set Enrichment Analysis), Heatmap, JBrowse, Motif analysis and Sequence extraction. Based on this platform, we found that the flavonoid biosynthesis might be regulated by transcription factors (TFs) such as MYB, HB and NAC. We also took C4H and GAFP4 as examples to show the usage of our platform. Conclusion: An improved platform for gene functional analysis in G. elata (GelFAP v2.0, www.gzybioinformatics.cn/Gelv2) was constructed, which provides better genome data, more transcriptome resources and more analysis tools. The updated platform might be preferably benefit researchers to carry out gene functional research for their project.",
                "authors": [
                    {
                        "name": "Li P."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Xiao Q."
                    },
                    {
                        "name": "Yang J."
                    }
                ],
                "citationCount": 4,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GelFAP v2.0: an improved platform for Gene functional analysis in Gastrodia elata"
            },
            "pmcid": "PMC10074892",
            "pmid": "37016293"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
