{
    "additionDate": "2021-01-18T07:05:41Z",
    "biotoolsCURIE": "biotools:bomiprot",
    "biotoolsID": "bomiprot",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Arpita Das"
        },
        {
            "name": "Kiran Ambatipudi"
        },
        {
            "name": "Kuldeep Giri"
        },
        {
            "name": "Rama N Behera"
        },
        {
            "name": "Sudipa Maity"
        }
    ],
    "description": "BoMiProt is a manually curated, comprehensive repository of published information of bovine milk proteins.",
    "documentation": [
        {
            "type": [
                "FAQ"
            ],
            "url": "http://bomiprot.org/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://bomiprot.org",
    "lastUpdate": "2022-10-06T09:33:46.719271Z",
    "license": "Other",
    "name": "BoMiProt",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2020.103648",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Bovine milk has become an important biological fluid for proteomic research due to its nutritional and immunological benefits. To date, over 300 publications have reported changes in bovine milk protein composition based on seasons, lactation stages, breeds, health status and milk fractions while there are no reports on consolidation or overlap of data between studies. Thus, we have developed a literature-based, manually curated open online database of bovine milk proteome, BoMiProt (http://bomiprot.org), with over 3100 proteins from whey, fat globule membranes and exosomes. Each entry in the database is thoroughly cross-referenced including 397 proteins with well-defined information on protein function, biochemical properties, post-translational modifications and significance in milk from different publications. Of 397 proteins, over 199 have been reported with a structural gallery of homology models and crystal structures in the database. The proteome data can be retrieved using several search parameters such as protein name, accession IDs, FASTA sequence. Furthermore, the proteome data can be filtered based on milk fractions, post-translational modifications and/or structures. Taken together, BoMiProt represents an extensive compilation of bovine milk proteins from literature, providing a foundation for future studies to identify specific milk proteins which may be linked to mammary gland pathophysiology. Biological significance: Protein data identified from different previously published proteomic studies on bovine milk samples (21 publications) were gathered in the BoMiProt database. Unification of the identified proteins will give researchers an initial reference database on bovine milk proteome to understand the complexities of milk as a biological fluid. BoMiProt has a user-friendly interface with several useful features, including different search criteria for primary and secondary information of proteins along with cross-references to external databases. The database will provide insights into the existing literature and possible future directions to investigate further and improve the beneficial effects of bovine milk components and dairy products on human health.",
                "authors": [
                    {
                        "name": "Ambatipudi K."
                    },
                    {
                        "name": "Bhat A.H."
                    },
                    {
                        "name": "Giri K."
                    },
                    {
                        "name": "Maity S."
                    }
                ],
                "citationCount": 11,
                "date": "2020-03-20T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "BoMiProt: A database of bovine milk proteins"
            },
            "pmid": "31958638"
        },
        {
            "doi": "10.1016/J.JPROT.2022.104696",
            "metadata": {
                "abstract": "© 2022 Elsevier B.V.Milk is a biofluid with various functions, containing carbohydrates, lipids, proteins, vitamins, and minerals. Owing to its importance and availability of vast proteomics information, our research group designed a database for bovine milk proteins (N = 3159) containing the primary and secondary information called BoMiProt. Due to the gaining interest and intensively published literature in the last three years, BoMiProt has been upgraded with newer identified proteins (N = 7459) from peer-reviewed journals, significantly expanding the database from different milk fractions (e.g., whey, fat globule membranes, and exosomes). Additionally, class, architecture, topology, and homology, structural classification of proteins, known and predicted disorder, predicted transmembrane helices, and structures have been included. Each protein entry in the database is thoroughly cross-referenced, including 1392 BoMiProt defined proteins provided with secondary information, such as protein function, biochemical properties, post-translational modifications, significance in milk, domains, fold, AlphaFold predicted models and crystal structures. The proteome data in the database can be retrieved using several search parameters using protein name, accession IDs, and FASTA sequence. Overall, BoMiProt represents an extensive compilation of newer proteins, including structural, functional, and hierarchical information, to help researchers better understand mammary gland pathophysiology, including their potential application in improving the nutritional quality of dairy products.",
                "authors": [
                    {
                        "name": "Ambatipudi K."
                    },
                    {
                        "name": "Behera R.N."
                    },
                    {
                        "name": "Das A."
                    },
                    {
                        "name": "Giri K."
                    },
                    {
                        "name": "Maity S."
                    }
                ],
                "date": "2022-09-15T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "BoMiProt 2.0: An update of the bovine milk protein database"
            },
            "pmid": "35995382",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "version": [
        "2.0"
    ]
}
