{
    "additionDate": "2021-01-18T07:05:41Z",
    "biotoolsCURIE": "biotools:bomiprot",
    "biotoolsID": "bomiprot",
    "confidence_flag": "tool",
    "description": "BoMiProt is a manually curated, comprehensive repository of published information of bovine milk proteins. It provides a bird’s eye view of the on-going research on bovine milk and possible information gaps that needs attention for maximizing health promoting effects of milk and different dairy products. It is a focused effort to consolidate the existing information of different milk proteins with focus on functions, biochemical properties, post translational modifications and significance of the protein in milk.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://bomiprot.org",
    "lastUpdate": "2021-02-04T18:30:50Z",
    "name": "BoMiProt",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2020.103648",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Bovine milk has become an important biological fluid for proteomic research due to its nutritional and immunological benefits. To date, over 300 publications have reported changes in bovine milk protein composition based on seasons, lactation stages, breeds, health status and milk fractions while there are no reports on consolidation or overlap of data between studies. Thus, we have developed a literature-based, manually curated open online database of bovine milk proteome, BoMiProt (http://bomiprot.org), with over 3100 proteins from whey, fat globule membranes and exosomes. Each entry in the database is thoroughly cross-referenced including 397 proteins with well-defined information on protein function, biochemical properties, post-translational modifications and significance in milk from different publications. Of 397 proteins, over 199 have been reported with a structural gallery of homology models and crystal structures in the database. The proteome data can be retrieved using several search parameters such as protein name, accession IDs, FASTA sequence. Furthermore, the proteome data can be filtered based on milk fractions, post-translational modifications and/or structures. Taken together, BoMiProt represents an extensive compilation of bovine milk proteins from literature, providing a foundation for future studies to identify specific milk proteins which may be linked to mammary gland pathophysiology. Biological significance: Protein data identified from different previously published proteomic studies on bovine milk samples (21 publications) were gathered in the BoMiProt database. Unification of the identified proteins will give researchers an initial reference database on bovine milk proteome to understand the complexities of milk as a biological fluid. BoMiProt has a user-friendly interface with several useful features, including different search criteria for primary and secondary information of proteins along with cross-references to external databases. The database will provide insights into the existing literature and possible future directions to investigate further and improve the beneficial effects of bovine milk components and dairy products on human health.",
                "authors": [
                    {
                        "name": "Maity S."
                    },
                    {
                        "name": "Bhat A.H."
                    },
                    {
                        "name": "Giri K."
                    },
                    {
                        "name": "Ambatipudi K."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-20T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "BoMiProt: A database of bovine milk proteins"
            },
            "pmid": "31958638"
        }
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        }
    ]
}