
{
    "credit": [
        {
            "name": "ExPASy helpdesk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.expasy.org/support"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://hamap.expasy.org/hamap_scan_userman.html#step1"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2014. HAMAP (High-quality Automated and Manual Annotation of Proteins-available at http://hamap.expasy.org/) is a system for the automatic classification and annotation of protein sequences. HAMAP provides annotation of the same quality and detail as UniProtKB/Swiss-Prot, using manually curated profiles for protein sequence family classification and expert curated rules for functional annotation of family members. HAMAP data and tools are made available through our website and as part of the UniRule pipeline of UniProt, providing annotation for millions of unreviewed sequences of UniProtKB/TrEMBL. Here we report on the growth of HAMAP and updates to the HAMAP system since our last report in the NAR Database Issue of 2013. We continue to augment HAMAP with new family profiles and annotation rules as new protein families are characterized and annotated in UniProtKB/Swiss-Prot; the latest version of HAMAP (as of 3 September 2014) contains 1983 family classification profiles and 1998 annotation rules (up from1780 and 1720).We demonstrate how the complex logic of HAMAP rules allows for precise annotation of individual functional variants within large homologous protein families. We also describe improvements to our web-based tool HAMAP-Scan which simplify the classification and annotation of sequences, and the incorporation of an improved sequence-profile search algorithm.",
            "authors": [
                "Pedruzzi I.",
                "Rivoire C.",
                "Auchincloss A.H.",
                "Coudert E.",
                "Keller G.",
                "De Castro E.",
                "Baratin D.",
                "Cuche B.A.",
                "Bougueleret L.",
                "Poux S.",
                "Redaschi N.",
                "Xenarios I.",
                "Bridge A."
            ],
            "cit_count": 44,
            "doi": "10.1093/nar/gku1002",
            "journal": "Nucleic Acids Research",
            "title": "HAMAP in 2015: Updates to the protein family classification and annotation system",
            "type": "Primary",
            "year": "2015-01-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hamap-scan",
        "biotoolsID": "hamap-scan",
        "description": "Scan several protein sequences or a whole genome (all ORFs) against HAMAP family profiles. Sequences that match HAMAP profiles will be annotated in the UniProtKB format by the associated annotation rules.",
        "homepage": "http://hamap.expasy.org/hamap_scan/",
        "name": "HAMAP-Scan"
    }
}