{
    "additionDate": "2021-01-18T09:18:05Z",
    "biotoolsCURIE": "biotools:mlgaze",
    "biotoolsID": "mlgaze",
    "confidence_flag": "tool",
    "description": "Machine Learning-Based Analysis of Gaze Error Patterns in Consumer Eye Tracking Systems.\n\nA machine learning repository for pattern recognition of gaze errors in consumer eye trackers. The MLGaze repository contains python coding resources for gaze data processing such as data augmentation, outlier removal , creation of gaze features for training and machine learning algorithms for classification and modelling of gaze error patterns. The data used for implementing and testing the methods may be found in the Mendeley repository (link below).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anuradhakar49/MLGaze",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-26T08:50:52Z",
    "license": "GPL-3.0",
    "name": "MLGaze",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3390/VISION4020025",
            "metadata": {
                "abstract": "© 2020 by the author. Licensee MDPI, Basel, Switzerland.Analyzing the gaze accuracy characteristics of an eye tracker is a critical task as its gaze data is frequently affected by non-ideal operating conditions in various consumer eye tracking applications. In previous research on pattern analysis of gaze data, efforts were made to model human visual behaviors and cognitive processes. What remains relatively unexplored are questions related to identifying gaze error sources as well as quantifying and modeling their impacts on the data quality of eye trackers. In this study, gaze error patterns produced by a commercial eye tracking device were studied with the help of machine learning algorithms, such as classifiers and regression models. Gaze data were collected from a group of participants under multiple conditions that commonly affect eye trackers operating on desktop and handheld platforms. These conditions (referred here as error sources) include user distance, head pose, and eye-tracker pose variations, and the collected gaze data were used to train the classifier and regression models. It was seen that while the impact of the different error sources on gaze data characteristics were nearly impossible to distinguish by visual inspection or from data statistics, machine learning models were successful in identifying the impact of the different error sources and predicting the variability in gaze error levels due to these conditions. The objective of this study was to investigate the efficacy of machine learning methods towards the detection and prediction of gaze error patterns, which would enable an in-depth understanding of the data quality and reliability of eye trackers under unconstrained operating conditions. Coding resources for all the machine learning methods adopted in this study were included in an open repository named MLGaze to allow researchers to replicate the principles presented here using data from their own eye trackers.",
                "authors": [
                    {
                        "name": "Kar A."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Vision (Switzerland)",
                "title": "Mlgaze: Machine learning-based analysis of gaze error patterns in consumer eye tracking systems"
            },
            "pmcid": "PMC7355841",
            "pmid": "32392760"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
