
{
    "credit": [
        {
            "email": "bioinfo@iis.sinica.edu.tw",
            "name": "Systems Proteomics Laboratory, Institute of Information Science, Academia Sinica",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://ms.iis.sinica.edu.tw/COmics/Software_MaXIC-Q.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                },
                {
                    "term": "Labeled quantification",
                    "uri": "http://edamontology.org/operation_3635"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Experimental design and studies",
                "uri": "http://edamontology.org/topic_3678"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Isotope labeling combined with liquid chromatography-mass spectrometry (LC-MS) provides a robust platform for analyzing differential protein expression in proteomics research. We present a web service, called MaXIC-Q Web (http://ms.iis.sinica.edu.tw/MaXIC-Q_Web/), for quantitation analysis of large-scale datasets generated from proteomics experiments using various stable isotope-labeling techniques, e.g. SILAC, ICAT and user-developed labeling methods. It accepts spectral files in the standard mzXML format and search results from SEQUEST, Mascot and ProteinProphet as input. Furthermore, MaXIC-Q Web uses statistical and computational methods to construct two kinds of elution profiles for each ion, namely, PIMS (projected ion mass spectrum) and XIC (extracted ion chromatogram) from MS data. Toward accurate quantitation, a stringent validation procedure is performed on PIMSs to filter out peptide ions interfered with co-eluting peptides or noise. The areas of XICs determine ion abundances, which are used to calculate peptide and protein ratios. Since MaXIC-Q Web adopts stringent validation on spectral data, it achieves high accuracy so that manual validation effort can be substantially reduced. Furthermore, it provides various visualization diagrams and comprehensive quantitation reports so that users can conveniently inspect quantitation results. In summary, MaXIC-Q Web is a user-friendly, interactive, robust, generic web service for quantitation based on ICAT and SILAC labeling techniques.",
            "authors": [
                "Tsou C.-C.",
                "Tsui Y.-H.",
                "Yian Y.-H.",
                "Chen Y.-J.",
                "Yang H.-Y.",
                "Yu C.-Y.",
                "Lynn K.-S.",
                "Chen Y.-J.",
                "Sung T.-Y.",
                "Hsu W.-L."
            ],
            "cit_count": 7,
            "journal": "Nucleic Acids Research",
            "pmid": "19528069",
            "title": "MaXIC-Q Web: A fully automated web service using statistical and computational methods for protein quantitation based on stable isotope labeling and LC-MS",
            "year": "2009-08-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:maxic-q",
        "biotoolsID": "maxic-q",
        "description": "The MaXIC-Q web server performs various quantification analyses on large-scale datasets generated from proteomics studies using isotope labeling. For input MS data, output is given in projected ion mass spectrum and extracted ion chromatograph which can be used to generate other calculations (e.g. ion abundances and peptide-protein ratios.",
        "homepage": "http://ms.iis.sinica.edu.tw/MaXIC-Q",
        "name": "MaXIC-Q"
    }
}