{
    "name": "UT-AKI", 
    "description": "Tool to predict acute kidney injury in patients with ST-elevation myocardial infarction.", 
    "homepage": "https://www.uthsc.edu/cardiology/research/utaki.php", 
    "biotoolsID": "UT-AKI", 
    "biotoolsCURIE": "biotools:UT-AKI", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction and recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3303", 
            "term": "Medicine"
        }, 
        {
            "uri": "http://edamontology.org/topic_3422", 
            "term": "Urology and nephrology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0181658", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A web-based tool to predict acute kidney injury in patients with ST-elevation myocardial infarction: Development, internal validation and comparison", 
                "abstract": "© 2017 Zambetti et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Background: In ST-elevation myocardial infarction (STEMI), acute kidney injury (AKI) may increase subsequent morbidity and mortality. Still, it remains difficult to predict AKI risk in these patients. We sought to 1) determine the frequency and clinical outcomes of AKI and, 2) develop, validate and compare a web-based tool for predicting AKI. Methods & findings: In a racially diverse series of 1144 consecutive STEMI patients, Stage 1 or greater AKI occurred in 12.9% and was severe (Stage 2–3) in 2.9%. AKI was associated with increased mortality (5.7-fold, unadjusted) and hospital stay (2.5-fold). AKI was associated with systolic dysfunction, increased left ventricular end-diastolic pressures, hypotension and intra-aortic balloon counterpulsation. A computational algorithm (UT-AKI) was derived and internally validated. It showed higher sensitivity and improved overall prediction for AKI (area under the curve 0.76) vs. other published indices. Higher UT-AKI scores were associated with more severe AKI, longer hospital stay and greater hospital mortality. Conclusions: In a large, racially diverse cohort of STEMI patients, Stage 1 or greater AKI was relatively common and was associated with significant morbidity and mortality. A web-accessible, internally validated tool was developed with improved overall value for predicting AKI. By identifying patients at increased risk, this tool may help physicians tailor post-procedural diagnostic and therapeutic strategies after STEMI to reduce AKI and its associated morbidity and mortality.", 
                "date": "2017-07-01T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Zambetti B.R."
                    }, 
                    {
                        "name": "Thomas F."
                    }, 
                    {
                        "name": "Hwang I."
                    }, 
                    {
                        "name": "Brown A.C."
                    }, 
                    {
                        "name": "Chumpia M."
                    }, 
                    {
                        "name": "Ellis R.T."
                    }, 
                    {
                        "name": "Naik D."
                    }, 
                    {
                        "name": "Khouzam R.N."
                    }, 
                    {
                        "name": "Ibebuogu U.N."
                    }, 
                    {
                        "name": "Reed G.L."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "Guy L. Reed", 
            "email": "glreed@uthsc.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "migle_sur", 
    "additionDate": "2018-06-12T18:36:25Z", 
    "lastUpdate": "2018-12-10T12:58:59Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}