{"credit":[{"email":"azadcse@gmail.com","name":"Ariful Azad","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/flowVS.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/flowVS_1.6.0.tar.gz"}],"function":[{"input":[{"data":{"term":"Experimental measurement","uri":"http://edamontology.org/data_3108"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"}]},{"data":{"term":"Gene expression data","uri":"http://edamontology.org/data_2603"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"}]}],"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}],"output":[{"data":{"term":"Plot","uri":"http://edamontology.org/data_2884"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"},{"term":"Image format","uri":"http://edamontology.org/format_3547"}]},{"data":{"term":"Report","uri":"http://edamontology.org/data_2048"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"},{"term":"Image format","uri":"http://edamontology.org/format_3547"}]}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"Artistic-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Laboratory techniques","uri":"http://edamontology.org/topic_3361"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Biophysics","uri":"http://edamontology.org/topic_3306"}]},"publication":[{"abstract":"© 2016 Azad et al. Background: Comparing phenotypes of heterogeneous cell populations from multiple biological conditions is at the heart of scientific discovery based on flow cytometry (FC). When the biological signal is measured by the average expression of a biomarker, standard statistical methods require that variance be approximately stabilized in populations to be compared. Since the mean and variance of a cell population are often correlated in fluorescence-based FC measurements, a preprocessing step is needed to stabilize the within-population variances. Results: We present a variance-stabilization algorithm, called flowVS, that removes the mean-variance correlations from cell populations identified in each fluorescence channel. flowVS transforms each channel from all samples of a data set by the inverse hyperbolic sine (asinh) transformation. For each channel, the parameters of the transformation are optimally selected by Bartlett's likelihood-ratio test so that the populations attain homogeneous variances. The optimum parameters are then used to transform the corresponding channels in every sample. flowVS is therefore an explicit variance-stabilization method that stabilizes within-population variances in each channel by evaluating the homoskedasticity of clusters with a likelihood-ratio test. With two publicly available datasets, we show that flowVS removes the mean-variance dependence from raw FC data and makes the within-population variance relatively homogeneous. We demonstrate that alternative transformation techniques such as flowTrans, flowScape, logicle, and FCSTrans might not stabilize variance. Besides flow cytometry, flowVS can also be applied to stabilize variance in microarray data. With a publicly available data set we demonstrate that flowVS performs as well as the VSN software, a state-of-the-art approach developed for microarrays. Conclusions: The homogeneity of variance in cell populations across FC samples is desirable when extracting features uniformly and comparing cell populations with different levels of marker expressions. The newly developed flowVS algorithm solves the variance-stabilization problem in FC and microarrays by optimally transforming data with the help of Bartlett's likelihood-ratio test. On two publicly available FC datasets, flowVS stabilizes within-population variances more evenly than the available transformation and normalization techniques. flowVS-based variance stabilization can help in performing comparison and alignment of phenotypically identical cell populations across different samples. flowVS and the datasets used in this paper are publicly available in Bioconductor.","authors":["Azad A.","Rajwa B.","Pothen A."],"cit_count":2,"doi":"10.1186/s12859-016-1083-9","journal":"BMC Bioinformatics","title":"flowVS: Channel-specific variance stabilization in flow cytometry","type":"Primary","year":"2016-07-28"}],"summary":{"biotoolsCURIE":"biotools:flowvs","biotoolsID":"flowvs","description":"Per-channel variance stabilization from a collection of flow cytometry samples by Bertlett test for homogeneity of variances. The approach is applicable to microarrays data as well.","homepage":"http://bioconductor.org/packages/release/bioc/html/flowVS.html","name":"flowVS","version":["1.6.0"]}}