{
    "accessibility": "Restricted access",
    "additionDate": "2021-10-10T15:26:03.146225Z",
    "biotoolsCURIE": "biotools:miscan",
    "biotoolsID": "miscan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a.gini@erasmusmc.nl",
            "name": "Andrea Gini",
            "typeEntity": "Person"
        }
    ],
    "description": "MISCAN is an online modelling-based tool for informing breast, cervical, and colorectal cancer screening decisions in Europe.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://miscan.eu-topia.org",
    "lastUpdate": "2021-10-10T15:26:03.148688Z",
    "name": "MISCAN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.PMEDR.2021.101392",
            "metadata": {
                "abstract": "© 2021 The Author(s)Background: Aiming to support European countries in improving their breast, cervical, and colorectal cancer (CRC) screening programmes, the EU-TOPIA consortium has developed an online user-friendly tool (the EU-TOPIA evaluation tool; https://miscan.eu-topia.org) based on the Microsimulation Screening Analysis (MISCAN) model. Methods: We designed an online platform that allows stakeholders to use their country-specific data (demographic, epidemiological, and cancer screening information) to quantify future harms and benefits of different cancer screening scenarios in their country. Current cancer screening programmes and impacts of potential changes in screening protocols (such as extending target ages or increasing screening attendance) can be simulated. Results are scaled to the country-specific population. To illustrate the tool, we used the tool to simulate two different CRC screening scenarios in the Netherlands: biennial fecal immunochemical testing (FIT) in ages 55–75 and colonoscopy every ten years in ages 55–75. Data from the Dutch screening programme was used to inform both scenarios. Results: A total of 482,700 CRC cases and 178,000 CRC deaths were estimated in the Netherlands with FIT screening (for individuals aged 40–100 years, 2018–2050), with 47.3 million FITs performed (1.92 million positives of which 1.64 million adhered to diagnostic colonoscopy). With colonoscopy screening, CRC incidence and mortality were, respectively, up to 17% and 14% lower than in the current FIT screening programme, requiring, however, a colonoscopy demand that was 7-fold higher. Conclusions: Our study presents an essential online tool for stakeholders and medical societies to quantify estimates of benefits and harms of early cancer detection in Europe.",
                "authors": [
                    {
                        "name": "Anttila A."
                    },
                    {
                        "name": "Csanadi M."
                    },
                    {
                        "name": "Gini A."
                    },
                    {
                        "name": "Heijnsdijk E.A.M."
                    },
                    {
                        "name": "Heinavaara S."
                    },
                    {
                        "name": "Jansen E.E.L."
                    },
                    {
                        "name": "Lansdorp-Vogelaar I."
                    },
                    {
                        "name": "Novak Mlakar D."
                    },
                    {
                        "name": "Segnan N."
                    },
                    {
                        "name": "Senore C."
                    },
                    {
                        "name": "Szeles G."
                    },
                    {
                        "name": "Veerus P."
                    },
                    {
                        "name": "Zielonke N."
                    },
                    {
                        "name": "de Koning H.J."
                    },
                    {
                        "name": "van Ravesteyn N.T."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "Preventive Medicine Reports",
                "title": "The EU-TOPIA evaluation tool: An online modelling-based tool for informing breast, cervical, and colorectal cancer screening decisions in Europe"
            },
            "pmcid": "PMC8122113",
            "pmid": "34026466"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
