{
    "accessibility": "Open access",
    "additionDate": "2022-09-30T22:38:33.206133Z",
    "biotoolsCURIE": "biotools:neors",
    "biotoolsID": "neors",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vtenguix@gmail.com",
            "name": "Vicente Enguix",
            "typeEntity": "Person"
        },
        {
            "name": "David Luck"
        },
        {
            "name": "Gregory Anton Lodygensky"
        },
        {
            "name": "Jeanette Kenley"
        },
        {
            "name": "Julien Cohen-Adad"
        }
    ],
    "description": "A Neonatal Resting State fMRI Data Preprocessing Pipeline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/venguix/NeoRS",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T15:32:48.817698Z",
    "license": "Not licensed",
    "name": "NeoRS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fninf.2022.843114",
            "metadata": {
                "abstract": "Resting state functional MRI (rsfMRI) has been shown to be a promising tool to study intrinsic brain functional connectivity and assess its integrity in cerebral development. In neonates, where functional MRI is limited to very few paradigms, rsfMRI was shown to be a relevant tool to explore regional interactions of brain networks. However, to identify the resting state networks, data needs to be carefully processed to reduce artifacts compromising the interpretation of results. Because of the non-collaborative nature of the neonates, the differences in brain size and the reversed contrast compared to adults due to myelination, neonates can’t be processed with the existing adult pipelines, as they are not adapted. Therefore, we developed NeoRS, a rsfMRI pipeline for neonates. The pipeline relies on popular neuroimaging tools (FSL, AFNI, and SPM) and is optimized for the neonatal brain. The main processing steps include image registration to an atlas, skull stripping, tissue segmentation, slice timing and head motion correction and regression of confounds which compromise functional data interpretation. To address the specificity of neonatal brain imaging, particular attention was given to registration including neonatal atlas type and parameters, such as brain size variations, and contrast differences compared to adults. Furthermore, head motion was scrutinized, and motion management optimized, as it is a major issue when processing neonatal rsfMRI data. The pipeline includes quality control using visual assessment checkpoints. To assess the effectiveness of NeoRS processing steps we used the neonatal data from the Baby Connectome Project dataset including a total of 10 neonates. NeoRS was designed to work on both multi-band and single-band acquisitions and is applicable on smaller datasets. NeoRS also includes popular functional connectivity analysis features such as seed-to-seed or seed-to-voxel correlations. Language, default mode, dorsal attention, visual, ventral attention, motor and fronto-parietal networks were evaluated. Topology found the different analyzed networks were in agreement with previously published studies in the neonate. NeoRS is coded in Matlab and allows parallel computing to reduce computational times; it is open-source and available on GitHub (https://github.com/venguix/NeoRS). NeoRS allows robust image processing of the neonatal rsfMRI data that can be readily customized to different datasets.",
                "authors": [
                    {
                        "name": "Cohen-Adad J."
                    },
                    {
                        "name": "Enguix V."
                    },
                    {
                        "name": "Kenley J."
                    },
                    {
                        "name": "Lodygensky G.A."
                    },
                    {
                        "name": "Luck D."
                    }
                ],
                "date": "2022-06-17T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "NeoRS: A Neonatal Resting State fMRI Data Preprocessing Pipeline"
            },
            "pmcid": "PMC9247272",
            "pmid": "35784189"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
