{
    "additionDate": "2021-01-18T09:05:24Z",
    "biotoolsCURIE": "biotools:mstree",
    "biotoolsID": "mstree",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liujunfeng@big.ac.cn",
            "name": "Junfeng Liu",
            "orcidid": "https://orcid.org/0000-0002-2651-4654",
            "typeEntity": "Person"
        },
        {
            "email": "yangqz@mail.tsinghua.edu.cn",
            "name": "Qingzhu Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "A Multispecies Coalescent Approach for Estimating Ancestral Population Size and Divergence Time during Speciation with Gene Flow.\n\nMStree: A model-flexible approach for estimating parameters during speciation with gene flow.\n\nMStree is an open-source software for estimating ancestral population sizes and species divergence times during speciation with gene flow.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liujunfengtop/MStree/",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-03-02T08:03:00Z",
    "license": "GPL-3.0",
    "name": "mstree",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/GBE/EVAA087",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.Gene flow between species may cause variations in branch length and topology of gene tree, which are beyond the expected variations from ancestral processes. These additional variations make it difficult to estimate parameters during speciation with gene flow, as the pattern of these additional variations differs with the relationship between isolation and migration. As far as we know, most methods rely on the assumption about the relationship between isolation and migration by a given model, such as the isolation-with-migration model, when estimating parameters during speciation with gene flow. In this article, we develop a multispecies coalescent approach which does not rely on any assumption about the relationship between isolation and migration when estimating parameters and is called mstree. mstree is available at https://github.com/liujunfengtop/MStree/ and uses some mathematical inequalities among several factors, which include the species divergence time, the ancestral population size, and the number of gene trees, to estimate parameters during speciation with gene flow. Using simulations, we show that the estimated values of ancestral population sizes and species divergence times are close to the true values when analyzing the simulation data sets, which are generated based on the isolation-with-initial-migration model, secondary contact model, and isolation-with-migration model. Therefore, our method is able to estimate ancestral population sizes and speciation times in the presence of different modes of gene flow and may be helpful to test different theories of speciation.",
                "authors": [
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Yang Q."
                    }
                ],
                "date": "2020-03-27T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "Mstree: A Multispecies Coalescent Approach for Estimating Ancestral Population Size and Divergence Time during Speciation with Gene Flow"
            },
            "pmcid": "PMC7259675",
            "pmid": "32365209"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}