{
    "accessibility": "Open access",
    "additionDate": "2022-12-08T12:48:27.856699Z",
    "biotoolsCURIE": "biotools:spotitpy",
    "biotoolsID": "spotitpy",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "garinis@imbb.forth.gr",
            "name": "George A. Garinis",
            "orcidid": "https://orcid.org/0000-0002-3200-5004",
            "typeEntity": "Person"
        },
        {
            "name": "Alexia Akalestou-Clocher"
        },
        {
            "name": "Pantelis Topalis"
        },
        {
            "name": "Vivian Kalamara"
        }
    ],
    "description": "A semi-automated tool for object-based co-localization of fluorescent labels in microscopy images.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/alexiaales/SpotitPy",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-08T12:48:27.860505Z",
    "license": "MIT",
    "name": "SpotitPy",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04988-1",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: In fluorescence microscopy, co-localization refers to the spatial overlap between different fluorescent labels in cells. The degree of overlap between two or more channels in a microscope may reveal a physical interaction or topological functional interconnection between molecules. Recent advances in the imaging field require the development of specialized computational analysis software for the unbiased assessment of fluorescently labelled microscopy images. Results: Here we present SpotitPy, a semi-automated image analysis tool for 2D object-based co-localization. SpotitPy allows the user to select fluorescent labels and perform a semi-automated and robust segmentation of the region of interest in distinct cell types. The workflow integrates advanced pre-processing manipulations for de-noising and in-depth semi-automated quantification of the co-localized fluorescent labels in two different channels. We validated SpotitPy by quantitatively assessing the presence of cytoplasmic ribonucleoprotein granules, e.g. processing (P) bodies, under conditions that challenge mRNA translation, thus highlighting SpotitPy benefits for semi-automatic, accurate analysis of large image datasets in eukaryotic cells. SpotitPy comes in a command line interface or a simple graphical user interphase and can be used as a standalone application. Conclusions: Overall, we present a novel and user-friendly tool that performs a semi-automated image analysis for 2D object-based co-localization. SpotitPy can provide reproducible and robust quantifications for large datasets within a limited timeframe. The software is open-source and can be found in the GitHub project repository: (https://github.com/alexiaales/SpotitPy).",
                "authors": [
                    {
                        "name": "Akalestou-Clocher A."
                    },
                    {
                        "name": "Garinis G.A."
                    },
                    {
                        "name": "Kalamara V."
                    },
                    {
                        "name": "Topalis P."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SpotitPy: a semi-automated tool for object-based co-localization of fluorescent labels in microscopy images"
            },
            "pmcid": "PMC9587566",
            "pmid": "36271369"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
