{"credit":[{"email":"manali.rupji@emory.edu","name":"Maintainer- Manali Rupji","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"TRAINING_MATERIAL","url":"https://github.com/manalirupji/CASAS/blob/master/CASAS_Tutorial.pdf"}],"function":[{"operation":[{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Suite"],"topic":[{"term":"Experimental design and studies","uri":"http://edamontology.org/topic_3678"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/manalirupji/CASAS/"}],"publication":[{"abstract":"© 2017 Rupji M et al. We present CASAS, a shiny R based tool for interactive survival analysis and visualization of results. The tool provides a web-based one stop shop to perform the following types of survival analysis: quantile, landmark and competing risks, in addition to standard survival analysis. The interface makes it easy to perform such survival analyses and obtain results using the interactive Kaplan-Meier and cumulative incidence plots. Univariate analysis can be performed on one or several user specified variable(s) simultaneously, the results of which are displayed in a single table that includes log rank p-values and hazard ratios along with their significance. For several quantile survival analyses from multiple cancer types, a single summary grid is constructed. The CASAS package has been implemented in R and is available via http://shinygispa.winship.emory.edu/CASAS/. The developmental repository is available at https://github.com/manalirupji/CASAS/.","authors":["Kowalski J.","Rupji M.","Zhang X."],"cit_count":1,"doi":"10.12688/f1000research.11830.2","journal":"F1000Research","title":"CASAS: Cancer Survival Analysis Suite, a web based application","type":"Primary","year":"2017-01-01"}],"summary":{"biotoolsCURIE":"biotools:casas","biotoolsID":"casas","description":"Interactive survival analysis and visualization. Perform the following types of survival analysis:  quantile, landmark and competing risks, in addition to standard survival analysis.","homepage":"http://bbisr.shinyapps.winship.emory.edu/CASAS/","name":"CASAS"}}