{
    "additionDate": "2024-06-19T06:32:41.705444Z",
    "biotoolsCURIE": "biotools:ontoloviz",
    "biotoolsID": "ontoloviz",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "matthias.ley@delta4.ai",
            "name": "Matthias Ley",
            "orcidid": "https://orcid.org/0000-0001-6853-8542",
            "typeEntity": "Person"
        }
    ],
    "description": "A GUI for interactive visualization of ranked disease or drug lists using the MeSH and ATC ontologies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                },
                {
                    "term": "Treemap visualisation",
                    "uri": "http://edamontology.org/operation_2942"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Delta4AI/OntoloViz/releases/latest",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:52:36.417395Z",
    "license": "MIT",
    "name": "OntoloViz",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioadv/vbad113",
            "metadata": {
                "abstract": "Motivation: Structured vocabularies for drugs and diseases represent, besides their primary use for annotating scientific literature or scientific information in general, a valuable resource for visualizing aggregated information. The Medical Subject Headings (MeSH) and Anatomical Therapeutic Chemical (ATC) ontologies are widely used structured vocabularies for diseases and drugs, respectively. Their hierarchical tree-like structure can be used as a basis for creating intuitive visual displays for specific diseases and drugs within their higher-order classifications. Such displays are helpful means to contextualize diseases and drugs in various settings such as in drug repositioning. However, there are few tools that can harness the potential of these structured ontologies to create informative visual representations without extensive programming and data processing skills. Results: We have developed OntoloViz, a Graphical User Interface (GUI) for visualizing annotated lists of drugs or diseases in the context of their MeSH or ATC ontologies in an intuitively interpretable sunburst layout. Minimum input is a list of disease or drug names. Users in addition have the option to specify numerical parameters for the input lists to enhance the visualization, e.g. to visualize term frequencies. The GUI allows values to be propagated upwards in the respective ontology tree structure thus facilitating exploration of gene and drug lists. We present two use cases for OntoloViz, namely (i) a graphical representation of clinically tested drugs for coronavirus disease (COVID-19) based on ATC Classification and (ii) a graphical representation of literature annotation of human diseases on the MeSH ontology.",
                "authors": [
                    {
                        "name": "Fillinger L."
                    },
                    {
                        "name": "Heinzel A."
                    },
                    {
                        "name": "Kratochwill K."
                    },
                    {
                        "name": "Ley M."
                    },
                    {
                        "name": "Perco P."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics Advances",
                "title": "OntoloViz: a GUI for interactive visualization of ranked disease or drug lists using the MeSH and ATC ontologies"
            },
            "pmcid": "PMC10941809",
            "pmid": "38496343"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
