{
    "additionDate": "2017-12-18T00:10:37Z",
    "biotoolsCURIE": "biotools:psortb",
    "biotoolsID": "psortb",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.pathogenomics.sfu.ca/brinkman/"
        }
    ],
    "description": "It is a high-precision localization prediction method for bacterial proteins. It has remained the most precise bacterial protein subcellular localization (SCL) predictor.  PSORTb version improved recall, higher proteome-scale prediction coverage, and new refined localization subcategories. It is the first SCL predictor specifically geared for all prokaryotes, including archaea and bacteria with atypical membrane/cell wall topologies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.psort.org/documentation/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://www.psort.org/psortb/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/psortb-3-0-3-high-precision-localization-prediction-bacterial-proteins.html"
        }
    ],
    "name": "PSORTb",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq249",
            "metadata": {
                "abstract": "Motivation: PSORTb has remained the most precise bacterial protein subcellular localization (SCL) predictor since it was first made available in 2003. However, the recall needs to be improved and no accurate SCL predictors yet make predictions for archaea, nor differentiate important localization subcategories, such as proteins targeted to a host cell or bacterial hyperstructures/organelles. Such improvements should preferably be encompassed in a freely available web-based predictor that can also be used as a standalone program. Results: We developed PSORTb version 3.0 with improved recall, higher proteome-scale prediction coverage, and new refined localization subcategories. It is the first SCL predictor specifically geared for all prokaryotes, including archaea and bacteria with atypical membrane/cell wall topologies. It features an improved standalone program, with a new batch results delivery system complementing its web interface. We evaluated the most accurate SCL predictors using 5-fold cross validation plus we performed an independent proteomics analysis, showing that PSORTb 3.0 is the most accurate but can benefit from being complemented by Proteome Analyst predictions. Availability: http://www.psort.org/psortb (download open source software or use the web interface). Contact: psort-mail@sfu.ca. Supplementary Information: Supplementary data are availableat Bioinformatics online. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Brinkman F.S.L."
                    },
                    {
                        "name": "Cenk Sahinalp S."
                    },
                    {
                        "name": "Dao P."
                    },
                    {
                        "name": "Ester M."
                    },
                    {
                        "name": "Foster L.J."
                    },
                    {
                        "name": "Laird M.R."
                    },
                    {
                        "name": "Lo R."
                    },
                    {
                        "name": "Melli G."
                    },
                    {
                        "name": "Rey S."
                    },
                    {
                        "name": "Wagner J.R."
                    },
                    {
                        "name": "Yu N.Y."
                    }
                ],
                "citationCount": 1259,
                "date": "2010-05-13T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PSORTb 3.0: Improved protein subcellular localization prediction with refined localization subcategories and predictive capabilities for all prokaryotes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Plant",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "3.0.3"
    ]
}
