
{
    "credit": [
        {
            "email": "mrobert@ttck.keio.ac.jp",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mathdamp.iab.keio.ac.jp/tridamp/contact/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://mathdamp.iab.keio.ac.jp/tridamp/overview/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Omics",
                "uri": "http://edamontology.org/topic_3391"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/tridamp-mathdamp-extension-three-way-comparisons-metabolite-profiles.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Density plot visualizations (also referred to as heat maps or color maps) are widely used in different fields including large-scale omics studies in biological sciences. However, the current color-codings limit the visualizations to single datasets or pairwise comparisons. Results: We propose a color-coding approach for the representation of three-way comparisons. The approach is based on the HSB (hue, saturation, brightness) color model. The three compared values are assigned specific hue values from the circular hue range (e.g. red, green, and blue). The hue value representing the three-way comparison is calculated according to the distribution of three compared values. If two of the values are identical and one is different, the resulting hue is set to the characteristic hue of the differing value. If all three compared values are different, the resulting hue is selected from a color gradient running between the hues of the two most distant values (as measured by the absolute value of their difference) according to the relative position of the third value between the two. The saturation of the color representing the three-way comparison reflects the amplitude (or extent) of the numerical difference between the two most distant values according to a scale of interest. The brightness is set to a maximum value by default but can be used to encode additional information about the three-way comparison. Conclusion: We propose a novel color-coding approach for intuitive visualization of three-way comparisons of omics data. © 2007 Baran et al; licensee BioMed Central Ltd.",
            "authors": [
                "Baran R.",
                "Robert M.",
                "Suematsu M.",
                "Soga T.",
                "Tomita M."
            ],
            "cit_count": 7,
            "journal": "BMC Bioinformatics",
            "pmid": "17335588",
            "title": "Visualization of three-way comparisons of omics data",
            "year": "2007-03-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tridamp",
        "biotoolsID": "tridamp",
        "description": "A MathDAMP extension for the visualization of three-way comparisons between metabolite profiles. An intuitive color-coding is used to represent the three-way differences on density plots.",
        "homepage": "http://mathdamp.iab.keio.ac.jp/tridamp/",
        "name": "TriDAMP"
    }
}