{
    "additionDate": "2021-01-18T09:57:12Z",
    "biotoolsCURIE": "biotools:pub2tools2020__metasubtract",
    "biotoolsID": "pub2tools2020__metasubtract",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "i.m.nolte@umcg.nl",
            "name": "Ilja M Nolte",
            "typeEntity": "Person"
        }
    ],
    "description": "An R-package to analytically produce leave-one-out meta-analysis GWAS summary statistics.\n\nSubtracting Summary Statistics of One or more Cohorts from Meta-GWAS Results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/MetaSubtract",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-22T08:06:54Z",
    "license": "GPL-3.0",
    "name": "MetaSubtract",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA570",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Summary statistics from a meta-analysis of genome-wide association studies (meta-GWAS) can be used for many follow-up analyses. One valuable application is the creation of polygenic scores. However, if polygenic scores are calculated in a validation cohort that was part of the meta-GWAS consortium, this cohort is not independent and analyses will therefore yield inflated results. The R package 'MetaSubtract' was developed to subtract the results of the validation cohort from meta-GWAS summary statistics analytically. The statistical formulas for a meta-analysis were inverted to compute corrected summary statistics of a meta-GWAS leaving one (or more) cohort(s) out. These formulas have been implemented in MetaSubtract for different meta-analyses methods (fixed effects inverse variance or square root sample size weighted z-score) accounting for no, single or double genomic control correction. Results obtained by MetaSubtract correlate very well to those calculated using the traditional way, i.e. by performing a meta-analysis leaving out the validation cohort. In conclusion, MetaSubtract allows researchers to compute meta-GWAS summary statistics that are independent of the GWAS results of the validation cohort without requiring access to the cohort level GWAS results of the corresponding meta-GWAS consortium.",
                "authors": [
                    {
                        "name": "Nolte I.M."
                    }
                ],
                "date": "2020-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Metasubtract: An R-package to analytically produce leave-one-out meta-analysis GWAS summary statistics"
            },
            "pmcid": "PMC7750933",
            "pmid": "32696040"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ]
}