{
    "additionDate": "2017-08-03T19:07:20Z",
    "biotoolsCURIE": "biotools:mosaic",
    "biotoolsID": "mosaic",
    "credit": [
        {
            "email": "mgonigle@zoology.ubc.ca",
            "name": "Leithen K. M’Gonigle",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.zoology.ubc.ca/~fitzjohn"
        }
    ],
    "description": "Software which calculates the ‘mosaicity’ of a one dimensional hybrid zone. This package uses likelihood to fit step-wise models to one dimensional hybrid zone data, and to estimate the ‘mosaicity’ of the hybrid zone.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.zoology.ubc.ca/prog/mosaic/mosaic-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "http://www.zoology.ubc.ca/prog/mosaic/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mosaic-0-1-1-hybrid-zones-analysis.html"
        }
    ],
    "name": "mosaic",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The spatial genetic composition of hybrid zones exhibits a range of possible patterns, with many characterized by patchy distributions. While several hypothetical explanations exist for the maintenance of these \"mosaic\" hybrid zones, they remain virtually unexplored theoretically. Using computer simulations we investigate the roles of dispersal and assortative mating in the formation and persistence of hybrid zone structure. To quantify mosaic structure we develop a likelihood method, which we apply to simulation and empirical data. We find that long distance dispersal can lead to a patchy distribution that assortative mating can then reinforce, ultimately producing a mosaic capable of persisting over evolutionarily significant periods of time. By reducing the mating success of rare males, assortative mating creates a positive within-patch frequency-dependent selective pressure. Selection against heterozygotes can similarly create a rare-type disadvantage and we show that it can also preserve structure. We find that mosaic structure is maintained across a range of assumptions regarding the form and strength of assortative mating. Interestingly, we find that higher levels of mosaic structure are sometimes observed for intermediate assortment strengths. The high incidence of assortment documented in hybrid zones suggests that it may play a key role in stabilizing their form and structure. © 2009 The Society for the Study of Evolution.",
                "authors": [
                    {
                        "name": "M'Gonigle L.K."
                    },
                    {
                        "name": "Fitzjohn R.G."
                    }
                ],
                "citationCount": 15,
                "date": "2010-02-01T00:00:00Z",
                "journal": "Evolution",
                "title": "Assortative mating and spatial structure in hybrid zones"
            },
            "pmid": "19780815"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1
}