{"credit":[{"email":"Russell.Hamilton@bioch.ox.ac.uk","name":"Russell Hamilton","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.darogan.co.uk/ParticleStats/ParticleStats_UserGuide.pdf"}],"function":[{"operation":[{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"},{"term":"Single particle analysis","uri":"http://edamontology.org/operation_3457"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"publication":[{"abstract":"The study of dynamic cellular processes in living cells is central to biology and is particularly powerful when the motility characteristics of indi-vidual objects within cells can be determined and analysed statistically. However, commercial programs only offer a limited range of inflexible analysis modules and there are currently no open source programs for extensive analysis of particle motility. Here, we describe ParticleStats (http://www.ParticleStats.com), a web server and open source programs, which input the X,Y coordinate positions of objects in time, and output novel analyses, graphical plots and statistics for motile objects. ParticleStats comprises three separate analysis programs. First, ParticleStats: Directionality for the global analysis of polarity, for example microtubule plus end growth in Drosophila oocytes. Second, ParticleStats:Compare for the analysis of saltatory movement in terms of runs and pauses. This can be applied to chromosome segregation and molecular motor-based move-ments. Thirdly ParticleStats:Kymographs for the analysis of kymograph images, for example as applied to separation of chromosomes in mitosis. These analyses have provided key insights into mo-lecular mechanisms that are not possible from qualitative analysis alone and are widely applicable to many other cell biology problems. © The Author(s) 2010. Published by Oxford University Press.","authors":["Hamilton R.S.","Parton R.M.","Oliveira R.A.","Vendra G.","Ball G.","Nasmyth K.","Davis I."],"cit_count":7,"journal":"Nucleic Acids Research","pmid":"20542911","title":"ParticleStats: Open source software for the analysis of particle motility and cytoskeletal polarity","year":"2010-06-11"}],"summary":{"biotoolsCURIE":"biotools:particlestats","biotoolsID":"particlestats","description":"Web server for particle motility analysis such as cytoskeleton. Input is X,Y coordinates of objects in time and output is novel analyses, graphical plots and statistics for motile objects.","homepage":"http://www.ParticleStats.com","name":"ParticleStats"}}