{"credit":[{"email":"guillaume.lettre@mhi-humangenetics.org","name":"Guillaume Lettre","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://op.pgx.ca/faq"}],"function":[{"operation":[{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web service"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"publication":[{"abstract":"Background. Polymerase chain reaction (PCR) remains a simple, flexible, and inexpensive method for enriching genomic regions of interest for next-generation sequencing. In order to utilize PCR in this context, a major challenge facing researchers is how to generate a very large number of functional PCR primers that will successfully generate useable amplicons. For instance, in an exon-only re-sequencing project targeting 100 genes, each with 10 exons, 1,000 pairs of primers are required. In fact, the reality is often more complex as each gene might have several isoforms and large exons need to be divided to maintain the desired amplicon size. With only a list of gene names, our program Optimus Primer (OP) automatically takes into account all these variables, and can generate primers with no need to provide genome coordinates. More importantly however, OP, unlike other primer design programs, uniquely utilizes Primer3 in an iterative manner that allows the user to progressively design up to four iterations of primer designs. Through a single interface, the user can specify up to four different design parameters with different stringencies, thus increasing the probability that a functional PCR primer pair will be designed for all regions of interest in a single pass of the pipeline. Findings. To demonstrate the effectiveness of the program, we designed PCR primers against 77 genes located in loci associated with ulcerative colitis as part of a candidate gene re-sequencing experiment. We achieved an experimental success rate of 93% or 472 out of 508 amplicons spanning the exonic regions of the 77 genes. Moreover, by automatically passing amplicons that failed primer design through three additional iterations of design parameters, we achieved an additional 170 successful primer pairs or 34% more in a single pass of OP than by conventional methods. Conclusion. With only a gene list and PCR parameters, a user can produce hundreds of PCR primer designs for regions of interest with a high probability of success in a very short amount of time. Optimus Primer is an essential tool for researchers who want to pursue PCR-based enrichment strategies for next-generation re-sequencing applications. The program can be accessed via website at http://op.pgx.ca. © 2010 Lettre et al; licensee BioMed Central Ltd.","authors":["Brown A.M.","Lo K.S.","Guelpa P.","Beaudoin M.","Rioux J.D.","Tardif J.-C.","Phillips M.S.","Lettre G."],"cit_count":3,"doi":"10.1186/1756-0500-3-185","journal":"BMC Research Notes","title":"Optimus Primer: A PCR enrichment primer design program for next-generation sequencing of human exonic regions","type":"Primary","year":"2010-08-13"}],"summary":{"biotoolsCURIE":"biotools:optimus_primer","biotoolsID":"optimus_primer","description":"Automated primer design for large-scale resequencing by second generation sequencing","homepage":"http://op.pgx.ca","name":"Optimus Primer"}}