
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            },
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Elsevier B.V.Molecular epidemiology uses genetic information from bacterial isolates to shed light on the population structure and dynamics of pathogens. Bacterial pathogens can now be studied by whole genome sequencing, but for some well-studied pathogens such as Mycobacterium tuberculosis a wealth of information is also available from other sources such as spoligotyping and multi-locus variable-number-tandem-repeats (VNTR). Isolates are also frequently tested for susceptibility to antibiotics. Methods of analysis are available for each type of data but it would be informative to combine multiple sources of information into a single analysis or visualisation. Here, we propose and implement a simple way to visualise genotypes along with drug resistance profiles for multiple drugs. We also present a way to combine information from different markers to aid in visualising relationships among isolates. These methods help to reveal the origins and spread of multi-drug resistant lineages of pathogens. We introduce a new computational package, MERCAT (Molecular Epidemiology Researcher's Collection of Analytical Tools), for analysing genotypic data from bacterial isolates. The software is available as an open source package in the statistical language R with a user-friendly interface using R Shiny. Although we focus on tuberculosis and the major molecular markers used to understand tuberculosis transmission – multilocus VNTR-typing (MLVA or MIRU) and spoligotyping – the methods and tools can be applied to other bacteria and can be easily tailored to other genetic markers such as SNP data from whole genome sequencing.",
            "authors": [
                "Aandahl R.Z.",
                "Bhatia S.",
                "Vaudagnotto N.",
                "Street A.G.",
                "Francis A.R.",
                "Tanaka M.M."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.MEEGID.2019.104043",
            "journal": "Infection, Genetics and Evolution",
            "pmid": "31683007",
            "title": "MERCAT: Visualising molecular epidemiology data combining genetic markers and drug resistance profiles",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:MERCAT",
        "biotoolsID": "MERCAT",
        "description": "Visualising molecular epidemiology data combining genetic markers and drug resistance profiles.\n\nMolecular epidemiology uses genetic information from bacterial isolates to shed light on the population structure and dynamics of pathogens. Bacterial pathogens can now be studied by whole genome sequencing, but for some well-studied pathogens such as Mycobacterium tuberculosis a wealth of information is also available from other sources such as spoligotyping and multi-locus variable-number-tandem-repeats (VNTR). Isolates are also frequently tested for susceptibility to antibiotics. Methods of analysis are available for each type of data but it would be informative to combine multiple sources of information into a single analysis or visualisation. Here, we propose and implement a simple way to visualise genotypes along with drug resistance profiles for multiple drugs.\n\n||| HOMEPAGE MISSING!",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31683007",
        "name": "MERCAT"
    }
}