{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T13:06:14Z",
    "biotoolsCURIE": "biotools:C-InterSecture",
    "biotoolsID": "C-InterSecture",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "nuriddinov@bionet.nsc.ru",
            "name": "M. Nuriddinov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "C-InterSecture (Computional tool for InterSpecies analysis of genome architecture) - pipeline to cross-species comparison of Hi-C map. C-InterSecture was designed to liftover contacts between species, compare 3-dimensional organization of defined genomic regions, such as TADs, and analyze statistically individual contact frequencies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/NuriddinovMA/C-InterSecture/blob/master/ReadMe.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NuriddinovMA/C-InterSecture",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/NuriddinovMA/C-InterSecture/issues"
        }
    ],
    "maturity": "Mature",
    "name": "C-InterSecture",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz415",
            "metadata": {
                "abstract": "© 2019 The Author(s).Motivation: Recent development of Hi-C technique, a biochemical method to study 3D genome architecture, provided large amount of information describing spatial organization of chromosomes in different cell types and species. While multiple tools are available for analysis and comparison of Hi-C data of different cell types, there are almost no resources for systematic interspecies comparison. Results: To fill this gap, we developed C-InterSecture, a computational pipeline allowing systematic comparison of genome architecture between species. C-InterSecture allows statistical comparison of contact frequencies of individual pairs of loci, as well as interspecies comparison of contacts pattern within defined genomic regions, i.e. topologically associated domains. We employed C-InterSecture to compare mammalian and avian genome organization and showed how evolutionary changes of genomic distance affect 3D architecture of vertebrate's genome. Availability and implementation: C-InterSecture is implemented as a collection of python scripts freely available on GitHub repository at https://github.com/NuriddinovMA/C-InterSecture. Jucebox-compatible. hic files produced by C-InterSecture are available at http://genedev.bionet.nsc.ru/site/CIntersecture.html. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Nuriddinov M."
                    },
                    {
                        "name": "Fishman V."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "C-InterSecture-a computational tool for interspecies comparison of genome architecture"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        }
    ],
    "validated": 1
}