
{
    "credit": [
        {
            "email": "biorg.fiu@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://biorg.cis.fiu.edu/"
        },
        {
            "email": "giri.narasimhan@fiu.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://vphylomm.sourceforge.net/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Virology",
                "uri": "http://edamontology.org/topic_0781"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Medicinal chemistry",
                "uri": "http://edamontology.org/topic_0209"
            },
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            },
            {
                "term": "Virology",
                "uri": "http://edamontology.org/topic_0781"
            },
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/vphylomm-20090731-reconstructs-mutational-pathways-drug-resistance.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Modern HIV-1, hepatitis B virus and hepatitis C virus antiviral therapies have been successful at keeping viruses suppressed for prolonged periods of time, but therapy failures attributable to the emergence of drug resistant mutations continue to be a distressing reminder that no therapy can fully eradicate these viruses from their host organisms. To better understand the emergence of drug resistance, we combined phylogenetic and statistical models of viral evolution in a 2-phase computational approach that reconstructs mutational pathways of drug resistance. Results: The first phase of the algorithm involved the modeling of the evolution of the virus within the human host environment. The inclusion of longitudinal clonal sequence data was a key aspect of the model due to the progressive fashion in which multiple mutations become linked in the same genome creating drug resistant genotypes. The second phase involved the development of a Markov model to calculate the transition probabilities between the different genotypes. The proposed method was applied to data from an HIV-1 Efavirenz clinical trial study. The obtained model revealed the direction of evolution over time with greater detail than previous models. Our results show that the mutational pathways facilitate the identification of fast versus slow evolutionary pathways to drug resistance. © The Author 2009. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Buendia P.",
                "Cadwallader B.",
                "Degruttola V."
            ],
            "cit_count": 9,
            "journal": "Bioinformatics",
            "pmid": "19654117",
            "title": "A phylogenetic and Markov model approach for the reconstruction of mutational pathways of drug resistance",
            "year": "2009-10-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:vphylomm",
        "biotoolsID": "vphylomm",
        "description": "The purpose of the tool is to generate a transition model showing the mutational pathways of drug resistance for viruses under drug pressure.",
        "homepage": "http://vphylomm.sourceforge.net/",
        "name": "vPhyloMM"
    }
}