{
    "additionDate": "2020-01-09T18:01:20Z",
    "biotoolsCURIE": "biotools:DPre",
    "biotoolsID": "DPre",
    "confidence_flag": "tool",
    "description": "DPre: Computational identification of differentiation bias and genes underlaying cell type conversions.\nDPre is a bioinformatic tool that enables the user to explore cell type conversion/ differentiation experiments. DPre may take the expression or the differentially regulated genes of the samples to rate transcriptional similarity with a reference dataset, the targets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LoaloaF/DPre",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-22T10:36:47Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/LoaloaF/DPre/issues"
        }
    ],
    "name": "DPre",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ789",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Summary: Cells are generally resistant to cell type conversions, but can be converted by the application of growth factors, chemical inhibitors and ectopic expression of genes. However, it remains difficult to accurately identify the destination cell type or differentiation bias when these techniques are used to alter cell type. Consequently, there is demand for computational techniques that can help researchers understand both the cell type and differentiation bias. While advanced tools identifying cell types exist for single cell data and the deconvolution of mixed cell populations, the problem of exploring partially differentiated cells of indeterminate transcriptional identity has not been addressed. To fill this gap, we developed driver-predictor, which relies on scoring per gene transcriptional similarity between RNA-Seq datasets to reveal directional bias of differentiation. By comparing against large cell type transcriptome libraries or a desired target expression profile, the tool enables the user to visualize both the changes in transcriptional identity as well as the genes accounting for the cell type changes. This software will be a powerful tool for researchers to explore in vitro experiments that involve cell type conversions. Availability and implementation: Source code is open source under the MIT license and is freely available on https://github.com/LoaloaF/DPre.",
                "authors": [
                    {
                        "name": "Babarinde I.A."
                    },
                    {
                        "name": "Fu X."
                    },
                    {
                        "name": "He F."
                    },
                    {
                        "name": "Hutchins A.P."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Steffens S."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DPre: Computational identification of differentiation bias and genes underlying cell type conversions"
            },
            "pmid": "31621827"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
