{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:17:44Z",
    "biotoolsCURIE": "biotools:aFold",
    "biotoolsID": "aFold",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wyang@zoologie.uni-kiel.de",
            "name": "Wentao Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hschulenburg@zoologie.uni-kiel.de",
            "name": "Hinrich Schulenburg",
            "orcidid": "https://orcid.org/0000-0002-1413-913X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Using polynomial uncertainty modelling for differential gene expression estimation from RNA sequencing data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/devel/bioc/manuals/ABSSeq/man/ABSSeq.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://bioconductor.org/packages/devel/bioc/src/contrib/ABSSeq_1.39.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/devel/bioc/html/ABSSeq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "aFold",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12864-019-5686-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Data normalization and identification of significant differential expression represent crucial steps in RNA-Seq analysis. Many available tools rely on assumptions that are often not met by real data, including the common assumption of symmetrical distribution of up- and down-regulated genes, the presence of only few differentially expressed genes and/or few outliers. Moreover, the cut-off for selecting significantly differentially expressed genes for further downstream analysis often depend on arbitrary choices. Results: We here introduce a new tool for estimating differential expression in noisy real-life data. It employs a novel normalization procedure (qtotal), which takes account of the overall distribution of read counts for data standardization enhancing reliable identification of differential gene expression, especially in case of asymmetrical distributions of up- and downregulated genes. The tool then introduces a polynomial algorithm (aFold) to model the uncertainty of read counts across treatments and genes. We extensively benchmark aFold on a variety of simulated and validated real-life data sets (e.g. ABRF, SEQC and MAQC-II) and show a higher ability to correctly identify differentially expressed genes under most tested conditions. aFold infers fold change values that are comparable across experiments, thereby facilitating data clustering, visualization, and other downstream applications. Conclusions: We here present a new transcriptomics analysis tool that includes both a data normalization method and a differential expression analysis approach. The new tool is shown to enhance reliable identification of significant differential expression across distinct data distributions. It outcompetes alternative procedures in case of asymmetrical distributions of up- versus down-regulated genes and also the presence of outliers, all common to real data sets.",
                "authors": [
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Rosenstiel P."
                    },
                    {
                        "name": "Schulenburg H."
                    }
                ],
                "date": "2019-05-10T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "AFold - Using polynomial uncertainty modelling for differential gene expression estimation from RNA sequencing data"
            },
            "pmcid": "PMC6509820",
            "pmid": "31077153",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}