{
    "additionDate": "2019-11-14T19:36:07Z",
    "biotoolsCURIE": "biotools:TOAST",
    "biotoolsID": "TOAST",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hao.wu@emory.edu",
            "name": "Hao Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "improving reference-free cell composition estimation by cross-cell type differential analysis | Tools for the analysis of heterogeneous tissues | This package is devoted to analyzing high-throughput data (e.g. gene expression microarray, DNA methylation microarray, RNA-seq) from complex tissues. Current functionalities include 1. detect cell-type specific or cross-cell type differential signals 2. improve variable selection in reference-free deconvolution | DNAMethylation, DifferentialExpression, DifferentialMethylation, Epigenetics, GeneExpression, GeneTarget, MethylationArray, Microarray, Software",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/TOAST",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T16:29:49Z",
    "license": "GPL-2.0",
    "name": "TOAST",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13059-019-1778-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).In the analysis of high-throughput data from complex samples, cell composition is an important factor that needs to be accounted for. Except for a limited number of tissues with known pure cell type profiles, a majority of genomics and epigenetics data relies on the \"reference-free deconvolution\" methods to estimate cell composition. We develop a novel computational method to improve reference-free deconvolution, which iteratively searches for cell type-specific features and performs composition estimation. Simulation studies and applications to six real datasets including both DNA methylation and gene expression data demonstrate favorable performance of the proposed method. TOAST is available at https://bioconductor.org/packages/TOAST.",
                "authors": [
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Wu H."
                    }
                ],
                "citationCount": 4,
                "date": "2019-09-04T00:00:00Z",
                "journal": "Genome Biology",
                "title": "TOAST: Improving reference-free cell composition estimation by cross-cell type differential analysis"
            },
            "pmcid": "PMC6727351",
            "pmid": "31484546"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}