{"credit":[{"email":"achatzi@eie.gr","name":"Aristotelis Chatziioannou","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"epilalis@eie.gr","name":"Eleftherios Pilalis","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"thkoutsandreas@eie.gr","name":"Theodoros Koutsandreas","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Ontology comparison","uri":"http://edamontology.org/operation_3352"},{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"},{"term":"Gene-set enrichment analysis","uri":"http://edamontology.org/operation_2436"},{"term":"Gene regulatory network analysis","uri":"http://edamontology.org/operation_1781"},{"term":"Gene to pathway mapping","uri":"http://edamontology.org/operation_0533"},{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"},{"term":"Differential gene expression analysis","uri":"http://edamontology.org/operation_3223"},{"term":"Ontology visualisation","uri":"http://edamontology.org/operation_3559"}]}],"labels":{"language":["PHP","Java","SQL"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Functional genomics","uri":"http://edamontology.org/topic_0085"},{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"},{"term":"Pharmacogenomics","uri":"http://edamontology.org/topic_0208"}]},"publication":[{"abstract":"StRAnGER is a web application for the automated statistical analysis of annotated gene profiling experiments, exploiting controlled biological vocabularies, like the Gene Ontology or the KEGG pathways terms. Starting from annotated lists of differentially expressed genes and gene enrichment scores, regarding the terms of each vocabulary, StRAnGER repartitions and reorders the initial distribution of terms to define a new distribution of elements. Each element pools terms holding the same enrichment score. The new distribution thus derived, is reordered in a decreasing order to the right, according to the observation score of the elements, while elements with the same score, are sorted again in a decreasing order of their enrichment scores. By applying bootstrapping techniques, a corrected measure of the statistical significance of these elements is derived, which enables the selection of terms mapped to these elements, unambiguously associated with respective significant gene sets. The selected terms are immunized against the bias infiltrating statistical enrichment analyses, producing technically very high statistical scores, due to the finite nature of the data population. Besides their high statistical score, another selection criterion for the terms is the number of their members, something that incurs a biological prioritization in line with a Systems Biology context. The output derived, represents a detailed ranked list of significant terms, which constitute a starting point for further functional analysis. © 2011 Chatziioannou and Moulos.","authors":["Chatziioannou A.A.","Moulos P."],"cit_count":19,"doi":"10.3389/fnins.2011.00008","journal":"Frontiers in Neuroscience","title":"Exploiting statistical methodologies and controlled vocabularies for prioritized functional analysis of genomic experiments: The StRAnGER web application","year":"2011-12-01"},{"abstract":"The ever-increasing use of ontologies in modern biological analysis and interpretation facilitates the understanding of the cellular procedures, their hierarchical organization, and their potential interactions at a systems level. Currently, the gene ontology serves as a paradigm, where through the annotation of whole genomes of certain organisms, genes subsets selected, either from high-throughput experiments or with an established pivotal role regarding the probed disease, can act as a starting point for the exploration of their underlying functional interconnections. This may also aid the elucidation of hidden regulatory mechanisms among genes. Reverse engineering the functional relevance of genes to specific cellular pathways and vice versa, through the exploitation of the inner structure of the ontological vocabularies, may help impart insight regarding the identification and prioritization of the critical role of specific genes. The proposed graph-theoretical method is showcased in a pancreatic cancer and a T-cell acute lymphoblastic leukemia gene set, incorporating edge and Resnik semantic similarity metrics, and systematically evaluated regarding its performance. © 2006 IEEE.","authors":["Moutselos K.","Maglogiannis I.","Chatziioannou A."],"cit_count":15,"doi":"10.1109/TBME.2011.2164794","journal":"IEEE Transactions on Biomedical Engineering","title":"GOrevenge: A novel generic reverse engineering method for the identification of critical molecular players, through the use of ontologies","year":"2011-12-01"},{"abstract":"© 2015 The Authors.Gene expression analysis, using high throughput genomic technologies,has become an indispensable step for the meaningful interpretation of the underlying molecular complexity, which shapes the phenotypic manifestation of the investigated biological mechanism. The modularity of the cellular response to different experimental conditions can be comprehended through the exploitation of molecular pathway databases, which offer a controlled, curated background for statistical enrichment analysis. Existing tools enable pathway analysis, visualization, or pathway merging but none integrates a fully automated workflow, combining all above-mentioned modules and destined to non-programmer users. We introduce an online web application, named KEGG Enriched Network Visualizer (KENeV), which enables a fully automated workflow starting from a list of differentially expressed genes and deriving the enriched KEGG metabolic and signaling pathways, merged into two respective, non-redundant super-networks. The final networks can be downloaded as SBML files, for further analysis, or instantly visualized through an interactive visualization module. In conclusion, KENeV (available online at http://www.grissom.gr/kenev) provides an integrative tool, suitable for users with no programming experience, for the functional interpretation, at both the metabolic and signaling level, of differentially expressed gene subsets deriving from genomic experiments.","authors":["Pilalis E.","Koutsandreas T.","Valavanis I.","Athanasiadis E.","Spyrou G.","Chatziioannou A."],"cit_count":3,"doi":"10.1016/j.csbj.2015.03.009","journal":"Computational and Structural Biotechnology Journal","title":"KENeV: A web-application for the automated reconstruction and visualization of the enriched metabolic and signaling super-pathways deriving from genomic experiments","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:biotranslator","biotoolsID":"biotranslator","description":"BioTranslator enables functional interpretation of genomic experiments through pathways analysis with a variety of biomedical ontologies, regulatory genes prioritization and protein network visualization.","homepage":"http://mebioinfo.ekt.gr/","name":"BioTranslator"}}