{
    "additionDate": "2021-01-18T12:32:05Z",
    "biotoolsCURIE": "biotools:srnatargetdigger",
    "biotoolsID": "srnatargetdigger",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shaocg@zjhu.edu.cn",
            "name": "Chaogang Shao",
            "typeEntity": "Person"
        }
    ],
    "description": "A bioinformatics software for bidirectional identification of sRNA-target pairs with co-regulatory sRNAs information.\n\nSome categories of small RNAs (sRNAs) in plants, such as microRNA (miRNAs), trans-acting small interfering RNAs (ta-siRNAs) and small interfering RNAs (siRNAs), often regulate the expressions of target genes through cleavage of complementary mRNAs and play an important role in the biological processes such as plant development, metabolism and diseases resistance. Identifying the target genes of these sRNAs is an important step in our understanding of their functions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinfolab.cn/sRNATD.html",
    "lastUpdate": "2021-02-21T15:20:28Z",
    "name": "sRNATargetDigger",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0244480",
            "metadata": {
                "abstract": "© 2020 Ye et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Identification of the target genes of microRNAs (miRNAs), trans-acting small interfering RNAs (ta-siRNAs), and small interfering RNAs (siRNAs) is an important step for understanding their regulatory roles in plants. In recent years, many bioinformatics software packages based on small RNA (sRNA) high-throughput sequencing (HTS) and degradome sequencing data analysis have provided strong technical support for large-scale mining of sRNA-target pairs. However, sRNA-target regulation is achieved using a complex network of interactions since one transcript might be co-regulated by multiple sRNAs and one sRNA may also affect multiple targets. Currently used mining software can realize the mining of multiple unknown targets using known sRNA, but it cannot rule out the possibility of co-regulation of the same target by other unknown sRNAs. Hence, the obtained regulatory network may be incomplete. We have developed a new mining software, sRNATargetDigger, that includes two function modules, \"Forward Digger\"and \"Reverse Digger\", which can identify regulatory sRNA-target pairs bidirectionally. Moreover, it has the ability to identify unknown sRNAs co-regulating the same target, in order to obtain a more authentic and reliable sRNA-target regulatory network. Upon re-examination of the published sRNA-target pairs in Arabidopsis thaliana, sRNATargetDigger found 170 novel co-regulatory sRNA-target pairs. This software can be downloaded from http://www.bioinfolab.cn/sRNATD.html.",
                "authors": [
                    {
                        "name": "Guo R."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Meng Y."
                    },
                    {
                        "name": "Shao C."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Ye X."
                    },
                    {
                        "name": "Yu L."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SRNATargetDigger: A bioinformatics software for bidirectional identification of sRNA-target pairs with co-regulatory sRNAs information"
            },
            "pmid": "33370386"
        }
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
