{
    "additionDate": "2024-01-26T10:22:23.856617Z",
    "biotoolsCURIE": "biotools:neodb",
    "biotoolsID": "neodb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liuxs@shanghaitech.edu.cn",
            "name": "Xue-Song Liu",
            "orcidid": "https://orcid.org/0000-0002-7736-0077",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive neoantigen database and discovery platform for cancer immunotherapy.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "https://liuxslab.com/Neodb/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:19:55.382982Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/XSLiuLab/Neodb"
        }
    ],
    "name": "Neodb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/database/baad041",
            "metadata": {
                "abstract": "Neoantigens derived from somatic deoxyribonucleic acid alterations are ideal cancer-specific targets. However, integrated platform for neoantigen discovery is urgently needed. Recently, many scattered experimental evidences suggest that some neoantigens are immunogenic, and comprehensive collection of these experimentally validated neoantigens is still lacking. Here, we have integrated the commonly used tools in the current neoantigen discovery process to form a comprehensive web-based analysis platform. To identify experimental evidences supporting the immunogenicity of neoantigens, we performed comprehensive literature search and constructed the database. The collection of public neoantigens was obtained by using comprehensive features to filter the potential neoantigens from recurrent driver mutations. Importantly, we constructed a graph neural network (GNN) model (Immuno-GNN) using an attention mechanism to consider the spatial interactions between human leukocyte antigen and antigenic peptides for neoantigen immunogenicity prediction. The new easy-to-use R/Shiny web-based neoantigen database and discovery platform, Neodb, contains currently the largest number of experimentally validated neoantigens. In addition to validated neoantigen, Neodb also includes three additional modules for facilitating neoantigen prediction and analysis, including 'Tools' module (comprehensive neoantigen prediction tools); 'Driver-Neo' module (collection of public neoantigens derived from recurrent mutations) and 'Immuno-GNN' module (a novel immunogenicity prediction tool based on a GNN). Immuno-GNN shows improved performance compared with known methods and also represents the first application of GNN model in neoantigen immunogenicity prediction. The construction of Neodb will facilitate the study of neoantigen immunogenicity and the clinical application of neoantigen-based cancer immunotherapy. Database URL https://liuxslab.com/Neodb/",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Diao K."
                    },
                    {
                        "name": "Liu X.-S."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wu T."
                    },
                    {
                        "name": "Yao H."
                    }
                ],
                "citationCount": 5,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Neodb: a comprehensive neoantigen database and discovery platform for cancer immunotherapy"
            },
            "pmcid": "PMC10263465",
            "pmid": "37311149"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
