{
    "additionDate": "2017-01-17T15:03:28Z",
    "biotoolsCURIE": "biotools:quaternaryprod",
    "biotoolsID": "quaternaryprod",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "cfakhry@cs.umb.edu",
            "name": "Carl Tony Fakhry",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package that performs causal reasoning on biological networks, including publicly available networks such as String-db. It is a free alternative to commercial products such as Quiagen and Inginuity pathway analysis. For a given a set of differentially expressed genes, it computes the significance of upstream regulators in the network by performing causal reasoning using the Quaternary Dot Product Scoring Statistic, Ternary Dot product Scoring Statistic and Fisher's exact test.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/QuaternaryProd.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/QuaternaryProd_1.2.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/QuaternaryProd.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T16:14:52Z",
    "license": "GPL-3.0",
    "name": "QuaternaryProd",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gks1094",
            "metadata": {
                "abstract": "Complete knowledge of all direct and indirect interactions between proteins in a given cell would represent an important milestone towards a comprehensive description of cellular mechanisms and functions. Although this goal is still elusive, considerable progress has been made - particularly for certain model organisms and functional systems. Currently, protein interactions and associations are annotated at various levels of detail in online resources, ranging from raw data repositories to highly formalized pathway databases. For many applications, a global view of all the available interaction data is desirable, including lower-quality data and/or computational predictions. The STRING database (http://string-db.org/) aims to provide such a global perspective for as many organisms as feasible. Known and predicted associations are scored and integrated, resulting in comprehensive protein networks covering >1100 organisms. Here, we describe the update to version 9.1 of STRING, introducing several improvements: (i) we extend the automated mining of scientific texts for interaction information, to now also include full-text articles; (ii) we entirely re-designed the algorithm for transferring interactions from one model organism to the other; and (iii) we provide users with statistical information on any functional enrichment observed in their networks. © The Author(s) 2012.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Franceschini A."
                    },
                    {
                        "name": "Frankild S."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Kuhn M."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "Minguez P."
                    },
                    {
                        "name": "Roth A."
                    },
                    {
                        "name": "Simonovic M."
                    },
                    {
                        "name": "Szklarczyk D."
                    },
                    {
                        "name": "Von Mering C."
                    }
                ],
                "citationCount": 2902,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "STRING v9.1: Protein-protein interaction networks, with increased coverage and integration"
            },
            "pmcid": "PMC3531103",
            "pmid": "23203871",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.0"
    ]
}
