{
    "additionDate": "2021-03-19T09:12:01Z",
    "biotoolsCURIE": "biotools:mscdpb",
    "biotoolsID": "mscdpb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dxqllp@163.com",
            "name": "Xiuquan Du",
            "orcidid": "https://orcid.org/0000-0001-7913-7605"
        }
    ],
    "description": "mscDPB is a tool that uses Chou's 5-step rule to predict DNA-protein binding with nulti-scale complementary feature.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://121.5.71.120/mscDPB/",
    "lastUpdate": "2021-04-10T10:04:40Z",
    "name": "mscDPB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00864",
            "metadata": {
                "abstract": "© It is well known that DNA-protein binding (DPB) prediction is not only beneficial to understand the regulation mechanism of gene expression but also a challenging task in the field of computational biology. Traditional methods for DPB prediction that depend on manually extracted features may lead to classification errors. Recently, deep learning such as convolutional neural network (CNN) has been successfully applied to classification tasks and improved DPB prediction performance significantly. Yet, these methods are based on the original DNA sequence modeling, ignoring the hidden complex dependency and complementarity between multiple sequence features. In consideration of this problem, we propose a method to fuse different sequence features and analyze them systematically through multi-scale CNN. First, sliding windows of specified lengths are set on distinct DNA sequences to generate multiple sequence features with unequal lengths. Second, multiple feature sequences are fused and encoded for feature representation. Third, multi-scale CNN with different binding motif lengths is used to automatically learn and mine the influence of internal attributes and hidden complex relations between the fusion sequence features and make full use of the complementary advantages of extracted CNN features to predict DPB. When our model is applied to 690 ChIP-seq datasets, it achieves an average AUC of 0.9112, which is significantly better than the latest methods. The results show that our method is effective for DPB prediction and is freely available at http://121.5.71.120/mscDPB/.",
                "authors": [
                    {
                        "name": "Du X."
                    },
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Li S."
                    }
                ],
                "date": "2021-03-05T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Using Chou's 5-Step Rule to Predict DNA-Protein Binding with Multi-scale Complementary Feature"
            },
            "pmid": "33522829"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
