{
    "additionDate": "2020-01-09T18:11:03Z",
    "biotoolsCURIE": "biotools:SOMANZ",
    "biotoolsID": "SOMANZ",
    "confidence_flag": "medium",
    "description": "SOMANZ position paper on the management of nausea and vomiting in pregnancy and hyperemesis gravidarum.\n\nAPPROVAL OF WRITTEN GUIDELINES BY SOMANZ.\n\nThere are two proposed methods of guideline development processes as detailed below:-.\n\nIn 2017 SOMANZ published a multi-disciplinary guideline for the management of sepsis in pregnancy and the post-partum period. We took the broadest definition of sepsis, including the investigation of viral and non-infectious sepsis. We have included three short easy diagnostic criteria for the triage of the acute patient: Respiratory rate, Systolic Blood Pressure and Alert/non-alert which trigger a management pathway.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'auditable'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.somanz.org/guidelines.asp",
    "lastUpdate": "2020-01-09T18:11:03Z",
    "name": "SOMANZ",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/AJO.13084",
            "metadata": {
                "abstract": "© 2019 The Royal Australian and New Zealand College of Obstetricians and GynaecologistsThis is a brief summary of the Society of Obstetric Medicine of Australia and New Zealand (SOMANZ) evidence-based guideline for the management of nausea and vomiting of pregnancy (NVP) and hyperemesis gravidarum (HG). The full guideline and executive summary including auditable outcomes are freely available on the SOMANZ website [https://www.somanz.org/guidelines.asp]. The guideline includes a proposed SOMANZ definition of NVP and HG and evidence-based practical advice regarding the investigation and management of NVP, HG and associated conditions including thyroid dysfunction. A practical algorithm for assessment and management as well as an individual patient management plan and self-assessment tools are included.",
                "authors": [
                    {
                        "name": "Lowe S.A."
                    },
                    {
                        "name": "Armstrong G."
                    },
                    {
                        "name": "Beech A."
                    },
                    {
                        "name": "Bowyer L."
                    },
                    {
                        "name": "Grzeskowiak L."
                    },
                    {
                        "name": "Marnoch C.A."
                    },
                    {
                        "name": "Robinson H."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Australian and New Zealand Journal of Obstetrics and Gynaecology",
                "title": "SOMANZ position paper on the management of nausea and vomiting in pregnancy and hyperemesis gravidarum"
            },
            "pmid": "31657004"
        }
    ],
    "topic": [
        {
            "term": "Gynaecology and obstetrics",
            "uri": "http://edamontology.org/topic_3411"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ]
}