{
    "accessibility": "Open access",
    "additionDate": "2023-03-18T23:40:19.239953Z",
    "biotoolsCURIE": "biotools:mr-bias",
    "biotoolsID": "mr-bias",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Rick Franich"
        },
        {
            "name": "Zachary Chin"
        },
        {
            "name": "James C Korte",
            "orcidid": "https://orcid.org/0000-0001-9152-1319"
        },
        {
            "name": "Lois Holloway",
            "orcidid": "https://orcid.org/0000-0003-4337-2165"
        },
        {
            "name": "Madeline Carr",
            "orcidid": "https://orcid.org/0000-0002-4915-5076"
        }
    ],
    "description": "An automated open-source tool for the ISMRM/NIST system phantom.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JamesCKorte/mrbias",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:53:30.143381Z",
    "license": "BSD-3-Clause",
    "name": "MR-BIAS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1088/1361-6560/acbcbb",
            "metadata": {
                "abstract": "Objective. To provide an open-source software for repeatable and efficient quantification of T 1 and T 2 relaxation times with the ISMRM/NIST system phantom. Quantitative magnetic resonance imaging (qMRI) biomarkers have the potential to improve disease detection, staging and monitoring of treatment response. Reference objects, such as the system phantom, play a major role in translating qMRI methods into the clinic. The currently available open-source software for ISMRM/NIST system phantom analysis, Phantom Viewer (PV), includes manual steps that are subject to variability. Approach. We developed the Magnetic Resonance BIomarker Assessment Software (MR-BIAS) to automatically extract system phantom relaxation times. The inter-observer variability (IOV) and time efficiency of MR-BIAS and PV was observed in six volunteers analysing three phantom datasets. The IOV was measured with the coefficient of variation (CV) of percent bias (%bias) in T 1 and T 2 with respect to NMR reference values. The accuracy of MR-BIAS was compared to a custom script from a published study of twelve phantom datasets. This included comparison of overall bias and %bias for variable inversion recovery (T 1VIR), variable flip angle (T 1VFA) and multiple spin-echo (T 2MSE) relaxation models. Main results. MR-BIAS had a lower mean CV with T 1VIR (0.03%) and T 2MSE (0.05%) in comparison to PV with T 1VIR (1.28%) and T 2MSE (4.55%). The mean analysis duration was 9.7 times faster for MR-BIAS (0.8 min) than PV (7.6 min). There was no statistically significant difference in the overall bias, or the %bias for the majority of ROIs, as calculated by MR-BIAS or the custom script for all models. Significance. MR-BIAS has demonstrated repeatable and efficient analysis of the ISMRM/NIST system phantom, with comparable accuracy to previous studies. The software is freely available to the MRI community, providing a framework to automate required analysis tasks, with the flexibility to explore open questions and accelerate biomarker research.",
                "authors": [
                    {
                        "name": "Carr M."
                    },
                    {
                        "name": "Chin Z."
                    },
                    {
                        "name": "Franich R."
                    },
                    {
                        "name": "Holloway L."
                    },
                    {
                        "name": "Korte J.C."
                    }
                ],
                "citationCount": 2,
                "date": "2023-03-21T00:00:00Z",
                "journal": "Physics in Medicine and Biology",
                "title": "Magnetic resonance biomarker assessment software (MR-BIAS): an automated open-source tool for the ISMRM/NIST system phantom"
            },
            "pmid": "36796102"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ]
}
