{
    "additionDate": "2021-01-18T09:50:15Z",
    "biotoolsCURIE": "biotools:proteus-engineering",
    "biotoolsID": "proteus-engineering",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "diegomariano@ufmg.br",
            "name": "Diego Mariano",
            "orcidid": "https://orcid.org/0000-0002-5899-2052",
            "typeEntity": "Person"
        },
        {
            "email": "nagem@icb.ufmg.br",
            "name": "Ronaldo A. P. Nagem",
            "typeEntity": "Person"
        },
        {
            "email": "raquelcm@dcc.ufmg.br",
            "name": "Raquel C. de Melo-Minardi",
            "typeEntity": "Person"
        }
    ],
    "description": "An algorithm for proposing stabilizing mutation pairs based on interactions observed in known protein 3D structures.\n\nProtein engineering using Proteus.\n\nProteus is a Webtool, database, and method to propose mutations for proteins used in industrial applications. Proteus uses the hypothesis of mutation transference of residue pairs in contact detected in PDB to suggest mutations for a target protein.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                }
            ]
        }
    ],
    "homepage": "http://proteus.dcc.ufmg.br",
    "lastUpdate": "2021-01-28T16:50:59Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://proteus.dcc.ufmg.br/result/id/"
        }
    ],
    "name": "Proteus",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03575-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Protein engineering has many applications for industry, such as the development of new drugs, vaccines, treatment therapies, food, and biofuel production. A common way to engineer a protein is to perform mutations in functionally essential residues to optimize their function. However, the discovery of beneficial mutations for proteins is a complex task, with a time-consuming and high cost for experimental validation. Hence, computational approaches have been used to propose new insights for experiments narrowing the search space and reducing the costs. Results: In this study, we developed Proteus (an acronym for Protein Engineering Supporter), a new algorithm for proposing mutation pairs in a target 3D structure. These suggestions are based on contacts observed in other known structures from Protein Data Bank (PDB). Proteus' basic assumption is that if a non-interacting pair of amino acid residues in the target structure is exchanged to an interacting pair, this could enhance protein stability. This trade is only allowed if the main-chain conformation of the residues involved in the contact is conserved. Furthermore, no steric impediment is expected between the proposed mutations and the surrounding protein atoms. To evaluate Proteus, we performed two case studies with proteins of industrial interests. In the first case study, we evaluated if the mutations suggested by Proteus for four protein structures enhance the number of inter-residue contacts. Our results suggest that most mutations proposed by Proteus increase the number of interactions into the protein. In the second case study, we used Proteus to suggest mutations for a lysozyme protein. Then, we compared Proteus' outcomes to mutations with available experimental evidence reported in the ProTherm database. Four mutations, in which our results agree with the experimental data, were found. This could be initial evidence that changes in the side-chain of some residues do not cause disturbances that harm protein structure stability. Conclusion: We believe that Proteus could be used combined with other methods to give new insights into the rational development of engineered proteins. Proteus user-friendly web-based tool is available at < http://proteus.dcc.ufmg.br >.",
                "authors": [
                    {
                        "name": "Barroso J.R.M.S."
                    },
                    {
                        "name": "Mariano D."
                    },
                    {
                        "name": "Dias S.R."
                    },
                    {
                        "name": "Rocha R.E.O."
                    },
                    {
                        "name": "Santos L.H."
                    },
                    {
                        "name": "Nagem R.A.P."
                    },
                    {
                        "name": "De Melo-Minardi R.C."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Proteus: An algorithm for proposing stabilizing mutation pairs based on interactions observed in known protein 3D structures"
            },
            "pmcid": "PMC7330979",
            "pmid": "32611389"
        }
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}