
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinf.mii.lu.lv/index.html"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://passim.sourceforge.net/tutorial.swf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Submission",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Data submission",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Information management",
                "uri": "http://edamontology.org/topic_0605"
            },
            {
                "term": "Studies",
                "uri": "http://edamontology.org/topic_3678"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/passim-patient-sample-system-information-management.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: One of the crucial aspects of day-to-day laboratory information management is collection, storage and retrieval of information about research subjects and biomedical samples. An efficient link between sample data and experiment results is absolutely imperative for a successful outcome of a biomedical study. Currently available software solutions are largely limited to large-scale, expensive commercial Laboratory Information Management Systems (LIMS). Acquiring such LIMS indeed can bring laboratory information management to a higher level, but often implies sufficient investment of time, effort and funds, which are not always available. There is a clear need for lightweight open source systems for patient and sample information management. Results: We present a web-based tool for submission, management and retrieval of sample and research subject data. The system secures confidentiality by separating anonymized sample information from individuals' records. It is simple and generic, and can be customised for various biomedical studies. Information can be both entered and accessed using the same web interface. User groups and their privileges can be defined. The system is open-source and is supplied with an on-line tutorial and necessary documentation. It has proven to be successful in a large international collaborative project. Conclusion: The presented system closes the gap between the need and the availability of lightweight software solutions for managing information in biomedical studies involving human research subjects. © 2007 Viksna et al; licensee BioMed Central Ltd.",
            "authors": [
                "Viksna J.",
                "Celms E.",
                "Opmanis M.",
                "Podnieks K.",
                "Rucevskis P.",
                "Zarins A.",
                "Barrett A.",
                "Neogi S.G.",
                "Krestyaninova M.",
                "McCarthy M.I.",
                "Brazma A.",
                "Sarkans U."
            ],
            "cit_count": 18,
            "doi": "10.1186/1471-2105-8-52",
            "journal": "BMC Bioinformatics",
            "title": "PASSIM - An open source software system for managing information in biomedical studies",
            "type": "Primary",
            "year": "2007-03-09"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:passim",
        "biotoolsID": "passim",
        "description": "PASSIM (The Patient and Sample System for Information Management)is an open source software system for managing information in biomedical studies. The data submission form is brief, thus making the system simple to use and customize for any biomedical study easily.\nThe PASSIM consists of the two parts:",
        "homepage": "http://passim.sourceforge.net/",
        "name": "PASSIM"
    }
}