{
    "additionDate": "2021-01-18T11:36:39Z",
    "biotoolsCURIE": "biotools:getallele",
    "biotoolsID": "getallele",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "p.m.slowinski@exeter.ac.uk",
            "name": "Piotr Słowiński",
            "typeEntity": "Person"
        }
    ],
    "description": "A Method for Analysis of DNA and RNA Allele Frequency Distributions.\n\nRepository with the toolbox (and code used for analysis and to produce figures) described in: \"GeTallele: a method for analysis of DNA and RNA allele frequencies distributions\".",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Allele frequency distribution analysis",
                    "uri": "http://edamontology.org/operation_0554"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SlowinskiPiotr/GeTallele",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-23T09:38:27Z",
    "license": "GPL-3.0",
    "name": "GeTallele",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.01021",
            "metadata": {
                "abstract": "© Copyright © 2020 Słowiński, Li, Restrepo, Alomran, Spurr, Miller, Tsaneva-Atanasova and Horvath.Variant allele frequencies (VAF) are an important measure of genetic variation that can be estimated at single-nucleotide variant (SNV) sites. RNA and DNA VAFs are used as indicators of a wide-range of biological traits, including tumor purity and ploidy changes, allele-specific expression and gene-dosage transcriptional response. Here we present a novel methodology to assess gene and chromosomal allele asymmetries and to aid in identifying genomic alterations in RNA and DNA datasets. Our approach is based on analysis of the VAF distributions in chromosomal segments (continuous multi-SNV genomic regions). In each segment we estimate variant probability, a parameter of a random process that can generate synthetic VAF samples that closely resemble the observed data. We show that variant probability is a biologically interpretable quantitative descriptor of the VAF distribution in chromosomal segments which is consistent with other approaches. To this end, we apply the proposed methodology on data from 72 samples obtained from patients with breast invasive carcinoma (BRCA) from The Cancer Genome Atlas (TCGA). We compare DNA and RNA VAF distributions from matched RNA and whole exome sequencing (WES) datasets and find that both genomic signals give very similar segmentation and estimated variant probability profiles. We also find a correlation between variant probability with copy number alterations (CNA). Finally, to demonstrate a practical application of variant probabilities, we use them to estimate tumor purity. Tumor purity estimates based on variant probabilities demonstrate good concordance with other approaches (Pearson's correlation between 0.44 and 0.76). Our evaluation suggests that variant probabilities can serve as a dependable descriptor of VAF distribution, further enabling the statistical comparison of matched DNA and RNA datasets. Finally, they provide conceptual and mechanistic insights into relations between structure of VAF distributions and genetic events. The methodology is implemented in a Matlab toolbox that provides a suite of functions for analysis, statistical assessment and visualization of Genome and Transcriptome allele frequencies distributions. GeTallele is available at: https://github.com/SlowinskiPiotr/GeTallele.",
                "authors": [
                    {
                        "name": "Alomran N."
                    },
                    {
                        "name": "Horvath A."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Miller C."
                    },
                    {
                        "name": "Restrepo P."
                    },
                    {
                        "name": "Slowinski P."
                    },
                    {
                        "name": "Spurr L.F."
                    },
                    {
                        "name": "Tsaneva-Atanasova K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-16T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "GeTallele: A Method for Analysis of DNA and RNA Allele Frequency Distributions"
            },
            "pmcid": "PMC7525018",
            "pmid": "33042959"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
