{
    "name": "VISDA", 
    "description": "Software for cluster modeling, visualization, and discovery in genomic data. It performs progressive, coarse-to-fine (divisive) hierarchical clustering and visualization, supported by hierarchical mixture modeling, supervised/unsupervised informative gene selection, supervised/unsupervised data visualization, and user/prior knowledge guidance, to discover hidden clusters within complex, high-dimensional genomic data.", 
    "homepage": "http://www.cbil.ece.vt.edu/caBIG-VISDA.htm", 
    "biotoolsID": "visda", 
    "biotoolsCURIE": "biotools:visda", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2403", 
                    "term": "Sequence analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0564", 
                    "term": "Sequence visualisation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_0092", 
            "term": "Data visualisation"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/visda-visualization-discovery-cluster-analysis-genomic-data.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [
        {
            "url": "https://github.com/NCIP/visda", 
            "type": "Icon", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://www.cbil.ece.vt.edu/caBIG-VISDA.htm", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "18801195", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "caBIG™ VISDA: Modeling, visualization, and discovery for cluster analysis of genomic data", 
                "abstract": "Background: The main limitations of most existing clustering methods used in genomic data analysis include heuristic or random algorithm initialization, the potential of finding poor local optima, the lack of cluster number detection, an inability to incorporate prior/expert knowledge, black-box and non-adaptive designs, in addition to the curse of dimensionality and the discernment of uninformative, uninteresting cluster structure associated with confounding variables. Results: In an effort to partially address these limitations, we develop the VIsual Statistical Data Analyzer (VISDA) for cluster modeling, visualization, and discovery in genomic data. VISDA performs progressive, coarse-to-fine (divisive) hierarchical clustering and visualization, supported by hierarchical mixture modeling, supervised/ unsupervised informative gene selection, supervised/unsupervised data visualization, and user/prior knowledge guidance, to discover hidden clusters within complex, high-dimensional genomic data. The hierarchical visualization and clustering scheme of VISDA uses multiple local visualization subspaces (one at each node of the hierarchy) and consequent subspace data modeling to reveal both global and local cluster structures in a \"divide and conquer\" scenario. Multiple projection methods, each sensitive to a distinct type of clustering tendency, are used for data visualization, which increases the likelihood that cluster structures of interest are revealed. Initialization of the full dimensional model is based on first learning models with user/prior knowledge guidance on data projected into the low-dimensional visualization spaces. Model order selection for the high dimensional data is accomplished by Bayesian theoretic criteria and user justification applied via the hierarchy of low-dimensional visualization subspaces. Based on its complementary building blocks and flexible functionality, VISDA is generally applicable for gene clustering, sample clustering, and phenotype clustering (wherein phenotype labels for samples are known), albeit with minor algorithm modifications customized to each of these tasks. Conclusion: VISDA achieved robust and superior clustering accuracy, compared with several benchmark clustering schemes. The model order selection scheme in VISDA was shown to be effective for high dimensional genomic data clustering. On muscular dystrophy data and muscle regeneration data, VISDA identified biologically relevant co-expressed gene clusters. VISDA also captured the pathological relationships among different phenotypes revealed at the molecular level, through phenotype clustering on muscular dystrophy data and multi-category cancer data. © 2008 Zhu et al; licensee BioMed Central Ltd.", 
                "date": "2008-09-18T00:00:00Z", 
                "citationCount": 6, 
                "authors": [
                    {
                        "name": "Zhu Y."
                    }, 
                    {
                        "name": "Li H."
                    }, 
                    {
                        "name": "Miller D.J."
                    }, 
                    {
                        "name": "Wang Z."
                    }, 
                    {
                        "name": "Xuan J."
                    }, 
                    {
                        "name": "Clarke R."
                    }, 
                    {
                        "name": "Hoffman E.P."
                    }, 
                    {
                        "name": "Wang Y."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Computational Bioinformatics and Bioimaging Laboratory", 
            "email": null, 
            "url": "http://www.cbil.ece.vt.edu/contact.htm", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:03:56Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}