{
    "additionDate": "2020-01-14T09:25:33Z",
    "biotoolsCURIE": "biotools:MarkerHub",
    "biotoolsID": "MarkerHub",
    "confidence_flag": "tool",
    "description": "Biomarker identification of hepatocellular carcinoma using a methodical literature mining strategy.\n\nWe aimed to design a hybrid system for systematic entity recognition and ranking to identify poten-tial biomarkers for liver cancer",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "http://markerhub.iis.sinica.edu.tw",
    "lastUpdate": "2024-11-24T20:53:21.389525Z",
    "name": "MarkerHub",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/database/bax082",
            "metadata": {
                "abstract": "Hepatocellular carcinoma (HCC), one of the most common causes of cancer-related deaths, carries a 5-year survival rate of 18%, underscoring the need for robust biomarkers. In spite of the increased availability of HCC related literatures, many of the promising biomarkers reported have not been validated for clinical use. To narrow down the wide range of possible biomarkers for further clinical validation, bioinformaticians need to sort them out using information provided in published works. Biomedical text mining is an automated way to obtain information of interest within the massive collection of biomedical knowledge, thus enabling extraction of data for biomarkers associated with certain diseases. This method can significantly reduce both the time and effort spent on studying important maladies such as liver diseases. Herein, we report a text mining-aided curation pipeline to identify potential biomarkers for liver cancer. The curation pipeline integrates PubMed E-Utilities to collect abstracts from PubMed and recognize several types of named entities by machine learning-based and pattern-based methods. Genes/proteins from evidential sentences were classified as candidate biomarkers using a convolutional neural network. Lastly, extracted biomarkers were ranked depending on several criteria, such as the frequency of keywords and articles and the journal impact factor, and then integrated into a meaningful list for bioinformaticians. Based on the developed pipeline, we constructed MarkerHub, which contains 2128 candidate biomarkers extracted from PubMed publications from 2008 to 2017. Database URL: http://markerhub.iis.sinica.edu.tw.",
                "authors": [
                    {
                        "name": "Chang N.-W."
                    },
                    {
                        "name": "Chen Y.-J."
                    },
                    {
                        "name": "Dai H.-J."
                    },
                    {
                        "name": "Dela Rosa M.A.C."
                    },
                    {
                        "name": "Hsu W.-L."
                    },
                    {
                        "name": "Obena R.P."
                    },
                    {
                        "name": "Oyang Y.-J."
                    },
                    {
                        "name": "Shih Y.-Y."
                    },
                    {
                        "name": "Wu C.-Y."
                    }
                ],
                "citationCount": 7,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "Biomarker identification of hepatocellular carcinoma using a methodical literature mining strategy"
            },
            "pmcid": "PMC7243925",
            "pmid": "31725857"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
