{
    "additionDate": "2017-12-18T00:08:06Z",
    "biotoolsCURIE": "biotools:kontaminant",
    "biotoolsID": "kontaminant",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.tgac.ac.uk/home/"
        }
    ],
    "description": "A kmer-based screening and filtering tool for next-gen sequencing reads.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://documentation.tgac.ac.uk/display/KON/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://www.tgac.ac.uk/kontaminant/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/kontaminant-kmer-based-screening-and-filtering-tool-for-next-gen-sequencing-reads.html"
        }
    ],
    "name": "Kontaminant",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0129059",
            "metadata": {
                "abstract": "© 2015 Daly et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The use of next generation sequencing (NGS) to identify novel viral sequences from eukaryotic tissue samples is challenging. Issues can include the low proportion and copy number of viral reads and the high number of contigs (post-assembly), making subsequent viral analysis difficult. Comparison of assembly algorithms with pre-assembly host-mapping subtraction using a short-read mapping tool, a k-mer frequency based filter and a low complexity filter, has been validated for viral discovery with Illumina data derived from naturally infected liver tissue and simulated data. Assembled contig numbers were significantly reduced (up to 99.97%) by the application of these pre-assembly filtering methods. This approach provides a validated method for maximizing viral contig size as well as reducing the total number of assembled contigs that require down-stream analysis as putative viral nucleic acids.",
                "authors": [
                    {
                        "name": "Daly G.M."
                    },
                    {
                        "name": "Leggett R.M."
                    },
                    {
                        "name": "Rowe W."
                    },
                    {
                        "name": "Stubbs S."
                    },
                    {
                        "name": "Wilkinson M."
                    },
                    {
                        "name": "Ramirez-Gonzalez R.H."
                    },
                    {
                        "name": "Caccamo M."
                    },
                    {
                        "name": "Bernal W."
                    },
                    {
                        "name": "Heeney J.L."
                    }
                ],
                "citationCount": 21,
                "date": "2015-06-22T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Host subtraction, filtering and assembly validations for novel viral discovery using next generation sequencing data"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.3389/fgene.2013.00288",
            "metadata": {
                "abstract": "The processes of quality assessment and control are an active area of research at The Genome Analysis Centre (TGAC). Unlike other sequencing centers that often concentrate on a certain species or technology, TGAC applies expertise in genomics and bioinformatics to a wide range of projects, often requiring bespoke wet lab and in silico workflows. TGAC is fortunate to have access to a diverse range of sequencing and analysis platforms, and we are at the forefront of investigations into library quality and sequence data assessment. We have developed and implemented a number of algorithms, tools, pipelines and packages to ascertain, store, and expose quality metrics across a number of next-generation sequencing platforms, allowing rapid and in-depth cross-platform Quality Control (QC) bioinformatics. In this review, we describe these tools as a vehicle for data-driven informatics, offering the potential to provide richer context for downstream analysis and to inform experimental design. © 2013 Leggett, Ramirez-Gonzalez, Clavijo, Waite and Davey.",
                "authors": [
                    {
                        "name": "Leggett R.M."
                    },
                    {
                        "name": "Ramirez-Gonzalez R.H."
                    },
                    {
                        "name": "Clavijo B.J."
                    },
                    {
                        "name": "Waite D."
                    },
                    {
                        "name": "Davey R.P."
                    }
                ],
                "citationCount": 78,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Sequencing quality assessment tools to enable data-driven informatics for high throughput genomics"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}