{
    "additionDate": "2021-01-18T11:02:39Z",
    "biotoolsCURIE": "biotools:receptloss",
    "biotoolsID": "receptloss",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "j.mar@uq.edu.au",
            "name": "Jessica C. Mar",
            "orcidid": "https://orcid.org/0000-0002-5147-9299",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of a novel subgroup of endometrial cancer patients with loss of thyroid hormone receptor beta expression and improved survival.\n\nThis package contains functions to detect nuclear hormone receptor (NHR) expression loss (receptLoss) in subsets of tumors relative to normal tissue.\n\nUnsupervised Identification of Genes with Expression Loss in Subsets of Tumors.\n\nreceptLoss identifies genes whose expression is lost in subsets of tumors relative to normal tissue. It is particularly well-suited in cases where the number of normal tissue samples is small, as the distribution of gene expression in normal tissue samples is approximated by a Gaussian. Originally designed for identifying nuclear hormone receptor expression loss but can be applied transcriptome wide as well.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dpique/receptLoss",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-04T16:07:41Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bioconductor.org/packages/release/bioc/html/receptLoss.html"
        }
    ],
    "name": "receptLoss",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12885-020-07325-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Endometrial cancer (EC) is the most common gynecologic cancer in women, and the incidence of EC has increased by about 1% per year in the U. S over the last 10 years. Although 5-year survival rates for early-stage EC are around 80%, certain subtypes of EC that lose nuclear hormone receptor (NHR) expression are associated with poor survival rates. For example, estrogen receptor (ER)-negative EC typically harbors a worse prognosis compared to ER-positive EC. The molecular basis for the loss of NHR expression in endometrial tumors and its contribution to poor survival is largely unknown. Furthermore, there are no tools to systematically identify tumors that lose NHR mRNA expression relative to normal tissue. The development of such an approach could identify sets of NHR-based biomarkers for classifying patients into subgroups with poor survival outcomes. Methods: Here, a new computational method, termed receptLoss, was developed for identifying NHR expression loss in endometrial cancer relative to adjacent normal tissue. When applied to gene expression data from The Cancer Genome Atlas (TCGA), receptLoss identified 6 NHRs that were highly expressed in normal tissue and exhibited expression loss in a subset of endometrial tumors. Results: Three of the six identified NHRs - estrogen, progesterone, and androgen receptors - that are known to lose expression in ECs were correctly identified by receptLoss. Additionally, a novel association was found between thyroid hormone receptor beta (THRB) expression loss, increased expression of miRNA-146a, and increased rates of 5-year survival in the EC TCGA patient cohort. THRB expression loss occurs independently of estrogen and progesterone expression loss, suggesting the discovery of a distinct, clinically-relevant molecular subgroup. Conclusion: ReceptLoss is a novel, open-source software tool to systematically identify NHR expression loss in cancer. The application of receptLoss to endometrial cancer gene expression data identified THRB, a previously undescribed biomarker of survival in endometrial cancer. Applying receptLoss to expression data from additional cancer types could lead to the development of biomarkers of disease progression for patients with any other tumor type. ReceptLoss can be applied to expression data from additional cancer types with the goal of identifying biomarkers of differential survival.",
                "authors": [
                    {
                        "name": "Greally J.M."
                    },
                    {
                        "name": "Mar J.C."
                    },
                    {
                        "name": "Pique D.G."
                    }
                ],
                "date": "2020-09-07T00:00:00Z",
                "journal": "BMC Cancer",
                "title": "Identification of a novel subgroup of endometrial cancer patients with loss of thyroid hormone receptor beta expression and improved survival"
            },
            "pmcid": "PMC7487950",
            "pmid": "32894083"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
