{
    "accessibility": "Open access",
    "additionDate": "2019-12-13T09:44:56Z",
    "biotoolsCURIE": "biotools:PADMet",
    "biotoolsID": "PADMet",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Méziane Aite",
            "orcidid": "https://orcid.org/0000-0001-9086-1485",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "jeanne.got@irisa.fr",
            "name": "Jeanne Got",
            "orcidid": "https://orcid.org/0000-0002-2310-0843",
            "typeRole": [
                "Support"
            ],
            "url": "http://www.irisa.fr/dyliss/jeanne.got"
        },
        {
            "email": "anne.siegel@irisa.fr",
            "name": "Anne Siegel",
            "orcidid": "https://orcid.org/0000-0001-6542-1568",
            "url": "http://www.irisa.fr/dyliss/anne.siegel"
        }
    ],
    "description": "Portable Database for Metabolism. It is a format to centralizes, in a new graph-based PADMet, all information about a metabolic network. It also provides methods to import, to update, to analyse and to export data, in a library.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://padmet.readthedocs.io/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/AuReMe/padmet/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "France"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AuReMe/padmet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "PADMet",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "jgot",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1006146",
            "metadata": {
                "abstract": "© 2018 Aite et al.Genome-scale metabolic models have become the tool of choice for the global analysis of microorganism metabolism, and their reconstruction has attained high standards of quality and reliability. Improvements in this area have been accompanied by the development of some major platforms and databases, and an explosion of individual bioinformatics methods. Consequently, many recent models result from “à la carte” pipelines, combining the use of platforms, individual tools and biological expertise to enhance the quality of the reconstruction. Although very useful, introducing heterogeneous tools, that hardly interact with each other, causes loss of traceability and reproducibility in the reconstruction process. This represents a real obstacle, especially when considering less studied species whose metabolic reconstruction can greatly benefit from the comparison to good quality models of related organisms. This work proposes an adaptable workspace, AuReMe, for sustainable reconstructions or improvements of genome-scale metabolic models involving personalized pipelines. At each step, relevant information related to the modifications brought to the model by a method is stored. This ensures that the process is reproducible and documented regardless of the combination of tools used. Additionally, the workspace establishes a way to browse metabolic models and their metadata through the automatic generation of ad-hoc local wikis dedicated to monitoring and facilitating the process of reconstruction. AuReMe supports exploration and semantic query based on RDF databases. We illustrate how this workspace allowed handling, in an integrated way, the metabolic reconstructions of non-model organisms such as an extremophile bacterium or eukaryote algae. Among relevant applications, the latter reconstruction led to putative evolutionary insights of a metabolic pathway.",
                "authors": [
                    {
                        "name": "Aite M."
                    },
                    {
                        "name": "Chevallier M."
                    },
                    {
                        "name": "Frioux C."
                    },
                    {
                        "name": "Trottier C."
                    },
                    {
                        "name": "Got J."
                    },
                    {
                        "name": "Cortes M.P."
                    },
                    {
                        "name": "Mendoza S.N."
                    },
                    {
                        "name": "Carrier G."
                    },
                    {
                        "name": "Dameron O."
                    },
                    {
                        "name": "Guillaudeux N."
                    },
                    {
                        "name": "Latorre M."
                    },
                    {
                        "name": "Loira N."
                    },
                    {
                        "name": "Markov G.V."
                    },
                    {
                        "name": "Maass A."
                    },
                    {
                        "name": "Siegel A."
                    }
                ],
                "citationCount": 17,
                "date": "2018-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Traceability, reproducibility and wiki-exploration for “à-la-carte” reconstructions of genome-scale metabolic models"
            },
            "pmcid": "PMC5988327",
            "pmid": "29791443",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/462556"
        },
        {
            "doi": "10.3390/antiox8110564",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Understanding growth mechanisms in brown algae is a current scientific and economic challenge that can benefit from the modeling of their metabolic networks. The sequencing of the genomes of Saccharina japonica and Cladosiphon okamuranus has provided the necessary data for the reconstruction of Genome–Scale Metabolic Networks (GSMNs). The same in silico method deployed for the GSMN reconstruction of Ectocarpus siliculosus to investigate the metabolic capabilities of these two algae, was used. Integrating metabolic profiling data from the literature, we provided functional GSMNs composed of an average of 2230 metabolites and 3370 reactions. Based on these GSMNs and previously published work, we propose a model for the biosynthetic pathways of the main carotenoids in these two algae. We highlight, on the one hand, the reactions and enzymes that have been preserved through evolution and, on the other hand, the specificities related to brown algae. Our data further indicate that, if abscisic acid is produced by Saccharina japonica, its biosynthesis pathway seems to be different in its final steps from that described in land plants. Thus, our work illustrates the potential of GSMNs reconstructions for formalizing hypotheses that can be further tested using targeted biochemical approaches.",
                "authors": [
                    {
                        "name": "Negre D."
                    },
                    {
                        "name": "Aite M."
                    },
                    {
                        "name": "Belcour A."
                    },
                    {
                        "name": "Frioux C."
                    },
                    {
                        "name": "Brillet-Gueguen L."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Bordron P."
                    },
                    {
                        "name": "Godfroy O."
                    },
                    {
                        "name": "Lipinska A.P."
                    },
                    {
                        "name": "Leblanc C."
                    },
                    {
                        "name": "Siegel A."
                    },
                    {
                        "name": "Dittami S.M."
                    },
                    {
                        "name": "Corre E."
                    },
                    {
                        "name": "Markov G.V."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Antioxidants",
                "title": "Genome–scale metabolic networks shed light on the carotenoid biosynthesis pathway in the brown algae saccharina japonica and cladosiphon okamuranus"
            },
            "pmid": "31744163"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}