{
    "accessibility": "Open access",
    "additionDate": "2022-08-01T16:43:19.871151Z",
    "biotoolsCURIE": "biotools:sub-spia",
    "biotoolsID": "sub-spia",
    "collectionID": [
        "PerMedCoE"
    ],
    "cost": "Free of charge",
    "description": "Signaling-pathway impact analysis (SPIA) is one such method and combines both the classical enrichment analysis and the actual perturbation on a given pathway. Because this method focuses on a single pathway, its resolution generally is not very high because the differentially expressed genes may be enriched in a local region of the pathway. In the present work, to identify cancer-related pathways, we incorporated a recent subpathway analysis method into the SPIA method to form the “sub-SPIA method.”",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/eshinesimida/subpathway-analysis"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eshinesimida/subpathway-analysis",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-12-09T23:03:51.402102Z",
    "license": "MIT",
    "name": "sub-SPIA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0132813",
            "metadata": {
                "abstract": "© 2015 Li et al.Pathway analysis is a common approach to gain insight from biological experiments. Signaling- pathway impact analysis (SPIA) is one such method and combines both the classical enrichment analysis and the actual perturbation on a given pathway. Because this method focuses on a single pathway, its resolution generally is not very high because the differentially expressed genes may be enriched in a local region of the pathway. In the present work, to identify cancer-related pathways, we incorporated a recent subpathway analysis method into the SPIA method to form the \"sub-SPIA method.\" The original subpathway analysis uses the k-clique structure to define a subpathway. However, it is not sufficiently flexible to capture subpathways with complex structure and usually results in many overlapping subpathways. We therefore propose using the minimal-spanning-tree structure to find a subpathway. We apply this approach to colorectal cancer and lung cancer datasets, and our results show that sub-SPIA can identify many significant pathways associated with each specific cancer that other methods miss. Based on the entire pathway network in the Kyoto Encyclopedia of Genes and Genomes, we find that the pathways identified by sub- SPIA not only have the largest average degree, but also are more closely connected than those identified by other methods. This result suggests that the abnormality signal propagating through them might be responsible for the specific cancer or disease.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Shang X."
                    },
                    {
                        "name": "Shen L."
                    }
                ],
                "citationCount": 30,
                "date": "2015-07-24T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Subpathway analysis based on signaling- Pathway impact analysis of signaling pathway"
            },
            "pmid": "26207919"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
