{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://icahn.mssm.edu/research/labs/maayan-laboratory"}],"documentation":[{"type":"GENERAL","url":"http://maayanlab.net/FNV/docs.html"}],"function":[{"operation":[{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"}]}],"labels":{"language":["JavaScript","Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Desktop application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"Medicine","uri":"http://edamontology.org/topic_3303"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/fnv-1-0-light-weight-flash-based-network-pathway-viewer.html"}],"publication":[{"abstract":"Motivation: Network diagrams are commonly used to visualize biochemical pathways by displaying the relationships between genes, proteins, mRNAs, microRNAs, metabolites, regulatory DNA elements, diseases, viruses and drugs. While there are several currently available web-based pathway viewers, there is still room for improvement. To this end, we have developed a flash-based network viewer (FNV) for the visualization of small to moderately sized biological networks and pathways. Summary: Written in Adobe ActionScript 3.0, the viewer accepts simple Extensible Markup Language (XML) formatted input files to display pathways in vector graphics on any web-page providing flexible layout options, interactivity with the user through tool tips, hyperlinks and the ability to rearrange nodes on the screen. FNV was utilized as a component in several web-based systems, namely Genes2Networks, Lists2Networks, KEA, ChEA and PathwayGenerator. In addition, FVN can be used to embed pathways inside pdf files for the communication of pathways in soft publication materials. © The Author 2011. Published by Oxford University Press. All rights reserved.","authors":["Dannenfelser R.","Lachmann A.","Szenk M.","Ma'ayan A."],"cit_count":4,"journal":"Bioinformatics","pmid":"21349871","title":"FNV: Light-weight flash-based network and pathway viewer","year":"2011-04-01"}],"summary":{"biotoolsCURIE":"biotools:fnv","biotoolsID":"fnv","description":"Visualize small to moderately sized biological networks and pathways. The tool can also be used to embed pathways inside PDF files for the communication of pathways in soft publication materials","homepage":"http://maayanlab.net/FNV/","name":"FNV"}}