{
    "additionDate": "2020-01-09T18:05:15Z",
    "biotoolsCURIE": "biotools:circR2Disease",
    "biotoolsID": "circR2Disease",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xjlei@snnu.edu.cn",
            "name": "Xiujuan Lei",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting circRNA-Disease Associations Based on Improved Collaboration Filtering Recommendation System With Multiple Data.\n\nMarch 31, 2018, the CircR2Disease has been updated.\n\nCircular RNAs (circRNAs) are widely expressed in diverse eukaryotic species and are characterized by covalently closed RNA loops through backsplicing events. They are known to function as miRNA sponges, regulators of alternative splicing, transcription factors and protein-coding templates for translation. To date, dysregulation of circRNAs have been associated with a group of diseases, i.e. various cancer. Here, CircR2Disease curated a database for experimentally supported associations between circRNAs and diseases, providing a platform for investigating mechanism of the disease-related circRNAs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.snnu.edu.cn/CircR2Disease/",
    "lastUpdate": "2020-12-19T21:04:00Z",
    "name": "circR2Disease",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00897",
            "metadata": {
                "abstract": "© 2019 Lei, Fang and Guo.With the development of high-throughput techniques, various biological molecules are discovered, which includes the circular RNAs (circRNAs). Circular RNA is a novel endogenous noncoding RNA that plays significant roles in regulating gene expression, moderating the microRNAs transcription as sponges, diagnosing diseases, and so on. Based on the circRNA particular molecular structures that are closed-loop structures with neither 5′-3′ polarities nor polyadenylated tails, circRNAs are more stable and conservative than the normal linear coding or noncoding RNAs, which makes circRNAs a biomarker of various diseases. Although some conventional experiments are used to identify the associations between circRNAs and diseases, almost the techniques and experiments are time-consuming and expensive. In this study, we propose a collaboration filtering recommendation system–based computational method, which handles the “cold start” problem to predict the potential circRNA–disease associations, which is named ICFCDA. All the known circRNA–disease associations data are downloaded from circR2Disease database (http://bioinfo.snnu.edu.cn/CircR2Disease/). Based on these data, multiple data are extracted from different databases to calculate the circRNA similarity networks and the disease similarity networks. The collaboration filtering recommendation system algorithm is first employed to predict circRNA–disease associations. Then, the leave-one-out cross validation mechanism is adopted to measure the performance of our proposed computational method. ICFCDA achieves the areas under the curve of 0.946, which is better than other existing methods. In order to further illustrate the performance of ICFCDA, case studies of some common diseases are made, and the results are confirmed by other databases. The experimental results show that ICFCDA is competent in predicting the circRNA–disease associations.",
                "authors": [
                    {
                        "name": "Fang Z."
                    },
                    {
                        "name": "Guo L."
                    },
                    {
                        "name": "Lei X."
                    }
                ],
                "citationCount": 9,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Predicting circRNA–disease associations based on improved collaboration filtering recommendation system with multiple data"
            },
            "pmcid": "PMC6773885",
            "pmid": "31608124"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
