{"credit":[{"email":"xie@nus.edu.sg","name":"Xie Chao","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://tiger.dbs.nus.edu.sg/cnv-seq/doc/manual.pdf"}],"function":[{"operation":[{"term":"Copy number estimation","uri":"http://edamontology.org/operation_3233"}]}],"labels":{"language":["R","Perl"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"Background: DNA copy number variation (CNV) has been recognized as an important source of genetic variation. Array comparative genomic hybridization (aCGH) is commonly used for CNV detection, but the microarray platform has a number of inherent limitations. Results: Here, we describe a method to detect copy number variation using shotgun sequencing, CNV-seq. The method is based on a robust statistical model that describes the complete analysis procedure and allows the computation of essential confidence values for detection of CNV. Our results show that the number of reads, not the length of the reads is the key factor determining the resolution of detection. This favors the next-generation sequencing methods that rapidly produce large amount of short reads. Conclusion: Simulation of various sequencing methods with coverage between 0.1× to 8× show overall specificity between 91.7 - 99.9%, and sensitivity between 72.2 - 96.5%. We also show the results for assessment of CNV between two individual human genomes. © 2009 Xie and Tammi; licensee BioMed Central Ltd.","authors":["Xie C.","Tammi M.T."],"cit_count":314,"journal":"BMC Bioinformatics","pmid":"19267900","title":"CNV-seq, a new method to detect copy number variation using high-throughput sequencing","year":"2009-03-06"}],"summary":{"biotoolsCURIE":"biotools:cnv-seq","biotoolsID":"cnv-seq","description":"CNV-seq, a new method to detect copy number variation using high-throughput sequencing","homepage":"http://tiger.dbs.nus.edu.sg/cnv-seq/","name":"CNV-seq"}}