{
    "additionDate": "2021-10-11T08:23:23.758120Z",
    "biotoolsCURIE": "biotools:mrnalocater",
    "biotoolsID": "mrnalocater",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "greatchen@ncst.edu.cn",
            "name": "Wei Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "mRNALocater is a comprehensive and advanced model to accuracy prtiction of eukaryotic mRNA subcellular localization.Three different machine learning models with relatively stable performance based on the optimal feature subset using algorithms including XGBoost, LightGBM and CatBoost are constructed. The mRNALocater is an integration of these three models, and it has better performance than the state-of-the-art mRNALoc for some subcellular localization predict. The independent testing datasets proves that mRNALocater is a comprehensive and advanced predictor.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://bio-bigdata.cn/mRNALocater",
    "lastUpdate": "2021-10-11T08:23:23.760683Z",
    "name": "mRNALocater",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.YMTHE.2021.04.004",
            "metadata": {
                "abstract": "© 2021 The American Society of Gene and Cell TherapyThe functions of mRNAs are closely correlated with their locations in cells. Knowledge about the subcellular locations of mRNA is helpful to understand their biological functions. In recent years, it has become a hot topic to develop effective computational models to predict eukaryotic mRNA subcellular localizations. However, existing state-of-the-art models still have certain deficiencies in terms of prediction accuracy and generalization ability. Therefore, it is urgent to develop novel methods to accurately predict mRNA subcellular localizations. In this study, a novel method called mRNALocater was proposed to detect the subcellular localization of eukaryotic mRNA by adopting the model fusion strategy. To fully extract information from mRNA sequences, the electron-ion interaction pseudopotential and pseudo k-tuple nucleotide composition were used to encode the sequences. Moreover, the correlation coefficient filtering algorithm and feature forward search technology were used to mine hidden feature information, which guarantees that mRNALocater can be more effectively applied to new sequences. The results based on the independent dataset tests demonstrate that mRNALocater yields promising performances for predicting eukaryotic mRNA subcellular localizations and is a powerful tool in practical applications. A freely available online web server for mRNALocater has been established at http://bio-bigdata.cn/mRNALocater.",
                "authors": [
                    {
                        "name": "Tang Q."
                    },
                    {
                        "name": "Nie F."
                    },
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "Chen W."
                    }
                ],
                "citationCount": 3,
                "date": "2021-08-04T00:00:00Z",
                "journal": "Molecular Therapy",
                "title": "mRNALocater: Enhance the prediction accuracy of eukaryotic mRNA subcellular localization by using model fusion strategy"
            },
            "pmid": "33823302",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}