{
    "additionDate": "2021-01-20T10:53:03Z",
    "biotoolsCURIE": "biotools:cogstack",
    "biotoolsID": "cogstack",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "richgjackson@gmail.com",
            "name": "Richard Jackson",
            "orcidid": "https://orcid.org/0000-0002-3278-8547",
            "typeEntity": "Person"
        }
    ],
    "description": "Experiences of deploying integrated information retrieval and extraction services in a large National Health Service Foundation Trust hospital.\n\nCogStack is a lightweight distributed, fault tolerant database processing architecture and ecosystem, intended to make NLP processing and preprocessing easier in resource constrained environments.\n\nCogStack is a lightweight distributed, fault tolerant database processing architecture, intended to make NLP processing and preprocessing easier in resource constained environments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RichJackson/cogstack/",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2021-05-14T05:36:11.850439Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cogstack/cogstack/"
        }
    ],
    "name": "CogStack",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12911-018-0623-9",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Traditional health information systems are generally devised to support clinical data collection at the point of care. However, as the significance of the modern information economy expands in scope and permeates the healthcare domain, there is an increasing urgency for healthcare organisations to offer information systems that address the expectations of clinicians, researchers and the business intelligence community alike. Amongst other emergent requirements, the principal unmet need might be defined as the 3R principle (right data, right place, right time) to address deficiencies in organisational data flow while retaining the strict information governance policies that apply within the UK National Health Service (NHS). Here, we describe our work on creating and deploying a low cost structured and unstructured information retrieval and extraction architecture within King's College Hospital, the management of governance concerns and the associated use cases and cost saving opportunities that such components present. Results: To date, our CogStack architecture has processed over 300 million lines of clinical data, making it available for internal service improvement projects at King's College London. On generated data designed to simulate real world clinical text, our de-identification algorithm achieved up to 94% precision and up to 96% recall. Conclusion: We describe a toolkit which we feel is of huge value to the UK (and beyond) healthcare community. It is the only open source, easily deployable solution designed for the UK healthcare environment, in a landscape populated by expensive proprietary systems. Solutions such as these provide a crucial foundation for the genomic revolution in medicine.",
                "authors": [
                    {
                        "name": "Jackson R."
                    },
                    {
                        "name": "Kartoglu I."
                    },
                    {
                        "name": "Stringer C."
                    },
                    {
                        "name": "Gorrell G."
                    },
                    {
                        "name": "Roberts A."
                    },
                    {
                        "name": "Song X."
                    },
                    {
                        "name": "Wu H."
                    },
                    {
                        "name": "Agrawal A."
                    },
                    {
                        "name": "Lui K."
                    },
                    {
                        "name": "Groza T."
                    },
                    {
                        "name": "Lewsley D."
                    },
                    {
                        "name": "Northwood D."
                    },
                    {
                        "name": "Folarin A."
                    },
                    {
                        "name": "Stewart R."
                    },
                    {
                        "name": "Dobson R."
                    }
                ],
                "citationCount": 24,
                "date": "2018-06-25T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "CogStack - Experiences of deploying integrated information retrieval and extraction services in a large National Health Service Foundation Trust hospital"
            },
            "pmcid": "PMC6020175",
            "pmid": "29941004"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}