{
    "additionDate": "2017-01-13T13:14:33Z",
    "biotoolsCURIE": "biotools:fastqvalidator",
    "biotoolsID": "fastqvalidator",
    "credit": [
        {
            "name": "The Center for Statistical Genetics at the University of Michigan School of Public Health",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/statgen"
        }
    ],
    "description": "Checking that FastQ files are follows standards.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://genome.sph.umich.edu/wiki/FastQValidator"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "http://genome.sph.umich.edu/wiki/FastQValidator",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "FastQValidator",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0048864",
            "metadata": {
                "abstract": "The molecular diagnosis of muscle disorders is challenging: genetic heterogeneity (>100 causal genes for skeletal and cardiac muscle disease) precludes exhaustive clinical testing, prioritizing sequencing of specific genes is difficult due to the similarity of clinical presentation, and the number of variants returned through exome sequencing can make the identification of the disease-causing variant difficult. We have filtered variants found through exome sequencing by prioritizing variants in genes known to be involved in muscle disease while examining the quality and depth of coverage of those genes. We ascertained two families with autosomal dominant limb-girdle muscular dystrophy of unknown etiology. To identify the causal mutations in these families, we performed exome sequencing on five affected individuals using the Agilent SureSelect Human All Exon 50 Mb kit and the Illumina HiSeq 2000 (2×100 bp). We identified causative mutations in desmin (IVS3+3A>G) and filamin C (p.W2710X), and augmented the phenotype data for individuals with muscular dystrophy due to these mutations. We also discuss challenges encountered due to depth of coverage variability at specific sites and the annotation of a functionally proven splice site variant as an intronic variant. © 2012 McDonald et al.",
                "authors": [
                    {
                        "name": "McDonald K.K."
                    },
                    {
                        "name": "Stajich J."
                    },
                    {
                        "name": "Blach C."
                    },
                    {
                        "name": "Ashley-Koch A.E."
                    },
                    {
                        "name": "Hauser M.A."
                    }
                ],
                "citationCount": 15,
                "date": "2012-11-14T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Exome Analysis of Two Limb-Girdle Muscular Dystrophy Families: Mutations Identified and Challenges Encountered"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}