{
    "additionDate": "2017-01-13T13:16:47Z",
    "biotoolsCURIE": "biotools:sxoligosearch",
    "biotoolsID": "sxoligosearch",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "enquiries@synamatix.com",
            "name": "Synamatrix Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Commercial platform offered by the Malaysian based Synamatix that aligns Illumina reads against a range of Refseq RNA or NCBI genome builds for a number of organisms.",
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                }
            ]
        }
    ],
    "homepage": "http://www.synamatix.com/secondGenSoftware.html",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "maturity": "Legacy",
    "name": "SXOligoSearch",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-128",
            "metadata": {
                "abstract": "Background: Second-generation sequencing has the potential to revolutionize genomics and impact all areas of biomedical science. New technologies will make re-sequencing widely available for such applications as identifying genome variations or interrogating the oligonucleotide content of a large sample (e.g. ChIP-sequencing). The increase in speed, sensitivity and availability of sequencing technology brings demand for advances in computational technology to perform associated analysis tasks. The Solexa/Illumina 1G sequencer can produce tens of millions of reads, ranging in length from ∼25-50 nt, in a single experiment. Accurately mapping the reads back to a reference genome is a critical task in almost all applications. Two sources of information that are often ignored when mapping reads from the Solexa technology are the 3' ends of longer reads, which contain a much higher frequency of sequencing errors, and the base-call quality scores. Results: To investigate whether these sources of information can be used to improve accuracy when mapping reads, we developed the RMAP tool, which can map reads having a wide range of lengths and allows base-call quality scores to determine which positions in each read are more important when mapping. We applied RMAP to analyze data re-sequenced from two human BAC regions for varying read lengths, and varying criteria for use of quality scores. RMAP is freely available for downloading at http://rulai.cshl.edu/rmap/. Conclusion: Our results indicate that significant gains in Solexa read mapping performance can be achieved by considering the information in 3′ ends of longer reads, and appropriately using the base-call quality scores. The RMAP tool we have developed will enable researchers to effectively exploit this information in targeted re-sequencing projects. © 2008 Smith et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Smith A.D."
                    },
                    {
                        "name": "Xuan Z."
                    },
                    {
                        "name": "Zhang M.Q."
                    }
                ],
                "citationCount": 224,
                "date": "2008-02-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Using quality scores and longer reads improves accuracy of Solexa read mapping"
            },
            "type": "Review"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}