{
    "accessibility": "Open access",
    "additionDate": "2022-08-28T20:48:26.634826Z",
    "biotoolsCURIE": "biotools:logo",
    "biotoolsID": "logo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yangmeng1@genomics.cn",
            "name": "Meng Yang",
            "orcidid": "https://orcid.org/0000-0001-5630-6357",
            "typeEntity": "Person"
        },
        {
            "email": "jihongwu@fdu.edu.cn",
            "name": "Jihong Wu",
            "typeEntity": "Person"
        },
        {
            "email": "mufeng@mgi-tech.com",
            "name": "Feng Mu",
            "typeEntity": "Person"
        },
        {
            "name": "Haiping Huang"
        },
        {
            "name": "Lichao Huang"
        }
    ],
    "description": "Integrating convolution and self-attention improves language model of human genome for interpreting non-coding regions at base-resolution.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/melobio/LOGO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:46:15.301357Z",
    "license": "Not licensed",
    "name": "LOGO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/nar/gkac326",
            "metadata": {
                "abstract": "Interpretation of non-coding genome remains an unsolved challenge in human genetics due to impracticality of exhaustively annotating biochemically active elements in all conditions. Deep learning based computational approaches emerge recently to help interpret non-coding regions. Here, we present LOGO (Language of Genome), a self-Attention based contextualized pre-Trained language model containing only two self-Attention layers with 1 million parameters as a substantially light architecture that applies self-supervision techniques to learn bidirectional representations of the unlabelled human reference genome. LOGO is then fine-Tuned for sequence labelling task, and further extended to variant prioritization task via a special input encoding scheme of alternative alleles followed by adding a convolutional module. Experiments show that LOGO achieves 15% absolute improvement for promoter identification and up to 4.5% absolute improvement for enhancer-promoter interaction prediction. LOGO exhibits state-of-The-Art multi-Task predictive power on thousands of chromatin features with only 3% parameterization benchmarking against the fully supervised model, DeepSEA and 1% parameterization against a recent BERT-based DNA language model. For allelic-effect prediction, locality introduced by one dimensional convolution shows improved sensitivity and specificity for prioritizing non-coding variants associated with human diseases. In addition, we apply LOGO to interpret type 2 diabetes (T2D) GWAS signals and infer underlying regulatory mechanisms. We make a conceptual analogy between natural language and human genome and demonstrate LOGO is an accurate, fast, scalable, and robust framework to interpret non-coding regions for global sequence labeling as well as for variant prioritization at base-resolution.",
                "authors": [
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Mu F."
                    },
                    {
                        "name": "Tang H."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Yang M."
                    },
                    {
                        "name": "Zhang N."
                    }
                ],
                "citationCount": 14,
                "date": "2022-08-12T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Integrating convolution and self-Attention improves language model of human genome for interpreting non-coding regions at base-resolution"
            },
            "pmcid": "PMC9371931",
            "pmid": "35536244"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
