{
    "additionDate": "2021-01-18T09:20:40Z",
    "biotoolsCURIE": "biotools:psixas",
    "biotoolsID": "psixas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "christopher.ehlert@h-its.org",
            "name": "Christopher Ehlert",
            "typeEntity": "Person"
        }
    ],
    "description": "A Psi4 plugin for efficient simulations of X-ray absorption spectra based on the transition-potential and Δ-Kohn-Sham method.\n\nFor details, please refer to our paper in the Journal of Computational Chemistry and the documentation (still in progress).\n\nParts of the program were inspired by the psi4numpy package.\n\nTo install and use PSIXAS, you will need Psi4 already installed on your computer. You can then checkout the repository:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Masterluke87/psixas",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-29T18:03:35Z",
    "license": "GPL-3.0",
    "name": "PSIXAS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/JCC.26219",
            "metadata": {
                "abstract": "© 2020 Wiley Periodicals, Inc.Near edge X-ray absorption fine structure (NEXAFS) spectra and their pump-probe extension (PP-NEXAFS) offer insights into valence- and core-excited states. We present PSIXAS, a recent implementation for simulating NEXAFS and PP-NEXAFS spectra by means of the transition-potential and the Δ-Kohn–Sham method. The approach is implemented in form of a software plugin for the Psi4 code, which provides access to a wide selection of basis sets as well as density functionals. We briefly outline the theoretical foundation and the key aspects of the plugin. Then, we use the plugin to simulate PP-NEXAFS spectra of thymine, a system already investigated by others and us. It is found that larger, extended basis sets are needed to obtain more accurate absolute resonance positions. We further demonstrate that, in contrast to ordinary NEXAFS simulations, where the choice of the density functional plays a minor role for the shape of the spectrum, for PP-NEXAFS simulations the choice of the density functional is important. Especially hybrid functionals (which could not be used straightforwardly before to simulate PP-NEXAFS spectra) and their amount of “Hartree-Fock like” exact exchange affects relative resonance positions in the spectrum.",
                "authors": [
                    {
                        "name": "Ehlert C."
                    },
                    {
                        "name": "Klamroth T."
                    }
                ],
                "citationCount": 6,
                "date": "2020-07-15T00:00:00Z",
                "journal": "Journal of Computational Chemistry",
                "title": "PSIXAS: A Psi4 plugin for efficient simulations of X-ray absorption spectra based on the transition-potential and Δ-Kohn–Sham method"
            },
            "pmid": "32394459"
        }
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}