
{
    "credit": [
        {
            "name": "Support Forum",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://gatkforums.broadinstitute.org/gatk"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://software.broadinstitute.org/gatk/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "gatk",
            "Sequencing",
            "Genomics"
        ],
        "language": [
            "Java",
            "Python"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Workflows",
                "uri": "http://edamontology.org/topic_0769"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Next-generation DNA sequencing (NGS) projects, such as the 1000 Genomes Project, are already revolutionizing our understanding of genetic variation among individuals. However, the massive data sets generated by NGS - the 1000 Genome pilot alone includes nearly five terabases - make writing feature-rich, efficient, and robust analysis tools difficult for even computationally sophisticated individuals. Indeed, many professionals are limited in the scope and the ease with which they can answer scientific questions by the complexity of accessing and manipulating the data produced by these machines. Here, we discuss our Genome Analysis Toolkit (GATK), a structured programming framework designed to ease the development of efficient and robust analysis tools for next-generation DNA sequencers using the functional programming philosophy of MapReduce. The GATK provides a small but rich set of data access patterns that encompass the majority of analysis tool needs. Separating specific analysis calculations from common data management infrastructure enables us to optimize the GATK framework for correctness, stability, and CPU and memory efficiency and to enable distributed and shared memory parallelization. We highlight the capabilities of the GATK by describing the implementation and application of robust, scale-tolerant tools like coverage calculators and single nucleotide polymorphism (SNP) calling. We conclude that the GATK programming framework enables developers and analysts to quickly and easily write efficient and robust NGS tools, many of which have already been incorporated into large-scale sequencing projects like the 1000 Genomes Project and The Cancer Genome Atlas. © 2010 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "McKenna A.",
                "Hanna M.",
                "Banks E.",
                "Sivachenko A.",
                "Cibulskis K.",
                "Kernytsky A.",
                "Garimella K.",
                "Altshuler D.",
                "Gabriel S.",
                "Daly M.",
                "DePristo M.A."
            ],
            "cit_count": 6699,
            "journal": "Genome Research",
            "pmid": "20644199",
            "title": "The genome analysis toolkit: A MapReduce framework for analyzing next-generation DNA sequencing data",
            "year": "2010-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gatk",
        "biotoolsID": "gatk",
        "description": "The Genome Analysis Toolkit (GATK) is a set of bioinformatic tools for analyzing high-throughput sequencing (HTS) and variant call format (VCF) data. The toolkit is well established for germline short variant discovery from whole genome and exome sequencing data. GATK4 expands functionality into copy number and somatic analyses and offers pipeline scripts for workflows.  \n\nVersion 4 (GATK4) is open-source at https://github.com/broadinstitute/gatk.",
        "homepage": "https://software.broadinstitute.org/gatk/",
        "name": "GATK",
        "version": [
            "4.x"
        ]
    }
}