{
    "accessibility": "Open access",
    "additionDate": "2023-12-01T15:31:44.700278Z",
    "biotoolsCURIE": "biotools:slicercbm",
    "biotoolsID": "slicercbm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "saima.safdar@research.uwa.edu.au",
            "name": "Saima Safdar",
            "orcidid": "http://orcid.org/0000-0001-5994-061X",
            "typeEntity": "Person"
        }
    ],
    "description": "Automatic framework for biomechanical analysis of the brain.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://slicercbm.org/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SlicerCBM/SlicerCBM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:29:28.879987Z",
    "license": "BSD-3-Clause",
    "name": "SlicerCBM",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s11548-023-02881-7",
            "metadata": {
                "abstract": "Purpose: Brain shift that occurs during neurosurgery disturbs the brain’s anatomy. Prediction of the brain shift is essential for accurate localisation of the surgical target. Biomechanical models have been envisaged as a possible tool for such predictions. In this study, we created a framework to automate the workflow for predicting intra-operative brain deformations. Methods: We created our framework by uniquely combining our meshless total Lagrangian explicit dynamics (MTLED) algorithm for computing soft tissue deformations, open-source software libraries and built-in functions within 3D Slicer, an open-source software package widely used for medical research. Our framework generates the biomechanical brain model from the pre-operative MRI, computes brain deformation using MTLED and outputs results in the form of predicted warped intra-operative MRI. Results: Our framework is used to solve three different neurosurgical brain shift scenarios: craniotomy, tumour resection and electrode placement. We evaluated our framework using nine patients. The average time to construct a patient-specific brain biomechanical model was 3 min, and that to compute deformations ranged from 13 to 23 min. We performed a qualitative evaluation by comparing our predicted intra-operative MRI with the actual intra-operative MRI. For quantitative evaluation, we computed Hausdorff distances between predicted and actual intra-operative ventricle surfaces. For patients with craniotomy and tumour resection, approximately 95% of the nodes on the ventricle surfaces are within two times the original in-plane resolution of the actual surface determined from the intra-operative MRI. Conclusion: Our framework provides a broader application of existing solution methods not only in research but also in clinics. We successfully demonstrated the application of our framework by predicting intra-operative deformations in nine patients undergoing neurosurgical procedures.",
                "authors": [
                    {
                        "name": "Bourantas G.C."
                    },
                    {
                        "name": "Frisken S."
                    },
                    {
                        "name": "Golby A."
                    },
                    {
                        "name": "Hyde D.E."
                    },
                    {
                        "name": "Joldes G.R."
                    },
                    {
                        "name": "Kapur T."
                    },
                    {
                        "name": "Kikinis R."
                    },
                    {
                        "name": "Miller K."
                    },
                    {
                        "name": "Nabavi A."
                    },
                    {
                        "name": "Safdar S."
                    },
                    {
                        "name": "Warfield S.K."
                    },
                    {
                        "name": "Wittek A."
                    },
                    {
                        "name": "Yu Y."
                    },
                    {
                        "name": "Zwick B.F."
                    }
                ],
                "citationCount": 3,
                "date": "2023-10-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "SlicerCBM: automatic framework for biomechanical analysis of the brain"
            },
            "pmcid": "PMC10497672",
            "pmid": "37004646"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
