{
    "additionDate": "2018-10-31T17:44:19Z",
    "biotoolsCURIE": "biotools:q-nexus",
    "biotoolsID": "q-nexus",
    "credit": [
        {
            "email": "peter.hansen@charite.de",
            "name": "Peter Hansen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Q-nexus is a comprehensive software package for ChIP-nexus data that exploits the random barcodes for selective removal of PCR duplicates and for quality control.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://charite.github.io/Q/manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://charite.github.io/Q/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/charite/Q"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/charite/Q/issues"
        }
    ],
    "name": "Q-nexus",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12864-016-3164-6",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: ChIP-nexus, an extension of the ChIP-exo protocol, can be used to map the borders of protein-bound DNA sequences at nucleotide resolution, requires less input DNA and enables selective PCR duplicate removal using random barcodes. However, the use of random barcodes requires additional preprocessing of the mapping data, which complicates the computational analysis. To date, only a very limited number of software packages are available for the analysis of ChIP-exo data, which have not yet been systematically tested and compared on ChIP-nexus data. Results: Here, we present a comprehensive software package for ChIP-nexus data that exploits the random barcodes for selective removal of PCR duplicates and for quality control. Furthermore, we developed bespoke methods to estimate the width of the protected region resulting from protein-DNA binding and to infer binding positions from ChIP-nexus data. Finally, we applied our peak calling method as well as the two other methods MACE and MACS2 to the available ChIP-nexus data. Conclusions: The Q-nexus software is efficient and easy to use. Novel statistics about duplication rates in consideration of random barcodes are calculated. Our method for the estimation of the width of the protected region yields unbiased signatures that are highly reproducible for biological replicates and at the same time very specific for the respective factors analyzed. As judged by the irreproducible discovery rate (IDR), our peak calling algorithm shows a substantially better reproducibility. An implementation of Q-nexus is available at http://charite.github.io/Q/.",
                "authors": [
                    {
                        "name": "Hansen P."
                    },
                    {
                        "name": "Hecht J."
                    },
                    {
                        "name": "Ibn-Salem J."
                    },
                    {
                        "name": "Menkuec B.S."
                    },
                    {
                        "name": "Roskosch S."
                    },
                    {
                        "name": "Truss M."
                    },
                    {
                        "name": "Robinson P.N."
                    }
                ],
                "citationCount": 6,
                "date": "2016-11-04T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Q-nexus: A comprehensive and efficient analysis pipeline designed for ChIP-nexus"
            },
            "pmcid": "PMC5097360",
            "pmid": "27814676",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Structural genomics",
            "uri": "http://edamontology.org/topic_0122"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1,
    "version": [
        "v1.3.0"
    ]
}