{
    "additionDate": "2020-01-14T09:29:20Z",
    "biotoolsCURIE": "biotools:SURVTOOLS",
    "biotoolsID": "SURVTOOLS",
    "confidence_flag": "tool",
    "description": "Risk-based surveillance for meat-borne parasites.\n\nThere is a plethora of meat-borne hazards - including parasites - for which there may be a need for surveillance. However, veterinary services worldwide need to decide how to use their scarce resources and prioritise among the perceived hazards. Moreover, to remain competitive, food business operators - irrespective of whether they are farmers or abattoir operators - are preoccupied with maintaining a profit and minimizing costs. Still, customers and trade partners expect that meat products placed on the market are safe to consume and should not bear any risks of causing disease. Risk-based surveillance systems may offer a solution to this challenge by applying risk analysis principles; first to set priorities, and secondly to allocate resources effectively and efficiently.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://survtools.org/",
    "lastUpdate": "2021-01-16T14:39:25Z",
    "name": "SURVTOOLS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.EXPPARA.2019.107808",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.There is a plethora of meat-borne hazards – including parasites - for which there may be a need for surveillance. However, veterinary services worldwide need to decide how to use their scarce resources and prioritise among the perceived hazards. Moreover, to remain competitive, food business operators – irrespective of whether they are farmers or abattoir operators - are preoccupied with maintaining a profit and minimizing costs. Still, customers and trade partners expect that meat products placed on the market are safe to consume and should not bear any risks of causing disease. Risk-based surveillance systems may offer a solution to this challenge by applying risk analysis principles; first to set priorities, and secondly to allocate resources effectively and efficiently. The latter is done through a focus on the cost-effectiveness ratio in sampling and prioritisation. Risk-based surveillance was originally introduced into veterinary public health in 2006. Since then, experience has been gathered, and the methodology has been further developed. Guidelines and tools have been developed, which can be used to set up appropriate surveillance programmes. In this paper, the basic principles are described, and by use of a surveillance design tool called SURVTOOLS (https://survtools.org/), examples are given covering three meat-borne parasites for which risk-based surveillance is 1) either in place in the European Union (EU) (Trichinella spp.), 2) to be officially implemented in December 2019 (Taenia saginata) or 3) only carried out by one abattoir company in the EU as there is no official EU requirement (Toxoplasma gondii). Moreover, advantages, requirements and limitations of risk-based surveillance for meat-borne parasites are discussed.",
                "authors": [
                    {
                        "name": "Alban L."
                    },
                    {
                        "name": "Hasler B."
                    },
                    {
                        "name": "Ruegg S."
                    },
                    {
                        "name": "van Schaik G."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Experimental Parasitology",
                "title": "Risk-based surveillance for meat-borne parasites"
            },
            "pmid": "31765613"
        }
    ],
    "topic": [
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
