{
    "additionDate": "2017-03-25T12:40:48Z",
    "biotoolsCURIE": "biotools:polyview-mm",
    "biotoolsID": "polyview-mm",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sable.cchmc.org/cgi-bin/contact_page.cgi?Server=POLYVIEW"
        }
    ],
    "description": "Integrate high quality animation of molecular motion into structural and functional analysis of macromolecules. Structural annotations such as mapping of known interaction sites from structural homologs, mapping of cavities and ligand binding sites, transmembrane regions and protein domains are also integrated into the visualization.",
    "documentation": [
        {
            "type": "General",
            "url": "http://polyview.cchmc.org/conform_doc.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Molecular dynamics simulation",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://polyview.cchmc.org/conform.html",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "POLYVIEW-MM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Molecular simulations offer important mechanistic and functional clues in studies of proteins and other macromolecules. However, interpreting the results of such simulations increasingly requires tools that can combine information from multiple structural databases and other web resources, and provide highly integrated and versatile analysis tools. Here, we present a new web server that integrates high-quality animation of molecular motion (MM) with structural and functional analysis of macromolecules. The new tool, dubbed POLYVIEW-MM, enables animation of trajectories generated by molecular dynamics and related simulation techniques, as well as visualization of alternative conformers, e.g. obtained as a result of protein structure prediction methods or small molecule docking. To facilitate structural analysis, POLYVIEW-MM combines interactive view and analysis of conformational changes using Jmol and its tailored extensions, publication quality animation using PyMol, and customizable 2D summary plots that provide an overview of MM, e.g. in terms of changes in secondary structure states and relative solvent accessibility of individual residues in proteins. Furthermore, POLYVIEW-MM integrates visualization with various structural annotations, including automated mapping of known interaction sites from structural homologs, mapping of cavities and ligand binding sites, transmembrane regions and protein domains. URL: http://polyview.cchmc.org/conform.html. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Porollo A."
                    },
                    {
                        "name": "Meller J."
                    }
                ],
                "citationCount": 19,
                "date": "2010-05-26T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "POLYVIEW-MM: Web-based platform for animation and analysis of molecular simulations"
            },
            "pmid": "20504857"
        },
        {
            "metadata": {
                "abstract": "Summary: The POLYVIEW visualization server can be used to generate protein sequence annotations, including secondary structures, relative solvent accessibilities, functional motifs and polymorphic sites. Two-dimensional graphical representations in a customizable format may be generated for both known protein structures and predictions obtained using protein structure prediction servers. POLYVIEW may be used for automated generation of pictures with structural and functional annotations for publications and proteomic on-line resources. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Porollo A.A."
                    },
                    {
                        "name": "Adamczak R."
                    },
                    {
                        "name": "Meller J."
                    }
                ],
                "citationCount": 83,
                "date": "2004-10-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "POLYVIEW: A flexible visualization tool for structural and functional annotations of proteins"
            },
            "pmid": "15073023"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}