
{
    "credit": [
        {
            "name": "Bielefeld University",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "CeBiTec",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "name": "bigi",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "emma-service@cebitec.uni-bielefeld.de",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cebitec.uni-bielefeld.de/brf/"
        }
    ],
    "documentation": [
        {
            "type": "Citation instructions",
            "url": "https://wiki.cebitec.uni-bielefeld.de/brf-software/index.php/EMMA_2_Publications"
        },
        {
            "type": "General",
            "url": "https://wiki.cebitec.uni-bielefeld.de/brf-software/index.php/EMMAWiki/WebDocumentation"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Microarray hybridisation data",
                        "uri": "http://edamontology.org/data_3117"
                    },
                    "format": [
                        {
                            "term": "Gene expression report format",
                            "uri": "http://edamontology.org/format_2058"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    },
                    "format": [
                        {
                            "term": "MAGE-ML",
                            "uri": "http://edamontology.org/format_3161"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "de.NBI",
            "de.NBI-BiGi"
        ],
        "cost": "Free of charge",
        "language": [
            "JavaScript"
        ],
        "license": "LGPL-2.1",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Workbench"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Understanding transcriptional regulation by genome-wide microarray studies can contribute to unravel complex relationships between genes. Attempts to standardize the annotation of microarray data include the Minimum Information About a Microarray Experiment (MIAME) recommendations, the MAGE-ML format for data interchange, and the use of controlled vocabularies or ontologies. The existing software systems for microarray data analysis implement the mentioned standards only partially and are often hard to use and extend. Integration of genomic annotation data and other sources of external knowledge using open standards is therefore a key requirement for future integrated analysis systems. Results: The EMMA 2 software has been designed to resolve shortcomings with respect to full MAGE-ML and ontology support and makes use of modern data integration techniques. We present a software system that features comprehensive data analysis functions for spotted arrays, and for the most common synthesized oligo arrays such as Agilent, Affymetrix and NimbleGen. The system is based on the full MAGE object model. Analysis functionality is based on R and Bioconductor packages and can make use of a compute cluster for distributed services. Conclusion: Our model-driven approach for automatically implementing a full MAGE object model provides high flexibility and compatibility. Data integration via SOAP-based web-services is advantageous in a distributed client-server environment as the collaborative analysis of microarray data is gaining more and more relevance in international research consortia. The adequacy of the EMMA 2 software design and implementation has been proven by its application in many distributed functional genomics projects. Its scalability makes the current architecture suited for extensions towards future transcriptomics methods based on high-throughput sequencing approaches which have much higher computational requirements than microarrays. © 2009 Dondrup et al; licensee BioMed Central Ltd.",
            "authors": [
                "Dondrup M.",
                "Albaum S.P.",
                "Griebel T.",
                "Henckel K.",
                "Junemann S.",
                "Kahlke T.",
                "Kleindt C.K.",
                "Kuster H.",
                "Linke B.",
                "Mertens D.",
                "Mittard-Runte V.",
                "Neuweger H.",
                "Runte K.J.",
                "Tauch A.",
                "Tille F.",
                "Puhler A.",
                "Goesmann A."
            ],
            "cit_count": 56,
            "doi": "10.1186/1471-2105-10-50",
            "journal": "BMC Bioinformatics",
            "title": "EMMA 2 - A MAGE-compliant system for the collaborative analysis and integration of microarray data",
            "type": "Primary",
            "year": "2009-02-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:emma2",
        "biotoolsID": "emma2",
        "description": "MAGE-compliant software platform for the evaluation of microarry experiment data sets resulting from genome-wide transcriptomics studies. It allows to access the raw transcriptome data sets and provides automated and extensible analysis and visualization pipelines, including but not limited to the normalization of single and multiple microarrays and statistical tests for inferring differentially expressed genes.",
        "homepage": "http://emma.cebitec.uni-bielefeld.de",
        "name": "EMMA2",
        "version": [
            "2.8.2"
        ]
    }
}