{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T11:03:56Z",
    "biotoolsCURIE": "biotools:AUTALASSO",
    "biotoolsID": "AUTALASSO",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Patrik Waldmann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/patwa67"
        }
    ],
    "description": "Automatic adaptive LASSO for genome-wide prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/patwa67/AUTALASSO",
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "AUTALASSO",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2743-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Genome-wide prediction has become the method of choice in animal and plant breeding. Prediction of breeding values and phenotypes are routinely performed using large genomic data sets with number of markers on the order of several thousands to millions. The number of evaluated individuals is usually smaller which results in problems where model sparsity is of major concern. The LASSO technique has proven to be very well-suited for sparse problems often providing excellent prediction accuracy. Several computationally efficient LASSO algorithms have been developed, but optimization of hyper-parameters can be demanding. Results: We have developed a novel automatic adaptive LASSO (AUTALASSO) based on the alternating direction method of multipliers (ADMM) optimization algorithm. The two major hyper-parameters of ADMM are the learning rate and the regularization factor. The learning rate is automatically tuned with line search and the regularization factor optimized using Golden section search. Results show that AUTALASSO provides superior prediction accuracy when evaluated on simulated and real bull data compared to the adaptive LASSO, LASSO and ridge regression implemented in the popular glmnet software. Conclusions: The AUTALASSO provides a very flexible and computationally efficient approach to GWP, especially when it is important to obtain high prediction accuracy and genetic gain. The AUTALASSO also has the capability to perform GWAS of both additive and dominance effects with smaller prediction error than the ordinary LASSO.",
                "authors": [
                    {
                        "name": "Waldmann P."
                    },
                    {
                        "name": "Ferencakovic M."
                    },
                    {
                        "name": "Meszaros G."
                    },
                    {
                        "name": "Khayatzadeh N."
                    },
                    {
                        "name": "Curik I."
                    },
                    {
                        "name": "Solkner J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-04-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AUTALASSO: An automatic adaptive LASSO for genome-wide prediction"
            },
            "pmcid": "PMC6444607",
            "pmid": "30940067",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}