
{
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr. Gajendra P. S. Raghava",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://webs.iiitd.edu.in/raghava/humcfs/help.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://webs.iiitd.edu.in/raghava/humcfs/download.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application",
            "Database portal"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 The Author(s).Background: Fragile sites are the chromosomal regions that are susceptible to breakage, and their frequency varies among the human population. Based on the frequency of fragile site induction, they are categorized as common and rare fragile sites. Common fragile sites are sensitive to replication stress and often rearranged in cancer. Rare fragile sites are the archetypal trinucleotide repeats. Fragile sites are known to be involved in chromosomal rearrangements in tumors. Human miRNA genes are also present at fragile sites. A better understanding of genes and miRNAs lying in the fragile site regions and their association with disease progression is required. Result: HumCFS is a manually curated database of human chromosomal fragile sites. HumCFS provides useful information on fragile sites such as coordinates on the chromosome, cytoband, their chemical inducers and frequency of fragile site (rare or common), genes and miRNAs lying in fragile sites. Protein coding genes in the fragile sites were identified by mapping the coordinates of fragile sites with human genome Ensembl (GRCh38/hg38). Genes present in fragile sites were further mapped to DisGenNET database, to understand their possible link with human diseases. Human miRNAs from miRBase was also mapped on fragile site coordinates. In brief, HumCFS provides useful information about 125 human chromosomal fragile sites and their association with 4921 human protein-coding genes and 917 human miRNA's. Conclusion: User-friendly web-interface of HumCFS and hyper-linking with other resources will help researchers to search for genes, miRNAs efficiently and to intersect the relationship among them. For easy data retrieval and analysis, we have integrated standard web-based tools, such as JBrowse, BLAST etc. Also, the user can download the data in various file formats such as text files, gff3 files and Bed-format files which can be used on UCSC browser. Database URL: http://webs.iiitd.edu.in/raghava/humcfs/",
            "authors": [
                "Kumar R.",
                "Nagpal G.",
                "Kumar V.",
                "Usmani S.S.",
                "Agrawal P.",
                "Raghava G.P.S."
            ],
            "cit_count": 1,
            "doi": "10.1186/s12864-018-5330-5",
            "journal": "BMC Genomics",
            "pmid": "30999860",
            "title": "HumCFS: A database of fragile sites in human chromosomes",
            "type": "Primary",
            "year": "2019-04-18"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:HumCFS",
        "biotoolsID": "HumCFS",
        "description": "Manually curated database of human chromosomal fragile sites. HumCFS provides useful information on fragile sites such as coordinates on the chromosome, cytoband, their chemical inducers and frequency of fragile site (rare or common), genes and miRNAs lying in fragile sites.",
        "homepage": "https://webs.iiitd.edu.in/raghava/humcfs/index.html",
        "name": "HumCFS"
    }
}