{
    "additionDate": "2018-07-21T11:11:28Z",
    "biotoolsCURIE": "biotools:canary",
    "biotoolsID": "canary",
    "credit": [
        {
            "email": "Ken.Doig@petermac.org",
            "name": "Kenneth D. Doig",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Self contained amplicon NGS pipeline that takes a pair of zipped Fastq files and generates an annotated VCF file of variants.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/PapenfussLab/Canary/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PapenfussLab/Canary",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-11-25T14:34:02.522840Z",
    "license": "GPL-3.0",
    "name": "Canary",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1950-z",
            "metadata": {
                "abstract": "Background: High throughput sequencing requires bioinformatics pipelines to process large volumes of data into meaningful variants that can be translated into a clinical report. These pipelines often suffer from a number of shortcomings: they lack robustness and have many components written in multiple languages, each with a variety of resource requirements. Pipeline components must be linked together with a workflow system to achieve the processing of FASTQ files through to a VCF file of variants. Crafting these pipelines requires considerable bioinformatics and IT skills beyond the reach of many clinical laboratories. Results: Here we present Canary, a single program that can be run on a laptop, which takes FASTQ files from amplicon assays through to an annotated VCF file ready for clinical analysis. Canary can be installed and run with a single command using Docker containerization or run as a single JAR file on a wide range of platforms. Although it is a single utility, Canary performs all the functions present in more complex and unwieldy pipelines. All variants identified by Canary are 3' shifted and represented in their most parsimonious form to provide a consistent nomenclature, irrespective of sequencing variation. Further, proximate in-phase variants are represented as a single HGVS 'delins' variant. This allows for correct nomenclature and consequences to be ascribed to complex multi-nucleotide polymorphisms (MNPs), which are otherwise difficult to represent and interpret. Variants can also be annotated with hundreds of attributes sourced from MyVariant.info to give up to date details on pathogenicity, population statistics and in-silico predictors. Conclusions: Canary has been used at the Peter MacCallum Cancer Centre in Melbourne for the last 2 years for the processing of clinical sequencing data. By encapsulating clinical features in a single, easily installed executable, Canary makes sequencing more accessible to all pathology laboratories. Canary is available for download as source or a Docker image at https://github.com/PapenfussLab/Canaryunder a GPL-3.0 License.",
                "authors": [
                    {
                        "name": "Blombery P."
                    },
                    {
                        "name": "Doig K.D."
                    },
                    {
                        "name": "Ellul J."
                    },
                    {
                        "name": "Fellowes A."
                    },
                    {
                        "name": "Fox S.B."
                    },
                    {
                        "name": "Papenfuss A.T."
                    },
                    {
                        "name": "Ryland G."
                    },
                    {
                        "name": "Thompson E.R."
                    }
                ],
                "citationCount": 2,
                "date": "2017-12-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Canary: An atomic pipeline for clinical amplicon assays"
            },
            "pmcid": "PMC5732437",
            "pmid": "29246107",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
