{
    "accessibility": "Open access",
    "additionDate": "2020-06-16T22:44:05Z",
    "biotoolsCURIE": "biotools:graph2go",
    "biotoolsID": "graph2go",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Kunjie.Fan@osumc.edu",
            "name": "Kunjie Fan",
            "orcidid": "https://orcid.org/0000-0002-0392-1177",
            "typeRole": [
                "Contributor"
            ]
        }
    ],
    "description": "A multi-modal graph-based representation learning model that can integrate heterogeneous information including multiple types of interaction networks (sequence similarity network and protein-protein interaction network) and protein features (amino acid sequence, subcellular location and protein domains) to predict protein functions on Gene Ontology",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://github.com/yanzhanglab/Graph2GO"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.dropbox.com/s/ilrudy0j7wb7b8s/data.zip?dl=0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/yanzhanglab/Graph2GO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-15T06:42:22.022812Z",
    "license": "MIT",
    "link": [
        {
            "note": "A website for querying prediction results",
            "type": [
                "Service"
            ],
            "url": "https://integrativeomics.shinyapps.io/graph2go/"
        }
    ],
    "maturity": "Mature",
    "name": "Graph2GO",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_018726"
        }
    ],
    "owner": "nevergonefan",
    "publication": [
        {
            "doi": "10.1093/gigascience/giaa081",
            "metadata": {
                "abstract": "© The Author(s) 2020.Background: Identifying protein functions is important for many biological applications. Since experimental functional characterization of proteins is time-consuming and costly, accurate and efficient computational methods for predicting protein functions are in great demand for generating the testable hypotheses guiding large-scale experiments.\"Results: Here, we propose Graph2GO, a multi-modal graph-based representation learning model that can integrate heterogeneous information, including multiple types of interaction networks (sequence similarity network and protein-protein interaction network) and protein features (amino acid sequence, subcellular location, and protein domains) to predict protein functions on gene ontology. Comparing Graph2GO to BLAST, as a baseline model, and to two popular protein function prediction methods (Mashup and deepNF), we demonstrated that our model can achieve state-of-the-art performance. We show the robustness of our model by testing on multiple species. We also provide a web server supporting function query and downstream analysis on-the-fly. Conclusions: Graph2GO is the first model that has utilized attributed network representation learning methods to model both interaction networks and protein features for predicting protein functions, and achieved promising performance. Ourmodel can be easily extended to include more protein features to further improve the performance. Besides, Graph2GO is also applicable to other application scenarios involving biological networks, and the learned latent representations can be used as feature inputs for machine learning tasks in various downstream analyses.",
                "authors": [
                    {
                        "name": "Fan K."
                    },
                    {
                        "name": "Guan Y."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Graph2GO: A multi-modal attributed network embedding method for inferring protein functions"
            },
            "note": "Graph2GO: a multi-modal attributed network embedding method for inferring protein functions",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        }
    ],
    "validated": 1
}