
{
    "credit": [
        {
            "email": "fyu@bcm.edu",
            "name": "Fuli Yu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/atlas2/files/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Ruby",
            "C++"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Accurate identification of genetic variants from next-generation sequencing (NGS) data is essential for immediate large-scale genomic endeavors such as the 1000 Genomes Project, and is crucial for further genetic analysis based on the discoveries. The key challenge in single nucleotide polymorphism (SNP) discovery is to distinguish true individual variants (occurring at a low frequency) from sequencing errors (often occurring at frequencies orders of magnitude higher). Therefore, knowledge of the error probabilities of base calls is essential. We have developed Atlas-SNP2, a computational tool that detects and accounts for systematic sequencing errors caused by context-related variables in a logistic regression model learned from training data sets. Subsequently, it estimates the posterior error probability for each substitution through a Bayesian formula that integrates prior knowledge of the overall sequencing error probability and the estimated SNP rate with the results from the logistic regression model for the given substitutions. The estimated posterior SNP probability can be used to distinguish true SNPs from sequencing errors. Validation results show that Atlas-SNP2 achieves a false-positive rate of lower than 10%, with an ∼5% or lower false-negative rate. © 2010 by Cold Spring Harbor Laboratory Press.",
            "authors": [
                "Shen Y.",
                "Wan Z.",
                "Coarfa C.",
                "Drabek R.",
                "Chen L.",
                "Ostrowski E.A.",
                "Liu Y.",
                "Weinstock G.M.",
                "Wheeler D.A.",
                "Gibbs R.A.",
                "Yu F."
            ],
            "cit_count": 115,
            "journal": "Genome Research",
            "pmid": "20019143",
            "title": "A SNP discovery method to assess variant allele probability from next-generation resequencing data",
            "year": "2010-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:atlas-snp2",
        "biotoolsID": "atlas-snp2",
        "description": "SNP detection tool developed for next generation sequencing platforms.",
        "homepage": "https://www.hgsc.bcm.edu/software/atlas-2",
        "name": "Atlas-SNP2"
    }
}