{
    "additionDate": "2020-01-09T18:33:14Z",
    "biotoolsCURIE": "biotools:MITF-low_melanomas_MITF-independent",
    "biotoolsID": "MITF-low_melanomas_MITF-independent",
    "confidence_flag": "very low",
    "description": "Zebrafish MITF-Low Melanoma Subtype Models Reveal Transcriptional Subclusters and MITF-Independent Residual Disease.\n\nThe melanocyte-inducing transcription factor (MITF)-low melanoma transcriptional signature is predictive of poor outcomes for patients, but little is known about its biological significance, and animal models are lacking. Here, we used zebrafish genetic models with low activity of Mitfa (MITF-low) and established that the MITF-low state is causal of melanoma progression and a predictor of melanoma biological subtype. MITF-low zebrafish melanomas resembled human MITF-low melanomas and were enriched for stem and invasive (mesenchymal) gene signatures.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MITF-independent', 'MITF-low melanomas', 'melanomas MITF-independent', 'melanomas'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31582381",
    "lastUpdate": "2020-01-09T18:33:14Z",
    "name": "MITF-low melanomas MITF-independent",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1158/0008-5472.CAN-19-0037",
            "metadata": {
                "abstract": "©©2019 American Association for Cancer Research.The melanocyte-inducing transcription factor (MITF)–low melanoma transcriptional signature is predictive of poor outcomes for patients, but little is known about its biological significance, and animal models are lacking. Here, we used zebrafish genetic models with low activity of Mitfa (MITF-low) and established that the MITF-low state is causal of melanoma progression and a predictor of melanoma biological subtype. MITF-low zebrafish melanomas resembled human MITF-low melanomas and were enriched for stem and invasive (mesenchymal) gene signatures. MITF-low activity coupled with a p53 mutation was sufficient to promote superficial growth melanomas, whereas BRAFV600E accelerated MITF-low melanoma onset and further promoted the development of MITF-high nodular growth melanomas. Genetic inhibition of MITF activity led to rapid regression; recurrence occurred following reactivation of MITF. At the regression site, there was minimal residual disease that was resistant to loss of MITF activity (termed MITF-independent cells) with very low-to-no MITF activity or protein. Transcriptomic analysis of MITF-independent residual disease showed enrichment of mesenchymal and neural crest stem cell signatures similar to human therapy-resistant melanomas. Single-cell RNA sequencing revealed MITF-independent residual disease was heterogeneous depending on melanoma subtype. Further, there was a shared subpopulation of residual disease cells that was enriched for a neural crest G0-like state that preexisted in the primary tumor and remained present in recurring melanomas. These findings suggest that invasive and stem-like programs coupled with cellular heterogeneity contribute to poor outcomes for MITF-low melanoma patients and that MITF-independent subpopulations are an important therapeutic target to achieve long-term survival outcomes. Significance: This study provides a useful model for MITF-low melanomas and MITF-independent cell populations that can be used to study the mechanisms that drive these tumors as well as identify potential therapeutic options.",
                "authors": [
                    {
                        "name": "Travnickova J."
                    },
                    {
                        "name": "Wojciechowska S."
                    },
                    {
                        "name": "Khamseh A."
                    },
                    {
                        "name": "Gautier P."
                    },
                    {
                        "name": "Brown D.V."
                    },
                    {
                        "name": "Lefevre T."
                    },
                    {
                        "name": "Brombin A."
                    },
                    {
                        "name": "Ewing A."
                    },
                    {
                        "name": "Capper A."
                    },
                    {
                        "name": "Spitzer M."
                    },
                    {
                        "name": "Dilshat R."
                    },
                    {
                        "name": "Semple C.A."
                    },
                    {
                        "name": "Mathers M.E."
                    },
                    {
                        "name": "Lister J.A."
                    },
                    {
                        "name": "Steingrimsson E."
                    },
                    {
                        "name": "Voet T."
                    },
                    {
                        "name": "Ponting C.P."
                    },
                    {
                        "name": "Elizabeth Patton E."
                    }
                ],
                "date": "2019-11-15T00:00:00Z",
                "journal": "Cancer Research",
                "title": "Zebrafish MITF-low melanoma subtype models reveal transcriptional subclusters and MITF-independent residual disease"
            },
            "pmid": "31582381"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}