{"credit":[],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Essential dynamics","uri":"http://edamontology.org/operation_3891"},{"term":"Deisotoping","uri":"http://edamontology.org/operation_3629"}]}],"labels":{"topic":[{"term":"Lipids","uri":"http://edamontology.org/topic_0153"},{"term":"Biomarkers","uri":"http://edamontology.org/topic_3360"},{"term":"Endocrinology and metabolism","uri":"http://edamontology.org/topic_3407"},{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"},{"term":"Personalised medicine","uri":"http://edamontology.org/topic_3577"}]},"link":[{"type":"OTHER","url":"https://lipidomics-standards-initiative.org/guidelines"}],"publication":[{"abstract":"© 2019 Wiley Periodicals, Inc.Lipids are essential for all facets of life. They play three major roles: energy metabolism, structural, and signaling. They are dynamic molecules strongly influenced by endogenous and exogenous factors including genetics, diet, age, lifestyle, drugs, disease and inflammation. As precision medicine starts to become mainstream, there is a huge burgeoning interest in lipids and their potential to act as unique biomarkers or prognostic indicators. Lipids comprise a large component of all metabolites (around one-third), and our expanding knowledge about their dynamic behavior is fueling the hope that mapping their regulatory biochemical pathways on a systems level will revolutionize our ability to prevent, diagnose, and stratify major human diseases. Up to now, clinical lipid measurements have consisted primarily of total cholesterol or triglycerides, as a measure for cardiovascular risk and response to lipid lowering drugs. Nowadays, we are able to measure thousands of individual lipids that make up the lipidome. nuclear magnetic resonance spectrometry (NMR) metabolomics is also being increasingly used in large cohort studies where it can report on total levels of selected lipid classes, and relative levels of fatty acid saturation. To support the application of lipidomics research, LIPID MAPS was established in 2003, and since then has gone on to become the go-to resource for several lipid databases, lipid drawing tools, data deposition, and more recently lipidomics informatics tools, and a lipid biochemistry encyclopedia, LipidWeb. Alongside this, the recently established Lipidomics Standards Initiative plays a key role in standardization of lipidomics methodologies. This article is categorized under: Laboratory Methods and Technologies > Metabolomics Analytical and Computational Methods > Analytical Methods.","authors":["O'Donnell V.B.","Ekroos K.","Liebisch G.","Wakelam M."],"cit_count":0,"doi":"10.1002/WSBM.1466","journal":"Wiley Interdisciplinary Reviews: Systems Biology and Medicine","pmid":"31646749","title":"Lipidomics: Current state of the art in a fast moving field","year":"2020-01-01"}],"summary":{"biotoolsCURIE":"biotools:lipidomics","biotoolsID":"lipidomics","description":"Current state of the art in a fast moving field.\n\nLipidomics-Standards-Initiative (LSI).\n\nRegensburg, Lipidomics, LipidomicsRegensburg, LSI, Lipidomics-Standard-Initiative Lipidomics-Regensburg, Gerhard Liebisch, Silke Matysik, Lipid, Lipids, LCMS, GCMS, Mass Spectrometry, Gaschromatography, Analytical Chemistry, High-Resolution-MS.\n\nWelcome to the Lipidomics Standard Initiative (LSI)","homepage":"https://lipidomics-standards-initiative.org/","name":"lipidomics"}}