{
    "additionDate": "2024-01-23T10:51:32.987902Z",
    "biotoolsCURIE": "biotools:envirule",
    "biotoolsID": "envirule",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kunyang.zhang@eawag.ch",
            "name": "Kunyang Zhang",
            "orcidid": "https://orcid.org/0009-0008-4588-9487",
            "typeEntity": "Person"
        }
    ],
    "description": "End-to-end system for automatic extraction of reaction patterns from environmental contaminant biotransformation pathways.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhangky12/enviRule",
    "language": [
        "Java"
    ],
    "lastUpdate": "2024-01-23T10:51:32.990470Z",
    "license": "LGPL-3.0",
    "name": "enviRule",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD407",
            "metadata": {
                "abstract": "Motivation: Transformation products (TPs) of man-made chemicals, formed through microbially mediated transformation in the environment, can have serious adverse environmental effects, yet the analytical identification of TPs is challenging. Rule-based prediction tools are successful in predicting TPs, especially in environmental chemistry applications that typically have to rely on small datasets, by imparting the existing knowledge on enzyme-mediated biotransformation reactions. However, the rules extracted from biotransformation reaction databases usually face the issue of being over/under-generalized and are not flexible to be updated with new reactions. Results: We developed an automatic rule extraction tool called enviRule. It clusters biotransformation reactions into different groups based on the similarities of reaction fingerprints, and then automatically extracts and generalizes rules for each reaction group in SMARTS format. It optimizes the genericity of automatic rules against the downstream TP prediction task. Models trained with automatic rules outperformed the models trained with manually curated rules by 30% in the area under curve (AUC) scores. Moreover, automatic rules can be easily updated with new reactions, highlighting enviRule's strengths for both automatic extraction of optimized reactions rules and automated updating thereof.",
                "authors": [
                    {
                        "name": "Fenner K."
                    },
                    {
                        "name": "Zhang K."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "enviRule: an end-to-end system for automatic extraction of reaction patterns from environmental contaminant biotransformation pathways"
            },
            "pmcid": "PMC10322654",
            "pmid": "37354527"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
