{
    "additionDate": "2017-01-17T15:02:14Z",
    "biotoolsCURIE": "biotools:globalancova",
    "biotoolsID": "globalancova",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "m.hummel@dkfz.de",
            "name": "Manuela Hummel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "We give the following arguments in support this approach: After normalization, gene-expression-data appears symmetrical and outliers are no problem, least squares should be robust. ANCOVA with interaction yields saturated data modelling e.g. different means per group and gene. Covariate adjustment can help to correct for possible selection bias. Variance homogeneity and uncorrelated residuals can’t be expected. Application of ordinary least squares gives unbiased, no longer optimal estimates.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/GlobalAncova.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GlobalAncova_3.42.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/GlobalAncova.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-2.0",
    "name": "GlobalAncova",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm531",
            "metadata": {
                "abstract": "Motivation: Several authors have studied expression in gene sets with specific goals: overrepresentation of interesting genes in functional groups, predictive power for class membership and searches for groups where the constituent genes show coordinated changes in expression under the experimental conditions. The purpose of this article is to follow the third direction. One important aspect is that the gene sets under analysis are known a priori and are not determined from the experimental data at hand. Our goal is to provide a methodology that helps to identify the relevant structural constituents (phenotypical, experimental design, biological component) that determine gene expression in a group. Results: Gene-wise linear models are used to formalize the structural aspects of a study. The full model is contrasted with a reduced model that lacks the relevant design component. A comparison with respect to goodness of fit is made and quantified. An asymptotic test and a permutation test are derived to test the null hypothesis that the reduced model sufficiently explains the observed expression within the gene group of interest. Graphical tools are available to illustrate and interpret the results of the analysis. Examples demonstrate the wide range of application. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Hummel M."
                    },
                    {
                        "name": "Mansmann U."
                    },
                    {
                        "name": "Meister R."
                    }
                ],
                "citationCount": 109,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GlobalANCOVA: Exploration and assessment of gene group effects"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "3.42.0"
    ]
}
