{
    "additionDate": "2018-04-27T10:10:47Z",
    "biotoolsCURIE": "biotools:phi-base",
    "biotoolsID": "phi-base",
    "credit": [
        {
            "email": "contact@phi-base.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PHI-base contains expertly curated molecular and biological information on genes proven to affect the outcome of pathogen–host interactions reported in peer reviewed research articles.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://www.youtube.com/watch?v=5DLXo0_brMo"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "UK"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.phi-base.org/",
    "lastUpdate": "2019-02-15T10:23:56Z",
    "name": "PHI-base",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKW1089",
            "metadata": {
                "abstract": "© 2016 The Author(s).The pathogen-host interactions database (PHI-base) is available at www.phi-base.org. PHI-base contains expertly curated molecular and biological information on genes proven to affect the outcome of pathogen-host interactions reported in peer reviewed research articles. In addition, literature that indicates specific gene alterations that did not affect the disease interaction phenotype are curated to provide complete datasets for comparative purposes. Viruses are not included. Here we describe a revised PHI-base Version 4 data platform with improved search, filtering and extended data display functions. A PHIB-BLAST search function is provided and a link to PHI-Canto, a tool for authors to directly curate their own published data into PHI-base. The new release of PHI-base Version 4.2 (October 2016) has an increased data content containing information from 2219 manually curated references. The data provide information on 4460 genes from 264 pathogens tested on 176 hosts in 8046 interactions. Prokaryotic and eukaryotic pathogens are represented in almost equal numbers. Host species belong ∼70% to plants and 30% to other species of medical and/or environmental importance. Additional data types included into PHI-base 4 are the direct targets of pathogen effector proteins in experimental and natural host organisms. The curation problems encountered and the future directions of the PHI-base project are briefly discussed.",
                "authors": [
                    {
                        "name": "Urban M."
                    },
                    {
                        "name": "Cuzick A."
                    },
                    {
                        "name": "Rutherford K."
                    },
                    {
                        "name": "Irvine A."
                    },
                    {
                        "name": "Pedro H."
                    },
                    {
                        "name": "Pant R."
                    },
                    {
                        "name": "Sadanadan V."
                    },
                    {
                        "name": "Khamari L."
                    },
                    {
                        "name": "Billal S."
                    },
                    {
                        "name": "Mohanty S."
                    },
                    {
                        "name": "Hammond-Kosack K.E."
                    }
                ],
                "citationCount": 98,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PHI-base: A new interface and further additions for the multi-species pathogen-host interactions database"
            },
            "pmcid": "PMC5210566",
            "pmid": "27915230"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}