{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-19T09:21:50Z",
    "biotoolsCURIE": "biotools:ClinTAD",
    "biotoolsID": "ClinTAD",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ClinicalTAD@gmail.com",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Quick evaluation of the clinical relevance of copy number variants (CNVs) in the context of topologically associated domains (TADs).",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/JacobSpectorMD/ClinTAD"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://www.clintad.com/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-05-19T09:21:50Z",
    "maturity": "Mature",
    "name": "ClinTAD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1038/s10038-019-0573-9",
            "metadata": {
                "abstract": "© 2019, The Author(s) under exclusive licence to The Japan Society of Human Genetics. Standard clinical interpretation of DNA copy number variants (CNVs) identified by cytogenomic microarray involves examining protein-coding genes within the region and comparison to other CNVs. Emerging basic research suggests that CNVs can also exert a pathogenic effect through disruption of DNA structural elements such as topologically associated domains (TADs). To begin to integrate these discoveries with current practice, we developed ClinTAD, a free browser-based tool to assist with interpretation of CNVs in the context of TADs (www.clintad.com). We used ClinTAD to examine 209 randomly selected single-nucleotide polymorphism microarray cases with a total of 236 CNVs. We compared 118 CNVs classified as variants of uncertain clinical significance (VUS), where additional insight into pathogenicity of these CNVs would be of greatest utility, to 118 CNVs classified as benign. We found that a higher proportion of VUS had at least two genes in a nearby TAD related to a phenotype seen in the patient based on Human Phenotype Ontology (HPO) annotation. We present example cases demonstrating scenarios where ClinTAD may either increase or decrease clinical suspicion of pathogenicity for VUS, depending on disruption of TAD boundaries and HPO phenotype match. ClinTAD is an easy-to-use tool, based on emerging research in chromatin architecture, that can help inform CNV interpretation.",
                "authors": [
                    {
                        "name": "Spector J.D."
                    },
                    {
                        "name": "Wiita A.P."
                    }
                ],
                "date": "2019-05-01T00:00:00Z",
                "journal": "Journal of Human Genetics",
                "title": "ClinTAD: a tool for copy number variant interpretation in the context of topologically associated domains"
            },
            "pmid": "30765865",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}