{"credit":[{"email":"yufeng.wu@uconn.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.engr.uconn.edu/~ywu/"}],"documentation":[{"type":"GENERAL","url":"http://www.engr.uconn.edu/~ywu/STELLS.html"}],"function":[{"operation":[{"term":"Phylogenetic tree analysis","uri":"http://edamontology.org/operation_0324"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"},{"term":"Evolutionary biology","uri":"http://edamontology.org/topic_3299"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/stells-1-6-1-stellsh-1-0-inferring-species-tree-from-gene-tree-topologies.html"}],"publication":[{"abstract":"© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: Population trees represent past population divergence histories. The inference of population trees can be useful for the study of population evolution. With the size of data increases in large-scale population genetic projects, such as the 1000 Genomes Project, there are new computational challenges for ancestral population inference, including population tree inference. Existing methods for population tree inference are mainly designed for unlinked genetic variants (e.g. single nucleotide polymorphisms or SNPs). There is a potential loss of information by not considering the haplotypes. Results: In this article, we propose a new population tree inference method (called STELLSH) based on coalescent likelihood. The likelihood is for haplotypes over multiple SNPs within a non-recombining region, not unlinked variants. Unlike many existing ancestral inference methods, STELLSH does not use Monte Carlo approaches when computing the likelihood. For efficient computation, the likelihood model is approximated but still retains much information about population divergence history. STELLSH can find the maximum likelihood population tree based on the approximate likelihood. We show through simulation data and the 1000 Genomes Project data that STELLSH gives reasonably accurate inference results. STELLSH is reasonably efficient for data of current interest and can scale to handle whole-genome data.","authors":["Wu Y."],"cit_count":6,"journal":"Bioinformatics","pmid":"25344500","title":"A coalescent-based method for population tree inference with haplotypes","year":"2015-03-01"}],"summary":{"biotoolsCURIE":"biotools:stells","biotoolsID":"stells","description":"A program for finding the maximum likelihood estimate of the species tree for the given gene trees, which undergo incomplete lineage sorting.","homepage":"http://www.engr.uconn.edu/~ywu/STELLS.html","name":"STELLS"}}