{"credit":[{"email":"cokelaer@ebi.ac.uk","name":"T.Cokelaer","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/CellNOptR.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/CellNOptR_1.20.0.tar.gz"}],"function":[{"input":[{"data":{"term":"Pathway or network","uri":"http://edamontology.org/data_2600"},"format":[{"term":"sif","uri":"http://edamontology.org/format_3619"},{"term":"TSV","uri":"http://edamontology.org/format_3475"},{"term":"Biological pathway or network format","uri":"http://edamontology.org/format_2013"}]}],"operation":[{"term":"Optimisation and refinement","uri":"http://edamontology.org/operation_2425"},{"term":"Modelling and simulation","uri":"http://edamontology.org/operation_2426"}],"output":[{"data":{"term":"Pathway or network report","uri":"http://edamontology.org/data_2984"},"format":[{"term":"sif","uri":"http://edamontology.org/format_3619"},{"term":"HTML","uri":"http://edamontology.org/format_2331"},{"term":"Graph format","uri":"http://edamontology.org/format_3617"},{"term":"PDF","uri":"http://edamontology.org/format_3508"}]}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"}]},"publication":[{"abstract":"Background: Cells process signals using complex and dynamic networks. Studying how this is performed in a context and cell type specific way is essential to understand signaling both in physiological and diseased situations. Context-specific medium/high throughput proteomic data measured upon perturbation is now relatively easy to obtain but formalisms that can take advantage of these features to build models of signaling are still comparatively scarce.Results: Here we present CellNOptR, an open-source R software package for building predictive logic models of signaling networks by training networks derived from prior knowledge to signaling (typically phosphoproteomic) data. CellNOptR features different logic formalisms, from Boolean models to differential equations, in a common framework. These different logic model representations accommodate state and time values with increasing levels of detail. We provide in addition an interface via Cytoscape (CytoCopteR) to facilitate use and integration with Cytoscape network-based capabilities.Conclusions: Models generated with this pipeline have two key features. First, they are constrained by prior knowledge about the network but trained to data. They are therefore context and cell line specific, which results in enhanced predictive and mechanistic insights. Second, they can be built using different logic formalisms depending on the richness of the available data. Models built with CellNOptR are useful tools to understand how signals are processed by cells and how this is altered in disease. They can be used to predict the effect of perturbations (individual or in combinations), and potentially to engineer therapies that have differential effects/side effects depending on the cell type or context. © 2012 Terfve et al; licensee BioMed Central Ltd.","authors":["Terfve C.","Cokelaer T.","Henriques D.","MacNamara A.","Goncalves E.","Morris M.K.","Iersel M.V.","Lauffenburger D.A.","Saez-Rodriguez J."],"cit_count":83,"doi":"10.1186/1752-0509-6-133","journal":"BMC Systems Biology","title":"CellNOptR: A flexible toolkit to train protein signaling networks to data using multiple logic formalisms","type":"Primary","year":"2012-10-18"}],"summary":{"biotoolsCURIE":"biotools:cellnoptr","biotoolsID":"cellnoptr","description":"This package does optimisation of boolean logic networks of signalling pathways based on a previous knowledge network and a set of data upon perturbation of the nodes in the network.","homepage":"http://bioconductor.org/packages/release/bioc/html/CellNOptR.html","name":"CellNOptR","version":["1.20.0"]}}