{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T09:06:05.118384Z",
    "biotoolsCURIE": "biotools:fsa",
    "biotoolsID": "fsa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rbradley@berkeley.edu",
            "name": "Robert K. Bradley",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "FSA (Fast Statistical Alignment) is a probabilistic multiple sequence alignment algorithm which uses a \"distance-based\" approach to aligning homologous protein, RNA or DNA sequence. FSA brings the high accuracies previously available only for small-scale analyses of proteins or RNAs to large-scale problems such as aligning thousands of sequences or megabase-long sequences.",
    "documentation": [
        {
            "type": [
                "FAQ"
            ],
            "url": "http://fsa.sourceforge.net/FAQ.html"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://sourceforge.net/projects/fsa/files/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://fsa.sourceforge.net/",
    "lastUpdate": "2024-11-24T20:10:58.083952Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://sourceforge.net/p/fsa/bugs/"
        }
    ],
    "name": "FSA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1000392",
            "metadata": {
                "abstract": "We describe a new program for the alignment of multiple biological sequences that is both statistically motivated and fast enough for problem sizes that arise in practice. Our Fast Statistical Alignment program is based on pair hidden Markov models which approximate an insertion/deletion process on a tree and uses a sequence annealing algorithm to combine the posterior probabilities estimated from these models into a multiple alignment. FSA uses its explicit statistical model to produce multiple alignments which are accompanied by estimates of the alignment accuracy and uncertainty for every column and character of the alignment - previously available only with alignment programs which use computationally-expensive Markov Chain Monte Carlo approaches - yet can align thousands of long sequences. Moreover, FSA utilizes an unsupervised query-specific learning procedure for parameter estimation which leads to improved accuracy on benchmark reference alignments in comparison to existing programs. The centroid alignment approach taken by FSA, in combination with its learning procedure, drastically reduces the amount of false-positive alignment on biological data in comparison to that given by other methods. The FSA program and a companion visualization tool for exploring uncertainty in alignments can be used via a web interface at http://orangutan.math.berkeley.edu/fsa/, and the source code is available at http://fsa.sourceforge.net/. © 2009 Bradley et al.",
                "authors": [
                    {
                        "name": "Bradley R.K."
                    },
                    {
                        "name": "Dewey C."
                    },
                    {
                        "name": "Do J."
                    },
                    {
                        "name": "Holmes I."
                    },
                    {
                        "name": "Juvekar S."
                    },
                    {
                        "name": "Pachter L."
                    },
                    {
                        "name": "Roberts A."
                    },
                    {
                        "name": "Smoot M."
                    }
                ],
                "citationCount": 269,
                "date": "2009-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Fast statistical alignment"
            },
            "pmcid": "PMC2684580",
            "pmid": "19478997",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
