
{
    "credit": [
        {
            "email": "michaelisaiahlove@gmail.com",
            "name": "Michael Love",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/exomeCopy.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/exomeCopy_1.20.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Exome sequencing",
                "uri": "http://edamontology.org/topic_3676"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Varying depth of high-throughput sequencing reads along a chromosome makes it possible to observe copy number variants (CNVs) in a sample relative to a reference. In exome and other targeted sequencing projects, technical factors increase variation in read depth while reducing the number of observed locations, adding difficulty to the problem of identifying CNVs. We present a hidden Markov model for detecting CNVs from raw read count data, using background read depth from a control set as well as other positional covariates such as GC-content. The model, exomeCopy, is applied to a large chromosome X exome sequencing project identifying a list of large unique CNVs. CNVs predicted by the model and experimentally validated are then recovered using a cross-platform control set from publicly available exome sequencing data. Simulations show high sensitivity for detecting heterozygous and homozygous CNVs, outperforming normalization and state-of-the-art segmentation methods. © 2011 De Gruyter. All rights reserved.",
            "authors": [
                "Love M.I.",
                "Myisickova A.",
                "Sun R.",
                "Kalscheuer V.",
                "Vingron M.",
                "Haas S.A."
            ],
            "cit_count": 32,
            "doi": "10.2202/1544-6115.1732",
            "journal": "Statistical Applications in Genetics and Molecular Biology",
            "title": "Modeling read counts for CNV detection in exome sequencing data",
            "type": "Primary",
            "year": "2011-12-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:exomecopy",
        "biotoolsID": "exomecopy",
        "description": "Detection of copy number variants (CNV) from exome sequencing samples, including unpaired samples.  The package implements a hidden Markov model which uses positional covariates, such as background read depth and GC-content, to simultaneously normalize and segment the samples into regions of constant copy count.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/exomeCopy.html",
        "name": "exomeCopy",
        "version": [
            "1.20.0"
        ]
    }
}