{
    "additionDate": "2021-01-18T08:00:07Z",
    "biotoolsCURIE": "biotools:cancerliver",
    "biotoolsID": "cancerliver",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Gajendra PS Raghava",
            "typeEntity": "Person"
        }
    ],
    "description": "CancerLivER (Liver Cancer Expression Resource) is a database of liver cancer that maintains gene expression datasets and biomarkers curated from public repositories and literature respectively. It contains the following three modules for extracting and analyzing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/cancerliver",
    "lastUpdate": "2021-02-07T12:35:47Z",
    "name": "CancerLivER",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA012",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Liver cancer is the fourth major lethal malignancy worldwide. To understand the development and progression of liver cancer, biomedical research generated a tremendous amount of transcriptomics and disease-specific biomarker data. However, dispersed information poses pragmatic hurdles to delineate the significant markers for the disease. Hence, a dedicated resource for liver cancer is required that integrates scattered multiple formatted datasets and information regarding disease-specific biomarkers. Liver Cancer Expression Resource (CancerLivER) is a database that maintains gene expression datasets of liver cancer along with the putative biomarkers defined for the same in the literature. It manages 115 datasets that include gene-expression profiles of 9611 samples. Each of incorporated datasets was manually curated to remove any artefact; subsequently, a standard and uniform pipeline according to the specific technique is employed for their processing. Additionally, it contains comprehensive information on 594 liver cancer biomarkers which include mainly 315 gene biomarkers or signatures and 178 protein- and 46 miRNA-based biomarkers. To explore the full potential of data on liver cancer, a web-based interactive platform was developed to perform search, browsing and analyses. Analysis tools were also integrated to explore and visualize the expression patterns of desired genes among different types of samples based on individual gene, GO ontology and pathways. Furthermore, a dataset matrix download facility was provided to facilitate the users for their extensive analysis to elucidate more robust disease-specific signatures. Eventually, CancerLivER is a comprehensive resource which is highly useful for the scientific community working in the field of liver cancer.Availability: CancerLivER can be accessed on the web at https://webs.iiitd.edu.in/raghava/cancerliver.",
                "authors": [
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Bhalla S."
                    },
                    {
                        "name": "Kaur D."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "CancerLivER: A database of liver cancer gene expression resources and biomarkers"
            },
            "pmcid": "PMC7061090",
            "pmid": "32147717"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}