{
    "additionDate": "2021-01-18T11:50:27Z",
    "biotoolsCURIE": "biotools:celltalkdb",
    "biotoolsID": "celltalkdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fanxh@zju.edu.cn",
            "name": "Xiaohui Fan",
            "typeEntity": "Person"
        }
    ],
    "description": "CellTalkDB is a manually curated database of ligand-receptor interactions in humans and mice. CellTalkDB contains literature-supported ligand-receptor (LR) pairs for human and mouse, which are curated from protein-protein interactions (PPIs) in STRING database and verified manually in Pubmed by three reviewers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://tcm.zju.edu.cn/celltalkdb",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-10T20:24:37Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ZJUFanLab/CellTalkDB"
        }
    ],
    "name": "CellTalkDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA269",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Cell-cell communications in multicellular organisms generally involve secreted ligand-receptor (LR) interactions, which is vital for various biological phenomena. Recent advancements in single-cell RNA sequencing (scRNA-seq) have effectively resolved cellular phenotypic heterogeneity and the cell-type composition of complex tissues, facilitating the systematic investigation of cell-cell communications at single-cell resolution. However, assessment of chemical-signal-dependent cell-cell communication through scRNA-seq relies heavily on prior knowledge of LR interaction pairs. We constructed CellTalkDB (http://tcm.zju.edu.cn/celltalkdb), a manually curated comprehensive database of LR interaction pairs in humans and mice comprising 3398 human LR pairs and 2033 mouse LR pairs, through text mining and manual verification of known protein-protein interactions using the STRING database, with literature-supported evidence for each pair. Compared with SingleCellSignalR, the largest LR-pair resource, CellTalkDB includes not only 2033 mouse LR pairs but also 377 additional human LR pairs. In conclusion, the data on human and mouse LR pairs contained in CellTalkDB could help to further the inference and understanding of the LR-interaction-based cell-cell communications, which might provide new insights into the mechanism underlying biological processes.",
                "authors": [
                    {
                        "name": "Shao X."
                    },
                    {
                        "name": "Liao J."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Lu X."
                    },
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Fan X."
                    }
                ],
                "citationCount": 2,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "CellTalkDB: a manually curated database of ligand-receptor interactions in humans and mice"
            },
            "pmid": "33147626"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        }
    ]
}