{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T07:41:48Z",
    "biotoolsCURIE": "biotools:mr-parkinsonism",
    "biotoolsID": "mr-parkinsonism",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "quattrone@unicz.it",
            "name": "Aldo Quattrone MD",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated MRI Classification in Progressive Supranuclear Palsy.\n\nMRPI – Magnetic Resonance Parkinsonism Index – Online Automatic Tool.\n\nMRI slices showing brainstem structures involved in the calculation of MRPI.\n\nParasagittal view of middle cerebellar peduncle.\n\nCoronal oblique reconstruction of superior cerebellar peduncles.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://mrpi.unicz.it",
    "lastUpdate": "2024-11-24T20:42:40.208854Z",
    "name": "MR-Parkinsonism",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/mds.28007",
            "metadata": {
                "abstract": "Background: The Magnetic Resonance Parkinsonism Index is listed as one of the most reliable imaging morphometric markers for diagnosis of progressive supranuclear palsy (PSP). However, the use of this index in diagnostic workup has been limited until now by the low generalizability of published results because of small monocentric patient cohorts, the lack of data validation in independent patient series, and manual measurements used for index calculation. The objectives of this study were to investigate the generalizability of Magnetic Resonance Parkinsonism Index performance validating previously established cutoff values in a large international cohort of PSP patients subclassified into PSP–Richardson's syndrome and PSP-parkinsonism and to standardize the use of the automated Magnetic Resonance Parkinsonism Index by providing a web-based platform to obtain homogenous measures around the world. Methods: In a retrospective international multicenter study, a total of 173 PSP patients and 483 non-PSP participants were enrolled. A web-based platform (https://mrpi.unicz.it) was used to calculate automated Magnetic Resonance Parkinsonism Index values. Results: Magnetic Resonance Parkinsonism Index values showed optimal performance in differentiating PSP–Richardson's syndrome and PSP-parkinsonism patients from non-PSP participants (93.6% and 86.5% of accuracy, respectively). The Magnetic Resonance Parkinsonism Index was also able to differentiate PSP–Richardson's syndrome and PSP-parkinsonism patients in an early stage of the disease from non-PSP participants (90.1% and 85.9%, respectively). The web-based platform provided the automated Magnetic Resonance Parkinsonism Index calculation in 94% of cases. Conclusions: Our study provides the first evidence on the generalizability of automated Magnetic Resonance Parkinsonism Index measures in a large international cohort of PSP–Richardson's syndrome and PSP-parkinsonism patients. The web-based platform enables widespread applicability of the automated Magnetic Resonance Parkinsonism Index to different clinical and research settings. © 2020 International Parkinson and Movement Disorder Society.",
                "authors": [
                    {
                        "name": "Antonini A."
                    },
                    {
                        "name": "Augimeri A."
                    },
                    {
                        "name": "Biundo R."
                    },
                    {
                        "name": "Burciu R.G."
                    },
                    {
                        "name": "Ceravolo R."
                    },
                    {
                        "name": "Cosottini M."
                    },
                    {
                        "name": "Del Prete E."
                    },
                    {
                        "name": "Fiorenzato E."
                    },
                    {
                        "name": "Gizewski E.R."
                    },
                    {
                        "name": "Krismer F."
                    },
                    {
                        "name": "Mazzucchi S."
                    },
                    {
                        "name": "McFarland N.R."
                    },
                    {
                        "name": "Morelli M."
                    },
                    {
                        "name": "Mueller C."
                    },
                    {
                        "name": "Nigro S."
                    },
                    {
                        "name": "Quattrone A."
                    },
                    {
                        "name": "Quattrone A."
                    },
                    {
                        "name": "Seppi K."
                    },
                    {
                        "name": "Strafella A.P."
                    },
                    {
                        "name": "Vaillancourt D.E."
                    },
                    {
                        "name": "Weis L."
                    }
                ],
                "citationCount": 43,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Movement Disorders",
                "title": "Automated MRI Classification in Progressive Supranuclear Palsy: A Large International Cohort Study"
            },
            "pmcid": "PMC8310687",
            "pmid": "32092195"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
