
{
    "credit": [
        {
            "email": "luis.serrano@crg.es",
            "name": "Luis Serrano",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://en.wikipedia.org/wiki/Brix_(database)"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein modelling (backbone)",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein modelling (loops)",
                    "uri": "http://edamontology.org/operation_0481"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "SQL"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Protein folding, stability and design",
                "uri": "http://edamontology.org/topic_0130"
            }
        ]
    },
    "publication": [
        {
            "abstract": "High-resolution structures of proteins remain the most valuable source for understanding their function in the cell and provide leads for drug design. Since the availability of sufficient protein structures to tackle complex problems such as modeling backbone moves or docking remains a problem, alternative approaches using small, recurrent protein fragments have been employed. Here we present two databases that provide a vast resource for implementing such fragment-based strategies. The BriX database contains fragments from over 7000 non-homologous proteins from the Astral collection, segmented in lengths from 4 to 14 residues and clustered according to structural similarity, summing up to a content of 2 million fragments per length. To overcome the lack of loops classified in BriX, we constructed the Loop BriX database of non-regular structure elements, clustered according to end-to-end distance between the regular residues flanking the loop. Both databases are available online (http://brix.crg.es) and can be accessed through a user-friendly web-interface. For highthroughput queries a web-based API is provided, as well as full database downloads. In addition, two exciting applications are provided as online services: (i) user-submitted structures can be covered on the fly with BriX classes, representing putative structural variation throughout the protein and (ii) gaps or low-confidence regions in these structures can be bridged with matching fragments. © The Author(s) 2010.",
            "authors": [
                "Vanhee P.",
                "Verschueren E.",
                "Baeten L.",
                "Stricher F.",
                "Serrano L.",
                "Rousseau F.",
                "Schymkowitz J."
            ],
            "cit_count": 29,
            "journal": "Nucleic Acids Research",
            "pmid": "20972210",
            "title": "BriX: A database of protein building blocks for structural analysis, modeling and design",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:brix",
        "biotoolsID": "brix",
        "description": "Vast database of protein fragments, clustered on their backbone similarity. It contains fragments from 7290 proteins from the Astral40 set, fragmented in lengths ranging from 4 to 14 amino acids and clustered against 6 different distance thresholds on similarity of the protein backbone. Loop subset contains loop fragments from 14.525 proteins from the Astral95 set, clustered according to end-to-distance and anchor residue superposition.",
        "homepage": "http://brix.crg.es",
        "name": "BriX"
    }
}