{
    "additionDate": "2021-01-20T10:54:49Z",
    "biotoolsCURIE": "biotools:novocaller",
    "biotoolsID": "novocaller",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Anwoy Kumar Mohanty",
            "typeEntity": "Person"
        },
        {
            "email": "atoth-petroczy@bwh.harvard.edu",
            "name": "Agnes Toth-Petroczy",
            "typeEntity": "Person"
        },
        {
            "email": "ssunyaev@bwh.harvard.edu",
            "name": "Shamil Sunyaev",
            "typeEntity": "Person"
        }
    ],
    "description": "A Bayesian network approach for de novo variant calling from pedigree and population sequence data.\n\nnovoCaller is a Bayesian de novo variant calling algorithm that uses information from read-level data both in the pedigree and in unrelated samples. The method was extensively tested using large trio sequencing studies, and it consistently achieved over 98% sensitivity while giving significantly more specificity than other well known methods for the same sensitivity values.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bgm-cwg/novoCaller",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-05-18T05:29:55.696984Z",
    "license": "MIT",
    "name": "novoCaller",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTY749",
            "metadata": {
                "abstract": "© 2018 The Author(s). Published by Oxford University Press. All rights reserved.Motivation De novo mutations (i.e. newly occurring mutations) are a pre-dominant cause of sporadic dominant monogenic diseases and play a significant role in the genetics of complex disorders. De novo mutation studies also inform population genetics models and shed light on the biology of DNA replication and repair. Despite the broad interest, there is room for improvement with regard to the accuracy of de novo mutation calling. Results We designed novoCaller, a Bayesian variant calling algorithm that uses information from read-level data both in the pedigree and in unrelated samples. The method was extensively tested using large trio-sequencing studies, and it consistently achieved over 97% sensitivity. We applied the algorithm to 48 trio cases of suspected rare Mendelian disorders as part of the Brigham Genomic Medicine gene discovery initiative. Its application resulted in a significant reduction in the resources required for manual inspection and experimental validation of the calls. Three de novo variants were found in known genes associated with rare disorders, leading to rapid genetic diagnosis of the probands. Another 14 variants were found in genes that are likely to explain the phenotype, and could lead to novel disease-gene discovery.",
                "authors": [
                    {
                        "name": "Mohanty A.K."
                    },
                    {
                        "name": "Vuzman D."
                    },
                    {
                        "name": "Francioli L."
                    },
                    {
                        "name": "Cassa C."
                    },
                    {
                        "name": "Toth-Petroczy A."
                    },
                    {
                        "name": "Sunyaev S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NovoCaller: A Bayesian network approach for de novo variant calling from pedigree and population sequence data"
            },
            "pmcid": "PMC6449753",
            "pmid": "30169785"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}