{
    "additionDate": "2021-06-14T13:06:05Z",
    "biotoolsCURIE": "biotools:ceps",
    "biotoolsID": "ceps",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "davidmayor@welwynacupuncture.co.uk",
            "name": "David Mayor",
            "orcidid": "https://orcid.org/0000-0002-2199-2091",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CEPS is an open access MATLAB Graphical User Interface (GUI) for the analysis of complexity and entropy in physiological signals.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/deepak_panday/pipeline/src/master/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-08-20T06:26:16Z",
    "license": "LGPL-3.0",
    "name": "CEPS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/E23030321",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Background: We developed CEPS as an open access MATLAB® GUI (graphical user inter-face) for the analysis of Complexity and Entropy in Physiological Signals (CEPS), and demonstrate its use with an example data set that shows the effects of paced breathing (PB) on variability of heart, pulse and respiration rates. CEPS is also sufficiently adaptable to be used for other time series physiological data such as EEG (electroencephalography), postural sway or temperature measurements. Methods: Data were collected from a convenience sample of nine healthy adults in a pilot for a larger study investigating the effects on vagal tone of breathing paced at various different rates, part of a development programme for a home training stress reduction system. Results: The current version of CEPS focuses on those complexity and entropy measures that appear most frequently in the lit-erature, together with some recently introduced entropy measures which may have advantages over those that are more established. Ten methods of estimating data complexity are currently in-cluded, and some 28 entropy measures. The GUI also includes a section for data pre‐processing and standard ancillary methods to enable parameter estimation of embedding dimension m and time delay τ (‘tau’) where required. The software is freely available under version 3 of the GNU Lesser General Public License (LGPLv3) for non‐commercial users. CEPS can be downloaded at https://bit-bucket.org/deepak_panday/ceps/src/pipeline_v2/. In our illustration on PB, most complexity and entropy measures decreased significantly in response to breathing at 7 breaths per minute, differ-entiating more clearly than conventional linear, time‐ and frequency‐domain measures between breathing states. In contrast, Higuchi fractal dimension increased during paced breathing. Conclu-sions: We have developed CEPS software as a physiological data visualiser able to integrate state of the art techniques. The interface is designed for clinical research and has a structure designed for integrating new tools. The aim is to strengthen collaboration between clinicians and the biomedical community, as demonstrated here by using CEPS to analyse various physiological responses to paced breathing.",
                "authors": [
                    {
                        "name": "Banks D."
                    },
                    {
                        "name": "Kandel H.K."
                    },
                    {
                        "name": "Mayor D."
                    },
                    {
                        "name": "Panday D."
                    },
                    {
                        "name": "Steffert T."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Entropy",
                "title": "Ceps: An open access matlab graphical user interface (gui) for the analysis of complexity and entropy in physiological signals"
            },
            "pmcid": "PMC7998823",
            "pmid": "33800469",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
