{
    "accessibility": "Open access",
    "additionDate": "2022-05-24T21:01:54.315757Z",
    "biotoolsCURIE": "biotools:holistic",
    "biotoolsID": "holistic",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Angela Nguyen"
        },
        {
            "name": "Rahib Islam"
        },
        {
            "name": "Matthew Hayes",
            "orcidid": "https://orcid.org/0000-0002-0457-8550"
        }
    ],
    "description": "Unambiguous prediction of multiple double minute chromosome architectures.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.github.com/mhayes20/HolistIC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-24T21:01:54.318281Z",
    "license": "Not licensed",
    "name": "HolistIC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB816",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved.Motivation: Double minute (DM) chromosomes are acentric extrachromosomal DNA artifacts that are frequently observed in the cells of numerous cancers. They are highly amplified and contain oncogenes and drug-resistance genes, making their presence a challenge for effective cancer treatment. Algorithmic discovery of DM can potentially improve bench-derived therapies for cancer treatment. A hindrance to this task is that DMs evolve, yielding circular chromatin that shares segments from progenitor DMs. This creates DMs with overlapping amplicon coordinates. Existing DM discovery algorithms use whole genome shotgun sequencing (WGS) in isolation, which can potentially incorrectly classify DMs that share overlapping coordinates. Results: In this study, we describe an algorithm called 'HolistIC' that can predict DMs in tumor genomes by integrating WGS and Hi-C sequencing data. The consolidation of these sources of information resolves ambiguity in DM amplicon prediction that exists in DM prediction with WGS data used in isolation. We implemented and tested our algorithm on the tandem Hi-C and WGS datasets of three cancer datasets and a simulated dataset. Results on the cancer datasets demonstrated HolistIC's ability to predict DMs from Hi-C and WGS data in tandem. The results on the simulated data showed the HolistIC can accurately distinguish DMs that have overlapping amplicon coordinates, an advance over methods that predict extrachromosomal amplification using WGS data in isolation.",
                "authors": [
                    {
                        "name": "Butler C."
                    },
                    {
                        "name": "Hayes M."
                    },
                    {
                        "name": "Hicks C."
                    },
                    {
                        "name": "Islam R."
                    },
                    {
                        "name": "Mullins D."
                    },
                    {
                        "name": "Nguyen A."
                    },
                    {
                        "name": "Tran E."
                    }
                ],
                "date": "2022-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HolistIC: Leveraging Hi-C and whole genome shotgun sequencing for double minute chromosome discovery"
            },
            "pmid": "34888626"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
