{
    "additionDate": "2020-01-09T18:18:39Z",
    "biotoolsCURIE": "biotools:OAR",
    "biotoolsID": "OAR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gretchen.greene@nist.gov",
            "name": "Gretchen Greene",
            "typeEntity": "Person"
        }
    ],
    "description": "Building Open Access to Research (OAR) Data Infrastructure at NIST.\n\nThe NIST Open Access to Research (OAR) Public Data Repository (PDR) system software.\n\nPublishing Data Repository (oar-pdr).\n\nThe oar-metadata package is a prerequisite which is configured as git sub-module of this package. This means after you clone the oar-pdr git repository, you should use git submodule to pull in the oar-metadata package into it:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/usnistgov/oar-pdr",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-04T12:48:22Z",
    "name": "OAR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.5334/DSJ-2019-030",
            "metadata": {
                "abstract": "© 2019 The Author(s).As a National Metrology Institute (NMI), the USA National Institute of Standards and Technology (NIST) scientists, engineers and technology experts conduct research across a full spectrum of physical science domains. NIST is a non-regulatory agency within the U.S. Department of Commerce with a mission to promote U.S. innovation and industrial competitiveness by advancing measurement science, standards, and technology in ways that enhance economic security and improve our quality of life. NIST research results in the production and distribution of standard reference materials, calibration services, and datasets. These are generated from a wide range of complex laboratory instrumentation, expert analyses, and calibration processes. In response to a government open data policy, and in collaboration with the broader research community, NIST has developed a federated Open Access to Research (OAR) scientific data infrastructure aligned with FAIR (Findable, Accessible, Interoperable, Reusable) data principles. Through the OAR initiatives, NIST’s Material Measurement Laboratory Office of Data and Informatics (ODI) recently released a new scientific data discovery portal and public data repository. These science- oriented applications provide dissemination and public access for data from across the broad spectrum of NIST research disciplines, including chemistry, biology, materials science (such as crystallography, nanomaterials, etc.), physics, disaster resilience, cyberinfrastructure, communications, forensics, and others. NIST’s public data consist of carefully curated Standard Reference Data, legacy high valued data, and new research data publications. The repository is thus evolving both in content and features as the nature of research progresses. Implementation of the OAR infrastructure is key to NIST’s role in sharing high integrity reproducible research for measurement science in a rapidly changing world.",
                "authors": [
                    {
                        "name": "Greene G."
                    },
                    {
                        "name": "Hanisch R."
                    },
                    {
                        "name": "Plante R."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Data Science Journal",
                "title": "Building open access to research (OAR) data infrastructure at NIST"
            },
            "pmcid": "PMC6774380",
            "pmid": "31579260"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ],
    "validated": 1
}
