{
    "accessibility": "Open access",
    "additionDate": "2021-12-12T14:14:17.122208Z",
    "biotoolsCURIE": "biotools:bns_framework",
    "biotoolsID": "bns_framework",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "egbertocr@midiacom.uff.br",
            "name": "Egberto Caballero",
            "orcidid": "https://orcid.org/0000-0003-1606-9283",
            "typeEntity": "Person"
        }
    ],
    "description": "The Body Network Simulator (BNS) Framework is a WBAN realistic simulation framework.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/midiacom/BNS-Framework",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-12-12T14:14:17.125353Z",
    "license": "Other",
    "name": "BNS",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/S21165504",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Simulation is a useful and common technique to evaluate the performance of networks when the implementation of a real scenario is not available. Specifically for Wireless Body Area Networks (WBAN), it is crucial to perform evaluations in environments as close as possible to the real conditions of use. To achieve that, simulations must include different protocol layers involved in WBAN and models close to reality to create realistic simulation environments for e-health applications. To satisfy these needs, this work presents the BNS framework, a flexible tool for WBAN simulations. The proposal is an extension of the Castalia framework, which includes: (1) a new wireless channel model considering real radio-propagation over the human body; (2) an updated implementation of the WBAN MAC protocol in Castalia, with functionalities and requirements in accordance with the IEEE 802.15.6 standard; (3) a new comprehensive and configurable mobility model for simulating intra-WBAN communication; (4) a temperature module based on the Pennes bioheat transfer equation, to model the temperature of a WBAN node based on the activity of the node; and (5) a Healthcare Application Layer that implements data representation and a communication protocol between Personal Health Devices (PHD) following the ISO/IEEE 11073 standard. Three use cases are presented, where WBAN scenarios are simulated and evaluated using the proposed BNS framework. Results show that BNS is a valid and flexible tool to evaluate WBAN solutions through simulation.",
                "authors": [
                    {
                        "name": "Caballero E."
                    },
                    {
                        "name": "Ferreira V."
                    },
                    {
                        "name": "Lima R.A."
                    },
                    {
                        "name": "Soto J.C.H."
                    },
                    {
                        "name": "Muchaluat-Saade D."
                    },
                    {
                        "name": "Albuquerque C."
                    }
                ],
                "date": "2021-08-02T00:00:00Z",
                "journal": "Sensors",
                "title": "Bns: A framework for wireless body area network realistic simulations"
            },
            "pmcid": "PMC8402265",
            "pmid": "34450950"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ]
}