
{
    "credit": [
        {
            "email": "danielkossi@hotmail.com",
            "name": "Daniel Kosztyla",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/cancerclass.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/cancerclass_1.18.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Format validation",
                    "uri": "http://edamontology.org/operation_0336"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Personalised medicine",
                "uri": "http://edamontology.org/topic_3577"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2014, American Statistical Association. All rights reserved.Progress in molecular high-throughput techniques has led to the opportunity of a comprehensive monitoring of biomolecules in medical samples. In the era of personalized medicine, these data form the basis for the development of diagnostic, prognostic and predictive tests for cancer. Because of the high number of features that are measured simultaneously in a relatively low number of samples, supervised learning approaches are sensitive to overfitting and performance overestimation. Bioinformatic methods were developed to cope with these problems including control of accuaracy and precision. However, there is demand for easy-to-use software that integrates methods for classifier construction, performance assessment and development of diagnostic tests. To contribute to filling of this gap, we developed a comprehensive R package for the development and validation of diagnostic tests from high-dimensional molecular data. An important focus of the package is a careful validation of the classification results. To this end, we implemented an extended version of the multiple random validation protocol, a validation method that was introduced before. The package includes methods for continuous prediction scores. This is important in a clinical setting, because scores can be converted to probabilities and help to distinguish between clear-cut and borderline classification results. The functionality of the package is illustrated by the analysis of two cancer microarray data sets.",
            "authors": [
                "Budczies J.",
                "Kosztyla D.",
                "Von Torne C.",
                "Stenzinger A.",
                "Darb-Esfahani S.",
                "Dietel M.",
                "Denkert C."
            ],
            "cit_count": 5,
            "doi": "10.18637/jss.v059.i01",
            "journal": "Journal of Statistical Software",
            "title": "Cancerclass: An R package for development and validation of diagnostic tests from high-dimensional molecular data",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cancerclass",
        "biotoolsID": "cancerclass",
        "description": "The classification protocol starts with a feature selection step and continues with nearest-centroid classification. The accurarcy of the predictor can be evaluated using training and test set validation, leave-one-out cross-validation or in a multiple random validation protocol. Methods for calculation and visualization of continuous prediction scores allow to balance sensitivity and specificity and define a cutoff value according to clinical requirements.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/cancerclass.html",
        "name": "cancerclass",
        "version": [
            "1.18.0"
        ]
    }
}