{"credit":[{"email":"blischak.4@osu.edu","name":"Paul D Blischak","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/pblischak/polyploid-genotyping"}],"function":[{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["R","C++","Perl","Python"],"license":"GPL-3.0","toolType":["Command-line tool"],"topic":[{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"publication":[{"abstract":"© The Author 2017. Motivation Genotyping and parameter estimation using high throughput sequencing data are everyday tasks for population geneticists, but methods developed for diploids are typically not applicable to polyploid taxa. This is due to their duplicated chromosomes, as well as the complex patterns of allelic exchange that often accompany whole genome duplication (WGD) events. For WGDs within a single lineage (autopolyploids), inbreeding can result from mixed mating and/or double reduction. For WGDs that involve hybridization (allopolyploids), alleles are typically inherited through independently segregating subgenomes. Results We present two new models for estimating genotypes and population genetic parameters from genotype likelihoods for auto-and allopolyploids. We then use simulations to compare these models to existing approaches at varying depths of sequencing coverage and ploidy levels. These simulations show that our models typically have lower levels of estimation error for genotype and parameter estimates, especially when sequencing coverage is low. Finally, we also apply these models to two empirical datasets from the literature. Overall, we show that the use of genotype likelihoods to model non-standard inheritance patterns is a promising approach for conducting population genomic inferences in polyploids.","authors":["Blischak P.D.","Kubatko L.S.","Wolfe A.D."],"cit_count":3,"doi":"10.1093/bioinformatics/btx587","journal":"Bioinformatics","title":"SNP genotyping and parameter estimation in polyploids using low-coverage sequencing data","year":"2018-02-01"}],"summary":{"biotoolsCURIE":"biotools:polyploid-genotyping","biotoolsID":"polyploid-genotyping","description":"SNP genotyping and parameter estimation in polyploids using low-coverage sequencing data.","homepage":"https://github.com/pblischak/polyploid-genotyping","name":"polyploid-genotyping"}}