{
    "additionDate": "2017-03-24T11:31:26Z",
    "biotoolsCURIE": "biotools:capweb",
    "biotoolsID": "capweb",
    "description": "Tool for storing, analyzing and visualizing CGH-array data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.curie.fr/CAPweb/",
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "CAPweb",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Genomic DNA regions are frequently lost or gained during tumor progression. Array Comparative Genomic Hybridization (array CGH) technology makes it possible to assess these changes in DNA in cancers, by comparison with a normal reference. The identification of systematically deleted or amplified genomic regions in a set of tumors enables biologists to identify genes involved in cancer progression because tumor suppressor genes are thought to be located in lost genomic regions and oncogenes, in gained regions. Array CGH profiles should also improve the classification of tumors. The achievement of these goals requires a methodology for detecting the breakpoints delimiting altered regions in genomic patterns and assigning a status (normal, gained or lost) to each chromosomal region. Results: We have developed a methodology for the automatic detection of breakpoints from array CGH profile, and the assignment of a status to each chromosomal region. The breakpoint detection step is based on the Adaptive Weights Smoothing (AWS) procedure and provides highly convincing results: our algorithm detects 97, 100 and 94% of breakpoints in simulated data, karyotyping results and manually analyzed profiles, respectively. The percentage of correctly assigned statuses ranges from 98.9 to 99.8% for simulated data and is 100% for karyotyping results. Our algorithm also outperforms other solutions on a public reference dataset. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Hupe P."
                    },
                    {
                        "name": "Stransky N."
                    },
                    {
                        "name": "Thiery J.-P."
                    },
                    {
                        "name": "Radvanyi F."
                    },
                    {
                        "name": "Barillot E."
                    }
                ],
                "citationCount": 426,
                "date": "2004-12-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Analysis of array CGH data: From signal ratio to gain and loss of DNA regions"
            },
            "pmid": "15381628"
        },
        {
            "metadata": {
                "abstract": "Assessing variations in DNA copy number is crucial for understanding constitutional or somatic diseases, particularly cancers. The recently developed array-CGH(comparative genomic hybridization) technology allows this to be investigated at the genomic level. We report the availability of a web tool for analysing array-CGH data. CAPweb (CGH array Analysis Platform on the Web) is intended as a user-friendly tool enabling biologists to completely analyse CGH arrays from the raw data to the visualization and biological interpretation. The user typically performs the following bioinformatics steps of a CGH array project within CAPweb: the secure upload of the results of CGH array image analysis and of the array annotation (genomic position of the probes); first level analysis of each array, including automatic normalization of the data (for correcting experimental biases), breakpoint detection and status assignment (gain, loss or normal); validation or deletion of the analysis based on a summary report and quality criteria; visualization and biological analysis of the genomic profiles and results through a user-friendly interface. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Liva S."
                    },
                    {
                        "name": "Hupe P."
                    },
                    {
                        "name": "Neuvial P."
                    },
                    {
                        "name": "Brito I."
                    },
                    {
                        "name": "Viara E."
                    },
                    {
                        "name": "La Rosa P."
                    },
                    {
                        "name": "Barillot E."
                    }
                ],
                "citationCount": 26,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CAPweb: A bioinformatics CGH array analysis platform"
            },
            "pmid": "16845053"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}