{
    "additionDate": "2020-01-09T17:33:03Z",
    "biotoolsCURIE": "biotools:dendPoint",
    "biotoolsID": "dendPoint",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "l.kaminskas@uq.edu.au",
            "name": "Lisa M. Kaminskas",
            "typeEntity": "Person"
        },
        {
            "email": "david.ascher@unimelb.edu.au",
            "name": "David B. Ascher",
            "orcidid": "https://orcid.org/0000-0003-2948-2413",
            "typeEntity": "Person"
        }
    ],
    "description": "a web resource for dendrimer pharmacokinetics investigation and prediction.\n\ndendPoint - Dendrimer Pharmacokinetics Prediction.\n\nAbstract: The development of nanomedicines currently suffers from a lack of efficient tools to predict pharmacokinetic behaviour without relying upon testing in large numbers of animals, impacting success rates and development costs. The aim of this work was therefore to present dendPoint, the first in silico model to predict the intravenous pharmacokinetic profiles of a commonly explored drug vector, based on dendrimer physicochemical properties",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://biosig.unimelb.edu.au/dendpoint",
    "lastUpdate": "2020-01-09T17:33:03Z",
    "name": "dendPoint",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-51789-3",
            "metadata": {
                "abstract": "© 2019, The Author(s).Nanomedicine development currently suffers from a lack of efficient tools to predict pharmacokinetic behavior without relying upon testing in large numbers of animals, impacting success rates and development costs. This work presents dendPoint, the first in silico model to predict the intravenous pharmacokinetics of dendrimers, a commonly explored drug vector, based on physicochemical properties. We have manually curated the largest relational database of dendrimer pharmacokinetic parameters and their structural/physicochemical properties. This was used to develop a machine learning-based model capable of accurately predicting pharmacokinetic parameters, including half-life, clearance, volume of distribution and dose recovered in the liver and urine. dendPoint successfully predicts dendrimer pharmacokinetic properties, achieving correlations of up to r = 0.83 and Q2 up to 0.68. dendPoint is freely available as a user-friendly web-service and database at http://biosig.unimelb.edu.au/dendpoint. This platform is ultimately expected to be used to guide dendrimer construct design and refinement prior to embarking on more time consuming and expensive in vivo testing.",
                "authors": [
                    {
                        "name": "Kaminskas L.M."
                    },
                    {
                        "name": "Pires D.E.V."
                    },
                    {
                        "name": "Ascher D.B."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "dendPoint: a web resource for dendrimer pharmacokinetics investigation and prediction"
            },
            "pmcid": "PMC6820739",
            "pmid": "31664080"
        }
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Laboratory animal science",
            "uri": "http://edamontology.org/topic_3386"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}