{
    "additionDate": "2021-01-18T12:36:18Z",
    "biotoolsCURIE": "biotools:rxgenes",
    "biotoolsID": "rxgenes",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dbick@hudsonalpha.org",
            "name": "David Bick",
            "typeEntity": "Person"
        }
    ],
    "description": "An online compendium of treatable genetic disorders.\n\nTreatments for genetic disorders – A compendium of treatments for genetic conditions.\n\nTreatments for genetic disorders.\n\nA compendium of treatments for genetic conditions.\n\nSearch for treatments for genetic disorders.\n\n\nThe rx-genes.com site does not provide medical advice. It is intended for informational purposes only. It should not be used in place of professional medical advice, diagnosis or treatment. There is no substitute for the astute physician.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                }
            ]
        }
    ],
    "homepage": "https://www.rx-genes.com/",
    "lastUpdate": "2021-02-10T13:24:58Z",
    "name": "Rx-genes",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/AJMG.C.31874",
            "metadata": {
                "abstract": "© 2021 The Authors. American Journal of Medical Genetics Part C: Seminars in Medical Genetics published by Wiley Periodicals LLC.More than 4,000 genes have been associated with recognizable Mendelian/monogenic diseases. When faced with a new diagnosis of a rare genetic disorder, health care providers increasingly turn to internet resources for information to understand the disease and direct care. Unfortunately, it can be challenging to find information concerning treatment for rare diseases as key details are scattered across a number of authoritative websites and numerous journal articles. The website and associated mobile device application described in this article begin to address this challenge by providing a convenient, readily available starting point to find treatment information. The site, Rx-genes.com (https://www.rx-genes.com/), is focused on those conditions where the treatment is directed against the mechanism of the disease and thereby alters the natural history of the disease. The website currently contains 633 disease entries that include references to disease information and treatment guidance, a brief summary of treatments, the inheritance pattern, a disease frequency (if known), nonmolecular confirmatory testing (if available), and a link to experimental treatments. Existing entries are continuously updated, and new entries are added as novel treatments appear in the literature.",
                "authors": [
                    {
                        "name": "Bick D."
                    },
                    {
                        "name": "Bick S.L."
                    },
                    {
                        "name": "Dimmock D.P."
                    },
                    {
                        "name": "Fowler T.A."
                    },
                    {
                        "name": "Caulfield M.J."
                    },
                    {
                        "name": "Scott R.H."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "American Journal of Medical Genetics, Part C: Seminars in Medical Genetics",
                "title": "An online compendium of treatable genetic disorders"
            },
            "pmid": "33350578"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Veterinary medicine",
            "uri": "http://edamontology.org/topic_3397"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}