{
    "additionDate": "2020-01-09T18:07:32Z",
    "biotoolsCURIE": "biotools:MetaMiner",
    "biotoolsID": "MetaMiner",
    "confidence_flag": "tool",
    "description": "A Scalable Peptidogenomics Approach for Discovery of Ribosomal Peptide Natural Products with Blind Modifications from Microbial Communities.\n\nRibosomally synthesized and post-translationally modified peptides (RiPPs) are an important class of natural products that contain antibiotics and a variety of other bioactive compounds. The existing methods for discovery of RiPPs by combining genome mining and computational mass spectrometry are limited to discovering specific classes of RiPPs from small datasets, and these methods fail to handle unknown post-translational modifications. Here, we present MetaMiner, a software tool for addressing these challenges that is compatible with large-scale screening platforms for natural product discovery.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mohimanilab/MetaMiner",
    "lastUpdate": "2024-11-24T20:52:34.604958Z",
    "name": "MetaMiner",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.cels.2019.09.004",
            "metadata": {
                "abstract": "We have developed an efficient method for discovering ribosomally synthesized and post-translationally modified peptides with unknown post-translational modifications from microbial communities through the database search of mass spectra against peptides predicted by genome or metagenome mining. Searching eight datasets collected from various environments—including human microbiome, marine cyanobacteria, and International Space Station—resulted in the discovery of seven unknown RiPPs. Ribosomally synthesized and post-translationally modified peptides (RiPPs) are an important class of natural products that contain antibiotics and a variety of other bioactive compounds. The existing methods for discovery of RiPPs by combining genome mining and computational mass spectrometry are limited to discovering specific classes of RiPPs from small datasets, and these methods fail to handle unknown post-translational modifications. Here, we present MetaMiner, a software tool for addressing these challenges that is compatible with large-scale screening platforms for natural product discovery. After searching millions of spectra in the Global Natural Products Social (GNPS) molecular networking infrastructure against just eight genomic and metagenomic datasets, MetaMiner discovered 31 known and seven unknown RiPPs from diverse microbial communities, including human microbiome and lichen microbiome, and microorganisms isolated from the International Space Station.",
                "authors": [
                    {
                        "name": "Alexander K.L."
                    },
                    {
                        "name": "Benitez R.A.S."
                    },
                    {
                        "name": "Bouslimani A."
                    },
                    {
                        "name": "Cao L."
                    },
                    {
                        "name": "Dorrestein P.C."
                    },
                    {
                        "name": "Friedberg I."
                    },
                    {
                        "name": "Gerwick L."
                    },
                    {
                        "name": "Gerwick W.H."
                    },
                    {
                        "name": "Glukhov E."
                    },
                    {
                        "name": "Gurevich A."
                    },
                    {
                        "name": "Hamid M.-N."
                    },
                    {
                        "name": "Knight R."
                    },
                    {
                        "name": "Korobeynikov A."
                    },
                    {
                        "name": "Leao T."
                    },
                    {
                        "name": "Luzzatto-Knaan T."
                    },
                    {
                        "name": "Mikheenko A."
                    },
                    {
                        "name": "Mohimani H."
                    },
                    {
                        "name": "Morton J.T."
                    },
                    {
                        "name": "Naman C.B."
                    },
                    {
                        "name": "Nothias L.F."
                    },
                    {
                        "name": "Pevzner P.A."
                    },
                    {
                        "name": "Quinn R."
                    },
                    {
                        "name": "Sanders J.G."
                    },
                    {
                        "name": "Shlemov A."
                    },
                    {
                        "name": "Singh N.K."
                    },
                    {
                        "name": "Thompson L.R."
                    },
                    {
                        "name": "Vargas F."
                    },
                    {
                        "name": "Venkateswaran K."
                    }
                ],
                "citationCount": 46,
                "date": "2019-12-18T00:00:00Z",
                "journal": "Cell Systems",
                "title": "MetaMiner: A Scalable Peptidogenomics Approach for Discovery of Ribosomal Peptide Natural Products with Blind Modifications from Microbial Communities"
            },
            "pmcid": "PMC6952069",
            "pmid": "31629686"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
