{
    "additionDate": "2021-01-18T07:09:30Z",
    "biotoolsCURIE": "biotools:crop-correlation",
    "biotoolsID": "crop-correlation",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tomasadam@gmail.com",
            "name": "Tomáš Adam",
            "typeEntity": "Person"
        }
    ],
    "description": "CROP (Correlation-based Removal Of multiPlicities) is a visual post-processing tool that removes redundant features from untargeted metabolomic data sets. It is based on a grouping of highly correlated features within a defined retention time window avoiding the condition of specific m/z difference making it a second-tier strategy for multiplicities reduction. Graphical representation of correlation network for better understanding of the clusters composition and parameter tuning is provided.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.github.com/rendju/CROP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-18T16:02:13Z",
    "license": "GPL-3.0",
    "name": "CROP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA012",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Untargeted liquid chromatography-high-resolution mass spectrometry analysis produces a large number of features which correspond to the potential compounds in the sample that is analyzed. During the data processing, it is necessary to merge features associated with one compound to prevent multiplicities in the data and possible misidentification. The processing tools that are currently employed use complex algorithms to detect abundances, such as adducts or isotopes. However, most of them are not able to deal with unpredictable adducts and in-source fragments. We introduce a simple open-source R-script CROP based on Pearson pairwise correlations and retention time together with a graphical representation of the correlation network to remove these redundant features.",
                "authors": [
                    {
                        "name": "Kouril S."
                    },
                    {
                        "name": "Kouril S."
                    },
                    {
                        "name": "De Sousa J."
                    },
                    {
                        "name": "De Sousa J."
                    },
                    {
                        "name": "Vaclavik J."
                    },
                    {
                        "name": "Friedecky D."
                    },
                    {
                        "name": "Friedecky D."
                    },
                    {
                        "name": "Adam T."
                    },
                    {
                        "name": "Adam T."
                    }
                ],
                "citationCount": 4,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CROP: Correlation-based reduction of feature multiplicities in untargeted metabolomic data"
            },
            "pmid": "31930393"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}