{"credit":[{"email":"xiaqy@swu.edu.cn","name":"xiaqy@swu.edu.cn","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.silkdb.org/silkdb/doc/help.html"}],"function":[{"operation":[{"term":"Sequence tag mapping","uri":"http://edamontology.org/operation_0527"},{"term":"Genome assembly","uri":"http://edamontology.org/operation_0525"},{"term":"Sequence tagged site (STS) mapping","uri":"http://edamontology.org/operation_2871"},{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"publication":[{"abstract":"The SilkDB is an open-access database for genome biology of the silkworm (Bombyx mori). Since the draft sequence was completed and the SilkDB was first released 5 years ago, we have collaborated with other groups to make much remarkable progress on silkworm genome research, such as the completion of a new high-quality assembly of the silkworm genome sequence as well as the construction of a genome-wide microarray to survey gene expression profiles. To accommodate these new genomic data and house more comprehensive genomic information, we have reconstructed SilkDB database with new web interfaces. In the new version (v2.0) of SilkDB, we updated the genomic data, including genome assembly, gene annotation, chromosomal mapping, orthologous relationship and experiment data, such as microarray expression data, Expressed Sequence Tags (ESTs) and corresponding references. Several new tools, including SilkMap, Silkworm Chromosome Browser (SCB) and BmArray, are developed to access silkworm genomic data conveniently. SilkDB is publicly available at the new URL of http://www.silkdb.org. © The Author(s) 2009. Published by Oxford University Press.","authors":["Duan J.","Li R.","Cheng D.","Fan W.","Zha X.","Cheng T.","Wu Y.","Wang J.","Mita K.","Xiang Z.","Xia Q."],"cit_count":185,"journal":"Nucleic Acids Research","pmid":"19793867","title":"SilkDB v2.0: A platform for silkworm (Bombyx mori) genome biology","year":"2009-09-30"}],"summary":{"biotoolsCURIE":"biotools:silkdb","biotoolsID":"silkdb","description":"The SilkDB is an open-access database for genome biology of the silkworm (Bombyx mori). SilkDB contains the genomic data, including genome assembly, gene annotation, chromosomal mapping, orthologous relationship and experiment data, such as microarray expression data, Expressed Sequence Tags (ESTs) and corresponding references. Several new tools, including SilkMap, Silkworm Chromosome Browser (SCB) and BmArray, are developed to access silkworm genomic data conveniently.","homepage":"http://silkworm.genomics.org.cn/","name":"SilkDB"}}