{"credit":[{"email":"s.hammer@univie.ac.at","name":"Stefan Hammer","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"ivo@tbi.univie.ac.at","name":"Ivo L. Hofacker","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"sven@tbi.univie.ac.at","name":"Sven Findeiß","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/ViennaRNA/RNAblueprint"}],"function":[{"operation":[{"term":"Nucleic acid design","uri":"http://edamontology.org/operation_3095"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"publication":[{"abstract":"© 2017 The Author. Motivation: Realizing the value of synthetic biology in biotechnology and medicine requires the design of molecules with specialized functions. Due to its close structure to function relationship, and the availability of good structure prediction methods and energy models, RNA is perfectly suited to be synthetically engineered with predefined properties. However, currently available RNA design tools cannot be easily adapted to accommodate new design specifications. Furthermore, complicated sampling and optimization methods are often developed to suit a specific RNA design goal, adding to their inflexibility. Results: We developed a C library implementing a graph coloring approach to stochastically sample sequences compatible with structural and sequence constraints from the typically very large solution space. The approach allows to specify and explore the solution space in a well defined way. Our library also guarantees uniform sampling, which makes optimization runs performant by not only avoiding re-evaluation of already found solutions, but also by raising the probability of finding better solutions for long optimization runs. We show that our software can be combined with any other software package to allow diverse RNA design applications. Scripting interfaces allow the easy adaption of existing code to accommodate new scenarios, making the whole design process very flexible. We implemented example design approaches written in Python to demonstrate these advantages. Availability and implementation: RNAblueprint, Python implementations and benchmark datasets are available at github: https://github.com/ViennaRNA.","authors":["Hammer S.","Tschiatschek B.","Flamm C.","Hofacker I.L.","Findeiss S."],"cit_count":4,"doi":"10.1093/bioinformatics/btx263","journal":"Bioinformatics","title":"RNAblueprint: Flexible multiple target nucleic acid sequence design","year":"2017-01-01"}],"summary":{"biotoolsCURIE":"biotools:rnablueprint","biotoolsID":"rnablueprint","description":"Flexible multiple target nucleic acid sequence design.","homepage":"https://github.com/ViennaRNA/RNAblueprint","name":"RNAblueprint"}}