{
    "additionDate": "2015-01-21T13:29:24Z",
    "biotoolsCURIE": "biotools:secretomep",
    "biotoolsID": "secretomep",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "nblom@kt.dtu.dk",
            "name": "Nikolaj Sorgenfrei Blom",
            "orcidid": "http://orcid.org/0000-0001-7787-7853",
            "typeEntity": "Person"
        },
        {
            "email": "hnielsen@cbs.dtu.dk",
            "name": "Henrik Nielsen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "CBS",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Predictions of non-classical (i.e. not signal peptide triggered) protein secretion.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.cbs.dtu.dk/services/SecretomeP/instructions.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "predicts of non-classical protein secretion",
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://cbs.dtu.dk/services/SecretomeP/",
    "lastUpdate": "2018-12-16T13:24:34Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://cbs.dtu.dk/services"
        }
    ],
    "maturity": "Emerging",
    "name": "SecretomeP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "CBS",
    "publication": [
        {
            "doi": "10.1093/protein/gzh037",
            "metadata": {
                "abstract": "We present a sequence-based method, SecretomeP, for the prediction of mammalian secretory proteins targeted to the non-classical secretory pathway, i.e. proteins without an N-terminal signal peptide. So far only a limited number of proteins have been shown experimentally to enter the non-classical secretory pathway. These are mainly fibroblast growth factors, interleukins and galectins found in the extracellular matrix. We have discovered that certain pathway-independent features are shared among secreted proteins. The method presented here is also capable of predicting (signal peptide-containing) secretory proteins where only the mature part of the protein has been annotated or cases where the signal peptide remains uncleaved. By scanning the entire human proteome we identified new proteins potentially undergoing non-classical secretion. Predictions can be made at http://www.cbs.dtu.dk/services/SecretomeP.",
                "authors": [
                    {
                        "name": "Bendtsen J.D."
                    },
                    {
                        "name": "Blom N."
                    },
                    {
                        "name": "Brunak S."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Von Heijne G."
                    }
                ],
                "citationCount": 863,
                "date": "2004-04-01T00:00:00Z",
                "journal": "Protein Engineering, Design and Selection",
                "title": "Feature-based prediction of non-classical and leaderless protein secretion"
            },
            "pmid": "15115854",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Background: We present an overview of bacterial non-classical secretion and a prediction method for identification of proteins following signal peptide independent secretion pathways. We have compiled a list of proteins found extracellularly despite the absence of a signal peptide. Some of these proteins also have known roles in the cytoplasm, which means they could be so-called \"moon-lightning\" proteins having more than one function. Results: A thorough literature search was conducted to compile a list of currently known bacterial non-classically secreted proteins. Pattern finding methods were applied to the sequences in order to identify putative signal sequences or motifs responsible for their secretion. We have found no signal or motif characteristic to any majority of the proteins in the compiled list of non-classically secreted proteins, and conclude that these proteins, indeed, seem to be secreted in a novel fashion. However, we also show that the apparently non-classically secreted proteins are still distinguished from cellular proteins by properties such as amino acid composition, secondary structure and disordered regions. Specifically, prediction of disorder reveals that bacterial secretory proteins are more structurally disordered than their cytoplasmic counterparts. Finally, artificial neural networks were used to construct protein feature based methods for identification of non-classically secreted proteins in both Gram-positive and Gram-negative bacteria. Conclusion: We present a publicly available prediction method capable of discriminating between this group of proteins and other proteins, thus allowing for the identification of novel non-classically secreted proteins. We suggest candidates for non-classically secreted proteins in Escherichia coli and Bacillus subtilis. The prediction method is available online. © 2005 Bendtsen et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bendtsen J.D."
                    },
                    {
                        "name": "Brunak S."
                    },
                    {
                        "name": "Fausboll A."
                    },
                    {
                        "name": "Kiemer L."
                    }
                ],
                "citationCount": 454,
                "date": "2005-10-07T00:00:00Z",
                "journal": "BMC Microbiology",
                "title": "Non-classical protein secretion in bacteria"
            },
            "pmid": "16212653",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
