{
    "additionDate": "2017-01-13T13:15:19Z",
    "biotoolsCURIE": "biotools:mayday",
    "biotoolsID": "mayday",
    "credit": [
        {
            "email": "kay.nieselt@uni-tuebingen.de",
            "name": "Kay Nieselt",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Extensible platform for visual data exploration and interactive analysis and provides many methods for dissecting complex transcriptome datasets.",
    "documentation": [
        {
            "type": "General",
            "url": "http://it.informatik.uni-tuebingen.de/software/mayday_tmp/docs/Tutorial_Mayday_v2.14.pdf"
        },
        {
            "type": "General",
            "url": "http://it.informatik.uni-tuebingen.de/software/mayday_tmp/docs/MaydayDoc.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www-ps.informatik.uni-tuebingen.de/mayday/wp/?p=134",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "name": "MAYDAY",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Visualization is pivotal for gaining insight in systems biology data. As the size and complexity of datasets and supplemental information increases, an efficient, integrated framework for general and specialized views is necessary. MAYDAY is an application for analysis and visualization of general 'omics' data. It follows a trifold approach for data visualization, consisting of flexible data preprocessing, highly customizable data perspective plots for general purpose visualization and systems based plots. Here, we introduce two new systems biology visualization tools for MAYDAY. Efficiently implemented genomic viewers allow the display of variables associated with genomic locations. Multiple variables can be viewed using our new track-based ChromeTracks tool. A functional perspective is provided by visualizing metabolic pathways either in KEGG or BioPax format. Multiple options of displaying pathway components are available, including Systems Biology Graphical Notation (SBGN) glyphs. Furthermore, pathways can be viewed together with gene expression data either as heatmaps or profiles. We apply our tools to two 'omics' datasets of Pseudomonas aeruginosa. The general analysis and visualization tools of MAYDAY as well as our ChromeTracks viewer are applied to a transcriptome dataset. We furthermore integrate this dataset with a metabolome dataset and compare the activity of amino acid degradation pathways between these two datasets, by visually enhancing the pathway diagrams produced by MAYDAY.",
                "authors": [
                    {
                        "name": "Symons S."
                    },
                    {
                        "name": "Zipplies C."
                    },
                    {
                        "name": "Battke F."
                    },
                    {
                        "name": "Nieselt K."
                    }
                ],
                "citationCount": 7,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Journal of integrative bioinformatics",
                "title": "Integrative systems biology visualization with MAYDAY."
            },
            "pmid": "20375461"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}