{
    "additionDate": "2021-10-10T16:02:28.928257Z",
    "biotoolsCURIE": "biotools:mmrfbiolinks",
    "biotoolsID": "mmrfbiolinks",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cannataro@unicz.it",
            "name": "Mario Cannataro",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MMRFBiolinks isn R package that extends TCGABiolink package for integrative analysis with MMRF-COMMPASS data. IMMRFBiolinks extends TCGABiolink package for searching, downloading and analyzing MMRF-COMMPASS data available at the NCI’s Genomic Data Commons (GDC) Data Portal.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                }
            ]
        }
    ],
    "homepage": "https://github.com/marziasettino/MMRFBiolinks",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-10-10T16:02:28.930739Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/marziasettino/MMRFBiolinks/issues"
        }
    ],
    "name": "MMRFBiolinks",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB050",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.In order to understand the mechanisms underlying the onset and the drug responses in multiple myeloma (MM), the second most frequent hematological cancer, the use of appropriate bioinformatic tools for integrative analysis of publicly available genomic data is required. We present MMRFBiolinks, a new R package for integrating and analyzing datasets from the Multiple Myeloma Research Foundation (MMRF) CoMMpass (Clinical Outcomes in MM to Personal Assessment of Genetic Profile) study, available at MMRF Researcher Gateway (MMRF-RG), and from the National Cancer Institute Genomic Data Commons (NCI-GDC) Data Portal. The package provides several methods for integrative analysis (array-array intensity correlation, Kaplan-Meier survival analysis) and visualization (response to treatments plot) of MMRF data, for performing an easily comprehensible analysis workflow. MMRFBiolinks extends the TCGABiolinks package by providing 13 new functions to analyze MMRF-CoMMpass data: six dealing with MMRF-RG data and seven with NCI-GDC data. As validation of the tool, we present two cases studies for searching, downloading and analyzing MMRF data. The former presents a workflow for identifying genes involved in survival depending on treatment. The latter presents an analysis workflow for analyzing the Best Overall (BO) response through correlation plots between the BO Response with respect to treatments, time, duration of treatment and annotated variants, as well as through Kaplan-Meier survival curves. The case studies demonstrate how MMRFBiolinks is able of overcoming the limitations of the analysis tools available at NCI-GDC and MMRF-RG, facilitating and making more comprehensive the retrieval, downloading and analysis of MMRF data.",
                "authors": [
                    {
                        "name": "Settino M."
                    },
                    {
                        "name": "Cannataro M."
                    }
                ],
                "date": "2021-09-02T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "MMRFBiolinks: an R-package for integrating and analyzing MMRF-CoMMpass data"
            },
            "pmid": "33821961",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}