{
    "additionDate": "2017-12-18T00:10:55Z",
    "biotoolsCURIE": "biotools:philius",
    "biotoolsID": "philius",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://noble.gs.washington.edu/"
        }
    ],
    "description": "Philius predicts protein transmembrane topology and signal peptides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://noble.gs.washington.edu/proj/philius/README"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://noble.gs.washington.edu/proj/philius/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-13T11:43:50.072418Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/philius-predict-protein-transmembrane-topology-signal-peptides.html"
        }
    ],
    "name": "Philius",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID: SCR_004625"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1000213",
            "metadata": {
                "abstract": "Hidden Markov models (HMMs) have been successfully applied to the tasks of transmembrane protein topology prediction and signal peptide prediction. In this paper we expand upon this work by making use of the more powerful class of dynamic Bayesian networks (DBNs). Our model, Philius, is inspired by a previously published HMM, Phobius, and combines a signal peptide submodel with a transmembrane submodel. We introduce a two-stage DBN decoder that combines the power of posterior decoding with the grammar constraints of Viterbi-style decoding. Philius also provides protein type, segment, and topology confidence metrics to aid in the interpretation of the predictions. We report a relative improvement of 13% over Phobius in full-topology prediction accuracy on transmembrane proteins, and a sensitivity and specificity of 0.96 in detecting signal peptides. We also show that our confidence metrics correlate well with the observed precision. In addition, we have made predictions on all 6.3 million proteins in the Yeast Resource Center (YRC) database. This large-scale study provides an overall picture of the relative numbers of proteins that include a signal-peptide and/or one or more transmembrane segments as well as a valuable resource for the scientific community. All DBNs are implemented using the Graphical Models Toolkit. Source code for the models described here is available at http://noble.gs.washington.edu/proj/philius. A Philius Web server is available at http://www.yeastrc.org/philius, and the predictions on the YRC database are available at http://www.yeastrc.org/pdr. © 2008 Reynolds et al.",
                "authors": [
                    {
                        "name": "Reynolds S.M."
                    },
                    {
                        "name": "Kall L."
                    },
                    {
                        "name": "Riffle M.E."
                    },
                    {
                        "name": "Bilmes J.A."
                    },
                    {
                        "name": "Noble W.S."
                    }
                ],
                "citationCount": 153,
                "date": "2008-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Transmembrane topology and signal peptide prediction using dynamic Bayesian networks"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Peptides",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}