{
    "additionDate": "2020-01-14T09:24:52Z",
    "biotoolsCURIE": "biotools:MLW-gcForest",
    "biotoolsID": "MLW-gcForest",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "qiangyan@tyut.edu.cn",
            "name": "Yan Qiang",
            "typeEntity": "Person"
        }
    ],
    "description": "a multi-weighted gcForest model towards the staging of lung adenocarcinoma based on multi-modal genetic data.\n\nBACKGROUND:Lung cancer is one of the most common types of cancer, among which lung adenocarcinoma accounts for the largest proportion. Currently, accurate staging is a prerequisite for effective diagnosis and treatment of lung adenocarcinoma. Previous research has used mainly single-modal data, such as gene expression data, for classification and prediction. Integrating multi-modal genetic data (gene expression RNA-seq, methylation data and copy number variation) from the same patient provides the possibility of using multi-modal genetic data for cancer prediction. A new machine learning method called gcForest has recently been proposed. This method has been proven to be suitable for classification in some fields.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'gcForest'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31726986",
    "lastUpdate": "2020-01-14T09:24:52Z",
    "name": "MLW-gcForest",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3172-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Lung cancer is one of the most common types of cancer, among which lung adenocarcinoma accounts for the largest proportion. Currently, accurate staging is a prerequisite for effective diagnosis and treatment of lung adenocarcinoma. Previous research has used mainly single-modal data, such as gene expression data, for classification and prediction. Integrating multi-modal genetic data (gene expression RNA-seq, methylation data and copy number variation) from the same patient provides the possibility of using multi-modal genetic data for cancer prediction. A new machine learning method called gcForest has recently been proposed. This method has been proven to be suitable for classification in some fields. However, the model may face challenges when applied to small samples and high-dimensional genetic data. Results: In this paper, we propose a multi-weighted gcForest algorithm (MLW-gcForest) to construct a lung adenocarcinoma staging model using multi-modal genetic data. The new algorithm is based on the standard gcForest algorithm. First, different weights are assigned to different random forests according to the classification performance of these forests in the standard gcForest model. Second, because the feature vectors generated under different scanning granularities have a diverse influence on the final classification result, the feature vectors are given weights according to the proposed sorting optimization algorithm. Then, we train three MLW-gcForest models based on three single-modal datasets (gene expression RNA-seq, methylation data, and copy number variation) and then perform decision fusion to stage lung adenocarcinoma. Experimental results suggest that the MLW-gcForest model is superior to the standard gcForest model in constructing a staging model of lung adenocarcinoma and is better than the traditional classification methods. The accuracy, precision, recall, and AUC reached 0.908, 0.896, 0.882, and 0.96, respectively. Conclusions: The MLW-gcForest model has great potential in lung adenocarcinoma staging, which is helpful for the diagnosis and personalized treatment of lung adenocarcinoma. The results suggest that the MLW-gcForest algorithm is effective on multi-modal genetic data, which consist of small samples and are high dimensional.",
                "authors": [
                    {
                        "name": "Dong Y."
                    },
                    {
                        "name": "Yang W."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Qiang Y."
                    },
                    {
                        "name": "Zhao Z."
                    },
                    {
                        "name": "Kazihise N.G.F."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Liu S."
                    }
                ],
                "date": "2019-11-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MLW-gcForest: A multi-weighted gcForest model towards the staging of lung adenocarcinoma based on multi-modal genetic data"
            },
            "pmcid": "PMC6857238",
            "pmid": "31726986"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}