{
    "additionDate": "2021-01-18T10:25:12Z",
    "biotoolsCURIE": "biotools:hybridpbrpred",
    "biotoolsID": "hybridpbrpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan",
            "typeEntity": "Person"
        }
    ],
    "description": "Dichotomy of sequence-based methods developed using structured complexes versus disordered proteins.\n\nhybridPBRpred - web server from Biomine lab.\n\nHybridPBRpred combines prediction of protein-binding residues generated by SCRIBER (predictor that was trained using structures of protein-protein complexes) and DisoRDPbind (predictor that was trained using disordered protein-binding residues), with the underlying goal to produce complete set of the protein-binding residues.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "http://biomine.cs.vcu.edu/servers/hybridPBRpred/",
    "lastUpdate": "2021-02-01T08:55:34Z",
    "name": "hybridPBRpred",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA573",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation There are over 30 sequence-based predictors of the protein-binding residues (PBRs). They use either structure-Annotated or disorder-Annotated training datasets, potentially creating a dichotomy where the structure-/ disorder-specific models may not be able to cross-over to accurately predict the other type. Moreover, the structuretrained predictors were shown to substantially cross-predict PBRs among residues that interact with non-protein partners (nucleic acids and small ligands). We address these issues by performing first-of-its-kind comparative study of a representative collection of disorder-and structure-Trained predictors using a comprehensive benchmark set with the structure-and disorder-derived annotations of PBRs (to analyze the cross-over) and the protein-, nucleic acid-and small ligand-binding proteins (to study the cross-predictions). Results: Three predictors provide accurate results: SCRIBER, ANCHOR and disoRDPbind. Some of the structuretrained methods make accurate predictions on the structure-Annotated proteins. Similarly, the disorder-Trained predictors predict well on the disorder-Annotated proteins. However, the considered predictors generally fail to crossover, with the exception of SCRIBER. Our study also reveals that virtually all methods substantially cross-predict PBRs, except for SCRIBER for the structure-Annotated proteins and disoRDPbind for the disorder-Annotated proteins. We formulate a novel hybrid predictor, hybridPBRpred, that combines results produced by disoRDPbind and SCRIBER to accurately predict disorder-and structure-Annotated PBRs. HybridPBRpred generates accurate results that cross-over structure-and disorder-Annotated proteins and produces relatively low amount of cross-predictions, offering an accurate alternative to predict PBRs.",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Ghadermarzi S."
                    },
                    {
                        "name": "Kurgan L."
                    }
                ],
                "citationCount": 3,
                "date": "2020-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Prediction of protein-binding residues: Dichotomy of sequence-based methods developed using structured complexes versus disordered proteins"
            },
            "pmid": "32860044"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}