
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB",
            "C++",
            "Python"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Unsupervised video object segmentation aims to automatically segment moving objects over an unconstrained video without any user annotation. So far, only few unsupervised online methods have been reported in the literature, and their performance is still far from satisfactory because the complementary information from future frames cannot be processed under online setting. To solve this challenging problem, in this paper, we propose a novel unsupervised online video object segmentation (UOVOS) framework by construing the motion property to mean moving in concurrence with a generic object for segmented regions. By incorporating the salient motion detection and the object proposal, a pixel-wise fusion strategy is developed to effectively remove detection noises, such as dynamic background and stationary objects. Furthermore, by leveraging the obtained segmentation from immediately preceding frames, a forward propagation algorithm is employed to deal with unreliable motion detection and object proposals. Experimental results on several benchmark datasets demonstrate the efficacy of the proposed method. Compared to state-of-the-art unsupervised online segmentation algorithms, the proposed method achieves an absolute gain of 6.2%. Moreover, our method achieves better performance than the best unsupervised offline algorithm on the DAVIS-2016 benchmark dataset. Our code is available on the project website: https://www.github.com/visiontao/uovos.",
            "authors": [
                "Zhuo T.",
                "Cheng Z.",
                "Zhang P.",
                "Wong Y.",
                "Kankanhalli M."
            ],
            "cit_count": 0,
            "doi": "10.1109/TIP.2019.2930152",
            "journal": "IEEE transactions on image processing : a publication of the IEEE Signal Processing Society",
            "pmid": "31369377",
            "title": "Unsupervised Online Video Object Segmentation With Motion Property Understanding",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:UOVOS",
        "biotoolsID": "UOVOS",
        "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'unsupervised online video object segmentation', 'DAVIS-2016' | Unsupervised Online Video Object Segmentation With Motion Property Understanding | Tao Zhuo, Zhiyong Cheng, Peng Zhang, Yongkang Wong, and Mohan Kankanhalli | Results on DAVIS-2016 TrainVal Dataset (50 videos)",
        "homepage": "https://www.github.com/visiontao/uovos",
        "name": "UOVOS"
    }
}