{
    "additionDate": "2021-01-18T09:20:00Z",
    "biotoolsCURIE": "biotools:cms",
    "biotoolsID": "cms",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "potschka@pharmtox.vetmed.uni-muenchen.de",
            "name": "Heidrun Potschka",
            "orcidid": "https://orcid.org/0000-0003-1506-0252",
            "typeEntity": "Person"
        }
    ],
    "description": "The cms is an R package that uses tabular data from rat epilepsy studies and applies a composite measures scheme (via PCA) to select the most prominent features. Further, variables can be selected to perform cluster analysis on a subset in order to build a composite score. Finally, the cluster distribution is displayed for the subgroups and allows severity assessment between animal models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mytalbot/cms",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-13T19:14:50Z",
    "name": "CMS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0230141",
            "metadata": {
                "abstract": "© 2020 van Dijk et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Comparative severity assessment of animal models and experimental interventions is of utmost relevance for harm-benefit analysis during ethical evaluation, an animal welfare-based model prioritization as well as the validation of refinement measures. Unfortunately, there is a lack of evidence-based approaches to grade an animal’s burden in a sensitive, robust, precise, and objective manner. Particular challenges need to be considered in the context of animal-based neuroscientific research because models of neurological disorders can be characterized by relevant changes in the affective state of an animal. Here, we report about an approach for parameter selection and development of a composite measure scheme designed for precise analysis of the distress of animals in a specific model category. Data sets from the analysis of several behavioral and biochemical parameters in three different epilepsy models were subjected to a principal component analysis to select the most informative parameters. The top-ranking parameters included burrowing, open field locomotion, social interaction, and saccharin preference. These were combined to create a composite measure scheme (CMS). CMS data were subjected to cluster analysis enabling the allocation of severity levels to individual animals. The results provided information for a direct comparison between models indicating a comparable severity of the electrical and chemical post-status epilepticus models, and a lower severity of the kindling model. The new CMS can be directly applied for comparison of other rat models with seizure activity or for assessment of novel refinement approaches in the respective research field. The respective online tool for direct application of the CMS or for creating a new CMS based on other parameters from different models is available at https://github.com/mytalbot/cms. However, the robustness and generalizability needs to be further assessed in future studies. More importantly, our concept of parameter selection can serve as a practice example providing the basis for comparable approaches applicable to the development and validation of CMS for all kinds of disease models or interventions.",
                "authors": [
                    {
                        "name": "van Dijk R.M."
                    },
                    {
                        "name": "Koska I."
                    },
                    {
                        "name": "Bleich A."
                    },
                    {
                        "name": "Tolba R."
                    },
                    {
                        "name": "Seiffert I."
                    },
                    {
                        "name": "Moller C."
                    },
                    {
                        "name": "Di Liberto V."
                    },
                    {
                        "name": "Talbot S.R."
                    },
                    {
                        "name": "Potschka H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Design of composite measure schemes for comparative severity assessment in animal-based neuroscience research: A case study focussed on rat epilepsy models"
            },
            "pmcid": "PMC7228039",
            "pmid": "32413036"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}