{
    "additionDate": "2019-11-14T18:28:21Z",
    "biotoolsCURIE": "biotools:MCACO-ES",
    "biotoolsID": "MCACO-ES",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "eofili@msm.edu",
            "name": "Elizabeth O. Ofili",
            "orcidid": "https://orcid.org/0000-0003-4663-1767",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'M-ACO', 'MSSP', 'Morehouse Choice Accountable Care Organization Education System', 'Medicare beneficiaries' | Morehouse Choice Accountable Care Organization and Education System (MCACO-ES) | Accountable Care Organizations (ACOs) seek sustainable innovation through the testing of new care delivery methods that promote shared goals among value-based health care collaborators. The Morehouse Choice Accountable Care Organization and Education System (MCACO-ES), or (M-ACO) is a physician led integrated delivery model participating in the Medicare Shared Savings Program (MSSP) offered through the Centers for Medicare and Medicaid Services (CMS) Innovation Center",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31450652",
    "lastUpdate": "2019-11-14T18:28:21Z",
    "name": "MCACO-ES",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/IJERPH16173084",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Accountable Care Organizations (ACOs) seek sustainable innovation through the testing of new care delivery methods that promote shared goals among value-based health care collaborators. The Morehouse Choice Accountable Care Organization and Education System (MCACO-ES), or (M-ACO) is a physician led integrated delivery model participating in the Medicare Shared Savings Program (MSSP) offered through the Centers for Medicare and Medicaid Services (CMS) Innovation Center. The MSSP establishes incentivized, performance-based payment models for qualifying health care organizations serving traditional Medicare beneficiaries that promote collaborative efficiency models designed to mitigate fragmented and insufficient access to health care, reduce unnecessary cost, and improve clinical outcomes. The M-ACO integration model is administered through participant organizations that include a multi-site community based academic practice, independent physician practices, and federally qualified health center systems (FQHCs). This manuscript aims to present a descriptive and exploratory assessment of health care programs and related innovation methods that validate M-ACO as a reliable simulator to implement, evaluate, and refine M-ACO’s integration model to render value-based performance outcomes over time. A part of the research approach also includes early outcomes and lessons learned advancing the framework for ongoing testing of M-ACO’s integration model across independently owned, rural, and urban health care locations that predominantly serve low-income, traditional Medicare beneficiaries, (including those who also qualify for Medicaid benefits (also referred to as “dual eligibles”). M-ACO seeks to determine how integration potentially impacts targeted performance results. As a simulator to test value-based innovation and related clinical and business practices, M-ACO uses enterprise-level data and advanced analytics to measure certain areas, including: 1) health program insight and effectiveness; 2) optimal implementation process and workflows that align primary care with specialists to expand access to care; 3) chronic care management/coordination deployment as an effective extender service to physicians and patients risk stratified based on defined clinical and social determinant criteria; 4) adoption of technology tools for patient outreach and engagement, including a mobile application for remote biometric monitoring and telemedicine; and 5) use of structured communication platforms that enable practitioner engagement and ongoing training regarding the shift from volume to value-based care delivery.",
                "authors": [
                    {
                        "name": "Brown M."
                    },
                    {
                        "name": "Ofili E.O."
                    },
                    {
                        "name": "Okirie D."
                    },
                    {
                        "name": "Pemu P."
                    },
                    {
                        "name": "Franklin C."
                    },
                    {
                        "name": "Suk Y."
                    },
                    {
                        "name": "Quarshie A."
                    },
                    {
                        "name": "Mubasher M."
                    },
                    {
                        "name": "Sow C."
                    },
                    {
                        "name": "Rice V.M."
                    },
                    {
                        "name": "Williams D."
                    },
                    {
                        "name": "Brooks M."
                    },
                    {
                        "name": "Alema-Mensah E."
                    },
                    {
                        "name": "Mack D."
                    },
                    {
                        "name": "Dawes D."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "International Journal of Environmental Research and Public Health",
                "title": "Morehouse choice accountable care organization and education system (MCACO-ES): Integrated model delivering equitable quality care"
            },
            "pmcid": "PMC6747305",
            "pmid": "31450652"
        }
    ],
    "topic": [
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Critical care medicine",
            "uri": "http://edamontology.org/topic_3403"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        }
    ]
}