{
    "additionDate": "2020-01-09T18:36:22Z",
    "biotoolsCURIE": "biotools:predictor",
    "biotoolsID": "predictor",
    "confidence_flag": "tool",
    "description": "Novel Consensus Architecture To Improve Performance of Large-Scale Multitask Deep Learning QSAR Models.\n\nAdvances in the development of high-throughput screening and automated chemistry have rapidly accelerated the production of chemical and biological data, much of them freely accessible through literature aggregator services such as ChEMBL and PubChem. Here, we explore how to use this comprehensive mapping of chemical biology space to support the development of large-scale quantitative structure-activity relationship (QSAR) models. We propose a new deep learning consensus architecture (DLCA) that combines consensus and multitask deep learning approaches together to generate large-scale QSAR models.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://predictor.ncats.io",
    "lastUpdate": "2020-12-06T10:06:53Z",
    "name": "predictor",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00526",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Advances in the development of high-throughput screening and automated chemistry have rapidly accelerated the production of chemical and biological data, much of them freely accessible through literature aggregator services such as ChEMBL and PubChem. Here, we explore how to use this comprehensive mapping of chemical biology space to support the development of large-scale quantitative structure-activity relationship (QSAR) models. We propose a new deep learning consensus architecture (DLCA) that combines consensus and multitask deep learning approaches together to generate large-scale QSAR models. This method improves knowledge transfer across different target/assays while also integrating contributions from models based on different descriptors. The proposed approach was validated and compared with proteochemometrics, multitask deep learning, and Random Forest methods paired with various descriptors types. DLCA models demonstrated improved prediction accuracy for both regression and classification tasks. The best models together with their modeling sets are provided through publicly available web services at https://predictor.ncats.io.",
                "authors": [
                    {
                        "name": "Huang R."
                    },
                    {
                        "name": "Nguyen D.-T."
                    },
                    {
                        "name": "Peryea T."
                    },
                    {
                        "name": "Sheils T."
                    },
                    {
                        "name": "Simeonov A."
                    },
                    {
                        "name": "Southall N."
                    },
                    {
                        "name": "Yasgar A."
                    },
                    {
                        "name": "Zakharov A.V."
                    },
                    {
                        "name": "Zhao T."
                    }
                ],
                "citationCount": 12,
                "date": "2019-11-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Novel Consensus Architecture to Improve Performance of Large-Scale Multitask Deep Learning QSAR Models"
            },
            "pmid": "31584270"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
