{
    "additionDate": "2017-01-17T15:01:21Z",
    "biotoolsCURIE": "biotools:dapar",
    "biotoolsID": "dapar",
    "collectionID": [
        "BioConductor",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "samuel.wieczorek@cea.fr",
            "name": "Samuel Wieczorek",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package contains a collection of functions for the visualisation and the statistical analysis of proteomic data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/DAPAR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/DAPAR_1.6.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/DAPAR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-07-20T17:38:24Z",
    "license": "Artistic-2.0",
    "name": "DAPAR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1111/gcb.13590",
            "metadata": {
                "abstract": "© 2016 John Wiley & Sons LtdAccurate estimation of terrestrial gross primary productivity (GPP) remains a challenge despite its importance in the global carbon cycle. Chlorophyll fluorescence (ChlF) has been recently adopted to understand photosynthesis and its response to the environment, particularly with remote sensing data. However, it remains unclear how ChlF and photosynthesis are linked at different spatial scales across the growing season. We examined seasonal relationships between ChlF and photosynthesis at the leaf, canopy, and ecosystem scales and explored how leaf-level ChlF was linked with canopy-scale solar-induced chlorophyll fluorescence (SIF) in a temperate deciduous forest at Harvard Forest, Massachusetts, USA. Our results show that ChlF captured the seasonal variations of photosynthesis with significant linear relationships between ChlF and photosynthesis across the growing season over different spatial scales (R2= 0.73, 0.77, and 0.86 at leaf, canopy, and satellite scales, respectively; P < 0.0001). We developed a model to estimate GPP from the tower-based measurement of SIF and leaf-level ChlF parameters. The estimation of GPP from this model agreed well with flux tower observations of GPP (R2= 0.68; P < 0.0001), demonstrating the potential of SIF for modeling GPP. At the leaf scale, we found that leaf Fq’/Fm’, the fraction of absorbed photons that are used for photochemistry for a light-adapted measurement from a pulse amplitude modulation fluorometer, was the best leaf fluorescence parameter to correlate with canopy SIF yield (SIF/APAR, R2= 0.79; P < 0.0001). We also found that canopy SIF and SIF-derived GPP (GPPSIF) were strongly correlated to leaf-level biochemistry and canopy structure, including chlorophyll content (R2= 0.65 for canopy GPPSIF and chlorophyll content; P < 0.0001), leaf area index (LAI) (R2= 0.35 for canopy GPPSIF and LAI; P < 0.0001), and normalized difference vegetation index (NDVI) (R2= 0.36 for canopy GPPSIF and NDVI; P < 0.0001). Our results suggest that ChlF can be a powerful tool to track photosynthetic rates at leaf, canopy, and ecosystem scales.",
                "authors": [
                    {
                        "name": "Heskel M.A."
                    },
                    {
                        "name": "Lu X."
                    },
                    {
                        "name": "Munger J.W."
                    },
                    {
                        "name": "Sun S."
                    },
                    {
                        "name": "Tang J."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 83,
                "date": "2017-07-01T00:00:00Z",
                "journal": "Global Change Biology",
                "title": "Chlorophyll fluorescence tracks seasonal variations of photosynthesis from leaf to canopy in a temperate forest"
            },
            "pmid": "27976474",
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "msnbase",
            "type": "uses"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1,
    "version": [
        "1.6.0"
    ]
}
