{
    "additionDate": "2017-03-24T09:34:06Z",
    "biotoolsCURIE": "biotools:cvtree",
    "biotoolsID": "cvtree",
    "collectionID": [
        "Proteomics"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ghzuo@fudan.edu.cn",
            "name": "Guanghong Zuo"
        }
    ],
    "description": "Composition Vector Tree (CVTree) infers phylogenetic relationships between microbial organisms by comparing their proteomes using a composition vector approach.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                },
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ghzuo/cvtree",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:17:14.820707Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://tlife.fudan.edu.cn/cvtree"
        }
    ],
    "name": "CVTree",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2021.03.006",
            "metadata": {
                "abstract": "Composition Vector Tree (CVTree) is an alignment-free algorithm to infer phylogenetic relationships from genome sequences. It has been successfully applied to study phylogeny and taxonomy of viruses, prokaryotes, and fungi based on the whole genomes, as well as chloroplast genomes, mitochondrial genomes, and metagenomes. Here we presented the standalone software for the CVTree algorithm. In the software, an extensible parallel workflow for the CVTree algorithm was designed. Based on the workflow, new alignment-free methods were also implemented. And by examining the phylogeny and taxonomy of 13,903 prokaryotes based on 16S rRNA sequences, we showed that CVTree software is an efficient and effective tool for studying phylogeny and taxonomy based on genome sequences. The code of CVTree software can be available at https://github.com/ghzuo/cvtree.",
                "authors": [
                    {
                        "name": "Zuo G."
                    }
                ],
                "citationCount": 34,
                "date": "2021-08-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "CVTree: A Parallel Alignment-free Phylogeny and Taxonomy Tool Based on Composition Vectors of Genomes"
            },
            "pmcid": "PMC9040009",
            "pmid": "34119695"
        },
        {
            "doi": "10.1093/nar/gkh362",
            "metadata": {
                "abstract": "Composition Vector Tree (CVTree) implements a systematic method of interring evolutionary relatedness of microbial organisms from the oligopeptide content of their complete proteomes (http://cvtree.cbi.pku.edu.cn). Since the first bacterial genomes were sequenced in 1995 there have been several attempts to infer prokaryote phylogeny from complete genomes. Most of them depend on sequence alignment directly or indirectly and, in some cases, need fine-tuning and adjustment. The composition vector method circumvents the ambiguity of choosing the genes for phylogenetic reconstruction and avoids the necessity of aligning sequences of essentially different length and gene content. This new method does not contain 'free' parameter and 'fine-tuning'. A bootstrap test for a phylogenetic tree of 139 organisms has shown the stability of the branchings, which support the small subunit ribosomal RNA (SSU rRNA) tree of life in its overall structure and in many details. It may provide a quick reference in prokaryote phylogenetics whenever the proteome of an organism is available, a situation that will become commonplace in the near future. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Hao B."
                    },
                    {
                        "name": "Luo H."
                    },
                    {
                        "name": "Qi J."
                    }
                ],
                "citationCount": 184,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CVTree: A phylogenetic tree reconstruction tool based on whole genomes"
            },
            "pmcid": "PMC441500",
            "pmid": "15215347"
        },
        {
            "doi": "10.1093/nar/gkp278",
            "metadata": {
                "abstract": "The CVTree web server (http://tlife.fudan.edu.cn/cvtree) presented here is a new implementation of the whole genome-based, alignment-free composition vector (CV) method for phylogenetic analysis. It is more efficient and user-friendly than the previously published version in the 2004 web server issue of Nucleic Acids Research. The development of whole genome-based alignment-free CV method has provided an independent verification to the traditional phylogenetic analysis based on a single gene or a few genes. This new implementation attempts to meet the challenge of ever increasing amount of genome data and includes in its database more than 850 prokaryotic genomes which will be updated monthly from NCBI, and more than 80 fungal genomes collected manually from several sequencing centers. This new CVTree web server provides a faster and stable research platform. Users can upload their own sequences to find their phylogenetic position among genomes selected from the server's; inbuilt database. All sequence data used in a session may be downloaded as a compressed file. In addition to standard phylogenetic trees, users can also choose to output trees whose monophyletic branches are collapsed to various taxonomic levels. This feature is particularly useful for comparing phylogeny with taxonomy when dealing with thousands of genomes.",
                "authors": [
                    {
                        "name": "Hao B."
                    },
                    {
                        "name": "Xu Z."
                    }
                ],
                "citationCount": 155,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CVTree update: A newly designed phylogenetic study platform using composition vectors and whole genomes"
            },
            "pmcid": "PMC2703908",
            "pmid": "19398429"
        }
    ],
    "toolType": [
        "Library",
        "Web application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
