{
    "additionDate": "2018-03-06T10:12:42Z",
    "biotoolsCURIE": "biotools:crux",
    "biotoolsID": "crux",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "name": "William Stafford Noble"
        }
    ],
    "description": "Cross-platform suite of analysis tools for interpreting protein mass spectrometry data.",
    "editPermission": {
        "authors": [
            "wnoble"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://crux.ms/",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-07-02T05:18:21Z",
    "name": "Crux",
    "owner": "wnoble",
    "publication": [
        {
            "doi": "10.1021/pr500741y",
            "metadata": {
                "abstract": "© 2014 American Chemical Society.Efficiently and accurately analyzing big protein tandem mass spectrometry data sets requires robust software that incorporates state-of-the-art computational, machine learning, and statistical methods. The Crux mass spectrometry analysis software toolkit (http://cruxtoolkit.sourceforge.net) is an open source project that aims to provide users with a cross-platform suite of analysis tools for interpreting protein mass spectrometry data.",
                "authors": [
                    {
                        "name": "McIlwain S."
                    },
                    {
                        "name": "Tamura K."
                    },
                    {
                        "name": "Kertesz-Farkas A."
                    },
                    {
                        "name": "Grant C.E."
                    },
                    {
                        "name": "Diament B."
                    },
                    {
                        "name": "Frewen B."
                    },
                    {
                        "name": "Howbert J.J."
                    },
                    {
                        "name": "Hoopmann M.R."
                    },
                    {
                        "name": "Kall L."
                    },
                    {
                        "name": "Eng J.K."
                    },
                    {
                        "name": "MacCoss M.J."
                    },
                    {
                        "name": "Noble W.S."
                    }
                ],
                "citationCount": 40,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Crux: Rapid open source protein tandem mass spectrometry analysis"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1021/pr800127y",
            "metadata": {
                "abstract": "Mass spectrometry, the core technology in the field of proteomics, promises to enable scientists to identify and quantify the entire complement of proteins in a complex biological sample. Currently, the primary bottleneck in this type of experiment is computational. Existing algorithms for interpreting mass spectra are slow and fail to identify a large proportion of the given spectra. We describe a database search program called Crux that reimplements and extends the widely used database search program Sequest. For speed. Crux uses a peptide indexing scheme to rapidly retrieve candidate peptides for a given spectrum. For each peptide in the target database, Crux generates shuffled decoy peptides on the fly, providing a good null model and, hence, accurate false discovery rate estimates. Crux also implements two recently described postprocessing methods: a p value calculation based upon fitting a Weibull distribution to the observed scores, and a semisupervised method that learns to discriminate between target and decoy matches. Both methods significantly improve the overall rate of peptide identification. Crux is implemented in C and is distributed with source code freely to noncommercial users. © 2008 American Chemical Society.",
                "authors": [
                    {
                        "name": "Park C.Y."
                    },
                    {
                        "name": "Klammer A.A."
                    },
                    {
                        "name": "Kali L."
                    },
                    {
                        "name": "MacCoss M.J."
                    },
                    {
                        "name": "Noble W.S."
                    }
                ],
                "citationCount": 102,
                "date": "2008-07-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Rapid and accurate peptide identification from tandem mass spectra"
            },
            "type": "Other"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}