{
    "additionDate": "2017-12-18T00:10:51Z",
    "biotoolsCURIE": "biotools:pedcheck",
    "biotoolsID": "pedcheck",
    "credit": [
        {
            "email": "jeff@watson.hgen.pitt.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PedCheck is a program for identification of genotype incompatibilities in linkage analysis.It  will assist researchers in identifying all Mendelian inconsistencies in pedigree data and will provide them with useful and detailed diagnostic information to help resolve the errors.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "homepage": "http://watson.hgen.pitt.edu/register/docs/pedcheck.html",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-25T14:47:54.414471Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pedcheck-1-00-detecting-marker-typing-incompatibilities-pedigree-data.html"
        }
    ],
    "name": "Pedcheck",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1086/301904",
            "metadata": {
                "abstract": "Prior to performance of linkage analysis, elimination of all Mendelian inconsistencies in the pedigree data is essential. Often, identification of erroneous genotypes by visual inspection can be very difficult and time consuming. In fact, sometimes the errors are not recognized until the stage of running linkage-analysis software. The effort then required to find the erroneous genotypes and to cross-reference pedigree and marker data that may have been recoded and renumbered can be not only tedious but also quite daunting, in the case of very large pedigrees. We have implemented four error-checking algorithms in a new computer program, PedCheck, which will assist researchers in identifying all Mendelian inconsistencies in pedigree data and will provide them with useful and detailed diagnostic information to help resolve the errors. Our program, which uses many of the algorithms implemented in VITESSE, handles large data sets quickly and efficiently, accepts a variety of input formats, and offers various error-checking algorithms that match the subtlety of the pedigree error. These algorithms range from simple parent-off-spring-compatibility checks to a single-locus likelihood-based statistic that identifies and ranks the individuals most likely to be in error. We use various real data sets to illustrate the power and effectiveness of our program.",
                "authors": [
                    {
                        "name": "O'Connell J.R."
                    },
                    {
                        "name": "Weeks D.E."
                    }
                ],
                "citationCount": 1831,
                "date": "1998-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "PedCheck: A program for identification of genotype incompatibilities in linkage analysis"
            },
            "pmcid": "PMC1377228",
            "pmid": "9634505",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Linkage",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "1.00"
    ]
}
