{
    "additionDate": "2019-11-14T19:52:59Z",
    "biotoolsCURIE": "biotools:AssessORF",
    "biotoolsID": "AssessORF",
    "confidence_flag": "tool",
    "description": "Combining evolutionary conservation and proteomics to assess prokaryotic gene predictions | MOTIVATION:A core task of genomics is to identify the boundaries of protein coding genes, which may cover over 90% of a prokaryote's genome. Several programs are available for gene finding, yet it is currently unclear how well these programs perform and whether any offers superior accuracy. This is in part because there is no universal benchmark for gene finding and, therefore, most developers select their own benchmarking strategy. RESULTS:Here, we introduce AssessORF, a new approach for benchmarking prokaryotic gene predictions based on evidence from proteomics data and the evolutionary conservation of start and stop codons. We applied AssessORF to compare gene predictions offered by GenBank, GeneMarkS-2, Glimmer, and Prodigal on genomes spanning the prokaryotic tree of life",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://www.bioconductor.org/packages/release/bioc/html/AssessORF.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-02T15:33:26Z",
    "license": "GPL-3.0",
    "name": "AssessORF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ714",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: A core task of genomics is to identify the boundaries of protein coding genes, which may cover over 90% of a prokaryote's genome. Several programs are available for gene finding, yet it is currently unclear how well these programs perform and whether any offers superior accuracy. This is in part because there is no universal benchmark for gene finding and, therefore, most developers select their own benchmarking strategy. Results: Here, we introduce AssessORF, a new approach for benchmarking prokaryotic gene predictions based on evidence from proteomics data and the evolutionary conservation of start and stop codons. We applied AssessORF to compare gene predictions offered by GenBank, GeneMarkS-2, Glimmer and Prodigal on genomes spanning the prokaryotic tree of life. Gene predictions were 88-95% in agreement with the available evidence, with Glimmer performing the worst but no clear winner. All programs were biased towards selecting start codons that were upstream of the actual start. Given these findings, there remains considerable room for improvement, especially in the detection of correct start sites.",
                "authors": [
                    {
                        "name": "Campeau A."
                    },
                    {
                        "name": "Gonzalez D.J."
                    },
                    {
                        "name": "Korandla D.R."
                    },
                    {
                        "name": "Wozniak J.M."
                    },
                    {
                        "name": "Wright E.S."
                    }
                ],
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AssessORF: Combining evolutionary conservation and proteomics to assess prokaryotic gene predictions"
            },
            "pmid": "31532487"
        }
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
