{
    "additionDate": "2021-12-06T13:51:51.355652Z",
    "biotoolsCURIE": "biotools:svreg",
    "biotoolsID": "svreg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rkim@stat.tamu.edu",
            "name": "Rakheon Kim",
            "orcidid": "https://orcid.org/0000-0001-9577-7872",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The R package svreg implements the structural varying-coefficient regression (svReg) for the model selection of a varying-coefficient model with structured main predictors or modifying variables. It also provides functions for performing the pliable lasso (plasso).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rakheon/svreg",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-06T13:51:51.358108Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Tanya-Garcia-Lab/svreg/issues"
        }
    ],
    "name": "svreg",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/BIMJ.202000312",
            "metadata": {
                "abstract": "© 2021 Wiley-VCH GmbHFor Huntington disease, identification of brain regions related to motor impairment can be useful for developing interventions to alleviate the motor symptom, the major symptom of the disease. However, the effects from the brain regions to motor impairment may vary for different groups of patients. Hence, our interest is not only to identify the brain regions but also to understand how their effects on motor impairment differ by patient groups. This can be cast as a model selection problem for a varying-coefficient regression. However, this is challenging when there is a pre-specified group structure among variables. We propose a novel variable selection method for a varying-coefficient regression with such structured variables and provide a publicly available R package svreg for implementation of our method. Our method is empirically shown to select relevant variables consistently. Also, our method screens irrelevant variables better than existing methods. Hence, our method leads to a model with higher sensitivity, lower false discovery rate and higher prediction accuracy than the existing methods. Finally, we found that the effects from the brain regions to motor impairment differ by disease severity of the patients. To the best of our knowledge, our study is the first to identify such interaction effects between the disease severity and brain regions, which indicates the need for customized intervention by disease severity.",
                "authors": [
                    {
                        "name": "Garcia T.P."
                    },
                    {
                        "name": "Kim R."
                    },
                    {
                        "name": "Muller S."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Biometrical Journal",
                "title": "svReg: Structural varying-coefficient regression to differentiate how regional brain atrophy affects motor impairment for Huntington disease severity groups"
            },
            "pmid": "33871905",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
