
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.dynacom.co.jp/english/company/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.dynacom.co.jp/u-tokyo.ac.jp/snphitlink/files/software/doc/Manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Single nucleotide polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Linkage",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "SNP",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Polymorphism",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/snp-hitlink-1-5-1-snp-high-throughput-linkage-analysis-system.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: During this recent decade, microarray-based single nucleotide polymorphism (SNP) data are becoming more widely used as markers for linkage analysis in the identification of loci for disease-associated genes. Although microarray-based SNP analyses have markedly reduced genotyping time and cost compared with microsatellite-based analyses, applying these enormous data to linkage analysis programs is a time-consuming step, thus, necessitating a high-throughput platform. Results: We have developed SNP HiTLink (SNP High Throughput Linkage analysis system). In this system, SNP chip data of the Affymetrix Mapping 100 k/500 k array set and Genome-Wide Human SNP array 5.0/6.0 can be directly imported and passed to parametric or model-free linkage analysis programs; MLINK, Superlink, Merlin and Allegro. Various marker-selecting functions are implemented to avoid the effect of typing-error data, markers in linkage equilibrium or to select informative data. Conclusion: The results using the 100 k SNP dataset were comparable or even superior to those obtained from analyses using microsatellite markers in terms of LOD scores obtained. General personal computers are sufficient to execute the process, as runtime for whole-genome analysis was less than a few hours. This system can be widely applied to linkage analysis using microarray-based SNP data and with which one can expect high-throughput and reliable linkage analysis. © 2009 Fukuda et al; licensee BioMed Central Ltd.",
            "authors": [
                "Fukuda Y.",
                "Nakahara Y.",
                "Date H.",
                "Takahashi Y.",
                "Goto J.",
                "Miyashita A.",
                "Kuwano R.",
                "Adachi H.",
                "Nakamura E.",
                "Tsuji S."
            ],
            "cit_count": 23,
            "doi": "10.1186/1471-2105-10-121",
            "journal": "BMC Bioinformatics",
            "title": "SNP HiTLink: A high-throughput linkage analysis system employing dense SNP data",
            "type": "Primary",
            "year": "2009-04-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:snp_hitlink",
        "biotoolsID": "snp_hitlink",
        "description": "Pipeline to directly connect SNP (Single Nucleotide Polymorphism) data and linkage analysis program.",
        "homepage": "http://www.dynacom.co.jp/u-tokyo.ac.jp/snphitlink/",
        "name": "SNP HiTLink",
        "version": [
            "1.5.1"
        ]
    }
}