{
    "additionDate": "2021-01-18T09:39:02Z",
    "biotoolsCURIE": "biotools:swcrtdesign",
    "biotoolsID": "swcrtdesign",
    "confidence_flag": "tool",
    "description": "An RPackage for Stepped Wedge Trial Design and Analysis.\n\nStepped wedge trials (SWTs) are a type of cluster-randomized trial that are commonly used to evaluate health care interventions. Most SWT-related software packages have restrictive assumptions about the study design and correlation structure of the data. The objective of this paper is to present a package and corresponding web-based graphical user interface (GUI) that provide researchers with another, more flexible option for SWT design and analysis. METHODS:We developed an Rpackage swCRTdesign ('stepped wedge Cluster Randomized Trial design'), which uses a random effects model to account for correlation in the data induced by a SWT design. Possible sources of correlation include clusters, time within clusters, and treatment within clusters",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://rdrr.io/cran/swCRTdesign/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-24T13:39:50Z",
    "name": "swCRTdesign",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2020.105514",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.Background and objective: Stepped wedge trials (SWTs) are a type of cluster-randomized trial that are commonly used to evaluate health care interventions. Most SWT-related software packages have restrictive assumptions about the study design and correlation structure of the data. The objective of this paper is to present a package and corresponding web-based graphical user interface (GUI) that provide researchers with another, more flexible option for SWT design and analysis. Methods: We developed an R package swCRTdesign (‘stepped wedge Cluster Randomized Trial design’), which uses a random effects model to account for correlation in the data induced by a SWT design. Possible sources of correlation include clusters, time within clusters, and treatment within clusters. Results: swCRTdesign allows a user to calculate power, simulate SWT data to streamline simulation studies (e.g. to estimate power), and create descriptive summaries and plots. Additionally, a GUI, developed using shiny, is available to calculate power and create power curves and design plots. Conclusions: The swCRTdesign package accommodates a wide variety of SWT designs, and makes it easy to account for some sources of correlation which are not found in other packages. The user-friendly web-based GUI makes some swCRTdesign features accessible to researchers not familiar with R. These two resources will make appropriately complex SWT calculations more accessible to scientists from a wide variety of backgrounds.",
                "authors": [
                    {
                        "name": "Voldal E.C."
                    },
                    {
                        "name": "Hakhu N.R."
                    },
                    {
                        "name": "Xia F."
                    },
                    {
                        "name": "Heagerty P.J."
                    },
                    {
                        "name": "Hughes J.P."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "swCRTdesign: An R Package for Stepped Wedge Trial Design and Analysis"
            },
            "pmid": "32554025"
        }
    ]
}