{
    "additionDate": "2018-05-06T15:53:33Z",
    "biotoolsCURIE": "biotools:vlad",
    "biotoolsID": "vlad",
    "credit": [
        {
            "email": "carol.bult@jax.org",
            "name": "Carol J. Bult",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Visual annotation display- finding functional themes in lists of genes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proto.informatics.jax.org/prototypes/vlad/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://proto.informatics.jax.org/prototypes/vlad/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "VLAD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1007/S00335-015-9570-2",
            "metadata": {
                "abstract": "© 2015, The Author(s).Experiments that employ genome scale technology platforms frequently result in lists of tens to thousands of genes with potential significance to a specific biological process or disease. Searching for biologically relevant connections among the genes or gene products in these lists is a common data analysis task. We have implemented a software application for uncovering functional themes in sets of genes based on their annotations to bio-ontologies, such as the gene ontology and the mammalian phenotype ontology. The application, called VisuaL Annotation Display (VLAD), performs a statistical analysis to test for the enrichment of ontology terms in a set of genes submitted by a researcher. The results for each analysis using VLAD includes a table of ontology terms, sorted in decreasing order of significance. Each row contains the term, statistics such as the number of annotated terms, the p value, etc., and the symbols of annotated genes. An accompanying graphical display shows portions of the ontology hierarchy, where node sizes are scaled based on p values. Although numerous ontology term enrichment programs already exist, VLAD is unique in that it allows users to upload their own annotation files and ontologies for customized term enrichment analyses, supports the analysis of multiple gene sets at once, provides interfaces to customize graphical output, and is tightly integrated with functional and biological details about mouse genes in the Mouse Genome Informatics (MGI) database. VLAD is available as a web-based application from the MGI web site (http://proto.informatics.jax.org/prototypes/vlad/).",
                "authors": [
                    {
                        "name": "Richardson J.E."
                    },
                    {
                        "name": "Bult C.J."
                    }
                ],
                "citationCount": 27,
                "date": "2015-10-01T00:00:00Z",
                "journal": "Mammalian Genome",
                "title": "Visual annotation display (VLAD): a tool for finding functional themes in lists of genes"
            },
            "pmcid": "PMC4602057",
            "pmid": "26047590"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}