{
    "additionDate": "2024-07-18T11:40:32.155736Z",
    "biotoolsCURIE": "biotools:gbye",
    "biotoolsID": "gbye",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wangjiaboyifeng@163.com",
            "name": "Jiabo Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated tool for genome widely association study and genome selection based on genetic by environmental interaction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liu-xinrui/GbyE",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-07-18T11:40:32.160271Z",
    "name": "GbyE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12864-024-10310-5",
            "metadata": {
                "abstract": "Background: The growth and development of organism were dependent on the effect of genetic, environment, and their interaction. In recent decades, lots of candidate additive genetic markers and genes had been detected by using genome-widely association study (GWAS). However, restricted to computing power and practical tool, the interactive effect of markers and genes were not revealed clearly. And utilization of these interactive markers is difficult in the breeding and prediction, such as genome selection (GS). Results: Through the Power-FDR curve, the GbyE algorithm can detect more significant genetic loci at different levels of genetic correlation and heritability, especially at low heritability levels. The additive effect of GbyE exhibits high significance on certain chromosomes, while the interactive effect detects more significant sites on other chromosomes, which were not detected in the first two parts. In prediction accuracy testing, in most cases of heritability and genetic correlation, the majority of prediction accuracy of GbyE is significantly higher than that of the mean method, regardless of whether the rrBLUP model or BGLR model is used for statistics. The GbyE algorithm improves the prediction accuracy of the three Bayesian models BRR, BayesA, and BayesLASSO using information from genetic by environmental interaction (G × E) and increases the prediction accuracy by 9.4%, 9.1%, and 11%, respectively, relative to the Mean value method. The GbyE algorithm is significantly superior to the mean method in the absence of a single environment, regardless of the combination of heritability and genetic correlation, especially in the case of high genetic correlation and heritability. Conclusions: Therefore, this study constructed a new genotype design model program (GbyE) for GWAS and GS using Kronecker product. which was able to clearly estimate the additive and interactive effects separately. The results showed that GbyE can provide higher statistical power for the GWAS and more prediction accuracy of the GS models. In addition, GbyE gives varying degrees of improvement of prediction accuracy in three Bayesian models (BRR, BayesA, and BayesCpi). Whatever the phenotype were missed in the single environment or multiple environments, the GbyE also makes better prediction for inference population set. This study helps us understand the interactive relationship between genomic and environment in the complex traits. The GbyE source code is available at the GitHub website (https://github.com/liu-xinrui/GbyE).",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Qin J."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wu S."
                    },
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Zhong J."
                    }
                ],
                "citationCount": 1,
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "GbyE: an integrated tool for genome widely association study and genome selection based on genetic by environmental interaction"
            },
            "pmcid": "PMC11027269",
            "pmid": "38641604"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
