{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T11:10:41Z",
    "biotoolsCURIE": "biotools:ColonySizeDistributions",
    "biotoolsID": "ColonySizeDistributions",
    "cost": "Free of charge",
    "description": "Software tool for the quantification of metastatic colony growth dynamics and size distributions in vitro and in vivo.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://github.com/sbhoyar1/ColonySizeDistributions/blob/master/Tutorial.docx?raw=true"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/sbhoyar1/ColonySizeDistributions/blob/master/Readme.docx?raw=true"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/sbhoyar1/ColonySizeDistributions/archive/v1.0.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "In vitro selection",
                    "uri": "http://edamontology.org/operation_3795"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sbhoyar1/ColonySizeDistributions",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/sbhoyar1/ColonySizeDistributions/issues"
        }
    ],
    "maturity": "Mature",
    "name": "ColonySizeDistributions",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0209591",
            "metadata": {
                "abstract": "© 2018 Bhoyar et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The majority of cancer-related deaths are due to metastasis, hence improved methods to biologically and computationally model metastasis are required. Computational models rely on robust data that is machine-readable. The current methods used to model metastasis in mice involve generating primary tumors by injecting human cells into immune-compromised mice, or by examining genetically engineered mice that are pre-disposed to tumor development and that eventually metastasize. The degree of metastasis can be measured using flow cytometry, bioluminescence imaging, quantitative PCR, and/or by manually counting individual lesions from metastatic tissue sections. The aforementioned methods are time-consuming and do not provide information on size distribution or spatial localization of individual metastatic lesions. In this work, we describe and provide a MATLAB script for an image-processing based method designed to obtain quantitative data from tissue sections comprised of multiple subpopulations of disseminated cells localized at metastatic sites in vivo. We further show that this method can be easily adapted for high throughput imaging of live or fixed cells in vitro under a multitude of conditions in order to assess clonal fitness and evolution. The inherent variation in mouse studies, increasing complexity in experimental design which incorporate fate-mapping of individual cells, result in the need for a large cohort of mice to generate a robust dataset. High-throughput imaging techniques such as the one that we describe will enhance the data that can be used as input for the development of computational models aimed at modeling the metastatic process.",
                "authors": [
                    {
                        "name": "Bhoyar S."
                    },
                    {
                        "name": "DiGiacomo J.W."
                    },
                    {
                        "name": "Gilkes D.M."
                    },
                    {
                        "name": "Godet I."
                    }
                ],
                "citationCount": 2,
                "date": "2018-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A software tool for the quantification of metastatic colony growth dynamics and size distributions in vitro and in vivo"
            },
            "pmcid": "PMC6307751",
            "pmid": "30589908",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
