{
    "additionDate": "2020-01-09T17:56:35Z",
    "biotoolsCURIE": "biotools:SourceSet",
    "biotoolsID": "SourceSet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chiara.romualdi@unipd.it",
            "name": "Chiara Romualdi",
            "orcidid": "https://orcid.org/0000-0003-4792-9047",
            "typeEntity": "Person"
        },
        {
            "email": "elisa.salviato@ifom.eu",
            "name": "Elisa Salviato",
            "orcidid": "https://orcid.org/0000-0003-3246-7820",
            "typeEntity": "Person"
        }
    ],
    "description": "A graphical model approach to identify primary genes in perturbed biological pathways.\n\nTopological gene-set analysis has emerged as a powerful means for omic data interpretation. Although numerous methods for identifying dysregulated genes have been proposed, few of them aim to distinguish genes that are the real source of perturbation from those that merely respond to the signal dysregulation. Here, we propose a new method, called SourceSet, able to distinguish between the primary and the secondary dysregulation within a Gaussian graphical model context. The proposed method compares gene expression profiles in the control and in the perturbed condition and detects the differences in both the mean and the covariance parameters with a series of likelihood ratio tests.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/SourceSet/index.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/SourceSet/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-16T14:07:38Z",
    "name": "SourceSet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007357",
            "metadata": {
                "abstract": "© 2019 Salviato et al.Topological gene-set analysis has emerged as a powerful means for omic data interpretation. Although numerous methods for identifying dysregulated genes have been proposed, few of them aim to distinguish genes that are the real source of perturbation from those that merely respond to the signal dysregulation. Here, we propose a new method, called Source- Set, able to distinguish between the primary and the secondary dysregulation within a Gaussian graphical model context. The proposed method compares gene expression profiles in the control and in the perturbed condition and detects the differences in both the mean and the covariance parameters with a series of likelihood ratio tests. The resulting evidence is used to infer the primary and the secondary set, i.e. the genes responsible for the primary dysregulation, and the genes affected by the perturbation through network propagation. The proposed method demonstrates high specificity and sensitivity in different simulated scenarios and on several real biological case studies. In order to fit into the more traditional pathway analysis framework, SourceSet R package also extends the analysis from a single to multiple pathways and provides several graphical outputs, including Cytoscape visualization to browse the results.",
                "authors": [
                    {
                        "name": "Chiogna M."
                    },
                    {
                        "name": "Djordjilovic V."
                    },
                    {
                        "name": "Romualdi C."
                    },
                    {
                        "name": "Salviato E."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "SourceSet: A graphical model approach to identify primary genes in perturbed biological pathways"
            },
            "pmcid": "PMC6834292",
            "pmid": "31652275"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
