{
    "additionDate": "2017-01-13T13:16:13Z",
    "biotoolsCURIE": "biotools:scaffolder",
    "biotoolsID": "scaffolder",
    "credit": [
        {
            "email": "mail@michaelbarton.me.uk",
            "name": "Barton M.D.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Edit your genome sequence using a simple human readable syntax. Manage contig positions and add inserts all in a plain text file.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.rubydoc.info/gems/scaffolder/Scaffolder"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://next.gs/",
    "language": [
        "Ruby"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "Scaffolder",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1751-0473-7-4",
            "metadata": {
                "abstract": "Background: The assembly of next-generation short-read sequencing data can result in a fragmented non-contiguous set of genomic sequences. Therefore a common step in a genome project is to join neighbouring sequence regions together and fill gaps. This scaffolding step is non-trivial and requires manually editing large blocks of nucleotide sequence. Joining these sequences together also hides the source of each region in the final genome sequence. Taken together these considerations may make reproducing or editing an existing genome scaffold difficult.Methods: The software outlined here, \" Scaffolder,\" is implemented in the Ruby programming language and can be installed via the RubyGems software management system. Genome scaffolds are defined using YAML - a data format which is both human and machine-readable. Command line binaries and extensive documentation are available.Results: This software allows a genome build to be defined in terms of the constituent sequences using a relatively simple syntax. This syntax further allows unknown regions to be specified and additional sequence to be used to fill known gaps in the scaffold. Defining the genome construction in a file makes the scaffolding process reproducible and easier to edit compared with large FASTA nucleotide sequences.Conclusions: Scaffolder is easy-to-use genome scaffolding software which promotes reproducibility and continuous development in a genome project. Scaffolder can be found at http://next.gs. © 2012 Barton and Barton; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Barton M.D."
                    },
                    {
                        "name": "Barton H.A."
                    }
                ],
                "citationCount": 11,
                "date": "2012-05-28T00:00:00Z",
                "journal": "Source Code for Biology and Medicine",
                "title": "Scaffolder - software for manual genome scaffolding"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1
}