{
    "additionDate": "2021-01-18T10:19:19Z",
    "biotoolsCURIE": "biotools:abc-gwas",
    "biotoolsID": "abc-gwas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "songj@illinois.edu",
            "name": "Jun S. Song",
            "typeEntity": "Person"
        }
    ],
    "description": "A web application for analysis of breast cancer GWAS variants.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://education.knoweng.org/abc-gwas/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-19T12:00:21Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jssong-lab/ABC-GWAS"
        }
    ],
    "name": "ABC-GWAS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.00730",
            "metadata": {
                "abstract": "© Copyright © 2020 Manjunath, Zhang, Zhang, Roy, Perez-Pinera and Song.Over the past decade, hundreds of genome-wide association studies (GWAS) have implicated genetic variants in various diseases, including cancer. However, only a few of these variants have been functionally characterized to date, mainly because the majority of the variants reside in non-coding regions of the human genome with unknown function. A comprehensive functional annotation of the candidate variants is thus necessary to fill the gap between the correlative findings of GWAS and the development of therapeutic strategies. By integrating large-scale multi-omics datasets such as the Cancer Genome Atlas (TCGA) and the Encyclopedia of DNA Elements (ENCODE), we performed multivariate linear regression analysis of expression quantitative trait loci, sequence permutation test of transcription factor binding perturbation, and modeling of three-dimensional chromatin interactions to analyze the potential molecular functions of 2,813 single nucleotide variants in 93 genomic loci associated with estrogen receptor-positive breast cancer. To facilitate rapid progress in functional genomics of breast cancer, we have created “Analysis of Breast Cancer GWAS” (ABC-GWAS), an interactive database of functional annotation of estrogen receptor-positive breast cancer GWAS variants. Our resource includes expression quantitative trait loci, long-range chromatin interaction predictions, and transcription factor binding motif analyses to prioritize putative target genes, causal variants, and transcription factors. An embedded genome browser also facilitates convenient visualization of the GWAS loci in genomic and epigenomic context. ABC-GWAS provides an interactive visual summary of comprehensive functional characterization of estrogen receptor-positive breast cancer variants. The web resource will be useful to both computational and experimental biologists who wish to generate and test their hypotheses regarding the genetic susceptibility, etiology, and carcinogenesis of breast cancer. ABC-GWAS can also be used as a user-friendly educational resource for teaching functional genomics. ABC-GWAS is available at http://education.knoweng.org/abc-gwas/.",
                "authors": [
                    {
                        "name": "Manjunath M."
                    },
                    {
                        "name": "Perez-Pinera P."
                    },
                    {
                        "name": "Roy S."
                    },
                    {
                        "name": "Song J.S."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2020-07-20T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "ABC-GWAS: Functional Annotation of Estrogen Receptor-Positive Breast Cancer Genetic Variants"
            },
            "pmcid": "PMC7379852",
            "pmid": "32765587"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
