{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.public.asu.edu/~jye02/"}],"documentation":[{"type":"GENERAL","url":"http://www.geom-comp.umn.edu/mapsci/readme.html"}],"function":[{"operation":[{"term":"Multiple structure alignment","uri":"http://edamontology.org/operation_0504"}]},{"operation":[{"term":"Multiple alignment","uri":"http://edamontology.org/operation_0492"}]},{"operation":[{"term":"Structure alignment","uri":"http://edamontology.org/operation_0295"}]},{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mapsci-1-0-multiple-alignment-of-protein-structures-and-consensus-identification.html"}],"publication":[{"abstract":"Background: An algorithm is presented to compute a multiple structure alignment for a set of proteins and to generate a consensus (pseudo) protein which captures common substructures present in the given proteins. The algorithm represents each protein as a sequence of triples of coordinates of the alpha-carbon atoms along the backbone. It then computes iteratively a sequence of transformation matrices (i.e., translations and rotations) to align the proteins in space and generate the consensus. The algorithm is a heuristic in that it computes an approximation to the optimal alignment that minimizes the sum of the pairwise distances between the consensus and the transformed proteins.Results: Experimental results show that the algorithm converges quite rapidly and generates consensus structures that are visually similar to the input proteins. A comparison with other coordinate-based alignment algorithms (MAMMOTH and MATT) shows that the proposed algorithm is competitive in terms of speed and the sizes of the conserved regions discovered in an extensive benchmark dataset derived from the HOMSTRAD and SABmark databases.The algorithm has been implemented in C++ and can be downloaded from the project's web page. Alternatively, the algorithm can be used via a web server which makes it possible to align protein structures by uploading files from local disk or by downloading protein data from the RCSB Protein Data Bank.Conclusions: An algorithm is presented to compute a multiple structure alignment for a set of proteins, together with their consensus structure. Experimental results show its effectiveness in terms of the quality of the alignment and computational cost. © 2010 Ilinkin et al; licensee BioMed Central Ltd.","authors":["Ilinkin I.","Ye J.","Janardan R."],"cit_count":21,"doi":"10.1186/1471-2105-11-71","journal":"BMC Bioinformatics","title":"Multiple structure alignment and consensus identification for proteins","type":"Primary","year":"2010-02-02"}],"summary":{"biotoolsCURIE":"biotools:mapsci","biotoolsID":"mapsci","description":"MAPSCI is an algorithm to compute a multiple structure alignment for a set of proteins and to generate a consensus structure.","homepage":"http://www.geom-comp.umn.edu/mapsci/index.html","name":"MAPSCI","version":["1.0"]}}