{
    "additionDate": "2020-01-09T18:02:06Z",
    "biotoolsCURIE": "biotools:IoT",
    "biotoolsID": "IoT",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sinkitlo13@gmail.com",
            "name": "Sin Kit Lo",
            "orcidid": "https://orcid.org/0000-0002-9156-3225",
            "typeEntity": "Person"
        },
        {
            "email": "cakasiadis@iit.demokritos.gr",
            "name": "Charilaos Akasiadis",
            "typeEntity": "Person"
        },
        {
            "email": "csliew@um.edu.my",
            "name": "Chee Sun Liew",
            "typeEntity": "Person"
        },
        {
            "email": "jyang@nudt.edu.cn",
            "name": "Jun Yang",
            "typeEntity": "Person"
        },
        {
            "email": "koksoon@um.edu.my",
            "name": "Kok Soon Tey",
            "typeEntity": "Person"
        },
        {
            "email": "parksy@sogang.ac.kr",
            "name": "Sungyong Park",
            "typeEntity": "Person"
        },
        {
            "email": "yun@sch.ac.kr",
            "name": "Jaeseok Yun",
            "typeEntity": "Person"
        }
    ],
    "description": "A Multi-Protocol IoT Platform Based on Open-Source Frameworks.\n\nAn Interoperable Component-Based Architecture for Data-Driven IoT System.\n\nA Cloud-based Middleware for Self-Adaptive IoT-Collaboration Services.\n\nImplementation of Sensing and Actuation Capabilities for IoT Devices Using oneM2M Platforms.\n\nSatellite Edge Computing for the Internet of Things in Aerospace.\n\nIoT-EPI is a European Initiative for IoT platform development. The IoT-European Platforms Initiative (IoT-EPI) was formed to build a vibrant and sustainable IoT-ecosystem in Europe, maximising the opportunities for platform development, interoperability and information sharing.\n\nIoT-EPI is a European Initiative for IoT platform development.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service composition",
                    "uri": "http://edamontology.org/operation_3762"
                },
                {
                    "term": "Service discovery",
                    "uri": "http://edamontology.org/operation_3761"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://iot-epi.eu",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-14T13:00:43Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://iotivity.org/"
        }
    ],
    "name": "IoT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19194217",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Internet of Things (IoT) technologies have evolved rapidly during the last decade, and many architecture types have been proposed for distributed and interconnected systems. However, most systems are implemented following fragmented approaches for specific application domains, introducing difficulties in providing unified solutions. However, the unification of solutions is an important feature from an IoT perspective. In this paper, we present an IoT platform that supports multiple application layer communication protocols (Representational State Transfer (REST)/HyperText Transfer Protocol (HTTP), Message Queuing Telemetry Transport (MQTT), Advanced Message Queuing Protocol (AMQP), Constrained Application Protocol (CoAP), and Websockets) and that is composed of open-source frameworks (RabbitMQ, Ponte, OM2M, and RDF4J).We have explored a back-end system that interoperates with the various frameworks and offers a single approach for user-access control on IoT data streams and micro-services. The proposed platform is evaluated using its containerized version, being easily deployable on the vast majority of modern computing infrastructures. Its design promotes service reusability and follows a marketplace architecture, so that the creation of interoperable IoT ecosystems with active contributors is enabled. All the platform’s features are analyzed, and we discuss the results of experiments, with the multiple communication protocols being tested when used interchangeably for transferring data. Developing unified solutions using such a platform is of interest to users and developers as they can test and evaluate local instances or even complex applications composed of their own IoT resources before releasing a production version to the marketplace.",
                "authors": [
                    {
                        "name": "Akasiadis C."
                    },
                    {
                        "name": "Pitsilis V."
                    },
                    {
                        "name": "Spyropoulos C.D."
                    }
                ],
                "citationCount": 8,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "A multi-protocol IoT platform based on open-source frameworks"
            },
            "pmcid": "PMC6806188",
            "pmid": "31569338"
        },
        {
            "doi": "10.3390/S19204354",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.The advancement of the Internet of Things (IoT) as a solution in diverse application domains has nurtured the expansion in the number of devices and data volume. Multiple platforms and protocols have been introduced and resulted in high device ubiquity and heterogeneity. However, currently available IoT architectures face challenges to accommodate the diversity in IoT devices or services operating under different operating systems and protocols. In this paper, we propose a new IoT architecture that utilizes the component-based design approach to create and define the loosely-coupled, standalone but interoperable service components for IoT systems. Furthermore, a data-driven feedback function is included as a key feature of the proposed architecture to enable a greater degree of system automation and to reduce the dependency on mankind for data analysis and decision-making. The proposed architecture aims to tackle device interoperability, system reusability and the lack of data-driven functionality issues. Using a real-world use case on a proof-of-concept prototype, we examined the viability and usability of the proposed architecture.",
                "authors": [
                    {
                        "name": "Liew C.S."
                    },
                    {
                        "name": "Lo S.K."
                    },
                    {
                        "name": "Mekhilef S."
                    },
                    {
                        "name": "Tey K.S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "An interoperable component-based architecture for data-driven IoT system"
            },
            "pmcid": "PMC6832394",
            "pmid": "31600904"
        },
        {
            "doi": "10.3390/S19204375",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.As one of the information industry’s future development directions, the Internet of Things (IoT) has been widely used. In order to reduce the pressure on the network caused by the long distance between the processing platform and the terminal, edge computing provides a new paradigm for IoT applications. In many scenarios, the IoT devices are distributed in remote areas or extreme terrain and cannot be accessed directly through the terrestrial network, and data transmission can only be achieved via satellite. However, traditional satellites are highly customized, and on-board resources are designed for specific applications rather than universal computing. Therefore, we propose to transform the traditional satellite into a space edge computing node. It can dynamically load software in orbit, flexibly share on-board resources, and provide services coordinated with the cloud. The corresponding hardware structure and software architecture of the satellite is presented. Through the modeling analysis and simulation experiments of the application scenarios, the results show that the space edge computing system takes less time and consumes less energy than the traditional satellite constellation. The quality of service is mainly related to the number of satellites, satellite performance, and task offloading strategy.",
                "authors": [
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Qu Z."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yang J."
                    }
                ],
                "citationCount": 8,
                "date": "2019-10-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Satellite edge computing for the internet of things in aerospace"
            },
            "pmcid": "PMC6832566",
            "pmid": "31658684"
        },
        {
            "doi": "10.3390/S19204559",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.The middleware framework for IoT collaboration services should provide efficient solutions to context awareness and uncertainty issues among multiple collaboration domains. However, existing middleware frameworks are mostly limited to a single system, and developing self-adaptive IoT collaboration services using existing frameworks requires developers to take considerable time and effort. Furthermore, the developed IoT collaboration services are often dependent on a particular domain, which cannot easily be referenced in other domains. This paper proposes a cloud-based middleware framework that provides a set of cloud services for self-adaptive IoT collaboration services. The proposed middleware framework is generic in the sense that it clearly separates domain-dependent components from the layers that leverage existing middleware frameworks. In addition, the proposed framework allows developers to upload domain-dependent components onto the cloud, search for registered components, and launch Virtual Machine (VM) running a new MAPE cycle via a convenient web-based interface. The feasibility of the proposed framework has been shown with a simulation of an IoT collaboration service that traces a criminal suspect. The performance evaluation shows that the proposed middleware framework runs with an overhead of only 6% compared to pure Java-based middleware and is scalable as the number of VMs increases up to 16.",
                "authors": [
                    {
                        "name": "Park S."
                    },
                    {
                        "name": "Park S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "A cloud-based middleware for self-adaptive IoT-collaboration services"
            },
            "pmcid": "PMC6832963",
            "pmid": "31635186"
        },
        {
            "doi": "10.3390/S19204567",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.In this paper, we present an implementation work of sensing and actuation capabilities for IoT devices using the oneM2M standard-based platforms. We mainly focus on the heterogeneity of the hardware interfaces employed in IoT devices. For IoT devices (i.e., Internet-connected embedded systems) to perform sensing and actuation capabilities in a standardized manner, a well-designed middleware solution will be a crucial part of IoT platform. Accordingly, we propose an oneM2M standard-based IoT platform (called nCube) incorporated with a set of tiny middleware programs (called TAS) responsible for translating sensing values and actuation commands into oneM2M-defined resources accessible in Web-based applications. All the source codes for the oneM2M middleware platform and smartphone application are available for free in the GitHub repositories. The full details on the implementation work and open-source contributions are described.",
                "authors": [
                    {
                        "name": "Ahn I.-Y."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Yun J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Implementation of sensing and actuation capabilities for IoT devices using oneM2M platforms"
            },
            "pmcid": "PMC6832411",
            "pmid": "31640134"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
