{
    "additionDate": "2019-11-14T19:55:50Z",
    "biotoolsCURIE": "biotools:ViaTherapy",
    "biotoolsID": "ViaTherapy",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "n.hancock@uea.ac.uk",
            "name": "Nicola J Hancock",
            "orcidid": "https://orcid.org/0000-0003-4850-3152",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Evidence-based practice on-the-go', 'rehabilitation' | using ViaTherapy as a tool to enhance clinical decision making in upper limb rehabilitation after stroke | Your browser does not support the video tag | International panel of researchers & clinicians | Saunderson Family Chair in Brain injury Research | ViaTherapy’s tailored questionnaire delivers only the best treatment options based on your patient’s motor impairment and time post-stroke | \"The post stroke arm rehabilitation algorithm within the ViaTherapy app help our team make multidisciplinary clinical decisions. The three key questions leads us as professionals in a quick and easy way through a structure of recommendations for treatments with a clear scope for benefits and dose of therapy.\" Jip F. Kamphuis MSc., Physical Therapist",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.viatherapy.org",
    "lastUpdate": "2019-11-14T19:55:50Z",
    "name": "ViaTherapy",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1136/BMJOQ-2018-000592",
            "metadata": {
                "abstract": "© Author(s) (or their employer(s)) 2019.Recovery of upper limb function after stroke is currently sub-optimal, despite good quality evidence showing that interventions enabling repetitive practice of task-specific activity are effective in improving function. Therapists need to access and engage with such evidence to optimise outcomes with people with stroke, but this is challenging in fast-paced stroke rehabilitation services. This quality improvement project aimed to investigate acceptability and service impact of a new, international tool for accessing evidence on upper limb rehabilitation after stroke - ' ViaTherapy' - in a team of community rehabilitation therapists. Semi-structured interviews were undertaken at baseline to determine confidence in, and barriers to, evidence-based practice (EBP) to support clinical decision making. Reported barriers included time, lack of access to evidence and a research-practice disconnect. The clinicians then integrated use of ' ViaTherapy' into their practice for 4 weeks. Follow-up interviews explored the accessibility of the tool in community rehabilitation practice, and its impact on clinician confidence, treatment planning and provision. Clinicians found the tool, used predominantly in mobile device app format, to be concise and simple to use, providing evidence ' on-the-go'. Confidence in accessing and using EBP grew by 22% from baseline. Clinicans reported changes in intensity of delivery of interventions, as rapid access to recommended doses via the tool was available. Following this work, the participating health and social care service provider changed provision of therapists' technology to enable use of apps. Barriers to use of EBP in stroke rehabilitation persist; the baseline situation here supported the need for more accessible means of integrating best evidence into clinical processes. This quality improvement project successfully integrated ViaTherapy into clinical practice, and found that the tool has potential to underpin positive changes in upper limb therapy service delivery after stroke, by increasing accessibility to, use of and confidence in EBP. Definitive evaluation is now indicated.",
                "authors": [
                    {
                        "name": "Hancock N.J."
                    },
                    {
                        "name": "Collins K."
                    },
                    {
                        "name": "Dorer C."
                    },
                    {
                        "name": "Wolf S.L."
                    },
                    {
                        "name": "Bayley M."
                    },
                    {
                        "name": "Pomeroy V.M."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "BMJ Open Quality",
                "title": "Evidence-based practice ' on-the-go': Using ViaTherapy as a tool to enhance clinical decision making in upper limb rehabilitation after stroke, a quality improvement initiative"
            },
            "pmcid": "PMC6711438",
            "pmid": "31523735"
        }
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ]
}