
{
    "credit": [
        {
            "name": "ExPASy helpdesk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.expasy.org/support"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://glycoproteome.expasy.org/pepsweetener/app/#!/howto"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein modifications",
                "uri": "http://edamontology.org/topic_0601"
            },
            {
                "term": "Structural genomics",
                "uri": "http://edamontology.org/topic_0122"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim Purpose: PepSweetener is a web-based visualization tool designed to facilitate the manual annotation of intact glycopeptides from MS data regardless of the instrument that produced these data. Experimental design: This exploratory tool uses a theoretical glycopeptide dataset to visualize all peptide-glycan combinations that fall within the error range of the query precursor ion. PepSweetener simplifies the determination of the correct peptide and glycan composition of a glycopeptide based on its precursor mass. The theoretical glycopeptide search space can be customized in an advanced query mode that specifies potential proteins/peptides, glycan compositions, and several experimental parameters. Results: PepSweetener displays the results on an interactive heat-map chart where theoretical glycopeptide tile colors correspond to ppm deviations from the query precursor mass. Additionally, a visualization chart incorporates glycan composition filtering, sorting by mass and tolerance, and an in silico peptide fragmentation diagram is provided to further support the correct glycopeptide identification. Conclusions and clinical relevance: PepSweetener efficiently allows the selection of the most probable intact glycopeptide mass matches and speeds up the verification process. It is validated on serum protein samples and immunoglobulins. The tool is publicly hosted on ExPASy, the SIB Swiss Institute of Bioinformatics resource portal (http://glycoproteome.expasy.org/pepsweetener/app/).",
            "authors": [
                "Domagalski M.J.",
                "Alocci D.",
                "Almeida A.",
                "Kolarich D.",
                "Lisacek F."
            ],
            "cit_count": 1,
            "doi": "10.1002/prca.201700069",
            "journal": "Proteomics - Clinical Applications",
            "title": "PepSweetener: A Web-Based Tool to Support Manual Annotation of Intact Glycopeptide MS Spectra",
            "type": "Primary",
            "year": "2018-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pepsweetener",
        "biotoolsID": "pepsweetener",
        "description": "Manual annotation of MS data for intact glycopeptides. It displays an interactive map of all theoretical glycopeptides that match the molecular masses of queried precursor ions. Ion matching can be performed in two modes: simple when the search space spans the combination of all tryptic peptides including N-glycosites in the human proteome, and advanced when the search space is custom-built by specifying peptides and glycans.",
        "homepage": "https://glycoproteome.expasy.org/pepsweetener/app/",
        "name": "PepSweetener"
    }
}