{
    "accessibility": "Open access",
    "additionDate": "2023-09-22T13:56:40.166472Z",
    "biotoolsCURIE": "biotools:sasa_net",
    "biotoolsID": "sasa_net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Tiansu Gong",
            "orcidid": "https://orcid.org/0000-0003-1407-5882"
        }
    ],
    "description": "Spatial-aware self-attention mechanism for building protein 3D structure directly from inter-residue distances.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gongtiansu/SASA-Net/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-09-22T13:56:40.168895Z",
    "license": "MIT",
    "name": "SASA-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TCBB.2023.3240456",
            "metadata": {
                "abstract": "Protein functions are tightly related to the fine details of their 3D structures. To understand protein structures, computational prediction approaches are highly needed. Recently, protein structure prediction has achieved considerable progresses mainly due to the increased accuracy of inter-residue distance estimation and the application of deep learning techniques. Most of the distance-based <italic>ab initio</italic> prediction approaches adopt a two-step diagram: constructing a potential function based on the estimated inter-residue distances, and then build a 3D structure that minimizes the potential function. These approaches have proven very promising; however, they still suffer from several limitations, especially the inaccuracies incurred by the handcrafted potential function. Here, we present SASA-Net, a deep learning-based approach that directly learns protein 3D structure from the estimated inter-residue distances. Unlike the existing approach simply representing protein structures as coordinates of atoms, SASA-Net represents protein structures using pose of residues, i.e., the coordinate system of each individual residue in which all backbone atoms of this residue are fixed. The key element of SASA-Net is a spatial-aware self-attention mechanism, which is able to adjust a residue&#x0027;s pose according to all other residues&#x0027; features and the estimated distances between residues. By iteratively applying the spatial-aware self-attention mechanism, SASA-Net continuously improves the structure and finally acquires a structure with high accuracy. Using the CATH35 proteins as representatives, we demonstrate that SASA-Net is able to accurately and efficiently build structures from the estimated inter-residue distances. The high accuracy and efficiency of SASA-Net enables an end-to-end neural network model for protein structure prediction through combining SASA-Net and an neural network for inter-residue distance prediction. Source code of SASA-Net is available at <uri>https://github.com/gongtiansu/SASA-Net/</uri>",
                "authors": [
                    {
                        "name": "Bu D."
                    },
                    {
                        "name": "Gong T."
                    },
                    {
                        "name": "Ju F."
                    },
                    {
                        "name": "Sun S."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "SASA-Net: A Spatial-aware Self-attention Mechanism for Building Protein 3D Structure Directly from Inter-residue Distances"
            },
            "pmid": "37022274"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
