{
    "additionDate": "2019-11-14T20:06:55Z",
    "biotoolsCURIE": "biotools:Elemental",
    "biotoolsID": "Elemental",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "aali21@hawk.iit.edu",
            "name": "Akram Syed Ali",
            "typeEntity": "Person"
        },
        {
            "email": "brent@iit.edu",
            "name": "Brent Stephens",
            "orcidid": "https://orcid.org/0000-0002-0177-6703",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > HOMEPAGE MISSING! | An Open-Source Wireless Hardware and Software Platform for Building Energy and Indoor Environmental Monitoring and Control | This work demonstrates an open-source hardware and software platform for monitoring the performance of buildings, called Elemental, that is designed to provide data on indoor environmental quality, energy usage, HVAC operation, and other factors to its users. It combines: (i) custom printed circuit boards (PCBs) with RFM69 frequency shift keying (FSK) radio frequency (RF) transceivers for wireless sensors, control nodes, and USB gateway, (ii) a Raspberry Pi 3B with custom firmware acting as either a centralized or distributed backhaul, and (iii) a custom dockerized application for the backend called Brood that serves as the director software managing message brokering via Message Queuing Telemetry Transport (MQTT) protocol using VerneMQ, database storage using InfluxDB, and data visualization using Grafana",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31540360",
    "lastUpdate": "2019-11-14T20:06:55Z",
    "name": "Elemental",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19184017",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.This work demonstrates an open-source hardware and software platform for monitoring the performance of buildings, called Elemental, that is designed to provide data on indoor environmental quality, energy usage, HVAC operation, and other factors to its users. It combines: (i) custom printed circuit boards (PCBs) with RFM69 frequency shift keying (FSK) radio frequency (RF) transceivers for wireless sensors, control nodes, and USB gateway, (ii) a Raspberry Pi 3B with custom firmware acting as either a centralized or distributed backhaul, and (iii) a custom dockerized application for the backend called Brood that serves as the director software managing message brokering via Message Queuing Telemetry Transport (MQTT) protocol using VerneMQ, database storage using InfluxDB, and data visualization using Grafana. The platform is built around the idea of a private, secure, and open technology for the built environment. Among its many applications, the platform allows occupants to investigate anomalies in energy usage, environmental quality, and thermal performance via a comprehensive dashboard with rich querying capabilities. It also includes multiple frontends to view and analyze building activity data, which can be used directly in building controls or to provide recommendations on how to increase operational efficiency or improve operating conditions. Here, we demonstrate three distinct applications of the Elemental platform, including: (1) deployment in a research lab for long-term data collection and automated analysis, (2) use as a full-home energy and environmental monitoring solution, and (3) fault and anomaly detection and diagnostics of individual building systems at the zone-level. Through these applications we demonstrate that the platform allows easy and virtually unlimited datalogging, monitoring, and analysis of real-time sensor data with low setup costs. Low-power sensor nodes placed in abundance in a building can also provide precise and immediate fault-detection, allowing for tuning equipment for more efficient operation and faster maintenance during the lifetime of the building.",
                "authors": [
                    {
                        "name": "Ali A.S."
                    },
                    {
                        "name": "Cote C."
                    },
                    {
                        "name": "Heidarinejad M."
                    },
                    {
                        "name": "Stephens B."
                    }
                ],
                "citationCount": 3,
                "date": "2019-09-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Elemental: An open-source wireless hardware and software platform for building energy and indoor environmental monitoring and control"
            },
            "pmcid": "PMC6767676",
            "pmid": "31540360"
        }
    ],
    "topic": [
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}