{
    "accessibility": "Open access",
    "additionDate": "2024-02-26T08:57:45.374515Z",
    "biotoolsCURIE": "biotools:goodfibes",
    "biotoolsID": "goodfibes",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jessica.arbour@mtsu.edu",
            "name": "J H Arbour",
            "orcidid": "https://orcid.org/0000-0003-4506-158X",
            "typeEntity": "Person"
        }
    ],
    "description": "Detection and reconstruction of muscle fibers from diceCT image data.\nIncludes functions for tracking, smoothing, cleaning, plotting and exporting muscle fibers. Also calculates basic fiber properties (e.g., length and curvature).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Nucleic acid curvature calculation",
                    "uri": "http://edamontology.org/operation_0461"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/GoodFibes",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-02-26T08:57:45.377101Z",
    "license": "GPL-2.0",
    "name": "GoodFibes",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/IOB/OBAD030",
            "metadata": {
                "abstract": "Contrast enhanced computed-tomography imaging like diffusible iodine-based contrast-enhanced computed tomography (diceCT) can provide detailed information on muscle architecture important to comparative analyses of functional morphology, using non-destructive approaches. However, manual segmentation of muscle fascicles/fibers is time-consuming, and automated approaches are at times inaccessible and unaffordable. Here, we introduce GoodFibes, an R package for reconstructing muscle architecture in 3D from diceCT image stacks. GoodFibes uses textural analysis of image grayscale values to track straight or curved fiber paths through a muscle image stack. Accessory functions provide quality checking, fiber merging, and 3D visualization and export capabilities. We demonstrate the utility and effectiveness of GoodFibes using two datasets, from an ant and bat diceCT scans. In both cases, GoodFibes provides reliable measurements of mean fiber length compared to traditional approaches, and is as effective as currently available software packages. This open-source, free to use software package will help to improve access to tools in the analysis of muscle fiber anatomy using diceCT scans. The flexible and transparent R-language environment allows other users to build on the functions described here and permits direct statistical analysis of the resulting fiber metrics. We hope that this will increase the number of comparative and evolutionary studies incorporating these rich and functionally important datasets.",
                "authors": [
                    {
                        "name": "Arbour J.H."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Integrative Organismal Biology",
                "title": "GoodFibes: An R Package for The Detection of Muscle Fibers from diceCT Scans"
            },
            "pmcid": "PMC10461528",
            "pmid": "37644979"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Bioimaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
