
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Gene expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Geriatric medicine",
                "uri": "http://edamontology.org/topic_3399"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "publication": [
        {
            "abstract": "OSCAR is a web platform for cluster and crossspecies analysis of microarray data. It provides a comprehensive but friendly environment to both users and algorithm developers. For users, OSCAR provides cluster tools for both single and multiple species data, together with interactive analysis features. For single species data, OSCAR currently provides Hierarchical Clustering, K-means, partition around medoids (PAM), Self-Organizing Map (SOM), Tight Clustering and a novel algorithm called 'Consensus Tight-clustering'. The new Consensus Tight-clustering algorithm delivers robust gene clusters and its result is more resistant to false positives than other state-of-the-art algorithms. For cross-species data analysis, OSCAR provides two novel computational tools: 'coherentCluster', 'coherentSubset' and a novel visualization tool: 'comparative heatmap'. Applying the coherentCluster algorithm to human and fly aging data, we identified several coherent clusters of genes, which share co-regulation patterns that are highly correlated with the aging process in both of the two species. One coherent cluster suggests insulin receptor (INSR) may regulate Pax6 in both species and across different tissues. Further analysis with human brain expression and pathological data suggests an INSR-<Pax6-<quinone oxidoreductase (NQO1)-<detoxification neuro-protective pathway might be present in aging or diseased brain. For algorithm developers, OSCAR is a plug-and-play platform. With little effort, developers can plug their own algorithms into the OSCAR server without revealing the source codes, which will equip their command line executables with user-friendly interface and interactive analysis capability. In summary, OSCAR initiates an open platform for development and application of clustering and cross-species analysis programs. OSCAR stands for an open system for cluster analysis of microarray data. It is available at: http://biocomp.bioen. uiuc.edu/oscar. © 2007 The Author(s).",
            "authors": [
                "Lu Y.",
                "He X.",
                "Zhong S."
            ],
            "cit_count": 16,
            "journal": "Nucleic Acids Research",
            "pmid": "17545194",
            "title": "Cross-species microarray analysis with the OSCAR system suggests an INSR-<Pax6-<NQO1 neuro-protective pathway in aging and Alzheimer's disease",
            "year": "2007-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:oscar",
        "biotoolsID": "oscar",
        "description": "Platform for cluster analysis of microarray data.",
        "homepage": "http://biocomp.bioen.uiuc.edu/oscar/",
        "name": "OSCAR"
    }
}