{
    "additionDate": "2017-01-17T15:01:41Z",
    "biotoolsCURIE": "biotools:sradb",
    "biotoolsID": "sradb",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "zhujack@mail.nih.gov",
            "name": "Jack Zhu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Sequence Read Archive (SRA) is the largest public repository of sequencing data from the next generation of sequencing platforms including Roche 454 GS System, Illumina Genome Analyzer, Applied Biosystems SOLiD System, Helicos Heliscope, and others. However, finding data of interest can be challenging using current tools. This tool is an attempt to make access to the metadata associated with submission, study, sample, experiment and run much more feasible.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/SRAdb.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/SRAdb_1.32.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/SRAdb.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T16:22:54Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://gbnci.abcc.ncifcrf.gov/sra/"
        }
    ],
    "name": "SRAdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-19",
            "metadata": {
                "abstract": "Background: The Sequence Read Archive (SRA) is the largest public repository of sequencing data from the next generation of sequencing platforms including Illumina (Genome Analyzer, HiSeq, MiSeq, .etc), Roche 454 GS System, Applied Biosystems SOLiD System, Helicos Heliscope, PacBio RS, and others.Results: SRAdb is an attempt to make queries of the metadata associated with SRA submission, study, sample, experiment and run more robust and precise, and make access to sequencing data in the SRA easier. We have parsed all the SRA metadata into a SQLite database that is routinely updated and can be easily distributed. The SRAdb R/Bioconductor package then utilizes this SQLite database for querying and accessing metadata. Full text search functionality makes querying metadata very flexible and powerful. Fastq files associated with query results can be downloaded easily for local analysis. The package also includes an interface from R to a popular genome browser, the Integrated Genomics Viewer.Conclusions: SRAdb Bioconductor package provides a convenient and integrated framework to query and access SRA metadata quickly and powerfully from within R. © 2013 Zhu et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Davis S.R."
                    },
                    {
                        "name": "Meltzer P.S."
                    },
                    {
                        "name": "Stephens R.M."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "citationCount": 57,
                "date": "2013-01-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SRAdb: Query and use public next-generation sequencing data from within R"
            },
            "pmcid": "PMC3560148",
            "pmid": "23323543",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "1.32.0"
    ]
}
