{
    "accessibility": "Open access",
    "additionDate": "2019-05-31T16:18:02Z",
    "biotoolsCURIE": "biotools:EPA-ng",
    "biotoolsID": "EPA-ng",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Pierre Barbera",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/Pbdas"
        }
    ],
    "description": "Complete reimplementation of the evolutionary placement algorithm (EPA) that is substantially faster, offers a distributed memory parallelization, and integrates concepts from both, RAxML-EPA and PPLACER.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Pbdas/epa-ng",
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "AGPL-3.0",
    "maturity": "Mature",
    "name": "EPA-ng",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/sysbio/syy054",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of the Society of Systematic Biologists.Next generation sequencing (NGS) technologies have led to a ubiquity of molecular sequence data. This data avalanche is particularly challenging in metagenetics, which focuses on taxonomic identification of sequences obtained from diverse microbial environments. Phylogenetic placement methods determine how these sequences fit into an evolutionary context. Previous implementations of phylogenetic placement algorithms, such as the evolutionary placement algorithm (EPA) included in RAxML, or PPLACER, are being increasingly used for this purpose. However, due to the steady progress in NGS technologies, the current implementations face substantial scalability limitations. Herein, we present EPA-NG, a complete reimplementation of the EPA that is substantially faster, offers a distributed memory parallelization, and integrates concepts from both, RAxML-EPA and PPLACER. EPA-NG can be executed on standard shared memory, as well as on distributed memory systems (e.g., computing clusters). To demonstrate the scalability of EPA-NG, we placed 1 billion metagenetic reads from the Tara Oceans Project onto a reference tree with 3748 taxa in just under 7 h, using 2048 cores. Our performance assessment shows that EPA-NG outperforms RAxML-EPA and PPLACER by up to a factor of 30 in sequential execution mode, while attaining comparable parallel efficiency on shared memory systems. We further show that the distributed memory parallelization of EPA-NG scales well up to 2048 cores. EPA-NG is available under the AGPLv3 license: https://github.com/Pbdas/epa-ng.",
                "authors": [
                    {
                        "name": "Barbera P."
                    },
                    {
                        "name": "Kozlov A.M."
                    },
                    {
                        "name": "Czech L."
                    },
                    {
                        "name": "Morel B."
                    },
                    {
                        "name": "Darriba D."
                    },
                    {
                        "name": "Flouri T."
                    },
                    {
                        "name": "Stamatakis A."
                    }
                ],
                "citationCount": 64,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "EPA-ng: Massively Parallel Evolutionary Placement of Genetic Sequences"
            },
            "pmcid": "PMC6368480",
            "pmid": "30165689",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}