{
    "additionDate": "2018-07-06T12:21:15Z",
    "biotoolsCURIE": "biotools:xispec",
    "biotoolsID": "xispec",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "lkolbows@ed.ac.uk",
            "name": "Lars Kolbowski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "colin.combe@ed.ac.uk",
            "name": "Colin Combe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "juri.rappsilber@ed.ac.uk",
            "name": "Prof Juri Rappsilber",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Next-generation web-based spectrum viewer for visualizing, analyzing and sharing mass spectrometry data. Allows users to save and share their datasets publicly or password protected for providing access to collaborators or readers and reviewers of manuscripts. The identification table features advanced interaction controls and spectra are presented in three interconnected views: (i) annotated mass spectrum, (ii) peptide sequence fragmentation key and (iii) quality control error plots of matched fragments.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://spectrumviewer.org/examples.php"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://spectrumviewer.org/help.php"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "https://spectrumviewer.org",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2019-07-02T16:33:26Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Rappsilber-Laboratory/xiSPEC_website"
        }
    ],
    "name": "xiSPEC",
    "owner": "lars-kolbowski",
    "publication": [
        {
            "doi": "10.1093/nar/gky353",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.We present xiSPEC, a standard compliant, next-generation web-based spectrum viewer for visualizing, analyzing and sharing mass spectrometry data. Peptide-spectrum matches from standard proteomics and cross-linking experiments are supported. xiSPEC is to date the only browser-based tool supporting the standardized file formats mzML and mzIdentML defined by the proteomics standards initiative. Users can either upload data directly or select files from the PRIDE data repository as input. xiSPEC allows users to save and share their datasets publicly or password protected for providing access to collaborators or readers and reviewers of manuscripts. The identification table features advanced interaction controls and spectra are presented in three interconnected views: (i) annotated mass spectrum, (ii) peptide sequence fragmentation key and (iii) quality control error plots of matched fragments. Highlighting or selecting data points in any view is represented in all other views. Views are interactive scalable vector graphic elements, which can be exported, e.g. for use in publication. xiSPEC allows for re-annotation of spectra for easy hypothesis testing by modifying input data. xiSPEC is freely accessible at http://spectrumviewer.org and the source code is openly available on https://github.com/Rappsilber-Laboratory/xiSPEC.",
                "authors": [
                    {
                        "name": "Kolbowski L."
                    },
                    {
                        "name": "Combe C."
                    },
                    {
                        "name": "Rappsilber J."
                    }
                ],
                "citationCount": 18,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "XiSPEC: Web-based visualization, analysis and sharing of proteomics data"
            }
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}