{
    "additionDate": "2021-01-18T10:57:17Z",
    "biotoolsCURIE": "biotools:relics",
    "biotoolsID": "relics",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pfiaux@ucsd.edu",
            "name": "Patrick C. Fiaux",
            "orcidid": "https://orcid.org/0000-0001-9614-7370",
            "typeEntity": "Person"
        },
        {
            "email": "gmcvicker@salk.edu",
            "name": "Graham McVicker",
            "orcidid": "https://orcid.org/0000-0003-0991-0951",
            "typeEntity": "Person"
        }
    ],
    "description": "Discovering functional sequences with RELICS.\n\nRELICS ✨: Regulatory Element Location Identification in CRISPR screens.\n\nRELICS is an analysis method for discovering functional sequences from tiling CRISPR screens. The current version (v.2.0) of RELICS uses a Bayesian hierarchical model and considers the overlapping effects of multiple guides, can jointly analyze multiple pools per replicate, and estimates the number of functional sequences supported by the data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/patfiaux/RELICS",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-06T12:44:02Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://figshare.com/projects/RELICS_2_data/74376"
        }
    ],
    "name": "RELICS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008194",
            "metadata": {
                "abstract": "© 2020 Fiaux et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.CRISPR screens are a powerful technology for the identification of genome sequences that affect cellular phenotypes such as gene expression, survival, and proliferation. By targeting non-coding sequences for perturbation, CRISPR screens have the potential to systematically discover novel functional sequences, however, a lack of purpose-built analysis tools limits the effectiveness of this approach. Here we describe RELICS, a Bayesian hierarchical model for the discovery of functional sequences from CRISPR screens. RELICS specifically addresses many of the challenges of non-coding CRISPR screens such as the unknown locations of functional sequences, overdispersion in the observed single guide RNA counts, and the need to combine information across multiple pools in an experiment. RELICS outperforms existing methods with higher precision, higher recall, and finer-resolution predictions on simulated datasets. We apply RELICS to published CRISPR interference and CRISPR activation screens to predict and experimentally validate novel regulatory sequences that are missed by other analysis methods. In summary, RELICS is a powerful new analysis method for CRISPR screens that enables the discovery of functional sequences with unprecedented resolution and accuracy.",
                "authors": [
                    {
                        "name": "Fiaux P.C."
                    },
                    {
                        "name": "Chen H.V."
                    },
                    {
                        "name": "Chen P.B."
                    },
                    {
                        "name": "Chen A.R."
                    },
                    {
                        "name": "McVicker G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Discovering functional sequences with RELICS, an analysis method for CRISPR screens"
            },
            "pmcid": "PMC7521704",
            "pmid": "32936799"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}