
{
    "credit": [
        {
            "email": "wencke.walter@arcor.de",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://wencke.github.io/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/goplot-visualization-of-functional-analysis-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press.Summary: Despite the plethora of methods available for the functional analysis of omics data, obtaining comprehensive-yet detailed understanding of the results remains challenging. This is mainly due to the lack of publicly available tools for the visualization of this type of information. Here we present an R package called GOplot, based on ggplot2, for enhanced graphical representation. Our package takes the output of any general enrichment analysis and generates plots at different levels of detail: from a general overview to identify the most enriched categories (bar plot, bubble plot) to a more detailed view displaying different types of information for molecules in a given set of categories (circle plot, chord plot, cluster plot). The package provides a deeper insight into omics data and allows scientists to generate insightful plots with only a few lines of code to easily communicate the findings.",
            "authors": [
                "Walter W.",
                "Sanchez-Cabo F.",
                "Ricote M."
            ],
            "cit_count": 90,
            "journal": "Bioinformatics",
            "pmid": "25964631",
            "title": "GOplot: An R package for visually combining expression data with functional analysis",
            "year": "2015-02-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:goplot",
        "biotoolsID": "goplot",
        "description": "R package for implementation of multilayered visualizations for enhanced graphical representation of functional analysis data.",
        "homepage": "https://wencke.github.io/",
        "name": "GOplot"
    }
}