{
    "additionDate": "2021-01-18T08:58:28Z",
    "biotoolsCURIE": "biotools:passion",
    "biotoolsID": "passion",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fuyi.li1@monash.edu",
            "name": "Fuyi Li",
            "typeEntity": "Person"
        },
        {
            "email": "Jiangning.Song@monash.edu",
            "name": "Jiangning Song",
            "typeEntity": "Person"
        }
    ],
    "description": "PASSION is an ensemble neural network approach for identifying the binding sites of RBPs on circRNAs.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://flagship.erc.monash.edu/PASSION/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "http://flagship.erc.monash.edu/PASSION/",
    "lastUpdate": "2021-01-22T18:00:33Z",
    "name": "PASSION",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA522",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: Different from traditional linear RNAs (containing 50 and 30 ends), circular RNAs (circRNAs) are a special type of RNAs that have a closed ring structure. Accumulating evidence has indicated that circRNAs can directly bind proteins and participate in a myriad of different biological processes. Results: For identifying the interaction of circRNAs with 37 different types of circRNA-binding proteins (RBPs), we develop an ensemble neural network, termed PASSION, which is based on the concatenated artificial neural network (ANN) and hybrid deep neural network frameworks. Specifically, the input of the ANN is the optimal feature subset for each RBP, which has been selected from six types of feature encoding schemes through incremental feature selection and application of the XGBoost algorithm. In turn, the input of the hybrid deep neural network is a stacked codon-based scheme. Benchmarking experiments indicate that the ensemble neural network reaches the average best area under the curve (AUC) of 0.883 across the 37 circRNA datasets when compared with XGBoost, k-nearest neighbor, support vector machine, random forest, logistic regression and Naive Bayes. Moreover, each of the 37 RBP models is extensively tested by performing independent tests, with the varying sequence similarity thresholds of 0.8, 0.7, 0.6 and 0.5, respectively. The corresponding average AUC obtained are 0.883, 0.876, 0.868 and 0.883, respectively, highlighting the effectiveness and robustness of PASSION. Extensive benchmarking experiments demonstrate that PASSION achieves a competitive performance for identifying binding sites between circRNA and RBPs, when compared with several state-of-the-art methods. Availability and implementation: A user-friendly web server of PASSION is publicly accessible at http://flagship.erc.monash.edu/PASSION/.",
                "authors": [
                    {
                        "name": "Jia C."
                    },
                    {
                        "name": "Bi Y."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Leier A."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Song J."
                    }
                ],
                "citationCount": 10,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PASSION: An ensemble neural network approach for identifying the binding sites of RBPs on circRNAs"
            },
            "pmid": "32426818"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}