{
    "additionDate": "2019-11-14T19:38:24Z",
    "biotoolsCURIE": "biotools:BITACORA",
    "biotoolsID": "BITACORA",
    "confidence_flag": "tool",
    "description": "A comprehensive tool for the identification and annotation of gene families in genome assemblies | BITACORA: A Bioinformatics tool for gene family annotation | Genome annotation is a critical bottleneck in genomic research, especially for the rigorous and comprehensive study of gene families in the genomes of non-model organisms | BITACORA: A pipeline for the identification and annotation of gene families in genome assemblies | Genome annotation is a critical bottleneck in genomic research, especially for the rigorous and comprehensive study of gene families",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "http://www.ub.edu/softevol/bitacora",
    "language": [
        "Shell",
        "Perl"
    ],
    "lastUpdate": "2020-12-09T14:16:33Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/molevol-ub/bitacora"
        }
    ],
    "name": "BITACORA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/593889"
        },
        {
            "doi": "10.1111/1755-0998.13202",
            "metadata": {
                "abstract": "© 2020 John Wiley & Sons LtdGene annotation is a critical bottleneck in genomic research, especially for the comprehensive study of very large gene families in the genomes of nonmodel organisms. Despite the recent progress in automatic methods, state-of-the-art tools used for this task often produce inaccurate annotations, such as fused, chimeric, partial or even completely absent gene models for many family copies, errors that require considerable extra efforts to be corrected. Here we present bitacora, a bioinformatics solution that integrates popular sequence similarity-based search tools and Perl scripts to facilitate both the curation of these inaccurate annotations and the identification of previously undetected gene family copies directly in genomic DNA sequences. We tested the performance of bitacora in annotating the members of two chemosensory gene families with different repertoire size in seven available genome sequences, and compared its performance with that of augustus-ppx, a tool also designed to improve automatic annotations using a sequence similarity-based approach. Despite the relatively high fragmentation of some of these drafts, bitacora was able to improve the annotation of many members of these families and detected thousands of new chemoreceptors encoded in genome sequences. The program creates general feature format (GFF) files, with both curated and newly identified gene models, and FASTA files with the predicted proteins. These outputs can be easily integrated in genomic annotation editors, greatly facilitating subsequent manual annotation and downstream evolutionary analyses.",
                "authors": [
                    {
                        "name": "Vizueta J."
                    },
                    {
                        "name": "Sanchez-Gracia A."
                    },
                    {
                        "name": "Rozas J."
                    }
                ],
                "citationCount": 3,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "bitacora: A comprehensive tool for the identification and annotation of gene families in genome assemblies"
            },
            "pmid": "32492257"
        }
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}