{"credit":[{"name":"Hai-Son Le","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cs.cmu.edu/~hple/contact.html"},{"email":"maschulz@cs.cmu.edu","name":"Marcel H. Schulz","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"zivbj@cs.cmu.edu","name":"Ziv Bar-Joseph","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://sb.cs.cmu.edu/seecer/downloads/manual.pdf"}],"function":[{"operation":[{"term":"Sequencing error detection","uri":"http://edamontology.org/operation_3195"}]}],"labels":{"language":["C"],"maturity":"Mature","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Data quality management","uri":"http://edamontology.org/topic_3572"}]},"publication":[{"abstract":"Sequencing of RNAs (RNA-Seq) has revolutionized the field of transcriptomics, but the reads obtained often contain errors. Read error correction can have a large impact on our ability to accurately assemble transcripts. This is especially true for de novo transcriptome analysis, where a reference genome is not available. Current read error correction methods, developed for DNA sequence data, cannot handle the overlapping effects of non-uniform abundance, polymorphisms and alternative splicing. Here we present SEquencing Error CorrEction in Rna-seq data (SEECER), a hidden Markov Model (HMM)-based method, which is the first to successfully address these problems. SEECER efficiently learns hundreds of thousands of HMMs and uses these to correct sequencing errors. Using human RNA-Seq data, we show that SEECER greatly improves on previous methods in terms of quality of read alignment to the genome and assembly accuracy. To illustrate the usefulness of SEECER for de novo transcriptome studies, we generated new RNA-Seq data to study the development of the sea cucumber Parastichopus parvimensis. Our corrected assembled transcripts shed new light on two important stages in sea cucumber development. Comparison of the assembled transcripts to known transcripts in other species has also revealed novel transcripts that are unique to sea cucumber, some of which we have experimentally validated. © 2013 The Author(s) 2013.","authors":["Le H.-S.","Schulz M.H.","Mccauley B.M.","Hinman V.F.","Bar-Joseph Z."],"cit_count":41,"journal":"Nucleic Acids Research","pmid":"23558750","title":"Probabilistic error correction for RNA sequencing","year":"2013-05-01"}],"summary":{"biotoolsCURIE":"biotools:seecer","biotoolsID":"seecer","description":"Sequence error correction for RNA-Seq data.","homepage":"http://sb.cs.cmu.edu/seecer/","name":"SEECER"}}