
{
    "credit": [
        {
            "email": "hingamp@tagc.univ-mrs.fr",
            "name": "P.Hingamp",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://tagc.univ-mrs.fr/tagc/"
        }
    ],
    "documentation": [
        {
            "url": "http://tagc.univ-mrs.fr/bioinformatics/maf/MAF_User_Manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "SQL",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/maf-lims-extended-support-nylon-based-microarrays.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: High throughput gene expression profiling (GEP) is becoming a routine technique in life science laboratories. With experimental designs that repeatedly span thousands of genes and hundreds of samples, relying on a dedicated database infrastructure is no longer an option. GEP technology is a fast moving target, with new approaches constantly broadening the field diversity. This technology heterogeneity, compounded by the informatics complexity of GEP databases, means that software developments have so far focused on mainstream techniques, leaving less typical yet established techniques such as Nylon microarrays at best partially supported. Results: MAF (MicroArray Facility) is the laboratory database system we have developed for managing the design, production and hybridization of spotted microarrays. Although it can support the widely used glass microarrays and oligo-chips, MAF was designed with the specific idiosyncrasies of Nylon based microarrays in mind. Notably single channel radioactive probes, microarray stripping and reuse, vector control hybridizations and spike-in controls are all natively supported by the software suite. MicroArray Facility is MIAME supportive and dynamically provides feedback on missing annotations to help users estimate effective MIAME compliance. Genomic data such as clone identifiers and gene symbols are also directly annotated by MAF software using standard public resources. The MAGE-ML data format is implemented for full data export. Journalized database operations (audit tracking), data anonymization, material traceability and user/project level confidentiality policies are also managed by MAF. Conclusion: MicroArray Facility is a complete data management system for microarray producers and end-users. Particular care has been devoted to adequately model Nylon based microarrays. The MAF system, developed and implemented in both private and academic environments, has proved a robust solution for shared facilities and industry service providers alike. © 2006 Honoré et al; licensee BioMed Central Ltd.",
            "authors": [
                "Honore P.",
                "Granjeaud S.",
                "Tagett R.",
                "Deraco S.",
                "Beaudoing E.",
                "Rougemont J.",
                "Debono S.",
                "Hingamp P."
            ],
            "cit_count": 6,
            "journal": "BMC Genomics",
            "pmid": "16987406",
            "title": "MicroArray Facility: A laboratory information management system with extended support for Nylon based technologies",
            "year": "2006-09-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:maf",
        "biotoolsID": "maf",
        "description": "Laboratory database system we have developed for managing the design, production and hybridization of spotted microarrays. Although it supports the widely used glass microarrays and oligo-chips, it was designed with the specific idiosyncrasies of Nylon based microarrays in mind.",
        "homepage": "http://tagc.univ-mrs.fr/bioinformatics/maf/",
        "name": "MAF"
    }
}