{
    "additionDate": "2019-11-14T19:41:08Z",
    "biotoolsCURIE": "biotools:DMPfold",
    "biotoolsID": "DMPfold",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "d.t.jones@ucl.ac.uk",
            "name": "David T. Jones",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep learning extends de novo protein modelling coverage of genomes using iteratively predicted structural constraints | Extending genome-scale de novo protein modelling coverage using iterative deep learning-based prediction of structural constraints | See our paper in Nature Communications for more. Please cite the paper if you use DMPfold | You can also run DMPfold via the PSIPRED web server. This is a good way to get models for a few sequences, but if you want to run DMPfold on many sequences we strongly recommend you run it locally. The server version of DMPfold has restrictions on run time and uses parameters that give faster runs, so should not be used to benchmark DMPfold",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/psipred/DMPfold",
    "language": [
        "Shell",
        "Python",
        "C"
    ],
    "lastUpdate": "2020-12-22T09:07:16Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/psipred/DMPfold/issues"
        }
    ],
    "name": "DMPfold",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41467-019-11994-0",
            "metadata": {
                "abstract": "© 2019, The Author(s).The inapplicability of amino acid covariation methods to small protein families has limited their use for structural annotation of whole genomes. Recently, deep learning has shown promise in allowing accurate residue-residue contact prediction even for shallow sequence alignments. Here we introduce DMPfold, which uses deep learning to predict inter-atomic distance bounds, the main chain hydrogen bond network, and torsion angles, which it uses to build models in an iterative fashion. DMPfold produces more accurate models than two popular methods for a test set of CASP12 domains, and works just as well for transmembrane proteins. Applied to all Pfam domains without known structures, confident models for 25% of these so-called dark families were produced in under a week on a small 200 core cluster. DMPfold provides models for 16% of human proteome UniProt entries without structures, generates accurate models with fewer than 100 sequences in some cases, and is freely available.",
                "authors": [
                    {
                        "name": "Greener J.G."
                    },
                    {
                        "name": "Kandathil S.M."
                    },
                    {
                        "name": "Jones D.T."
                    }
                ],
                "citationCount": 18,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Nature Communications",
                "title": "Deep learning extends de novo protein modelling coverage of genomes using iteratively predicted structural constraints"
            },
            "pmcid": "PMC6726615",
            "pmid": "31484923"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}