
{
    "credit": [
        {
            "email": "khaledur@cse.uiu.ac.bd",
            "name": "Md. Khaledur Rahman",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "msrahman@cse.buet.ac.bd",
            "name": "M. Sohel Rahman",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/khaled-rahman/CRISPRpred/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell",
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Rahman, Rahman. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The CRISPR/Cas9-sgRNA system has recently become a popular tool for genome editing and a very hot topic in the field of medical research. In this system, Cas9 protein is directed to a desired location for gene engineering and cleaves target DNA sequence which is complementary to a 20-nucleotide guide sequence found within the sgRNA. A lot of experimental efforts, ranging from in vivo selection to in silico modeling, have been made for efficient designing of sgRNAs in CRISPR/Cas9 system. In this article, we present a novel tool, called CRISPRpred, for efficient in silico prediction of sgRNAs on-target activity which is based on the applications of Support Vector Machine (SVM) model. To conduct experiments, we have used a benchmark dataset of 17 genes and 5310 guide sequences where there are only 20% true values. CRISPRpred achieves Area Under Receiver Operating Characteristics Curve (AUROC-Curve), Area Under Precision Recall Curve (AUPR-Curve) and maximum Matthews Correlation Coefficient (MCC) as 0.85, 0.56 and 0.48, respectively. Our tool shows approximately 5% improvement in AUPR-Curve and after analyzing all evaluation metrics, we find that CRISPRpred is better than the current state-of-the-art. CRISPRpred is enough flexible to extract relevant features and use them in a learning algorithm. The source code of our entire software with relevant dataset can be found in the following link: https://github.com/khaled-buet/CRISPRpred.",
            "authors": [
                "Rahman M.K.",
                "Rahman M.S."
            ],
            "cit_count": 4,
            "doi": "10.1371/journal.pone.0181943",
            "journal": "PLoS ONE",
            "title": "CRISPRpred: A flexible and efficient tool for sgRNAs on-target activity prediction in CRISPR/Cas9 systems",
            "type": "Primary",
            "year": "2017-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:crisprpred",
        "biotoolsID": "crisprpred",
        "description": "Flexible and efficient tool for single guide RNA (sgRNAs) on-target activity prediction in CRISPR/Cas9 systems.",
        "homepage": "https://github.com/khaled-rahman/CRISPRpred",
        "name": "CRISPRpred"
    }
}