{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:10:39Z",
    "biotoolsCURIE": "biotools:MiStImm",
    "biotoolsID": "MiStImm",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kerepesi@sztaki.hu",
            "name": "Csaba Kerepesi",
            "orcidid": "https://orcid.org/0000-0001-9541-246X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Agent-based simulation tool to study the self-nonself discrimination of the adaptive immune response.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/kerepesi/MiStImm/blob/master/README.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kerepesi/mistimm",
    "language": [
        "C",
        "Perl",
        "Pascal"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/kerepesi/mistimm/issues"
        }
    ],
    "maturity": "Mature",
    "name": "MiStImm",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12976-019-0105-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: There is an increasing need for complex computational models to perform in silico experiments as an adjunct to in vitro and in vivo experiments in immunology. We introduce Microscopic Stochastic Immune System Simulator (MiStImm), an agent-based simulation tool, that is designed to study the self-nonself discrimination of the adaptive immune system. MiStImm can simulate some components of the humoral adaptive immune response, including T cells, B cells, antibodies, danger signals, interleukins, self cells, foreign antigens, and the interactions among them. The simulation starts after conception and progresses step by step (in time) driven by random simulation events. We also have provided tools to visualize and analyze the output of the simulation program. Results: As the first application of MiStImm, we simulated two different immune models, and then we compared performances of them in the mean of self-nonself discrimination. The first model is a so-called conventional immune model, and the second model is based on our earlier T-cell model, called \"one-signal model\", which is developed to resolve three important paradoxes of immunology. Our new T-cell model postulates that a dynamic steady state coupled system is formed through low-affinity complementary TCR-MHC interactions between T cells and host cells. The new model implies that a significant fraction of the naive polyclonal T cells is recruited into the first line of defense against an infection. Simulation experiments using MiStImm have shown that the computational realization of the new model shows real patterns. For example, the new model develops immune memory and it does not develop autoimmune reaction despite the hypothesized, enhanced TCR-MHC interaction between T cells and self cells. Simulations also demonstrated that our new model gives better results to overcome a critical primary infection answering the paradox \"how can a tiny fraction of human genome effectively compete with a vastly larger pool of mutating pathogen DNA?\" Conclusion: The outcomes of our in silico experiments, presented here, are supported by numerous clinical trial observations from the field of immunotherapy. We hope that our results will encourage investigations to make in vitro and in vivo experiments clarifying questions about self-nonself discrimination of the adaptive immune system. We also hope that MiStImm or some concept in it will be useful to other researchers who want to implement or compare other immune models.",
                "authors": [
                    {
                        "name": "Kerepesi C."
                    },
                    {
                        "name": "Bakacs T."
                    },
                    {
                        "name": "Szabados T."
                    }
                ],
                "date": "2019-05-02T00:00:00Z",
                "journal": "Theoretical Biology and Medical Modelling",
                "title": "MiStImm: An agent-based simulation tool to study the self-nonself discrimination of the adaptive immune response"
            },
            "pmcid": "PMC6498635",
            "pmid": "31046789",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ]
}