{"credit":[{"email":"cwtung@kmu.edu.tw","name":"Chun-Wei Tung","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://cwtung.kmu.edu.tw/skinsensdb/"}],"function":[{"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"toolType":["Database portal"],"topic":[{"term":"Cheminformatics","uri":"http://edamontology.org/topic_2258"},{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"},{"term":"Synthetic chemistry","uri":"http://edamontology.org/topic_3371"},{"term":"Physiology","uri":"http://edamontology.org/topic_3300"}]},"publication":[{"abstract":"© 2017 The Author(s). Skin sensitization is an important toxicological endpoint for chemical hazard determination and safety assessment. Prediction of chemical skin sensitizer had traditionally relied on data from rodent models. The development of the adverse outcome pathway (AOP) and associated alternative in vitro assays have reshaped the assessment of skin sensitizers. The integration of multiple assays as key events in the AOP has been shown to have improved prediction performance. Current computational models to predict skin sensitization mainly based on in vivo assays without incorporating alternative in vitro assays. However, there are few freely available databases integrating both the in vivo and the in vitro skin sensitization assays for development of AOP-based skin sensitization prediction models. To facilitate the development of AOP-based prediction models, a skin sensitization database named SkinSensDB has been constructed by curating data from published AOP-related assays. In addition to providing datasets for developing computational models, SkinSensDB is equipped with browsing and search tools which enable the assessment of new compounds for their skin sensitization potentials based on data from structurally similar compounds. SkinSensDB is publicly available at http://cwtung.kmu.edu.tw/skinsensdb .","authors":["Wang C.-C.","Lin Y.-C.","Wang S.-S.","Shih C.","Lin Y.-H.","Tung C.-W."],"cit_count":3,"doi":"10.1186/s13321-017-0194-2","journal":"Journal of Cheminformatics","title":"SkinSensDB: a curated database for skin sensitization assays","year":"2017-01-31"}],"summary":{"biotoolsCURIE":"biotools:skinsensdb","biotoolsID":"skinsensdb","description":"Curated database for skin sensitization assays.","homepage":"http://cwtung.kmu.edu.tw/skinsensdb","name":"SkinSensDB"}}