{
    "additionDate": "2023-08-01T22:03:48.663318Z",
    "biotoolsCURIE": "biotools:odoractor",
    "biotoolsID": "odoractor",
    "collectionID": [
        "gpcr"
    ],
    "description": "ODORactor is an open access web server aimed at providing a platform for identifying odorant receptors (ORs) for small molecules and for browsing existing OR-ligand pairs. It enables the prediction of ORs from the molecular structures of arbitrary chemicals by integrating two individual functionalities: odorant verification and OR recognition.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://mdl.shsmu.edu.cn/ODORactor/",
    "lastUpdate": "2024-02-14T09:45:30.806769Z",
    "name": "ODORactor",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr385",
            "metadata": {
                "abstract": "Summary: ODORactor is an open access web server aimed at providing a platform for identifying odorant receptors (ORs) for small molecules and for browsing existing OR-ligand pairs. It enables the prediction of ORs from the molecular structures of arbitrary chemicals by integrating two individual functionalities: odorant verification and OR recognition. The prediction of the ORs for several odorants was experimentally validated in the study. In addition, ODORactor features a comprehensive repertoire of olfactory information that has been manually curated from literature. Therefore, ODORactor may provide an effective way to decipher olfactory coding and could be a useful server tool for both basic olfaction research in academia and for odorant discovery in industry. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Huang Z."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Pan Y."
                    },
                    {
                        "name": "Shi T."
                    },
                    {
                        "name": "Su X."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Wu L."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang R."
                    },
                    {
                        "name": "Zhuang H."
                    }
                ],
                "citationCount": 25,
                "date": "2011-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ODORactor: A web server for deciphering olfactory coding"
            }
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
