{"credit":[{"email":"wjh1987@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://ci.smu.edu.cn/GenCLiP2/GenCLiP2_Tutorial.html"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Data mining","uri":"http://edamontology.org/topic_3473"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/genclip-2-0-human-gene-function-network-analysis.html"}],"publication":[{"abstract":"Summary: Identifying biological functions and molecular networks in a gene list and how the genes may relate to various topics is of considerable value to biomedical researchers. Here, we present a web-based text-mining server, GenCLiP 2.0, which can analyze human genes with enriched keywords and molecular interactions. Compared with other similar tools, GenCLiP 2.0 offers two unique features: (i) analysis of gene functions with free terms (i.e. any terms in the literature) generated by literature mining or provided by the user and (ii) accurate identification and integration of comprehensive molecular interactions from Medline abstracts, to construct molecular networks and subnetworks related to the free terms. © The Author 2014. Published by Oxford University Press. All rights reserved.","authors":["Wang J.-H.","Zhao L.-F.","Lin P.","Su X.-R.","Chen S.-J.","Huang L.-Q.","Wang H.-F.","Zhang H.","Hu Z.-F.","Yao K.-T.","Huang Z.-X."],"cit_count":25,"journal":"Bioinformatics","pmid":"24764463","title":"GenCLiP 2.0: A web server for functional clustering of genes and construction of molecular networks based on free terms","year":"2014-09-01"}],"summary":{"biotoolsCURIE":"biotools:genclip","biotoolsID":"genclip","description":"Literature mining tool that can cluster a list of genes with keywords that are auto-extracted from their up-to-date related literature and then manually curated by the user. It can also generate a group of negative control genes and a group of positive control genes for comparing the cluster results with the analyzed genes to filter out un-specific keywords.","homepage":"http://ci.smu.edu.cn","name":"GenCLiP"}}