{
    "additionDate": "2021-01-18T11:04:28Z",
    "biotoolsCURIE": "biotools:terminformer",
    "biotoolsID": "terminformer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "prayag.tiwari@unipd.it",
            "name": "Prayag Tiwari",
            "orcidid": "https://orcid.org/0000-0002-2851-4260",
            "typeEntity": "Person"
        },
        {
            "email": "mshossain@ksu.edu.sa",
            "name": "M. Shamim Hossain",
            "orcidid": "https://orcid.org/0000-0001-5906-9422",
            "typeEntity": "Person"
        }
    ],
    "description": "unsupervised term mining and analysis in biomedical literature.\n\nTerminology is the most basic information that researchers and literature analysis systems need to understand. Mining terms and revealing the semantic relationships between terms can help biomedical researchers find solutions to some major health problems and motivate researchers to explore innovative biomedical research issues. However, how to mine terms from biomedical literature remains a challenge. At present, the research on text segmentation in natural language processing (NLP) technology has not been well applied in the biomedical field. Named entity recognition models usually require a large amount of training corpus, and the types of entities that the model can recognize are limited. Besides, dictionary-based methods mainly use pre-established vocabularies to match the text. However, this method can only match terms in a specific field, and the process of collecting terms is time-consuming and labour-intensive",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/prayagtiwari/TermInformer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-27T08:52:26Z",
    "name": "TermInformer",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1007/S00521-020-05335-2",
            "metadata": {
                "abstract": "© 2020, Springer-Verlag London Ltd., part of Springer Nature.Terminology is the most basic information that researchers and literature analysis systems need to understand. Mining terms and revealing the semantic relationships between terms can help biomedical researchers find solutions to some major health problems and motivate researchers to explore innovative biomedical research issues. However, how to mine terms from biomedical literature remains a challenge. At present, the research on text segmentation in natural language processing (NLP) technology has not been well applied in the biomedical field. Named entity recognition models usually require a large amount of training corpus, and the types of entities that the model can recognize are limited. Besides, dictionary-based methods mainly use pre-established vocabularies to match the text. However, this method can only match terms in a specific field, and the process of collecting terms is time-consuming and labour-intensive. Many scenarios faced in the field of biomedical research are unsupervised, i.e. unlabelled corpora, and the system may not have much prior knowledge. This paper proposes the TermInformer project, which aims to mine the meaning of terms in an open fashion by calculating terms and find solutions to some of the significant problems in our society. We propose an unsupervised method that can automatically mine terms in the text without relying on external resources. Our method can generally be applied to any document data. Combined with the word vector training algorithm, we can obtain reusable term embeddings, which can be used in any NLP downstream application. This paper compares term embeddings with existing word embeddings. The results show that our method can better reflect the semantic relationship between terms. Finally, we use the proposed method to find potential factors and treatments for lung cancer, breast cancer, and coronavirus.",
                "authors": [
                    {
                        "name": "Tiwari P."
                    },
                    {
                        "name": "Uprety S."
                    },
                    {
                        "name": "Dehdashti S."
                    },
                    {
                        "name": "Hossain M.S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Neural Computing and Applications",
                "title": "TermInformer: unsupervised term mining and analysis in biomedical literature"
            },
            "pmcid": "PMC7494250",
            "pmid": "32958982"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}