{
    "additionDate": "2018-06-07T15:51:57Z",
    "biotoolsCURIE": "biotools:sinchet",
    "biotoolsID": "sinchet",
    "credit": [
        {
            "email": "ann.chen@moffitt.org",
            "name": "Y. Ann Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Toolbox for single cell heterogeneity analysis in cancer.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://labpages2.moffitt.org/media/3370/sinchet-user-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                }
            ]
        }
    ],
    "homepage": "http://labpages2.moffitt.org/chen/software/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "SinCHet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx297",
            "metadata": {
                "abstract": "© 2017 The Author.Summary: Single-cell technologies allow characterization of transcriptomes and epigenomes for individual cells under different conditions and provide unprecedented resolution for researchers to investigate cellular heterogeneity in cancer. The SinCHet (Single Cell Heterogeneity) toolbox is developed in MATLAB and has a graphical user interface (GUI) for visualization and user interaction. It analyzes both continuous (e.g. mRNA expression) and binary omics data (e.g. discretized methylation data). The toolbox does not only quantify cellular heterogeneity using Shannon Profile (SP) at different clonal resolutions but also detects heterogeneity differences using a D statistic between two populations. It is defined as the area under the Profile of Shannon Difference (PSD). This flexible tool provides a default clonal resolution using the change point of PSD detected by multivariate adaptive regression splines model; it also allows user-defined clonal resolutions for further investigation. This tool provides insights into emerging or disappearing clones between conditions, and enables the prioritization of biomarkers for follow-up experiments based on heterogeneity or marker differences between and/or within cell populations. Availability and implementation: The SinCHet software is freely available for non-profit academic use. The source code, example datasets, and the compiled package are available at http://lab pages2.moffitt.org/chen/software/.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Smalley I."
                    },
                    {
                        "name": "Schell M.J."
                    },
                    {
                        "name": "Smalley K.S.M."
                    },
                    {
                        "name": "Ann Chen Y."
                    }
                ],
                "citationCount": 6,
                "date": "2017-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SinCHet: A MATLAB toolbox for single cell heterogeneity analysis in cancer"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        }
    ],
    "validated": 1
}