{
    "accessibility": "Open access",
    "additionDate": "2021-11-11T20:48:42.653317Z",
    "biotoolsCURIE": "biotools:know-me",
    "biotoolsID": "know-me",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "g.wang-2@tudelft.nl",
            "name": "Gubing Wang",
            "orcidid": "https://orcid.org/0000-0003-4847-534X",
            "typeEntity": "Person"
        },
        {
            "name": "Armagan Albayrak"
        },
        {
            "name": "Eef Hogervorst"
        },
        {
            "name": "Tischa J. M. van der Cammen"
        }
    ],
    "description": "A Toolkit for Designing Personalised Dementia Care.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://designfordementia.squarespace.com/user-manual"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://designfordementia.squarespace.com",
    "lastUpdate": "2021-11-11T20:48:42.655851Z",
    "name": "Know-me",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/IJERPH18115662",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Personalisation is a crucial element in providing person-centred care for people with de-mentia. This paper presents the development and evaluation of a design toolkit to facilitate the work of designers and healthcare professionals in personalising dementia care. This toolkit, named “Know-me”, was grounded in the findings of Ergonomics in Aging, Co-design, and Data-enabled Design, derived from literature review and from the field during a four-year doctorate project. “Know-me” was designed to be easily accessible, flexible, and engaging, providing concrete and hands-on guidance for designers and healthcare professionals to use in designing for personalised dementia care. A proof-of-concept evaluation of the “Know-me” toolkit was conducted via student projects on design for dementia care. During this process, we found that “Know-me” could be adapted flexibly so that the care team could use some of the tools by themselves. A feature-by-feature comparison of the “Know-me” toolkit with similar state-of-the-art toolkits was conducted, and based upon this, the strengths and weaknesses of the “Know-me” toolkit are discussed. This preliminary study indicates that the “Know-me” toolkit is a helpful addition to the current pool of toolkits on designing for dementia care.",
                "authors": [
                    {
                        "name": "Albayrak A."
                    },
                    {
                        "name": "Hogervorst E."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "van der Cammen T.J.M."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "International Journal of Environmental Research and Public Health",
                "title": "Know-me: A toolkit for designing personalised dementia care"
            },
            "pmcid": "PMC8198535",
            "pmid": "34070606"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}
