
{
    "credit": [
        {
            "email": "hnoguchi@nig.ac.jp",
            "name": "Hideki Noguchi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://takagilab.bs.s.u-tokyo.ac.jp/takagilab/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://metagene.cb.k.u-tokyo.ac.jp/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/metageneannotator-gene-finding-program-for-prokaryote-and-phage.html"
        }
    ],
    "publication": [
        {
            "abstract": "Recent advances in DNA sequencers are accelerating genome sequencing, especially in microbes, and complete and draft genomes from various species have been sequenced in rapid succession. Here, we present a comprehensive gene prediction tool, the MetaGeneAnnotator (MGA), which precisely predicts all kinds of prokaryotic genes from a single or a set of anonymous genomic sequences having a variety of lengths. The MGA integrates statistical models of prophage genes, in addition to those of bacterial and archaeal genes, and also uses a self-training model from input sequences for predictions. As a result, the MGA sensitively detects not only typical genes but also atypical genes, such as horizontally transferred and prophage genes in a prokaryotic genome. In this paper, we also propose a novel approach for analyzing the ribosomal binding site (RBS), which enables us to detect species-specific patterns of the RBSs. The MGA has the ingenious RBS model based on this approach, and precisely predicts translation starts of genes. The MGA also succeeds in improving prediction accuracies for short sequences by using the adapted RBS models (96 sensitivity and 93 specificity for 700 bp fragments). These features of the MGA expedite wide ranges of microbial genome studies, such as genome annotations and metagenome analyses.",
            "authors": [
                "Noguchi H.",
                "Taniguchi T.",
                "Itoh T."
            ],
            "cit_count": 247,
            "journal": "DNA Research",
            "pmid": "18940874",
            "title": "Meta gene annotator: Detecting species-specific patterns of ribosomal binding site for precise gene prediction in anonymous prokaryotic and phage genomes",
            "year": "2008-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metageneannotator",
        "biotoolsID": "metageneannotator",
        "description": "Prokaryotic gene finding program from environmental genome shotgun sequences or metagenomic sequences.",
        "homepage": "http://metagene.cb.k.u-tokyo.ac.jp/",
        "name": "MetaGeneAnnotator"
    }
}