{"credit":[{"email":"dalmasso@vjf.inserm.fr","name":"Cyril Dalmasso","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/LBE.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/LBE_1.42.0.tar.gz"}],"function":[{"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"publication":[{"abstract":"Motivation: The most used criterion in microarray data analysis is nowadays the false discovery rate (FDR). In the framework of estimating procedures based on the marginal distribution of the P-values without any assumption on gene expression changes, estimators of the FDR are necessarily conservatively biased. Indeed, only an upper bound estimate can be obtained for the key quantity π0, which is the probability for a gene to be unmodified. In this paper, we propose a novel family of estimators for π0 that allows the calculation of FDR. Results: The very simple method for estimating π0 called LBE (Location Based Estimator) is presented together with results on its variability. Simulation results indicate that the proposed estimator performs well in finite sample and has the best mean square error in most of the cases as compared with the procedures QVALUE, BUM and SPLOSH. The different procedures are then applied to real datasets. © The Author 2004. Published by Oxford University Press. All rights reserved.","authors":["Dalmasso C.","Broet P.","Moreau T."],"cit_count":62,"doi":"10.1093/bioinformatics/bti063","journal":"Bioinformatics","title":"A simple procedure for estimating the false discovery rate","year":"2005-03-01"}],"summary":{"biotoolsCURIE":"biotools:lbe","biotoolsID":"lbe","description":"Efficient procedure for estimating the proportion of true null hypotheses, the false discovery rate (and so the q-values) in the framework of estimating procedures based on the marginal distribution of the p-values without assumption for the alternative hypothesis.","homepage":"http://bioconductor.org/packages/release/bioc/html/LBE.html","name":"LBE","version":["1.42.0"]}}