{
    "additionDate": "2021-01-20T10:54:09Z",
    "biotoolsCURIE": "biotools:human-phenotype-ontology",
    "biotoolsID": "human-phenotype-ontology",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "S. Köhler",
            "typeEntity": "Person"
        }
    ],
    "description": "Human Phenotype Ontology, a standardized vocabulary of phenotypic abnormalities encountered in human disease. With unmatched depth it enables clinicians to record and analyse data with extremely accurate computer interpretable ontology terms. Developed by The Monarch Initiative.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://www.human-phenotype-ontology.org",
    "lastUpdate": "2021-05-17T07:23:05Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/obophenotype/human-phenotype-ontology/issues"
        }
    ],
    "name": "Human Phenotype Ontology",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S00108-018-0456-8",
            "metadata": {
                "abstract": "© 2018, Springer Medizin Verlag GmbH, ein Teil von Springer Nature.Diagnosing rare diseases can be challenging for clinicians. This article gives an overview on novel approaches, which enable automated phenotype-driven analyses of differential diagnoses for rare diseases as well as genomic variation data of affected individuals. The focus lies on reliable methods for collating clinical phenotypic data and new algorithms for precise and robust assessment of the similarity between phenotypic profiles. The Human Phenotype Ontology project (HPO; www.human-phenotype-ontology.org) provides an ontology for collating symptoms and clinical phenotypic abnormalities. Using ontologies makes it possible to capture these data in a precise and comprehensive fashion as well as to apply reliable and robust automated analyses. Tools, such as the Phenomizer, enable the algorithmic calculation of similarity values amongst patients or between patients and disease descriptions. Such digital tools represent a solid foundation for differential diagnostic applications. Many rare diseases have a strong genetic component but the analysis of the coding DNA variants in rare disease patients is an enormously complex procedure, which often impedes successful molecular diagnostics. In this situation a combined analysis of the patients HPO-coded phenotypic features and the genomic characteristics of the variants can be of substantial help. In this case the HPO project and the associated algorithms are helpful: it is therefore an important component for phenotype-driven translational research and prioritization of disease-relavant genomic variations.",
                "authors": [
                    {
                        "name": "Kohler S."
                    }
                ],
                "date": "2018-08-01T00:00:00Z",
                "journal": "Internist",
                "title": "From symptom to syndrome using modern software support Vom Symptom zum Syndrom mit moderner Softwareunterstützung"
            },
            "pmid": "29995249"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
