{
    "additionDate": "2020-01-14T09:20:14Z",
    "biotoolsCURIE": "biotools:STS-NLSP",
    "biotoolsID": "STS-NLSP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiongyi@sjtu.edu.cn",
            "name": "Yi Xiong",
            "typeEntity": "Person"
        },
        {
            "email": "dqwei@sjtu.edu.cn",
            "name": "Dong-Qing Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "A Network-Based Label Space Partition Method for Predicting the Specificity of Membrane Transporter Substrates Using a Hybrid Feature of Structural and Semantic Similarity.\n\ncodes for the membrane transporter paper.\n\ncodes for membrane transporter paper:.\n\nmodel_training_*.py are codes for parameter tuning in a server",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                },
                {
                    "term": "Sequence tagged site (STS) mapping",
                    "uri": "http://edamontology.org/operation_2871"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dqwei-lab/STS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-27T11:41:32Z",
    "name": "STS-NLSP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2019.00306",
            "metadata": {
                "abstract": "© Copyright © 2019 Wang, Zhu, Ye, Wang, Li, Xiong and Wei.Membrane transport proteins play crucial roles in the pharmacokinetics of substrate drugs, the drug resistance in cancer and are vital to the process of drug discovery, development and anti-cancer therapeutics. However, experimental methods to profile a substrate drug against a panel of transporters to determine its specificity are labor intensive and time consuming. In this article, we aim to develop an in silico multi-label classification approach to predict whether a substrate can specifically recognize one of the 13 categories of drug transporters ranging from ATP-binding cassette to solute carrier families using both structural fingerprints and chemical ontologies information of substrates. The data-driven network-based label space partition (NLSP) method was utilized to construct the model based on a hybrid of similarity-based feature by the integration of 2D fingerprint and semantic similarity. This method builds predictors for each label cluster (possibly intersecting) detected by community detection algorithms and takes union of label sets for a compound as final prediction. NLSP lies into the ensembles of multi-label classifier category in multi-label learning field. We utilized Cramér's V statistics to quantify the label correlations and depicted them via a heatmap. The jackknife tests and iterative stratification based cross-validation method were adopted on a benchmark dataset to evaluate the prediction performance of the proposed models both in multi-label and label-wise manner. Compared with other powerful multi-label methods, ML-kNN, MTSVM, and RAkELd, our multi-label classification model of NLPS-RF (random forest-based NLSP) has proven to be a feasible and effective model, and performed satisfactorily in the predictive task of transporter-substrate specificity. The idea behind NLSP method is intriguing and the power of NLSP remains to be explored for the multi-label learning problems in bioinformatics. The benchmark dataset, intermediate results and python code which can fully reproduce our experiments and results are available at https://github.com/dqwei-lab/STS.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zhu X."
                    },
                    {
                        "name": "Ye M."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Li C.-D."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Wei D.-Q."
                    }
                ],
                "citationCount": 5,
                "date": "2019-11-06T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "STS-NLSP: A Network-Based Label Space Partition Method for Predicting the Specificity of Membrane Transporter Substrates Using a Hybrid Feature of Structural and Semantic Similarity"
            },
            "pmcid": "PMC6851049",
            "pmid": "31781551"
        }
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}