{
    "additionDate": "2018-09-19T19:39:45Z",
    "biotoolsCURIE": "biotools:gina",
    "biotoolsID": "gina",
    "credit": [
        {
            "email": "jezalapa@wisc.edu",
            "name": "Juan Zalapa",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "GiNA is an open-source software  which is a simple tool for measuring horticultural traits such as shape- and color-related parameters of fruits, vegetables, and seeds for horticultural phenotyping.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/GiNA/GiNA.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/GiNA/index.html",
    "language": [
        "R",
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "GiNA",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0160439",
            "metadata": {
                "abstract": "© This is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.Traditional methods for trait phenotyping have been a bottleneck for research in many crop species due to their intensive labor, high cost, complex implementation, lack of reproducibility and propensity to subjective bias. Recently, multiple high-throughput phenotyping platforms have been developed, but most of them are expensive, species-dependent, complex to use, and available only for major crops. To overcome such limitations, we present the open-source software GiNA, which is a simple and free tool for measuring horticultural traits such as shape- and color-related parameters of fruits, vegetables, and seeds. GiNA is multiplatform software available in both R and MATLAB® programming languages and uses conventional images from digital cameras with minimal requirements. It can process up to 11 different horticultural morphological traits such as length, width, two-dimensional area, volume, projected skin, surface area, RGB color, among other parameters. Different validation tests produced highly consistent results under different lighting conditions and camera setups making GiNA a very reliable platform for high-throughput phenotyping. In addition, fivefold cross validation between manually generated and GiNA measurements for length and width in cranberry fruits were 0.97 and 0.92. In addition, the same strategy yielded prediction accuracies above 0.83 for color estimates produced from images of cranberries analyzed with GiNA compared to total anthocyanin content (TAcy) of the same fruits measured with the standard methodology of the industry. Our platform provides a scalable, easy-to-use and affordable tool for massive acquisition of phenotypic data of fruits, seeds, and vegetables.",
                "authors": [
                    {
                        "name": "Diaz-Garcia L."
                    },
                    {
                        "name": "Covarrubias-Pazaran G."
                    },
                    {
                        "name": "Schlautman B."
                    },
                    {
                        "name": "Zalapa J."
                    }
                ],
                "citationCount": 8,
                "date": "2016-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "GiNA, an Efficient and high-throughput software for horticultural phenotyping"
            },
            "pmcid": "PMC4986961",
            "pmid": "27529547",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Biological imaging",
            "uri": "http://edamontology.org/topic_3383"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.1"
    ]
}