
{
    "credit": [
        {
            "email": "vladimir.bajic@kaust.edu.sa",
            "name": "Vladimir B. Bajic",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.cbrc.kaust.edu.sa/dpubchem/manual.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "labels": {
        "license": "CC-BY-4.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Compound libraries and screening",
                "uri": "http://edamontology.org/topic_3343"
            },
            {
                "term": "Drug discovery",
                "uri": "http://edamontology.org/topic_3336"
            },
            {
                "term": "Pharmacology",
                "uri": "http://edamontology.org/topic_0202"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s).High-throughput screening (HTS) performs the experimental testing of a large number of chemical compounds aiming to identify those active in the considered assay. Alternatively, faster and cheaper methods of large-scale virtual screening are performed computationally through quantitative structure-activity relationship (QSAR) models. However, the vast amount of available HTS heterogeneous data and the imbalanced ratio of active to inactive compounds in an assay make this a challenging problem. Although different QSAR models have been proposed, they have certain limitations, e.g., high false positive rates, complicated user interface, and limited utilization options. Therefore, we developed DPubChem, a novel web tool for deriving QSAR models that implement the state-of-the-art machine-learning techniques to enhance the precision of the models and enable efficient analyses of experiments from PubChem BioAssay database. DPubChem also has a simple interface that provides various options to users. DPubChem predicted active compounds for 300 datasets with an average geometric mean and F 1 score of 76.68% and 76.53%, respectively. Furthermore, DPubChem builds interaction networks that highlight novel predicted links between chemical compounds and biological assays. Using such a network, DPubChem successfully suggested a novel drug for the Niemann-Pick type C disease. DPubChem is freely available at www.cbrc.kaust.edu.sa/dpubchem.",
            "authors": [
                "Soufan O.",
                "Ba-Alawi W.",
                "Magana-Mora A.",
                "Essack M.",
                "Bajic V.B."
            ],
            "cit_count": 0,
            "doi": "10.1038/s41598-018-27495-x",
            "journal": "Scientific Reports",
            "title": "DPubChem: A web tool for QSAR modeling and high-throughput virtual screening",
            "year": "2018-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dpubchem",
        "biotoolsID": "dpubchem",
        "description": "Web tool for QSAR modeling and high-throughput virtual screening.",
        "homepage": "http://www.cbrc.kaust.edu.sa/dpubchem/",
        "name": "DPubChem"
    }
}