{
    "additionDate": "2021-01-18T08:29:53Z",
    "biotoolsCURIE": "biotools:cgd-crispr",
    "biotoolsID": "cgd-crispr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jwnam@hanyang.ac.kr",
            "name": "Jin-Wu Nam",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive guide designer (CGD) is a python based on-target scoring method for CRISPRi, CRISPRa, Cas9, Cas9 (non-canonical) and Cas12a sequences.They are consortium of scores such as CGDi, CGDa, CGD9, CGD9NG and CGD12a, which are based on ENLOR(ELastic Net Logistic Regression) weights.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Reverse complement",
                    "uri": "http://edamontology.org/operation_0363"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vipinmenon1989/CGD",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-10T21:02:04Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://big.hanyang.ac.kr:2195/CGD"
        }
    ],
    "name": "CGD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2020.03.020",
            "metadata": {
                "abstract": "© 2020 The AuthorsThe Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR)-Cas systems, including dead Cas9 (dCas9), Cas9, and Cas12a, have revolutionized genome engineering in mammalian somatic cells. Although computational tools that assess the target sites of CRISPR-Cas systems are inevitably important for designing efficient guide RNAs (gRNAs), they exhibit generalization issues in selecting features and do not provide optimal results in a comprehensive manner. Here, we introduce a Comprehensive Guide Designer (CGD) for four different CRISPR systems, which utilizes the machine learning algorithm, Elastic Net Logistic Regression (ENLOR), to autonomously generalize the models. CGD contains specific models trained with public datasets generated by CRISPRi, CRISPRa, CRISPR-Cas9, and CRISPR-Cas12a (designated as CGDi, CGDa, CGD9, and CGD12a, respectively) in an unbiased manner. The trained CGD models were benchmarked to other regression-based machine learning models, such as ElasticNet Linear Regression (ENLR), Random Forest and Boruta (RFB), and Extreme Gradient Boosting (Xgboost) with inbuilt feature selection. Evaluation with independent test datasets showed that CGD models outperformed the pre-existing methods in predicting the efficacy of gRNAs. All CGD source codes and datasets are available at GitHub (https://github.com/vipinmenon1989/CGD), and the CGD webserver can be accessed at http://big.hanyang.ac.kr:2195/CGD.",
                "authors": [
                    {
                        "name": "Menon A.V."
                    },
                    {
                        "name": "Sohn J.-I."
                    },
                    {
                        "name": "Nam J.-W."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "CGD: Comprehensive guide designer for CRISPR-Cas systems"
            },
            "pmcid": "PMC7152703",
            "pmid": "32308928"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}