{
    "additionDate": "2019-11-14T18:29:29Z",
    "biotoolsCURIE": "biotools:DDPGPSurv",
    "biotoolsID": "DDPGPSurv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yanxun.xu@jhu.edu",
            "name": "Yanxun Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "Bayesian non-parametric survival regression for optimizing precision dosing of intravenous busulfan in allogeneic stem cell transplantation | Allogeneic stem cell transplantation (allo-SCT) is now part of standard of care for acute leukemia (AL). To reduce toxicity of the pre-transplant conditioning regimen, intravenous busulfan is usually used as a preparative regimen for AL patients undergoing allo-SCT. Systemic busulfan exposure, characterized by the area under the plasma concentration versus time curve (AUC), is strongly associated with clinical outcome. An AUC that is too high is associated with severe toxicities, while an AUC that is too low carries increased risks of disease recurrence and failure to engraft. Consequently, an optimal AUC interval needs to be determined for therapeutic use",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cran/DDPGPSurv",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-20T10:04:13Z",
    "name": "DDPGPSurv",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/RSSC.12331",
            "metadata": {
                "abstract": "© 2018 Royal Statistical SocietyAllogeneic stem cell transplantation is now part of standard care for acute leukaemia. To reduce toxicity of the pretransplant conditioning regimen, intravenous busulfan is usually used as a preparative regimen for acute leukaemia patients undergoing allogeneic stem cell transplantation. Systemic busulfan exposure, characterized by the area under the plasma concentration versus time curve, AUC, is strongly associated with clinical outcome. An AUC that is too high is associated with severe toxicities, whereas an AUC that is too low carries increased risks of recurrence of disease and failure to engraft. Consequently, an optimal AUC-interval needs to be determined for therapeutic use. To address the possibility that busulfan pharmacokinetics and pharmacodynamics vary significantly with patients’ characteristics, we propose a tailored approach to determine optimal covariate-specific AUC-intervals. To estimate these personalized AUC-intervals, we apply a flexible Bayesian non-parametric regression model based on a dependent Dirichlet process and Gaussian process. Our analyses of a data set of 151 patients identified optimal therapeutic intervals for AUC that varied substantively with age and whether the patient was in complete remission or had active disease at transplant. Extensive simulations to evaluate the dependent Dirichlet process–Gaussian process model in similar settings showed that its performance compares favourably with alternative methods. We provide an R package, DDPGPSurv, that implements the dependent Dirichlet process–Gaussian process model for a broad range of survival regression analyses.",
                "authors": [
                    {
                        "name": "Andersson B.S."
                    },
                    {
                        "name": "Hua W."
                    },
                    {
                        "name": "Thall P.F."
                    },
                    {
                        "name": "Xu Y."
                    }
                ],
                "citationCount": 3,
                "date": "2019-04-01T00:00:00Z",
                "journal": "Journal of the Royal Statistical Society. Series C: Applied Statistics",
                "title": "Bayesian non-parametric survival regression for optimizing precision dosing of intravenous busulfan in allogeneic stem cell transplantation"
            },
            "pmcid": "PMC6714050",
            "pmid": "31467455"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
