{
    "additionDate": "2021-01-18T08:57:45Z",
    "biotoolsCURIE": "biotools:methget",
    "biotoolsID": "methget",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paoyang@gate.sinica.edu.tw",
            "name": "Pao-Yang Chen",
            "orcidid": "https://orcid.org/0000-0002-7402-3075",
            "typeEntity": "Person"
        }
    ],
    "description": "Beb-based bioinformatics software for correlating genome-wide DNA methylation and gene expression.\n\nA web-based bioinformatics software for correlating DNA methylation and gene expression. The web user-interface can be accessed through https://paoyang.ipmb.sinica.edu.tw/Software.html .\n\nCorrelation analyses of genome-wide DNA methylation and gene expression.\n\nOrdinal association analyses with genes ranked by gene expression level.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Methylation calling",
                    "uri": "http://edamontology.org/operation_3919"
                }
            ]
        }
    ],
    "homepage": "https://paoyang.ipmb.sinica.edu.tw/Software.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-22T08:20:01Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Jason-Teng/MethGET"
        }
    ],
    "name": "MethGET",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6722-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: DNA methylation is a major epigenetic modification involved in regulating gene expression. The effects of DNA methylation on gene expression differ by genomic location and vary across kingdoms, species and environmental conditions. To identify the functional regulatory roles of DNA methylation, the correlation between DNA methylation changes and alterations in gene expression is crucial. With the advance of next-generation sequencing, genome-wide methylation and gene expression profiling have become feasible. Current bioinformatics tools for investigating such correlation are designed to the assessment of DNA methylation at CG sites. The correlation of non-CG methylation and gene expression is very limited. Some bioinformatics databases allow correlation analysis, but they are limited to specific genomes such as that of humans and do not allow user-provided data. Results: Here, we developed a bioinformatics web tool, MethGET (Methylation and Gene Expression Teller), that is specialized to analyse the association between genome-wide DNA methylation and gene expression. MethGET is the first web tool to which users can supply their own data from any genome. It is also the tool that correlates gene expression with CG, CHG, and CHH methylation based on whole-genome bisulfite sequencing data. MethGET not only reveals the correlation within an individual sample (single-methylome) but also performs comparisons between two groups of samples (multiple-methylomes). For single-methylome analyses, MethGET provides Pearson correlations and ordinal associations to investigate the relationship between DNA methylation and gene expression. It also groups genes with different gene expression levels to view the methylation distribution at specific genomic regions. Multiple-methylome analyses include comparative analyses and heatmap representations between two groups. These functions enable the detailed investigation of the role of DNA methylation in gene regulation. Additionally, we applied MethGET to rice regeneration data and discovered that CHH methylation in the gene body region may play a role in the tissue culture process, which demonstrates the capability of MethGET for use in epigenomic research. Conclusions: MethGET is a Python software that correlates DNA methylation and gene expression. Its web interface is publicly available at https://paoyang.ipmb.sinica.edu.tw/Software.html. The stand-alone version and source codes are available on GitHub at https://github.com/Jason-Teng/MethGET.",
                "authors": [
                    {
                        "name": "Chen P.-Y."
                    },
                    {
                        "name": "Teng C.-S."
                    },
                    {
                        "name": "Wu B.-H."
                    },
                    {
                        "name": "Yen M.-R."
                    }
                ],
                "date": "2020-05-29T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "MethGET: Web-based bioinformatics software for correlating genome-wide DNA methylation and gene expression"
            },
            "pmcid": "PMC7257144",
            "pmid": "32471342"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
