{"credit":[{"email":"snell@cs.byu.edu","name":"Dr. Quinn Snell","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"clement@cs.byu.edu","name":"Dr. Mark Clement","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Read mapping","uri":"http://edamontology.org/operation_3198"}]}],"labels":{"language":["C++"],"maturity":"Mature","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"Motivation: The advent of next-generation sequencing technologies has increased the accuracy and quantity of sequence data, opening the door to greater opportunities in genomic research.Results: In this article, we present GNUMAP (Genomic Next-generation Universal MAPper), a program capable of overcoming two major obstacles in the mapping of reads from next-generation sequencing runs. First, we have created an algorithm that probabilistically maps reads to repeat regions in the genome on a quantitative basis. Second, we have developed a probabilistic Needleman-Wunsch algorithm which utilizes _prb.txt and _int.txt files produced in the Solexa/Illumina pipeline to improve the mapping accuracy for lower quality reads and increase the amount of usable data produced in a given experiment. © The Author 2009. Published by Oxford University Press.","authors":["Clement N.L.","Snell Q.","Clement M.J.","Hollenhorst P.C.","Purwar J.","Graves B.J.","Cairns B.R.","Johnson W.E."],"cit_count":44,"journal":"Bioinformatics","pmid":"19861355","title":"The GNUMAP algorithm: Unbiased probabilistic mapping of oligonucleotides from next-generation sequencing","year":"2009-10-27"}],"summary":{"biotoolsCURIE":"biotools:gnumap","biotoolsID":"gnumap","description":"The Genomic Next-generation Universal MAPper (gnumap) is a program designed to accurately map sequence data obtained from next-generation sequencing machines (specifically that of Solexa/Illumina) back to a genome of any size. Currently, gnumap is designed to be used with the _int.txt data received from the Solexa/Illumina machine.","homepage":"http://dna.cs.byu.edu/gnumap/","name":"Gnumap"}}