{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cc.gatech.edu/~bader/index.html"}],"documentation":[{"type":"GENERAL","url":"http://gtfold.sourceforge.net/guide.html"}],"function":[{"operation":[{"term":"Structure prediction","uri":"http://edamontology.org/operation_0271"}]},{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/gtfold-2-0-scalable-multicore-code-rna-secondary-structure-prediction.html"}],"publication":[{"abstract":"Background: Accurate and efficient RNA secondary structure prediction remains an important open problem in computational molecular biology. Historically, advances in computing technology have enabled faster and more accurate RNA secondary structure predictions. Previous parallelized prediction programs achieved significant improvements in runtime, but their implementations were not portable from niche high-performance computers or easily accessible to most RNA researchers. With the increasing prevalence of multi-core desktop machines, a new parallel prediction program is needed to take full advantage of today's computing technology. Findings. We present here the first implementation of RNA secondary structure prediction by thermodynamic optimization for modern multi-core computers. We show that GTfold predicts secondary structure in less time than UNAfold and RNAfold, without sacrificing accuracy, on machines with four or more cores. Conclusions: GTfold supports advances in RNA structural biology by reducing the timescales for secondary structure prediction. The difference will be particularly valuable to researchers working with lengthy RNA sequences, such as RNA viral genomes. © 2012 Swenson et al.; licensee BioMed Central Ltd.","authors":["Swenson M.S.","Anderson J.","Ash A.","Gaurav P.","Sukosd Z.","Bader D.A.","Harvey S.C.","Heitsch C.E."],"cit_count":12,"doi":"10.1186/1756-0500-5-341","journal":"BMC Research Notes","title":"GTfold: Enabling parallel RNA secondary structure prediction on multi-core desktops","type":"Primary","year":"2012-07-04"}],"summary":{"biotoolsCURIE":"biotools:gtfold","biotoolsID":"gtfold","description":"GTfold is a fast, scalable multicore code for predicting RNA secondary structure that is one to two orders of magnitude faster than the de facto standard programs and achieves comparable accuracy of prediction.","homepage":"http://gtfold.sourceforge.net/","name":"GTfold","version":["3.0"]}}