{
    "additionDate": "2024-01-26T11:01:25.350076Z",
    "biotoolsCURIE": "biotools:inticom_db",
    "biotoolsID": "inticom_db",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhouyuanbioinfo@hsc.pku.edu.cn",
            "name": "Yuan Zhou",
            "typeEntity": "Person"
        }
    ],
    "description": "A manually curated database of inter-tissue communication molecules and their communication routes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://rnanut.net/inticomdb",
    "lastUpdate": "2024-01-26T11:01:25.352538Z",
    "name": "IntiCom-DB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/BIOLOGY12060833",
            "metadata": {
                "abstract": "Inter-tissue communication (ITC) is critical for maintaining the physiological functions of multiple tissues and is closely related to the onset and development of various complex diseases. Nevertheless, there is no well-organized data resource for known ITC molecules with explicit ITC routes from source tissues to target tissues. To address this issue, in this work, we manually reviewed nearly 190,000 publications and identified 1408 experimentally supported ITC entries in which the ITC molecules, their communication routes, and their functional annotations were included. To facilitate our work, these curated ITC entries were incorporated into a user-friendly database named IntiCom-DB. This database also enables visualization of the expression abundances of ITC proteins and their interaction partners. Finally, bioinformatics analyses on these data revealed common biological characteristics of the ITC molecules. For example, tissue specificity scores of ITC molecules at the protein level are often higher than those at the mRNA level in the target tissues. Moreover, the ITC molecules and their interaction partners are more abundant in both the source tissues and the target tissues. IntiCom-DB is freely available as an online database. As the first comprehensive database of ITC molecules with explicit ITC routes to the best of our knowledge, we hope that IntiCom-DB will benefit future ITC-related studies.",
                "authors": [
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Pang H."
                    },
                    {
                        "name": "Xiong C."
                    },
                    {
                        "name": "Yi J."
                    },
                    {
                        "name": "Zheng R."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2023-06-01T00:00:00Z",
                "journal": "Biology",
                "title": "IntiCom-DB: A Manually Curated Database of Inter-Tissue Communication Molecules and Their Communication Routes"
            },
            "pmcid": "PMC10294874",
            "pmid": "37372118"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
