{
    "additionDate": "2018-07-29T12:21:32Z",
    "biotoolsCURIE": "biotools:barcosel",
    "biotoolsID": "barcosel",
    "credit": [
        {
            "email": "panu.somervuo@helsinki.fi",
            "name": "Panu Somervuo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It is a web tool for selecting an optimal set of barcode sequences. User must provide a set of candidate barcodes from which the defined number of barcodes is selected.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ekhidna2.biocenter.helsinki.fi/barcosel/info.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "http://ekhidna2.biocenter.helsinki.fi/barcosel/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "BARCOSEL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2262-7",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Current high-throughput sequencing platforms provide capacity to sequence multiple samples in parallel. Different samples are labeled by attaching a short sample specific nucleotide sequence, barcode, to each DNA molecule prior pooling them into a mix containing a number of libraries to be sequenced simultaneously. After sequencing, the samples are binned by identifying the barcode sequence within each sequence read. In order to tolerate sequencing errors, barcodes should be sufficiently apart from each other in sequence space. An additional constraint due to both nucleotide usage and basecalling accuracy is that the proportion of different nucleotides should be in balance in each barcode position. The number of samples to be mixed in each sequencing run may vary and this introduces a problem how to select the best subset of available barcodes at sequencing core facility for each sequencing run. There are plenty of tools available for de novo barcode design, but they are not suitable for subset selection. Results: We have developed a tool which can be used for three different tasks: 1) selecting an optimal barcode set from a larger set of candidates, 2) checking the compatibility of user-defined set of barcodes, e.g. whether two or more libraries with existing barcodes can be combined in a single sequencing pool, and 3) augmenting an existing set of barcodes. In our approach the selection process is formulated as a minimization problem. We define the cost function and a set of constraints and use integer programming to solve the resulting combinatorial problem. Based on the desired number of barcodes to be selected and the set of candidate sequences given by user, the necessary constraints are automatically generated and the optimal solution can be found. The method is implemented in C programming language and web interface is available at http://ekhidna2.biocenter.helsinki.fi/barcosel. Conclusions: Increasing capacity of sequencing platforms raises the challenge of mixing barcodes. Our method allows the user to select a given number of barcodes among the larger existing barcode set so that both sequencing errors are tolerated and the nucleotide balance is optimized. The tool is easy to access via web browser.",
                "authors": [
                    {
                        "name": "Auvinen P."
                    },
                    {
                        "name": "Holm L."
                    },
                    {
                        "name": "Koskinen P."
                    },
                    {
                        "name": "Mei P."
                    },
                    {
                        "name": "Paulin L."
                    },
                    {
                        "name": "Somervuo P."
                    }
                ],
                "citationCount": 13,
                "date": "2018-07-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BARCOSEL: A tool for selecting an optimal barcode set for high-throughput sequencing"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
