
{
    "credit": [
        {
            "email": "yingwoow@bcm.edu",
            "name": "Ying-Wooi Wan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://github.com/zhandong/XMRF/blob/master/XMRF-manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence profile generation",
                    "uri": "http://edamontology.org/operation_0296"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 The Author(s). Background: Technological advances in medicine have led to a rapid proliferation of high-throughput \"omics\" data. Tools to mine this data and discover disrupted disease networks are needed as they hold the key to understanding complicated interactions between genes, mutations and aberrations, and epi-genetic markers. Results: We developed an R software package, XMRF, that can be used to fit Markov Networks to various types of high-throughput genomics data. Encoding the models and estimation techniques of the recently proposed exponential family Markov Random Fields (Yang et al., 2012), our software can be used to learn genetic networks from RNA-sequencing data (counts via Poisson graphical models), mutation and copy number variation data (categorical via Ising models), and methylation data (continuous via Gaussian graphical models). Conclusions: XMRF is the only tool that allows network structure learning using the native distribution of the data instead of the standard Gaussian. Moreover, the parallelization feature of the implemented algorithms computes the large-scale biological networks efficiently. XMRF is available from CRAN and Github ( https://github.com/zhandong/XMRF ).",
            "authors": [
                "Wan Y.-W.",
                "Allen G.I.",
                "Baker Y.",
                "Yang E.",
                "Ravikumar P.",
                "Anderson M.",
                "Liu Z."
            ],
            "cit_count": 3,
            "doi": "10.1186/s12918-016-0313-0",
            "journal": "BMC Systems Biology",
            "title": "XMRF: An R package to fit Markov Networks to high-throughput genetics data",
            "year": "2016-08-26"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:xmrf",
        "biotoolsID": "xmrf",
        "description": "Fit Markov Networks to high-throughput genetics data.",
        "homepage": "https://github.com/zhandong/XMRF",
        "name": "XMRF"
    }
}