{"credit":[{"email":"takaabe@ie.niigata-u.ac.jp","name":"Takashi Abe","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/tlawrence3/FAST/tree/master/doc"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"}]}],"labels":{"language":["Perl"],"maturity":"Mature","operatingSystem":["Mac"],"toolType":["Suite"],"topic":[{"term":"Genomics","uri":"http://edamontology.org/topic_0622"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"© 2015 Lawrence, Kauffman, Amrine, Carper, Lee, Becich, Canales and Ardell. FAST (FAST Analysis of Sequences Toolbox) provides simple, powerful open source command-line tools to filter, transform, annotate and analyze biological sequence data. Modeled after the GNU (GNU's Not Unix) Textutils such as grep, cut, and tr, FAST tools such as fasgrep, fascut, and fastr make it easy to rapidly prototype expressive bioinformatic workflows in a compact and generic command vocabulary. Compact combinatorial encoding of data workflows with FAST commands can simplify the documentation and reproducibility of bioinformatic protocols, supporting better transparency in biological data science. Interface self-consistency and conformity with conventions of GNU, Matlab, Perl, BioPerl, R, and GenBank help make FAST easy and rewarding to learn. FAST automates numerical, taxonomic, and text-based sorting, selection and transformation of sequence records and alignment sites based on content, index ranges, descriptive tags, annotated features, and in-line calculated analytics, including composition and codon usage. Automated content- and feature-based extraction of sites and support for molecular population genetic statistics make FAST useful for molecular evolutionary analysis. FAST is portable, easy to install and secure thanks to the relative maturity of its Perl and BioPerl foundations, with stable releases posted to CPAN. Development as well as a publicly accessible Cookbook and Wiki are available on the FAST GitHub repository at https://github.com/tlawrence3/FAST. The default data exchange format in FAST is Multi-FastA (specifically, a restriction of BioPerl FastA format). Sanger and Illumina 1.8+ FastQ formatted files are also supported. FAST makes it easier for non-programmer biologists to interactively investigate and control biological data at the speed of thought.","authors":["Lawrence T.J.","Kauffman K.T.","Amrine K.C.H.","Carper D.L.","Lee R.S.","Becich P.J.","Canales C.J.","Ardell D.H."],"cit_count":7,"doi":"10.3389/fgene.2015.00172","journal":"Frontiers in Genetics","title":"FAST: FAST Analysis of Sequences Toolbox","type":"Primary","year":"2015-01-01"}],"summary":{"biotoolsCURIE":"biotools:fast","biotoolsID":"fast","description":"The FAST Analysis of Sequences Toolbox (FAST) is a set of Unix tools (for example fasgrep, fascut, fashead and fastr) for sequence bioinformatics modeled after the Unix textutils (such as grep, cut, head, tr, etc).","homepage":"https://github.com/tlawrence3/FAST","name":"FAST: Fast Analysis of Sequences Toolbox"}}