{
    "accessibility": "Open access",
    "additionDate": "2022-04-10T22:47:26.211343Z",
    "biotoolsCURIE": "biotools:neurocraft",
    "biotoolsID": "neurocraft",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dimitrios.sakellariou@outlook.com",
            "name": "Dimitris Fotis Sakellariou",
            "typeEntity": "Person"
        },
        {
            "name": "Angeliki Vakrinou"
        },
        {
            "name": "Mark Phillip Richardson"
        },
        {
            "name": "Michalis Koutroumanidis"
        }
    ],
    "description": "Software for microscale brain network dynamics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.neurocraft.co.uk/#download",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-04-10T22:47:26.214748Z",
    "license": "CC0-1.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Neurocraft/neurocraft"
        }
    ],
    "name": "Neurocraft",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/S41598-021-99195-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).The brain operates at millisecond timescales but despite of that, the study of its functional networks is approached with time invariant methods. Equally, for a variety of brain conditions treatment is delivered with fixed temporal protocols unable to monitor and follow the rapid progression and therefore the cycles of a disease. To facilitate the understanding of brain network dynamics we developed Neurocraft, a user friendly software suite. Neurocraft features a highly novel signal processing engine fit for tracking evolving network states with superior time and frequency resolution. A variety of analytics like dynamic connectivity maps, force-directed representations and propagation models, allow for the highly selective investigation of transient pathophysiological dynamics. In addition, machine-learning tools enable the unsupervised investigation and selection of key network features at individual and group-levels. For proof of concept, we compared six seizure-free and non seizure-free focal epilepsy patients after resective surgery using Neurocraft. The network features were calculated using 50 intracranial electrodes on average during at least 120 epileptiform discharges lasting less than one second, per patient. Powerful network differences were detected in the pre-operative data of the two patient groups (effect size = 1.27), suggesting the predictive value of dynamic network features. More than one million patients are treated with cardiac and neuro modulation devices that are unable to track the hourly or daily changes in a subject’s disease. Decoding the dynamics of transition from normal to abnormal states may be crucial in the understanding, tracking and treatment of neurological conditions. Neurocraft provides a user-friendly platform for the research of microscale brain dynamics and a stepping stone for the personalised device-based adaptive neuromodulation in real-time.",
                "authors": [
                    {
                        "name": "Koutroumanidis M."
                    },
                    {
                        "name": "Richardson M.P."
                    },
                    {
                        "name": "Sakellariou D.F."
                    },
                    {
                        "name": "Vakrinou A."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Neurocraft: software for microscale brain network dynamics"
            },
            "pmcid": "PMC8528833",
            "pmid": "34671076"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
