{
    "name": "clc_unmapped_reads", 
    "description": "Output the unmapped reads.", 
    "homepage": "https://bio.tools/clcbio_genomics_workbench", 
    "biotoolsID": "clc_unmapped_reads", 
    "biotoolsCURIE": "biotools:clc_unmapped_reads-ip", 
    "version": [
        "4.010.83648"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2520", 
                    "term": "DNA mapping"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0006", 
                        "term": "Data"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2333", 
                            "term": "Binary format"
                        }
                    ]
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0863", 
                        "term": "Sequence alignment"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_1929", 
                            "term": "FASTA"
                        }
                    ]
                }, 
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0006", 
                        "term": "Data"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_1930", 
                            "term": "FASTQ"
                        }
                    ]
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [
        "galaxyPasteur", 
        "CLC Main Workbench"
    ], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/fmareuil/clc_assembly_4/clc_unmapped_reads/4.010.83648", 
            "type": "Galaxy service", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1186/1471-2164-11-571", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Review", 
            "version": null, 
            "metadata": {
                "title": "Comparing de novo assemblers for 454 transcriptome data", 
                "abstract": "Background: Roche 454 pyrosequencing has become a method of choice for generating transcriptome data from non-model organisms. Once the tens to hundreds of thousands of short (250-450 base) reads have been produced, it is important to correctly assemble these to estimate the sequence of all the transcripts. Most transcriptome assembly projects use only one program for assembling 454 pyrosequencing reads, but there is no evidence that the programs used to date are optimal. We have carried out a systematic comparison of five assemblers (CAP3, MIRA, Newbler, SeqMan and CLC) to establish best practices for transcriptome assemblies, using a new dataset from the parasitic nematode Litomosoides sigmodontis.Results: Although no single assembler performed best on all our criteria, Newbler 2.5 gave longer contigs, better alignments to some reference sequences, and was fast and easy to use. SeqMan assemblies performed best on the criterion of recapitulating known transcripts, and had more novel sequence than the other assemblers, but generated an excess of small, redundant contigs. The remaining assemblers all performed almost as well, with the exception of Newbler 2.3 (the version currently used by most assembly projects), which generated assemblies that had significantly lower total length. As different assemblers use different underlying algorithms to generate contigs, we also explored merging of assemblies and found that the merged datasets not only aligned better to reference sequences than individual assemblies, but were also more consistent in the number and size of contigs.Conclusions: Transcriptome assemblies are smaller than genome assemblies and thus should be more computationally tractable, but are often harder because individual contigs can have highly variable read coverage. Comparing single assemblers, Newbler 2.5 performed best on our trial data set, but other assemblers were closely comparable. Combining differently optimal assemblies from different programs however gave a more credible final product, and this strategy is recommended. © 2010 Kumar and Blaxter; licensee BioMed Central Ltd.", 
                "date": "2010-10-16T00:00:00Z", 
                "citationCount": 193, 
                "authors": [
                    {
                        "name": "Kumar S."
                    }, 
                    {
                        "name": "Blaxter M.L."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }, 
        {
            "doi": "10.1093/nar/gkw343", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "The Galaxy platform for accessible, reproducible and collaborative biomedical analyses: 2016 update", 
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.High-throughput data production technologies, particularly 'next-generation' DNA sequencing, have ushered in widespread and disruptive changes to biomedical research. Making sense of the large datasets produced by these technologies requires sophisticated statistical and computational methods, as well as substantial computational power. This has led to an acute crisis in life sciences, as researchers without informatics training attempt to perform computation-dependent analyses. Since 2005, the Galaxy project has worked to address this problem by providing a framework that makes advanced computational tools usable by non experts. Galaxy seeks to make data-intensive research more accessible, transparent and reproducible by providing a Web-based environment in which users can perform computational analyses and have all of the details automatically tracked for later inspection, publication, or reuse. In this report we highlight recently added features enabling biomedical analyses on a large scale.", 
                "date": "2016-07-08T00:00:00Z", 
                "citationCount": 523, 
                "authors": [
                    {
                        "name": "Afgan E."
                    }, 
                    {
                        "name": "Baker D."
                    }, 
                    {
                        "name": "van den Beek M."
                    }, 
                    {
                        "name": "Blankenberg D."
                    }, 
                    {
                        "name": "Bouvier D."
                    }, 
                    {
                        "name": "Cech M."
                    }, 
                    {
                        "name": "Chilton J."
                    }, 
                    {
                        "name": "Clements D."
                    }, 
                    {
                        "name": "Coraor N."
                    }, 
                    {
                        "name": "Eberhard C."
                    }, 
                    {
                        "name": "Gruning B."
                    }, 
                    {
                        "name": "Guerler A."
                    }, 
                    {
                        "name": "Hillman-Jackson J."
                    }, 
                    {
                        "name": "Von Kuster G."
                    }, 
                    {
                        "name": "Rasche E."
                    }, 
                    {
                        "name": "Soranzo N."
                    }, 
                    {
                        "name": "Turaga N."
                    }, 
                    {
                        "name": "Taylor J."
                    }, 
                    {
                        "name": "Nekrutenko A."
                    }, 
                    {
                        "name": "Goecks J."
                    }
                ], 
                "journal": "Nucleic acids research"
            }
        }, 
        {
            "doi": "10.7490/f1000research.1114334.1", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": null
        }
    ], 
    "credit": [
        {
            "name": "Galaxy Support Team", 
            "email": "galaxy@pasteur.fr", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "hmenager", 
    "additionDate": "2016-12-19T14:22:18Z", 
    "lastUpdate": "2019-02-20T08:24:07Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}