{
    "additionDate": "2018-05-24T12:14:08Z",
    "biotoolsCURIE": "biotools:snipviz",
    "biotoolsID": "snipviz",
    "credit": [
        {
            "email": "mriffle@uw.edu",
            "name": "Michael Riffle",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Disseminate multiple versions of related gene and protein sequences on web sites.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://www.yeastrc.org/snipviz/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yeastrc/snipviz",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "Apache-2.0",
    "name": "SnipViz",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1186/1756-0500-7-468",
            "metadata": {
                "abstract": "© 2014 Jaschob et al.; licensee BioMed Central Ltd.Background: As high throughput sequencing continues to grow more commonplace, the need to disseminate the resulting data via web applications continues to grow. Particularly, there is a need to disseminate multiple versions of related gene and protein sequences simultaneously - whether they represent alleles present in a single species, variations of the same gene among different strains, or homologs among separate species. Often this is accomplished by displaying all versions of the sequence at once in a manner that is not intuitive or space-efficient and does not facilitate human understanding of the data. Web-based applications needing to disseminate multiple versions of sequences would benefit from a drop-in module designed to effectively disseminate these data. Findings. SnipViz is a client-side software tool designed to disseminate multiple versions of related gene and protein sequences on web sites. SnipViz has a space-efficient, interactive, and dynamic interface for navigating, analyzing and visualizing sequence data. It is written using standard World Wide Web technologies (HTML, Javascript, and CSS) and is compatible with most web browsers. SnipViz is designed as a modular client-side web component and may be incorporated into virtually any web site and be implemented without any programming. Conclusions: SnipViz is a drop-in client-side module for web sites designed to efficiently visualize and disseminate gene and protein sequences. SnipViz is open source and is freely available at.",
                "authors": [
                    {
                        "name": "Davis T.N."
                    },
                    {
                        "name": "Jaschob D."
                    },
                    {
                        "name": "Riffle M."
                    }
                ],
                "citationCount": 5,
                "date": "2014-07-23T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "SnipViz: A compact and lightweight web site widget for display and dissemination of multiple versions of gene and protein sequences"
            },
            "pmcid": "PMC4118779",
            "pmid": "25056180"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}
