{
    "additionDate": "2020-01-14T19:44:21Z",
    "biotoolsCURIE": "biotools:StressGenePred",
    "biotoolsID": "StressGenePred",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "jungw@konkuk.ac.kr",
            "name": "Woosuk Jung",
            "typeEntity": "Person"
        },
        {
            "email": "sunkim.bioinfo@snu.ac.kr",
            "name": "Sun Kim",
            "typeEntity": "Person"
        }
    ],
    "description": "a twin prediction model architecture for classifying the stress types of samples and discovering stress-related genes in arabidopsis.\n\nStress predicting framework with microarray data based on CMCL and logical correlation model.\n\nStress Predictor based on Machine Learning.\n\npython learn.py dataset/dataset_learn_v2_005.limma.csv dataset/dataset_learn_v2_005.label.csv --reduce_updown --save output/model_v2 --save_csv output/model_v2 --epoch_count 1000 --batch_size 0.\n\n--reduce_updown Use this parameter if dataset is separated into up and down column",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-seq time series data analysis",
                    "uri": "http://edamontology.org/operation_3565"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bhi-kimlab/StressGenePred",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2020-01-14T19:44:21Z",
    "name": "StressGenePred",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6283-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Recently, a number of studies have been conducted to investigate how plants respond to stress at the cellular molecular level by measuring gene expression profiles over time. As a result, a set of time-series gene expression data for the stress response are available in databases. With the data, an integrated analysis of multiple stresses is possible, which identifies stress-responsive genes with higher specificity because considering multiple stress can capture the effect of interference between stresses. To analyze such data, a machine learning model needs to be built. Results: In this study, we developed StressGenePred, a neural network-based machine learning method, to integrate time-series transcriptome data of multiple stress types. StressGenePred is designed to detect single stress-specific biomarker genes by using a simple feature embedding method, a twin neural network model, and Confident Multiple Choice Learning (CMCL) loss. The twin neural network model consists of a biomarker gene discovery and a stress type prediction model that share the same logical layer to reduce training complexity. The CMCL loss is used to make the twin model select biomarker genes that respond specifically to a single stress. In experiments using Arabidopsis gene expression data for four major environmental stresses, such as heat, cold, salt, and drought, StressGenePred classified the types of stress more accurately than the limma feature embedding method and the support vector machine and random forest classification methods. In addition, StressGenePred discovered known stress-related genes with higher specificity than the Fisher method. Conclusions: StressGenePred is a machine learning method for identifying stress-related genes and predicting stress types for an integrated analysis of multiple stress time-series transcriptome data. This method can be used to other phenotype-gene associated studies.",
                "authors": [
                    {
                        "name": "Kang D."
                    },
                    {
                        "name": "Ahn H."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Lee C.-J."
                    },
                    {
                        "name": "Hur J."
                    },
                    {
                        "name": "Jung W."
                    },
                    {
                        "name": "Kim S."
                    }
                ],
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "StressGenePred: A twin prediction model architecture for classifying the stress types of samples and discovering stress-related genes in arabidopsis"
            },
            "pmcid": "PMC6923958",
            "pmid": "31856731"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}