{
    "additionDate": "2017-08-20T15:57:51Z",
    "biotoolsCURIE": "biotools:mach-admix",
    "biotoolsID": "mach-admix",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "yunli@med.unc.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Genotype imputation software that extends the capabilities of MaCH 1.0. It has incorporated a novel piecewise reference selection method to create reference panels tailored for target individual. This reference selection method generates better imputation quality in shorter running time. It also separates model parameter estimation from imputation. The separation allows users to perform imputation with standard reference panels + pre-calibrated parameters in a data independent fashion.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.unc.edu/~yunmli/MaCH-Admix/tutorial.php"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Reference identification",
                    "uri": "http://edamontology.org/operation_3703"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "https://yunliweb.its.unc.edu//MaCH-Admix/index.php",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "MaCH-Admix",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1002/gepi.21690",
            "metadata": {
                "abstract": "Imputation in admixed populations is an important problem but challenging due to the complex linkage disequilibrium (LD) pattern. The emergence of large reference panels such as that from the 1,000 Genomes Project enables more accurate imputation in general, and in particular for admixed populations and for uncommon variants. To efficiently benefit from these large reference panels, one key issue to consider in modern genotype imputation framework is the selection of effective reference panels. In this work, we consider a number of methods for effective reference panel construction inside a hidden Markov model and specific to each target individual. These methods fall into two categories: identity-by-state (IBS) based and ancestry-weighted approach. We evaluated the performance on individuals from recently admixed populations. Our target samples include 8,421 African Americans and 3,587 Hispanic Americans from the Women' Health Initiative, which allow assessment of imputation quality for uncommon variants. Our experiments include both large and small reference panels; large, medium, and small target samples; and in genome regions of varying levels of LD. We also include BEAGLE and IMPUTE2 for comparison. Experiment results with large reference panel suggest that our novel piecewise IBS method yields consistently higher imputation quality than other methods/software. The advantage is particularly noteworthy among uncommon variants where we observe up to 5.1% information gain with the difference being highly significant (Wilcoxon signed rank test P-value < 0.0001). Our work is the first that considers various sensible approaches for imputation in admixed populations and presents a comprehensive comparison. © 2012 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Liu E.Y."
                    },
                    {
                        "name": "Li M."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Li Y."
                    }
                ],
                "citationCount": 86,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "MaCH-Admix: Genotype Imputation for Admixed Populations"
            },
            "pmcid": "PMC3524415",
            "pmid": "23074066",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}