{
    "additionDate": "2021-01-18T09:28:41Z",
    "biotoolsCURIE": "biotools:fsbc",
    "biotoolsID": "fsbc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "katou-s-mxn@nec.com",
            "name": "Shintaro Kato",
            "orcidid": "https://orcid.org/0000-0001-6240-1326",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast String-Based Clustering (FSBC) is a tool to estimate clusters by searching various lengths of over-represented strings as target binding regions. FSBC can perform fast calculation with search space reduction from a single round, typically the final round, of HT-SELEX data considering imbalanced nucleobases of the aptamer selection process.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.aoki.ecei.tohoku.ac.jp/fsbc/",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2021-03-11T12:49:07Z",
    "name": "FSBC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03607-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The combination of systematic evolution of ligands by exponential enrichment (SELEX) and deep sequencing is termed high-throughput (HT)-SELEX, which enables searching aptamer candidates from a massive amount of oligonucleotide sequences. A clustering method is an important procedure to identify sequence groups including aptamer candidates for evaluation with experimental analysis. In general, aptamer includes a specific target binding region, which is necessary for binding to the target molecules. The length of the target binding region varies depending on the target molecules and/or binding styles. Currently available clustering methods for HT-SELEX only estimate clusters based on the similarity of full-length sequences or limited length of motifs as target binding regions. Hence, a clustering method considering the target binding region with different lengths is required. Moreover, to handle such huge data and to save sequencing cost, a clustering method with fast calculation from a single round of HT-SELEX data, not multiple rounds, is also preferred. Results: We developed fast string-based clustering (FSBC) for HT-SELEX data. FSBC was designed to estimate clusters by searching various lengths of over-represented strings as target binding regions. FSBC was also designed for fast calculation with search space reduction from a single round, typically the final round, of HT-SELEX data considering imbalanced nucleobases of the aptamer selection process. The calculation time and clustering accuracy of FSBC were compared with those of four conventional clustering methods, FASTAptamer, AptaCluster, APTANI, and AptaTRACE, using HT-SELEX data (>15 million oligonucleotide sequences). FSBC, AptaCluster, and AptaTRACE could complete the clustering for all sequence data, and FSBC and AptaTRACE performed higher clustering accuracy. FSBC showed the highest clustering accuracy and had the second fastest calculation speed among all methods compared. Conclusion: FSBC is applicable to a large HT-SELEX dataset, which can facilitate the accurate identification of groups including aptamer candidates. Availability of data and materials: FSBC is available at http://www.aoki.ecei.tohoku.ac.jp/fsbc/.",
                "authors": [
                    {
                        "name": "Kato S."
                    },
                    {
                        "name": "Kato S."
                    },
                    {
                        "name": "Ono T."
                    },
                    {
                        "name": "Minagawa H."
                    },
                    {
                        "name": "Horii K."
                    },
                    {
                        "name": "Shiratori I."
                    },
                    {
                        "name": "Waga I."
                    },
                    {
                        "name": "Ito K."
                    },
                    {
                        "name": "Aoki T."
                    }
                ],
                "date": "2020-06-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FSBC: fast string-based clustering for HT-SELEX data"
            },
            "pmcid": "PMC7313139",
            "pmid": "32580745"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}