{
    "additionDate": "2021-01-18T09:06:46Z",
    "biotoolsCURIE": "biotools:lpi-cnncp",
    "biotoolsID": "lpi-cnncp",
    "confidence_flag": "tool",
    "description": "Prediction of lncRNA-protein interactions by using convolutional neural network with the copy-padding trick.\n\nLPI-CNNCP designs a copy-padding trick to turn the protein/RNA sequences with variable-length into the fixed-length sequences, letting them meet the input requirements of CNN model. Then, the high-order one-hot encoding way is used to transform the protein/RNA sequences into image-like inputs of non-independent for capturing the dependencies among amino acids (or nucleotides). In the end, these encoded protein/RNA sequences are feed into a convolutional neural network to predict the lncRNA-protein interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NWPU-903PR/LPI-CNNCP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-19T07:58:57Z",
    "name": "LPI-CNNCP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.AB.2020.113767",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.Long noncoding RNAs (lncRNAs) play critical roles in many pathological and biological processes, such as post-transcription, cell differentiation and gene regulation. Increasingly more studies have shown that lncRNAs function through mainly interactions with specific RNA binding proteins (RBPs). However, experimental identification of potential lncRNA-protein interactions is costly and time-consuming. In this work, we propose a novel convolutional neural network-based method with the copy-padding trick (named LPI-CNNCP) to predict lncRNA-protein interactions. The copy-padding trick of the LPI-CNNCP convert the protein/RNA sequences with variable-length into the fixed-length sequences, thus enabling the construction of the CNN model. A high-order one-hot encoding is also applied to transform the protein/RNA sequences into image-like inputs for capturing the dependencies among amino acids (or nucleotides). In the end, these encoded protein/RNA sequences are feed into a CNN to predict the lncRNA-protein interactions. Compared with other state-of-the-art methods in 10-fold cross-validation (10CV) test, LPI-CNNCP shows the best performance. Results in the independent test demonstrate that our LPI-CNNCP can effectively predict the potential lncRNA-protein interactions. We also compared the copy-padding trick with two other existing tricks (i.e., zero-padding and cropping), and the results show that our copy-padding rick outperforms the zero-padding and cropping tricks on predicting lncRNA-protein interactions. The source code of LPI-CNNCP and the datasets used in this work are available at https://github.com/NWPU-903PR/LPI-CNNCP for academic users.",
                "authors": [
                    {
                        "name": "Zhang S.-W."
                    },
                    {
                        "name": "Zhang X.-X."
                    },
                    {
                        "name": "Fan X.-N."
                    },
                    {
                        "name": "Li W.-N."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-15T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "LPI-CNNCP: Prediction of lncRNA-protein interactions by using convolutional neural network with the copy-padding trick"
            },
            "pmid": "32454029"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}