{
    "additionDate": "2016-05-17T10:18:45Z",
    "biotoolsCURIE": "biotools:netter",
    "biotoolsID": "netter",
    "collectionID": [
        "BIG N2N",
        "UGent"
    ],
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "Yvan.Saeys@ugent.be",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Re-ranking gene network inference predictions using structural network properties.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinformatics.intec.ugent.be/netter/doc/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    }
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.intec.ugent.be/netter/index.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "Netter",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Katrijn.Vannerum@ugent.be",
    "publication": [
        {
            "doi": "10.1186/s12859-016-0913-0",
            "metadata": {
                "abstract": "© 2016 Ruyssinck et al.Background: Many algorithms have been developed to infer the topology of gene regulatory networks from gene expression data. These methods typically produce a ranking of links between genes with associated confidence scores, after which a certain threshold is chosen to produce the inferred topology. However, the structural properties of the predicted network do not resemble those typical for a gene regulatory network, as most algorithms only take into account connections found in the data and do not include known graph properties in their inference process. This lowers the prediction accuracy of these methods, limiting their usability in practice. Results: We propose a post-processing algorithm which is applicable to any confidence ranking of regulatory interactions obtained from a network inference method which can use, inter alia, graphlets and several graph-invariant properties to re-rank the links into a more accurate prediction. To demonstrate the potential of our approach, we re-rank predictions of six different state-of-the-art algorithms using three simple network properties as optimization criteria and show that Netter can improve the predictions made on both artificially generated data as well as the DREAM4 and DREAM5 benchmarks. Additionally, the DREAM5 E.coli. community prediction inferred from real expression data is further improved. Furthermore, Netter compares favorably to other post-processing algorithms and is not restricted to correlation-like predictions. Lastly, we demonstrate that the performance increase is robust for a wide range of parameter settings. Netter is available at http://bioinformatics.intec.ugent.be. Conclusions: Network inference from high-throughput data is a long-standing challenge. In this work, we present Netter, which can further refine network predictions based on a set of user-defined graph properties. Netter is a flexible system which can be applied in unison with any method producing a ranking from omics data. It can be tailored to specific prior knowledge by expert users but can also be applied in general uses cases. Concluding, we believe that Netter is an interesting second step in the network inference process to further increase the quality of prediction.",
                "authors": [
                    {
                        "name": "Ruyssinck J."
                    },
                    {
                        "name": "Demeester P."
                    },
                    {
                        "name": "Dhaene T."
                    },
                    {
                        "name": "Saeys Y."
                    }
                ],
                "citationCount": 4,
                "date": "2016-02-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Netter: Re-ranking gene network inference predictions using structural network properties"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}