{
    "accessibility": [],
    "additionDate": "2016-10-03T14:08:37Z",
    "biotoolsCURIE": "biotools:wenmr_gromacs",
    "biotoolsID": "wenmr_gromacs",
    "collectionID": [
        "BioExcel"
    ],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": "University of Utrech",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.uu.nl/organisatie/contact"
        }
    ],
    "description": "The WeNMR web portal combines the versatility of this molecular dynamics package with the calculation power of the eNMR grid. This will enable you to perform many simulations from the comfort of your internet browser anywhere in the world. The server is furthermore aimed to provide a user friendly and efficient MD experience by performing many preparation and optimization steps automatically.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://haddock.science.uu.nl/enmr/services/GROMACS/usage.php"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://haddock.science.uu.nl/enmr/services/GROMACS/main.php",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "WeNMR GROMACS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "jdianes",
    "publication": [
        {
            "doi": "10.1021/ct300102d",
            "metadata": {
                "abstract": "Molecular dynamics simulations are becoming a standard part of workflows in structural biology. They are used for tasks as diverse as assessing molecular flexibility, probing conformational changes, assessing the impact of mutations, or gaining information about molecular interactions. However, performing a successful simulation requires sufficient computational resources, familiarity with the simulation software, and experience in the setup of a system and the analysis of the resulting trajectories. These considerations become especially critical in large-scale parametric MD simulations. Offering such tools to a wide user community requires a robust and versatile, but user-friendly, facility for molecular dynamics simulations with access to vast computational resources. Here, we present the GROMACS grid-enabled Web portal for the setup and execution of molecular dynamics simulation on the WeNMR grid infrastructure, a distributed network of computational resources within the European Grid Initiative. The Web portal aims at ease-of-use through automated setup of the simulation system using best-practice protocols, yet allowing for tuning of key parameters. Alternatively, the simulation can be started from preconfigured GROMACS simulation systems. Performing multiple lengthy calculations using multiple processors on the WeNMR grid infrastructure ensures scalability. The combination of analysis routines for quality assurance and automatic recovery in case of failures provides a reliable platform for MD simulations. The GROMACS Web portal is embedded within the services of the WeNMR Virtual Research Community (VRC) accessible from http://www.wenmr.eu/wenmr/nmr-services. It is freely accessible upon registration with a valid X509 personal certificate with the enmr.eu Virtual Organization (VO). © 2012 American Chemical Society.",
                "authors": [
                    {
                        "name": "Van Dijk M."
                    },
                    {
                        "name": "Wassenaar T.A."
                    },
                    {
                        "name": "Bonvin A.M.J.J."
                    }
                ],
                "citationCount": 18,
                "date": "2012-10-09T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "A flexible, grid-enabled web portal for GROMACS molecular dynamics simulations"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1,
    "version": []
}