{
    "additionDate": "2021-01-18T08:14:17Z",
    "biotoolsCURIE": "biotools:amlrs",
    "biotoolsID": "amlrs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zk887073@126.com",
            "name": "Xiaohui Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "a web‐based prognostic model to predict the prognosis of Acute myeloid leukaemia patients. Using log-rank test and univariate COX regression analysis as well as LASSO-COX, AML patients were divided into high-risk and low-risk groups based on AML risk score (AMLRS) which was constituted by 10 survival-related genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://tcgi.shinyapps.io/amlrs_nomogram/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-23T15:02:00Z",
    "name": "AMLRS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/JCMM.15109",
            "metadata": {
                "abstract": "© 2020 The Authors. Journal of Cellular and Molecular Medicine published by Foundation for Cellular and Molecular Medicine and John Wiley & Sons Ltd.Acute myeloid leukaemia (AML) is the most common type of adult acute leukaemia and has a poor prognosis. Thus, optimal risk stratification is of greatest importance for reasonable choice of treatment and prognostic evaluation. For our study, a total of 1707 samples of AML patients from three public databases were divided into meta-training, meta-testing and validation sets. The meta-training set was used to build risk prediction model, and the other four data sets were employed for validation. By log-rank test and univariate COX regression analysis as well as LASSO-COX, AML patients were divided into high-risk and low-risk groups based on AML risk score (AMLRS) which was constituted by 10 survival-related genes. In meta-training, meta-testing and validation sets, the patient in the low-risk group all had a significantly longer OS (overall survival) than those in the high-risk group (P <.001), and the area under ROC curve (AUC) by time-dependent ROC was 0.5854-0.7905 for 1 year, 0.6652-0.8066 for 3 years and 0.6622-0.8034 for 5 years. Multivariate COX regression analysis indicated that AMLRS was an independent prognostic factor in four data sets. Nomogram combining the AMLRS and two clinical parameters performed well in predicting 1-year, 3-year and 5-year OS. Finally, we created a web-based prognostic model to predict the prognosis of AML patients (https://tcgi.shinyapps.io/amlrs_nomogram/).",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Shang J."
                    },
                    {
                        "name": "Tang T."
                    },
                    {
                        "name": "Tian G."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 5,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Journal of Cellular and Molecular Medicine",
                "title": "Development and validation of a 10-gene prognostic signature for acute myeloid leukaemia"
            },
            "pmcid": "PMC7176885",
            "pmid": "32150667"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}
