{
    "additionDate": "2020-04-23T07:50:13Z",
    "biotoolsCURIE": "biotools:metabolicatlas",
    "biotoolsID": "metabolicatlas",
    "credit": [
        {
            "email": "contact@metabolicatlas.org"
        }
    ],
    "description": "Metabolic Atlas integrates open source genome-scale metabolic models (GEMs) of human and yeast for easy browsing and analysis. It also contains many more GEMs constructed by our organization. Detailed biochemical information is provided for individual model components, such as reactions, metabolites, and genes. These components are also associated with standard identifiers, facilitating integration with external databases, such as the Human Protein Atlas.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://metabolicatlas.org/api"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://metabolicatlas.org/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Map drawing",
                    "uri": "http://edamontology.org/operation_0573"
                },
                {
                    "term": "Pathway visualisation",
                    "uri": "http://edamontology.org/operation_3926"
                }
            ]
        }
    ],
    "homepage": "https://metabolicatlas.org",
    "lastUpdate": "2023-02-03T12:35:38.478224Z",
    "license": "GPL-3.0",
    "maturity": "Emerging",
    "name": "Metabolic Atlas",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "doi",
            "value": "doi:10.1126/scisignal.aaz1482",
            "version": "1.6"
        }
    ],
    "owner": "M",
    "publication": [
        {
            "doi": "10.1073/pnas.2102344118",
            "metadata": {
                "abstract": "https://doi.org/10.1073/pnas.2102344118Genome-scale metabolic models (GEMs) are used extensively for analysis of mechanisms underlying human diseases and metabolic malfunctions. However, the lack of comprehensive and high-quality GEMs for model organisms restricts translational utilization of omics data accumulating from the use of various disease models. Here we present a unified platform of GEMs that covers five major model animals, including Mouse1 (Mus musculus), Rat1 (Rattus norvegicus), Zebrafish1 (Danio rerio), Fruitfly1 (Drosophila melanogaster), and Worm1 (Caenorhabditis elegans). These GEMs represent the most comprehensive coverage of the metabolic network by considering both orthology-based pathways and species-specific reactions. All GEMs can be interactively queried via the accompanying web portal Metabolic Atlas. Specifically, through integrative analysis of Mouse1 with RNA-sequencing data from brain tissues of transgenic mice we identified a coordinated up-regulation of lysosomal GM2 ganglioside and peptide degradation pathways which appears to be a signature metabolic alteration in Alzheimer’s disease (AD) mouse models with a phenotype of amyloid precursor protein overexpression. This metabolic shift was further validated with proteomics data from transgenic mice and cerebrospinal fluid samples from human patients. The elevated lysosomal enzymes thus hold potential to be used as a biomarker for early diagnosis of AD. Taken together, we foresee that this evolving open-source platform will serve as an important resource to facilitate the development of systems medicines and translational biomedical applications.",
                "authors": [
                    {
                        "name": "Anton M."
                    },
                    {
                        "name": "Cholley P.-E."
                    },
                    {
                        "name": "Gobom J."
                    },
                    {
                        "name": "Gustafsson J."
                    },
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Kocabas P."
                    },
                    {
                        "name": "Nielsen J."
                    },
                    {
                        "name": "Robinson J.L."
                    },
                    {
                        "name": "Svensson T."
                    },
                    {
                        "name": "Uhlen M."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zetterberg H."
                    }
                ],
                "citationCount": 14,
                "date": "2021-07-27T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Genome-scale metabolic network reconstruction of model animals as a platform for translational research"
            },
            "pmid": "34282017"
        },
        {
            "doi": "10.1126/scisignal.aaz1482",
            "metadata": {
                "abstract": "Copyright © 2020 The Authors, some rights reserved.Genome-scale metabolic models (GEMs) are valuable tools to study metabolism and provide a scaffold for the integrative analysis of omics data. Researchers have developed increasingly comprehensive human GEMs, but the disconnect among different model sources and versions impedes further progress. We therefore integrated and extensively curated the most recent human metabolic models to construct a consensus GEM, Human1. We demonstrated the versatility of Human1 through the generation and analysis of cell- and tissue-specific models using transcriptomic, proteomic, and kinetic data. We also present an accompanying web portal, Metabolic Atlas (https://www.metabolicatlas.org/), which facilitates further exploration and visualization of Human1 content. Human1 was created using a version-controlled, open-source model development framework to enable community-driven curation and refinement. This framework allows Human1 to be an evolving shared resource for future studies of human health and disease.",
                "authors": [
                    {
                        "name": "Anton M."
                    },
                    {
                        "name": "Billa V."
                    },
                    {
                        "name": "Cholley P.-E."
                    },
                    {
                        "name": "Cook D."
                    },
                    {
                        "name": "Domenzain I."
                    },
                    {
                        "name": "Ferreira R."
                    },
                    {
                        "name": "Gustafsson J."
                    },
                    {
                        "name": "Hansson L."
                    },
                    {
                        "name": "Hedin A."
                    },
                    {
                        "name": "Kerkhoven E.J."
                    },
                    {
                        "name": "Kocabas P."
                    },
                    {
                        "name": "Limeta A."
                    },
                    {
                        "name": "Mardinoglu A."
                    },
                    {
                        "name": "Nielsen J."
                    },
                    {
                        "name": "Nilsson A."
                    },
                    {
                        "name": "Palsson B.O."
                    },
                    {
                        "name": "Robinson J.L."
                    },
                    {
                        "name": "Svensson L.T."
                    },
                    {
                        "name": "Uhlen M."
                    },
                    {
                        "name": "Wang H."
                    }
                ],
                "citationCount": 103,
                "date": "2020-03-24T00:00:00Z",
                "journal": "Science Signaling",
                "title": "An atlas of human metabolism"
            },
            "pmid": "32209698"
        },
        {
            "doi": "10.1093/nar/gkac831",
            "pmid": "36169223"
        }
    ],
    "relation": [
        {
            "biotoolsID": "proteinatlas",
            "type": "usedBy"
        },
        {
            "biotoolsID": "proteinatlas",
            "type": "uses"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}
