
{
    "credit": [
        {
            "email": "kmakova@bx.psu.edu",
            "name": "Kateryna D Makova",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "pashadag@cse.psu.edu",
            "name": "Paul Medvedev",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/makovalab-psu/RecoverY"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence classification",
                    "uri": "http://edamontology.org/operation_2995"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Motivation The haploid mammalian Y chromosome is usually under-represented in genome assemblies due to high repeat content and low depth due to its haploid nature. One strategy to ameliorate the low coverage of Y sequences is to experimentally enrich Y-specific material before assembly. As the enrichment process is imperfect, algorithms are needed to identify putative Y-specific reads prior to downstream assembly. A strategy that uses k-mer abundances to identify such reads was used to assemble the gorilla Y. However, the strategy required the manual setting of key parameters, a time-consuming process leading to sub-optimal assemblies. Results We develop a method, RecoverY, that selects Y-specific reads by automatically choosing the abundance level at which a k-mer is deemed to originate from the Y. This algorithm uses prior knowledge about the Y chromosome of a related species or known Y transcript sequences. We evaluate RecoverY on both simulated and real data, for human and gorilla, and investigate its robustness to important parameters. We show that RecoverY leads to a vastly superior assembly compared to alternate strategies of filtering the reads or contigs. Compared to the preliminary strategy used by Tomaszkiewicz et al., we achieve a 33% improvement in assembly size and a 20% improvement in the NG50, demonstrating the power of automatic parameter selection. Availability and implementation Our tool RecoverY is freely available at https://github.com/makovalab-psu/RecoverY. Contact kmakova@bx.psu.edu or pashadag@cse.psu.edu Supplementary informationSupplementary data are available at Bioinformatics online.",
            "authors": [
                "Rangavittal S.",
                "Harris R.S.",
                "Cechova M.",
                "Tomaszkiewicz M.",
                "Chikhi R.",
                "Makova K.D.",
                "Medvedev P."
            ],
            "cit_count": 2,
            "doi": "10.1093/bioinformatics/btx771",
            "journal": "Bioinformatics",
            "title": "RecoverY: K-mer-based read classification for Y-chromosome-specific sequencing and assembly",
            "year": "2018-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:recovery",
        "biotoolsID": "recovery",
        "description": "K-mer-based read classification for Y-chromosome-specific sequencing and assembly.",
        "homepage": "https://github.com/makovalab-psu/RecoverY",
        "name": "RecoverY"
    }
}