{
    "additionDate": "2021-01-18T07:44:12Z",
    "biotoolsCURIE": "biotools:sma",
    "biotoolsID": "sma",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "olivier.seynnes@nih.no",
            "name": "Olivier R. Seynnes",
            "orcidid": "https://orcid.org/0000-0002-1289-246X",
            "typeEntity": "Person"
        }
    ],
    "description": "An ImageJ macro tool to automate measurements in B-mode ultrasound scans.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Protein architecture analysis",
                    "uri": "http://edamontology.org/operation_0247"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://sites.imagej.net/SMA/plugins/",
    "lastUpdate": "2021-02-19T15:47:41Z",
    "name": "Simple Muscle Architecture Analysis",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0229034",
            "metadata": {
                "abstract": "© 2020 Seynnes, Cronin. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In vivo measurements of muscle architecture (i.e. the spatial arrangement of muscle fascicles) are routinely included in research and clinical settings to monitor muscle structure, function and plasticity. However, in most cases such measurements are performed manually, and more reliable and time-efficient automated methods are either lacking completely, or are inaccessible to those without expertise in image analysis. In this work, we propose an ImageJ script to automate the entire analysis process of muscle architecture in ultrasound images: Simple Muscle Architecture Analysis (SMA). Images are filtered in the spatial and frequency domains with built-in commands and external plugins to highlight aponeuroses and fascicles. Fascicle dominant orientation is then computed in regions of interest using the OrientationJ plugin. Bland-Altman plots of analyses performed manually or with SMA indicate that the automated analysis does not induce any systematic bias and that both methods agree equally through the range of measurements. Our test results illustrate the suitability of SMA to analyse images from superficial muscles acquired with a broad range of ultrasound settings.",
                "authors": [
                    {
                        "name": "Seynnes O.R."
                    },
                    {
                        "name": "Cronin N.J."
                    }
                ],
                "citationCount": 9,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Simple muscle architecture analysis (SMA): An ImageJ macro tool to automate measurements in B-mode ultrasound scans"
            },
            "pmcid": "PMC7015391",
            "pmid": "32049973"
        }
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ]
}