{
    "additionDate": "2018-08-24T09:58:27Z",
    "biotoolsCURIE": "biotools:canvar",
    "biotoolsID": "canvar",
    "credit": [
        {
            "email": "daniel.chubb@icr.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Variant level frequency data from cancer germline sequencing studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Exome assembly",
                    "uri": "http://edamontology.org/operation_3229"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://canvar.icr.ac.uk",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/danchubb/CanVar"
        }
    ],
    "name": "CanVar",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.10058.1",
            "metadata": {
                "abstract": "© 2016 Chubb D et al.The advent of high-throughput sequencing has accelerated our ability to discover genes predisposing to disease and is transforming clinical genomic sequencing. In both contexts knowledge of the spectrum and frequency of genetic variation in the general population and in disease cohorts is vital to the interpretation of sequencing data. While population level data is becoming increasingly available from publicly accessible sources, as exemplified by The Exome Aggregation Consortium (ExAC), the availability of large-scale disease-specific frequency information is limited. These data are of particular importance to contextualise findings from clinical mutation screens and small gene discovery projects. This is especially true for cancer, which is typified by a number of hereditary predisposition syndromes. Although mutation frequencies in tumours are available from resources such as Cosmic and The Cancer Genome Atlas, a similar facility for germline variation is lacking. Here we present the Cancer Variation Resource (CanVar) an online database which has been developed using the ExAC framework to provide open access to germline variant frequency data from the sequenced exomes of cancer patients. In its first release, CanVar catalogues the exomes of 1,006 familial early-onset colorectal cancer (CRC) patients sequenced at The Institute of Cancer Research. It is anticipated that CanVar will host data for additional cancers, providing a resource for others studying cancer predisposition and an example of how the research community can utilise the ExAC framework to share sequencing data.",
                "authors": [
                    {
                        "name": "Broderick P."
                    },
                    {
                        "name": "Chubb D."
                    },
                    {
                        "name": "Dobbins S.E."
                    },
                    {
                        "name": "Houlston R.S."
                    }
                ],
                "citationCount": 6,
                "date": "2016-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "CanVar: A resource for sharing germline variation in cancer patients"
            },
            "pmcid": "PMC5200944",
            "pmid": "28105316"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
