{
    "accessibility": "Open access",
    "additionDate": "2023-09-25T17:15:56.465153Z",
    "biotoolsCURIE": "biotools:pxstools",
    "biotoolsID": "pxstools",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chirag_patel@hms.harvard.edu",
            "name": "Chirag J Patel",
            "orcidid": "https://orcid.org/0000-0002-8756-8525",
            "typeEntity": "Person"
        }
    ],
    "description": "R package of tools for conducting exposure-wide analysis and deriving polyexposure risk scores.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yixuanh/PXStools",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-09-25T17:15:56.467728Z",
    "name": "PXStools",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/IJE/DYAC216",
            "metadata": {
                "abstract": "Motivation: Investigating the aggregate burden of environmental factors on human traits and diseases requires consideration of the entire ‘exposome’. However, current studies primarily focus on a single exposure or a handful of exposures at a time, without considering how multiple exposures may be simultaneously associated with each other or with the phenotype. Polyexposure risk scores (PXS) have been shown to predict and stratify risk for disease beyond or complementary to genetic and clinical risk. PXStools provides an analytical package to standardize exposome-wide studies as well as derive and validate polyexposure risk scores. Implementation: PXStools is a package for the statistical R. General features: The package allows users to (i) conduct exposure-wide association studies; (ii) derive and validate polyexposure risk scores with and without accounting for exposure interactions, using new approaches in regression modelling (hierarchical lasso);(iii) compare goodness of fit between models with and without multiple exposures; and (iv) visualize results. A data frame with a unique identifier, phenotype and exposures is needed as the only input. Various customizations are allowed including data preprocessing (removing missing or unwanted responses), covariates adjustment, multiple hypothesis correction and model specification (linear, logistic, survival).",
                "authors": [
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Patel C.J."
                    }
                ],
                "date": "2023-04-01T00:00:00Z",
                "journal": "International Journal of Epidemiology",
                "title": "Software Application Profile: PXStools—an R package of tools for conducting exposure-wide analysis and deriving polyexposure risk scores"
            },
            "pmcid": "PMC10114106",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
