
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Surgery",
                "uri": "http://edamontology.org/topic_3421"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            }
        ]
    },
    "publication": [
        {
            "abstract": "In 2016, deceased-donor organ procurement at Wits Transplant, based at Wits Donald Gordon Medical Centre in Johannesburg, South Africa (SA), was in a state of crisis. As it is the largest-volume solid-organ transplant unit in SA, and as we aspire to provide transplant services of an international standard, the time to address our procurement practice had come. The number of deceased donors consented through our centre was very low, and we needed a radical change to improve our performance. This article describes the Wits Transplant Procurement Model - the result of our work to improve procurement at our centre. The model has two core phases, one to increase referrals and the other to improve our consent rates. Within these phases there are several initiatives. To improve referrals, the threefold approach of procurement management, acknowledgement and resource utilisation was developed. In order to 'convert' referrals into consents, we established the Wits Transplant 'Family Approach to Consent for Transplant Strategy' (FACTS). Since initiation of the Wits Transplant Procurement Model, both our referral numbers from targeted hospitals and our conversion rates have increased. Referrals from targeted hospitals increased by 54% (from 31 to 57). Our consent rate increased from 25% (n=6) to 73% (n=35) after the initiation of Wits Transplant FACTS. We hope that other transplant centres in SA and further afield in the region will find this article helpful, and to this end we have created a handbook on the Wits Transplant Procurement Model that is freely available for download (http://www.dgmc.co.za/docs/Wits-Transplant-Procurement-Handbook.pdf).",
            "authors": [
                "De Jager M.",
                "Wilmans C.",
                "Fabian J.",
                "Botha J.F.",
                "Etheredge H.R."
            ],
            "cit_count": 1,
            "doi": "10.7196/SAMJ.2019.V109I9.14313",
            "journal": "South African medical journal = Suid-Afrikaanse tydskrif vir geneeskunde",
            "pmid": "31635584",
            "title": "Increasing deceased organ donor numbers in Johannesburg, South Africa: 18-month results of the Wits Transplant Procurement Model",
            "year": "2019-08-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Wits_Transplant_Procurement",
        "biotoolsID": "Wits_Transplant_Procurement",
        "description": "Increasing deceased organ donor numbers in Johannesburg, South Africa.\n\nIn 2016, deceased-donor organ procurement at Wits Transplant, based at Wits Donald Gordon Medical Centre in Johannesburg, South Africa (SA), was in a state of crisis. As it is the largest-volume solid-organ transplant unit in SA, and as we aspire to provide transplant services of an international standard, the time to address our procurement practice had come. The number of deceased donors consented through our centre was very low, and we needed a radical change to improve our performance. This article describes the Wits Transplant Procurement Model - the result of our work to improve procurement at our centre. The model has two core phases, one to increase referrals and the other to improve our consent rates. Within these phases there are several initiatives. To improve referrals, the threefold approach of procurement management, acknowledgement and resource utilisation was developed",
        "homepage": "http://www.dgmc.co.za/docs/Wits-Transplant-Procurement-Handbook.pdf",
        "name": "Wits Transplant Procurement"
    }
}