{
    "accessibility": "Open access",
    "additionDate": "2022-03-01T20:06:53.350213Z",
    "biotoolsCURIE": "biotools:hfoapp",
    "biotoolsID": "hfoapp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guangyu.zhou@northwestern.edu",
            "name": "Guangyu Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "Arjun Sharma"
        },
        {
            "name": "Karina A. González Otárula"
        },
        {
            "name": "Qiaohan Yang"
        },
        {
            "name": "Torben Noto"
        }
    ],
    "description": "A MATLAB-based graphic user interface for high frequency oscillations marking.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/zelanolab/hfoapp/blob/main/HFOApp_Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zelanolab/hfoapp.git",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2022-03-01T20:06:53.353681Z",
    "license": "GPL-3.0",
    "name": "HFOApp",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1523/ENEURO.0509-20.2021",
            "metadata": {
                "abstract": "© 2021 Zhou et al.Epilepsy affects 3.4 million people in the United States, and, despite the availability of numerous antiepileptic drugs, 36% of patients have uncontrollable seizures, which severely impact quality of life. High-frequency oscillations (HFOs) are a potential biomarker of epileptogenic tissue that could be useful in surgical planning. As a result, research into the efficacy of HFOs as a clinical tool has increased over the last 2 decades. However, detection and identification of these transient rhythms in intracranial electroencephalographic recordings re-main time-consuming and challenging. Although automated detection algorithms have been developed, their results are widely inconsistent, reducing reliability. Thus, manual marking of HFOs remains the gold standard, and manual review of automated results is required. However, manual marking and review are time consuming and can still produce variable results because of their subjective nature and the limitations in functionality of existing open-source software. Our goal was to develop a new software with broad application that improves on existing open-source HFO detection applications in usability, speed, and accuracy. Here, we present HFOApp: a free, open-source, easy-to-use MATLAB-based graphical user interface for HFO marking. This toolbox offers a high degree of intuitive and ergonomic usability and integrates interactive automation-assist options with manual marking, significantly reducing the time needed for review and manual marking of recordings, while increasing interrater reliability. The toolbox also features simultaneous multichannel detection and marking. HFOApp was designed as an easy-to-use toolbox for clinicians and researchers to quickly and accu-rately mark, quantify, and characterize HFOs within electrophysiological datasets.",
                "authors": [
                    {
                        "name": "Gonzalez Otarula K.A."
                    },
                    {
                        "name": "Lane G."
                    },
                    {
                        "name": "Noto T."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Tate M."
                    },
                    {
                        "name": "Templer J.W."
                    },
                    {
                        "name": "Yang Q."
                    },
                    {
                        "name": "Zelano C."
                    },
                    {
                        "name": "Zhou G."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "eNeuro",
                "title": "Hfoapp: A matlab graphical user interface for high-frequency oscillation marking"
            },
            "pmcid": "PMC8503963",
            "pmid": "34544760"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
