{
    "additionDate": "2021-01-18T11:53:11Z",
    "biotoolsCURIE": "biotools:prothermdb",
    "biotoolsID": "prothermdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gromiha@iitm.ac.in",
            "name": "M Michael Gromiha",
            "typeEntity": "Person"
        }
    ],
    "description": "ProThermDB, thermodynamic Database for Proteins and Mutants (ProThermDB) contains more than 32,000 data of several thermodynamic parameters such as melting temperature, free energy obtained with thermal and denaturant denaturation, enthalpy change, and heat capacity change along with experimental methods and conditions, sequence, structure, and literature information. Besides, the current version of the database includes ~0.12 million thermodynamic data obtained for different organisms and cell lines, which are determined by recent high throughput proteomics techniques using whole-cell approaches. In addition, we provided a graphical interface for the visualization of mutations at sequence and structure levels. ProThermDB is cross-linked with other relevant databases, PDB, UniProt, PubMed, etc.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://web.iitm.ac.in/bioinfo2/prothermdb/index.html",
    "language": [
        "Python",
        "JavaScript"
    ],
    "lastUpdate": "2021-01-29T17:26:53Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://web.iitm.ac.in/bioinfo2/prothermdb/Statistics.html"
        }
    ],
    "name": "ProThermDB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1035",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited.ProThermDB is an updated version of the thermodynamic database for proteins and mutants (ProTherm), which has ∼31 500 data on protein stability, an increase of 84% from the previous version. It contains several thermodynamic parameters such as melting temperature, free energy obtained with thermal and denaturant denaturation, enthalpy change and heat capacity change along with experimental methods and conditions, sequence, structure and literature information. Besides, the current version of the database includes about 120 000 thermodynamic data obtained for different organisms and cell lines, which are determined by recent high throughput proteomics techniques using whole-cell approaches. In addition, we provided a graphical interface for visualization of mutations at sequence and structure levels. ProThermDB is cross-linked with other relevant databases, PDB, UniProt, PubMed etc. It is freely available at https://web.iitm.ac.in/bioinfo2/prothermdb/index.html without any lo-gin requirements. It is implemented in Python, HTML and JavaScript, and supports the latest versions of major browsers, such as Firefox, Chrome and Safari.",
                "authors": [
                    {
                        "name": "Nikam R."
                    },
                    {
                        "name": "Kulandaisamy A."
                    },
                    {
                        "name": "Harini K."
                    },
                    {
                        "name": "Sharma D."
                    },
                    {
                        "name": "Michael Gromiha M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProThermDB: Thermodynamic database for proteins and mutants revisited after 15 years"
            },
            "pmid": "33196841"
        }
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ]
}