{
    "accessibility": "Open access",
    "additionDate": "2018-07-26T15:22:12Z",
    "biotoolsCURIE": "biotools:panacea",
    "biotoolsID": "panacea",
    "credit": [
        {
            "email": "tclarke@jcvi.org",
            "name": "Thomas H. Clarke",
            "orcidid": "https://orcid.org/0000-0002-1916-1029",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Suite of PERL scripts that allows for visualization of prokaryotic pan-chromosomes, including core and variable regions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/JCVenterInstitute/PanACEA"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/JCVenterInstitute/PanACEA/blob/master/PanACEA.manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JCVenterInstitute/PanACEA",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "license": "GPL-2.0",
    "name": "PanACEA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2250-y",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: Bacterial pan-genomes, comprised of conserved and variable genes across multiple sequenced bacterial genomes, allow for identification of genomic regions that are phylogenetically discriminating or functionally important. Pan-genomes consist of large amounts of data, which can restrict researchers ability to locate and analyze these regions. Multiple software packages are available to visualize pan-genomes, but currently their ability to address these concerns are limited by using only pre-computed data sets, prioritizing core over variable gene clusters, or by not accounting for pan-chromosome positioning in the viewer. Results: We introduce PanACEA (Pan-genome Atlas with Chromosome Explorer and Analyzer), which utilizes locally-computed interactive web-pages to view ordered pan-genome data. It consists of multi-tiered, hierarchical display pages that extend from pan-chromosomes to both core and variable regions to single genes. Regions and genes are functionally annotated to allow for rapid searching and visual identification of regions of interest with the option that user-supplied genomic phylogenies and metadata can be incorporated. PanACEA's memory and time requirements are within the capacities of standard laptops. The capability of PanACEA as a research tool is demonstrated by highlighting a variable region important in differentiating strains of Enterobacter hormaechei. Conclusions: PanACEA can rapidly translate the results of pan-chromosome programs into an intuitive and interactive visual representation. It will empower researchers to visually explore and identify regions of the pan-chromosome that are most biologically interesting, and to obtain publication quality images of these regions.",
                "authors": [
                    {
                        "name": "Brinkac L.M."
                    },
                    {
                        "name": "Clarke T.H."
                    },
                    {
                        "name": "Fouts D.E."
                    },
                    {
                        "name": "Inman J.M."
                    },
                    {
                        "name": "Sutton G."
                    }
                ],
                "citationCount": 5,
                "date": "2018-06-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PanACEA: A bioinformatics tool for the exploration and visualization of bacterial pan-chromosomes"
            },
            "pmcid": "PMC6020400",
            "pmid": "29945570",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
