{
    "additionDate": "2023-01-08T15:20:47.053374Z",
    "biotoolsCURIE": "biotools:clin_skat",
    "biotoolsID": "clin_skat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tplu@ntu.edu.tw",
            "name": "Tzu-Pin Lu",
            "orcidid": "https://orcid.org/0000-0003-3697-0386",
            "typeEntity": "Person"
        }
    ],
    "description": "CLIN_SKAT is a package within the R programming language to (i) first extract clinically relevant variants (rare and common), followed by (ii) gene-based association analysis by grouping the selected variants.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ShihChingYu/CLIN_SKAT",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:13:55.693705Z",
    "license": "GPL-2.0",
    "name": "CLIN_SKAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04987-2",
            "metadata": {
                "abstract": "Background: Availability of next generation sequencing data, allows low-frequency and rare variants to be studied through strategies other than the commonly used genome-wide association studies (GWAS). Rare variants are important keys towards explaining the heritability for complex diseases that remains to be explained by common variants due to their low effect sizes. However, analysis strategies struggle to keep up with the huge amount of data at disposal therefore creating a bottleneck. This study describes CLIN_SKAT, an R package, that provides users with an easily implemented analysis pipeline with the goal of (i) extracting clinically relevant variants (both rare and common), followed by (ii) gene-based association analysis by grouping the selected variants. Results: CLIN_SKAT offers four simple functions that can be used to obtain clinically relevant variants, map them to genes or gene sets, calculate weights from global healthy populations and conduct weighted case–control analysis. CLIN_SKAT introduces improvements by adding certain pre-analysis steps and customizable features to make the SKAT results clinically more meaningful. Moreover, it offers several plot functions that can be availed towards obtaining visualizations for interpretation of the analyses results. CLIN_SKAT is available on Windows/Linux/MacOS and is operative for R version 4.0.4 or later. It can be freely downloaded from https://github.com/ShihChingYu/CLIN_SKAT, installed through devtools::install_github(\"ShihChingYu/CLIN_SKAT\", force=T) and executed by loading the package into R using library(CLIN_SKAT). All outputs (tabular and graphical) can be downloaded in simple, publishable formats. Conclusions: Statistical association analysis is often underpowered due to low sample sizes and high numbers of variants to be tested, limiting detection of causal ones. Therefore, retaining a subset of variants that are biologically meaningful seems to be a more effective strategy for identifying explainable associations while reducing the degrees of freedom. CLIN_SKAT offers users a one-stop R package that identifies disease risk variants with improved power via a series of tailor-made procedures that allows dimension reduction, by retaining functionally relevant variants, and incorporating ethnicity based priors. Furthermore, it also eliminates the requirement for high computational resources and bioinformatics expertise.",
                "authors": [
                    {
                        "name": "Chattopadhyay A."
                    },
                    {
                        "name": "Chuang E.Y."
                    },
                    {
                        "name": "Hsu Y.-C."
                    },
                    {
                        "name": "Juang J.-M.J."
                    },
                    {
                        "name": "Lu T.-P."
                    },
                    {
                        "name": "Shih C.-Y."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CLIN_SKAT: an R package to conduct association analysis using functionally relevant variants"
            },
            "pmcid": "PMC9590128",
            "pmid": "36274122"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
