{
    "name": "NetStrat", 
    "description": "Understanding the functional impact of copy number alterations in breast cancer using a network modeling approach.", 
    "homepage": "https://sites.google.com/site/netstratv1/", 
    "biotoolsID": "netstrat", 
    "biotoolsCURIE": "biotools:netstrat", 
    "version": [
        "v1"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction and recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Script"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3307", 
            "term": "Computational biology"
        }
    ], 
    "operatingSystem": [], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://sites.google.com/site/netstratv1/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "26805938", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Understanding the functional impact of copy number alterations in breast cancer using a network modeling approach", 
                "abstract": "© The Royal Society of Chemistry 2016. Copy number alterations (CNAs) are thought to account for 85% of the variation in gene expression observed among breast tumours. The expression of cis-associated genes is impacted by CNAs occurring at proximal loci of these genes, whereas the expression of trans-associated genes is impacted by CNAs occurring at distal loci. While a majority of these CNA-driven genes responsible for breast tumourigenesis are cis-associated, trans-associated genes are thought to further abet the development of cancer and influence disease outcomes in patients. Here we present a network-based approach that integrates copy-number and expression profiles to identify putative cis- and trans-associated genes in breast cancer pathogenesis. We validate these cis- and trans-associated genes by employing them to subtype a large cohort of breast tumours obtained from the METABRIC consortium, and demonstrate that these genes accurately reconstruct the ten subtypes of breast cancer. We observe that individual breast cancer subtypes are driven by distinct sets of cis- and trans-associated genes. Among the cis-associated genes, we recover several known drivers of breast cancer (e.g. CCND1, ERRB2, MDM2 and ZNF703) and some novel putative drivers (e.g. BRF2 and SF3B3). siRNA-mediated knockdown of BRF2 across a panel of breast cancer cell lines showed significant reduction in cell viability for ER-/HER2+ (MDA-MB-453) cells, but not in normal (MCF10A) cells thereby indicating that BRF2 could be a viable therapeutic target for estrogen receptor-negative/HER2-enriched (ER-/HER2+) cancers. Among the trans-associated genes, we identify modules of immune response (CD2, CD19, CD38 and CD79B), mitotic/cell-cycle kinases (e.g. AURKB, MELK, PLK1 and TTK), and DNA-damage response genes (e.g. RFC4 and FEN1). siRNA-mediated knockdown of RFC4 significantly reduced cell proliferation in ER-negative normal breast and cancer lines, thereby indicating that RFC4 is essential for both normal and cancer cell survival but could be a useful biomarker for aggressive (ER-negative) breast tumours. Availability: http://bioinformatics.org.au/tools-data/ under NetStrat.", 
                "date": "2016-03-01T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Srihari S."
                    }, 
                    {
                        "name": "Kalimutho M."
                    }, 
                    {
                        "name": "Lal S."
                    }, 
                    {
                        "name": "Singla J."
                    }, 
                    {
                        "name": "Patel D."
                    }, 
                    {
                        "name": "Simpson P.T."
                    }, 
                    {
                        "name": "Khanna K.K."
                    }, 
                    {
                        "name": "Ragan M.A."
                    }
                ], 
                "journal": "Molecular BioSystems"
            }
        }
    ], 
    "credit": [
        {
            "name": "Sriganesh Srihari", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": null, 
            "typeRole": [], 
            "note": null
        }, 
        {
            "name": null, 
            "email": "s.srihari@uq.edu.au", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "sriganeshms", 
    "additionDate": "2017-09-29T02:57:48Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}