{
    "additionDate": "2018-07-14T08:31:34Z",
    "biotoolsCURIE": "biotools:amptools",
    "biotoolsID": "amptools",
    "credit": [
        {
            "email": "sta@akvaplan.niva.no",
            "name": "Starrlight Augustine",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Matlab functions for analysis of patterns in (functions of) parameter values of the Add-my-Pet collection.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.bio.vu.nl/thb/deb/deblab/add_my_pet/AmPtool.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://www.bio.vu.nl/thb/deb/deblab/add_my_pet/AmPtool.html",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-25T14:32:56.467529Z",
    "name": "AmPtools",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1006100",
            "metadata": {
                "abstract": "We developed new methods for parameter estimation-in-context and, with the help of 125 authors, built the AmP (Add-my-Pet) database of Dynamic Energy Budget (DEB) models, parameters and referenced underlying data for animals, where each species constitutes one database entry. The combination of DEB parameters covers all aspects of energetics throughout the full organism’s life cycle, from the start of embryo development to death by aging. The species-specific parameter values capture biodiversity and can now, for the first time, be compared between animals species. An important insight brought by the AmP project is the classification of animal energetics according to a family of related DEB models that is structured on the basis of the mode of metabolic acceleration, which links up with the development of larval stages. We discuss the evolution of metabolism in this context, among animals in general, and ray-finned fish, mollusks and crustaceans in particular. New DEBtool code for estimating DEB parameters from data has been written. AmPtool code for analyzing patterns in parameter values has also been created. A new web-interface supports multiple ways to visualize data, parameters, and implied properties from the entire collection as well as on an entry by entry basis. The DEB models proved to fit data well, the median relative error is only 0.07, for the 1035 animal species at 2018/03/12, including some extinct ones, from all large phyla and all chordate orders, spanning a range of body masses of 16 orders of magnitude. This study is a first step to include evolutionary aspects into parameter estimation, allowing to infer properties of species for which very little is known.",
                "authors": [
                    {
                        "name": "Augustine S."
                    },
                    {
                        "name": "Domingos T."
                    },
                    {
                        "name": "Kooijman S.A.L.M."
                    },
                    {
                        "name": "Lika K."
                    },
                    {
                        "name": "Marques G.M."
                    },
                    {
                        "name": "Pecquerie L."
                    }
                ],
                "citationCount": 157,
                "date": "2018-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "The AmP project: Comparing species on the basis of dynamic energy budget parameters"
            },
            "pmcid": "PMC5962104",
            "pmid": "29742099",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Animal study",
            "uri": "http://edamontology.org/topic_3679"
        },
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
