{
    "additionDate": "2020-01-09T17:36:17Z",
    "biotoolsCURIE": "biotools:BCrystal",
    "biotoolsID": "BCrystal",
    "confidence_flag": "tool",
    "description": "An Interpretable Sequence-Based Protein Crystallization Predictor.\n\nThe training set is readily available for ease of use at: https://drive.google.com/file/d/1FRWIcs4xvK2O5OCqhg7u5g_4qm2zJn2d/view and can be used in combination with Step 2 to generate the BCrystal model",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Protein crystallizability prediction",
                    "uri": "http://edamontology.org/operation_0410"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://github.com/raghvendra5688/BCrystal",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-05T13:42:33.521673Z",
    "name": "BCrystal",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ762",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: X-ray crystallography has facilitated the majority of protein structures determined to date. Sequencebased predictors that can accurately estimate protein crystallization propensities would be highly beneficial to overcome the high expenditure, large attrition rate, and to reduce the trial-and-error settings required for crystallization. Results: In this study, we present a novel model, BCrystal, which uses an optimized gradient boosting machine (XGBoost) on sequence, structural and physio-chemical features extracted from the proteins of interest. BCrystal also provides explanations, highlighting the most important features for the predicted crystallization propensity of an individual protein using the SHAP algorithm. On three independent test sets, BCrystal outperforms state-of-theart sequence-based methods by more than 12.5% in accuracy, 18% in recall and 0.253 in Matthew's correlation coefficient, with an average accuracy of 93.7%, recall of 96.63% and Matthew's correlation coefficient of 0.868. For relative solvent accessibility of exposed residues, we observed higher values to associate positively with protein crystallizability and the number of disordered regions, fraction of coils and tripeptide stretches that contain multiple histidines associate negatively with crystallizability. The higher accuracy of BCrystal enables it to accurately screen for sequence variants with enhanced crystallizability. Availability and implementation: Our BCrystal webserver is at https://machinelearning-protein.qcri.org/ and source code is available at https://github.com/raghvendra5688/BCrystal.",
                "authors": [
                    {
                        "name": "Elbasir A."
                    },
                    {
                        "name": "Mall R."
                    },
                    {
                        "name": "Kunji K."
                    },
                    {
                        "name": "Rawi R."
                    },
                    {
                        "name": "Islam Z."
                    },
                    {
                        "name": "Chuang G.-Y."
                    },
                    {
                        "name": "Kolatkar P.R."
                    },
                    {
                        "name": "Bensmail H."
                    }
                ],
                "citationCount": 3,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BCrystal: An interpretable sequence-based protein crystallization predictor"
            },
            "pmid": "31603511"
        }
    ],
    "topic": [
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}