{
    "additionDate": "2018-07-26T10:36:40Z",
    "biotoolsCURIE": "biotools:prism_3",
    "biotoolsID": "prism_3",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://magarveylab.ca/prism/#!/about"
        }
    ],
    "description": "PRediction Informatics for Secondary Metabolomes. Prediction of genetically encoded natural product structures based on microbial genomes. It takes a microbial genome sequence as input, identifies biosynthetic gene clusters, and generates combinatorial libraries of structure predictions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://magarveylab.ca/prism/#!/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "homepage": "http://magarveylab.ca/prism/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "PRISM 3",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/NAR/GKX320",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.Microbial natural products represent a rich resource of pharmaceutically and industrially important compounds. Genome sequencing has revealed that the majority of natural products remain undiscovered, and computational methods to connect biosynthetic gene clusters to their corresponding natural products therefore have the potential to revitalize natural product discovery. Previously, we described PRediction Informatics for Secondary Metabolomes (PRISM), a combinatorial approach to chemical structure prediction for genetically encoded nonribosomal peptides and type I and II polyketides. Here, we present a ground-up rewrite of the PRISM structure prediction algorithm to derive prediction of natural products arising from non-modular biosynthetic paradigms. Within this new version, PRISM 3, natural product scaffolds are modeled as chemical graphs, permitting structure prediction for aminocoumarins, antimetabolites, bisindoles and phosphonate natural products, and building upon the addition of ribosomally synthesized and post-translationally modified peptides. Further, with the addition of cluster detection for 11 new cluster types, PRISM 3 expands to detect 22 distinct natural product cluster types. Other major modifications to PRISM include improved sequence input and ORF detection, user-friendliness and output. Distribution of PRISM 3 over a 300-core server grid improves the speed and capacity of the web application.",
                "authors": [
                    {
                        "name": "Skinnider M.A."
                    },
                    {
                        "name": "Merwin N.J."
                    },
                    {
                        "name": "Johnston C.W."
                    },
                    {
                        "name": "Magarvey N.A."
                    }
                ],
                "citationCount": 139,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PRISM 3: Expanded prediction of natural product chemical structures from microbial genomes"
            },
            "pmcid": "PMC5570231",
            "pmid": "28460067"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}