{
    "additionDate": "2020-01-14T09:30:32Z",
    "biotoolsCURIE": "biotools:Digitaldlsorter",
    "biotoolsID": "Digitaldlsorter",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fscabo@cnic.es",
            "name": "Fatima Sanchez-Cabo",
            "typeEntity": "Person"
        },
        {
            "name": "Carlos Torroja",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep-Learning on scRNA-Seq to Deconvolute Gene Expression Data.\n\nA pipeline to generate a Deep Nerual Network cell type deconvolution model for bulk RNASeq samples from single cell experiment data.\n\nA pipeline to generate a Deep Neural Network cell type deconvolution model for bulk RNASeq samples from single cell rna-seq data.\n\nThe pipeline runs in R 3.51 and python 3.6.8.\n\nconda create env -n digitalDLSorter",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cartof/digitalDLSorter",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-22T07:22:46Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cartof/digitalDLSorter/issues"
        }
    ],
    "name": "Digitaldlsorter",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00978",
            "metadata": {
                "abstract": "© 2019 Torroja and Sanchez-Cabo.The development of single cell transcriptome sequencing has allowed researchers the possibility to dig inside the role of the individual cell types in a plethora of disease scenarios. It also expands to the whole transcriptome what before was only possible for a few tenths of antibodies in cell population analysis. More importantly, it allows resolving the permanent question of whether the changes observed in a particular bulk experiment are a consequence of changes in cell type proportions or an aberrant behavior of a particular cell type. However, single cell experiments are still complex to perform and expensive to sequence making bulk RNA-Seq experiments yet more common. scRNA-Seq data is proving highly relevant information for the characterization of the immune cell repertoire in different diseases ranging from cancer to atherosclerosis. In particular, as scRNA-Seq becomes more widely used, new types of immune cell populations emerge and their role in the genesis and evolution of the disease opens new avenues for personalized immune therapies. Immunotherapy have already proven successful in a variety of tumors such as breast, colon and melanoma and its value in other types of disease is being currently explored. From a statistical perspective, single-cell data are particularly interesting due to its high dimensionality, overcoming the limitations of the “skinny matrix” that traditional bulk RNA-Seq experiments yield. With the technological advances that enable sequencing hundreds of thousands of cells, scRNA-Seq data have become especially suitable for the application of Machine Learning algorithms such as Deep Learning (DL). We present here a DL based method to enumerate and quantify the immune infiltration in colorectal and breast cancer bulk RNA-Seq samples starting from scRNA-Seq. Our method makes use of a Deep Neural Network (DNN) model that allows quantification not only of lymphocytes as a general population but also of specific CD8+, CD4Tmem, CD4Th and CD4Tregs subpopulations, as well as B-cells and Stromal content. Moreover, the signatures are built from scRNA-Seq data from the tumor, preserving the specific characteristics of the tumor microenvironment as opposite to other approaches in which cells were isolated from blood. Our method was applied to synthetic bulk RNA-Seq and to samples from the TCGA project yielding very accurate results in terms of quantification and survival prediction.",
                "authors": [
                    {
                        "name": "Sanchez-Cabo F."
                    },
                    {
                        "name": "Torroja C."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Digitaldlsorter: Deep-learning on scrna-seq to deconvolute gene expression data"
            },
            "pmcid": "PMC6824295",
            "pmid": "31708961"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
