{
    "additionDate": "2020-01-14T19:51:18Z",
    "biotoolsCURIE": "biotools:FACEPAI",
    "biotoolsID": "FACEPAI",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "emma.wahlberg@nrm.se",
            "name": "Emma Wahlberg",
            "typeEntity": "Person"
        }
    ],
    "description": "a script for fast and consistent environmental DNA processing and identification.\n\nScripts for executing a filtering, clustering and identification pipeline for eDNA samples.\n\nFast And Consistent Environmental-DNA Processing And Identification (& Conversion and Preparation of Reference Sequences).\n\nWahlberg, E. 2019. FACEPAI: a script for fast and consistent environmental DNA processing and identification. BMC Ecology 19: 51, doi:10.1186/s12898-019-0269-1",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://github.com/emmawahl/facepai",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2020-01-14T19:51:18Z",
    "license": "GPL-3.0",
    "name": "FACEPAI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12898-019-0269-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The use of environmental DNA (eDNA) has become an increasing important tool in environmental surveys and taxonomic research. High throughput sequencing of samples from soil, water, sediment, trap alcohol or bulk samples generate large amount of barcode sequences that can be assigned to a known taxon with a reference sequence. This process can however be bioinformatic cumbersome and time consuming, especially for researchers without specialised bioinformatic training. A number of different software packages and pipelines are available, but require training in preparation of data, running of analysis and formatting results. Comparison of results produced by different packages are often difficult. Results: FACEPIE is an open source script dependant on a few open source applications that provides a pipeline for rapid analysis and taxonomic assignment of environmental DNA samples. It requires an initial formatting of a reference database, using the script CaPReSe, and a configuration file and can thereafter be run to process any number of samples in succession using the same settings and references. Both configuration and executing are designed to demand as little hands on work as possible, while assuring repeatable results. Conclusion: The demonstration using example data from real environmental samples provides results in a time span ranging from less than 3 min to just above 15 min depending on the numbers of sequences to process. The memory usage is below 2 GB on a desktop PC. FACEPAI and CaPReSe provides a pipeline for analysing a large number of eDNA samples on common equipment, with little bioinformatic skills necessary, for subsequent ecological and taxonomical studies.",
                "authors": [
                    {
                        "name": "Wahlberg E."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-06T00:00:00Z",
                "journal": "BMC Ecology",
                "title": "FACEPAI: A script for fast and consistent environmental DNA processing and identification"
            },
            "pmcid": "PMC6896590",
            "pmid": "31810454"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}