{
    "additionDate": "2021-03-19T09:04:23Z",
    "biotoolsCURIE": "biotools:decban",
    "biotoolsID": "decban",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yangyang@cs.sjtu.edu.cn",
            "name": "Yang Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "DeCban is a tool for the prediction of circRNA-RBP interaction sites by using double embeddings and cross-branch attention networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AaronYll/DECban",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-22T16:12:08Z",
    "name": "DeCban",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.632861",
            "metadata": {
                "abstract": "© Copyright © 2021 Yuan and Yang.Circular RNAs (circRNAs), as a rising star in the RNA world, play important roles in various biological processes. Understanding the interactions between circRNAs and RNA binding proteins (RBPs) can help reveal the functions of circRNAs. For the past decade, the emergence of high-throughput experimental data, like CLIP-Seq, has made the computational identification of RNA-protein interactions (RPIs) possible based on machine learning methods. However, as the underlying mechanisms of RPIs have not been fully understood yet and the information sources of circRNAs are limited, the computational tools for predicting circRNA-RBP interactions have been very few. In this study, we propose a deep learning method to identify circRNA-RBP interactions, called DeCban, which is featured by hybrid double embeddings for representing RNA sequences and a cross-branch attention neural network for classification. To capture more information from RNA sequences, the double embeddings include pre-trained embedding vectors for both RNA segments and their converted amino acids. Meanwhile, the cross-branch attention network aims to address the learning of very long sequences by integrating features of different scales and focusing on important information. The experimental results on 37 benchmark datasets show that both double embeddings and the cross-branch attention model contribute to the improvement of performance. DeCban outperforms the mainstream deep learning-based methods on not only prediction accuracy but also computational efficiency. The data sets and source code of this study are freely available at: https://github.com/AaronYll/DECban.",
                "authors": [
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Yuan L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-22T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "DeCban: Prediction of circRNA-RBP Interaction Sites by Using Double Embeddings and Cross-Branch Attention Networks"
            },
            "pmcid": "PMC7862712",
            "pmid": "33552144"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
