{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.sorfs.org/contact"}],"documentation":[{"type":"GENERAL","url":"http://www.sorfs.org/info"},{"url":"http://www.sorfs.org/defaultDB_manual"},{"url":"http://www.sorfs.org/biomart_manual"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Protein fragment weight comparison","uri":"http://edamontology.org/operation_2929"},{"term":"Peptide identification","uri":"http://edamontology.org/operation_3631"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["PHP","JavaScript","SQL"],"maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Database portal"],"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"}]},"link":[{"note":"Default query interface","url":"http://www.sorfs.org/database"},{"note":"BioMart query interface","url":"http://www.sorfs.org/BioMart"}],"publication":[{"doi":"10.1093/nar/gkv1175","pmcid":"PMC4702841","pmid":"26527729","type":"Primary"},{"abstract":"© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research. sORFs.org (http://www.sorfs.org) is a public repository of small open reading frames (sORFs) identified by ribosome profiling (RIBO-seq). This update elaborates on the major improvements implemented since its initial release. sORFs.org now additionally supports three more species (zebrafish, rat and Caenorhabditis elegans) and currently includes 78 RIBO-seq datasets, a vast increase compared to the three that were processed in the initial release. Therefore, a novel pipeline was constructed that also enables sORF detection in RIBO-seq datasets comprising solely elongating RIBO-seq data while previously, matching initiating RIBO-seq data was necessary to delineate the sORFs. Furthermore, a novel noise filtering algorithm was designed, able to distinguish sORFs with true ribosomal activity from simulated noise, consequently reducing the false positive identification rate. The inclusion of other species also led to the development of an inner BLAST pipeline, assessing sequence similarity between sORFs in the repository. Building on the proof of concept model in the initial release of sORFs.org, a full PRIDE-ReSpin pipeline was now released, reprocessing publicly available MS-based proteomics PRIDE datasets, reporting on true translation events. Next to reporting those identified peptides, sORFs.org allows visual inspection of the annotated spectra within the Lorikeet MS/MS viewer, thus enabling detailed manual inspection and interpretation.","authors":["Olexiouk V.","Van Criekinge W.","Menschaert G."],"cit_count":13,"doi":"10.1093/nar/gkx1130","journal":"Nucleic Acids Research","title":"An update on sORFs.org: A repository of small ORFs identified by ribosome profiling","type":"Primary","year":"2018-01-01"}],"summary":{"biotoolsCURIE":"biotools:sORFs","biotoolsID":"sORFs","description":"Repository of small open reading frames identified by ribosome profiling in a database of over 3 million sORFs across 78 datasets from six species.","homepage":"http://www.sorfs.org/","name":"sORFs"}}