{
    "accessibility": "Open access",
    "additionDate": "2023-03-20T10:19:34.947621Z",
    "biotoolsCURIE": "biotools:ipresto",
    "biotoolsID": "ipresto",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "justin.vanderhooft@wur.nl",
            "name": "Justin J. J. van der Hooft",
            "orcidid": "https://orcid.org/0000-0002-9340-5511",
            "typeEntity": "Person"
        },
        {
            "email": "marnix.medema@wur.nl",
            "name": "Marnix H. Medema",
            "typeEntity": "Person"
        }
    ],
    "description": "iPRESTO (integrated Prediction and Rigorous Exploration of biosynthetic\nSub-clusters Tool)\nis a command line tool for the detection of gene sub-clusters in\na set of Biosynthetic Gene Clusters (BGCs) in GenBank format.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://git.wageningenur.nl/bioinformatics/iPRESTO/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-20T10:19:34.957556Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/record/6953657"
        }
    ],
    "name": "iPRESTO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1010462",
            "metadata": {
                "abstract": "Microbial specialised metabolism is full of valuable natural products that are applied clinically, agriculturally, and industrially. The genes that encode their biosynthesis are often physically clustered on the genome in biosynthetic gene clusters (BGCs). Many BGCs consist of multiple groups of co-evolving genes called sub-clusters that are responsible for the biosynthesis of a specific chemical moiety in a natural product. Sub-clusters therefore provide an important link between the structures of a natural product and its BGC, which can be leveraged for predicting natural product structures from sequence, as well as for linking chemical structures and metabolomics-derived mass features to BGCs. While some initial computational methodologies have been devised for sub-cluster detection, current approaches are not scalable, have only been run on small and outdated datasets, or produce an impractically large number of possible sub-clusters to mine through. Here, we constructed a scalable method for unsupervised sub-cluster detection, called iPRESTO, based on topic modelling and statistical analysis of co-occurrence patterns of enzyme-coding protein families. iPRESTO was used to mine sub-clusters across 150,000 prokaryotic BGCs from antiSMASH-DB. After annotating a fraction of the resulting sub-cluster families, we could predict a substructure for 16% of the antiSMASH-DB BGCs. Additionally, our method was able to confirm 83% of the experimentally characterised sub-clusters in MIBiG reference BGCs. Based on iPRESTO-detected sub-clusters, we could correctly identify the BGCs for xenorhabdin and salbostatin biosynthesis (which had not yet been annotated in BGC databases), as well as propose a candidate BGC for akashin biosynthesis. Additionally, we show for a collection of 145 actinobacteria how substructures can aid in linking BGCs to molecules by correlating iPRESTO-detected sub-clusters to MS/MS-derived Mass2Motifs substructure patterns. This work paves the way for deeper functional and structural annotation of microbial BGCs by improved linking of orphan molecules to their cognate gene clusters, thus facilitating accelerated natural product discovery.",
                "authors": [
                    {
                        "name": "Kautsar S.A."
                    },
                    {
                        "name": "Louwen J.J.R."
                    },
                    {
                        "name": "Medema M.H."
                    },
                    {
                        "name": "van der Burg S."
                    },
                    {
                        "name": "van der Hooft J.J.J."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "iPRESTO: Automated discovery of biosynthetic sub-clusters linked to specific natural product substructures"
            },
            "pmcid": "PMC9946207",
            "pmid": "36758069"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
