{
    "additionDate": "2017-01-17T15:00:27Z",
    "biotoolsCURIE": "biotools:phyloseq",
    "biotoolsID": "phyloseq",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "joey711@gmail.com",
            "name": "Paul J. McMurdie",
            "orcidid": "http://orcid.org/0000-0001-8879-3954",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Provides a set of classes and tools to facilitate the import, storage, analysis, and graphical display of microbiome census data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/phyloseq.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/phyloseq_1.19.1.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/phyloseq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T16:54:45Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://dx.plos.org/10.1371/journal.pone.0061217"
        }
    ],
    "name": "phyloseq",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0061217",
            "metadata": {
                "abstract": "Background:The analysis of microbial communities through DNA sequencing brings many challenges: the integration of different types of data with methods from ecology, genetics, phylogenetics, multivariate statistics, visualization and testing. With the increased breadth of experimental designs now being pursued, project-specific statistical analyses are often needed, and these analyses are often difficult (or impossible) for peer researchers to independently reproduce. The vast majority of the requisite tools for performing these analyses reproducibly are already implemented in R and its extensions (packages), but with limited support for high throughput microbiome census data.Results:Here we describe a software project, phyloseq, dedicated to the object-oriented representation and analysis of microbiome census data in R. It supports importing data from a variety of common formats, as well as many analysis techniques. These include calibration, filtering, subsetting, agglomeration, multi-table comparisons, diversity analysis, parallelized Fast UniFrac, ordination methods, and production of publication-quality graphics; all in a manner that is easy to document, share, and modify. We show how to apply functions from other R packages to phyloseq-represented data, illustrating the availability of a large number of open source analysis techniques. We discuss the use of phyloseq with tools for reproducible research, a practice common in other fields but still rare in the analysis of highly parallel microbiome census data. We have made available all of the materials necessary to completely reproduce the analysis and figures included in this article, an example of best practices for reproducible research.Conclusions:The phyloseq project for R is a new open-source software package, freely available on the web from both GitHub and Bioconductor. © 2013 McMurdie, Holmes.",
                "authors": [
                    {
                        "name": "McMurdie P.J."
                    },
                    {
                        "name": "Holmes S."
                    }
                ],
                "citationCount": 4024,
                "date": "2013-04-22T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Phyloseq: An R Package for Reproducible Interactive Analysis and Graphics of Microbiome Census Data"
            },
            "pmcid": "PMC3632530",
            "pmid": "23630581",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1,
    "version": [
        "1.19.1"
    ]
}