{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2017-03-24T09:33:58Z",
    "biotoolsCURIE": "biotools:scansite",
    "biotoolsID": "scansite",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "scansite@mit.edu",
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Searches for motifs within proteins that are likely to be phosphorylated or that bind to common cellular signaling domains.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://scansite4.mit.edu/4.0/#tutorial"
        },
        {
            "type": [
                "FAQ"
            ],
            "url": "https://scansite4.mit.edu/4.0/#faq"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Sequence motif comparison",
                    "uri": "http://edamontology.org/operation_0240"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein domain recognition",
                    "uri": "http://edamontology.org/operation_0246"
                }
            ]
        }
    ],
    "homepage": "http://scansite.mit.edu/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-07-14T17:14:25Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "https://scansite4.mit.edu/webservice/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kkrismer/scansite4"
        }
    ],
    "maturity": "Mature",
    "name": "Scansite",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Phosphorylation by protein kinases is an important general mechanism for controlling intracellular processes, and plays an essential part in the signal transduction pathways that regulate cell growth in response to extracellular signals. A great number of protein kinases have been discovered, and the identification of their biological targets is still a very active research area. Protein kinases must have the appropriate substrate specificity to ensure that signals are transmitted correctly. Previous studies have demonstrated the importance of primary sequences within substrate proteins in determining protein kinase specificity, but efficient ways of identifying these sequences are lacking. Results We have developed a new technique for determining the substrate specificity of protein kinases, using an oriented library of more than 2.5 billion peptide substrates. In this approach, the consensus sequence of optimal substrates is determined by sequencing the mixture of products generated during a brief reaction with the kinase of interest. The optimal substrate predicted for cAMP-dependent protein kinase (PKA) by this technique is consistent with the sequences of known PKA substrates. The optimal sequences predicted for cyclin-dependent kinases (CDKs) cyclin B-Cdc2 and cyclin A-CDK2 also agree well with sites thought to be phosphorylated in vivo by these kinases. In addition, we determined the optimal substrate for SLK1, a homologue of the STE20 protein serine kinase of hitherto unknown substrate specificity. We also discuss a model incorporating the optimal cyclin B-Cdc2 substrate into the known crystal structure of this kinase. Conclusion Using the new technique we have developed, the sequence specificity of protein kinases can rapidly be predicted and, from this information, potential targets of the kinases can be identified. © 1994 Elsevier Science Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Songyang Z."
                    },
                    {
                        "name": "Blechner S."
                    },
                    {
                        "name": "Hoagland N."
                    },
                    {
                        "name": "Hoekstra M.F."
                    },
                    {
                        "name": "Piwnica-Worms H."
                    },
                    {
                        "name": "Cantley L.C."
                    }
                ],
                "citationCount": 489,
                "date": "1994-01-01T00:00:00Z",
                "journal": "Current Biology",
                "title": "Use of an oriented peptide library to determine the optimal substrates of protein kinases"
            },
            "pmid": "7874496"
        },
        {
            "metadata": {
                "abstract": "Eukaryotic proteins typically contain one or more modular domains such as kinases, phosphatases, and phoshopeptide-binding domains, as well as characteristic sequence motifs that direct post-translational modifications such as phosphorylation, or mediate binding to specific modular domains. A computational approach to predict protein interactions on a proteome-wide basis would therefore consist of identifying modular domains and sequence motifs from protein primary sequence data, creating sequence specificity-based algorithms to connect a domain in one protein with a motif in another in \"interaction space,\" and then graphically constructing possible interaction networks. Computational methods for predicting modular domains in proteins have been quite successful, but identifying the short sequence motifs these domains recognize has been more difficult. We are developing improved methods to identify these motifs by combining experimental and computational techniques with databases of sequences and binding information. Scansite is a web-accessible program that predicts interactions between proteins using experimental binding data from peptide library and phage display experiments. This program focuses on domains important in cell signaling, but it can, in principle, be used for other interactions if the domains and binding motifs are known. This chapter describes in detail how to use Scansite to predict the binding partners of an input protein, and how to find all proteins that contain a given sequence motif.",
                "authors": [
                    {
                        "name": "Obenauer J.C."
                    },
                    {
                        "name": "Yaffe M.B."
                    }
                ],
                "citationCount": 35,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Methods in molecular biology (Clifton, N.J.)",
                "title": "Computational prediction of protein-protein interactions."
            },
            "pmid": "15064475"
        },
        {
            "metadata": {
                "abstract": "The rapid increase in genomic information requires new techniques to infer protein function and predict protein-protein interactions. Bioinformatics identifies modular signaling domains within protein sequences with a high degree of accuracy. In contrast, little success has been achieved in predicting short linear sequence motifs within proteins targeted by these domains to form complex signaling networks. Here we describe a peptide library-based searching algorithm, accessible over the World Wide Web, that identifies sequence motifs likely to bind to specific protein domains such as 14-3-3, SH2, and SH3 domains, or likely to be phosphorylated by specific protein kinases such as Src and AKT. Predictions from database searches for proteins containing motifs matching two different domains in a common signaling pathway provides a much higher success rate. This technology facilitates prediction of cell signaling networks within proteomes, and could aid in the identification of drug targets for the treatment of human diseases.",
                "authors": [
                    {
                        "name": "Yaffe M.B."
                    },
                    {
                        "name": "Leparc G.G."
                    },
                    {
                        "name": "Lai J."
                    },
                    {
                        "name": "Obata T."
                    },
                    {
                        "name": "Volinia S."
                    },
                    {
                        "name": "Cantley L.C."
                    }
                ],
                "citationCount": 446,
                "date": "2001-04-18T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "A motif-based profile scanning approach for genome-wide prediction of signaling pathways"
            },
            "pmid": "11283593"
        },
        {
            "metadata": {
                "abstract": "Scansite identifies short protein sequence motifs that are recognized by modular signaling domains, phosphorylated by protein Ser/Thr- or Tyr-kinases or mediate specific interactions with protein or phospholipid ligands. Each sequence motif is represented as a position-specific scoring matrix (PSSM) based on results from oriented peptide library and phage display experiments. Predicted domain-motif interactions from Scansite can be sequentially combined, allowing segments of biological pathways to be constructed in silico. The current release of Scansite, version 2.0, includes 62 motifs characterizing the binding and/or substrate specificities of many families of Ser/Thr- or Tyr-kinases, SH2, SH3, PDZ, 14-3-3 and PTB domains, together with signature motifs for PtdIns(3,4,5)P3-specific PH domains. Scansite 2.0 contains significant improvements to its original interface, including a number of new generalized user features and significantly enhanced performance. Searches of all SWISS-PROT, TrEMBL, Genpept and Ensembl protein database entries are now possible with run times reduced by ∼60% when compared with Scansite version 1.0. Scansite 2.0 allows restricted searching of species-specific proteins, as well as isoelectric point and molecular weight sorting to facilitate comparison of predictions with results from two-dimensional gel electrophoresis experiments. Support for user-defined motifs has been increased, allowing easier input of user-defined matrices and permitting user-defined motifs to be combined with pre-compiled Scansite motifs for dual motif searching. In addition, a new series of Sequence Match programs for non-quantitative user-defined motifs has been implemented. Scansite is available via the World Wide Web at http://scansite.mit.edu.",
                "authors": [
                    {
                        "name": "Obenauer J.C."
                    },
                    {
                        "name": "Cantley L.C."
                    },
                    {
                        "name": "Yaffe M.B."
                    }
                ],
                "citationCount": 1207,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Scansite 2.0: Proteome-wide prediction of cell signalling interactions using short sequence motifs"
            },
            "pmid": "12824383"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3557"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ],
    "version": [
        "4.0"
    ]
}