{
    "additionDate": "2019-11-14T19:28:57Z",
    "biotoolsCURIE": "biotools:SoyCSN",
    "biotoolsID": "SoyCSN",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "joshitr@missouri.edu",
            "name": "Trupti Joshi",
            "typeEntity": "Person"
        }
    ],
    "description": "Soybean context-specific network analysis and prediction based on tissue-specific transcriptome data | SoyCSN (Soybean Context Specific Network) - | SoyCSN (Soybean Context Specific Network) | SoyCSN computes and visualizes any of the 14 soybean context specific networks both at the expression and interactome level. Users can compare the gene-gene relationship differences at different confidence levels across all the soybean tissues",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "http://soykb.org/SoyCSN",
    "lastUpdate": "2020-12-21T13:20:55Z",
    "name": "SoyCSN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PLD3.167",
            "metadata": {
                "abstract": "© 2019 The Authors. Plant Direct published by American Society of Plant Biologists, Society for Experimental Biology and John Wiley & Sons Ltd.The Soybean Gene Atlas project provides a comprehensive map for understanding gene expression patterns in major soybean tissues from flower, root, leaf, nodule, seed, and shoot and stem. The RNA-Seq data generated in the project serve as a valuable resource for discovering tissue-specific transcriptome behavior of soybean genes in different tissues. We developed a computational pipeline for Soybean context-specific network (SoyCSN) inference with a suite of prediction tools to analyze, annotate, retrieve, and visualize soybean context-specific networks at both transcriptome and interactome levels. BicMix and Cross-Conditions Cluster Detection algorithms were applied to detect modules based on co-expression relationships across all the tissues. Soybean context-specific interactomes were predicted by combining soybean tissue gene expression and protein–protein interaction data. Functional analyses of these predicted networks provide insights into soybean tissue specificities. For example, under symbiotic, nitrogen-fixing conditions, the constructed soybean leaf network highlights the connection between the photosynthesis function and rhizobium–legume symbiosis. SoyCSN data and all its results are publicly available via an interactive web service within the Soybean Knowledge Base (SoyKB) at http://soykb.org/SoyCSN. SoyCSN provides a useful web-based access for exploring context specificities systematically in gene regulatory mechanisms and gene relationships for soybean researchers and molecular breeders.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Hossain M.S."
                    },
                    {
                        "name": "Lyu Z."
                    },
                    {
                        "name": "Schmutz J."
                    },
                    {
                        "name": "Stacey G."
                    },
                    {
                        "name": "Xu D."
                    },
                    {
                        "name": "Joshi T."
                    }
                ],
                "citationCount": 4,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Plant Direct",
                "title": "SoyCSN: Soybean context-specific network analysis and prediction based on tissue-specific transcriptome data"
            },
            "pmcid": "PMC6747016",
            "pmid": "31549018"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}