{
    "Author": "Dongmin Jung [cre, aut] (<https://orcid.org/0000-0001-7499-8422>)",
    "Date/Publication": "2024-10-29",
    "Depends": [
        "R (>= 4.1)",
        "keras"
    ],
    "Description": "The identification of novel compound-protein interaction (CPI) is important in drug discovery. Revealing unknown compound-protein interactions is useful to design a new drug for a target protein by screening candidate compounds. The accurate CPI prediction assists in effective drug discovery process. To identify potential CPI effectively, prediction methods based on machine learning and deep learning have been developed. Data for sequences are provided as discrete symbolic data. In the data, compounds are represented as SMILES (simplified molecular-input line-entry system) strings and proteins are sequences in which the characters are amino acids. The outcome is defined as a variable that indicates how strong two molecules interact with each other or whether there is an interaction between them. In this package, a deep-learning based model that takes only sequence information of both compounds and proteins as input and the outcome as output is used to predict CPI. The model is implemented by using compound and protein encoders with useful features. The CPI model also supports other modeling tasks, including protein-protein interaction (PPI), chemical-chemical interaction (CCI), or single compounds and proteins. Although the model is designed for proteins, DNA and RNA can be used if they are represented as sequences.",
    "Imports": [
        "CatEncoders",
        "PRROC",
        "matlab",
        "purrr",
        "rcdk",
        "reticulate",
        "stats",
        "stringdist",
        "tensorflow",
        "tokenizers",
        "ttgsea",
        "webchem"
    ],
    "License": "Artistic-2.0",
    "MD5sum": "bccffa092f6a224af833650957782fe3",
    "Maintainer": "Dongmin Jung <dmdmjung@gmail.com>",
    "NeedsCompilation": "no",
    "Package": "DeepPINCS",
    "Rank": 1134,
    "Rfiles": [
        "vignettes/DeepPINCS/inst/doc/DeepPINCS.R"
    ],
    "Suggests": [
        "knitr",
        "rmarkdown",
        "testthat"
    ],
    "Title": "Protein Interactions and Networks with Compounds based on Sequences using Deep Learning",
    "Version": "1.14.0",
    "VignetteBuilder": "knitr",
    "biocViews": [
        "GraphAndNetwork",
        "Network",
        "NeuralNetwork",
        "Software"
    ],
    "dependencyCount": "145",
    "git_branch": "RELEASE_3_20",
    "git_last_commit": "ec9c3b1",
    "git_last_commit_date": "2024-10-29",
    "git_url": "https://git.bioconductor.org/packages/DeepPINCS",
    "hasINSTALL": false,
    "hasLICENSE": false,
    "hasNEWS": true,
    "hasREADME": false,
    "importsMe": [
        "GenProSeq",
        "VAExprs"
    ],
    "mac.binary.big-sur-arm64.ver": "bin/macosx/big-sur-arm64/contrib/4.4/DeepPINCS_1.14.0.tgz",
    "mac.binary.big-sur-x86_64.ver": "bin/macosx/big-sur-x86_64/contrib/4.4/DeepPINCS_1.14.0.tgz",
    "source.ver": "src/contrib/DeepPINCS_1.14.0.tar.gz",
    "vignetteTitles": [
        "DeepPINCS"
    ],
    "vignettes": [
        "vignettes/DeepPINCS/inst/doc/DeepPINCS.html"
    ]
}
