{
    "Author": "Brian D. Bennett and Pierre R. Bushel",
    "Date/Publication": "2025-04-15",
    "Depends": [
        "R (>= 3.4)"
    ],
    "Description": "Gene lists derived from the results of genomic analyses are rich in biological information. For instance, differentially expressed genes (DEGs) from a microarray or RNA-Seq analysis are related functionally in terms of their response to a treatment or condition. Gene lists can vary in size, up to several thousand genes, depending on the robustness of the perturbations or how widely different the conditions are biologically. Having a way to associate biological relatedness between hundreds and thousands of genes systematically is impractical by manually curating the annotation and function of each gene. Over-representation analysis (ORA) of genes was developed to identify biological themes. Given a Gene Ontology (GO) and an annotation of genes that indicate the categories each one fits into, significance of the over-representation of the genes within the ontological categories is determined by a Fisher's exact test or modeling according to a hypergeometric distribution. Comparing a small number of enriched biological categories for a few samples is manageable using Venn diagrams or other means for assessing overlaps. However, with hundreds of enriched categories and many samples, the comparisons are laborious. Furthermore, if there are enriched categories that are shared between samples, trying to represent a common theme across them is highly subjective. goSTAG uses GO subtrees to tag and annotate genes within a set. goSTAG visualizes the similarities between the over-representation of DEGs by clustering the p-values from the enrichment statistical tests and labels clusters with the GO term that has the most paths to the root within the subtree generated from all the GO terms in the cluster.",
    "Imports": [
        "AnnotationDbi",
        "GO.db",
        "biomaRt",
        "graphics",
        "memoise",
        "stats",
        "utils"
    ],
    "License": "GPL-3",
    "MD5sum": "c3b5ed6a758d65eb1e488b1398afc963",
    "Maintainer": "Brian D. Bennett <brian.bennett@nih.gov>",
    "NeedsCompilation": "no",
    "Package": "goSTAG",
    "Rank": 1276,
    "Rfiles": [
        "vignettes/goSTAG/inst/doc/goSTAG.R"
    ],
    "Suggests": [
        "BiocStyle",
        "knitr",
        "rmarkdown",
        "testthat"
    ],
    "Title": "A tool to use GO Subtrees to Tag and Annotate Genes within a set",
    "Version": "1.32.0",
    "VignetteBuilder": "knitr",
    "biocViews": [
        "Clustering",
        "DifferentialExpression",
        "GO",
        "GeneExpression",
        "GeneSetEnrichment",
        "ImmunoOncology",
        "Microarray",
        "RNASeq",
        "Software",
        "Visualization",
        "mRNAMicroarray"
    ],
    "dependencyCount": "69",
    "git_branch": "RELEASE_3_21",
    "git_last_commit": "955f884",
    "git_last_commit_date": "2025-04-15",
    "git_url": "https://git.bioconductor.org/packages/goSTAG",
    "hasINSTALL": false,
    "hasLICENSE": false,
    "hasNEWS": true,
    "hasREADME": false,
    "mac.binary.big-sur-arm64.ver": "bin/macosx/big-sur-arm64/contrib/4.5/goSTAG_1.32.0.tgz",
    "mac.binary.big-sur-x86_64.ver": "bin/macosx/big-sur-x86_64/contrib/4.5/goSTAG_1.32.0.tgz",
    "source.ver": "src/contrib/goSTAG_1.32.0.tar.gz",
    "vignetteTitles": [
        "The goSTAG User's Guide"
    ],
    "vignettes": [
        "vignettes/goSTAG/inst/doc/goSTAG.html"
    ],
    "win.binary.ver": "bin/windows/contrib/4.5/goSTAG_1.32.0.zip"
}
