{
    "Author": "Binbin Wang, Wubing Zhang, Feizhen Wu, Wei Li & X. Shirley Liu",
    "Depends": [
        "R (>= 4.1)"
    ],
    "Description": "CRISPR (clustered regularly interspaced short palindrome repeats) coupled with nuclease Cas9 (CRISPR/Cas9) screens represent a promising technology to systematically evaluate gene functions. Data analysis for CRISPR/Cas9 screens is a critical process that includes identifying screen hits and exploring biological functions for these hits in downstream analysis. We have previously developed two algorithms, MAGeCK and MAGeCK-VISPR, to analyze CRISPR/Cas9 screen data in various scenarios.  These two algorithms allow users to perform quality control, read count generation and normalization, and calculate beta score to evaluate gene selection performance.  In downstream analysis, the biological functional analysis is required for understanding biological functions of these identified genes with different screening purposes.  Here, We developed MAGeCKFlute for supporting downstream analysis. MAGeCKFlute provides several strategies to remove potential biases within sgRNA-level read counts and gene-level beta scores. The downstream analysis with the package includes identifying essential, non-essential, and target-associated genes, and performing biological functional category analysis, pathway enrichment analysis and protein complex enrichment analysis of these genes. The package also visualizes genes in multiple ways to benefit users exploring screening data. Collectively, MAGeCKFlute enables accurate identification of essential, non-essential, and targeted genes, as well as their related biological functions. This vignette explains the use of the package and demonstrates typical workflows.",
    "Imports": [
        "Biobase",
        "DOSE",
        "clusterProfiler",
        "depmap",
        "enrichplot",
        "ggplot2",
        "ggrepel",
        "grDevices",
        "grid",
        "gridExtra",
        "msigdbr",
        "pathview",
        "reshape2",
        "stats",
        "utils"
    ],
    "License": "GPL (>=3)",
    "Maintainer": "Wubing Zhang <Watson5bZhang@gmail.com>",
    "NeedsCompilation": "no",
    "Package": "MAGeCKFlute",
    "PackageStatus": "Deprecated",
    "Rank": 405,
    "Suggests": [
        "BiocManager",
        "BiocStyle",
        "biomaRt",
        "dendextend",
        "graphics",
        "knitr",
        "pheatmap",
        "png",
        "scales",
        "sva"
    ],
    "Title": "Integrative Analysis Pipeline for Pooled CRISPR Functional Genetic Screens",
    "Version": "2.12.0",
    "VignetteBuilder": "knitr",
    "biocViews": [
        "CRISPR",
        "FunctionalGenomics",
        "GeneSetEnrichment",
        "GeneTarget",
        "KEGG",
        "Normalization",
        "Pathways",
        "PooledScreens",
        "QualityControl",
        "Software",
        "Visualization"
    ]
}
