{
    "Author": "Mona Nourbakhsh [aut], Astrid Saksager [aut], Nikola Tom [aut], Xi Steven Chen [aut], Antonio Colaprico [aut], Catharina Olsen [aut], Matteo Tiberti [cre, aut], Elena Papaleo [aut]",
    "BugReports": "https://github.com/ELELAB/Moonlight2R/issues",
    "Date/Publication": "2024-10-29",
    "Depends": [
        "R (>= 4.3)",
        "doParallel",
        "foreach"
    ],
    "Description": "The understanding of cancer mechanism requires the identification of genes playing a role in the development of the pathology and the characterization of their role (notably oncogenes and tumor suppressors). We present an updated version of the R/bioconductor package called MoonlightR, namely Moonlight2R, which returns a list of candidate driver genes for specific cancer types on the basis of omics data integration. The Moonlight framework contains a primary layer where gene expression data and information about biological processes are integrated to predict genes called oncogenic mediators, divided into putative tumor suppressors and putative oncogenes. This is done through functional enrichment analyses, gene regulatory networks and upstream regulator analyses to score the importance of well-known biological processes with respect to the studied cancer type. By evaluating the effect of the oncogenic mediators on biological processes or through random forests, the primary layer predicts two putative roles for the oncogenic mediators: i) tumor suppressor genes (TSGs) and ii) oncogenes (OCGs). As gene expression data alone is not enough to explain the deregulation of the genes, a second layer of evidence is needed. We have automated the integration of a secondary mutational layer through new functionalities in Moonlight2R. These functionalities analyze mutations in the cancer cohort and classifies these into driver and passenger mutations using the driver mutation prediction tool, CScape-somatic. Those oncogenic mediators with at least one driver mutation are retained as the driver genes. As a consequence, this methodology does not only identify genes playing a dual role (e.g. TSG in one cancer type and OCG in another) but also helps in elucidating the biological processes underlying their specific roles. In particular, Moonlight2R can be used to discover OCGs and TSGs in the same cancer type. This may for instance help in answering the question whether some genes change role between early stages (I, II) and late stages (III, IV). In the future, this analysis could be useful to determine the causes of different resistances to chemotherapeutic treatments.",
    "Imports": [
        "AnnotationHub",
        "Biobase",
        "BiocGenerics",
        "ComplexHeatmap",
        "DOSE",
        "EpiMix",
        "ExperimentHub",
        "GEOquery",
        "GenomicRanges",
        "HiveR",
        "RColorBrewer",
        "RISmed",
        "circlize",
        "clusterProfiler",
        "dplyr",
        "easyPubMed",
        "fuzzyjoin",
        "ggplot2",
        "gplots",
        "grDevices",
        "graphics",
        "grid",
        "magrittr",
        "org.Hs.eg.db",
        "parmigene",
        "purrr",
        "qpdf",
        "randomForest",
        "readr",
        "rtracklayer",
        "seqminer",
        "stats",
        "stringr",
        "tibble",
        "tidyHeatmap",
        "tidyr",
        "utils"
    ],
    "License": "GPL-3",
    "MD5sum": "96842c4ab79b82de4ee8a43d1cc10976",
    "Maintainer": "Matteo Tiberti <tiberti@cancer.dk>",
    "NeedsCompilation": "no",
    "Package": "Moonlight2R",
    "Rank": 1973,
    "Rfiles": [
        "vignettes/Moonlight2R/inst/doc/Moonlight2R.R"
    ],
    "Suggests": [
        "BiocStyle",
        "devtools",
        "knitr",
        "png",
        "rmarkdown",
        "roxygen2",
        "testthat (>= 3.0.0)"
    ],
    "SystemRequirements": "CScapeSomatic",
    "Title": "Identify oncogenes and tumor suppressor genes from omics data",
    "URL": "https://github.com/ELELAB/Moonlight2R",
    "Version": "1.4.0",
    "VignetteBuilder": "knitr",
    "biocViews": [
        "DNAMethylation",
        "DifferentialExpression",
        "DifferentialMethylation",
        "GeneExpression",
        "GeneRegulation",
        "GeneSetEnrichment",
        "MethylationArray",
        "Network",
        "NetworkEnrichment",
        "Pathways",
        "Software",
        "Survival"
    ],
    "dependencyCount": "224",
    "git_branch": "RELEASE_3_20",
    "git_last_commit": "8d84724",
    "git_last_commit_date": "2024-10-29",
    "git_url": "https://git.bioconductor.org/packages/Moonlight2R",
    "hasINSTALL": true,
    "hasLICENSE": false,
    "hasNEWS": true,
    "hasREADME": false,
    "mac.binary.big-sur-arm64.ver": "bin/macosx/big-sur-arm64/contrib/4.4/Moonlight2R_1.4.0.tgz",
    "mac.binary.big-sur-x86_64.ver": "bin/macosx/big-sur-x86_64/contrib/4.4/Moonlight2R_1.4.0.tgz",
    "source.ver": "src/contrib/Moonlight2R_1.4.0.tar.gz",
    "vignetteTitles": [
        "A workflow to study mechanistic indicators for driver gene prediction with Moonlight"
    ],
    "vignettes": [
        "vignettes/Moonlight2R/inst/doc/Moonlight2R.html"
    ],
    "win.binary.ver": "bin/windows/contrib/4.4/Moonlight2R_1.4.0.zip"
}
