{
    "BugReports": "https://github.com/VilainLab/nanotatoR/issues",
    "Depends": [
        "R (>= 4.1)"
    ],
    "Description": "Whole genome sequencing (WGS) has successfully been used to identify single-nucleotide variants (SNV), small insertions and deletions (INDELs) and, more recently, small copy number variants (CNVs). However, due to utilization of short reads, it is not well suited for identification of structural variants (SV). Optical mapping (OM) from Bionano Genomics, utilizes long fluorescently labeled megabase size DNA molecules for de novo genome assembly and identification of SVs with a much higher sensitivity than WGS. Nevertheless, currently available SV annotation tools have limited number of functions. NanotatoR is an R package written to provide a set of annotations for SVs identified by OM. It uses Database of Genomic Variants (DGV), Database of Chromosomal Imbalance and Phenotype in Humans Using Ensembl Resources (DECIPHER) as well as a subset (154 samples) of 1000 Genome Project to calculate the population frequencies of the SVs (an optional internal cohort SV frequency calculation is also available). NanotatoR creates a primary gene list (PG) from NCBI databases based on proband’s phenotype specific keywords and compares the list to the set of genes overlapping/near SVs. The output is given in an Excel file format, which is subdivided into multiple sheets based on SV type (e.g., INDELs, Inversions, Translocations). Users then have a choice to filter SVs using the provided annotations for de novo (if parental samples are available) or inherited rare variants.",
    "Imports": [
        "AnnotationDbi",
        "GenomicRanges",
        "VarfromPDB",
        "XML",
        "XML2R",
        "curl",
        "dplyr",
        "hash(>= 2.2.6)",
        "httr",
        "knitr",
        "openxlsx(>= 4.0.17)",
        "org.Hs.eg.db",
        "rentrez(>= 1.1.0)",
        "rlang",
        "stats",
        "stringr",
        "testthat",
        "tidyverse",
        "utils"
    ],
    "License": "file LICENSE",
    "Maintainer": "Surajit Bhattacharya <sbhattach2@childrensnational.org>",
    "Package": "nanotatoR",
    "PackageStatus": "Deprecated",
    "Rank": 2255,
    "Suggests": [
        "rmarkdown",
        "yaml"
    ],
    "Title": "Next generation structural variant annotation and classification",
    "URL": "https://github.com/VilainLab/nanotatoR",
    "Version": "1.22.0",
    "VignetteBuilder": "knitr",
    "biocViews": [
        "GenomeAssembly",
        "Software",
        "VariantAnnotation",
        "WorkflowStep"
    ]
}
