{
    "Author": "Chen Meng [aut, cre]",
    "BugReports": "https://github.com/mengchen18/omicsViewer",
    "Date/Publication": "2025-04-15",
    "Depends": [
        "R (>= 4.2)"
    ],
    "Description": "omicsViewer visualizes ExpressionSet (or SummarizedExperiment) in an interactive way. The omicsViewer has a separate back- and front-end. In the back-end, users need to prepare an ExpressionSet that contains all the necessary information for the downstream data interpretation. Some extra requirements on the headers of phenotype data or feature data are imposed so that the provided information can be clearly recognized by the front-end, at the same time, keep a minimum modification on the existing ExpressionSet object. The pure dependency on R/Bioconductor guarantees maximum flexibility in the statistical analysis in the back-end. Once the ExpressionSet is prepared, it can be visualized using the front-end, implemented by shiny and plotly. Both features and samples could be selected from (data) tables or graphs (scatter plot/heatmap). Different types of analyses, such as enrichment analysis (using Bioconductor package fgsea or fisher's exact test) and STRING network analysis, will be performed on the fly and the results are visualized simultaneously. When a subset of samples and a phenotype variable is selected, a significance test on means (t-test or ranked based test; when phenotype variable is quantitative) or test of independence (chi-square or fisher’s exact test; when phenotype data is categorical) will be performed to test the association between the phenotype of interest with the selected samples. Additionally, other analyses can be easily added as extra shiny modules. Therefore, omicsViewer will greatly facilitate data exploration, many different hypotheses can be explored in a short time without the need for knowledge of R. In addition, the resulting data could be easily shared using a shiny server. Otherwise, a standalone version of omicsViewer together with designated omics data could be easily created by integrating it with portable R, which can be shared with collaborators or submitted as supplementary data together with a manuscript.",
    "Imports": [
        "Biobase",
        "DT",
        "Matrix",
        "RColorBrewer",
        "ROCR",
        "RSQLite",
        "S4Vectors",
        "SummarizedExperiment",
        "beeswarm",
        "curl",
        "drc",
        "fastmatch",
        "fgsea",
        "flatxml",
        "ggplot2",
        "ggseqlogo",
        "grDevices",
        "graphics",
        "grid",
        "htmlwidgets",
        "httr",
        "matrixStats",
        "methods",
        "networkD3",
        "openxlsx",
        "plotly",
        "psych",
        "reshape2",
        "shiny",
        "shinyWidgets",
        "shinybusy",
        "shinycssloaders",
        "shinyjs",
        "shinythemes",
        "stats",
        "stringr",
        "survival",
        "survminer",
        "utils"
    ],
    "License": "GPL-2",
    "MD5sum": "12f1ac1893426b899e6b4c57e3ad51be",
    "Maintainer": "Chen Meng <mengchen18@gmail.com>",
    "NeedsCompilation": "no",
    "Package": "omicsViewer",
    "Rank": 1914,
    "Rfiles": [
        "vignettes/omicsViewer/inst/doc/quickStart.R"
    ],
    "Suggests": [
        "BiocStyle",
        "knitr",
        "rmarkdown",
        "unittest"
    ],
    "Title": "Interactive and explorative visualization of SummarizedExperssionSet or ExpressionSet using omicsViewer",
    "URL": "https://github.com/mengchen18/omicsViewer",
    "Version": "1.12.0",
    "Video": "https://www.youtube.com/watch?v=0nirB-exquY&list=PLo2m88lJf-RRoLKMY8UEGqCpraKYrX5lk",
    "VignetteBuilder": "knitr",
    "biocViews": [
        "DifferentialExpression",
        "GeneSetEnrichment",
        "MotifDiscovery",
        "Network",
        "NetworkEnrichment",
        "Software",
        "Visualization"
    ],
    "dependencyCount": "195",
    "git_branch": "RELEASE_3_21",
    "git_last_commit": "14dd3bd",
    "git_last_commit_date": "2025-04-15",
    "git_url": "https://git.bioconductor.org/packages/omicsViewer",
    "hasINSTALL": false,
    "hasLICENSE": false,
    "hasNEWS": true,
    "hasREADME": false,
    "mac.binary.big-sur-arm64.ver": "bin/macosx/big-sur-arm64/contrib/4.5/omicsViewer_1.12.0.tgz",
    "mac.binary.big-sur-x86_64.ver": "bin/macosx/big-sur-x86_64/contrib/4.5/omicsViewer_1.12.0.tgz",
    "source.ver": "src/contrib/omicsViewer_1.12.0.tar.gz",
    "vignetteTitles": [
        "quickStart.html"
    ],
    "vignettes": [
        "vignettes/omicsViewer/inst/doc/quickStart.html"
    ],
    "win.binary.ver": "bin/windows/contrib/4.5/omicsViewer_1.12.0.zip"
}
