{
    "Author": "Simone Pallotta [aut, cre], Marco Masseroli [aut]",
    "Depends": [
        "R(>= 3.4.2)",
        "RGMQLlib"
    ],
    "Description": "This package brings the GenoMetric Query Language (GMQL) functionalities into the R environment. GMQL is a high-level, declarative language to manage heterogeneous genomic datasets for biomedical purposes, using simple queries to process genomic regions and their metadata and properties.  GMQL adopts algorithms efficiently designed for big data using cloud-computing technologies (like Apache Hadoop and Spark) allowing GMQL to run on modern infrastructures, in order to achieve scalability and high performance.  It allows to create, manipulate and extract genomic data from different data sources both locally and remotely. Our RGMQL functions allow complex queries and processing leveraging on the R idiomatic paradigm. The RGMQL package also provides a rich set of ancillary classes that allow sophisticated input/output management and sorting, such as: ASC, DESC, BAG, MIN, MAX, SUM, AVG, MEDIAN, STD, Q1, Q2, Q3 (and many others).  Note that many RGMQL functions are not directly executed in R environment, but are deferred until real execution is issued.",
    "Imports": [
        "BiocGenerics",
        "GenomicRanges",
        "S4Vectors",
        "data.table",
        "dplyr",
        "glue",
        "httr",
        "methods",
        "plyr",
        "rJava",
        "rtracklayer",
        "stats",
        "utils",
        "xml2"
    ],
    "License": "Artistic-2.0",
    "Maintainer": "Simone Pallotta <simonepallotta@hotmail.com>",
    "Package": "RGMQL",
    "PackageStatus": "Deprecated",
    "Rank": 2261,
    "Suggests": [
        "BiocStyle",
        "knitr",
        "rmarkdown"
    ],
    "Title": "GenoMetric Query Language for R/Bioconductor",
    "URL": "http://www.bioinformatics.deib.polimi.it/genomic_computing/GMQL/",
    "Version": "1.28.0",
    "VignetteBuilder": "knitr",
    "biocViews": [
        "DataImport",
        "ImmunoOncology",
        "Infrastructure",
        "Network",
        "SingleCell",
        "Software"
    ]
}
