{
    "Author": "Phaedra Agius <pagius@nygenome.org>",
    "Date/Publication": "2025-04-15",
    "Depends": [
        "R (>= 3.6)"
    ],
    "Description": "SCANVIS is a set of annotation-dependent tools for analyzing splice junctions and their read support as predetermined by an alignment tool of choice (for example, STAR aligner). SCANVIS assesses each junction's relative read support (RRS) by relating to the context of local split reads aligning to annotated transcripts. SCANVIS also annotates each splice junction by indicating whether the junction is supported by annotation or not, and if not, what type of junction it is (e.g. exon skipping, alternative 5' or 3' events, Novel Exons). Unannotated junctions are also futher annotated by indicating whether it induces a frame shift or not. SCANVIS includes a visualization function to generate static sashimi-style plots depicting relative read support and number of split reads using arc thickness and arc heights, making it easy for users to spot well-supported junctions. These plots also clearly delineate unannotated junctions from annotated ones using designated color schemes, and users can also highlight splice junctions of choice. Variants and/or a read profile are also incoroporated into the plot if the user supplies variants in bed format and/or the BAM file. One further feature of the visualization function is that users can submit multiple samples of a certain disease or cohort to generate a single plot - this occurs via a \"merge\" function wherein junction details over multiple samples are merged to generate a single sashimi plot, which is useful when contrasting cohorots (eg. disease vs control).",
    "Imports": [
        "IRanges",
        "RCurl",
        "plotrix",
        "rtracklayer"
    ],
    "License": "file LICENSE",
    "MD5sum": "2dc1ebb97278cf7ea72ac39398ffa205",
    "Maintainer": "Phaedra Agius <pagius@nygenome.org>",
    "NeedsCompilation": "no",
    "Package": "SCANVIS",
    "Rank": 1386,
    "Rfiles": [
        "vignettes/SCANVIS/inst/doc/runningSCANVIS.R"
    ],
    "Suggests": [
        "knitr",
        "rmarkdown"
    ],
    "Title": "SCANVIS - a tool for SCoring, ANnotating and VISualizing splice junctions",
    "Version": "1.22.0",
    "VignetteBuilder": "knitr",
    "biocViews": [
        "Annotation",
        "ResearchField",
        "Software",
        "Transcriptomics",
        "Visualization",
        "WorkflowStep"
    ],
    "dependencyCount": "59",
    "git_branch": "RELEASE_3_21",
    "git_last_commit": "6c366ac",
    "git_last_commit_date": "2025-04-15",
    "git_url": "https://git.bioconductor.org/packages/SCANVIS",
    "hasINSTALL": false,
    "hasLICENSE": true,
    "hasNEWS": false,
    "hasREADME": false,
    "mac.binary.big-sur-arm64.ver": "bin/macosx/big-sur-arm64/contrib/4.5/SCANVIS_1.22.0.tgz",
    "mac.binary.big-sur-x86_64.ver": "bin/macosx/big-sur-x86_64/contrib/4.5/SCANVIS_1.22.0.tgz",
    "source.ver": "src/contrib/SCANVIS_1.22.0.tar.gz",
    "vignetteTitles": [
        "SCANVIS"
    ],
    "vignettes": [
        "vignettes/SCANVIS/inst/doc/runningSCANVIS.pdf"
    ],
    "win.binary.ver": "bin/windows/contrib/4.5/SCANVIS_1.22.0.zip"
}
