{
    "additionDate": "2021-01-18T07:04:54Z",
    "biotoolsCURIE": "biotools:color-data",
    "biotoolsID": "color-data",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "clneben@color.com",
            "name": "Cynthia L. Neben",
            "typeEntity": "Person"
        }
    ],
    "description": "Color Data is a user-friendly, open-access database with hereditary cancer and hereditary cardiovascular conditions datasets. Color Data is the largest public database of its kind, containing aggregated genetic and phenotypic information from 54,000 individuals who took a Color test.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://data.color.com/",
    "lastUpdate": "2021-02-17T08:48:47Z",
    "name": "Color Data",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1101/2020.01.15.907212"
        },
        {
            "doi": "10.1093/database/baaa083",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Publicly available genetic databases promote data sharing and fuel scientific discoveries for the prevention, treatment and management of disease. In 2018, we built Color Data, a user-friendly, open access database containing genotypic and self-reported phenotypic information from 50 000 individuals who were sequenced for 30 genes associated with hereditary cancer. In a continued effort to promote access to these types of data, we launched Color Data v2, an updated version of the Color Data database. This new release includes additional clinical genetic testing results from more than 18 000 individuals who were sequenced for 30 genes associated with hereditary cardiovascular conditions as well as polygenic risk scores for breast cancer, coronary artery disease and atrial fibrillation. In addition, we used self-reported phenotypic information to implement the following four clinical risk models: Gail Model for 5-year risk of breast cancer, Claus Model for lifetime risk of breast cancer, simple office-based Framingham Coronary Heart Disease Risk Score for 10-year risk of coronary heart disease and CHARGE-AF simple score for 5-year risk of atrial fibrillation. These new features and capabilities are highlighted through two sample queries in the database. We hope that the broad dissemination of these data will help researchers continue to explore genotype-phenotype correlations and identify novel variants for functional analysis, enabling scientific discoveries in the field of population genomics. Database URL: https://data.color.com/.",
                "authors": [
                    {
                        "name": "Barrett R."
                    },
                    {
                        "name": "Berger M.J."
                    },
                    {
                        "name": "Ginsberg J."
                    },
                    {
                        "name": "Hong H."
                    },
                    {
                        "name": "McKennon W."
                    },
                    {
                        "name": "Neben C.L."
                    },
                    {
                        "name": "Williams H.E."
                    },
                    {
                        "name": "Zhou A.Y."
                    },
                    {
                        "name": "Zimmer A.D."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Color Data v2: A user-friendly, open-access database with hereditary cancer and hereditary cardiovascular conditions datasets"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "version": [
        "2"
    ]
}
