{
    "additionDate": "2019-11-14T18:05:39Z",
    "biotoolsCURIE": "biotools:Pathfinder",
    "biotoolsID": "Pathfinder",
    "confidence_flag": "tool",
    "description": "Open source software for analyzing spatial navigation search strategies | Search Strategy analysis and more for spatial navigation data in rodents | Morris Water Maze search strategy and entropy analysis | For a more detailed overview of Pathfinder please visit our Wiki | Created by Matthew Cooke at The University of British Columbia, Jason Snyder Lab | The Pathfinder package is a search strategy analysis tool for the Morris Water Maze, and can be expanded for other spatial navigation tasks. The program analyses X-Y coordinate data exported from commercially available tracking software. Pathfinder currently supports outputs from: Ethovision, Anymazy, WaterMaze, and ezTrack. We then calculate the best-fit search strategy for the trial. Trials are fit into one of: Direct Swim, Directed Search, Focal Search, Spatial indirect, Chaining, Scanning, Thigmotaxis, and Random Search",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://github.com/MatthewBCooke/Pathfinder",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-05T09:36:32Z",
    "license": "GPL-3.0",
    "name": "Pathfinder",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.20352.1",
            "metadata": {
                "abstract": "© 2019 Cooke MB et al.Spatial navigation is a universal behavior that varies depending on goals, experience and available sensory stimuli. Spatial navigational tasks are routinely used to study learning, memory and goal-directed behavior, in both animals and humans. One popular paradigm for testing spatial memory is the Morris water maze, where subjects learn the location of a hidden platform that offers escape from a pool of water. Researchers typically express learning as a function of the latency to escape, though this reveals little about the underlying navigational strategies. Recently, a number of studies have begun to classify water maze search strategies in order to clarify the precise spatial and mnemonic functions of different brain regions, and to identify which aspects of spatial memory are disrupted in disease models. However, despite their usefulness, strategy analyses have not been widely adopted due to the lack of software to automate analyses. To address this need we developed Pathfinder, an open source application for analyzing spatial navigation behaviors. In a representative dataset, we show that Pathfinder effectively characterizes the development of highly-specific spatial search strategies as male and female mice learn a standard spatial water maze. Pathfinder can read data files from commercially- and freely-available software packages, is optimized for classifying search strategies in water maze paradigms, and can also be used to analyze 2D navigation by other species, and in other tasks, as long as timestamped xy coordinates are available. Pathfinder is simple to use, can automatically determine pool and platform geometry, generates heat maps, analyzes navigation with respect to multiple goal locations, and can be updated to accommodate future developments in spatial behavioral analyses. Given these features, Pathfinder may be a useful tool for studying how navigational strategies are regulated by the environment, depend on specific neural circuits, and are altered by pathology.",
                "authors": [
                    {
                        "name": "Brown R.E."
                    },
                    {
                        "name": "Cooke M.B."
                    },
                    {
                        "name": "Harris P."
                    },
                    {
                        "name": "O'Leary T.P."
                    },
                    {
                        "name": "Snyder J.S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Pathfinder: Open source software for analyzing spatial navigation search strategies"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
