{
    "additionDate": "2017-08-03T18:55:48Z",
    "biotoolsCURIE": "biotools:phylornaalifold",
    "biotoolsID": "phylornaalifold",
    "credit": [
        {
            "email": "shzhang@eecs.ucf.edu",
            "name": "Shaojie Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Program for predicting consensus structures of aligned RNA sequences by incorporating phylogenetic-based covarying mutations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genome.ucf.edu/PhyloRNAalifold/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "homepage": "http://genome.ucf.edu/PhyloRNAalifold/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phylornaalifold-v1-predicting-consensus-structures-rna-alignments-incorporating-rnaalifold-phylogenetic-information.html"
        }
    ],
    "name": "PhyloRNAalifold",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: RNAalifold, a popular computational method for RNA consensus structure prediction, incorporates covarying mutations into a thermodynamic model to fold the aligned RNA sequences. When quantifying covariance, it evaluates conserved signals of two aligned columns with base-pairing rules. This scoring scheme performs better than some other approaches, such as mutual information. However it ignores the phylogenetic history of the aligned sequences, which is an important criterion to evaluate the level of sequence covariance. Results: In this article, in order to improve the accuracy of consensus structure folding, we propose a novel approach named PhyloRNAalifold. It incorporates the number of covarying mutations on the phylogenetic tree of the aligned sequences into the covariance scoring of RNAalifold. The benchmarking results show that the new scoring scheme of PhyloRNAalifold can improve the consensus structure detection of RNAalifold. Conclusion: Incorporating additional phylogenetic information of aligned sequences into the covariance scoring of RNAalifold can improve its performance of consensus structures folding. This improvement is correlated with alignment characteristics, such as pair-wise identity and the number of sequences in the alignment. © 2013 Ge and Zhang; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ge P."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "citationCount": 5,
                "date": "2013-04-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Incorporating phylogenetic-based covarying mutations into RNAalifold for RNA consensus structure prediction"
            },
            "pmid": "23621982"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
