{
    "additionDate": "2024-02-09T10:51:56.087811Z",
    "biotoolsCURIE": "biotools:homs_tc",
    "biotoolsID": "homs_tc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tajana@ucsd.edu",
            "name": "Tajana Rosing",
            "typeEntity": "Person"
        }
    ],
    "description": "Accelerating open modification spectral library searching on tensor core in high-dimensional space.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                },
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tycheyoung/homs-tc",
    "language": [
        "C",
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-02-09T10:51:56.090200Z",
    "license": "Apache-2.0",
    "name": "HOMS-TC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD404",
            "metadata": {
                "abstract": "Motivation: Driven by technological advances, the throughput and cost of mass spectrometry (MS) proteomics experiments have improved by orders of magnitude in recent decades. Spectral library searching is a common approach to annotating experimental mass spectra by matching them against large libraries of reference spectra corresponding to known peptides. An important disadvantage, however, is that only peptides included in the spectral library can be found, whereas novel peptides, such as those with unexpected post-translational modifications (PTMs), will remain unknown. Open modification searching (OMS) is an increasingly popular approach to annotate modified peptides based on partial matches against their unmodified counterparts. Unfortunately, this leads to very large search spaces and excessive runtimes, which is especially problematic considering the continuously increasing sizes of MS proteomics datasets. Results: We propose an OMS algorithm, called HOMS-TC, that fully exploits parallelism in the entire pipeline of spectral library searching. We designed a new highly parallel encoding method based on the principle of hyperdimensional computing to encode mass spectral data to hypervectors while minimizing information loss. This process can be easily parallelized since each dimension is calculated independently. HOMS-TC processes two stages of existing cascade search in parallel and selects the most similar spectra while considering PTMs. We accelerate HOMS-TC on NVIDIA's tensor core units, which is emerging and readily available in the recent graphics processing unit (GPU). Our evaluation shows that HOMS-TC is 31× faster on average than alternative search engines and provides comparable accuracy to competing search tools.",
                "authors": [
                    {
                        "name": "Bittremieux W."
                    },
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "Moshiri N."
                    },
                    {
                        "name": "Rosing T."
                    },
                    {
                        "name": "Xu W."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Accelerating open modification spectral library searching on tensor core in high-dimensional space"
            },
            "pmcid": "PMC10323168",
            "pmid": "37369033"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
