{
    "additionDate": "2019-11-14T18:35:18Z",
    "biotoolsCURIE": "biotools:SLDF_REML_L_FOMC_REML",
    "biotoolsID": "SLDF_REML_L_FOMC_REML",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "richard.border@colorado.edu",
            "name": "Richard Border",
            "orcidid": "https://orcid.org/0000-0002-6293-2968",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'SLDF_REML Lanczos', 'SLDF_REML', 'interpreted-language', 'CONCLUSIONS:Both SLDF_REML L_FOMC_REML' | Stochastic Lanczos estimation of genomic variance components for linear mixed-effects models | Stochastic Lanczos REML algorithms for genomic variance component estimation | Stochastic Lanczos REML algorithms | Code accompanying Stochastic Lanczos estimation of genomic variance components for linear mixed-effects models | L_Seed constructs bases for Krylov subspaces: B, (A+σI)B, (A+σI)²B, ..",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rborder/SL_REML",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T18:35:18Z",
    "name": "SLDF_REML L_FOMC_REML",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2978-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Linear mixed-effects models (LMM) are a leading method in conducting genome-wide association studies (GWAS) but require residual maximum likelihood (REML) estimation of variance components, which is computationally demanding. Previous work has reduced the computational burden of variance component estimation by replacing direct matrix operations with iterative and stochastic methods and by employing loose tolerances to limit the number of iterations in the REML optimization procedure. Here, we introduce two novel algorithms, stochastic Lanczos derivative-free REML (SLDF-REML) and Lanczos first-order Monte Carlo REML (L-FOMC-REML), that exploit problem structure via the principle of Krylov subspace shift-invariance to speed computation beyond existing methods. Both novel algorithms only require a single round of computation involving iterative matrix operations, after which their respective objectives can be repeatedly evaluated using vector operations. Further, in contrast to existing stochastic methods, SLDF-REML can exploit precomputed genomic relatedness matrices (GRMs), when available, to further speed computation. Results: Results of numerical experiments are congruent with theory and demonstrate that interpreted-language implementations of both algorithms match or exceed existing compiled-language software packages in speed, accuracy, and flexibility. Conclusions: Both the SLDF-REML and L-FOMC-REML algorithms outperform existing methods for REML estimation of variance components for LMM and are suitable for incorporation into existing GWAS LMM software implementations.",
                "authors": [
                    {
                        "name": "Border R."
                    },
                    {
                        "name": "Becker S."
                    }
                ],
                "date": "2019-07-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Stochastic Lanczos estimation of genomic variance components for linear mixed-effects models"
            },
            "pmcid": "PMC6668092",
            "pmid": "31362713"
        }
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        }
    ]
}