{
    "accessibility": "Open access",
    "additionDate": "2023-12-01T14:59:57.945267Z",
    "biotoolsCURIE": "biotools:polysmart",
    "biotoolsID": "polysmart",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hmakki@liverpool.ac.uk",
            "name": "Hesam Makki",
            "typeEntity": "Person"
        }
    ],
    "description": "General coarse-grained molecular dynamics polymerization scheme.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HMakkiMD/PolySMart",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-12-01T14:59:57.947552Z",
    "license": "Apache-2.0",
    "name": "PolySMart",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1039/D3MH00088E",
            "metadata": {
                "abstract": "The development of simulation methods to study the structure and dynamics of a macroscopically sized piece of polymer material is important as such methods can elucidate structure-property relationships. Several methods have been reported to construct initial structures for homo- and co-polymers; however, most of them are only useful for short linear polymers since one needs to pack and equilibrate the far-from-equilibrium initial structures, which is a tedious task for long or hyperbranched polymers and unfeasible for polymer networks. In this method article, we present PolySMart, i.e., an open-source python package, which can effectively produce fully equilibrated homo- and hetero-polymer melts and solutions with no limitation on the polymer topology and size, at a coarse-grained resolution and through a bottom-up approach. This python package is also capable of exploring the polymerization kinetics through its reactive scheme in realistic conditions so that it can model the multiple co-occurring polymerization reactions (with different reaction rates) as well as consecutive polymerizations under stoichiometric and non-stoichiometric conditions. Thus, the equilibrated polymer models are generated through correct polymerization kinetics. A benchmark and verification of the performance of the program for several realistic cases, i.e., for homo-polymers, co-polymers, and crosslinked networks, is given. We further discuss the capability of the program to contribute to the discovery and design of new polymer materials.",
                "authors": [
                    {
                        "name": "Ghermezcheshme H."
                    },
                    {
                        "name": "Makki H."
                    },
                    {
                        "name": "Mirzaalipour A."
                    },
                    {
                        "name": "Mohseni M."
                    },
                    {
                        "name": "Mousavifard S.M."
                    },
                    {
                        "name": "de With G."
                    }
                ],
                "citationCount": 1,
                "date": "2023-03-28T00:00:00Z",
                "journal": "Materials Horizons",
                "title": "PolySMart: a general coarse-grained molecular dynamics polymerization scheme"
            },
            "pmid": "37022310"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
