{
    "additionDate": "2022-11-10T16:31:18.097408Z",
    "biotoolsCURIE": "biotools:mimo_ontology",
    "biotoolsID": "mimo_ontology",
    "confidence_flag": "high",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Arriel Benis"
        },
        {
            "name": "Stéfan J. Darmoni"
        }
    ],
    "description": "Medical informatics and digital health multilingual ontology (MIMO): A tool to improve international collaborations which is hosted by HeTOP (Health Terminology/Ontology Portal)",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.hetop.eu/hetop/documentation/tech.html"
        },
        {
            "type": [
                "Terms of use"
            ],
            "url": "https://www.hetop.eu/hetop/documentation/tos.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Phylogenetic tree annotation",
                    "uri": "http://edamontology.org/operation_0558"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "homepage": "https://www.hetop.eu/hetop/rep/en/EFMIMIMO/",
    "lastUpdate": "2024-11-24T15:21:29.476749Z",
    "license": "Other",
    "name": "MIMO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ijmedinf.2022.104860",
            "metadata": {
                "abstract": "Background: Even if English is the leading language for international communication, it is essential to keep in mind that research runs at the local level by local teams generally communicating in their local/national language, especially in Europe among European projects. Objective: Therefore, the European Federation for Medical Informatics - Working Group on Health Informatics for Inter-regional Cooperation” has one objective: To develop a multilingual ontology focusing on Health Informatics and Digital Health as a collaboration tool that improves international and, in particular, European collaborations. Results: We have developed the Medical Informatics and Digital Health Multilingual Ontology (MIMO). Hosted on the Health Terminology/Ontology Portal (HeTOP), MIMO contains around 1,000 concepts, 460 MeSH Descriptors, 220 MeSH Concepts, and more than 300 newly created concepts. MIMO is continuously updated to comprise as recent as possible concepts and their translations in more than 30 languages. Moreover, the MIMO's development team constantly improves MIMO content and supporting information. Thus, during workshop discussions and one-on-one exchanges, the MIMO team has collected domain experts’ opinions about the community's interests and suggestions for future enhancements. Moreover, MIMO will be integrated to support the annotation and categorization of research products into the HosmartAI European project involving more than 20 countries around Europe and worldwide. Conclusion: MIMO is hosted by HeTOP (Health Terminology/Ontology Portal), which integrates 100 terminologies and ontologies in 55 languages. MIMO is freely available online. MIMO is portable to other knowledge platforms as part of MIMO's main aims to facilitate communication between medical librarians, translators, and researchers as well as to support students’ self-learning.",
                "authors": [
                    {
                        "name": "Benis A."
                    },
                    {
                        "name": "Billey K."
                    },
                    {
                        "name": "Crisan-Vida M."
                    },
                    {
                        "name": "Darmoni S.J."
                    },
                    {
                        "name": "Dornauer V."
                    },
                    {
                        "name": "Grosjean J."
                    },
                    {
                        "name": "Hackl W.O."
                    },
                    {
                        "name": "Montanha G."
                    },
                    {
                        "name": "Stoicu-Tivadar L."
                    }
                ],
                "citationCount": 13,
                "date": "2022-11-01T00:00:00Z",
                "journal": "International Journal of Medical Informatics",
                "title": "Medical informatics and digital health multilingual ontology (MIMO): A tool to improve international collaborations"
            },
            "pmcid": "PMC9582075",
            "pmid": "36084537"
        },
        {
            "doi": "10.3233/shti220900",
            "metadata": {
                "abstract": "The aim of this paper is to present the use of Medical Informatics Multilingual Ontology (MIMO) to index digital health resources that are (and will be) included in SaNuRN (project to teach digital health). MIMO currently contains 1,379 concepts and is integrated into HeTOP, which is a cross-lingual multiterminogy server. Existing teaching resources have been reindexed with MIMO concepts and integrated into a dedicated website. A total of 345 resources have been indexed with MIMO concepts and are freely available at https://doccismef.chu-rouen.fr/dc/#env=sanurn. The development of a multilingual MIMO for enhancing the quality and the efficiency of international projects is challenging. A specific semantic search engine has been deployed to give access to digital health teaching resources.",
                "authors": [
                    {
                        "name": "Benis A."
                    },
                    {
                        "name": "Dahamna B."
                    },
                    {
                        "name": "Darmoni S."
                    },
                    {
                        "name": "Disson F."
                    },
                    {
                        "name": "Grosjean J."
                    },
                    {
                        "name": "Lejeune E."
                    },
                    {
                        "name": "Staccini P."
                    },
                    {
                        "name": "Weber P."
                    }
                ],
                "citationCount": 3,
                "date": "2022-08-31T00:00:00Z",
                "journal": "Studies in Health Technology and Informatics",
                "title": "Digital Health Multilingual Ontology to Index Teaching Resources"
            },
            "pmid": "36073449"
        }
    ],
    "toolType": [
        "Bioinformatics portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Laboratory information management",
            "uri": "http://edamontology.org/topic_0607"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
