{
    "accessibility": "Restricted access",
    "additionDate": "2019-11-14T18:19:32Z",
    "biotoolsCURIE": "biotools:iDScore",
    "biotoolsID": "iDScore",
    "confidence_flag": "tool",
    "description": "Validation of an integrated dermoscopic scoring method in an European teledermoscopy web platform | EADV-iDScore project “European web platform for the development of a Scoring Classifier for Early Melanoma detection” (EADV PPRC project number 2016-012)",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://eadv-idscore.dbm.unisi.it",
    "lastUpdate": "2020-12-14T08:31:32Z",
    "name": "iDScore",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/JDV.15923",
            "metadata": {
                "abstract": "© 2019 European Academy of Dermatology and VenereologyBackground: Although live and teledermoscopic examination has been successfully used to achieve non-invasive diagnosis of melanocytic skin lesions (MSLs), early melanoma (EM) and atypical nevi (AN) continue to be a challenge, and none of the various algorithms proposed have been sufficiently accurate. We designed a scoring classifier diagnostic method, the iDScore that combines clinical data of the patient with dermoscopic features of the MSL. Objective: To test the accuracy of the iDScore in differentiating EM from AN in a teledermoscopy setting and to compare it with intuitive diagnosis, the ABCD rule and the seven-point checklist. Materials and methods: A dedicated teledermoscopy web platform was designed. This involved the following: (i) collecting a large integrated clinical–historical–dermoscopic data set of difficult MSLs from eight European dermatology centres; (ii) online testing, education and training in using the iDScore. A total of 904 images were combined with age, sex, lesion diameter and body site data and evaluated on the platform by 111 participants with four levels of skill in dermoscopy. Each testing session consisted of 30 blind cases to examine consecutively by the above four methods. ‘Management decisions’ and personal participant data were also recorded. Results: iDScore-aided diagnosis achieved satisfactory diagnostic accuracy for all lesions, irrespective of centre of affiliation, showing an average AUC of 0.776 in all participant testing sessions. All skill groups improved their accuracy by 10–16% with respect to intuitive diagnosis and the other methods, showing high concordance and avoiding wrong management decisions. Conclusion: We demonstrated the validity of the iDScore method for managing suspicious MSLs in a large multicentric data set and a teledermoscopic setting. The platform designed for the iDScore project provides ready support for physicians of any dermoscopy skill level and is useful for education and training.",
                "authors": [
                    {
                        "name": "Tognetti L."
                    },
                    {
                        "name": "Cevenini G."
                    },
                    {
                        "name": "Moscarella E."
                    },
                    {
                        "name": "Cinotti E."
                    },
                    {
                        "name": "Farnetani F."
                    },
                    {
                        "name": "Lallas A."
                    },
                    {
                        "name": "Tiodorovic D."
                    },
                    {
                        "name": "Carrera C."
                    },
                    {
                        "name": "Puig S."
                    },
                    {
                        "name": "Perrot J.L."
                    },
                    {
                        "name": "Longo C."
                    },
                    {
                        "name": "Argenziano G."
                    },
                    {
                        "name": "Pellacani G."
                    },
                    {
                        "name": "Smargiassi E."
                    },
                    {
                        "name": "Cataldo G."
                    },
                    {
                        "name": "Cartocci A."
                    },
                    {
                        "name": "Balistreri A."
                    },
                    {
                        "name": "Rubegni P."
                    }
                ],
                "citationCount": 9,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Journal of the European Academy of Dermatology and Venereology",
                "title": "Validation of an integrated dermoscopic scoring method in an European teledermoscopy web platform: the iDScore project for early detection of melanoma"
            },
            "pmid": "31465600"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Dermatology",
            "uri": "http://edamontology.org/topic_3404"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        }
    ],
    "validated": 1
}