{
    "additionDate": "2021-01-18T09:18:57Z",
    "biotoolsCURIE": "biotools:tindermix",
    "biotoolsID": "tindermix",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dario.greco@tuni.fi",
            "name": "Dario Greco",
            "orcidid": "https://orcid.org/0000-0001-9195-9003",
            "typeEntity": "Person"
        }
    ],
    "description": "Time-dose integrated modelling of toxicogenomics data.\n\nTinderMIX is a new computational framework for dose- and time- dependent gene expression analysis which aims to identify groups of genes that show a dynamic dose-response behaviour.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/grecolab/TinderMIX",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-27T09:55:32Z",
    "license": "GPL-3.0",
    "name": "TinderMIX",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIAA055",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Background: Omics technologies have been widely applied in toxicology studies to investigate the effects of different substances on exposed biological systems. A classical toxicogenomic study consists in testing the effects of a compound at different dose levels and different time points. The main challenge consists in identifying the gene alteration patterns that are correlated to doses and time points. The majority of existing methods for toxicogenomics data analysis allow the study of the molecular alteration after the exposure (or treatment) at each time point individually. However, this kind of analysis cannot identify dynamic (time-dependent) events of dose responsiveness. Results: We propose TinderMIX, an approach that simultaneously models the effects of time and dose on the transcriptome to investigate the course of molecular alterations exerted in response to the exposure. Starting from gene log fold-change, TinderMIX fits different integrated time and dose models to each gene, selects the optimal one, and computes its time and dose effect map; then a user-selected threshold is applied to identify the responsive area on each map and verify whether the gene shows a dynamic (time-dependent) and dose-dependent response; eventually, responsive genes are labelled according to the integrated time and dose point of departure. Conclusions: To showcase the TinderMIX method, we analysed 2 drugs from the Open TG-GATEs dataset, namely, cyclosporin A and thioacetamide.We first identified the dynamic dose-dependent mechanism of action of each drug and compared them. Our analysis highlights that different time- and dose-integrated point of departure recapitulates the toxicity potential of the compounds as well as their dynamic dose-dependent mechanism of action.",
                "authors": [
                    {
                        "name": "Serra A."
                    },
                    {
                        "name": "Fratello M."
                    },
                    {
                        "name": "Del Giudice G."
                    },
                    {
                        "name": "Saarimaki L.A."
                    },
                    {
                        "name": "Paci M."
                    },
                    {
                        "name": "Federico A."
                    },
                    {
                        "name": "Greco D."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "TinderMIX: Time-dose integrated modelling of toxicogenomics data"
            },
            "pmcid": "PMC7247400",
            "pmid": "32449777"
        }
    ],
    "topic": [
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}