{
    "additionDate": "2024-01-03T22:29:49.485726Z",
    "biotoolsCURIE": "biotools:msmpred",
    "biotoolsID": "msmpred",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "leire.garmendia@upc.edu",
            "name": "Leire Garmendia Bergés",
            "orcidid": "https://orcid.org/0000-0002-2053-9535",
            "typeEntity": "Person"
        }
    ],
    "description": "Interactive modeling and prediction of individual evolution via multistate models.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "https://www.grbio.eu/pubs/MSMpred/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:23:30.337338Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/LeireGarmendia/MSMpred"
        }
    ],
    "name": "MSMpred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12874-023-01951-3",
            "metadata": {
                "abstract": "Background: Modelling the course of a disease regarding severe events and identifying prognostic factors is of great clinical relevance. Multistate models (MSM) can be used to describe diseases or processes that change over time using different states and the transitions between them. Specifically, they are useful to analyse a disease with an increasing degree of severity, that may precede death. The complexity of these models changes depending on the number of states and transitions taken into account. Due to that, a web tool has been developed making easier to work with those models. Results: MSMpred is a web tool created with the shiny R package that has two main features: 1) to allow to fit a MSM from specific data; 2) to predict the clinical evolution for a given subject. To fit the model, the data to be analysed must be upload in a prespecified format. Then, the user has to define the states and transitions as well as the covariates (e.g., age or gender) involved in each transition. From this information, the app returns histograms or barplots, as appropriate, to represent the distributions of the selected covariates and boxplots to show the patient’ length of stay (for uncensored data) in each state. To make predictions, the values of selected covariates from a new subject at baseline has to be provided. From these inputs, the app provides some indicators of the subject’s evolution such as the probability of 30-day death or the most likely state at a fixed time. Furthermore, visual representations (e.g., the stacked transition probabilities plot) are given to make predictions more understandable. Conclusions: MSMpred is an intuitive and visual app that eases the work of biostatisticians and facilitates to the medical personnel the interpretation of MSMs.",
                "authors": [
                    {
                        "name": "CortesMartinez J."
                    },
                    {
                        "name": "GarmendiaBerges L."
                    },
                    {
                        "name": "GomezMelis G."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "MSMpred: interactive modelling and prediction of individual evolution via multistate models"
            },
            "pmcid": "PMC10206572",
            "pmid": "37226104"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
