
{
    "credit": [
        {
            "email": "ovcharen@nih.gov",
            "name": "Ivan Ovcharenko",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://www.ncbi.nlm.nih.gov/research/snpdelscore/doc/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence composition calculation",
                    "uri": "http://edamontology.org/operation_0236"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Data acquisition",
                "uri": "http://edamontology.org/topic_3077"
            },
            {
                "term": "Human biology",
                "uri": "http://edamontology.org/topic_2815"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© Published by Oxford University Press 2017. Summary Addressing deleterious effects of noncoding mutations is an essential step towards the identification of disease-causal mutations of gene regulatory elements. Several methods for quantifying the deleteriousness of noncoding mutations using artificial intelligence, deep learning and other approaches have been recently proposed. Although the majority of the proposed methods have demonstrated excellent accuracy on different test sets, there is rarely a consensus. In addition, advanced statistical and artificial learning approaches used by these methods make it difficult porting these methods outside of the labs that have developed them. To address these challenges and to transform the methodological advances in predicting deleterious noncoding mutations into a practical resource available for the broader functional genomics and population genetics communities, we developed SNPDelScore, which uses a panel of proposed methods for quantifying deleterious effects of noncoding mutations to precompute and compare the deleteriousness scores of all common SNPs in the human genome in 44 cell lines. The panel of deleteriousness scores of a SNP computed using different methods is supplemented by functional information from the GWAS Catalog, libraries of transcription factor-binding sites, and genic characteristics of mutations. SNPDelScore comes with a genome browser capable of displaying and comparing large sets of SNPs in a genomic locus and rapidly identifying consensus SNPs with the highest deleteriousness scores making those prime candidates for phenotype-causal polymorphisms.",
            "authors": [
                "Alvarez R.V.",
                "Li S.",
                "Landsman D.",
                "Ovcharenko I."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/btx583",
            "journal": "Bioinformatics",
            "title": "SNPDelScore: Combining multiple methods to score deleterious effects of noncoding mutations in the human genome",
            "year": "2018-01-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:snpdelscore",
        "biotoolsID": "snpdelscore",
        "description": "Displays pre-compute deleterious effects of noncoding variants using a large panel of currently available methods and summarizes this information in an interactive, easy to use website.",
        "homepage": "https://www.ncbi.nlm.nih.gov/research/snpdelscore/",
        "name": "SNPDelScore"
    }
}