{
    "accessibility": "Open access",
    "additionDate": "2022-10-07T08:09:48.361014Z",
    "biotoolsCURIE": "biotools:ch-bin",
    "biotoolsID": "ch-bin",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Sunera Chandrasiri"
        },
        {
            "name": "Vijini Mallawaarachchi"
        },
        {
            "name": "Vijini Mallawaarachchi"
        }
    ],
    "description": "CH-Bin - metagenomic binning using convex-hull distance metric",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kdsuneraavinash/CH-Bin",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:29:28.183234Z",
    "license": "MIT",
    "name": "CH-Bin",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.compbiolchem.2022.107734",
            "metadata": {
                "abstract": "Metagenomics has enabled culture-independent analysis of micro-organisms present in environmental samples. Metagenomics binning, which involves the grouping of contigs into bins that represent different taxonomic groups, is an important step of a typical metagenomic workflow followed after assembly. The majority of the metagenomic binning tools represent the composition and coverage information of contigs as feature vectors consisting of a large number of dimensions. However, these tools use traditional Euclidean distance or Manhattan distance metrics which become unreliable in the high dimensional space. We propose CH-Bin, a binning approach that leverages the benefits of using convex hull distance for binning contigs represented by high dimensional feature vectors. We demonstrate using experimental evidence on simulated and real datasets that the use of high dimensional feature vectors to represent contigs can preserve additional information, and result in improved binning results. We further demonstrate that the convex hull distance based binning approach can be effectively utilized in binning such high dimensional data. To the best of our knowledge, this is the first time that composition information from oligonucleotides of multiple sizes has been used in representing the composition information of contigs and a convex hull distance based binning algorithm has been used to bin metagenomic contigs. The source code of CH-Bin is available at https://github.com/kdsuneraavinash/CH-Bin.",
                "authors": [
                    {
                        "name": "Chandrasiri S."
                    },
                    {
                        "name": "Dilhara A."
                    },
                    {
                        "name": "Mallawaarachchi V."
                    },
                    {
                        "name": "Perera I."
                    },
                    {
                        "name": "Perera T."
                    }
                ],
                "citationCount": 3,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "CH-Bin: A convex hull based approach for binning metagenomic contigs"
            },
            "pmid": "35964419"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
