{
    "additionDate": "2021-01-18T09:34:23Z",
    "biotoolsCURIE": "biotools:higwas",
    "biotoolsID": "higwas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rwu@phs.psu.edu",
            "name": "Rongling Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "How to compute longitudinal GWAS data in population designs.\n\nImplementing Lasso methods to identify significant SNPs and estimate joint genetic effects for non-longitudinal traits or longitudinal traits in GWAS.\n\nThe HiGWAS package is developed to identify significant SNPs that control phenotypic variation and estimate their additive and dominant genetic effects based on the Bayesian Lasso or Group Lasso model. The package provides two statistical models, BLS can detect the association using one single time measured phenotypc and GLS solve the association based on the longitudinal phenotype.\n\n[1]. Li, J., Das, K., Fu, G., Li, R., & Wu, R. (2011). The Bayesian lasso for genome-wide association studies. Bioinformatics, 27(4), 516-523.\n\n[2]. Li. J., Wang, Z., Li, R., Wu, R.(2015).Bayesian Group Lasso for nonparametric varying-coefficient models with application to functional genome-wide association studies. The Annals of Applied Statistics. 9(1).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wzhy2000/higwas",
    "language": [
        "C++",
        "R",
        "C"
    ],
    "lastUpdate": "2021-01-30T11:41:05Z",
    "name": "HiGwas",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA294",
            "metadata": {
                "abstract": "© The Author(s) 2020.Summary: Genome-wide association studies (GWAS), particularly designed with thousands and thousands of single-nucleotide polymorphisms (SNPs) (big p) genotyped on tens of thousands of subjects (small n), are encountered by a major challenge of p ≪<FOR VERIFICATION> n. Although the integration of longitudinal information can significantly enhance a GWAS's power to comprehend the genetic architecture of complex traits and diseases, an additional challenge is generated by an autocorrelative process. We have developed several statistical models for addressing these two challenges by implementing dimension reduction methods and longitudinal data analysis. To make these models computationally accessible to applied geneticists, we wrote an R package of computer software, HiGwas, designed to analyze longitudinal GWAS datasets. Functions in the package encompass single SNP analyses, significance-level adjustment, preconditioning and model selection for a high-dimensional set of SNPs. HiGwas provides the estimates of genetic parameters and the confidence intervals of these estimates. We demonstrate the features of HiGwas through real data analysis and vignette document in the package.",
                "authors": [
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Wang N."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Wu R."
                    }
                ],
                "date": "2020-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HiGwas: How to compute longitudinal GWAS data in population designs"
            },
            "pmid": "32502244"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}