{
    "additionDate": "2021-01-18T11:15:30Z",
    "biotoolsCURIE": "biotools:predhpi",
    "biotoolsID": "predhpi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rkaundal@usu.edu",
            "name": "Rakesh Kaundal",
            "typeEntity": "Person"
        }
    ],
    "description": "an integrated web server platform for the detection and visualization of host-pathogen interactions using sequence-based methods.\n\nPredHPI an integrated web server platform for the prediction and visualization of host-pathogen interactions.\n\nThe International Molecular Exchange Consortium (IMEX) had the initiative to cluster the largest public interaction data providers. From those we have selected five (HPIDB, MINT, DIP, BioGRID and IntAct) as we think are the most comprehensive. Moreover, four other resources outside IMEX were included, VirHostNet, STRING, VIH-1 NCBI and PHISTO. VirHostNet is one of the most complete resources for Vir-Host interactions. STRING is the largest repository of protein-protein interaction, in the service only the experimental interaction of STRING were included. Dataset used in the benchmark of the PredHPI manuscript were finally included.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.usu.edu/PredHPI/",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2021-01-27T16:40:28Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/usubioinfo/PredHPI/"
        }
    ],
    "name": "PredHPI",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA862",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Understanding the mechanisms underlying infectious diseases is fundamental to develop prevention strategies. Host-pathogen interactions (HPIs) are actively studied worldwide to find potential genomic targets for the development of novel drugs, vaccines and other therapeutics. Determining which proteins are involved in the interaction system behind an infectious process is the first step to develop an efficient disease control strategy. Very few computational methods have been implemented as web services to infer novel HPIs, and there is not a single framework which combines several of those approaches to produce and visualize a comprehensive analysis of HPIs. Results: Here, we introduce PredHPI, a powerful framework that integrates both the detection and visualization of interaction networks in a single web service, facilitating the apprehension of model and non-model host-pathogen systems to aid the biologists in building hypotheses and designing appropriate experiments. PredHPI is built on high-performance computing resources on the backend capable of handling proteome-scale sequence data from both the host as well as pathogen. Data are displayed in an information-rich and interactive visualization, which can be further customized with user-defined layouts. We believe PredHPI will serve as an invaluable resource to diverse experimental biologists and will help advance the research in the understanding of complex infectious diseases.",
                "authors": [
                    {
                        "name": "Kaundal R."
                    },
                    {
                        "name": "Loaiza C.D."
                    }
                ],
                "citationCount": 1,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PredHPI: An integrated web server platform for the detection and visualization of host-pathogen interactions using sequence-based methods"
            },
            "pmid": "33027504"
        }
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
