{
    "additionDate": "2021-01-18T10:53:25Z",
    "biotoolsCURIE": "biotools:portadrop",
    "biotoolsID": "portadrop",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "schnakenberg@iwe1.rwth-aachen.de",
            "name": "Uwe Schnakenberg",
            "typeEntity": "Person"
        }
    ],
    "description": "A portable digital microfluidic platform providing versatile opportunities for Lab-On-A-Chip applications.\n\nPortaDrop is a portable digital microfluidic system.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ewodac/PortaDrop",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-24T15:12:03Z",
    "name": "PortaDrop",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0238581",
            "metadata": {
                "abstract": "© 2020 Kremers et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Electrowetting-on-dielectric is a decent technique to manipulate discrete volumes of liquid in form of droplets. In the last decade, electrowetting-on-dielectric systems, also called digital microfluidic systems, became more frequently used for a variety of applications because of their high flexibility and reconfigurability. Thus, one design can be adapted to different assays by only reprogramming. However, this flexibility can only be useful if the entire system is portable and easy to use. This paper presents the development of a portable, standalone digital microfluidic system based on a Linux-based operating system running on a Raspberry Pi, which is unique. We present “PortaDrop” exhibiting the following key features: (1) an “all-in-one box” approach, (2) a user-friendly, self-explaining graphical user interface and easy handling, (3) the ability of integrated electrochemical measurements, (4) the ease to implement additional lab equipment via Universal Serial Bus and the General Purpose Interface Bus as well as (5) a standardized experiment documentation. We propose that PortaDrop can be used to carry out experiments in different applications, where small sample volumes in the nanoliter to picoliter range need to be handled an analyzed automatically. As a first application, we present a protocol, where a droplet is consequently exchanged by droplets of another medium using passive dispensing. The exchange is monitored by electrical impedance spectroscopy. It is the first time, the media exchange caused by passive dispensing is characterized by electrochemical impedance spectroscopy. Summarizing, PortaDrop allows easy combination of fluid handling by means of electrowetting and additional sensing.",
                "authors": [
                    {
                        "name": "Kremers T."
                    },
                    {
                        "name": "Thelen S."
                    },
                    {
                        "name": "Bosbach N."
                    },
                    {
                        "name": "Schnakenberg U."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PortaDrop: A portable digital microfluidic platform providing versatile opportunities for Lab-On-A-Chip applications"
            },
            "pmcid": "PMC7470335",
            "pmid": "32881948"
        }
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}