{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T08:29:59Z",
    "biotoolsCURIE": "biotools:scruff",
    "biotoolsID": "scruff",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhe@bu.edu",
            "name": "Zhe Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        }
    ],
    "description": "R/Bioconductor package for preprocessing single-cell RNA-sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "RNA-seq read count analysis",
                    "uri": "http://edamontology.org/operation_3563"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/release/bioc/html/scruff.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/campbio/scruff/issues"
        }
    ],
    "maturity": "Mature",
    "name": "scruff",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2797-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Single-cell RNA sequencing (scRNA-seq) enables the high-throughput quantification of transcriptional profiles in single cells. In contrast to bulk RNA-seq, additional preprocessing steps such as cell barcode identification or unique molecular identifier (UMI) deconvolution are necessary for preprocessing of data from single cell protocols. R packages that can easily preprocess data and rapidly visualize quality metrics and read alignments for individual cells across multiple samples or runs are still lacking. Results: Here we present scruff, an R/Bioconductor package that preprocesses data generated from the CEL-Seq or CEL-Seq2 protocols and reports comprehensive data quality metrics and visualizations. scruff rapidly demultiplexes, aligns, and counts the reads mapped to genome features with deduplication of unique molecular identifier (UMI) tags. scruff also provides novel and extensive functions to visualize both pre- and post-alignment data quality metrics for cells from multiple experiments. Detailed read alignments with corresponding UMI information can be visualized at specific genome coordinates to display differences in isoform usage. The package also supports the visualization of quality metrics for sequence alignment files for multiple experiments generated by Cell Ranger from 10X Genomics. scruff is available as a free and open-source R/Bioconductor package. Conclusions: scruff streamlines the preprocessing of scRNA-seq data in a few simple R commands. It performs data demultiplexing, alignment, counting, quality report and visualization systematically and comprehensively, ensuring reproducible and reliable analysis of scRNA-seq data.",
                "authors": [
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Johnson W.E."
                    },
                    {
                        "name": "Campbell J.D."
                    }
                ],
                "citationCount": 2,
                "date": "2019-05-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Scruff: An R/Bioconductor package for preprocessing single-cell RNA-sequencing data"
            },
            "pmcid": "PMC6498700",
            "pmid": "31046658",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "version": [
        "1.2.0"
    ]
}