{
    "additionDate": "2019-11-14T19:40:54Z",
    "biotoolsCURIE": "biotools:Flint",
    "biotoolsID": "Flint",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "giri@cs.fiu.edu",
            "name": "Giri Narasimhan",
            "typeEntity": "Person"
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'IMPLEMENTATION:Flint' | Large scale microbiome profiling in the cloud | Main repository of the Flint project for Spark and Amazon EMR | This is the main repository of the Flint project for Amazon Web Services. Flint is a metagenomics profiling pipeline that is built on top of the Apache Spark framework, and is designed for fast real-time profiling of metagenomic samples against a large collection of reference genomes. Flint takes advantage of Spark's built-in parallelism and streaming engine architecture to quickly map reads against a large reference collection of bacterial genomes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/camilo-v/flint",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:40:54Z",
    "license": "MIT",
    "name": "Flint",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ356",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Bacterial metagenomics profiling for metagenomic whole sequencing (mWGS) usually starts by aligning sequencing reads to a collection of reference genomes. Current profiling tools are designed to work against a small representative collection of genomes, and do not scale very well to larger reference genome collections. However, large reference genome collections are capable of providing a more complete and accurate profile of the bacterial population in a metagenomics dataset. In this paper, we discuss a scalable, efficient and affordable approach to this problem, bringing big data solutions within the reach of laboratories with modest resources. Results: We developed Flint, a metagenomics profiling pipeline that is built on top of the Apache Spark framework, and is designed for fast real-time profiling of metagenomic samples against a large collection of reference genomes. Flint takes advantage of Spark's built-in parallelism and streaming engine architecture to quickly map reads against a large (170 GB) reference collection of 43 552 bacterial genomes from Ensembl. Flint runs on Amazon's Elastic MapReduce service, and is able to profile 1 million Illumina paired-end reads against over 40 K genomes on 64 machines in 67 s - an order of magnitude faster than the state of the art, while using a much larger reference collection. Streaming the sequencing reads allows this approach to sustain mapping rates of 55 million reads per hour, at an hourly cluster cost of $8.00 USD, while avoiding the necessity of storing large quantities of intermediate alignments.",
                "authors": [
                    {
                        "name": "Valdes C."
                    },
                    {
                        "name": "Stebliankin V."
                    },
                    {
                        "name": "Narasimhan G."
                    }
                ],
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Large scale microbiome profiling in the cloud"
            },
            "pmcid": "PMC6612844",
            "pmid": "31510682"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}