{
    "additionDate": "2020-01-09T17:47:44Z",
    "biotoolsCURIE": "biotools:ViralPlaque",
    "biotoolsID": "ViralPlaque",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "cacciabue.marco@inta.gob.ar",
            "name": "Marco Cacciabue",
            "typeEntity": "Person"
        },
        {
            "email": "gismondi.maria@inta.gob.ar",
            "name": "Maria I. Gismondi",
            "typeEntity": "Person"
        }
    ],
    "description": "a Fiji macro for automated assessment of viral plaque statistics.\n\nPlaque assay has been used for a long time to determine infectious titers and characterize prokaryotic and eukaryotic viruses forming plaques. Indeed, plaque morphology and dimensions can provide information regarding the replication kinetics and the virulence of a particular virus. In this work, we present ViralPlaque, a fast, open-source and versatile ImageJ macro for the automated determination of viral plaque dimensions from digital images. Also, a machine learning plugin is integrated in the analysis algorithm for adaptation of ViralPlaque to the user's needs and experimental conditions. A high correlation between manual and automated measurements of plaque dimensions was demonstrated. This macro will facilitate reliable and reproducible characterization of cytolytic viruses with an increased processing speed",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/viralplaque/",
    "lastUpdate": "2020-01-09T17:47:44Z",
    "name": "ViralPlaque",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7729",
            "metadata": {
                "abstract": "Copyright © 2019 Cacciabue et al.Plaque assay has been used for a long time to determine infectious titers and characterize prokaryotic and eukaryotic viruses forming plaques. Indeed, plaque morphology and dimensions can provide information regarding the replication kinetics and the virulence of a particular virus. In this work, we present ViralPlaque, a fast, opensource and versatile ImageJ macro for the automated determination of viral plaque dimensions from digital images. Also, a machine learning plugin is integrated in the analysis algorithm for adaptation of ViralPlaque to the user's needs and experimental conditions. A high correlation between manual and automated measurements of plaque dimensions was demonstrated. This macro will facilitate reliable and reproducible characterization of cytolytic viruses with an increased processing speed.",
                "authors": [
                    {
                        "name": "Cacciabue M."
                    },
                    {
                        "name": "Curra A."
                    },
                    {
                        "name": "Gismondi M.I."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "ViralPlaque: A Fiji macro for automated assessment of viral plaque statistics"
            },
            "pmcid": "PMC6764358",
            "pmid": "31579606"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}