
{
    "credit": [
        {
            "email": "xuruifeng@hit.edu.cn",
            "name": "Ruifeng Xu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://hlt.hitsz.edu.cn/CNNH_PSS/readme.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "toolType": [
            "Library",
            "Web service"
        ],
        "topic": [
            {
                "term": "Protein secondary structure",
                "uri": "http://edamontology.org/topic_3542"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Background: Protein secondary structure is the three dimensional form of local segments of proteins and its prediction is an important problem in protein tertiary structure prediction. Developing computational approaches for protein secondary structure prediction is becoming increasingly urgent. Results: We present a novel deep learning based model, referred to as CNNH_PSS, by using multi-scale CNN with highway. In CNNH_PSS, any two neighbor convolutional layers have a highway to deliver information from current layer to the output of the next one to keep local contexts. As lower layers extract local context while higher layers extract long-range interdependencies, the highways between neighbor layers allow CNNH_PSS to have ability to extract both local contexts and long-range interdependencies. We evaluate CNNH_PSS on two commonly used datasets: CB6133 and CB513. CNNH_PSS outperforms the multi-scale CNN without highway by at least 0.010 Q8 accuracy and also performs better than CNF, DeepCNF and SSpro8, which cannot extract long-range interdependencies, by at least 0.020 Q8 accuracy, demonstrating that both local contexts and long-range interdependencies are indeed useful for prediction. Furthermore, CNNH_PSS also performs better than GSM and DCRNN which need extra complex model to extract long-range interdependencies. It demonstrates that CNNH_PSS not only cost less computer resource, but also achieves better predicting performance. Conclusion: CNNH_PSS have ability to extracts both local contexts and long-range interdependencies by combing multi-scale CNN and highway network. The evaluations on common datasets and comparisons with state-of-the-art methods indicate that CNNH_PSS is an useful and efficient tool for protein secondary structure prediction.",
            "authors": [
                "Zhou J.",
                "Wang H.",
                "Zhao Z.",
                "Xu R.",
                "Lu Q."
            ],
            "cit_count": 0,
            "doi": "10.1186/s12859-018-2067-8",
            "journal": "BMC Bioinformatics",
            "title": "CNNH_PSS: Protein 8-class secondary structure prediction by convolutional neural network with highway",
            "type": "Primary",
            "year": "2018-05-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cnnh_pss",
        "biotoolsID": "cnnh_pss",
        "description": "have ability to extracts both local contexts and long-range interdependencies by combing multi-scale CNN and highway network. The evaluations on common datasets and comparisons with state-of-the-art methods indicate that CNNH_PSS is an useful and efficient tool for protein secondary structure prediction.",
        "homepage": "http://hlt.hitsz.edu.cn/CNNH_PSS/",
        "name": "CNNH_PSS"
    }
}