{
    "additionDate": "2021-01-18T07:30:48Z",
    "biotoolsCURIE": "biotools:biclique",
    "biotoolsID": "biclique",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yupinglu89@gmail.com",
            "name": "Yuping Lu",
            "orcidid": "https://orcid.org/0000-0002-8113-7652",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for maximal biclique enumeration in bipartite graphs. A tool for enumerating maximal complete bipartite graphs. The input should be a edge list file or a binary matrix file. The output are maximal complete bipartite graphs.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://cran.r-project.org/package=biclique",
    "language": [
        "C",
        "R",
        "C++"
    ],
    "lastUpdate": "2021-01-31T18:45:32Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/YupingLu/biclique"
        }
    ],
    "name": "biclique",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13104-020-04955-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Objective: Bipartite graphs are widely used to model relationships between pairs of heterogeneous data types. Maximal bicliques are foundational structures in such graphs, and their enumeration is an important task in systems biology, epidemiology and many other problem domains. Thus, there is a need for an efficient, general purpose, publicly available tool to enumerate maximal bicliques in bipartite graphs. The statistical programming language R is a logical choice for such a tool, but until now no R package has existed for this purpose. Our objective is to provide such a package, so that the research community can more easily perform this computationally demanding task. Results: Biclique is an R package that takes as input a bipartite graph and produces a listing of all maximal bicliques in this graph. Input and output formats are straightforward, with examples provided both in this paper and in the package documentation. Biclique employs a state-of-the-art algorithm previously developed for basic research in functional genomics. This package, along with its source code and reference manual, are freely available from the CRAN public repository at https://cran.r-project.org/web/packages/biclique/index.html.",
                "authors": [
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Phillips C.A."
                    },
                    {
                        "name": "Langston M.A."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-21T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Biclique: An R package for maximal biclique enumeration in bipartite graphs"
            },
            "pmcid": "PMC7035696",
            "pmid": "32085812"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}