{
    "additionDate": "2021-05-28T07:37:17Z",
    "biotoolsCURIE": "biotools:mrmassaydb",
    "biotoolsID": "mrmassaydb",
    "description": "A Comprehensive Resource for Targeted Proteomics Assays in the Community.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                }
            ]
        }
    ],
    "homepage": "http://mrmassaydb.proteincentre.com/",
    "lastUpdate": "2024-11-24T20:21:53.486994Z",
    "name": "MRMAssayDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.0c00961",
            "metadata": {
                "abstract": "Precise multiplexed quantification of proteins in biological samples can be achieved by targeted proteomics using multiple or parallel reaction monitoring (MRM/PRM). Combined with internal standards, the method achieves very good repeatability and reproducibility enabling excellent protein quantification and allowing longitudinal and cohort studies. A laborious part of performing such experiments lies in the preparation steps dedicated to the development and validation of individual protein assays. Several public repositories host information on targeted proteomics assays, including NCI's Clinical Proteomic Tumor Analysis Consortium assay portals, PeptideAtlas SRM Experiment Library, SRMAtlas, PanoramaWeb, and PeptideTracker, with all offering varying levels of details. We introduced MRMAssayDB in 2018 as an integrated resource for targeted proteomics assays. The Web-based application maps and links the assays from the repositories, includes comprehensive up-to-date protein and sequence annotations, and provides multiple visualization options on the peptide and protein level. We have extended MRMAssayDB with more assays and extensive annotations. Currently it contains >828 000 assays covering >51 000 proteins from 94 organisms, of which >17 000 proteins are present in >2400 biological pathways, and >48 000 mapping to >21 000 Gene Ontology terms. This is an increase of about four times the number of assays since introduction. We have expanded annotations of interaction, biological pathways, and disease associations. A newly added visualization module for coupled molecular structural annotation browsing allows the user to interactively examine peptide sequence and any known PTMs and disease mutations, and map all to available protein 3D structures. Because of its integrative approach, MRMAssayDB enables a holistic view of suitable proteotypic peptides and commonly used transitions in empirical data. Availability: http://mrmassaydb.proteincentre.com.",
                "authors": [
                    {
                        "name": "Bhowmick P."
                    },
                    {
                        "name": "Borchers C.H."
                    },
                    {
                        "name": "Goodlett D.R."
                    },
                    {
                        "name": "Mohammed Y."
                    },
                    {
                        "name": "Roome S."
                    }
                ],
                "citationCount": 14,
                "date": "2021-04-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "An Update on MRMAssayDB: A Comprehensive Resource for Targeted Proteomics Assays in the Community"
            },
            "pmid": "33683131"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
