{
    "additionDate": "2017-05-16T13:43:17Z",
    "biotoolsCURIE": "biotools:nrpspredictor2",
    "biotoolsID": "nrpspredictor2",
    "credit": [
        {
            "email": "roettig@informatik.uni-tuebingen.de",
            "name": "Marc Röttig",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "NRPSpredictor2 is a web server for predicting bacterial non-ribosomal peptide synthetases (NRPS) adenylation domain specificity.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://nrps.informatik.uni-tuebingen.de/Controller?cmd=Help"
        }
    ],
    "editPermission": {
        "authors": [
            "szm"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://nrps.informatik.uni-tuebingen.de/",
    "homepage_status": 1,
    "lastUpdate": "2019-02-06T11:59:32Z",
    "name": "NRPSpredictor2",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkr323",
            "metadata": {
                "abstract": "The products of many bacterial non-ribosomal peptide synthetases (NRPS) are highly important secondary metabolites, including vancomycin and other antibiotics. The ability to predict substrate specificity of newly detected NRPS Adenylation (A-) domains by genome sequencing efforts is of great importance to identify and annotate new gene clusters that produce secondary metabolites. Prediction of A-domain specificity based on the sequence alone can be achieved through sequence signatures or, more accurately, through machine learning methods. We present an improved predictor, based on previous work (NRPSpredictor), that predicts A-domain specificity using Support Vector Machines on four hierarchical levels, ranging from gross physicochemical properties of an A-domain's substrates down to single amino acid substrates. The three more general levels are predicted with an F-measure better than 0.89 and the most detailed level with an average F-measure of 0.80. We also modeled the applicability domain of our predictor to estimate for new A-domains whether they lie in the applicability domain. Finally, since there are also NRPS that play an important role in natural products chemistry of fungi, such as peptaibols and cephalosporins, we added a predictor for fungal A-domains, which predicts gross physicochemical properties with an F-measure of 0.84. The service is available at http://nrps.informatik.uni-tuebingen.de/. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Rottig M."
                    },
                    {
                        "name": "Medema M.H."
                    },
                    {
                        "name": "Blin K."
                    },
                    {
                        "name": "Weber T."
                    },
                    {
                        "name": "Rausch C."
                    },
                    {
                        "name": "Kohlbacher O."
                    }
                ],
                "citationCount": 357,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NRPSpredictor2 - A web server for predicting NRPS adenylation domain specificity"
            },
            "pmcid": "PMC3125756",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gki885",
            "metadata": {
                "abstract": "We present a new support vector machine (SVM)-based approach to predict the substrate specificity of subtypes of a given protein sequence family. We demonstrate the usefulness of this method on the example of aryl acid-activating and amino acid-activating adenylation domains (A domains) of nonribosomal peptide synthetases (NRPS). The residues of gramicidin synthetase A that are 8 Å around the substrate amino acid and corresponding positions of other adenylation domain sequences with 397 known and unknown specificities were extracted and used to encode this physico-chemical fingerprint into normalized real-valued feature vectors based on the physico-chemical properties of the amino acids. The SVM software package SVMlight was used for training and classification, with transductive SVMs to take advantage of the information inherent in unlabeled data. Specificities for very similar substrates that frequently show cross-specificities were pooled to the so-called composite specificities and predictive models were built for them. The reliability of the models was confirmed in cross-validations and in comparison with a currently used sequence-comparison-based method. When comparing the predictions for 1230 NRPS A domains that are currently detectable in UniProt, the new method was able to give a specificity prediction in an additional 18% of the cases compared with the old method. For 70% of the sequences both methods agreed, for <6% they did not, mainly on low-confidence predictions by the existing method. None of the predictive methods could infer any specificity for 2.4% of the sequences, suggesting completely new types of specificity. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Rausch C."
                    },
                    {
                        "name": "Weber T."
                    },
                    {
                        "name": "Kohlbacher O."
                    },
                    {
                        "name": "Wohlleben W."
                    },
                    {
                        "name": "Huson D.H."
                    }
                ],
                "citationCount": 316,
                "date": "2005-12-13T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Specificity prediction of adenylation domains in nonribosomal peptide synthetases (NRPS) using transductive support vector machines (TSVMs)"
            },
            "pmcid": "PMC1253831",
            "pmid": "16221976"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}