{
    "additionDate": "2021-01-18T10:59:31Z",
    "biotoolsCURIE": "biotools:cabnet",
    "biotoolsID": "cabnet",
    "confidence_flag": "tool",
    "description": "CABNet is a category Attention Block for Imbalanced Diabetic Retinopathy Grading",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/he2016012996/CABnet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-06T21:02:04Z",
    "license": "MIT",
    "name": "CABNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TMI.2020.3023463",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.Diabetic Retinopathy (DR) grading is challenging due to the presence of intra-class variations, small lesions and imbalanced data distributions. The key for solving fine-grained DR grading is to find more discriminative features corresponding to subtle visual differences, such as microaneurysms, hemorrhages and soft exudates. However, small lesions are quite difficult to identify using traditional convolutional neural networks (CNNs), and an imbalanced DR data distribution will cause the model to pay too much attention to DR grades with more samples, greatly affecting the final grading performance. In this article, we focus on developing an attention module to address these issues. Specifically, for imbalanced DR data distributions, we propose a novel Category Attention Block (CAB), which explores more discriminative region-wise features for each DR grade and treats each category equally. In order to capture more detailed small lesion information, we also propose the Global Attention Block (GAB), which can exploit detailed and class-agnostic global attention feature maps for fundus images. By aggregating the attention blocks with a backbone network, the CABNet is constructed for DR grading. The attention blocks can be applied to a wide range of backbone networks and trained efficiently in an end-to-end manner. Comprehensive experiments are conducted on three publicly available datasets, showing that CABNet produces significant performance improvements for existing state-of-the-art deep architectures with few additional parameters and achieves the state-of-the-art results for DR grading. Code and models will be available at https://github.com/he2016012996/CABnet.",
                "authors": [
                    {
                        "name": "Fu H."
                    },
                    {
                        "name": "He A."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Wang K."
                    }
                ],
                "citationCount": 5,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "CABNet: Category Attention Block for Imbalanced Diabetic Retinopathy Grading"
            },
            "pmid": "32915731"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
