{"credit":[],"function":[{"operation":[{"term":"Validation","uri":"http://edamontology.org/operation_2428"},{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"},{"term":"Anonymisation","uri":"http://edamontology.org/operation_3283"}]}],"labels":{"language":["MATLAB","C"],"license":"MIT","topic":[{"term":"Medical imaging","uri":"http://edamontology.org/topic_3384"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"MRI","uri":"http://edamontology.org/topic_3444"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Neurology","uri":"http://edamontology.org/topic_3334"}]},"publication":[{"abstract":"© 2019, Springer Science+Business Media, LLC, part of Springer Nature.There are growing concerns about the generalizability of machine learning classifiers in neuroimaging. In order to evaluate this aspect across relatively large heterogeneous populations, we investigated four disorders: Autism spectrum disorder (N = 988), Attention deficit hyperactivity disorder (N = 930), Post-traumatic stress disorder (N = 87) and Alzheimer’s disease (N = 132). We applied 18 different machine learning classifiers (based on diverse principles) wherein the training/validation and the hold-out test data belonged to samples with the same diagnosis but differing in either the age range or the acquisition site. Our results indicate that overfitting can be a huge problem in heterogeneous datasets, especially with fewer samples, leading to inflated measures of accuracy that fail to generalize well to the general clinical population. Further, different classifiers tended to perform well on different datasets. In order to address this, we propose a consensus-classifier by combining the predictive power of all 18 classifiers. The consensus-classifier was less sensitive to unmatched training/validation and holdout test data. Finally, we combined feature importance scores obtained from all classifiers to infer the discriminative ability of connectivity features. The functional connectivity patterns thus identified were robust to the classification algorithm used, age and acquisition site differences, and had diagnostic predictive ability in addition to univariate statistically significant group differences between the groups. A MATLAB toolbox called Machine Learning in NeuroImaging (MALINI), which implements all the 18 different classifiers along with the consensus classifier is available from Lanka et al. (2019) The toolbox can also be found at the following URL: https://github.com/pradlanka/malini.","authors":["Lanka P.","Rangaprakash D.","Dretsch M.N.","Katz J.S.","Denney T.S.","Deshpande G."],"cit_count":1,"doi":"10.1007/S11682-019-00191-8","journal":"Brain Imaging and Behavior","pmid":"31691160","title":"Supervised machine learning for diagnostic classification from large-scale neuroimaging datasets","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:MALINI","biotoolsID":"MALINI","description":"Supervised machine learning for diagnostic classification from large-scale neuroimaging datasets.\n\nMachine Learning in NeuroImaging (MALINI) is a MATLAB-based toolbox used for feature extraction and disease classification using resting state functional magnetic resonance imaging (rs-fMRI) data. 18 different popular classifiers are presented. With slight modifications, it can also be used for any classification problem using any set of features","homepage":"https://github.com/pradlanka/malini","name":"MALINI"}}