{
    "additionDate": "2018-05-06T14:45:53Z",
    "biotoolsCURIE": "biotools:iuta",
    "biotoolsID": "iuta",
    "credit": [
        {
            "email": "niul@niehs.nih.gov",
            "name": "Liang Niu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Effectively detecting differential isoform usage from RNA-Seq data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.niehs.nih.gov/research/resources/assets/docs/iuta_pdf_manual_508.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://www.niehs.nih.gov/research/resources/software/biostatistics/iuta/index.cfm",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "GPL-2.0",
    "name": "IUTA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-862",
            "metadata": {
                "abstract": "© 2014 Niu et al.; licensee BioMed Central Ltd.Background: Most genes in mammals generate several transcript isoforms that differ in stability and translational efficiency through alternative splicing. Such alternative splicing can be tissue- and developmental stage-specific, and such specificity is sometimes associated with disease. Thus, detecting differential isoform usage for a gene between tissues or cell lines/types (differences in the fraction of total expression of a gene represented by the expression of each of its isoforms) is potentially important for cell and developmental biology.Results: We present a new method IUTA that is designed to test each gene in the genome for differential isoform usage between two groups of samples. IUTA also estimates isoform usage for each gene in each sample as well as averaged across samples within each group. IUTA is the first method to formulate the testing problem as testing for equal means of two probability distributions under the Aitchison geometry, which is widely recognized as the most appropriate geometry for compositional data (vectors that contain the relative amount of each component comprising the whole). Evaluation using simulated data showed that IUTA was able to provide test results for many more genes than was Cuffdiff2 (version 2.2.0, released in Mar. 2014), and IUTA performed better than Cuffdiff2 for the limited number of genes that Cuffdiff2 did analyze. When applied to actual mouse RNA-Seq datasets from six tissues, IUTA identified 2,073 significant genes with clear patterns of differential isoform usage between a pair of tissues. IUTA is implemented as an R package and is available at http://www.niehs.nih.gov/research/resources/software/biostatistics/iuta/index.cfm.Conclusions: Both simulation and real-data results suggest that IUTA accurately detects differential isoform usage. We believe that our analysis of RNA-seq data from six mouse tissues represents the first comprehensive characterization of isoform usage in these tissues. IUTA will be a valuable resource for those who study the roles of alternative transcripts in cell development and disease.",
                "authors": [
                    {
                        "name": "Huang W."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Niu L."
                    },
                    {
                        "name": "Umbach D.M."
                    }
                ],
                "citationCount": 12,
                "date": "2014-10-06T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "IUTA: A tool for effectively detecting differential isoform usage from RNA-Seq data"
            },
            "pmcid": "PMC4195885",
            "pmid": "25283306"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
