{
    "additionDate": "2017-08-03T18:51:43Z",
    "biotoolsCURIE": "biotools:modmap",
    "biotoolsID": "modmap",
    "credit": [
        {
            "email": "davidama@post.tau.ac.il",
            "name": "David Amar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://tau.ac.il/~davidama/"
        }
    ],
    "description": "Tool for advanced analysis of biological networks. Given two biological networks, it seeks a set of modules, each representing strongly connected nodes in the first network, that are also strongly interconnected in the second network.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://acgt.cs.tau.ac.il/modmap/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://acgt.cs.tau.ac.il/modmap/",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/modmap-detecting-maps-of-modules-in-biological-networks.html"
        }
    ],
    "name": "ModMap",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Improved methods for integrated analysis of heterogeneous large-scale omic data are direly needed. Here, we take a network-based approach to this challenge. Given two networks, representing different types of gene interactions, we construct a map of linked modules, where modules are genes strongly connected in the first network and links represent strong inter-module connections in the second. We develop novel algorithms that considerably outperform prior art on simulated and real data from three distinct domains. First, by analyzing protein-protein interactions and negative genetic interactions in yeast, we discover epistatic relations among protein complexes. Second, we analyze protein-protein interactions and DNA damage-specific positive genetic interactions in yeast and reveal functional rewiring among protein complexes, suggesting novel mechanisms of DNA damage response. Finally, using transcriptomes of non-small-cell lung cancer patients, we analyze networks of global co-expression and disease-dependent differential co-expression and identify a sharp drop in correlation between two modules of immune activation processes, with possible microRNA control. Our study demonstrates that module maps are a powerful tool for deeper analysis of heterogeneous high-throughput omic data. © 2014 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Amar D."
                    },
                    {
                        "name": "Shamir R."
                    }
                ],
                "citationCount": 21,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Constructing module maps for integrated analysis of heterogeneous biological networks"
            },
            "pmid": "24497192"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}