{
    "additionDate": "2018-08-09T16:12:44Z",
    "biotoolsCURIE": "biotools:crosslinkwgcna",
    "biotoolsID": "crosslinkwgcna",
    "collectionID": [
        "Developed_RD-Connect"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/LUMC-BioSemantics/crosslinkWGCNA"
        }
    ],
    "description": "The crosslinkWGCNA web tool provides a user-friendly interface to the popular Weighted Gene Co-expression Network Analysis (WGCNA) R package. Users are able to upload their data sets and subsequently apply the standard workflow steps using a project-based structure and an easy to navigate interface. Along the way, the tool provides multiple familiar visualizations such as the hierarchically clustered genes with color-coded clusters, a similar tree for the samples and sample traits, module-trait correlations, and more. In addition, the tool allows for integrating multiple WGCNA projects using a correlation-based approach. Both data and visualizations can be exported",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LUMC-BioSemantics/crosslinkWGCNA",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "crosslinkWGCNA",
    "owner": "lmatalonga",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-559",
            "metadata": {
                "abstract": "Background: Correlation networks are increasingly being used in bioinformatics applications. For example, weighted gene co-expression network analysis is a systems biology method for describing the correlation patterns among genes across microarray samples. Weighted correlation network analysis (WGCNA) can be used for finding clusters (modules) of highly correlated genes, for summarizing such clusters using the module eigengene or an intramodular hub gene, for relating modules to one another and to external sample traits (using eigengene network methodology), and for calculating module membership measures. Correlation networks facilitate network based gene screening methods that can be used to identify candidate biomarkers or therapeutic targets. These methods have been successfully applied in various biological contexts, e.g. cancer, mouse genetics, yeast genetics, and analysis of brain imaging data. While parts of the correlation network methodology have been described in separate publications, there is a need to provide a user-friendly, comprehensive, and consistent software implementation and an accompanying tutorial. Results: The WGCNA R software package is a comprehensive collection of R functions for performing various aspects of weighted correlation network analysis. The package includes functions for network construction, module detection, gene selection, calculations of topological properties, data simulation, visualization, and interfacing with external software. Along with the R package we also present R software tutorials. While the methods development was motivated by gene expression data, the underlying data mining approach can be applied to a variety of different settings. Conclusion: The WGCNA package provides R functions for weighted correlation network analysis, e.g. co-expression network analysis of gene expression data. The R package along with its source code and additional material are freely available at http://www.genetics.ucla.edu/ labs/horvath/CoexpressionNetwork/Rpackages/WGCNA. © 2008 Langfelder and Horvath; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Langfelder P."
                    },
                    {
                        "name": "Horvath S."
                    }
                ],
                "citationCount": 5440,
                "date": "2008-12-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "WGCNA: An R package for weighted correlation network analysis"
            },
            "pmcid": "PMC2631488",
            "pmid": "19114008",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}