{
    "additionDate": "2017-08-03T18:46:37Z",
    "biotoolsCURIE": "biotools:hype",
    "biotoolsID": "hype",
    "credit": [
        {
            "name": "Dr. Vineet K. Sharma",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://metabiosys.iiserb.ac.in/"
        }
    ],
    "description": "Helps in the identification and classification of novel peptidoglycan hydrolases from complete genomic or metagenomic ORFs.",
    "documentation": [
        {
            "type": "General",
            "url": "http://metabiosys.iiserb.ac.in/hype/algorithm.php"
        },
        {
            "type": "User manual",
            "url": "http://metabiosys.iiserb.ac.in/hype/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://metabiosys.iiserb.ac.in/hype/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/hype-a-peptidoglycan-hydrolase-prediction-tool.html"
        }
    ],
    "name": "HyPe",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: The efficacy of antibiotics against bacterial infections is decreasing due to the development of resistance in bacteria, and thus, there is a need to search for potential alternatives to antibiotics. In this scenario, peptidoglycan hydrolases can be used as alternate antibacterial agents due to their unique property of cleaving peptidoglycan cell wall present in both gram-positive and gram-negative bacteria. Along with a role in maintaining overall peptidoglycan turnover in a cell and in daughter cell separation, peptidoglycan hydrolases also play crucial role in bacterial pathophysiology requiring development of a computational tool for the identification and classification of novel peptidoglycan hydrolases from genomic and metagenomic data. Results: In this study, the known peptidoglycan hydrolases were divided into multiple classes based on their site of action and were used for the development of a computational tool 'HyPe' for identification and classification of novel peptidoglycan hydrolases from genomic and metagenomic data. Various classification models were developed using amino acid and dipeptide composition features by training and optimization of Random Forest and Support Vector Machines. Random Forest multiclass model was selected for the development of HyPe tool as it showed up to 71.12% sensitivity, 99.98% specificity, 99.55% accuracy and 0.80 MCC in four different classes of peptidoglycan hydrolases. The tool was validated on 24 independent genomic datasets and showed up to 100% sensitivity and 0.94 MCC. The ability of HyPe to identify novel peptidoglycan hydrolases was also demonstrated on 24 metagenomic datasets. Conclusions: The present tool helps in the identification and classification of novel peptidoglycan hydrolases from complete genomic or metagenomic ORFs. To our knowledge, this is the only tool available for the prediction of peptidoglycan hydrolases from genomic and metagenomic data. Availability: http://metagenomics.iiserb.ac.in/hype/and http://metabiosys.iiserb.ac.in/hype/.",
                "authors": [
                    {
                        "name": "Sharma A.K."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Harish K."
                    },
                    {
                        "name": "Dhakan D.B."
                    },
                    {
                        "name": "Sharma V.K."
                    }
                ],
                "citationCount": 3,
                "date": "2016-05-27T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Prediction of peptidoglycan hydrolases- a new class of antibacterial proteins"
            },
            "pmid": "27229861"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ],
    "validated": 1
}