{
    "additionDate": "2021-10-04T06:58:49.932687Z",
    "biotoolsCURIE": "biotools:isoda",
    "biotoolsID": "isoda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "guomaozu@buecea.edu.cn",
            "name": "Maozu Guo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "gxyu@sdu.edu.cn",
            "name": "Guoxian Yu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "qiuyuehuang@email.swu.edu.cn",
            "name": "Qiuyue Huang",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Maintainer"
            ]
        }
    ],
    "description": "IsoDA is a tool for Isoform-Disease Association Prediction by Multiomics Data Fusion. A gene can be spliced into different isoforms by alternative splicing, which contributes to the functional diversity of protein species. Computational prediction of gene-disease associations (GDAs) has been studied for decades. However, the process of identifying the isoform-disease associations (IDAs) at a large scale is rarely explored, which can decipher the pathology at a more granular level. The main bottleneck is the lack of IDAs in current databases and the multilevel omics data fusion. To bridge this gap, we propose a computational approach called Isoform-Disease Association prediction by multiomics data fusion (IsoDA) to predict IDAs",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://www.sdu-idea.cn/upload/code/IsoDA_code.rar"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                }
            ]
        }
    ],
    "homepage": "http://www.sdu-idea.cn/codes_eng.php?name=IsoDA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-10-04T06:58:49.935169Z",
    "name": "IsoDA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1089/CMB.2020.0626",
            "metadata": {
                "abstract": "© 2021, Mary Ann Liebert, Inc., publishers.A gene can be spliced into different isoforms by alternative splicing, which contributes to the functional diversity of protein species. Computational prediction of gene-disease associations (GDAs) has been studied for decades. However, the process of identifying the isoform-disease associations (IDAs) at a large scale is rarely explored, which can decipher the pathology at a more granular level. The main bottleneck is the lack of IDAs in current databases and the multilevel omics data fusion. To bridge this gap, we propose a computational approach called Isoform-Disease Association prediction by multiomics data fusion (IsoDA) to predict IDAs. Based on the relationship between a gene and its spliced isoforms, IsoDA first introduces a dispatch and aggregation term to dispatch gene-disease associations to individual isoforms, and reversely aggregate these dispatched associations to their hosting genes. At the same time, it fuses the genome, transcriptome, and proteome data by joint matrix factorization to improve the prediction of IDAs. Experimental results show that IsoDA significantly outperforms the related state-of-the-art methods at both the gene level and isoform level. A case study further shows that IsoDA credibly identifies three isoforms spliced from apolipoprotein E, which have individual associations with Alzheimer's disease, and two isoforms spliced from vascular endothelial growth factor A, which have different associations with coronary heart disease. The codes of IsoDA are available at http://mlda.swu.edu.cn/codes.php?name=IsoDA",
                "authors": [
                    {
                        "name": "Guo M."
                    },
                    {
                        "name": "Huang Q."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yu G."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "IsoDA: Isoform-Disease Association Prediction by Multiomics Data Fusion"
            },
            "pmid": "33826865",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
