{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2017-03-04T22:39:25Z",
    "biotoolsCURIE": "biotools:dbnsfp",
    "biotoolsID": "dbnsfp",
    "collectionID": [
        "RD-connect",
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xmliu.uth@gmail.com",
            "name": "Xiaoming Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Database developed for functional prediction and annotation of all potential non-synonymous single-nucleotide variants (nsSNVs) and splice-site variants (ssSNVs) in the human genome. It also facilitates the steps of filtering and prioritizing SNVs from a large list of SNVs discovered in an exome-sequencing study.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sites.google.com/site/jpopgen/dbNSFP"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Functional clustering",
                    "uri": "http://edamontology.org/operation_3459"
                }
            ]
        }
    ],
    "homepage": "http://sites.google.com/site/jpopgen/dbNSFP",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-06-13T16:31:06Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "dbNSFP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1002/humu.22932",
            "pmcid": "PMC4752381",
            "pmid": "26555599",
            "type": [
                "Primary"
            ],
            "version": "3.0"
        },
        {
            "doi": "10.1002/humu.21517",
            "metadata": {
                "abstract": "With the advance of sequencing technologies, whole exome sequencing has increasingly been used to identify mutations that cause human diseases, especially rare Mendelian diseases. Among the analysis steps, functional prediction (of being deleterious) plays an important role in filtering or prioritizing nonsynonymous SNP (NS) for further analysis. Unfortunately, different prediction algorithms use different information and each has its own strength and weakness. It has been suggested that investigators should use predictions from multiple algorithms instead of relying on a single one. However, querying predictions from different databases/Web-servers for different algorithms is both tedious and time consuming, especially when dealing with a huge number of NSs identified by exome sequencing. To facilitate the process, we developed dbNSFP (database for nonsynonymous SNPs' functional predictions). It compiles prediction scores from four new and popular algorithms (SIFT, Polyphen2, LRT, and MutationTaster), along with a conservation score (PhyloP) and other related information, for every potential NS in the human genome (a total of 75,931,005). It is the first integrated database of functional predictions from multiple algorithms for the comprehensive collection of human NSs. dbNSFP is freely available for download at. © 2011 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Jian X."
                    },
                    {
                        "name": "Boerwinkle E."
                    }
                ],
                "citationCount": 348,
                "date": "2011-08-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "dbNSFP: A lightweight database of human nonsynonymous SNPs and their functional predictions"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1002/humu.22376",
            "metadata": {
                "abstract": "dbNSFP is a database developed for functional prediction and annotation of all potential non-synonymous single-nucleotide variants (nsSNVs) in the human genome. This database significantly facilitates the process of querying predictions and annotations from different databases/web-servers for large amounts of nsSNVs discovered in exome-sequencing studies. Here we report a recent major update of the database to version 2.0. We have rebuilt the SNV collection based on GENCODE 9 and currently the database includes 87,347,043 nsSNVs and 2,270,742 essential splice site SNVs (an 18% increase compared to dbNSFP v1.0). For each nsSNV dbNSFP v2.0 has added two prediction scores (MutationAssessor and FATHMM) and two conservation scores (GERP++ and SiPhy). The original five prediction and conservation scores in v1.0 (SIFT, Polyphen2, LRT, MutationTaster and PhyloP) have been updated. Rich functional annotations for SNVs and genes have also been added into the new version, including allele frequencies observed in the 1000 Genomes Project phase 1 data and the NHLBI Exome Sequencing Project, various gene IDs from different databases, functional descriptions of genes, gene expression and gene interaction information, among others. dbNSFP v2.0 is freely available for download at http://sites.google.com/site/jpopgen/dbNSFP. © 2013 WILEY PERIODICALS, INC.",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Jian X."
                    },
                    {
                        "name": "Boerwinkle E."
                    }
                ],
                "citationCount": 357,
                "date": "2013-09-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "dbNSFP v2.0: A database of human non-synonymous SNVs and their functional predictions and annotations"
            },
            "type": [
                "Primary"
            ],
            "version": "2.0"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "version": [
        "3.0"
    ]
}