{
    "additionDate": "2021-01-18T11:25:50Z",
    "biotoolsCURIE": "biotools:svpluscnv",
    "biotoolsID": "svpluscnv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gonzalo.lopezgarcia@mssm.edu",
            "name": "Gonzalo Lopez",
            "typeEntity": "Person"
        }
    ],
    "description": "svpluscnv: R toolkit for the analysis of structural variants and complex genomic rearrangements.\n\nsvpluscnv is an R package designed for integrative analyses of somatic DNA copy number variations (CNV) and other structural variants (SV).svpluscnv comprises multiple analytical and visualization tools that can be applied to large datasets from cancer patients such as TCGA and PCAWG or cancer cell lines CCLE.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ccbiolab/svpluscnv",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-24T13:13:15Z",
    "name": "Svpluscnv",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA878",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Despite widespread prevalence of somatic structural variations (SVs) across most tumor types, understanding of their molecular implications often remains poor. SVs are extremely heterogeneous in size and complexity, hindering the interpretation of their pathogenic role. Tools integrating large SV datasets across platforms are required to fully characterize the cancer's somatic landscape. Results: svpluscnv R package is a swiss army knife for the integration and interpretation of orthogonal datasets including copy number variant segmentation profiles and sequencing-based structural variant calls. The package implements analysis and visualization tools to evaluate chromosomal instability and ploidy, identify genes harboring recurrent SVs and detects complex rearrangements such as chromothripsis and chromoplexia. Further, it allows systematic identification of hot-spot shattered genomic regions, showing reproducibility across alternative detection methods and datasets.",
                "authors": [
                    {
                        "name": "Diskin S.J."
                    },
                    {
                        "name": "Egolf L.E."
                    },
                    {
                        "name": "Giorgi F.M."
                    },
                    {
                        "name": "Lopez G."
                    },
                    {
                        "name": "Margolin A.A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Svpluscnv: Analysis and visualization of complex structural variation data"
            },
            "pmid": "33051644"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
