{
    "additionDate": "2018-05-21T15:30:31Z",
    "biotoolsCURIE": "biotools:metasel",
    "biotoolsID": "metasel",
    "credit": [
        {
            "email": "sissades@biotec.or.th",
            "name": "Sissades Tongsima",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Metaphase selection tool using a Gaussian-based classification technique.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www4a.biotec.or.th/GI/tools/MetaSelectManual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://www4a.biotec.or.th/GI/tools/metasel",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "MetaSel",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-S16-S13",
            "metadata": {
                "abstract": "Background: Identification of good metaphase spreads is an important step in chromosome analysis for identifying individuals with genetic disorders. The process of finding suitable metaphase chromosomes for accurate clinical analysis is, however, very time consuming since they are selected manually. The selection of suitable metaphase chromosome spreads thus represents a major bottleneck for conventional cytogenetic analysis. Although many algorithms have been developed for karyotyping, none have adequately addressed the critical bottleneck of selecting suitable chromosome spreads. In this paper, we present a software tool that uses a simple rule-based system to efficiently identify metaphase spreads suitable for karyotyping.Results: The chromosome shapes can be classified by the software into four main classes. The first and the second classes refer to individual chromosomes with straight and skewed shapes, respectively. The third class is characterized as those chromosomes with overlapping bodies and the fourth class is for the non-chromosome objects. Good metaphase spreads should largely contain chromosomes of the first and the second classes, while the third class should be kept minimal. Several image parameters were examined and used for creating rule-based classification. The threshold value for each parameter is determined using a statistical model. We observed that the Gaussian model can represent the empirical probability density function of the parameters and, hence, the threshold value can be easily determined. The proposed rules can efficiently and accurately classify the individual chromosome with > 90% accuracy.Conclusions: The software tool, termed MetaSel, was developed. Using the Gaussian-based rules, the tool can be used to quickly rank hundreds of chromosome spread images so as to assist cytogeneticists to perform karyotyping effectively. Furthermore, MetaSel offers an intuitive, yet comprehensive, workflow to assist karyotyping, including tools for editing chromosome (split, merge and fix) and a karyotyping editor (moving, rotating, and pairing homologous chromosomes). The program can be freely downloaded from \"http://www4a.biotec.or.th/GI/tools/metasel\". © 2013 Uttamatanin et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Uttamatanin R."
                    },
                    {
                        "name": "Yuvapoositanon P."
                    },
                    {
                        "name": "Intarapanich A."
                    },
                    {
                        "name": "Kaewkamnerd S."
                    },
                    {
                        "name": "Phuksaritanon R."
                    },
                    {
                        "name": "Assawamakin A."
                    },
                    {
                        "name": "Tongsima S."
                    }
                ],
                "citationCount": 16,
                "date": "2013-10-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MetaSel: A metaphase selection tool using a Gaussian-based classification technique"
            },
            "pmcid": "PMC4015449",
            "pmid": "24564477"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Cell culture collection",
            "uri": "http://edamontology.org/topic_3340"
        }
    ],
    "validated": 1
}