{
    "additionDate": "2022-12-19T10:18:05.747839Z",
    "biotoolsCURIE": "biotools:agingbank",
    "biotoolsID": "agingbank",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lixia@hrbmu.edu.cn",
            "name": "Yunpeng Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "ningsw@ems.hrbmu.edu.cn",
            "name": "Shangwei Ning",
            "typeEntity": "Person"
        },
        {
            "email": "zhangyp@hrbmu.edu.cn",
            "name": "Xia Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A manually curated knowledgebase and high-throughput analysis platform that provides experimentally supported multi-omics data relevant to aging in multiple species.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://bio-bigdata.hrbmu.edu.cn/AgingBank",
    "lastUpdate": "2022-12-19T10:18:05.750517Z",
    "license": "Other",
    "name": "AgingBank",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC438",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Discovering the biological basis of aging is one of the greatest remaining challenges for biomedical field. Work on the biology of aging has discovered a range of interventions and pathways that control aging rate. Thus, we developed AgingBank (http://bio-bigdata.hrbmu.edu.cn/AgingBank) which was a manually curated comprehensive database and high-throughput analysis platform that provided experimentally supported multi-omics data relevant to aging in multiple species. AgingBank contained 3771 experimentally verified aging-related multi-omics entries from studies across more than 50 model organisms, including human, mice, worms, flies and yeast. The records included genome (single nucleotide polymorphism, copy number variation and somatic mutation), transcriptome [mRNA, long non-coding RNA (lncRNA), microRNA (miRNA) and circular RNA (circRNA)], epigenome (DNA methylation and histone modification), other modification and regulation elements (transcription factor, enhancer, promoter, gene silence, alternative splicing and RNA editing). In addition, AgingBank was also an online computational analysis platform containing five useful tools (Aging Landscape, Differential Expression Analyzer, Data Heat Mapper, Co-Expression Network and Functional Annotation Analyzer), nearly 112 high-throughput experiments of genes, miRNAs, lncRNAs, circRNAs and methylation sites related with aging. Cancer & Aging module was developed to explore the relationships between aging and cancer. Submit & Analysis module allows users upload and analyze their experiments data. AginBank is a valuable resource for elucidating aging-related biomarkers and relationships with other diseases.",
                "authors": [
                    {
                        "name": "Gan J."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Guo S."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Ning S."
                    },
                    {
                        "name": "Shang S."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhou H."
                    }
                ],
                "date": "2022-11-19T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "AgingBank: a manually curated knowledgebase and high-throughput analysis platform that provides experimentally supported multi-omics data relevant to aging in multiple species"
            },
            "pmid": "36239391"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
