{
    "additionDate": "2017-08-03T18:48:10Z",
    "biotoolsCURIE": "biotools:lors",
    "biotoolsID": "lors",
    "credit": [
        {
            "email": "hongyu.zhao@yale.edu",
            "name": "Hongyu Zhao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://zhaocenter.org/"
        }
    ],
    "description": "LOw-Rank representation and Sparse regression for eQTL mapping. This algorithm accounts for confounding factors such as unobserved covariates, experimental artifacts, and unknown environmental perturbations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://zhaocenter.org/software/#Genomic_Expression_Pathway_Analysis"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://zhaocenter.org/software/#Genomic_Expression_Pathway_Analysis",
    "homepage_status": 1,
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/lors-low-rank-representation-sparse-regression-eqtl-mapping.html"
        }
    ],
    "name": "LORS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Expression quantitative trait loci (eQTL) studies investigate how gene expression levels are affected by DNA variants. A major challenge in inferring eQTL is that a number of factors, such as unobserved covariates, experimental artifacts and unknown environmental perturbations, may confound the observed expression levels. This may both mask real associations and lead to spurious association findings.Results: In this article, we introduce a LOw-Rank representation to account for confounding factors and make use of Sparse regression for eQTL mapping (LORS). We integrate the low-rank representation and sparse regression into a unified framework, in which single-nucleotide polymorphisms and gene probes can be jointly analyzed. Given the two model parameters, our formulation is a convex optimization problem. We have developed an efficient algorithm to solve this problem and its convergence is guaranteed. We demonstrate its ability to account for non-genetic effects using simulation, and then apply it to two independent real datasets. Our results indicate that LORS is an effective tool to account for non-genetic effects. First, our detected associations show higher consistency between studies than recently proposed methods. Second, we have identified some new hotspots that can not be identified without accounting for non-genetic effects. © 2013 The Author.",
                "authors": [
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhao H."
                    }
                ],
                "citationCount": 25,
                "date": "2013-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Accounting for non-genetic factors by low-rank representation and sparse regression for eQTL mapping"
            },
            "pmid": "23419377"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}
