{
    "additionDate": "2019-11-14T18:06:42Z",
    "biotoolsCURIE": "biotools:HaGiS",
    "biotoolsID": "HaGiS",
    "confidence_flag": "tool",
    "description": "R Package Resource for Pathotype Analysis of Phytophthora sojae Populations Causing Stem and Root Rot of Soybean | Analysis of Plant Pathogen Pathotype Complexities, Distributions and Diversity | Analysis of plant pathogen pathotype survey data. Functions provided calculate distribution of susceptibilities, distribution of complexities with statistics, pathotype frequency distribution, as well as diversity indices for pathotypes. This package is meant to be a direct replacement for Herrmann, Löwer, Schachtel's (1999) <doi:10.1046/j.1365-3059.1999.00325.x> Habgood-Gilmour Spreadsheet, 'HaGiS', previously used for pathotype analysis | The goal of hagis is to provide analysis tools for plant pathogens with gene-for-gene interactions in the R programming language that the original Habgood-Gilmour Spreadsheet, HaGiS, (Herrmann, Löwer and Schachtel) provided",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://openplantpathology.github.io/hagis",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-07T08:58:33.391995Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=hagis"
        }
    ],
    "name": "HaGiS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1094/MPMI-07-19-0180-A",
            "metadata": {
                "abstract": "© 2019 American Phytopathological Society. All rights reserved.Phytophthora sojae is a significant pathogen of soybean worldwide. Pathotype surveys for Phytophthora sojae are conducted to monitor resistance gene efficacy and determine if new resistance genes are needed. Valuable measurements for pathotype analysis include the distribution of susceptible reactions, pathotype complexity, pathotype frequency, and diversity indices for pathotype distributions. Previously the Habgood-Gilmour Spreadsheet (HaGiS), written in Microsoft Excel, was used for data analysis. However, the growing popularity of the R programming language in plant pathology and desire for reproducible research made HaGiS a prime candidate for conversion into an R package. Here we report on the development and use of an R package, hagis, that can be used to produce all outputs from the HaGiS Excel sheet for P. sojae or other gene-for-gene pathosystem studies.",
                "authors": [
                    {
                        "name": "McCoy A.G."
                    },
                    {
                        "name": "Noel Z."
                    },
                    {
                        "name": "Sparks A.H."
                    },
                    {
                        "name": "Chilvers M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Plant-Microbe Interactions",
                "title": "Hagis, an R Package resource for pathotype analysis of phytophthora sojae populations causing stern and root rot of soybean"
            },
            "pmid": "31415224"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}