
{
    "credit": [
        {
            "email": "zacher@lmb.uni-muenchen.de",
            "name": "Benedikt Zacher",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "frohlich@bit.uni-bonn.de",
            "name": "Holger Froehlich",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/birta.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/birta_1.18.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: There have been many successful experimental and bioinformatics efforts to elucidate transcription factor (TF)-target networks in several organisms. For many organisms, these annotations are complemented by miRNA-target networks of good quality. Attempts that use these networks in combination with gene expression data to draw conclusions on TF or miRNA activity are, however, still relatively sparse. Results: In this study, we propose Bayesian inference of regulation of transcriptional activity (BIRTA) as a novel approach to infer both, TF and miRNA activities, from combined miRNA and mRNA expression data in a condition specific way. That means our model explains mRNA and miRNA expression for a specific experimental condition by the activities of certain miRNAs and TFs, hence allowing for differentiating between switches from active to inactive (negative switch) and inactive to active (positive switch) forms. Extensive simulations of our model reveal its good prediction performance in comparison to other approaches. Furthermore, the utility of BIRTA is demonstrated at the example of Escherichia coli data comparing aerobic and anaerobic growth conditions, and by human expression data from pancreas and ovarian cancer. © The Author 2012. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Zacher B.",
                "Abnaof K.",
                "Gade S.",
                "Younesi E.",
                "Tresch A.",
                "Frohlich H."
            ],
            "cit_count": 17,
            "doi": "10.1093/bioinformatics/bts257",
            "journal": "Bioinformatics",
            "title": "Joint bayesian inference of condition-specific miRNA and transcription factor activities from combined gene and microRNA expression data",
            "type": "Primary",
            "year": "2012-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:birta",
        "biotoolsID": "birta",
        "description": "Expression levels of mRNA molecules are regulated by different processes, comprising inhibition or activation by transcription factors and post-transcriptional degradation by microRNAs. The tool uses the regulatory networks of TFs and miRNAs together with mRNA and miRNA expression data to predict switches in regulatory activity between two conditions. A Bayesian network is used to model the regulatory structure and Markov-Chain-Monte-Carlo is applied to sample the activity states.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/birta.html",
        "name": "birta",
        "version": [
            "1.18.0"
        ]
    }
}