{
    "additionDate": "2017-08-03T19:07:56Z",
    "biotoolsCURIE": "biotools:poolne_estim",
    "biotoolsID": "poolne_estim",
    "credit": [
        {
            "email": "mathieu.gautier@supagro.inra.fr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Program implementing a Markov Chain Monte Carlo algorithm to sample the posterior distribution of the different parameters underlying the Bayesian hierarchical model. It is primarily aimed at estimating in Pool-Seq experiment the effective diploid size of pools/replicates (e.g. identified by molecular barcodes) from SNP allele count data. Note that each pool (or replicate) are assumed to originate from the same population.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www1.montpellier.inra.fr/CBGP/software/PoolSeqUtils/GAUTIER_etal_MEC_2013_FILES/poolne_estim_docs.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence profile generation",
                    "uri": "http://edamontology.org/operation_0296"
                }
            ]
        }
    ],
    "homepage": "http://www1.montpellier.inra.fr/CBGP/software/PoolSeqUtils/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/poolne_estim-1-0-estimating-pool-seq-experiment-effective-diploid-size-poolsreplicates-snp-allele-count-data.html"
        }
    ],
    "name": "poolne_estim",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Molecular markers produced by next-generation sequencing (NGS) technologies are revolutionizing genetic research. However, the costs of analysing large numbers of individual genomes remain prohibitive for most population genetics studies. Here, we present results based on mathematical derivations showing that, under many realistic experimental designs, NGS of DNA pools from diploid individuals allows to estimate the allele frequencies at single nucleotide polymorphisms (SNPs) with at least the same accuracy as individual-based analyses, for considerably lower library construction and sequencing efforts. These findings remain true when taking into account the possibility of substantially unequal contributions of each individual to the final pool of sequence reads. We propose the intuitive notion of effective pool size to account for unequal pooling and derive a Bayesian hierarchical model to estimate this parameter directly from the data. We provide a user-friendly application assessing the accuracy of allele frequency estimation from both pool- and individual-based NGS population data under various sampling, sequencing depth and experimental error designs. We illustrate our findings with theoretical examples and real data sets corresponding to SNP loci obtained using restriction site-associated DNA (RAD) sequencing in pool- and individual-based experiments carried out on the same population of the pine processionary moth (Thaumetopoea pityocampa). NGS of DNA pools might not be optimal for all types of studies but provides a cost-effective approach for estimating allele frequencies for very large numbers of SNPs. It thus allows comparison of genome-wide patterns of genetic variation for large numbers of individuals in multiple populations. © 2013 John Wiley & Sons Ltd.",
                "authors": [
                    {
                        "name": "Gautier M."
                    },
                    {
                        "name": "Foucaud J."
                    },
                    {
                        "name": "Gharbi K."
                    },
                    {
                        "name": "Cezard T."
                    },
                    {
                        "name": "Galan M."
                    },
                    {
                        "name": "Loiseau A."
                    },
                    {
                        "name": "Thomson M."
                    },
                    {
                        "name": "Pudlo P."
                    },
                    {
                        "name": "Kerdelhue C."
                    },
                    {
                        "name": "Estoup A."
                    }
                ],
                "citationCount": 108,
                "date": "2013-07-01T00:00:00Z",
                "journal": "Molecular Ecology",
                "title": "Estimation of population allele frequencies from next-generation sequencing data: Pool-versus individual-based genotyping"
            },
            "pmid": "23730833"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}