{
    "additionDate": "2021-01-18T12:28:50Z",
    "biotoolsCURIE": "biotools:sire",
    "biotoolsID": "sire",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chris.pooley@bioss.ac.uk",
            "name": "Christopher M. Pooley ,",
            "typeEntity": "Person"
        }
    ],
    "description": "Estimating individuals' genetic and non-genetic effects underlying infectious disease transmission from temporal epidemic data.\n\nSusceptibility Infectivity and Recoverability Estimation (SIRE).\nIllustrative screenshots - SIRE features an easy to use point and click interface that facilitates data input and displays a variety of output visualisations that aid interpretation of the results.\n\nSIRE allows for simultaneous estimation of single nucleotide polymorphism (SNP) and treatment effects on these host traits (so identifying potential pleiotropic effects). SIRE implements a Bayesian algorithm which makes use of temporal data (consisting of any combination of recorded infection times, recovery times or disease status measurements) from multiple epidemics whose dynamics can be represented by the susceptible-infectious-recovered (SIR) model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "http://theITEAM.github.io/SIRE.html",
    "language": [
        "JavaScript",
        "C++",
        "C"
    ],
    "lastUpdate": "2021-02-19T15:14:12Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/theITEAM/SIRE"
        }
    ],
    "name": "SIRE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008447",
            "metadata": {
                "abstract": "© 2020 Pooley et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Individuals differ widely in their contribution to the spread of infection within and across populations. Three key epidemiological host traits affect infectious disease spread: susceptibility (propensity to acquire infection), infectivity (propensity to transmit infection to others) and recoverability (propensity to recover quickly). Interventions aiming to reduce disease spread may target improvement in any one of these traits, but the necessary statistical methods for obtaining risk estimates are lacking. In this paper we introduce a novel software tool called SIRE (standing for “Susceptibility, Infectivity and Recoverability Estimation”), which allows for the first time simultaneous estimation of the genetic effect of a single nucleotide polymorphism (SNP), as well as non-genetic influences on these three unobservable host traits. SIRE implements a flexible Bayesian algorithm which accommodates a wide range of disease surveillance data comprising any combination of recorded individual infection and/or recovery times, or disease diagnostic test results. Different genetic and non-genetic regulations and data scenarios (representing realistic recording schemes) were simulated to validate SIRE and to assess their impact on the precision, accuracy and bias of parameter estimates. This analysis revealed that with few exceptions, SIRE provides unbiased, accurate parameter estimates associated with all three host traits. For most scenarios, SNP effects associated with recoverability can be estimated with highest precision, followed by susceptibility. For infectivity, many epidemics with few individuals give substantially more statistical power to identify SNP effects than the reverse. Importantly, precise estimates of SNP and other effects could be obtained even in the case of incomplete, censored and relatively infrequent measurements of individuals’ infection or survival status, albeit requiring more individuals to yield equivalent precision. SIRE represents a new tool for analysing a wide range of experimental and field disease data with the aim of discovering and validating SNPs and other factors controlling infectious disease transmission.",
                "authors": [
                    {
                        "name": "Pooley C.M."
                    },
                    {
                        "name": "Marion G."
                    },
                    {
                        "name": "Bishop S.C."
                    },
                    {
                        "name": "Bailey R.I."
                    },
                    {
                        "name": "Doeschl-Wilson A.B."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-21T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Estimating individuals’ genetic and non-genetic effects underlying infectious disease transmission from temporal epidemic data"
            },
            "pmid": "33347459"
        }
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}