{
    "accessibility": "Open access",
    "additionDate": "2021-10-14T10:49:14.046797Z",
    "biotoolsCURIE": "biotools:svnn",
    "biotoolsID": "svnn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "goudarzi@sharif.edu",
            "name": "Maziar Goudarzi",
            "typeEntity": "Person"
        },
        {
            "name": "Mostafa Hadadian Nejad Yousefi"
        },
        {
            "name": "Shaya Akbarinejad"
        }
    ],
    "description": "SVNN is a fast, and accurate structural variation calling pipeline for long-reads that takes raw reads as the input and detects structural variants of size larger than 50 bp. SVNN utilizes NGMLR, and Minimap2 as long read aligners, and Sniffles, and SVIM as SV callers.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://easy.ce.sharif.edu/svnn/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://drive.google.com/file/d/1_jJEiJs_J8jg7sRbmKzEYjPfNer542k1/view"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://easy.ce.sharif.edu/svnn/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-10-14T10:50:44.269905Z",
    "license": "Not licensed",
    "name": "SVNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04184-7",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Once aligned, long-reads can be a useful source of information to identify the type and position of structural variations. However, due to the high sequencing error of long reads, long-read structural variation detection methods are far from precise in low-coverage cases. To be accurate, they need to use high-coverage data, which in turn, results in an extremely time-consuming pipeline, especially in the alignment phase. Therefore, it is of utmost importance to have a structural variation calling pipeline which is both fast and precise for low-coverage data. Results: In this paper, we present SVNN, a fast yet accurate, structural variation calling pipeline for PacBio long-reads that takes raw reads as the input and detects structural variants of size larger than 50 bp. Our pipeline utilizes state-of-the-art long-read aligners, namely NGMLR and Minimap2, and structural variation callers, videlicet Sniffle and SVIM. We found that by using a neural network, we can extract features from Minimap2 output to detect a subset of reads that provide useful information for structural variation detection. By only mapping this subset with NGMLR, which is far slower than Minimap2 but better serves downstream structural variation detection, we can increase the sensitivity in an efficient way. As a result of using multiple tools intelligently, SVNN achieves up to 20 percentage points of sensitivity improvement in comparison with state-of-the-art methods and is three times faster than a naive combination of state-of-the-art tools to achieve almost the same accuracy. Conclusion: Since prohibitive costs of using high-coverage data have impeded long-read applications, with SVNN, we provide the users with a much faster structural variation detection platform for PacBio reads with high precision and sensitivity in low-coverage scenarios.",
                "authors": [
                    {
                        "name": "Akbarinejad S."
                    },
                    {
                        "name": "Goudarzi M."
                    },
                    {
                        "name": "Hadadian Nejad Yousefi M."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SVNN: an efficient PacBio-specific pipeline for structural variations calling using neural networks"
            },
            "pmcid": "PMC8214287",
            "pmid": "34147063"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
