{
    "accessibility": "Open access",
    "additionDate": "2022-04-24T11:04:09.632344Z",
    "biotoolsCURIE": "biotools:consurf_server",
    "biotoolsID": "consurf_server",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bental@tauex.tau.ac.il",
            "name": "Nir Ben-Tal"
        },
        {
            "name": "Maya Rubin"
        }
    ],
    "description": "Server for the Identification of Functional Regions in Proteins.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://consurf.tau.ac.il/",
    "lastUpdate": "2022-04-24T11:04:09.638204Z",
    "name": "ConSurf",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/CPZ1.270",
            "metadata": {
                "abstract": "© 2021 Wiley Periodicals LLCThe ConSurf web server (https://consurf.tau.ac.il/) for using evolutionary data to detect functional regions is useful for analyzing proteins. The analysis is based on the premise that functional regions, which may for example facilitate ligand binding and catalysis, often evolve slowly. The analysis requires finding enough effective, i.e., non-redundant, sufficiently remote homologs. Indeed, the ConSurf pipeline, which is based on state-of-the-art protein sequence databases and analysis tools, is highly valuable for protein analysis. ConSurf also allows evolutionary analysis of RNA, but the analysis often fails due to insufficient data, particularly the inability of the current pipeline to detect enough effective RNA homologs. This is because the RNA search tools and databases offered are not as good as those used for protein analysis. Fortunately, ConSurf also allows importing external collections of homologs in the form of a multiple sequence alignment (MSA). Leveraging this, here we describe various protocols for constructing MSAs for successful ConSurf analysis of RNA queries. We report the level of success of these protocols on an exemplary set comprising a dozen RNA molecules of diverse structure and function. © 2021 Wiley Periodicals LLC. Basic Protocol 1: Standard ConSurf evolutionary conservation analysis of an RNA query. Basic Protocol 2: ConSurf evolutionary conservation analysis of an RNA query with external MSA. Support Protocol 1: Construction of an MSA for an RNA query using other online servers. Support Protocol 2: Construction of an MSA for an RNA query using nHMMER locally.",
                "authors": [
                    {
                        "name": "Ben-Tal N."
                    },
                    {
                        "name": "Rubin M."
                    }
                ],
                "date": "2021-10-01T00:00:00Z",
                "journal": "Current Protocols",
                "title": "Using ConSurf to Detect Functionally Important Regions in RNA"
            },
            "pmid": "34619810"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
