{
    "additionDate": "2021-01-18T07:10:36Z",
    "biotoolsCURIE": "biotools:netfrac",
    "biotoolsID": "netfrac",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "makarenkov.vladimir@uqam.ca",
            "name": "Vladimir Makarenkov",
            "typeEntity": "Person"
        }
    ],
    "description": "Transfer index, NetUniFrac and some useful shortest path-based distances for community analysis in sequence similarity networks.\n\nThe R package NetFrac is used to calculate various distances and indices between species communities in sequence similarity sequence (SSN). Some of these measures are based on the shortest path concept, namely Spp, Spep, Spelp and Spinp distances and the Transfer index, and a few others are adapted from existing concepts in the literature (UniFrac, Motifs). The networks are Igraph objects consisting of nodes and edges.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree distances calculation",
                    "uri": "http://edamontology.org/operation_0557"
                },
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                },
                {
                    "term": "Sequence distance matrix generation",
                    "uri": "http://edamontology.org/operation_0289"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XPHenry/Netfrac",
    "language": [
        "C",
        "C++",
        "R"
    ],
    "lastUpdate": "2021-03-08T13:37:56Z",
    "name": "NetFrac",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA043",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Phylogenetic trees and the methods for their analysis have played a key role in many evolutionary, ecological and bioinformatics studies. Alternatively, phylogenetic networks have been widely used to analyze and represent complex reticulate evolutionary processes which cannot be adequately studied using traditional phylogenetic methods. These processes include, among others, hybridization, horizontal gene transfer, and genetic recombination. Nowadays, sequence similarity and genome similarity networks have become an efficient tool for community analysis of large molecular datasets in comparative studies. These networks can be used for tackling a variety of complex evolutionary problems such as the identification of horizontal gene transfer events, the recovery of mosaic genes and genomes, and the study of holobionts. Results: The shortest path in a phylogenetic tree is used to estimate evolutionary distances between species. We show how the shortest path concept can be extended to sequence similarity networks by defining five new distances, NetUniFrac, Spp, Spep, Spelp and Spinp, and the Transfer index, between species communities present in the network. These new distances can be seen as network analogs of the traditional UniFrac distance used to assess dissimilarity between species communities in a phylogenetic tree, whereas the Transfer index is intended for estimating the rate and direction of gene transfers, or species dispersal, between different phylogenetic, or ecological, species communities. Moreover, NetUniFrac and the Transfer index can be computed in linear time with respect to the number of edges in the network. We show how these new measures can be used to analyze microbiota and antibiotic resistance gene similarity networks.",
                "authors": [
                    {
                        "name": "Kembel S.W."
                    },
                    {
                        "name": "Makarenkov V."
                    },
                    {
                        "name": "Xing H."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Transfer index, NetUniFrac and some useful shortest path-based distances for community analysis in sequence similarity networks"
            },
            "pmid": "31971565"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}
