{
    "additionDate": "2021-01-18T12:32:58Z",
    "biotoolsCURIE": "biotools:scmlnet",
    "biotoolsID": "scmlnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sunxq6@mail.sysu.edu.cn",
            "typeEntity": "Person"
        },
        {
            "email": "xiaoqiangsun88@gmail.com",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring microenvironmental regulation of gene expression from single-cell RNA sequencing data using scMLnet with an application to COVID-19.\n\nscMLnet is an R package developed to construct inter-/intracellular multilayer singaling network based on single-cell RNA-seq expression data. scMLnet constructs the multilayer network by integrating intercellular pathways (ligand-receptor interactions) and intracellular subnetworks (receptor-TF pathways and TF-target gene interactions) based on cell-type specific gene expression, prior network information and statistical inference. scMLnet can also visualize the constructed inter-/intracellular signaling pathways between the central cell and neighboring cells. scMLnet is implemented using R (version 3.6.0) and Python (version 3.7).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SunXQlab/scMLnet",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2021-02-13T14:35:21Z",
    "name": "scMLnet",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA327",
            "metadata": {
                "abstract": "© 2020 The Author(s).Inferring how gene expression in a cell is influenced by cellular microenvironment is of great importance yet challenging. In this study, we present a single-cell RNA-sequencing data based multilayer network method (scMLnet) that models not only functional intercellular communications but also intracellular gene regulatory networks (http://github.com/SunXQlab/scMLnet). scMLnet was applied to a scRNA-seq dataset of COVID-19 patients to decipher the microenvironmental regulation of expression of SARS-CoV-2 receptor ACE2 that has been reported to be correlated with inflammatory cytokines and COVID-19 severity. The predicted elevation of ACE2 by extracellular cytokines EGF, IFN-γor TNF-α were experimentally validated in human lung cells and the related signaling pathway were verified to be significantly activated during SARS-COV-2 infection. Our study provided a new approach to uncover inter-/intra-cellular signaling mechanisms of gene expression and revealed microenvironmental regulators of ACE2 expression, which may facilitate designing anti-cytokine therapies or targeted therapies for controlling COVID-19 infection. In addition, we summarized and compared different methods of scRNA-seq based inter-/intra-cellular signaling network inference for facilitating new methodology development and applications.",
                "authors": [
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Wu Z."
                    },
                    {
                        "name": "Sun X."
                    }
                ],
                "citationCount": 3,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Inferring microenvironmental regulation of gene expression from single-cell RNA sequencing data using scMLnet with an application to COVID-19"
            },
            "pmid": "33341869"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}