{
    "accessibility": "Open access",
    "additionDate": "2019-05-18T09:09:45Z",
    "biotoolsCURIE": "biotools:BMTME",
    "biotoolsID": "BMTME",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "frahik@gmail.com",
            "name": "Francisco Javier Luna-Vazquez",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R Package for Bayesian Analysis of Multi-environment and Multi-trait Multi-environment Data for Genome-Based Prediction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/frahik/BMTME"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=BMTME",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "LGPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/frahik/BMTME/issues/new"
        }
    ],
    "maturity": "Mature",
    "name": "BMTME",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1534/g3.119.400126",
            "metadata": {
                "abstract": "Copyright © 2019 Montesinos-López et al.Evidence that genomic selection (GS) is a technology that is revolutionizing plant breeding continues to grow. However, it is very well documented that its success strongly depends on statistical models, which are used by GS to perform predictions of candidate genotypes that were not phenotyped. Because there is no universally better model for prediction and models for each type of response variable are needed (continuous, binary, ordinal, count, etc.), an active area of research aims to develop statistical models for the prediction of univariate and multivariate traits in GS. However, most of the models developed so far are for univariate and continuous (Gaussian) traits. Therefore, to overcome the lack of multivariate statistical models for genome-based prediction by improving the original version of the BMTME, we propose an improved Bayesian multi-trait and multi-environment (BMTME) R package for analyzing breeding data with multiple traits and multiple environments. We also introduce Bayesian multi-output regressor stacking (BMORS) functions that are considerably efficient in terms of computational resources. The package allows parameter estimation and evaluates the prediction performance of multi-trait and multi-environment data in a reliable, efficient and user-friendly way. We illustrate the use of the BMTME with real toy datasets to show all the facilities that the software offers the user. However, for large datasets, the BME() and BMTME() functions of the BMTME R package are very intense in terms of computing time; on the other hand, less intensive computing is required with BMORS functions BMORS() and BMORS_Env() that are also included in the BMTME package.",
                "authors": [
                    {
                        "name": "Crossa J."
                    },
                    {
                        "name": "Lillemo M."
                    },
                    {
                        "name": "Luna-Vazquez F.J."
                    },
                    {
                        "name": "Montesinos-Lopez A."
                    },
                    {
                        "name": "Montesinos-Lopez O.A."
                    },
                    {
                        "name": "Perez-Rodriguez P."
                    },
                    {
                        "name": "Toledo F.H."
                    }
                ],
                "citationCount": 12,
                "date": "2019-05-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "An R package for Bayesian analysis of multi-environment and multi-trait multi-environment data for genome-based prediction"
            },
            "pmid": "30819822",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}
