{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T11:49:13Z",
    "biotoolsCURIE": "biotools:metapopr",
    "biotoolsID": "metapopr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sullivan.948@osu.edu",
            "name": "Matthew B. Sullivan",
            "typeEntity": "Person"
        },
        {
            "name": "Ann C. Gregory"
        }
    ],
    "description": "A pipeline for the macro- and micro-diversity analyses and visualization of metagenomic-derived populations",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage bias calculation",
                    "uri": "http://edamontology.org/operation_2962"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://de.cyverse.org/apps/agave/MetaPop-1.0.0",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-06-28T18:06:25.181505Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/metaGmetapop/metapop"
        }
    ],
    "name": "MetaPopR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S40168-022-01231-0",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Microbes and their viruses are hidden engines driving Earth’s ecosystems from the oceans and soils to humans and bioreactors. Though gene marker approaches can now be complemented by genome-resolved studies of inter-(macrodiversity) and intra-(microdiversity) population variation, analytical tools to do so remain scattered or under-developed. Results: Here, we introduce MetaPop, an open-source bioinformatic pipeline that provides a single interface to analyze and visualize microbial and viral community metagenomes at both the macro- and microdiversity levels. Macrodiversity estimates include population abundances and α- and β-diversity. Microdiversity calculations include identification of single nucleotide polymorphisms, novel codon-constrained linkage of SNPs, nucleotide diversity (π and θ), and selective pressures (pN/pS and Tajima’s D) within and fixation indices (FST) between populations. MetaPop will also identify genes with distinct codon usage. Following rigorous validation, we applied MetaPop to the gut viromes of autistic children that underwent fecal microbiota transfers and their neurotypical peers. The macrodiversity results confirmed our prior findings for viral populations (microbial shotgun metagenomes were not available) that diversity did not significantly differ between autistic and neurotypical children. However, by also quantifying microdiversity, MetaPop revealed lower average viral nucleotide diversity (π) in autistic children. Analysis of the percentage of genomes detected under positive selection was also lower among autistic children, suggesting that higher viral π in neurotypical children may be beneficial because it allows populations to better “bet hedge” in changing environments. Further, comparisons of microdiversity pre- and post-FMT in autistic children revealed that the delivery FMT method (oral versus rectal) may influence viral activity and engraftment of microdiverse viral populations, with children who received their FMT rectally having higher microdiversity post-FMT. Overall, these results show that analyses at the macro level alone can miss important biological differences. Conclusions: These findings suggest that standardized population and genetic variation analyses will be invaluable for maximizing biological inference, and MetaPop provides a convenient tool package to explore the dual impact of macro- and microdiversity across microbial communities. [MediaObject not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Bolduc B."
                    },
                    {
                        "name": "Gerhardt K."
                    },
                    {
                        "name": "Gregory A.C."
                    },
                    {
                        "name": "Konstantinidis K.T."
                    },
                    {
                        "name": "Sullivan M.B."
                    },
                    {
                        "name": "Temperton B."
                    },
                    {
                        "name": "Zhong Z.-P."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Microbiome",
                "title": "MetaPop: a pipeline for macro- and microdiversity analyses and visualization of microbial and viral metagenome-derived populations"
            },
            "pmcid": "PMC8922842",
            "pmid": "35287721"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
