{
    "additionDate": "2019-11-14T18:17:26Z",
    "biotoolsCURIE": "biotools:SACMES",
    "biotoolsID": "SACMES",
    "confidence_flag": "tool",
    "description": "Open Source Software for the Real-Time Control, Processing, and Visualization of High-Volume Electrochemical Data | This repository contains the master script for the SACMES program and all updates | All updates for the Standard Operating Procedure (SOP) can be viewed here: https://www.dropbox.com/preview/NetzLab%20SACMES%20SOP/2019_11_13%20SACMES%20SOP.docx?role=personal",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/netzlab/SACMES.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-16T10:23:28.111974Z",
    "name": "SACMES",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.9B02553",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Electrochemical sensors are major players in the race for improved molecular diagnostics due to their convenience, temporal resolution, manufacturing scalability, and their ability to support real-time measurements. This is evident in the ever-increasing number of health-related electrochemical sensing platforms, ranging from single-measurement point-of-care devices to wearable devices supporting immediate and continuous monitoring. In support of the need for such systems to rapidly process large data volumes, we describe here an open-source, easily customizable, multiplatform compatible program for the real-time control, processing, and visualization of electrochemical data. The software's architecture is modular and fully documented, allowing the easy customization of the code to support the processing of voltammetric (e.g., square-wave and cyclic) and chronoamperometric data. The program, which we have called Software for the Analysis and Continuous Monitoring of Electrochemical Systems (SACMES), also includes a graphical interface allowing the user to easily change analysis parameters (e.g., signal/noise processing, baseline correction) in real-time. To demonstrate the versatility of SACMES we use it here to analyze the real-time data output by (1) the electrochemical, aptamer-based measurement of a specific small-molecule target, (2) a monoclonal antibody-detecting DNA-scaffold sensor, and (3) the determination of the folding thermodynamics of an electrode-attached, redox-reporter-modified protein.",
                "authors": [
                    {
                        "name": "Curtis S.D."
                    },
                    {
                        "name": "Ploense K.L."
                    },
                    {
                        "name": "Kurnik M."
                    },
                    {
                        "name": "Ortega G."
                    },
                    {
                        "name": "Parolo C."
                    },
                    {
                        "name": "Kippin T.E."
                    },
                    {
                        "name": "Plaxco K.W."
                    },
                    {
                        "name": "Arroyo-Curras N."
                    }
                ],
                "citationCount": 6,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Open Source Software for the Real-Time Control, Processing, and Visualization of High-Volume Electrochemical Data"
            },
            "pmid": "31462040"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Analytical chemistry",
            "uri": "http://edamontology.org/topic_3370"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}