{
    "accessibility": "Open access",
    "additionDate": "2019-06-22T13:39:02Z",
    "biotoolsCURIE": "biotools:PaperBot",
    "biotoolsID": "PaperBot",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "support@paperbot.ai",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://paperbot.ai/contact-us/"
        }
    ],
    "description": "Open-source web-based search and metadata organization of scientific literature.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://paperbot.ai/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "homepage": "http://paperbot.ai/",
    "lastUpdate": "2020-06-16T10:55:23Z",
    "maturity": "Mature",
    "name": "PaperBot",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2613-z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The biomedical literature is expanding at ever-increasing rates, and it has become extremely challenging for researchers to keep abreast of new data and discoveries even in their own domains of expertise. We introduce PaperBot, a configurable, modular, open-source crawler to automatically find and efficiently index peer-reviewed publications based on periodic full-text searches across publisher web portals. Results: PaperBot may operate stand-alone or it can be easily integrated with other software platforms and knowledge bases. Without user interactions, PaperBot retrieves and stores the bibliographic information (full reference, corresponding email contact, and full-text keyword hits) based on pre-set search logic from a wide range of sources including Elsevier, Wiley, Springer, PubMed/PubMedCentral, Nature, and Google Scholar. Although different publishing sites require different search configurations, the common interface of PaperBot unifies the process from the user perspective. Once saved, all information becomes web accessible allowing efficient triage of articles based on their actual relevance and seamless annotation of suitable metadata content. The platform allows the agile reconfiguration of all key details, such as the selection of search portals, keywords, and metadata dimensions. The tool also provides a one-click option for adding articles manually via digital object identifier or PubMed ID. The microservice architecture of PaperBot implements these capabilities as a loosely coupled collection of distinct modules devised to work separately, as a whole, or to be integrated with or replaced by additional software. All metadata is stored in a schema-less NoSQL database designed to scale efficiently in clusters by minimizing the impedance mismatch between relational model and in-memory data structures. Conclusions: As a testbed, we deployed PaperBot to help identify and manage peer-reviewed articles pertaining to digital reconstructions of neuronal morphology in support of the NeuroMorpho.Org data repository. PaperBot enabled the custom definition of both general and neuroscience-specific metadata dimensions, such as animal species, brain region, neuron type, and digital tracing system. Since deployment, PaperBot helped NeuroMorpho.Org more than quintuple the yearly volume of processed information while maintaining a stable personnel workforce.",
                "authors": [
                    {
                        "name": "Maraver P."
                    },
                    {
                        "name": "Armananzas R."
                    },
                    {
                        "name": "Gillette T.A."
                    },
                    {
                        "name": "Ascoli G.A."
                    }
                ],
                "citationCount": 6,
                "date": "2019-01-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PaperBot: Open-source web-based search and metadata organization of scientific literature"
            },
            "pmcid": "PMC6345070",
            "pmid": "30678631",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}