{
    "additionDate": "2019-11-14T18:16:55Z",
    "biotoolsCURIE": "biotools:ViVa",
    "biotoolsID": "ViVa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wrightrc@vt.edu",
            "name": "R. Clay Wright",
            "typeEntity": "Person"
        }
    ],
    "description": "Accelerating structure-function mapping using the ViVa webtool to mine natural variation | If Autoforward does not work, follow this link to go to Clay's ViVa website..",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://plantsynbiolab.bse.vt.edu/ViVa",
    "lastUpdate": "2021-01-11T10:48:55Z",
    "name": "ViVa",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PLD3.147",
            "metadata": {
                "abstract": "© 2019 The Authors. Plant Direct published by American Society of Plant Biologists, Society for Experimental Biology and John Wiley & Sons Ltd.Thousands of sequenced genomes are now publicly available capturing a significant amount of natural variation within plant species; yet, much of these data remain inaccessible to researchers without significant bioinformatics experience. Here, we present a webtool called ViVa (Visualizing Variation) which aims to empower any researcher to take advantage of the amazing genetic resource collected in the Arabidopsis thaliana 1001 Genomes Project (http://1001genomes.org). ViVa facilitates data mining on the gene, gene family, or gene network level. To test the utility and accessibility of ViVa, we assembled a team with a range of expertise within biology and bioinformatics to analyze the natural variation within the well-studied nuclear auxin signaling pathway. Our analysis has provided further confirmation of existing knowledge and has also helped generate new hypotheses regarding this well-studied pathway. These results highlight how natural variation could be used to generate and test hypotheses about less-studied gene families and networks, especially when paired with biochemical and genetic characterization. ViVa is also readily extensible to databases of interspecific genetic variation in plants as well as other organisms, such as the 3,000 Rice Genomes Project (http://snp-seek.irri.org/) and human genetic variation (https://www.ncbi.nlm.nih.gov/clinvar/).",
                "authors": [
                    {
                        "name": "Hamm M.O."
                    },
                    {
                        "name": "Moss B.L."
                    },
                    {
                        "name": "Leydon A.R."
                    },
                    {
                        "name": "Gala H.P."
                    },
                    {
                        "name": "Lanctot A."
                    },
                    {
                        "name": "Ramos R."
                    },
                    {
                        "name": "Klaeser H."
                    },
                    {
                        "name": "Lemmex A.C."
                    },
                    {
                        "name": "Zahler M.L."
                    },
                    {
                        "name": "Nemhauser J.L."
                    },
                    {
                        "name": "Wright R.C."
                    }
                ],
                "citationCount": 3,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Plant Direct",
                "title": "Accelerating structure-function mapping using the ViVa webtool to mine natural variation"
            },
            "pmcid": "PMC6658840",
            "pmid": "31372596"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}