{
    "additionDate": "2020-01-14T09:03:08Z",
    "biotoolsCURIE": "biotools:base-antibody",
    "biotoolsID": "base-antibody",
    "confidence_flag": "tool",
    "description": "An easy-to-use software for complete data analysis in single cell immunoglobulin cloning.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/automatedSequencing/BASE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-14T16:26:41Z",
    "license": "GPL-3.0",
    "name": "BASE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s12859-020-03741-w",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Repertoire analysis of patient-derived recombinant monoclonal antibodies is an important tool to study the role of B cells in autoimmune diseases of the human brain and beyond. Current protocols for generation of patient-derived recombinant monoclonal antibody libraries are time-consuming and contain repetitive steps, some of which can be assisted with the help of software automation. Results: We developed BASE, an easy-to-use software for complete data analysis in single cell immunoglobulin cloning. BASE consists of two modules: aBASE for immunological annotations and cloning primer lookup, and cBASE for plasmid sequence identity confirmation before expression. Comparing automated BASE analysis with manual analysis we confirmed the validity of BASE output: identity between manual and automated aBASE analysis was 100% for all outputs, except for immunoglobulin isotype determination. In this case, aBASE yielded correct results in 96% of cases, whereas 4% of cases required manual confirmation. cBASE automatically concluded expression recommendations in 89.8% of cases, 91.8% of which were identical to manually derived results and none of them were false-positive. Conclusions: BASE offers an easy-to-use software solution suitable for complete Ig sequence data analysis and tracking during recombinant mAb cloning from single cells. Plasmid sequence identity confirmation by cBASE offers functionality not provided by existing software solutions in the field and will help to reduce time-consuming steps of the monoclonal antibody generation workflow. BASE can be installed locally or accessed online at Code Ocean.",
                "authors": [
                    {
                        "name": "Kreye J."
                    },
                    {
                        "name": "Pruss H."
                    },
                    {
                        "name": "Reincke S.M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Brain antibody sequence evaluation (BASE): An easy-to-use software for complete data analysis in single cell immunoglobulin cloning"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
