{
    "additionDate": "2021-03-19T08:39:23Z",
    "biotoolsCURIE": "biotools:timelessflex",
    "biotoolsID": "timelessflex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "uwe.ohler@mdc-berlin.de",
            "name": "Uwe Ohler",
            "orcidid": "https://orcid.org/0000-0002-0881-3116",
            "typeEntity": "Person"
        }
    ],
    "description": "TimelessFlex - A flexible framework for investigating chromatin state trajectories. Inferring time series chromatin states for promoter-enhancer pairs based on Hi-C data.\nTimelessFlex is a flexible framework for investigating chromatin state trajectories during linear and branched tissue differentiation. This framework adapts and extends Timeless, a Bayesian network for co-clustering of multiple histone modifications at promoter and enhancer feature regions. TimelessFlex is flexible depending on the available genomic data. The basic required data is ChIP-seq for histone modifications with at least three time points and a set of regions of interest.",
    "download": [
        {
            "type": "Software package",
            "url": "https://bimsbstatic.mdc-berlin.de/ohler/henriettemiko/TimelessFlex-docker-pack.tar"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://github.com/henriettemiko/TimelessFlex",
    "language": [
        "MATLAB",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-04-23T15:52:52Z",
    "license": "GPL-3.0",
    "name": "TimelessFlex",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07373-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Co-localized combinations of histone modifications (“chromatin states”) have been shown to correlate with promoter and enhancer activity. Changes in chromatin states over multiple time points (“chromatin state trajectories”) have previously been analyzed at promoter and enhancers separately. With the advent of time series Hi-C data it is now possible to connect promoters and enhancers and to analyze chromatin state trajectories at promoter-enhancer pairs. Results: We present TimelessFlex, a framework for investigating chromatin state trajectories at promoters and enhancers and at promoter-enhancer pairs based on Hi-C information. TimelessFlex extends our previous approach Timeless, a Bayesian network for clustering multiple histone modification data sets at promoter and enhancer feature regions. We utilize time series ATAC-seq data measuring open chromatin to define promoters and enhancer candidates. We developed an expectation-maximization algorithm to assign promoters and enhancers to each other based on Hi-C interactions and jointly cluster their feature regions into paired chromatin state trajectories. We find jointly clustered promoter-enhancer pairs showing the same activation patterns on both sides but with a stronger trend at the enhancer side. While the promoter side remains accessible across the time series, the enhancer side becomes dynamically more open towards the gene activation time point. Promoter cluster patterns show strong correlations with gene expression signals, whereas Hi-C signals get only slightly stronger towards activation. The code of the framework is available at https://github.com/henriettemiko/TimelessFlex. Conclusions: TimelessFlex clusters time series histone modifications at promoter-enhancer pairs based on Hi-C and it can identify distinct chromatin states at promoter and enhancer feature regions and their changes over time.",
                "authors": [
                    {
                        "name": "Gaertner B."
                    },
                    {
                        "name": "Miko H."
                    },
                    {
                        "name": "Ohler U."
                    },
                    {
                        "name": "Qiu Y."
                    },
                    {
                        "name": "Sander M."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Inferring time series chromatin states for promoter-enhancer pairs based on Hi-C data"
            },
            "pmcid": "PMC7841892",
            "pmid": "33509077"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
