{
    "additionDate": "2021-01-18T07:07:36Z",
    "biotoolsCURIE": "biotools:opus-refine",
    "biotoolsID": "opus-refine",
    "confidence_flag": "tool",
    "description": "A Fast Sampling-Based Framework for Refining Protein Backbone Torsion Angles and Global Conformation.\n\nProtein backbone torsion angles (Phi and Psi) are crucial for protein local conformation description.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "https://github.com/thuxugang/opus_refine",
    "lastUpdate": "2021-03-15T09:30:47Z",
    "name": "OPUS-Refine",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCTC.9B01054",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Protein backbone torsion angles (Phi and Psi) are crucial for protein local conformation description. In this paper, we propose a general postprocessing method for all prediction methods, namely, OPUS-Refine, which may contribute to the field in a different way. OPUS-Refine is a sampling-based method, therefore, the results of other prediction methods can be used as its constraints. After OPUS-Refine refinement, for instance, the accuracy of Phi/Psi predicted by SPIDER3 and SPOT-1D are both increased. In addition, to facilitate the sampling efficiency, we construct a neighbor-dependent statistical torsion angles sampling database, namely, OPUS-TA, which may be useful for other sampling-based methods. Furthermore, we also introduce the contact map predicted by RaptorX to OPUS-Refine as a global structural constraint. After refinement, compared to the predicted structures obtained from RaptorX online server, the accuracy of both global structural configurations (measured by TM-score and RMSD) and local structural configurations (measured by Phi/Psi) results are improved. OPUS-Refine is a highly efficient framework, it takes only about 4 s to refine the torsion angles and 30 s to refine the global structure of a protein with 100 residues in length on a typical desktop personal computer. Therefore, the sampling-based feature and the efficiency of OPUS-Refine offer greater potentiality for it to take advantage of any other method to achieve better performance.",
                "authors": [
                    {
                        "name": "Ma J."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Xu G."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-11T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "OPUS-Refine: A Fast Sampling-Based Framework for Refining Protein Backbone Torsion Angles and Global Conformation"
            },
            "pmid": "31935088"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
