{
    "accessibility": "Open access",
    "additionDate": "2024-03-18T13:59:21.893091Z",
    "biotoolsCURIE": "biotools:to_ast",
    "biotoolsID": "to_ast",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ghaiyan@ustb.edu.cn",
            "name": "Haiyan Gong",
            "typeEntity": "Person"
        },
        {
            "email": "zxt@ies.ustb.edu.cn",
            "name": "Xiaotong Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel method for identifying topologically associated domains based on graph auto-encoders and clustering.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ghaiyan/TOAST",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:09:06.093841Z",
    "name": "TOAST",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2023.09.019",
            "metadata": {
                "abstract": "Topologically associated domains (TADs) play a pivotal role in disease detection. This study introduces a novel TADs recognition approach named TOAST, leveraging graph auto-encoders and clustering techniques. TOAST conceptualizes each genomic bin as a node of a graph and employs the Hi-C contact matrix as the graph's adjacency matrix. By employing graph auto-encoders, TOAST generates informative embeddings as features. Subsequently, the unsupervised clustering algorithm HDBSCAN is utilized to assign labels to each genomic bin, facilitating the identification of contiguous regions with the same label as TADs. Our experimental analysis of several simulated Hi-C data sets shows that TOAST can quickly and accurately identify TADs from different types of simulated Hi-C contact matrices, outperforming existing algorithms. We also determined the anchoring ratio of TAD boundaries by analyzing different TAD recognition algorithms, and obtained an average ratio of anchoring CTCF, SMC3, RAD21, POLR2A, H3K36me3, H3K9me3, H3K4me3, H3K4me1, Enhancer, and Promoters of 0.66, 0.47, 0.54, 0.27, 0.24, 0.12, 0.32, 0.41, 0.26, and 0.13, respectively. In conclusion, TOAST is a method that can quickly identify TAD boundary parameters that are easy to understand and have important biological significance. The TOAST web server can be accessed via http://223.223.185.189:4005/. The code of TOAST is available online at https://github.com/ghaiyan/TOAST.",
                "authors": [
                    {
                        "name": "Gong H."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "TOAST: A novel method for identifying topologically associated domains based on graph auto-encoders and clustering"
            },
            "pmcid": "PMC10562672",
            "pmid": "37822562"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
