{
    "accessibility": [],
    "additionDate": "2017-08-03T19:02:45Z",
    "biotoolsCURIE": "biotools:ti2biop",
    "biotoolsID": "ti2biop",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "cmia@cm-matosinhos.pt",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ciimar.up.pt/lege/en/index.htm"
        }
    ],
    "description": "The tool allows the calculation of the spectral moments derived from inferred and artificial 2D structures of DNA, RNA and proteins being possible to carry out a structure-function correlation using such sequence/structure numerical indices.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://sourceforge.net/projects/ti2biop/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Spectral counting",
                    "uri": "http://edamontology.org/operation_3637"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://sourceforge.net/projects/ti2biop/",
    "homepage_status": 0,
    "language": [
        "Python",
        "Delphi"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ti2biop-2-0-topological-indices-biopolymers.html"
        }
    ],
    "maturity": null,
    "name": "TI2BioP",
    "operatingSystem": [
        "Windows"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Bacteriocins are proteinaceous toxins produced and exported by both gram-negative and gram-positive bacteria as a defense mechanism. The bacteriocin protein family is highly diverse, which complicates the identification of bacteriocin-like sequences using alignment approaches. The use of topological indices (TIs) irrespective of sequence similarity can be a promising alternative to predict proteinaceous bacteriocins. Thus, we present Topological Indices to BioPolymers (TI2BioP) as an alignment-free approach inspired in both the Topological Substructural Molecular Design (TOPS-MODE) and Markov Chain Invariants for Network Selection and Design (MARCH-INSIDE) methodology. TI2BioP allows the calculation of the spectral moments as simple TIs to seek quantitative sequence-function relationships (QSFR) models. Since hydrophobicity and basicity are major criteria for the bactericide activity of bacteriocins, the spectral moments (HPμ k ) were derived for the first time from protein artificial secondary structures based on amino acid clustering into a Cartesian system of hydrophobicity and polarity. Several orders of HPμ k characterized numerically 196 bacteriocin-like sequences and a control group made up of 200 representative CATH domains. Subsequently, they were used to develop an alignment-free QSFR model allowing a 76.92% discrimination of bacteriocin proteins from other domains, a relevant result considering the high sequence diversity among the members of both groups. The model showed a prediction overall performance of 72.16%, detecting specifically 66.7% of proteinaceous bacteriocins whereas the InterProScan retrieved just 60.2%. As a practical validation, the model also predicted successfully the cryptic bactericide function of the Cry 1Ab C-terminal domain from Bacillus thuringiensis's endotoxin, which has not been detected by classical alignment methods. © 2010 Springer-Verlag.",
                "authors": [
                    {
                        "name": "Aguero-Chapin G."
                    },
                    {
                        "name": "Perez-Machado G."
                    },
                    {
                        "name": "Molina-Ruiz R."
                    },
                    {
                        "name": "Perez-Castillo Y."
                    },
                    {
                        "name": "Morales-Helguera A."
                    },
                    {
                        "name": "Vasconcelos V."
                    },
                    {
                        "name": "Antunes A."
                    }
                ],
                "citationCount": 7,
                "date": "2011-02-01T00:00:00Z",
                "journal": "Amino Acids",
                "title": "TI2BioP: Topological Indices to BioPolymers. Its practical use to unravel cryptic bacteriocin-like domains"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20563611",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1,
    "version": []
}