{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-01-02T18:38:21.754518Z",
    "biotoolsCURIE": "biotools:deepcervix",
    "biotoolsID": "deepcervix",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "mamunrobi35@gmail.com",
            "name": "Md Mamunur Rahaman"
        }
    ],
    "description": "A deep learning-based framework for the classification of cervical cells using hybrid deep feature fusion techniques.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/Mamunur-20/DeepCervix",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-02T18:38:21.757009Z",
    "name": "DeepCervix",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2021.104649",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdCervical cancer, one of the most common fatal cancers among women, can be prevented by regular screening to detect any precancerous lesions at early stages and treat them. Pap smear test is a widely performed screening technique for early detection of cervical cancer, whereas this manual screening method suffers from high false-positive results because of human errors. To improve the manual screening practice, machine learning (ML) and deep learning (DL) based computer-aided diagnostic (CAD) systems have been investigated widely to classify cervical Pap cells. Most of the existing studies require pre-segmented images to obtain good classification results. In contrast, accurate cervical cell segmentation is challenging because of cell clustering. Some studies rely on handcrafted features, which cannot guarantee the classification stage's optimality. Moreover, DL provides poor performance for a multiclass classification task when there is an uneven distribution of data, which is prevalent in the cervical cell dataset. This investigation has addressed those limitations by proposing DeepCervix, a hybrid deep feature fusion (HDFF) technique based on DL, to classify the cervical cells accurately. Our proposed method uses various DL models to capture more potential information to enhance classification performance. Our proposed HDFF method is tested on the publicly available SIPaKMeD dataset and compared the performance with base DL models and the late fusion (LF) method. For the SIPaKMeD dataset, we have obtained the state-of-the-art classification accuracy of 99.85%, 99.38%, and 99.14% for 2-class, 3-class, and 5-class classification. This method is also tested on the Herlev dataset and achieves an accuracy of 98.32% for 2-class and 90.32% for 7-class classification. The source code of the DeepCervix model is available at: https://github.com/Mamunur-20/DeepCervix.",
                "authors": [
                    {
                        "name": "Rahaman M.M."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Yao Y."
                    },
                    {
                        "name": "Kulwa F."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wang Q."
                    }
                ],
                "citationCount": 2,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "DeepCervix: A deep learning-based framework for the classification of cervical cells using hybrid deep feature fusion techniques"
            },
            "pmid": "34332347"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}