{
    "name": "HAPPY", 
    "description": "Estimates haplotype-specific odds ratios from genotype data on unrelated cases and controls using unconditional logistic regression. It can adjust for the main effects of relevant covariates and estimate stratum-specific haplotype effects.", 
    "homepage": "http://www.hsph.harvard.edu/peter-kraft/software/", 
    "biotoolsID": "happy", 
    "biotoolsCURIE": "biotools:happy", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3659", 
                    "term": "Regression analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0634", 
            "term": "Pathology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0625", 
            "term": "Genotype and phenotype"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "SAS"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/happy-haplotype-scoring-generalized-linear-modeling-haplotype-disease-association-tests.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://www.hsph.harvard.edu/peter-kraft/software/", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15637718", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Accounting for haplotype uncertainty in matched association studies: A comparison of simple and flexible techniques", 
                "abstract": "Population-based case-control studies measuring associations between haplotypes of single nucleotide polymorphisms (SNPs) are increasingly popular, in part because haplotypes of a few \"tagging\" SNPs may serve as surrogates for variation in relatively large sections of the genome. Due to current technological limitations, haplotypes in cases and controls must be inferred from unphased genotypic data. Using individual-specific inferred haplotypes as covariates in standard epidemiologic analyses (e.g., conditional logistic regression) is an attractive analysis strategy, as it allows adjustment for nongenetic covariates, provides omnibus and haplotype-specific tests of association, and can estimate haplotype and haplotype x environment interaction effects. In principle, some adjustment for the uncertainty in inferred haplotypes should be made. Via simulation, we compare the performance (bias and mean squared error of haplotype and haplotype x environment interaction effect estimates) of several analytic strategies using inferred haplotypes in the context of matched case-control data. These strategies include using only the most likely haplotype assignment, the expectation substitution approach described by Stram et al. ([2003b] Hum. Hered. 55:179-190) and others, and an improper version of multiple imputation. For relatively uncomplicated haplotype structures and moderate haplotype relative risks (≤2), all methods performed comparably well (small bias with appropriately-sized confidence intervals). For larger relative risks, the most likely haplotype and multiple imputation strategies showed noticeable bias towards the null; the expectation substitution strategy still performed well. When there was more uncertainty in the inferred haplotypes, the most likely and multiple imputation strategies showed even more bias towards the null, while the expectation substitution method had slightly smaller than nominal confidence intervals for larger relative risks (≥5). An application to progesterone-receptor haplotypes and endometrial cancer further illustrates that the performance of all these methods depends on how well the observed haplotypes \"tag\" the unobserved causal variant. © 2005 Wiley-Liss, Inc.", 
                "date": "2005-04-01T00:00:00Z", 
                "citationCount": 118, 
                "authors": [
                    {
                        "name": "Kraft P."
                    }, 
                    {
                        "name": "Cox D.G."
                    }, 
                    {
                        "name": "Paynter R.A."
                    }, 
                    {
                        "name": "Hunter D."
                    }, 
                    {
                        "name": "De Vivo I."
                    }
                ], 
                "journal": "Genetic Epidemiology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Peter Kraft", 
            "email": "pkraft@hsph.harvard.edu", 
            "url": "http://www.hsph.harvard.edu/peter-kraft", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:45:49Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}