{
    "additionDate": "2021-01-18T10:22:40Z",
    "biotoolsCURIE": "biotools:minmlst",
    "biotoolsID": "minmlst",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vaksler@post.bgu.ac.il",
            "name": "Isana Veksler-Lublinsky",
            "typeEntity": "Person"
        }
    ],
    "description": "Machine-learning for optimization of bacterial strain typing.\n\nMachine-learning based minimal MLST scheme for bacterial strain typing.\n\nminMLST is a machine-learning based methodology for identifying a minimal subset of genes that preserves high discrimination among bacterial strains. It combines well known machine-learning algorithms and approaches such as XGBoost, distance-based hierarchical clustering, and SHAP. minMLST quantifies the importance level of each gene in an MLST scheme and allows the user to investigate the trade-off between minimizing the number of genes in the scheme vs preserving a high resolution among strains.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/minmlst/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T08:04:20Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://mlst.net"
        }
    ],
    "name": "minMLST",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA724",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: High-resolution microbial strain typing is essential for various clinical purposes, including disease outbreak investigation, tracking of microbial transmission events and epidemiological surveillance of bacterial infections. The widely used approach for multilocus sequence typing (MLST) that is based on the core genome, cgMLST, has the advantage of a high level of typeability and maximal discriminatory power. Yet, the transition from a seven loci-based scheme to cgMLST involves several challenges, that include the need by some users to maintain backward compatibility, growing difficulties in the day-to-day communication within the microbiology community with respect to nomenclature and ontology, issues with typeability, especially if a more stringent approach to loci presence is used, and computational requirements concerning laboratory data management and sharing with end-users. Hence, methods for optimizing cgMLST schemes through careful reduction of the number of loci are expected to be beneficial for practical needs in different settings. RESULTS: We present a new machine learning-based methodology, minMLST, for minimizing the number of genes in cgMLST schemes by identifying subsets of informative genes and analyzing the trade-off between gene reduction and typing performance. The results achieved with minMLST over eight bacterial species show that despite the reduction in the number of genes up to a factor of 10, the typing performance remains very high and significant with an Adjusted Rand Index that ranges between 0.4 and 0.93 in different species and a P-value < 10-3. The identification of such optimized MLST schemes for bacterial strain typing is expected to improve the implementation of cgMLST by improving interlaboratory agreement and communication. AVAILABILITY AND IMPLEMENTATION: The python package minMLST is available at https://PyPi.org/project/minmlst/PyPI and supported on Linux and Windows. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Cohen S."
                    },
                    {
                        "name": "Moran-Gilad J."
                    },
                    {
                        "name": "Motro Y."
                    },
                    {
                        "name": "Rokach L."
                    },
                    {
                        "name": "Veksler-Lublinsky I."
                    }
                ],
                "date": "2021-04-20T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "minMLST: machine learning for optimization of bacterial strain typing"
            },
            "pmid": "32804993"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
