{"credit":[{"email":"j.boele@vu.nl","name":"Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://f-a-m-e.fame-vu.surf-hosted.nl/ajax/files/manual.pdf"}],"function":[{"operation":[{"term":"Modelling and simulation","uri":"http://edamontology.org/operation_2426"}]}],"labels":{"license":"BSD-2-Clause","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"},{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"}]},"publication":[{"abstract":"Background: The creation and modification of genome-scale metabolic models is a task that requires specialized software tools. While these are available, subsequently running or visualizing a model often relies on disjoint code, which adds additional actions to the analysis routine and, in our experience, renders these applications suboptimal for routine use by (systems) biologists.Results: The Flux Analysis and Modeling Environment (FAME) is the first web-based modeling tool that combines the tasks of creating, editing, running, and analyzing/visualizing stoichiometric models into a single program. Analysis results can be automatically superimposed on familiar KEGG-like maps. FAME is written in PHP and uses the Python-based PySCeS-CBM for its linear solving capabilities. It comes with a comprehensive manual and a quick-start tutorial, and can be accessed online at http://f-a-m-e.org/.Conclusions: With FAME, we present the community with an open source, user-friendly, web-based \"one stop shop\" for stoichiometric modeling. We expect the application will be of substantial use to investigators and educators alike. © 2012 Boele et al; licensee BioMed Central Ltd.","authors":["Boele J.","Olivier B.G.","Teusink B."],"cit_count":38,"doi":"10.1186/1752-0509-6-8","journal":"BMC Systems Biology","title":"FAME, the Flux Analysis and Modeling Environment","year":"2012-01-30"}],"summary":{"biotoolsCURIE":"biotools:fame","biotoolsID":"fame","description":"Flux Analysis and Modeling Environment.","homepage":"http://f-a-m-e.fame-vu.surf-hosted.nl/ajax/page1.php","name":"FAME"}}