{
    "additionDate": "2019-11-14T20:08:48Z",
    "biotoolsCURIE": "biotools:sonoviewer",
    "biotoolsID": "sonoviewer",
    "confidence_flag": "tool",
    "description": "Web-Based GPU-Accelerated Application for Multiplanar Reconstructions from Conventional 2D Ultrasound | ImagingAnatomy.com is an interactive atlas of normal imaging anatomy for the radiologist as well as a learning device for health professionals in general studying anatomy for any reason | Sonoviewer is an open access web application developed as an extension of the Mulrecon web-based viewer",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.castlemountain.dk/atlas/index.php?page=mulrecon&mulreconPage=sonoviewer",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2020-12-21T13:12:07Z",
    "name": "sonoviewer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1055/A-0999-5347",
            "metadata": {
                "abstract": "© 2019. Thieme. All rights reserved.Purpose In ultrasound education there is a need for interactive web-based learning resources. The purpose of this project was to develop a web-based application that enables the generation and exploration of volumetric datasets from cine loops obtained with conventional 2D ultrasound. Materials and Methods JavaScript code for ultrasound video loading and the generation of volumetric datasets was created and merged with an existing web-based imaging viewer based on JavaScript and HTML5. The Web Graphics Library was utilized to enable hardware-accelerated image rendering. Results The result is a web application that works in most major browsers without any plug-ins. It allows users to load a conventional 2D ultrasound cine loop which can subsequently be manipulated with on-the-fly multiplanar reconstructions as in a Digital Imaging and Communications in Medicine (DICOM) viewer. The application is freely accessible at (http://www.castlemountain.dk/atlas/index.phppagemulreconmulreconPagesonoviewer) where a demonstration of web-based sharing of generated cases can also be found. Conclusion The developed web-based application is unique in its ability to easily perform loading of one's own ultrasound clips and conduct multiplanar reconstructions where interactive cases can be shared on the Internet.",
                "authors": [
                    {
                        "name": "Borgbjerg J."
                    },
                    {
                        "name": "Horlyck A."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "Ultraschall in der Medizin",
                "title": "Web-Based GPU-Accelerated Application for Multiplanar Reconstructions from Conventional 2D Ultrasound"
            },
            "pmid": "31487752"
        }
    ],
    "topic": [
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}