{
    "additionDate": "2024-05-24T08:54:22.966302Z",
    "biotoolsCURIE": "biotools:knext",
    "biotoolsID": "knext",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "erich.baker@belmont.edu",
            "name": "Erich J. Baker",
            "typeEntity": "Person"
        }
    ],
    "description": "NetworkX-based topologically relevant KEGG parser.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Pathway visualisation",
                    "uri": "http://edamontology.org/operation_3926"
                }
            ]
        }
    ],
    "homepage": "https://github.com/everest-castaneda/knext",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-05-24T08:54:22.968704Z",
    "name": "KNeXT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fgene.2024.1292394",
            "metadata": {
                "abstract": "Automating the recreation of gene and mixed gene-compound networks from Kyoto Encyclopedia of Genes and Genomes (KEGG) Markup Language (KGML) files is challenging because the data structure does not preserve the independent or loosely connected neighborhoods in which they were originally derived, referred to here as its topological environment. Identical accession numbers may overlap, causing neighborhoods to artificially collapse based on duplicated identifiers. This causes current parsers to create misleading or erroneous graphical representations when mixed gene networks are converted to gene-only networks. To overcome these challenges we created a python-based KEGG NetworkX Topological (KNeXT) parser that allows users to accurately recapitulate genetic networks and mixed networks from KGML map data. The software, archived as a python package index (PyPI) file to ensure broad application, is designed to ingest KGML files through built-in APIs and dynamically create high-fidelity topological representations. The utilization of NetworkX’s framework to generate tab-separated files additionally ensures that KNeXT results may be imported into other graph frameworks and maintain programmatic access to the original x-y axis positions to each node in the KEGG pathway. KNeXT is a well-described Python 3 package that allows users to rapidly download and aggregate specific KGML files and recreate KEGG pathways based on a range of user-defined settings. KNeXT is platform-independent, distinctive, and it is not written on top of other Python parsers. Furthermore, KNeXT enables users to parse entire local folders or single files through command line scripts and convert the output into NCBI or UniProt IDs. KNeXT provides an ability for researchers to generate pathway visualizations while persevering the original context of a KEGG pathway. Source code is freely available at https://github.com/everest-castaneda/knext.",
                "authors": [
                    {
                        "name": "Baker E.J."
                    },
                    {
                        "name": "Castaneda E.U."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "KNeXT: a NetworkX-based topologically relevant KEGG parser"
            },
            "pmcid": "PMC10896898",
            "pmid": "38415058"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
