{
    "name": "RetroMap", 
    "description": "An application designed to help characterize LTR retroelements on a genome scale in a visually interactive manner. This is NOT a particularly great for comprehensive identification of elements found in highly nested contexts. Only the most internal element of those which are nested is likely to be identified as a complete element. The other elements will be treated as solo LTRs and internal regions depending on how you have set up your element searches.", 
    "homepage": "http://www.burchsite.com/bioi/RetroMapHome.html", 
    "biotoolsID": "retromap", 
    "biotoolsCURIE": "biotools:retromap", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0427", 
                    "term": "Transposon prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0798", 
            "term": "Mobile genetic elements"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/retromap-0-021-characterize-ltr-retroelements-genome-scale.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.burchsite.com/bioi/RetroMapHome.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15461796", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Genomic neighborhoods for Arabidopsis retrotransposons: a role for targeted integration in the distribution of the Metaviridae.", 
                "abstract": "BACKGROUND: Retrotransposons are an abundant component of eukaryotic genomes. The high quality of the Arabidopsis thaliana genome sequence makes it possible to comprehensively characterize retroelement populations and explore factors that contribute to their genomic distribution. RESULTS: We identified the full complement of A. thaliana long terminal repeat (LTR) retroelements using RetroMap, a software tool that iteratively searches genome sequences for reverse transcriptases and then defines retroelement insertions. Relative ages of full-length elements were estimated by assessing sequence divergence between LTRs: the Pseudoviridae were significantly younger than the Metaviridae. All retroelement insertions were mapped onto the genome sequence and their distribution was distinctly non-uniform. Although both Pseudoviridae and Metaviridae tend to cluster within pericentromeric heterochromatin, this association is significantly more pronounced for all three Metaviridae sublineages (Metavirus, Tat and Athila). Among these, Tat and Athila are strictly associated with pericentromeric heterochromatin. CONCLUSIONS: The non-uniform genomic distribution of the Pseudoviridae and the Metaviridae can be explained by a variety of factors including target-site bias, selection against integration into euchromatin and pericentromeric accumulation of elements as a result of suppression of recombination. However, comparisons based on the age of elements and their chromosomal location indicate that integration-site specificity is likely to be the primary factor determining distribution of the Athila and Tat sublineages of the Metaviridae. We predict that, like retroelements in yeast, the Athila and Tat elements target integration to pericentromeric regions by recognizing a specific feature of pericentromeric heterochromatin.", 
                "date": "2004-01-01T00:00:00Z", 
                "citationCount": 61, 
                "authors": [
                    {
                        "name": "Peterson-Burch B.D."
                    }, 
                    {
                        "name": "Nettleton D."
                    }, 
                    {
                        "name": "Voytas D.F."
                    }
                ], 
                "journal": "Genome biology"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "bburch@nadc.ars.usda.gov", 
            "url": "http://www.burchsite.com/bioi/index.html", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:58:39Z", 
    "lastUpdate": "2018-12-10T12:58:49Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}