
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein hydrophobic region calculation",
                    "uri": "http://edamontology.org/operation_0405"
                },
                {
                    "term": "Protein solubility prediction",
                    "uri": "http://edamontology.org/operation_0409"
                },
                {
                    "term": "Protein hydrophobic moment plotting",
                    "uri": "http://edamontology.org/operation_0407"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "topic": [
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            },
            {
                "term": "Protein properties",
                "uri": "http://edamontology.org/topic_0123"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Copyright © 2019 American Chemical Society.Solvation and hydrophobicity play a key role in a variety of biological mechanisms. In substrate binding, but also in structure-based drug design, the thermodynamic properties of water molecules surrounding a given protein are of high interest. One of the main algorithms devised in recent years to quantify thermodynamic properties of water is the grid inhomogeneous solvation theory (GIST), which calculates these features on a grid surrounding the protein. Despite the inherent advantages of GIST, the computational demand is a major drawback, as calculations for larger systems can take days or even weeks. Here, we present a GPU accelerated version of the GIST algorithm, which facilitates efficient estimates of solvation free energy even of large biomolecular interfaces. Furthermore, we show that GIST can be used as a reliable tool to evaluate protein surface hydrophobicity. We apply the approach on a set of nine different proteases calculating localized solvation free energies on the surface of the binding interfaces as a measure of their hydrophobicity. We find a compelling agreement with the hydrophobicity of their substrates, i.e., peptides, binding into the binding cleft, and thus our approach provides a reliable description of hydrophobicity characteristics of these biological interfaces.",
            "authors": [
                "Kraml J.",
                "Kamenik A.S.",
                "Waibl F.",
                "Schauperl M.",
                "Liedl K.R."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JCTC.9B00742",
            "journal": "Journal of Chemical Theory and Computation",
            "pmid": "31589427",
            "title": "Solvation Free Energy as a Measure of Hydrophobicity: Application to Serine Protease Binding Interfaces",
            "year": "2019-11-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:GIST_autogenerated",
        "biotoolsID": "GIST_autogenerated",
        "description": "Solvation Free Energy as a Measure of Hydrophobicity.\n\nFor a standard cpptraj installation, a shell script and a patch file has been supplied.\n\nbash patch.sh </ROUTE/TO/CPPTRAJ/DIRECTORY>.\n\nIn configure add to the CUDA_TARGET cuda_kernel_gist/lib_cuda_gist.a.\n\nThe columns in the gist output file are ordered differently than in the original implementation, the density of the water oxygen and hydrogen was moved to the back. This, of course, also has a big impact on the other columns.\n\n||| NAME EQUAL TO (PUB. DIFFERENT) bio.tools/gist",
        "homepage": "https://github.com/liedllab/gigist",
        "name": "GIST_autogenerated"
    }
}