{
    "additionDate": "2018-07-07T21:06:05Z",
    "biotoolsCURIE": "biotools:asmvar",
    "biotoolsID": "asmvar",
    "credit": [
        {
            "email": "huangshujia@genomics.cn",
            "name": "Shujia Huang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software for discovery, genotyping and characterization of structural variants.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/bioinformatics-centre/AsmVar/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics-centre.github.io/AsmVar/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "AsmVar",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s13742-015-0103-4",
            "metadata": {
                "abstract": "© 2016 Liu et al.Background: Comprehensive recognition of genomic variation in one individual is important for understanding disease and developing personalized medication and treatment. Many tools based on DNA re-sequencing exist for identification of single nucleotide polymorphisms, small insertions and deletions (indels) as well as large deletions. However, these approaches consistently display a substantial bias against the recovery of complex structural variants and novel sequence in individual genomes and do not provide interpretation information such as the annotation of ancestral state and formation mechanism. Findings: We present a novel approach implemented in a single software package, AsmVar, to discover, genotype and characterize different forms of structural variation and novel sequence from population-scale de novo genome assemblies up to nucleotide resolution. Application of AsmVar to several human de novo genome assemblies captures a wide spectrum of structural variants and novel sequences present in the human population in high sensitivity and specificity. Conclusions: Our method provides a direct solution for investigating structural variants and novel sequences from de novo genome assemblies, facilitating the construction of population-scale pan-genomes. Our study also highlights the usefulness of the de novo assembly strategy for definition of genome structure.",
                "authors": [
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Rao J."
                    },
                    {
                        "name": "Ye W."
                    },
                    {
                        "name": "Krogh A."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 9,
                "date": "2015-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Discovery, genotyping and characterization of structural variation and novel sequence at single nucleotide resolution from de novo genome assemblies on a population scale"
            },
            "pmcid": "PMC4690232",
            "pmid": "26705468",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotyping experiment",
            "uri": "http://edamontology.org/topic_3516"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}