{
    "additionDate": "2021-12-06T12:40:59.627254Z",
    "biotoolsCURIE": "biotools:sprd",
    "biotoolsID": "sprd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pbt7@georgetown.edu",
            "name": "Purushottam B. Tiwari",
            "orcidid": "https://orcid.org/0000-0002-3140-0723",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "au26@georgetown.edu",
            "name": "Aykut Üren",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Surface Plasmon Resonance Database (SPRD) is a surface plasmon resonance database of common factors for better experimental planning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://www.sprdatabase.info",
    "lastUpdate": "2021-12-06T12:40:59.629764Z",
    "name": "SPRD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12860-021-00354-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Surface plasmon resonance is a label-free biophysical technique that is widely used in investigating biomolecular interactions, including protein-protein, protein-DNA, and protein-small molecule binding. Surface plasmon resonance is a very powerful tool in different stages of small molecule drug development and antibody characterization. Both academic institutions and pharmaceutical industry extensively utilize this method for screening and validation studies involving direct molecular interactions. In most applications of the surface plasmon resonance technology, one of the studied molecules is immobilized on a microchip, while the second molecule is delivered through a microfluidic system over the immobilized molecules. Changes in total mass on the chip surface is recorded in real time as an indicator of the molecular interactions. Main body: Quality and accuracy of the surface plasmon resonance data depend on experimental variables, including buffer composition, type of sensor chip, coupling chemistry of molecules on the sensor surface, and surface regeneration conditions. These technical details are generally included in materials and methods sections of published manuscripts and are not easily accessible using the common internet browser search engines or PubMed. Herein, we introduce a surface plasmon resonance database, www.sprdatabase.info that contains technical details extracted from 5140 publications with surface plasmon resonance data. We also provide an analysis of experimental conditions preferred by different laboratories. These experimental variables can be searched within the database and help future users of this technology to design better experiments. Conclusion: Amine coupling and CM5 chips were the most common methods used for immobilizing proteins in surface plasmon resonance experiments. However, number of different chips, capture methods and buffer conditions were used by multiple investigators. We predict that the database will significantly help the scientific community using this technology and hope that users will provide feedback to improve and expand the database indefinitely. Publicly available information in the database can save a great amount of time and resources by assisting initial optimization and troubleshooting of surface plasmon resonance experiments.",
                "authors": [
                    {
                        "name": "Tiwari P.B."
                    },
                    {
                        "name": "Bencheqroun C."
                    },
                    {
                        "name": "Lemus M."
                    },
                    {
                        "name": "Shaw T."
                    },
                    {
                        "name": "Kouassi-Brou M."
                    },
                    {
                        "name": "Alaoui A."
                    },
                    {
                        "name": "Uren A."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Molecular and Cell Biology",
                "title": "SPRD: a surface plasmon resonance database of common factors for better experimental planning"
            },
            "pmcid": "PMC7937274",
            "pmid": "33676410",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        }
    ]
}