{
    "name": "BBMRI-NL catalog", 
    "description": "Database of collections of biomaterial and associated data subsumed under the umbrella of BBMRI-NL.", 
    "homepage": "https://www.bbmri.nl/biobanks/bbmri-nl-catalogue/", 
    "biotoolsID": "bbmri-nl_catalog", 
    "biotoolsCURIE": "biotools:bbmri-nl_catalog", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2422", 
                    "term": "Data retrieval"
                }
            ], 
            "input": [], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0957", 
                        "term": "Database metadata"
                    }, 
                    "format": []
                }
            ], 
            "note": "BBMRI-NL is designed to provide infrastructure for biomedical studies. Over 185 major clinical and population biobanks in the Netherlands (size 500 subjects or more) are associated with BBMRI-NL.", 
            "cmd": null
        }
    ], 
    "toolType": [
        "Database portal"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3337", 
            "term": "Biobank"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [
        "BioMedBridges Tools"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://www.bbmri.nl/bbmri-nl-catalogue/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-S12-S12", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "The MOLGENIS toolkit: Rapid prototyping of biosoftware at the push of a button", 
                "abstract": "Background: There is a huge demand on bioinformaticians to provide their biologists with user friendly and scalable software infrastructures to capture, exchange, and exploit the unprecedented amounts of new *omics data. We here present MOLGENIS, a generic, open source, software toolkit to quickly produce the bespoke MOLecular GENetics Information Systems needed.Methods: The MOLGENIS toolkit provides bioinformaticians with a simple language to model biological data structures and user interfaces. At the push of a button, MOLGENIS' generator suite automatically translates these models into a feature-rich, ready-to-use web application including database, user interfaces, exchange formats, and scriptable interfaces. Each generator is a template of SQL, JAVA, R, or HTML code that would require much effort to write by hand. This 'model-driven' method ensures reuse of best practices and improves quality because the modeling language and generators are shared between all MOLGENIS applications, so that errors are found quickly and improvements are shared easily by a re-generation. A plug-in mechanism ensures that both the generator suite and generated product can be customized just as much as hand-written software.Results: In recent years we have successfully evaluated the MOLGENIS toolkit for the rapid prototyping of many types of biomedical applications, including next-generation sequencing, GWAS, QTL, proteomics and biobanking. Writing 500 lines of model XML typically replaces 15,000 lines of hand-written programming code, which allows for quick adaptation if the information system is not yet to the biologist's satisfaction. Each application generated with MOLGENIS comes with an optimized database back-end, user interfaces for biologists to manage and exploit their data, programming interfaces for bioinformaticians to script analysis tools in R, Java, SOAP, REST/JSON and RDF, a tab-delimited file format to ease upload and exchange of data, and detailed technical documentation. Existing databases can be quickly enhanced with MOLGENIS generated interfaces using the 'ExtractModel' procedure.Conclusions: The MOLGENIS toolkit provides bioinformaticians with a simple model to quickly generate flexible web platforms for all possible genomic, molecular and phenotypic experiments with a richness of interfaces not provided by other tools. All the software and manuals are available free as LGPLv3 open source at http://www.molgenis.org. © 2010 Swertz et al; licensee BioMed Central Ltd.", 
                "date": "2010-12-21T00:00:00Z", 
                "citationCount": 55, 
                "authors": [
                    {
                        "name": "Swertz M.A."
                    }, 
                    {
                        "name": "Dijkstra M."
                    }, 
                    {
                        "name": "Adamusiak T."
                    }, 
                    {
                        "name": "van der Velde J.K."
                    }, 
                    {
                        "name": "Kanterakis A."
                    }, 
                    {
                        "name": "Roos E.T."
                    }, 
                    {
                        "name": "Lops J."
                    }, 
                    {
                        "name": "Thorisson G.A."
                    }, 
                    {
                        "name": "Arends D."
                    }, 
                    {
                        "name": "Byelas G."
                    }, 
                    {
                        "name": "Muilu J."
                    }, 
                    {
                        "name": "Brookes A.J."
                    }, 
                    {
                        "name": "De Brock E.O."
                    }, 
                    {
                        "name": "Jansen R.C."
                    }, 
                    {
                        "name": "Parkinson H."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "VUMC", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "UGroningen", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "BioMedBridges", 
            "email": null, 
            "url": "http://www.biomedbridges.eu", 
            "orcidid": null, 
            "typeEntity": "Consortium", 
            "typeRole": [
                "Documentor"
            ], 
            "note": null
        }, 
        {
            "name": "Morris Swertz", 
            "email": "m.a.swertz@rug.nl", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "BioMedBridges", 
    "additionDate": "2015-02-04T09:14:53Z", 
    "lastUpdate": "2018-12-10T12:58:50Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 1, 
    "elixir_badge": 0
}