{
    "additionDate": "2018-07-22T09:46:00Z",
    "biotoolsCURIE": "biotools:miru-profiler",
    "biotoolsID": "miru-profiler",
    "credit": [
        {
            "email": "gilman.siu@polyu.edu.hk",
            "name": "Gilman Kit Hang Siu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "rahimrajwani@gmail.com",
            "name": "Rahim Rajwani",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Performs digital 24-loci MIRU-VNTR typing for Mycobacterium tuberculosis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/rahimrajwani/MIRU-profiler"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rahimrajwani/MIRU-profiler",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "MIRU-profiler",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.7717/peerj.5090",
            "metadata": {
                "abstract": "© 2018 Rajwani et al.Background. Tuberculosis (TB) resulted in an estimated 1.7 million deaths in the year 2016. The disease is caused by the members of Mycobacterium tuberculosis complex, which includes Mycobacterium tuberculosis, Mycobacterium bovis and other closely related TB causing organisms. In order to understand the epidemiological dynamics of TB, national TB control programs often conduct standardized genotyping at 24 Mycobacterial-Interspersed-Repetitive-Units (MIRU)-Variable-Number-of-Tandem- Repeats (VNTR) loci. With the advent of next generation sequencing technology, whole-genome sequencing (WGS) has been widely used for studying TB transmission. However, an open-source software that can connect WGS and MIRU-VNTR typing is currently unavailable, which hinders interlaboratory communication. In this manuscript, we introduce the MIRU-profiler program which could be used for prediction of MIRU-VNTR profile from WGS of M. tuberculosis. Implementation. The MIRU-profiler is implemented in shell scripting language and depends on EMBOSS software. The in-silico workflow of MIRU-profiler is similar to those described in the laboratory manuals for genotyping M. tuberculosis. Given an input genome sequence, the MIRU-profiler computes alleles at the standard 24-loci based on in-silico PCR amplicon lengths. The final output is a tab-delimited text file detailing the 24-loci MIRU-VNTR pattern of the input sequence. Validation. The MIRU-profiler was validated on four datasets: complete genomes from NCBI-GenBank (nD11), complete genomes for locally isolated strains sequenced using PacBio (nD4), complete genomes for BCG vaccine strains (nD2) and draft genomes based on 250 bp paired-end Illumina reads (nD106). Results. The digital MIRU-VNTR results were identical to the experimental genotyping results for complete genomes of locally isolated strains, BCG vaccine strains and five out of 11 genomes from the NCBI-GenBank. For draft genomes based on short Illumina reads, 21 out of 24 loci were inferred with a high accuracy, while a number of inaccuracies were recorded for three specific loci (ETRA, QUB11b and QUB26). One of the unique features of the MIRU-profiler was its ability to process multiple genomes in a batch. This feature was tested on all complete M. tuberculosis genome (nD157), for which results were successfully obtained in approximately 14 min. Conclusion. The MIRU-profiler is a rapid tool for inference of digital MIRU-VNTR profile from the assembled genome sequences. The tool can accurately infer repeat numbers at the standard 24 or 21/24 MIRU-VNTR loci from the complete or draft genomes respectively. Thus, the tool is expected to bridge the communication gap between the laboratories using WGS and those using the conventional MIRUVNTR typing.",
                "authors": [
                    {
                        "name": "Rajwani R."
                    },
                    {
                        "name": "Shehzad S."
                    },
                    {
                        "name": "Siu G.K.H."
                    }
                ],
                "citationCount": 9,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "MIRU-profiler: A rapid tool for determination of 24-loci MIRU-VNTR profiles from assembled genomes of Mycobacterium tuberculosis"
            },
            "pmcid": "PMC6045920",
            "pmid": "30018852"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 1
}