{
    "additionDate": "2019-11-14T19:56:17Z",
    "biotoolsCURIE": "biotools:DREAP",
    "biotoolsID": "DREAP",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'dose response analysis program', 'SF RBE NTCP TCP', 'RBE NTCP TCP', 'NTCP TCP' | A user-friendly program for the analyses of radiation-induced biological responses utilizing established deterministic models at cell population and organ scales | PURPOSE:To develop a user-friendly program for biological modeling to analyze radiation-induced responses at the scales of the cell population and organ. METHODS:The program offers five established cell population surviving fraction (SF) models to estimate the SF and the relative biological effectiveness (RBE) from clonogenic assay data, and two established models to calculate the normal tissue complication probability (NTCP) and tumor control probability (TCP) from radiation treatment plans. Users can also verify the results with multiple types of quantitative analyses and graphical representation tools",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31515012",
    "lastUpdate": "2019-11-14T19:56:17Z",
    "name": "DREAP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.EJMP.2019.06.013",
            "metadata": {
                "abstract": "© 2019 Associazione Italiana di Fisica MedicaPurpose: To develop a user-friendly program for biological modeling to analyze radiation-induced responses at the scales of the cell population and organ. Methods: The program offers five established cell population surviving fraction (SF) models to estimate the SF and the relative biological effectiveness (RBE) from clonogenic assay data, and two established models to calculate the normal tissue complication probability (NTCP) and tumor control probability (TCP) from radiation treatment plans. Users can also verify the results with multiple types of quantitative analyses and graphical representation tools. Results: Users can verify the estimated SF, model parameters, RBE, and the respective uncertainties in the calculations of the SF and RBE modes. The qualities of the treatment plans can also be compared with at most three rival plans in terms of the NTCP, TCP, uncomplicated TCP (UCP), and user-dependent weight-based UCP (UUCP), in the calculation of the NTCP and TCP modes. Based on the validation study on accuracy and speed, the averaged mean relative errors (MREs) of the estimated parameters for all tested cell lines were not higher than 0.3% in each of the studied SF models, and the averaged MREs of the calculated NTCP and TCP for all tested treatment plans were not higher than 0.1%. The computation times for SF, RBE, NTCP, and TCP were less than 1.5 s. Conclusions: The dose response analysis program can provide a trustworthy and convenient environment for researchers to analyze radiation-induced biological effects.",
                "authors": [
                    {
                        "name": "Lee K.-N."
                    },
                    {
                        "name": "Jung W.-G."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "Physica Medica",
                "title": "Dose response analysis program (DREAP): A user-friendly program for the analyses of radiation-induced biological responses utilizing established deterministic models at cell population and organ scales"
            },
            "pmid": "31515012"
        }
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        }
    ]
}