
{
    "credit": [
        {
            "email": "bruszczy@nencki.gov.pl",
            "name": "Błażej Ruszczycki",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "t.bernas@nencki.gov.pl",
            "name": "Tytus Bernas",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Script"
        ],
        "topic": [
            {
                "term": "Biological imaging",
                "uri": "http://edamontology.org/topic_3383"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation Fluorescence localization microscopy is extensively used to study the details of spatial architecture of subcellular compartments. This modality relies on determination of spatial positions of fluorophores, labeling an extended biological structure, with precision exceeding the diffraction limit. Several established models describe influence of pixel size, signal-to-noise ratio and optical resolution on the localization precision. The labeling density has been also recognized as important factor affecting reconstruction fidelity of the imaged biological structure. However, quantitative data on combined influence of sampling and localization errors on the fidelity of reconstruction are scarce. It should be noted that processing localization microscopy data is similar to reconstruction of a continuous (extended) non-periodic signal from a non-uniform, noisy point samples. In two dimensions the problem may be formulated within the framework of matrix completion. However, no systematic approach has been adopted in microscopy, where images are typically rendered by representing localized molecules with Gaussian distributions (widths determined by localization precision). Results We analyze the process of two-dimensional reconstruction of extended biological structures as a function of the density of registered emitters, localization precision and the area occupied by the rendered localized molecule. We quantify overall reconstruction fidelity with different established image similarity measures. Furthermore, we analyze the recovered similarity measure in the frequency space for different reconstruction protocols. We compare the cut-off frequency to the limiting sampling frequency, as determined by labeling density.",
            "authors": [
                "Ruszczycki B.",
                "Bernas T."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btx597",
            "journal": "Bioinformatics",
            "title": "Quality of biological images, reconstructed using localization microscopy data",
            "year": "2018-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:qbioimages",
        "biotoolsID": "qbioimages",
        "description": "Quality of biological images, reconstructed using localization microscopy data.",
        "homepage": "https://github.com/blazi13/qbioimages/blob/master/storm_simulation_movie.py",
        "name": "qbioimages"
    }
}