{
    "additionDate": "2020-01-09T17:57:37Z",
    "biotoolsCURIE": "biotools:moiety_modeling",
    "biotoolsID": "moiety_modeling",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hunter.moseley@uky.edu",
            "name": "Hunter N. B. Moseley",
            "orcidid": "https://orcid.org/0000-0003-3995-5368",
            "typeEntity": "Person"
        }
    ],
    "description": "Moiety modeling framework for deriving moiety abundances from mass spectrometry measured isotopologues.\n\nMoiety Modeling implemented in Python.\n\nmoiety_modeling package provides facilities for moiety model representation, model optimization and model selection.\n\nWelcome to moiety_modeling’s documentation! — moiety_modeling 1.0.3.2 documentation.\n\nThe model selection results produced by moiety_modeling framework using the UDP-GlcNAc isotopologue datasets.\n\n‘moiety_modeling’ runs under Python 3.6+ and is available through python3-pip. Install via pip or clone the git repo and install the following depencies and you are ready to go!.\n\nWelcome to moiety_modeling’s documentation!¶.\n\n'moiety_modeling' runs under Python 3.6+ and is available through python3-pip. Install via pip or clone the git repo and install the following depencies and you are ready to go!.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://moiety-modeling.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                }
            ]
        }
    ],
    "homepage": "https://figshare.com/articles/moiety_modeling_framework/7886135",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T10:01:44Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MoseleyBioinformaticsLab/moiety_modeling"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/moiety-modeling/"
        }
    ],
    "name": "moiety_modeling",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3096-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Stable isotope tracing can follow individual atoms through metabolic transformations through the detection of the incorporation of stable isotope within metabolites. This resulting data can be interpreted in terms related to metabolic flux. However, detection of a stable isotope in metabolites by mass spectrometry produces a profile of isotopologue peaks that requires deconvolution to ascertain the localization of isotope incorporation. Results: To aid the interpretation of the mass spectroscopy isotopologue profile, we have developed a moiety modeling framework for deconvoluting metabolite isotopologue profiles involving single and multiple isotope tracers. This moiety modeling framework provides facilities for moiety model representation, moiety model optimization, and moiety model selection. The moiety_modeling package was developed from the idea of metabolite decomposition into moiety units based on metabolic transformations, i.e. a moiety model. The SAGA-optimize package, solving a boundary-value inverse problem through a combined simulated annealing and genetic algorithm, was developed for model optimization. Additional optimization methods from the Python scipy library are utilized as well. Several forms of the Akaike information criterion and Bayesian information criterion are provided for selecting between moiety models. Moiety models and associated isotopologue data are defined in a JSONized format. By testing the moiety modeling framework on the timecourses of 13C isotopologue data for uridine diphosphate N-acetyl-D-glucosamine (UDP-GlcNAc) in human prostate cancer LnCaP-LN3 cells, we were able to confirm its robust performance in isotopologue deconvolution and moiety model selection. Conclusions: SAGA-optimize is a useful Python package for solving boundary-value inverse problems, and the moiety_modeling package is an easy-to-use tool for mass spectroscopy isotopologue profile deconvolution involving single and multiple isotope tracers. Both packages are freely available on GitHub and via the Python Package Index.",
                "authors": [
                    {
                        "name": "Jin H."
                    },
                    {
                        "name": "Moseley H.N.B."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Moiety modeling framework for deriving moiety abundances from mass spectrometry measured isotopologues"
            },
            "pmcid": "PMC6816163",
            "pmid": "31660850"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
