{
    "additionDate": "2021-10-25T05:41:02.460209Z",
    "biotoolsCURIE": "biotools:multiverse",
    "biotoolsID": "multiverse",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leo.pio.lopez@gmail.com",
            "name": "Léo Pio-Lopez",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MultiVERSE is a multiplex and multiplex-heterogeneous network embedding approach. Embedding of Monoplex, Multiplex, Heterogeneous, Multiplex-Heterogeneous and full Multiplex-Heterogeneous Networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Lpiol/MultiVERSE",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-10-25T05:41:02.463475Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/LPioL/MultiVERSE/issues"
        }
    ],
    "name": "MultiVERSE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-021-87987-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Network embedding approaches are gaining momentum to analyse a large variety of networks. Indeed, these approaches have demonstrated their effectiveness in tasks such as community detection, node classification, and link prediction. However, very few network embedding methods have been specifically designed to handle multiplex networks, i.e. networks composed of different layers sharing the same set of nodes but having different types of edges. Moreover, to our knowledge, existing approaches cannot embed multiple nodes from multiplex-heterogeneous networks, i.e. networks composed of several multiplex networks containing both different types of nodes and edges. In this study, we propose MultiVERSE, an extension of the VERSE framework using Random Walks with Restart on Multiplex (RWR-M) and Multiplex-Heterogeneous (RWR-MH) networks. MultiVERSE is a fast and scalable method to learn node embeddings from multiplex and multiplex-heterogeneous networks. We evaluate MultiVERSE on several biological and social networks and demonstrate its performance. MultiVERSE indeed outperforms most of the other methods in the tasks of link prediction and network reconstruction for multiplex network embedding, and is also efficient in link prediction for multiplex-heterogeneous network embedding. Finally, we apply MultiVERSE to study rare disease-gene associations using link prediction and clustering. MultiVERSE is freely available on github at https://github.com/Lpiol/MultiVERSE.",
                "authors": [
                    {
                        "name": "Pio-Lopez L."
                    },
                    {
                        "name": "Valdeolivas A."
                    },
                    {
                        "name": "Tichit L."
                    },
                    {
                        "name": "Remy E."
                    },
                    {
                        "name": "Baudot A."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "MultiVERSE: a multiplex and multiplex-heterogeneous network embedding approach"
            },
            "pmcid": "PMC8062697",
            "pmid": "33888761",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        }
    ]
}