{
    "additionDate": "2017-03-25T16:30:04Z",
    "biotoolsCURIE": "biotools:xxmotif",
    "biotoolsID": "xxmotif",
    "credit": [
        {
            "email": "xxmotif@genzentrum.lmu.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mpibpc.mpg.de/soeding"
        }
    ],
    "description": "Web server that can discover motifs that are enriched in sets of nucleotide sequences provided by the user. It uses a new approach for finding enriched motifs: It directly optimizes the statistical significance of enrichment for PWMs. It can also score conservation and positional clustering of motifs. In several benchmarks on yeast and metazoan sequences, the underlying XXmotif method showed better sensitivity and produced PWMs of higher quality than state-of-the-art tools.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://xxmotif.genzentrum.lmu.de/index.php?id=about"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://xxmotif.genzentrum.lmu.de/index.php?id=faq"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://bammmotif.mpibpc.mpg.de/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-01-09T15:32:28Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/xxmotif-exhaustive-weight-matrix-based-motif-discovery-nucleotide-sequences.html"
        }
    ],
    "name": "XXmotif",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gks602",
            "metadata": {
                "abstract": "The discovery of regulatory motifs enriched in sets of DNA or RNA sequences is fundamental to the analysis of a great variety of functional genomics experiments. These motifs usually represent binding sites of proteins or non-coding RNAs, which are best described by position weight matrices (PWMs). We have recently developed XXmotif, a de novo motif discovery method that is able to directly optimize the statistical significance of PWMs. XXmotif can also score conservation and positional clustering of motifs. The XXmotif server provides (i) a list of significantly overrepresented motif PWMs with web logos and E-values; (ii) a graph with color-coded boxes indicating the positions of selected motifs in the input sequences; (iii) a histogram of the overall positional distribution for selected motifs and (iv) a page for each motif with all significant motif occurrences, their P-values for enrichment, conservation and localization, their sequence contexts and coordinates. Free access: http://xxmotif.genzentrum.lmu.de. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Luehr S."
                    },
                    {
                        "name": "Hartmann H."
                    },
                    {
                        "name": "Soding J."
                    }
                ],
                "citationCount": 30,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The XXmotif web server for eXhaustive, weight matriX-based motif discovery in nucleotide sequences"
            },
            "pmcid": "PMC3394272",
            "pmid": "22693218",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "To analyze gene regulatory networks, the sequence-dependent DNA/RNA binding affinities of proteins and noncoding RNAs are crucial. Often, these are deduced from sets of sequences enriched in factor binding sites. Two classes of computational approaches exist. The first describe binding motifs by sequence patterns and search the patterns with highest statistical significance for enrichment. The second class uses the more powerful position weight matrices (PWMs). Instead of maximizing the statistical significance of enrichment, they maximize a likelihood. Here we present XXmotif (eXhaustive evaluation of matriX motifs), the first PWM-based motif discovery method that can optimize PWMs by directly minimizing their P-values of enrichment. Optimization requires computing millions of enrichment P-values for thousands of PWMs. For a given PWM, the enrichment P-value is calculated efficiently from the match P-values of all possible motif placements in the input sequences using order statistics. The approach can naturally combine P-values for motif enrichment, conservation, and localization. On ChIP-chip/seq, miRNA knock-down, and coexpression data sets from yeast and metazoans, XXmotif outperformed state-of-the-art tools, both in numbers of correctly identified motifs and in the quality of PWMs. In segmentation modules of D. melanogaster, we detect the known key regulators and several new motifs. In human core promoters, XXmotif reports most previously described and eight novel motifs sharply peaked around the transcription start site, among them an Initiator motif similar to the fly and yeast versions. XXmotif's sensitivity, reliability, and usability will help to leverage the quickly accumulating wealth of functional genomics data.",
                "authors": [
                    {
                        "name": "Hartmann H."
                    },
                    {
                        "name": "Guthohrlein E.W."
                    },
                    {
                        "name": "Siebert M."
                    },
                    {
                        "name": "Luehr S."
                    },
                    {
                        "name": "Soding J."
                    }
                ],
                "citationCount": 43,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "P-value-based regulatory motif discovery using positional weight matrices"
            },
            "pmid": "22990209",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}