{
    "additionDate": "2019-11-14T19:56:21Z",
    "biotoolsCURIE": "biotools:GripDL",
    "biotoolsID": "GripDL",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hbshen@sjtu.edu.cn",
            "name": "Hong-Bin Shen",
            "orcidid": "https://orcid.org/0000-0002-4029-3325",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting gene regulatory interactions based on spatial gene expression data and deep learning | Gene regulatory interaction prediction through Deep Learning | Gene regulatory interaction prediction through Deep Learning By Qingwei Fang, 2018",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://github.com/2010511951/GripDL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-07T08:14:07Z",
    "name": "GripDL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007324",
            "metadata": {
                "abstract": "© 2019 Yang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Reverse engineering of gene regulatory networks (GRNs) is a central task in systems biology. Most of the existing methods for GRN inference rely on gene co-expression analysis or TF-target binding information, where the determination of co-expression is often unreliable merely based on gene expression levels, and the TF-target binding data from high-throughput experiments may be noisy, leading to a high ratio of false links and missed links, especially for large-scale networks. In recent years, the microscopy images recording spatial gene expression have become a new resource in GRN reconstruction, as the spatial and temporal expression patterns contain much abundant gene interaction information. Till now, the spatial expression resources have been largely underexploited, and only a few traditional image processing methods have been employed in the image-based GRN reconstruction. Moreover, co-expression analysis using conventional measurements based on image similarity may be inaccurate, because it is the local-pattern consistency rather than global-image-similarity that determines gene-gene interactions. Here we present GripDL (Gene regulatory interaction prediction via Deep Learning), which incorporates high-confidence TF-gene regulation knowledge from previous studies, and constructs GRNs for Drosophila eye development based on Drosophila embryonic gene expression images. Benefitting from the powerful representation ability of deep neural networks and the supervision information of known interactions, the new method outperforms traditional methods with a large margin and reveals new intriguing knowledge about Drosophila eye development.",
                "authors": [
                    {
                        "name": "Fang Q."
                    },
                    {
                        "name": "Shen H.-B."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "citationCount": 8,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Predicting gene regulatory interactions based on spatial gene expression data and deep learning"
            },
            "pmcid": "PMC6764701",
            "pmid": "31527870"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
