{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cibiv.at/"}],"function":[{"operation":[{"term":"Multiple alignment","uri":"http://edamontology.org/operation_0492"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Phylogeny","uri":"http://edamontology.org/topic_0084"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Sequences","uri":"http://edamontology.org/topic_0080"},{"term":"Phylogeny reconstruction","uri":"http://edamontology.org/topic_0084"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/alifritz-1-0-statistical-multiple-alignment-phylogeny-reconstruction.html"}],"publication":[{"abstract":"Although the reconstruction of phylogenetic trees and the computation of multiple sequence alignments are highly interdependent, these two areas of research lead quite separate lives, the former often making use of stochastic modeling, whereas the latter normally does not. Despite the fact that reasonable insertion and deletion models for sequence pairs were already introduced more than 10 years ago, they have only recently been applied to multiple alignment and only in their simplest version. In this paper we present and discuss a strategy based on simulated annealing, which makes use of these models to infer a phylogenetic tree for a set of DNA or protein sequences together with the sequences' indel history, i.e., their multiple alignment augmented with information about the positioning of insertion and deletion events in the tree. Our method is also the first application of the TKF2 model in the context of multiple sequence alignment. We validate the method via simulations and illustrate it using a data set of primate mtDNA. Copyright © Society of Systematic Biologists.","authors":["Fleissner R.","Metzler D.","Von Haeseler A."],"cit_count":67,"doi":"10.1080/10635150590950371","journal":"Systematic Biology","pmid":"16085574","title":"Simultaneous statistical multiple alignment and phylogeny reconstruction","type":"Primary","year":"2005-08-01"}],"summary":{"biotoolsCURIE":"biotools:alifritz","biotoolsID":"alifritz","description":"ALIFRITZ performs statistical multiple alignment and phylogeny reconstruction simultaneously. It  implements a strategy based on simulated annealing which makes use of these models to infer a phylogenetic tree for a set of DNA or protein sequences together with the sequences’ indel history, i.e. their multiple alignment augmented with information about the positioning of insertion and deletion events in the tree.","homepage":"http://www.cibiv.at/software/alifritz/","name":"ALIFRITZ","version":["1.0"]}}