{
    "additionDate": "2018-05-22T18:29:45Z",
    "biotoolsCURIE": "biotools:quantworm",
    "biotoolsID": "quantworm",
    "credit": [
        {
            "email": "Weiwei.Zhong@rice.edu",
            "name": "Weiwei Zhong",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comprehensive Software Package for Caenorhabditis elegans Phenotypic Assays.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.quantworm.org/Manual/QuantWorm_User_Manual_25__12-06-2015.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://www.quantworm.org/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-3.0",
    "name": "QuantWorm",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0084830",
            "metadata": {
                "abstract": "Phenotypic assays are crucial in genetics; however, traditional methods that rely on human observation are unsuitable for quantitative, large-scale experiments. Furthermore, there is an increasing need for comprehensive analyses of multiple phenotypes to provide multidimensional information. Here we developed an automated, high-throughput computer imaging system for quantifying multiple Caenorhabditis elegans phenotypes. Our imaging system is composed of a microscope equipped with a digital camera and a motorized stage connected to a computer running the QuantWorm software package. Currently, the software package contains one data acquisition module and four image analysis programs: WormLifespan, WormLocomotion, WormLength, and WormEgg. The data acquisition module collects images and videos. The WormLifespan software counts the number of moving worms by using two time-lapse images; the WormLocomotion software computes the velocity of moving worms; the WormLength software measures worm body size; and the WormEgg software counts the number of eggs. To evaluate the performance of our software, we compared the results of our software with manual measurements. We then demonstrated the application of the QuantWorm software in a drug assay and a genetic assay. Overall, the QuantWorm software provided accurate measurements at a high speed. Software source code, executable programs, and sample images are available at www.quantworm.org. Our software package has several advantages over current imaging systems for C. elegans. It is an all-in-one package for quantifying multiple phenotypes. The QuantWorm software is written in Java and its source code is freely available, so it does not require use of commercial software or libraries. It can be run on multiple platforms and easily customized to cope with new methods and requirements. © 2014 Jung et al.",
                "authors": [
                    {
                        "name": "Aleman-Meza B."
                    },
                    {
                        "name": "Jung S.-K."
                    },
                    {
                        "name": "Riepe C."
                    },
                    {
                        "name": "Zhong W."
                    }
                ],
                "citationCount": 32,
                "date": "2014-01-08T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "QuantWorm: A comprehensive software package for Caenorhabditis elegans phenotypic assays"
            },
            "pmcid": "PMC3885606",
            "pmid": "24416295"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phenomics",
            "uri": "http://edamontology.org/topic_3298"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
