{
    "additionDate": "2017-12-18T00:05:12Z",
    "biotoolsCURIE": "biotools:chemt",
    "biotoolsID": "chemt",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.esa.ipb.pt/medchem/"
        }
    ],
    "description": "ChemT is an open-source software for building chemical compound libraries, based on a specific chemical template. The compound libraries generated can then be evaluated, using several Virtual Screening tools like molecular docking or QSAR modelling tools.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://www.esa.ipb.pt/biochemcore/index.php/ds/c",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/chemt-build-template-based-3d-chemical-libraries.html"
        }
    ],
    "name": "ChemT",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1080/1062936X.2011.604097",
            "metadata": {
                "abstract": "In computational chemistry, vast quantities of compounds are generated, and there is a need for cheminformatic tools to efficiently build chemical compound libraries. Several software tools for drawing and editing compound structures are available, but they lack options for automatic generation of chemical libraries. We have implemented ChemT, an easy-to-use open-source software tool that automates the process of preparing custom-made template-based chemical libraries. ChemT automatically generates three-dimensional chemical libraries by inputting a chemical template and the functional groups of interest. The graphical user interface of ChemT is self-explanatory, and a complete tutorial is provided. Several file formats are accepted by ChemT, and it is possible to filter the generated compounds according to different physicochemical properties. The compounds can be subject to force field minimization, and the resulting threedimensional structures recorded on commonly used file formats. ChemT may be a valuable tool for investigators interested in using in silico virtual screening tools, such as quantitative structure-activity relationship modelling or molecular docking, in order to prioritize compounds for further chemical synthesis. To demonstrate the usefulness of ChemT, we describe an example based on a thieno[3,2-b]pyridine template. ChemT is available free of charge from our website at http://www.esa.ipb.pt/_ruiabreu/chemt. © 2011 Taylor & Francis.",
                "authors": [
                    {
                        "name": "Abreu R.M.V."
                    },
                    {
                        "name": "Froufe H.J.C."
                    },
                    {
                        "name": "Daniel P.O.M."
                    },
                    {
                        "name": "Queiroz M.J.R.P."
                    },
                    {
                        "name": "Ferreira I.C.F.R."
                    }
                ],
                "citationCount": 8,
                "date": "2011-09-01T00:00:00Z",
                "journal": "SAR and QSAR in Environmental Research",
                "title": "Chemt, an open-source software for building template-based chemical libraries"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular docking",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.0"
    ]
}