
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sourceforge.net/projects/solodel/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/p/solodel/wiki/Home/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/solodel-somatic-low-frequent-deletion-caller-model.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015.Motivation: Finding somatic mutations from massively parallel sequencing data is becoming a standard process in genome-based biomedical studies. There are a number of robust methods developed for detecting somatic single nucleotide variations However, detection of somatic copy number alteration has been substantially less explored and remains vulnerable to frequently raised sampling issues: low frequency in cell population and absence of the matched control samples. Results: We developed a novel computational method SoloDel that accurately classifies low-frequent somatic deletions from germline ones with or without matched control samples. We first constructed a probabilistic, somatic mutation progression model that describes the occurrence and propagation of the event in the cellular lineage of the sample. We then built a Gaussian mixture model to represent the mixed population of somatic and germline deletions. Parameters of the mixture model could be estimated using the expectation-maximization algorithm with the observed distribution of read-depth ratios at the points of discordant-read based initial deletion calls. Combined with conventional structural variation caller, SoloDel greatly increased the accuracy in classifying somatic mutations. Even without control, SoloDel maintained a comparable performance in a wide range of mutated subpopulation size (10-70%). SoloDel could also successfully recall experimentally validated somatic deletions from previously reported neuropsychiatric whole-genome sequencing data.",
            "authors": [
                "Kim J.",
                "Kim S.",
                "Nam H.",
                "Kim S.",
                "Lee D."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "26071141",
            "title": "SoloDel: A probabilistic model for detecting low-frequent somatic deletions from unmatched sequencing data",
            "year": "2015-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:solodel",
        "biotoolsID": "solodel",
        "description": "A  somatic deletion caller designed for whole-genome sequencing data from unmatched samples. SoloDel is specialized for identifying somatic deletions with frequently existing sampling issues : low mutational frequency in cell population and absence of the matched control samples.",
        "homepage": "http://sourceforge.net/projects/solodel/",
        "name": "SoloDel"
    }
}