{
    "additionDate": "2021-01-18T11:28:36Z",
    "biotoolsCURIE": "biotools:dinax",
    "biotoolsID": "dinax",
    "confidence_flag": "tool",
    "description": "DINAX is a comprehensive database of inherited ataxias.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "http://slsdb.manipal.edu/dinax",
    "language": [
        "SQL",
        "PHP",
        "JavaScript"
    ],
    "lastUpdate": "2021-03-01T09:11:27Z",
    "name": "DINAX",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2020.104000",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdBackground: Neurodegenerative disorders such as hereditary ataxia often manifest overlapping symptoms and are likely to be misdiagnosed based on clinical phenotypes. To identify the genes associated with such disorders for diagnostic purposes, geneticists often use high throughput technologies which generate an enormous amount of data on variants whose relevance can be unclear. Besides, analysis and interpretation of high throughput data require gleaning of several web-based resources which can be laborious and time-consuming. To overcome these, we have created a Database for Inherited Ataxia (DINAX), a repository of gene variants from publicly available information. Methods: DINAX is implemented as a MySQL relational database using the PHP scripting language. Web interfaces were developed using HTML, CSS, and JavaScript. Variant and phenotype information was collected and manually curated from published literature and primary databases such as OMIM and ClinVar. These were further analyzed to decipher expression and pathway analysis. Results: DINAX is an inventory of 7166 genomic variants (single nucleotide polymorphisms, deletions, insertions, and translocations) reported till date among the 185 genes associated with different subtypes of inherited ataxia. DINAX implements a dual search methodology for genes and phenotypes linking to ataxia associated genes, variants, and their source. Pathway analysis confirmed their association with ataxia. Conclusion: The database is created to provide a single web source for obtaining information about ataxia related genes. Besides, the database facilitates easy identification of known and reported variants as well as the novel or unreported variants. DINAX is freely available at http://slsdb.manipal.edu/dinax.",
                "authors": [
                    {
                        "name": "Chaudhari S."
                    },
                    {
                        "name": "Naha R."
                    },
                    {
                        "name": "Mukherjee S."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Jayaram P."
                    },
                    {
                        "name": "Mallya S."
                    },
                    {
                        "name": "Chakrabarty S."
                    },
                    {
                        "name": "Satyamoorthy K."
                    }
                ],
                "date": "2020-11-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "DINAX– a comprehensive database of inherited ataxias"
            },
            "pmid": "33007622"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}