{
    "additionDate": "2019-11-14T19:44:35Z",
    "biotoolsCURIE": "biotools:MiDRMpol",
    "biotoolsID": "MiDRMpol",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "shambhu.aralaguppe@gmail.com",
            "name": "Shambhu G. Aralaguppe",
            "typeEntity": "Person"
        }
    ],
    "description": "A High-Throughput Multiplexed Amplicon Sequencing Workflow to Quantify HIV-1 Drug Resistance Mutations against Protease, Reverse Transcriptase, and Integrase Inhibitors | A high-throughput multiplexed amplicon sequencing workflow to quantify drug resistance mutations (DRMs) against protease, reverse transcriptase and integrase inhibitors. MiDRMpol is computational as well as labor efficient bioinformatics pipeline to detect DRMs from HTS data.The method can be incorporated in large scale surveillance of HIV-1 DRMs",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/neogilab/MiDRMPol",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2019-11-14T19:44:35Z",
    "name": "MiDRMpol",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/V11090806",
            "metadata": {
                "abstract": "The detection of drug resistance mutations (DRMs) in minor viral populations is of potential clinical importance. However, sophisticated computational infrastructure and competence for analysis of high-throughput sequencing (HTS) data lack at most diagnostic laboratories. Thus, we have proposed a new pipeline, MiDRMpol, to quantify DRM from the HIV-1 pol region. The gag-vpu region of 87 plasma samples from HIV-infected individuals from three cohorts was amplified and sequenced by Illumina HiSeq2500. The sequence reads were adapter-trimmed, followed by analysis using in-house scripts. Samples from Swedish and Ethiopian cohorts were also sequenced by Sanger sequencing. The pipeline was validated against the online tool PASeq (Polymorphism Analysis by Sequencing). Based on an error rate of <1%, a value of >1% was set as reliable to consider a minor variant. Both pipelines detected the mutations in the dominant viral populations, while discrepancies were observed in minor viral populations. In five HIV-1 subtype C samples, minor mutations were detected at the <5% level by MiDRMpol but not by PASeq. MiDRMpol is a computationally as well as labor efficient bioinformatics pipeline for the detection of DRM from HTS data. It identifies minor viral populations (<20%) of DRMs. Our method can be incorporated into large-scale surveillance of HIV-1 DRM.",
                "authors": [
                    {
                        "name": "Aralaguppe S.G."
                    },
                    {
                        "name": "Ambikan A.T."
                    },
                    {
                        "name": "Ashokkumar M."
                    },
                    {
                        "name": "Kumar M.M."
                    },
                    {
                        "name": "Hanna L.E."
                    },
                    {
                        "name": "Amogne W."
                    },
                    {
                        "name": "Sonnerborg A."
                    },
                    {
                        "name": "Neogi U."
                    }
                ],
                "date": "2019-08-30T00:00:00Z",
                "journal": "Viruses",
                "title": "MiDRMpol: A High-Throughput Multiplexed Amplicon Sequencing Workflow to Quantify HIV-1 Drug Resistance Mutations against Protease, Reverse Transcriptase, and Integrase Inhibitors"
            },
            "pmcid": "PMC6784143",
            "pmid": "31480341"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ]
}