
{
    "credit": [
        {
            "typeRoles": [
            ],
            "url": "https://www.ebi.ac.uk/about/contact"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "https://www.ebi.ac.uk/complexportal/download"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Text data",
                        "uri": "http://edamontology.org/data_2526"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein interaction data",
                        "uri": "http://edamontology.org/data_0906"
                    },
                    "format": [
                        {
                            "term": "PSI MI XML (MIF)",
                            "uri": "http://edamontology.org/format_3158"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein interaction data",
                        "uri": "http://edamontology.org/data_0906"
                    },
                    "format": [
                        {
                            "term": "JSON",
                            "uri": "http://edamontology.org/format_3464"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "license": "CC-BY-4.0",
        "maturity": "Emerging",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application",
            "Web service",
            "Database portal"
        ],
        "topic": [
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            }
        ]
    },
    "link": [
        {
            "note": "Github organisation of the Complex Portal.",
            "type": "Repository",
            "url": "https://github.com/Complex-Portal"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2014. The IntAct molecular interaction database has created a new, free, open-source, manually curated resource, the Complex Portal (www.ebi.ac.uk/intact/complex), through which protein complexes frommajor model organisms are being collated and made available for search, viewing and download. It has been built in close collaboration with other bioinformatics services and populated with data from ChEMBL, MatrixDB, PDBe, Reactome and UniProtKB. Each entry contains information about the participating molecules (including small molecules and nucleic acids), their stoichiometry, topology and structural assembly. Complexes are annotated with details about their function, properties and complex-specific Gene Ontology (GO) terms. Consistent nomenclature is used throughout the resource with systematic names, recommended names and a list of synonyms all provided. The use of the Evidence Code Ontology allows us to indicate for which entries direct experimental evidence is available or if the complex has been inferred based on homology or orthology. The data are searchable using standard identifiers, such as UniProt, ChEBI and GO IDs, protein, gene and complex names or synonyms. This reference resource will be maintained and grow to encompass an increasing number of organisms. Input from groups and individuals with specific areas of expertise is welcome.",
            "authors": [
                "Meldal B.H.M.",
                "Forner-Martinez O.",
                "Costanzo M.C.",
                "Dana J.",
                "Demeter J.",
                "Dumousseau M.",
                "Dwight S.S.",
                "Gaulton A.",
                "Licata L.",
                "Melidoni A.N.",
                "Ricard-Blum S.",
                "Roechert B.",
                "Skyzypek M.S.",
                "Tiwari M.",
                "Velankar S.",
                "Wong E.D.",
                "Hermjakob H.",
                "Orchard S."
            ],
            "cit_count": 33,
            "doi": "10.1093/nar/gku975",
            "journal": "Nucleic Acids Research",
            "title": "The complex portal - An encyclopaedia of macromolecular complexes",
            "type": "Primary",
            "year": "2015-01-28"
        },
        {
            "abstract": "© 2018 The Author(s). The Complex Portal (www.ebi.ac.uk/complexportal) is a manually curated, encyclopaedic database that collates and summarizes information on stable, macromolecular complexes of known function. It captures complex composition, topology and function and links out to a large range of domain-specific resources that hold more detailed data, such as PDB or Reactome. We have made several significant improvements since our last update, including improving compliance to the FAIR data principles by providing complex-specific, stable identifiers that include versioning. Protein complexes are now available from 20 species for download in standardscompliant formats such as PSI-XML, MI-JSON and ComplexTAB or can be accessed via an improved REST API. A component-based JS front-end framework has been implemented to drive a new website and this has allowed the use of APIs from linked services to import and visualize information such as the 3D structure of protein complexes, its role in reactions and pathways and the co-expression of complex components in the tissues of multi-cellular organisms. A first draft of the complete complexome of Saccharomyces cerevisiae is now available to browse and download.",
            "authors": [
                "Meldal B.H.M.",
                "Bye-A-Jee H.",
                "Gajdos L.",
                "Hammerova Z.",
                "Horackova A.",
                "Melicher F.",
                "Perfetto L.",
                "Pokorny D.",
                "Lopez M.R.",
                "Turkova A.",
                "Wong E.D.",
                "Xie Z.",
                "Casanova E.B.",
                "Del-Toro N.",
                "Koch M.",
                "Porras P.",
                "Hermjakob H.",
                "Orchard S."
            ],
            "cit_count": 5,
            "doi": "10.1093/nar/gky1001",
            "journal": "Nucleic Acids Research",
            "title": "Complex Portal 2018: Extended content and enhanced visualization tools for macromolecular complexes",
            "type": "Review",
            "year": "2019-01-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Complex_Portal",
        "biotoolsID": "Complex_Portal",
        "description": "The Complex Portal is a manually curated, encyclopaedic resource of macromolecular complexes from a number of key model organisms. The majority of complexes are made up of proteins but may also include nucleic acids or small molecules. All data is freely available for search and download.",
        "homepage": "https://www.ebi.ac.uk/complexportal/",
        "name": "Complex Portal"
    }
}