{
    "additionDate": "2017-08-03T19:06:22Z",
    "biotoolsCURIE": "biotools:illumina",
    "biotoolsID": "illumina",
    "credit": [
        {
            "email": "bioinf@wehi.edu.au",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinf.wehi.edu.au/"
        }
    ],
    "description": "R Library for preprocessing Illumina Whole Genome Expression BeadChips.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinf.wehi.edu.au/illumina/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.wehi.edu.au/illumina/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/illumina-1-0-4-preprocessing-illumina-genome-expression-beadchips.html"
        }
    ],
    "name": "illumina",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Illumina Sentrix-6 Whole-Genome Expression BeadChips are relatively new microarray platforms which have been used in many microarray studies in the past few years. These Chips have a unique design in which each Chip contains six microarrays and each microarray consists of two separate physical strips, posing special challenges for precise between-array normalization of expression values. Results: None of the normalization strategies proposed so far for this microarray platform allow for the possibility of systematic variation between the two strips comprising each array. That this variation can be substantial is illustrated by a data example. We demonstrate that normalizing at the strip-level rather than at the array-level can effectively remove this between-strip variation, improve the precision of gene expression measurements and discover more differentially expressed genes. The gain is substantial, yielding a 20% increase in statistical information and doubling the number of genes detected at a 5% false discovery rate. Functional analysis reveals that the extra genes found tend to have interesting biological meanings, dramatically strengthening the biological conclusions from the experiment. Strip-level normalization still outperforms array-level normalization when non-expressed probes are filtered out. Conclusion: Plots are proposed which demonstrate how the need for strip-level normalization relates to inconsistent intensity range variation between the strips. Strip-level normalization is recommended for the preprocessing of Illumina Sentrix-6 BeadChips whenever the intensity range is seen to be inconsistent between the strips. R code is provided to implement the recommended plots and normalization algorithms. © 2009 Shi et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Banerjee A."
                    },
                    {
                        "name": "Gerondakis S."
                    },
                    {
                        "name": "Ritchie M.E."
                    },
                    {
                        "name": "Shi W."
                    },
                    {
                        "name": "Smyth G.K."
                    }
                ],
                "citationCount": 19,
                "date": "2009-11-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Illumina WG-6 BeadChip strips should be normalized separately"
            },
            "pmid": "19903361"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
