{"credit":[],"download":[{"type":"Source code","url":"http://bitbucket.org/woalsdnd/refuge/src"}],"function":[{"operation":[{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"},{"term":"Image annotation","uri":"http://edamontology.org/operation_3553"},{"term":"Anonymisation","uri":"http://edamontology.org/operation_3283"}]}],"labels":{"topic":[{"term":"Medical imaging","uri":"http://edamontology.org/topic_3384"},{"term":"Opthalmology","uri":"http://edamontology.org/topic_3417"},{"term":"Biomarkers","uri":"http://edamontology.org/topic_3360"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"}]},"link":[{"type":"OTHER","url":"https://refuge.grand-challenge.org/Home/"}],"publication":[{"abstract":"© 2019Glaucoma is one of the leading causes of irreversible but preventable blindness in working age populations. Color fundus photography (CFP) is the most cost-effective imaging modality to screen for retinal disorders. However, its application to glaucoma has been limited to the computation of a few related biomarkers such as the vertical cup-to-disc ratio. Deep learning approaches, although widely applied for medical image analysis, have not been extensively used for glaucoma assessment due to the limited size of the available data sets. Furthermore, the lack of a standardize benchmark strategy makes difficult to compare existing methods in a uniform way. In order to overcome these issues we set up the Retinal Fundus Glaucoma Challenge, REFUGE (https://refuge.grand-challenge.org), held in conjunction with MICCAI 2018. The challenge consisted of two primary tasks, namely optic disc/cup segmentation and glaucoma classification. As part of REFUGE, we have publicly released a data set of 1200 fundus images with ground truth segmentations and clinical glaucoma labels, currently the largest existing one. We have also built an evaluation framework to ease and ensure fairness in the comparison of different models, encouraging the development of novel techniques in the field. 12 teams qualified and participated in the online challenge. This paper summarizes their methods and analyzes their corresponding results. In particular, we observed that two of the top-ranked teams outperformed two human experts in the glaucoma classification task. Furthermore, the segmentation results were in general consistent with the ground truth annotations, with complementary outcomes that can be further exploited by ensembling the results.","authors":["Orlando J.I.","Fu H.","Barbossa Breda J.","van Keer K.","Bathula D.R.","Diaz-Pinto A.","Fang R.","Heng P.-A.","Kim J.","Lee J.","Lee J.","Li X.","Liu P.","Lu S.","Murugesan B.","Naranjo V.","Phaye S.S.R.","Shankaranarayana S.M.","Sikka A.","Son J.","van den Hengel A.","Wang S.","Wu J.","Wu Z.","Xu G.","Xu Y.","Yin P.","Li F.","Zhang X.","Xu Y.","Bogunovic H."],"cit_count":0,"doi":"10.1016/J.MEDIA.2019.101570","journal":"Medical Image Analysis","pmid":"31630011","title":"REFUGE Challenge: A unified framework for evaluating automated methods for glaucoma assessment from fundus photographs","year":"2020-01-01"}],"summary":{"biotoolsCURIE":"biotools:REFUGE_Challenge","biotoolsID":"REFUGE_Challenge","description":"A unified framework for evaluating automated methods for glaucoma assessment from fundus photographs.\n\nThe goal of the Retinal Fundus Glaucoma Challenge (REFUGE) is to evaluate and compare automated algorithms for glaucoma detection and optic disc/cup segmentation on a common dataset of retinal fundus images.\n\nThe REFUGE challenge is open for participation!.\n\nREFUGE challenge is partnering with OMIA to widen the opportunities to present your work at MICCAI. In addition to the traditional oral and poster presentations of OMIA, REFUGE offers the chance to try your software on a real challenge, this year with fundus images.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'REFUGE'","homepage":"https://refuge.grand-challenge.org","name":"REFUGE Challenge"}}