{"credit":[{"email":"anil.jegga@cchmc.org","name":"Anil Jegga","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"TERMS_OF_USE","url":"https://www.cincinnatichildrens.org/research/divisions/b/bmi"}],"function":[{"operation":[{"term":"Transcription factor binding site prediction","uri":"http://edamontology.org/operation_0445"},{"term":"Transcriptional regulatory element prediction","uri":"http://edamontology.org/operation_0438"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"DNA binding sites","uri":"http://edamontology.org/topic_3125"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"}]},"publication":[{"abstract":"Evolutionarily conserved noncoding genomic sequences represent a potentially rich source for the discovery of gene regulatory regions. However, detecting and visualizing compositionally similar cis-element clusters in the context of conserved sequences is challenging. We have explored potential solutions and developed an algorithm and visualization method that combines the results of conserved sequence analyses (BLASTZ) with those of transcription factor binding site analyses (MatInspector) (http://trafac.chmcc.org). We define hits as the density of co-occurring cis-element transcription factor (TF)-binding sites measured within a 200-bp moving average window through phylogenetically conserved regions. The results are depicted as a Regulogram, in which the hit count is plotted as a function of position within each of the two genomic regions of the aligned orthologs. Within a high-scoring region, the relative arrangement of shared cis-elements within compositionally similar TF-binding site clusters is depicted in a Trafacgram. On the basis of analyses of several training data sets, the approach also allows for the detection of similarities in composition and relative arrangement of cis-element clusters within nonorthologous genes, promoters, and enhancers that exhibit coordinate regulatory properties. Known functional regulatory regions of nonorthologous and less-conserved orthologous genes frequently showed cis-element shuffling, demonstrating that compositional similarity can be more sensitive than sequence similarity. These results show that combining sequence similarity with cis-element compositional similarity provides a powerful aid for the identification of potential control regions.","authors":["Jegga A.G.","Sherwood S.P.","Carman J.W.","Pinski A.T.","Phillips J.L.","Pestian J.P.","Aronow B.J."],"cit_count":77,"journal":"Genome Research","pmid":"12213778","title":"Detection and visualization of compositionally similar cis-regulatory element clusters in orthologous and coordinately controlled genes","year":"2002-09-01"}],"summary":{"biotoolsCURIE":"biotools:trafac","biotoolsID":"trafac","description":"TraFaC (Transcription Factor Binding Site Comparison) is a tool that identifes regulatory regions using a comparative sequence analysis approach.","homepage":"http://trafac.cchmc.org/trafac/index.jsp","name":"TraFaC"}}