
{
    "credit": [
        {
            "email": "junli07@stanford.edu",
            "name": "Jun Li",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www3.nd.edu/~jli9/research.html"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://www3.nd.edu/~jli9/npSeq/npseq-manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/npseq-1-1-1-significance-analysis-sequencing-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "We discuss the identification of features that are associated with an outcome in RNA-Sequencing (RNA-Seq) and other sequencing-based comparative genomic experiments. RNA-Seq data takes the form of counts, so models based on the normal distribution are generally unsuitable. The problem is especially challenging because different sequencing experiments may generate quite different total numbers of reads, or 'sequencing depths'. Existing methods for this problem are based on Poisson or negative binomial models: they are useful but can be heavily influenced by 'outliers' in the data. We introduce a simple, non-parametric method with resampling to account for the different sequencing depths. The new method is more robust than parametric methods. It can be applied to data with quantitative, survival, two-class or multiple-class outcomes. We compare our proposed method to Poisson and negative binomial-based methods in simulated and real data sets, and find that our method discovers more consistent patterns than competing methods. © The Authors 2011 Reprints and permissions: sagepub.co.uk/journalsPermissions.nav.",
            "authors": [
                "Li J.",
                "Tibshirani R."
            ],
            "cit_count": 176,
            "journal": "Statistical Methods in Medical Research",
            "pmid": "22127579",
            "title": "Finding consistent patterns: A nonparametric approach for identifying differential expression in RNA-Seq data",
            "year": "2013-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:npseq",
        "biotoolsID": "npseq",
        "description": "R package for the significance analysis of sequencing data.  The statistic used is exactly the same as that in SAM 4.0. The only difference is that our tool uses symmetric cutoffs, while SAM uses asymmetric cutoffs. Therefore, for some datasets, all significant genes obtained by SAM are either all up-regulated or all down-regulated, but npSeq almost always gives significant genes that include both up-regulated genes and down-regulated genes.",
        "homepage": "http://www3.nd.edu/~jli9/research.html#npseq",
        "name": "npSeq"
    }
}