
{
    "credit": [
        {
            "email": "lauren.bragg@csiro.au",
            "name": "Lauren Bragg",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.csiro.au/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://bioinformatics.csiro.au/public/files/klink_documentation.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "EST",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Linkage",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/k-link-est-clustering-algorithm.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: The clustering of expressed sequence tags (ESTs) is a crucial step in many sequence analysis studies that require a high level of redundancy. Chimeric sequences, while uncommon, can make achieving the optimal EST clustering a challenge. Single-linkage algorithms are particularly vulnerable to the effects of chimeras. To avoid chimera-facilitated erroneous merges, researchers using single-linkage algorithms are forced to use stringent sequence-similarity thresholds. Such thresholds reduce the sensitivity of the clustering algorithm. Results: We introduce the concept of k-link clustering for EST data. We evaluate how clustering error rates vary over a range of linkage thresholds. Using k-link, we show that Type II error decreases in response to increasing the number of shared ESTs (ie. links) required. We observe a base level of Type II error likely caused by the presence of unmasked low-complexity or repetitive sequence. We find that Type I error increases gradually with increased linkage. To minimize the Type I error introduced by increased linkage requirements, we propose an extension to k-link which modifies the required number of links with respect to the size of clusters being compared. © 2009 The Author(s).",
            "authors": [
                "Bragg L.M.",
                "Stone G."
            ],
            "cit_count": 3,
            "doi": "10.1093/bioinformatics/btp410",
            "journal": "Bioinformatics",
            "title": "k-link EST clustering: Evaluating error introduced by chimeric sequences under different degrees of linkage",
            "type": "Primary",
            "year": "2009-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:k-link",
        "biotoolsID": "k-link",
        "description": "An EST clustering algorithm which mitigates the effect of chimeric sequences by using a variable linkage merging algorithm.",
        "homepage": "http://www.bioinformatics.csiro.au/k-link/",
        "name": "k-link"
    }
}