{
    "accessibility": "Open access",
    "additionDate": "2021-11-20T07:53:25.643550Z",
    "biotoolsCURIE": "biotools:cnvintegrate",
    "biotoolsID": "cnvintegrate",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chuangey@ntu.edu.tw",
            "name": "Eric Y Chuang",
            "typeEntity": "Person"
        },
        {
            "email": "tplu@ntu.edu.tw",
            "name": "Tzu-Pin Lu",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-ethnic database for identifying copy number variations associated with cancer. View gene-centric CNV profile collected from healthy individuals and multiple cancer types.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number variation detection",
                    "uri": "http://edamontology.org/operation_3961"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://cnvintegrate.cgm.ntu.edu.tw/",
    "lastUpdate": "2021-11-20T07:53:25.646169Z",
    "name": "CNVIntegrate",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAB044",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.Human copy number variations (CNVs) and copy number alterations (CNAs) are DNA segments (>1000 base pairs) of duplications or deletions with respect to the reference genome, potentially causing genomic imbalance leading to diseases such as cancer. CNVs further cause genetic diversity in healthy populations and are predominant drivers of gene/genome evolution. Initiatives have been taken by the research community to establish large-scale databases to comprehensively characterize CNVs in humans. Exome Aggregation Consortium (ExAC) is one such endeavor that catalogs CNVs, of nearly 60 000 healthy individuals across five demographic clusters. Furthermore, large projects such as the Catalogue of Somatic Mutations in Cancer (COSMIC) and the Cancer Cell Line Encyclopedia (CCLE) combine CNA data from cancer-affected individuals and large panels of human cancer cell lines, respectively. However, we lack a structured and comprehensive CNV/CNA resource including both healthy individuals and cancer patients across large populations. CNVIntegrate is the first web-based system that hosts CNV and CNA data from both healthy populations and cancer patients, respectively, and concomitantly provides statistical comparisons between copy number frequencies of multiple ethnic populations. It further includes, for the first time, well-cataloged CNV and CNA data from Taiwanese healthy individuals and Taiwan Breast Cancer data, respectively, along with imported resources from ExAC, COSMIC and CCLE. CNVIntegrate offers a CNV/CNA-data hub for structured information retrieval for clinicians and scientists towards important drug discoveries and precision treatments. Database URL: http://cnvintegrate.cgm.ntu.edu.tw/",
                "authors": [
                    {
                        "name": "Chattopadhyay A."
                    },
                    {
                        "name": "Chuang E.Y."
                    },
                    {
                        "name": "Juang J.-M.J."
                    },
                    {
                        "name": "Lai L.-C."
                    },
                    {
                        "name": "Lu T.-P."
                    },
                    {
                        "name": "Teoh Z.H."
                    },
                    {
                        "name": "Tsai M.-H."
                    },
                    {
                        "name": "Wu C.-H."
                    },
                    {
                        "name": "Wu C.-Y."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Database",
                "title": "CNVIntegrate: The first multi-ethnic database for identifying copy number variations associated with cancer"
            },
            "pmcid": "PMC8278790",
            "pmid": "34259866"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
