{
    "additionDate": "2018-03-30T07:55:37Z",
    "biotoolsCURIE": "biotools:pigspro",
    "biotoolsID": "pigspro",
    "credit": [
        {
            "email": "pigs.biocomputing@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA-SAPIENZA"
        }
    ],
    "description": "PIGSPro is a web server for the automatic modeling of immunoglobulin variable domains based on the canonical structure method. It has a user-friendly and flexible interface, that allows the user to choose templates (for the frameworks and the loops) and modeling strategies in an automatic or manual fashion. Its final output is a complete three-dimensional model of the target antibody that can be downloaded or displayed on-line. The server is freely accessible to all.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://cassandra.med.uniroma1.it/pigspro/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "PIGSpro",
    "owner": "ELIXIR-ITA-SAPIENZA",
    "publication": [
        {
            "metadata": {
                "abstract": "©The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.PIGSpro is a significant upgrade of the popular PIGS server for the prediction of the structure of immunoglobulins. The software has been completely rewritten in python following a similar pipeline as in the original method, but including, at various steps, relevant modifications found to improve its prediction accuracy, as demonstrated here. The steps of the pipeline include the selection of the appropriate framework for predicting the conserved regions of the molecule by homology; the target template alignment for this portion of the molecule; the selection of the main chain conformation of the hypervariable loops according to the canonical structure model, the prediction of the third loop of the heavy chain (H3) for which complete canonical structures are not available and the packing of the light and heavy chain if derived from different templates. Each of these steps has been improved including updated methods developed along the years. Last but not least, the user interface has been completely redesigned and an automatic monthly update of the underlying database has been implemented.",
                "authors": [
                    {
                        "name": "Lepore R."
                    },
                    {
                        "name": "Messih M.A."
                    },
                    {
                        "name": "Olimpieri P.P."
                    },
                    {
                        "name": "Tramontano A."
                    }
                ],
                "citationCount": 28,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PIGSPro: Prediction of immunoGlobulin structures v2"
            },
            "pmcid": "PMC5570210",
            "pmid": "28472367"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1
}
