{
    "additionDate": "2020-01-09T17:37:25Z",
    "biotoolsCURIE": "biotools:DockBox",
    "biotoolsID": "DockBox",
    "confidence_flag": "tool",
    "description": "Assessing and improving the performance of consensus docking strategies using the DockBox package.\n\nPlatform package to simplify the use of docking programs and consensus methods.\n\nDockBox is a python wrapper library designed to facilitate the use of standard docking programs either alone or in combination. In addition, DockBox enables to rescore the generated docking poses with different popular scoring algorithms as well as to analyze the results using different consensus docking/scoring strategies",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/dockbox",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-22T10:01:53Z",
    "name": "DockBox",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S10822-019-00227-7",
            "metadata": {
                "abstract": "© 2019, Springer Nature Switzerland AG.Molecular docking is a well-established computational technique that aims to predict how a ligand binds to a specific protein target, as well as to assess the strength of the binding. Although docking programs are used worldwide for drug discovery, it is not always simple to identify which program or combination of programs provides the best results for a target of interest. Here we present DockBox, a computational package designed to facilitate the use of multiple docking and scoring programs allowing to combine them using different consensus strategies. As part of the DockBox package, a new consensus docking method called score-based consensus docking (SBCD) is introduced. SBCD was found to significantly improve the pose prediction success rates of single docking programs. When applied to virtual screening, SBCD enhanced enrichment factors while producing higher hit rates than standard consensus docking (CD). SBCD can be run with almost no additional computational cost and time compared to CD, if the same docking programs are used for pose generation. Furthermore, SBCD allows the use of many scoring functions to assess consensus without significant overhead, making it a promising new approach for the screening of large chemical libraries. DockBox is an open-source package publicly available at https://pypi.org/project/dockbox.",
                "authors": [
                    {
                        "name": "Gentile F."
                    },
                    {
                        "name": "Preto J."
                    }
                ],
                "citationCount": 7,
                "date": "2019-09-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "Assessing and improving the performance of consensus docking strategies using the DockBox package"
            },
            "pmid": "31578656"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
