
{
    "credit": [
        {
            "email": "li.shen@mssm.edu",
            "name": "Dr. Li Shen",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://neuroscience.mssm.edu/shen/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/shenlab-sinai/diffreps"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool",
            "Script"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "Sample collections",
                "uri": "http://edamontology.org/topic_3277"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/diffreps-1-55-1-finding-differential-chromatin-modification-sites-chip-seq-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "ChIP-seq is increasingly being used for genome-wide profiling of histone modification marks. It is of particular importance to compare ChIP-seq data of two different conditions, such as disease vs. control, and identify regions that show differences in ChIP enrichment. We have developed a powerful and easy to use program, called diffReps, to detect those differential sites from ChIP-seq data, with or without biological replicates. In addition, we have developed two useful tools for ChIP-seq analysis in the diffReps package: one for the annotation of the differential sites and the other for finding chromatin modification \"hotspots\". diffReps is developed in PERL programming language and runs on all platforms as a command line script. We tested diffReps on two different datasets. One is the comparison of H3K4me3 between two human cell lines from the ENCODE project. The other is the comparison of H3K9me3 in a discrete region of mouse brain between cocaine- and saline-treated conditions. The results indicated that diffReps is a highly sensitive program in detecting differential sites from ChIP-seq data. © 2013 Shen et al.",
            "authors": [
                "Shen L.",
                "Shao N.-Y.",
                "Liu X.",
                "Maze I.",
                "Feng J.",
                "Nestler E.J."
            ],
            "cit_count": 83,
            "journal": "PLoS ONE",
            "pmid": "23762400",
            "title": "diffReps: Detecting Differential Chromatin Modification Sites from ChIP-seq Data with Biological Replicates",
            "year": "2013-06-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:diffreps",
        "biotoolsID": "diffreps",
        "description": "This software is developed to find different peaks in ChIP-seq. It scans the whole genome using a sliding window, performing millions of statistical tests and report the significant hits. It takes into account the biological variations within a group of samples and uses that information to enhance the statistical power. Considering biological variation is of high importance, especiallly for in vivo brain tissues.",
        "homepage": "https://github.com/shenlab-sinai/diffreps",
        "name": "diffReps"
    }
}