{"credit":[{"email":"jitao_david.zhang@roche.com","name":"Jitao David Zhang","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/BioQC.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/BioQC_1.2.0.tar.gz"}],"function":[{"operation":[{"term":"Sequencing quality control","uri":"http://edamontology.org/operation_3218"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Data quality management","uri":"http://edamontology.org/topic_3572"}]},"publication":[{"abstract":"© 2017 The Author(s). Background: Gene expression data can be compromised by cells originating from other tissues than the target tissue of profiling. Failures in detecting such tissue heterogeneity have profound implications on data interpretation and reproducibility. A computational tool explicitly addressing the issue is warranted. Results: We introduce BioQC, a R/Bioconductor software package to detect tissue heterogeneity in gene expression data. To this end BioQC implements a computationally efficient Wilcoxon-Mann-Whitney test and provides more than 150 signatures of tissue-enriched genes derived from large-scale transcriptomics studies. Simulation experiments show that BioQC is both fast and sensitive in detecting tissue heterogeneity. In a case study with whole-organ profiling data, BioQC predicted contamination events that are confirmed by quantitative RT-PCR. Applied to transcriptomics data of the Genotype-Tissue Expression (GTEx) project, BioQC reveals clustering of samples and suggests that some samples likely suffer from tissue heterogeneity. Conclusions: Our experience with gene expression data indicates a prevalence of tissue heterogeneity that often goes unnoticed. BioQC addresses the issue by integrating prior knowledge with a scalable algorithm. We propose BioQC as a first-line tool to ensure quality and reproducibility of gene expression data.","authors":["Zhang J.D.","Hatje K.","Sturm G.","Broger C.","Ebeling M.","Burtin M.","Terzi F.","Pomposiello S.I.","Badi L."],"cit_count":7,"doi":"10.1186/s12864-017-3661-2","journal":"BMC Genomics","title":"Detect tissue heterogeneity in gene expression data with BioQC","type":"Primary","year":"2017-04-04"}],"summary":{"biotoolsCURIE":"biotools:bioqc","biotoolsID":"bioqc","description":"Quality control of high-throughput expression data based on tissue gene signatures.","homepage":"http://bioconductor.org/packages/release/bioc/html/BioQC.html","name":"BioQC","version":["1.2.0"]}}