
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/PRIDE-Toolsuite/pride-converter-2"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/PRIDE-Toolsuite/pride-converter-2"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pride-converter-2-5-1-converts-mass-spectrometry-data-pride-xml.html"
        }
    ],
    "publication": [
        {
            "abstract": "The original PRIDE Converter tool greatly simplified the process of submitting mass spectrometry (MS)-based proteomics data to the PRIDE database. However, after much user feedback, it was noted that the tool had some limitations and could not handle several user requirements that were now becoming commonplace. This prompted us to design and implement a whole new suite of tools that would build on the successes of the original PRIDE Converter and allow users to generate submissionready, well-annotated PRIDE XML files. The PRIDE Converter 2 tool suite allows users to convert search result files into PRIDE XML (the format needed for performing submissions to the PRIDE database), generate mzTab skeleton files that can be used as a basis to submit quantitative and gel-based MS data, and post-process PRIDE XML files by filtering out contaminants and empty spectra, or by merging several PRIDE XML files together. All the tools have both a graphical user interface that provides a dialog-based, user-friendly way to convert and prepare files for submission, as well as a command-line interface that can be used to integrate the tools into existing or novel pipelines, for batch processing and power users. The PRIDE Converter 2 tool suite will thus become a cornerstone in the submission process to PRIDE and, by extension, to the ProteomeXchange consortium of MS-proteomics data repositories. © 2012 by The American Society for Biochemistry and Molecular Biology, Inc.",
            "authors": [
                "Cote R.G.",
                "Griss J.",
                "Dianes J.A.",
                "Wang R.",
                "Wright J.C.",
                "Van Den Toorn H.W.P.",
                "Van Breukelen B.",
                "Heck A.J.R.",
                "Hulstaert N.",
                "Martens L.",
                "Reisinger F.",
                "Csordas A.",
                "Ovelleiro D.",
                "Perez-Rivevol Y.",
                "Barsnes H.",
                "Hermjakob H.",
                "Vizcaino J.A."
            ],
            "cit_count": 72,
            "journal": "Molecular and Cellular Proteomics",
            "pmid": "22949509",
            "title": "The PRoteomics IDEntification (PRIDE) converter 2 framework: An improved suite of tools to facilitate data submission to the PRIDE database and the proteomexchange consortium",
            "type": "Primary",
            "year": "2012-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pride_converter",
        "biotoolsID": "pride_converter",
        "description": "Converts mass spectrometry data from most common data formats into valid PRIDE XML for submission to the publicly available PRIDE database. It presents a convenient, wizard-like graphical user interface, and includes efficient access to the Ontology Lookup Service.",
        "homepage": "https://github.com/PRIDE-Toolsuite/pride-converter-2",
        "name": "PRIDE Converter",
        "version": [
            "2.5.7"
        ]
    }
}