{
    "additionDate": "2020-01-09T18:13:12Z",
    "biotoolsCURIE": "biotools:LungMAP",
    "biotoolsID": "LungMAP",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "susan.wert@cchmc.org",
            "name": "Susan E. Wert",
            "orcidid": "https://orcid.org/0000-0001-6643-5769",
            "typeEntity": "Person"
        }
    ],
    "description": "A comparison of alveolar formation and maturation within mouse and human lung.\n\nAnatomic Ontology for Mouse Lung Maturation.\n\nCell Ontology for Mouse Lung Maturation.\n\nAnatomic Ontology for Human Lung Maturation.\n\nCell Ontology for Human Lung Maturation.\n\nSearch BREATH to explore the developing lung.\n\nLungMAP provides users with a tool to annotate images within the website. This webpage provides instructions on how to annotate an image using the tool.\n\nImage annotation to convey specific information about an image, importantly, in the context of the image increases its value exponentially, especially with resolution on the molecular level.\n\nLungMAP human and mouse ontologies reference page provides links to the LungMAP Ontology Browser, Release Notes, and text files for the scientific community to view the ontologies.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'BREATH', 'Comprehensive anatomic ontologies lung development', 'lungs'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://www.lungmap.net",
    "lastUpdate": "2020-01-09T18:13:12Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.lungmap.net/resources/annotation/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://www.lungmap.net/resources/ontologies/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://bioportal.bioontology.org/ontologies/LUNGMAP-MOUSE"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://bioportal.bioontology.org/ontologies/LUNGMAP_M_CELL"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://bioportal.bioontology.org/ontologies/LUNGMAP-HUMAN"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://bioportal.bioontology.org/ontologies/LUNGMAP_H_CELL"
        }
    ],
    "name": "LungMAP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13326-019-0209-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Although the mouse is widely used to model human lung development, function, and disease, our understanding of the molecular mechanisms involved in alveolarization of the peripheral lung is incomplete. Recently, the Molecular Atlas of Lung Development Program (LungMAP) was funded by the National Heart, Lung, and Blood Institute to develop an integrated open access database (known as BREATH) to characterize the molecular and cellular anatomy of the developing lung. To support this effort, we designed detailed anatomic and cellular ontologies describing alveolar formation and maturation in both mouse and human lung. Description: While the general anatomic organization of the lung is similar for these two species, there are significant variations in the lung's architectural organization, distribution of connective tissue, and cellular composition along the respiratory tract. Anatomic ontologies for both species were constructed as partonomic hierarchies and organized along the lung's proximal-distal axis into respiratory, vascular, neural, and immunologic components. Terms for developmental and adult lung structures, tissues, and cells were included, providing comprehensive ontologies for application at varying levels of resolution. Using established scientific resources, multiple rounds of comparison were performed to identify common, analogous, and unique terms that describe the lungs of these two species. Existing biological and biomedical ontologies were examined and cross-referenced to facilitate integration at a later time, while additional terms were drawn from the scientific literature as needed. This comparative approach eliminated redundancy and inconsistent terminology, enabling us to differentiate true anatomic variations between mouse and human lungs. As a result, approximately 300 terms for fetal and postnatal lung structures, tissues, and cells were identified for each species. Conclusion: These ontologies standardize and expand current terminology for fetal and adult lungs, providing a qualitative framework for data annotation, retrieval, and integration across a wide variety of datasets in the BREATH database. To our knowledge, these are the first ontologies designed to include terminology specific for developmental structures in the lung, as well as to compare common anatomic features and variations between mouse and human lungs. These ontologies provide a unique resource for the LungMAP, as well as for the broader scientific community.",
                "authors": [
                    {
                        "name": "Pan H."
                    },
                    {
                        "name": "Deutsch G.H."
                    },
                    {
                        "name": "Wert S.E."
                    }
                ],
                "date": "2019-10-24T00:00:00Z",
                "journal": "Journal of Biomedical Semantics",
                "title": "Comprehensive anatomic ontologies for lung development: A comparison of alveolar formation and maturation within mouse and human lung"
            },
            "pmcid": "PMC6814058",
            "pmid": "31651362"
        }
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}