{
    "additionDate": "2021-11-01T13:54:57.965919Z",
    "biotoolsCURIE": "biotools:pharmsd",
    "biotoolsID": "pharmsd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "defangouyang@um.edu.mo",
            "name": "Defang Ouyang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PharmSD is a novel AI-based computational platform for solid dispersion formulation design.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://pharmsd.computpharm.org",
    "lastUpdate": "2021-11-01T13:54:57.968520Z",
    "name": "PharmSD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.IJPHARM.2021.120705",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Solid dispersion is an effective way to improve the dissolution and oral bioavailability of water-insoluble drugs. To obtain an effective solid dispersion formulation, researchers need to evaluate a series of important properties of the designed formulation, including in vitro dissolution and physical stability of solid dispersion. It is usually time-consuming and labor-intensive to explore these properties by traditional experimental methods. However, the development of machine learning technology provides a powerful way to solve such problems. By using advanced machine learning algorithms, we established a series of robust models and finally formed a systematic strategy to assist the formulation design. Based on these works, we developed a new formulation prediction platform of solid dispersion: PharmSD. This platform provides efficient functionalities for the prediction of physical stability, dissolution type and dissolution rate of solid dispersion independently. Then, a virtual screening pipeline can be produced by considering those prediction results as a whole, which enables users to filter different kinds of drug-polymer combinations in various experimental situations and figure out which combination could form the best formulation. Moreover, it also provides two tools that enable researchers to evaluate the application domain of models and calculate the similarity of dissolution curves. PharmSD is expected to be the first freely available web-based platform that is fully designed for the formulation design of solid dispersion driven by machine learning. We hope this platform could provide a powerful solution to assist the formulation design in the related research area. It is available at: http://pharmsd.computpharm.org.",
                "authors": [
                    {
                        "name": "Dong J."
                    },
                    {
                        "name": "Gao H."
                    },
                    {
                        "name": "Ouyang D."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-15T00:00:00Z",
                "journal": "International Journal of Pharmaceutics",
                "title": "PharmSD: A novel AI-based computational platform for solid dispersion formulation design"
            },
            "pmid": "33991595",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}
