{
    "additionDate": "2020-01-14T09:36:51Z",
    "biotoolsCURIE": "biotools:MegaGTA",
    "biotoolsID": "MegaGTA",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jiarong Guo",
            "typeEntity": "Person"
        },
        {
            "name": "John F. Quensen",
            "typeEntity": "Person"
        },
        {
            "email": "tiedjej@msu.edu",
            "name": "James M. Tiedje",
            "typeEntity": "Person"
        }
    ],
    "description": "Review, Evaluation, and Directions for Gene-Targeted Assembly for Ecological Analyses of Metagenomes.\n\nHMM-guided metagenomic gene-targeted assembler using iterative de Bruijn graphs.\n\ngit clone https://github.com/HKU-BAL/megagta.git.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                },
                {
                    "term": "Sample comparison",
                    "uri": "http://edamontology.org/operation_3731"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HKU-BAL/megagta",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2020-12-23T08:35:11Z",
    "name": "MegaGTA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00957",
            "metadata": {
                "abstract": "© Copyright © 2019 Guo, Quensen, Sun, Wang, Brown, Cole and Tiedje.Shotgun metagenomics has greatly advanced our understanding of microbial communities over the last decade. Metagenomic analyses often include assembly and genome binning, computationally daunting tasks especially for big data from complex environments such as soil and sediments. In many studies, however, only a subset of genes and pathways involved in specific functions are of interest; thus, it is not necessary to attempt global assembly. In addition, methods that target genes can be computationally more efficient and produce more accurate assembly by leveraging rich databases, especially for those genes that are of broad interest such as those involved in biogeochemical cycles, biodegradation, and antibiotic resistance or used as phylogenetic markers. Here, we review six gene-targeted assemblers with unique algorithms for extracting and/or assembling targeted genes: Xander, MegaGTA, SAT-Assembler, HMM-GRASPx, GenSeed-HMM, and MEGAN. We tested these tools using two datasets with known genomes, a synthetic community of artificial reads derived from the genomes of 17 bacteria, shotgun sequence data from a mock community with 48 bacteria and 16 archaea genomes, and a large soil shotgun metagenomic dataset. We compared assemblies of a universal single copy gene (rplB) and two N cycle genes (nifH and nirK). We measured their computational efficiency, sensitivity, specificity, and chimera rate and found Xander and MegaGTA, which both use a probabilistic graph structure to model the genes, have the best overall performance with all three datasets, although MEGAN, a reference matching assembler, had better sensitivity with synthetic and mock community members chosen from its reference collection. Also, Xander and MegaGTA are the only tools that include post-assembly scripts tuned for common molecular ecology and diversity analyses. Additionally, we provide a mathematical model for estimating the probability of assembling targeted genes in a metagenome for estimating required sequencing depth.",
                "authors": [
                    {
                        "name": "Guo J."
                    },
                    {
                        "name": "Quensen J.F."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Wang Q."
                    },
                    {
                        "name": "Brown C.T."
                    },
                    {
                        "name": "Cole J.R."
                    },
                    {
                        "name": "Tiedje J.M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-15T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Review, Evaluation, and Directions for Gene-Targeted Assembly for Ecological Analyses of Metagenomes"
            },
            "pmcid": "PMC6843070",
            "pmid": "31749830"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}