{
    "additionDate": "2021-01-18T10:34:15Z",
    "biotoolsCURIE": "biotools:binomialrf",
    "biotoolsID": "binomialrf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Lussier.Y@gmail.com",
            "name": "Yves A. Lussier",
            "orcidid": "https://orcid.org/0000-0001-9854-1005",
            "typeEntity": "Person"
        },
        {
            "email": "hzhang@math.arizona.edu",
            "name": "Hao Helen Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "The binomialRF package is an R package that provides a feature selection algorithm to be used in randomForest classifiers. Treating each tree as a quasi binomial stochastic process in a random forest, binomialRF determines a feature’s importance by how often they are selected in practice vs. as expected by random chance. Given that trees are co-dependent as they subsample the same data, a theoretical adjustment is made using a generalization of the binomial distribution that adds a parameter to model correlation/association between trials.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SamirRachidZaim/binomialRF",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-04T12:26:05Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SamirRachidZaim/binomialRF_simulationStudy"
        }
    ],
    "name": "binomialRF",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03718-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: In this era of data science-driven bioinformatics, machine learning research has focused on feature selection as users want more interpretation and post-hoc analyses for biomarker detection. However, when there are more features (i.e., transcripts) than samples (i.e., mice or human samples) in a study, it poses major statistical challenges in biomarker detection tasks as traditional statistical techniques are underpowered in high dimension. Second and third order interactions of these features pose a substantial combinatoric dimensional challenge. In computational biology, random forest (RF) classifiers are widely used due to their flexibility, powerful performance, their ability to rank features, and their robustness to the \"P > > N\"high-dimensional limitation that many matrix regression algorithms face. We propose binomialRF, a feature selection technique in RFs that provides an alternative interpretation for features using a correlated binomial distribution and scales efficiently to analyze multiway interactions. Results: In both simulations and validation studies using datasets from the TCGA and UCI repositories, binomialRF showed computational gains (up to 5 to 300 times faster) while maintaining competitive variable precision and recall in identifying biomarkers' main effects and interactions. In two clinical studies, the binomialRF algorithm prioritizes previously-published relevant pathological molecular mechanisms (features) with high classification precision and recall using features alone, as well as with their statistical interactions alone. Conclusion: binomialRF extends upon previous methods for identifying interpretable features in RFs and brings them together under a correlated binomial distribution to create an efficient hypothesis testing algorithm that identifies biomarkers' main effects and interactions. Preliminary results in simulations demonstrate computational gains while retaining competitive model selection and classification accuracies. Future work will extend this framework to incorporate ontologies that provide pathway-level feature selection from gene expression input data.",
                "authors": [
                    {
                        "name": "Berghout J."
                    },
                    {
                        "name": "Chiu W."
                    },
                    {
                        "name": "Kenost C."
                    },
                    {
                        "name": "Lussier Y.A."
                    },
                    {
                        "name": "Rachid Zaim S."
                    },
                    {
                        "name": "Wilson L."
                    },
                    {
                        "name": "Zhang H.H."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BinomialRF: Interpretable combinatoric efficiency of random forests to identify biomarker interactions"
            },
            "pmcid": "PMC7456085",
            "pmid": "32859146"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
