{
    "accessibility": "Open access",
    "additionDate": "2022-04-28T14:03:49.596270Z",
    "biotoolsCURIE": "biotools:bonesis",
    "biotoolsID": "bonesis",
    "collectionID": [
        "PerMedCoE"
    ],
    "cost": "Free of charge",
    "description": "Synthesis of Most Permissive Boolean Networks from network architecture and dynamical properties",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/bioasp/bonesis"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/bioasp/bonesis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-28T14:03:49.598622Z",
    "name": "BoNesis",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1007/978-3-030-60327-4_11",
            "metadata": {
                "abstract": "© 2020, Springer Nature Switzerland AG.The construction of models of biological networks from prior knowledge and experimental data often leads to a multitude of candidate models. Devising a single model from them can require arbitrary choices, which may lead to strong biases in subsequent predictions. We introduce here a methodology for a) synthesizing Boolean model ensembles satisfying a set of biologically relevant constraints and b) reasoning on the dynamics of the ensembles of models. The synthesis is performed using Answer-Set Programming, extending prior work to account for solution diversity and universal constraints on reachable fixed points, enabling an accurate specification of desired dynamics. The sampled models are then simulated and the results are aggregated through averaging or can be analyzed as a multi-dimensional distribution. We illustrate our approach on a previously published Boolean model of a molecular network regulating the cell fate decisions in cancer progression. It appears that the ensemble-based approach to Boolean modelling brings new insights on the variability of synergistic interacting mutations effect concerning propensity of a cancer cell to metastasize.",
                "authors": [
                    {
                        "name": "Calzone L."
                    },
                    {
                        "name": "Chevalier S."
                    },
                    {
                        "name": "Noel V."
                    },
                    {
                        "name": "Pauleve L."
                    },
                    {
                        "name": "Zinovyev A."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "Synthesis and Simulation of Ensembles of Boolean Networks for Cell Fate Decision"
            }
        }
    ]
}
