{
    "additionDate": "2021-01-18T11:29:37Z",
    "biotoolsCURIE": "biotools:scsemicluster",
    "biotoolsID": "scsemicluster",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dengmh@pku.edu.cn",
            "name": "Minghua Deng",
            "typeEntity": "Person"
        }
    ],
    "description": "Single-cell RNA-seq data semi-supervised clustering and annotation via structural regularized domain adaptation.\n\nThe identification of cell types plays an essential role in the analysis of scRNA-seq data, which, in turn, influences the discovery of regulatory genes that induce heterogeneity. Here, we propose a flexible single cell semi-supervised clustering and annotation framework, scSemiCluster. Notably, without explicit feature alignment and batch effect correction, scSemiCluster outperforms other state-of-the-art, single-cell supervised classification and semi-supervised clustering annotation algorithms in both simulation and real data. In addition, scSemiCluster is suitable for cell annotation on single data and cross-data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xuebaliang/scSemiCluster",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-13T16:34:59Z",
    "name": "scSemiCluster",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA908",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Motivation: The rapid development of single-cell RNA sequencing (scRNA-seq) technologies allows us to explore tissue heterogeneity at the cellular level. The identification of cell types plays an essential role in the analysis of scRNA-seq data, which, in turn, influences the discovery of regulatory genes that induce heterogeneity. As the scale of sequencing data increases, the classical method of combining clustering and differential expression analysis to annotate cells becomes more costly in terms of both labor and resources. Existing scRNA-seq supervised classification method can alleviate this issue through learning a classifier trained on the labeled reference data and then making a prediction based on the unlabeled target data. However, such label transference strategy carries with risks, such as susceptibility to batch effect and further compromise of inherent discrimination of target data. Results: In this article, inspired by unsupervised domain adaptation, we propose a flexible single cell semisupervised clustering and annotation framework, scSemiCluster, which integrates the reference data and target data for training. We utilize structure similarity regularization on the reference domain to restrict the clustering solutions of the target domain. We also incorporates pairwise constraints in the feature learning process such that cells belonging to the same cluster are close to each other, and cells belonging to different clusters are far from each other in the latent space. Notably, without explicit domain alignment and batch effect correction, scSemiCluster outperforms other state-of-the-art, single-cell supervised classification and semi-supervised clustering annotation algorithms in both simulation and real data. To the best of our knowledge, we are the first to use both deep discriminative clustering and deep generative clustering techniques in the single-cell field.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "He Q."
                    },
                    {
                        "name": "Zhai Y."
                    },
                    {
                        "name": "Deng M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Single-cell RNA-seq data semi-supervised clustering and annotation via structural regularized domain adaptation"
            },
            "pmid": "33098418"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}