{
    "additionDate": "2021-01-18T10:11:27Z",
    "biotoolsCURIE": "biotools:matfr",
    "biotoolsID": "matfr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yushaodemia@163.com",
            "name": "Shaode Yu",
            "typeEntity": "Person"
        },
        {
            "email": "yq.xie@siat.ac.cn",
            "name": "Yaoqin Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "A MATLAB toolbox for feature ranking.\n\nThe matFR toolbox has already integrated 42 methods. Among them, 12 methods are from FSLib [1], 9 methods from mutual information (MI) based feature selection repository [2], 7 methods are used in MATLAB (“rankfeatures”, “relieff” and “lasso”), and others are accessible online. FR methods can be grouped into supervised and unsupervised methods. In this toolbox, there are 29 supervised and 13 unsupervised methods. FR methods can also be categorized from theoretical perspective. The matFR contains 12 MI based methods, 8 statistical analysis based methods, 8 structure learning based methods and others.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/NicoYuCN/matFR",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-20T17:15:24Z",
    "name": "matFR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA621",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Nowadays, it is feasible to collect massive features for quantitative representation and precision medicine, and thus, automatic ranking to figure out the most informative and discriminative ones becomes increasingly important. To address this issue, 42 feature ranking (FR) methods are integrated to form a MATLAB toolbox (matFR). The methods apply mutual information, statistical analysis, structure clustering and other principles to estimate the relative importance of features in specific measure spaces. Specifically, these methods are summarized, and an example shows how to apply a FR method to sort mammographic breast lesion features. The toolbox is easy to use and flexible to integrate additional methods. Importantly, it provides a tool to compare, investigate and interpret the features selected for various applications. Availability and implementation: The toolbox is freely available at http://github.com/NicoYuCN/matFR. A tutorial and an example with a dataset are provided.",
                "authors": [
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Liang X."
                    },
                    {
                        "name": "Qin W."
                    },
                    {
                        "name": "Yu S."
                    },
                    {
                        "name": "Xie Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MatFR: A MATLAB toolbox for feature ranking"
            },
            "pmid": "32637981"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}