{
    "additionDate": "2017-02-10T14:15:03Z",
    "biotoolsCURIE": "biotools:glynest_and_casper",
    "biotoolsID": "glynest_and_casper",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.uni-giessen.de/fbz/fb10/institute_klinikum/institute/vphysbio"
        }
    ],
    "description": "GlyNest and CASPER are two independent services, available through this common interface, for predicting NMR spectra given a glycan chemical structure.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.glycosciences.de/sweetdb/start.php?action=form_shift_estimation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://www.glycosciences.de/sweetdb/start.php?action=form_shift_estimation",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "GlyNest and CASPER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The computer program CASPER and its algorithms are described. The program is aimed at facilitating the determination of structures of oligosaccharides and regular polysaccharides, requiring as input either the one-dimensional 1H or 13C NMR spectrum or the 2D C,H-correlation NMR spectrum together with information on components and linkages. The databases, the method of simulating spectra, options of the program, and techniques for faster calculations are described as well as an example of a structural determination. © 1991, American Chemical Society. All rights reserved.",
                "authors": [
                    {
                        "name": "Jansson P.-E."
                    },
                    {
                        "name": "Kenne L."
                    },
                    {
                        "name": "Widmalm G."
                    }
                ],
                "citationCount": 37,
                "date": "1991-11-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Computer Sciences",
                "title": "CASPER: A Computer Program Used for Structural Analysis of Carbohydrates"
            },
            "pmid": "1757506"
        },
        {
            "metadata": {
                "abstract": "GlyNest and CASPER (www.casper.organ.su.se/casper/) are two independent services aiming to predict 1H- and 13C-NMR chemical shifts of glycans. GlyNest estimates chemical shifts of glycans based on a spherical environment encoding scheme for each atom. CASPER is an increment rule-based approach which uses chemical shifts of the free reducing monosaccharides which are altered according to attached residues of an oligo- or polysaccharide sequence. Both services, which are located on separate, distributed, servers are now available through a common interface of the GLYCOSCIENCES.de portal (www.glycosciences.de). The predictive ability of both techniques was evaluated for a test set of 155 13C and 181 1H spectra of assigned glycan structures. The standard deviations between experimental and estimated shifts (1H; 0.081/0.102; 13C 0.763/0.794; GlyNest/CASPER) are comparable for both methods and significantly better than procedures where stereochemistry is not encoded. The predictive ability of both approaches is in most cases sufficiently precise to be used for an automatic assignment of NMR-spectra. Since both procedures work efficiently and require computation times in the millisecond range on standard computers, they are well suited for the assignment of NMR spectra in high-throughput glycomics projects. The service is available at www.glycosciences.de/ sweetdb/start.php?action=form_shift_estimation. © 2006 The Author(s).",
                "authors": [
                    {
                        "name": "Loss A."
                    },
                    {
                        "name": "Stenutz R."
                    },
                    {
                        "name": "Schwarzer E."
                    },
                    {
                        "name": "von der Lieth C.-W."
                    }
                ],
                "citationCount": 28,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GlyNest and CASPER: Two independent approaches to estimate 1H and 13C NMR shifts of glycans available through a common web-interface"
            },
            "pmid": "16845109"
        },
        {
            "metadata": {
                "abstract": "Complex carbohydrates are known as mediators of complex cellular events. Concerning their structural diversity, their potential of information content is several orders of magnitude higher in a short sequence than any other biological macromolecule. SWEET-DB (http://www.dkfz.de/spec2/sweetdb/) is an attempt to use modern web techniques to annotate and/or cross-reference carbohydrate-related data collections which allow glycoscientists to find important data for compounds of interest in a compact and well-structured representation. Currently, reference data taken from three data sources can be retrieved for a given carbohydrate (sub)structure. The sources are CarbBank structures and literature references (linked to NCBI PubMed service), NMR data taken from SugaBase and 3D co-ordinates generated with SWEET-II. The main purpose of SWEET-DB is to enable an easy access to all data stored for one carbohydrate structure entering a complete sequence or parts thereof. Access to SWEET-DB contents is provided with the help of separate input spreadsheets for (sub)structures, bibliographic data, general structural data like molecular weight, NMR spectra and biological data. A detailed online tutorial is available at http://www.dkfz.de/spec2/sweetdb/nar/.",
                "authors": [
                    {
                        "name": "Loss A."
                    },
                    {
                        "name": "Bunsmann P."
                    },
                    {
                        "name": "Bohne A."
                    },
                    {
                        "name": "Loss A."
                    },
                    {
                        "name": "Schwarzer E."
                    },
                    {
                        "name": "Lang E."
                    },
                    {
                        "name": "Von Der Lieth C.-W."
                    }
                ],
                "citationCount": 71,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SWEET-DB: An attempt to create annotated data collections for carbohydrates"
            },
            "pmid": "11752350"
        },
        {
            "metadata": {
                "abstract": "The CASPER program which is used for determination of the primary structure of oligo- and polysaccharides has been extended. It can now handle a reduced number of experimental signals from an NMR spectrum in the comparison to the simulated spectra of structures that it generates, an improvement which is of practical importance since all signals in NMR spectra cannot always be identified. Furthermore, the program has been enhanced to simulate NMR spectra of multibranched oligo- and polysaccharides. The new developments were tested on four saccharides of known structure but of different complexity and were shown to predict the correct structures.",
                "authors": [
                    {
                        "name": "Stenutz R."
                    },
                    {
                        "name": "Jansson P.-E."
                    },
                    {
                        "name": "Widmalm G."
                    }
                ],
                "citationCount": 32,
                "date": "1998-01-01T00:00:00Z",
                "journal": "Carbohydrate Research",
                "title": "Computer-assisted structural analysis of oligo- and polysaccharides: An extension of CASPER to multibranched structures"
            },
            "pmid": "9691437"
        },
        {
            "metadata": {
                "abstract": "This paper reviews the current status of bioinformatics applications and databases in glycobiology, which are based on bioinformatics approaches as well as informatics for glycobiology where an explicit encoding of glycan structures is required. The availability of the complete sequence of the human genome has accelerated the systematic identification of so far unidentified glycogenes considerably in many areas of glycobiology using well-established bioinfomatics tools. Although there has been an immense development of new glyco-related data collections as well as informatics tools and several efforts have been started to cross-link and reference the various data deposited in distributed databases, informatics for glycobiology and glycomics is still poorly developed compared to the genomics and proteomics area. The development of algorithms for the automatic interpretation of MS spectra - currently, a severe bottleneck, which hampers the rapid and reliable interpretation of MS data in high-throughput glycomics projects - is reviewed. A comprehensive list of web resources is given. Several lines of progression are discussed. There is an urgent need for the development of decentralised input facilities of experimentally determined glycan structures. Simultaneously, agreements of standards for the structural description of glycans as well as formats for the related data have to be established. The integration of glycomics with genomics/proteomics has to increase. © 2005 Elsevier B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "von der Lieth C.-W."
                    },
                    {
                        "name": "Lutteke T."
                    },
                    {
                        "name": "Frank M."
                    }
                ],
                "citationCount": 58,
                "date": "2006-04-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - General Subjects",
                "title": "The role of informatics in glycobiology research with special emphasis on automatic interpretation of MS spectra"
            },
            "pmid": "16459020"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        }
    ],
    "validated": 1
}