{
    "additionDate": "2021-12-13T12:38:53.339913Z",
    "biotoolsCURIE": "biotools:usdsm",
    "biotoolsID": "usdsm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jfxia@ahu.edu.cn",
            "name": "Tiejun Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zhang_tiejun@gzhmu.edu.cn",
            "name": "Junfeng Xia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Undersampling scheme based method for deleterious synonymous mutation (usDSM) is a novel method for deleterious synonymous mutation prediction using undersampling scheme.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://usdsm.xialab.info/",
    "lastUpdate": "2021-12-13T12:38:53.342582Z",
    "name": "usDSM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB123",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Although synonymous mutations do not alter the encoded amino acids, they may impact protein function by interfering with the regulation of RNA splicing or altering transcript splicing. New progress on next-generation sequencing technologies has put the exploration of synonymous mutations at the forefront of precision medicine. Several approaches have been proposed for predicting the deleterious synonymous mutations specifically, but their performance is limited by imbalance of the positive and negative samples. In this study, we firstly expanded the number of samples greatly from various data sources and compared six undersampling strategies to solve the problem of the imbalanced datasets. The results suggested that cluster centroid is the most effective scheme. Secondly, we presented a computational model, undersampling scheme based method for deleterious synonymous mutation (usDSM) prediction, using 14-dimensional biology features and random forest classifier to detect the deleterious synonymous mutation. The results on the test datasets indicated that the proposed usDSM model can attain superior performance in comparison with other state-of-the-art machine learning methods. Lastly, we found that the deep learning model did not play a substantial role in deleterious synonymous mutation prediction through a lot of experiments, although it achieves superior results in other fields. In conclusion, we hope our work will contribute to the future development of computational methods for a more accurate prediction of the deleterious effect of human synonymous mutation. The web server of usDSM is freely accessible at http://usdsm.xialab.info/.",
                "authors": [
                    {
                        "name": "Cheng N."
                    },
                    {
                        "name": "Tang X."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Zhang T."
                    },
                    {
                        "name": "Zhang T."
                    },
                    {
                        "name": "Zheng C.-H."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "UsDSM: A novel method for deleterious synonymous mutation prediction using undersampling scheme"
            },
            "pmid": "33866367",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}
