{
    "additionDate": "2021-03-19T08:52:08Z",
    "biotoolsCURIE": "biotools:4mcnlp-deep",
    "biotoolsID": "4mcnlp-deep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhenyu.xuan@utdallas.edu",
            "name": "Zhenyu Xuan",
            "typeEntity": "Person"
        },
        {
            "email": "kitchong@jbnu.ac.kr",
            "name": "Kil To Chong",
            "typeEntity": "Person"
        }
    ],
    "description": "4mCNLP-Deep is a tool the identification of N4-methylcytosine. It performs natural language processing by exploiting deep learning algorithm.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://nsclbio.jbnu.ac.kr/tools/4mCNLP-Deep/",
    "lastUpdate": "2021-04-11T06:03:47Z",
    "name": "4mCNLP-Deep",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-020-80430-X",
            "metadata": {
                "abstract": "© 2021, The Author(s).N4-methylcytosine is a biochemical alteration of DNA that affects the genetic operations without modifying the DNA nucleotides such as gene expression, genomic imprinting, chromosome stability, and the development of the cell. In the proposed work, a computational model, 4mCNLP-Deep, used the word embedding approach as a vector formulation by exploiting deep learning based CNN algorithm to predict 4mC and non-4mC sites on the C.elegans genome dataset. Diversity of ranges employed for the experimental such as corpus k-mer and k-fold cross-validation to obtain the prevailing capabilities. The 4mCNLP-Deep outperform from the state-of-the-art predictor by achieving the results in five evaluation metrics by following; Accuracy (ACC) as 0.9354, Mathew’s correlation coefficient (MCC) as 0.8608, Specificity (Sp) as 0.89.96, Sensitivity (Sn) as 0.9563, and Area under curve (AUC) as 0.9731 by using 3-mer corpus word2vec and 3-fold cross-validation and attained the increment of 1.1%, 0.6%, 0.58%, 0.77%, and 4.89%, respectively. At last, we developed the online webserver http://nsclbio.jbnu.ac.kr/tools/4mCNLP-Deep/, for the experimental researchers to get the results easily.",
                "authors": [
                    {
                        "name": "Wahab A."
                    },
                    {
                        "name": "Tayara H."
                    },
                    {
                        "name": "Xuan Z."
                    },
                    {
                        "name": "Chong K.T."
                    }
                ],
                "citationCount": 3,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "DNA sequences performs as natural language processing by exploiting deep learning algorithm for the identification of N4-methylcytosine"
            },
            "pmcid": "PMC7794489",
            "pmid": "33420191"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ]
}