{
    "additionDate": "2017-01-17T15:01:11Z",
    "biotoolsCURIE": "biotools:methylpipe",
    "biotoolsID": "methylpipe",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "kamal.fartiyal84@gmail.com",
            "name": "Kamal Kishore",
            "orcidid": "http://orcid.org/0000-0002-4650-8745",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Memory efficient analysis of base resolution DNA methylation data in both the CpG and non-CpG sequence context. Integration of DNA methylation data derived from any methodology providing base- or low-resolution data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/methylPipe.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/methylPipe_1.8.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/methylPipe.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T01:33:19Z",
    "license": "GPL-2.0",
    "name": "methylPipe",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0742-6",
            "metadata": {
                "abstract": "© 2015 Kishore et al.Background: Numerous methods are available to profile several epigenetic marks, providing data with different genome coverage and resolution. Large epigenomic datasets are then generated, and often combined with other high-throughput data, including RNA-seq, ChIP-seq for transcription factors (TFs) binding and DNase-seq experiments. Despite the numerous computational tools covering specific steps in the analysis of large-scale epigenomics data, comprehensive software solutions for their integrative analysis are still missing. Multiple tools must be identified and combined to jointly analyze histone marks, TFs binding and other -omics data together with DNA methylation data, complicating the analysis of these data and their integration with publicly available datasets. Results: To overcome the burden of integrating various data types with multiple tools, we developed two companion R/Bioconductor packages. The former, methylPipe, is tailored to the analysis of high- or low-resolution DNA methylomes in several species, accommodating (hydroxy-)methyl-cytosines in both CpG and non-CpG sequence context. The analysis of multiple whole-genome bisulfite sequencing experiments is supported, while maintaining the ability of integrating targeted genomic data. The latter, compEpiTools, seamlessly incorporates the results obtained with methylPipe and supports their integration with other epigenomics data. It provides a number of methods to score these data in regions of interest, leading to the identification of enhancers, lncRNAs, and RNAPII stalling/elongation dynamics. Moreover, it allows a fast and comprehensive annotation of the resulting genomic regions, and the association of the corresponding genes with non-redundant GeneOntology terms. Finally, the package includes a flexible method based on heatmaps for the integration of various data types, combining annotation tracks with continuous or categorical data tracks. Conclusions: methylPipe and compEpiTools provide a comprehensive Bioconductor-compliant solution for the integrative analysis of heterogeneous epigenomics data. These packages are instrumental in providing biologists with minimal R skills a complete toolkit facilitating the analysis of their own data, or in accelerating the analyses performed by more experienced bioinformaticians.",
                "authors": [
                    {
                        "name": "Kishore K."
                    },
                    {
                        "name": "de Pretis S."
                    },
                    {
                        "name": "Lister R."
                    },
                    {
                        "name": "Morelli M.J."
                    },
                    {
                        "name": "Bianchi V."
                    },
                    {
                        "name": "Amati B."
                    },
                    {
                        "name": "Ecker J.R."
                    },
                    {
                        "name": "Pelizzola M."
                    }
                ],
                "citationCount": 34,
                "date": "2015-09-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "methylPipe and compEpiTools: A suite of R packages for the integrative analysis of epigenomics data"
            },
            "pmcid": "PMC4587815",
            "pmid": "26415965",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.8.0"
    ]
}