{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T10:02:50Z",
    "biotoolsCURIE": "biotools:dlbepitope",
    "biotoolsID": "dlbepitope",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liwj@nic.bmi.ac.cn",
            "name": "Wuju Li",
            "typeEntity": "Person"
        }
    ],
    "description": "DLBEpitope is a deep learning-based model for linear B-cell epitope prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "http://ccb1.bmi.ac.cn:81/dlbepitope/",
    "lastUpdate": "2021-03-01T11:05:21Z",
    "name": "DLBEpitope",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13040-020-00211-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: B-cell epitopes play important roles in vaccine design, clinical diagnosis, and antibody production. Although some models have been developed to predict linear or conformational B-cell epitopes, their performance is still unsatisfactory. Hundreds of thousands of linear B-cell epitope data have accumulated in the Immune Epitope Database (IEDB). These data can be explored using the deep learning methods, in order to create better predictive models for linear B-cell epitopes. Results: After data cleaning, we obtained 240,563 peptide samples with experimental evidence from the IEDB database, including 25,884 linear B-cell epitopes and 214,679 non-epitopes. Based on the peptide center, we adapted each peptide to the same length by trimming or extending. A random portion of the data, with the same amount of epitopes and non-epitopes, were set aside as test dataset. Then a same number of epitopes and non-epitopes were randomly selected from the remaining data to build a classifier with the feedforward deep neural network. We built eleven classifiers to form an ensemble prediction model. The model will report a peptide as an epitope if it was classified as epitope by all eleven classifiers. Then we used the test data set to evaluate the performance of the model using the area value under the receiver operating characteristic (ROC) curve (AUC) as an indicator. We established 40 models to predict linear B-cell epitopes of length from 11 to 50 separately, and found that the AUC value increased with the length and tended to be stable when the length was 38. Repeated results showed that the models constructed by this method were robust. Tested on our and two public test datasets, our models outperformed current major models available. Conclusions: We applied the feedforward deep neural network to the large amount of linear B-cell epitope data with experimental evidence in the IEDB database, and constructed ensemble prediction models with better performance than the current major models available. We named the models as DLBEpitope and provided web services using the models at http://ccb1.bmi.ac.cn:81/dlbepitope/.",
                "authors": [
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Shi K."
                    },
                    {
                        "name": "Li W."
                    }
                ],
                "date": "2020-04-17T00:00:00Z",
                "journal": "BioData Mining",
                "title": "Deep learning methods improve linear B-cell epitope prediction"
            },
            "pmcid": "PMC7371472",
            "pmid": "32699555"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        }
    ]
}