{
    "additionDate": "2021-01-18T12:27:31Z",
    "biotoolsCURIE": "biotools:ec-pgmgr",
    "biotoolsID": "ec-pgmgr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mingyi@cug.edu.cn",
            "name": "Ming Yi",
            "typeEntity": "Person"
        }
    ],
    "description": "EC-PGMGR is a tool for ensemble clustering based on probability graphical model with graph regularization for Single-Cell RNA-seq Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhuyuan-cug/zhuyuan-lab",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-05T15:15:38Z",
    "name": "EC-PGMGR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2020.572242",
            "metadata": {
                "abstract": "© Copyright © 2020 Zhu, Zhang, Zhang, Yi, Ou-Yang and Wu.Advances in technology have made it convenient to obtain a large amount of single cell RNA sequencing (scRNA-seq) data. Since that clustering is a very important step in identifying or defining cellular phenotypes, many clustering approaches have been developed recently for these applications. The general methods can be roughly divided into normal clustering methods and integrated (ensemble) clustering methods which combine more than two normal clustering methods aiming to get much more informative performance. In order to make a contrast with the integrated clustering algorithm, the normal clustering method is often called individual or base clustering method. Note that the results of many individual clustering methods are often developed to capture one aspect of the data, and the results depend on the initial parameter settings, such as cluster number, distance metric and so on. Compared with individual clustering, although integrative clustering method may get much more accurate performance, the results depend on the base clustering results and integrated systems are often not self-regulation. Therefore, how to design a robust unsupervised clustering method is still a challenge. In order to tackle above limitations, we propose a novel Ensemble Clustering algorithm based on Probability Graphical Model with Graph Regularization, which is called EC-PGMGR for short. On one hand, we use parameter controlling in Probability Graphical Model (PGM) to automatically determine the cluster number without prior knowledge. On the other hand, we add a regularization term to reduce the effect deriving from some weak base clustering results. Particularly, the integrative results collected from base clustering methods can be assembled in the form of combination with self-regulation weights through a pre-learning process, which can efficiently enhance the effect of active clustering methods while weaken the effect of inactive clustering methods. Experiments are carried out on 7 data sets generated by different platforms with the number of single cells from 822 to 5,132. Results show that EC-PGMGR performs better than 4 alternative individual clustering methods and 2 ensemble methods in terms of accuracy including Adjusted Rand Index (ARI) and Normalized Mutual Information (NMI), robustness, effectiveness and so on. EC-PGMGR provides an effective way to integrate different clustering results for more accurate and reliable results in further biological analysis as well. It may provide some new insights to the other applications of clustering.",
                "authors": [
                    {
                        "name": "Zhu Y."
                    },
                    {
                        "name": "Zhang D.-X."
                    },
                    {
                        "name": "Zhang X.-F."
                    },
                    {
                        "name": "Yi M."
                    },
                    {
                        "name": "Ou-Yang L."
                    },
                    {
                        "name": "Wu M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-04T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "EC-PGMGR: Ensemble Clustering Based on Probability Graphical Model With Graph Regularization for Single-Cell RNA-seq Data"
            },
            "pmcid": "PMC7673820",
            "pmid": "33329710"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}