{
    "additionDate": "2024-01-01T23:35:55.434667Z",
    "biotoolsCURIE": "biotools:sidco",
    "biotoolsID": "sidco",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "SteffanyAnn.Bennett@uottawa.ca",
            "name": "Steffany A L Bennett",
            "orcidid": "https://orcid.org/0000-0001-7944-5800",
            "typeEntity": "Person"
        },
        {
            "email": "cuperlovim@nrc.ca",
            "name": "Miroslava Čuperlović-Culf",
            "orcidid": "https://orcid.org/0000-0002-9483-8159",
            "typeEntity": "Person"
        }
    ],
    "description": "Online implementation of distance correlation and partial distance correlation for data-driven network analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Proximity map plotting",
                    "uri": "http://edamontology.org/operation_2937"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://complimet.ca/sidco",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-01T23:35:55.437339Z",
    "name": "SiDCo",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD210",
            "metadata": {
                "abstract": "Motivation: There is a need for easily accessible implementations that measure the strength of both linear and non-linear relationships between metabolites in biological systems as an approach for data-driven network development. While multiple tools implement linear Pearson and Spearman methods, there are no such tools that assess distance correlation. Results: We present here SIgned Distance COrrelation (SiDCo). SiDCo is a GUI platform for calculation of distance correlation in omics data, measuring linear and non-linear dependencies between variables, as well as correlation between vectors of different lengths, e.g. different sample sizes. By combining the sign of the overall trend from Pearson’s correlation with distance correlation values, we further provide a novel “signed distance correlation” of particular use in metabolomic and lipidomic analyses. Distance correlations can be selected as one-to-one or one-to-all correlations, showing relationships between each feature and all other features one at a time or in combination. Additionally, we implement “partial distance correlation,” calculated using the Gaussian Graphical model approach adapted to distance covariance. Our platform provides an easy-to-use software implementation that can be applied to the investigation of any dataset. Availability and implementation: The SiDCo software application is freely available at https://complimet.ca/sidco. Supplementary help pages are provided at https://complimet.ca/sidco. Supplementary Material shows an example of an application of SiDCo in metabolomics.",
                "authors": [
                    {
                        "name": "Alecu I."
                    },
                    {
                        "name": "Bennett S.A.L."
                    },
                    {
                        "name": "Cuperlovic-Culf M."
                    },
                    {
                        "name": "Monti F."
                    },
                    {
                        "name": "Nguyen-Tran T."
                    },
                    {
                        "name": "Stewart D."
                    },
                    {
                        "name": "Surendra A."
                    }
                ],
                "citationCount": 1,
                "date": "2023-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Signed Distance Correlation (SiDCo): an online implementation of distance correlation and partial distance correlation for data-driven network analysis"
            },
            "pmcid": "PMC10353719",
            "pmid": "37137236"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
