{
    "additionDate": "2021-10-10T15:34:23.983958Z",
    "biotoolsCURIE": "biotools:mixtwice",
    "biotoolsID": "mixtwice",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "newton@stat.wisc.edu",
            "name": "Michael A Newton",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MixTwice is an R package for large-scale hypothesis testing for peptide arrays by variance mixing. Peptide microarrays have emerged as a powerful technology in immunoproteomics as they provide a tool to measure the abundance of different antibodies in patient serum samples. The high dimensionality and small sample size of many experiments challenge conventional statistical approaches, including those aiming to control the false discovery rate (FDR). Motivated by limitations in reproducibility and power of current methods, we advance an empirical Bayesian tool that computes local false discovery rate statistics and local false sign rate statistics when provided with data on estimated effects and estimated standard errors from all the measured peptides. As the name suggests, the MixTwice tool involves the estimation of two mixing distributions, one on underlying effects and one on underlying variance parameters",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/MixTwice/MixTwice.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=MixTwice",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:18:09.006465Z",
    "license": "GPL-2.0",
    "name": "MixTwice",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab162",
            "metadata": {
                "abstract": "Peptide microarrays have emerged as a powerful technology in immunoproteomics as they provide a tool to measure the abundance of different antibodies in patient serum samples. The high dimensionality and small sample size of many experiments challenge conventional statistical approaches, including those aiming to control the false discovery rate (FDR). Motivated by limitations in reproducibility and power of current methods, we advance an empirical Bayesian tool that computes local FDR statistics and local false sign rate statistics when provided with data on estimated effects and estimated standard errors from all the measured peptides. As the name suggests, the MixTwice tool involves the estimation of two mixing distributions, one on underlying effects and one on underlying variance parameters. Constrained optimization techniques provide for model fitting of mixing distributions under weak shape constraints (unimodality of the effect distribution). Numerical experiments show that MixTwice can accurately estimate generative parameters and powerfully identify non-null peptides. In a peptide array study of rheumatoid arthritis, MixTwice recovers meaningful peptide markers in one case where the signal is weak, and has strong reproducibility properties in one case where the signal is strong.",
                "authors": [
                    {
                        "name": "Mergaert A.M."
                    },
                    {
                        "name": "Newton M.A."
                    },
                    {
                        "name": "Ong I.M."
                    },
                    {
                        "name": "Shelef M.A."
                    },
                    {
                        "name": "Zheng Z."
                    }
                ],
                "citationCount": 3,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MixTwice: Large-scale hypothesis testing for peptide arrays by variance mixing"
            },
            "pmcid": "PMC8428605",
            "pmid": "33693483",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
