{
    "additionDate": "2018-08-17T17:52:41Z",
    "biotoolsCURIE": "biotools:dbsolve_optimum",
    "biotoolsID": "dbsolve_optimum",
    "credit": [
        {
            "email": "gizzatkulov@gmail.com",
            "name": "Nail M Gizzatkulov",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Stand-alone software tool for construction and analysis of mathematical models of biological systems.",
    "documentation": [
        {
            "type": "General",
            "url": "https://sourceforge.net/projects/dbsolve/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://www.insysbio.ru/en/software/db-solve-optimum",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "BSD-2-Clause",
    "name": "DBSolve Optimum",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1752-0509-4-109",
            "metadata": {
                "abstract": "Background: Systems biology research and applications require creation, validation, extensive usage of mathematical models and visualization of simulation results by end-users. Our goal is to develop novel method for visualization of simulation results and implement it in simulation software package equipped with the sophisticated mathematical and computational techniques for model development, verification and parameter fitting.Results: We present mathematical simulation workbench DBSolve Optimum which is significantly improved and extended successor of well known simulation software DBSolve5. Concept of \"dynamic visualization\" of simulation results has been developed and implemented in DBSolve Optimum. In framework of the concept graphical objects representing metabolite concentrations and reactions change their volume and shape in accordance to simulation results. This technique is applied to visualize both kinetic response of the model and dependence of its steady state on parameter. The use of the dynamic visualization is illustrated with kinetic model of the Krebs cycle.Conclusion: DBSolve Optimum is a user friendly simulation software package that enables to simplify the construction, verification, analysis and visualization of kinetic models. Dynamic visualization tool implemented in the software allows user to animate simulation results and, thereby, present them in more comprehensible mode. DBSolve Optimum and built-in dynamic visualization module is free for both academic and commercial use. It can be downloaded directly from http://www.insysbio.ru. © 2010 Gizzatkulov et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Gizzatkulov N.M."
                    },
                    {
                        "name": "Goryanin I.I."
                    },
                    {
                        "name": "Metelkin E.A."
                    },
                    {
                        "name": "Mogilevskaya E.A."
                    },
                    {
                        "name": "Peskov K.V."
                    },
                    {
                        "name": "Demin O.V."
                    }
                ],
                "citationCount": 26,
                "date": "2010-08-10T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "DBSolve Optimum: A software package for kinetic modeling which allows dynamic visualization of simulation results"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1
}