{
    "additionDate": "2017-12-18T00:10:08Z",
    "biotoolsCURIE": "biotools:pcaj",
    "biotoolsID": "pcaj",
    "credit": [
        {
            "email": "kumasaka@src.riken.jp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PCAj (Principal component analysis for Japanese)predicts population structure of Japanese samples using genome-wide SNP genotypes.  It creates a 2D scatterplot of predicted principal components based on the probabilistic PCA.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure prediction",
                    "uri": "http://edamontology.org/operation_0271"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://kumasakanatsuhiko.jp/projects/pcaj/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pca-population-structure-prediction-system-japanese.html"
        }
    ],
    "name": "PCAj",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1038/jhg.2010.63",
            "metadata": {
                "abstract": "Recent studies have demonstrated that principal component analysis (PCA) can detect the presence of population mixture and admixture in a sample and thus can be used to correct population stratification in genome-wide association studies (GWAS). We propose a complementary approach to PCA that compensates for potential weaknesses associated with PCA, so that one can perform population structure analyses using limited numbers of subjects and single-nucleotide polymorphisms (SNPs). Our method first requires a PCA of the largest reference sample from a population to standardize the system. Once the system is established, it can perform PCA for each individual with a much smaller number of SNPs drawn from the same population. This is because of the introduction of the probabilistic PCA, so that the prediction of the principal components (PCs) is performed under a rigorous probabilistic framework. The subsequent linear discriminant analysis also helps to understand from which ancestries or subpopulations a given individual is more likely to derive, in terms of posterior probabilities given the predicted PCs. A real-world prototype of the system for the Japanese population is developed based on 19 260 subjects, which illustrates the potential usefulness of the system as an aid in the detection of population structures in validation samples, or to help with the correction of population stratification in GWAS. © 2010 The Japan Society of Human Genetics. All rights reserved.",
                "authors": [
                    {
                        "name": "Kumasaka N."
                    },
                    {
                        "name": "Yamaguchi-Kabata Y."
                    },
                    {
                        "name": "Takahashi A."
                    },
                    {
                        "name": "Kubo M."
                    },
                    {
                        "name": "Nakamura Y."
                    },
                    {
                        "name": "Kamatani N."
                    }
                ],
                "citationCount": 6,
                "date": "2010-08-01T00:00:00Z",
                "journal": "Journal of Human Genetics",
                "title": "Establishment of a standardized system to perform population structure analyses with limited sample size or with different sets of SNP genotypes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "SNP",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "samples",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1
}