
{
    "credit": [
        {
            "email": "ghbidaut@pcbi.upenn.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.fccc.edu/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinformatics.fccc.edu/software/OpenSource/waveread/index.shtml"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/waveread-measurement-relative-gene-expression-levels-microarrays-wavelet-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Gene expression microarrays monitor the expression levels of thousands of genes in an experiment simultaneously. To utilize the information generated, each of the thousands of spots on a microarray image must be properly quantified, including background correction. Most present methods require manual alignment of grids to the image data, and still often require additional minor adjustments on a spot by spot basis to correct for spotting irregularities. Such intervention is time consuming and also introduces inconsistency in the handling of data. A fully automatic, tested system would increase throughput and reliability in this field. In this paper, we describe WaveRead, a fully automated, standalone, open-source system for quantifying gene expression array images. Through the use of wavelet analysis to identify the spot locations and diameters, the system is able to automatically grid the image and quantify signal intensities and background corrections without any user intervention. The ability of WaveRead to perform proper quantification is demonstrated by analysis of both simulated images containing spots with donut shapes, elliptical shapes, and Gaussian intensity distributions, as well as of standard images from the National Cancer Institute. © 2005 Elsevier Inc. All rights reserved.",
            "authors": [
                "Bidaut G.",
                "Manion F.J.",
                "Garcia C.",
                "Ochs M.F."
            ],
            "cit_count": 7,
            "journal": "Journal of Biomedical Informatics",
            "pmid": "16298556",
            "title": "WaveRead: Automatic measurement of relative gene expression levels from microarrays using wavelet analysis",
            "year": "2006-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:waveread",
        "biotoolsID": "waveread",
        "description": "Automated microarray quantification program based on feature detection by wavelet packet decomposition analysis. The algorithm handles rotated images (up to 45°), spot detection, meta-gridding separation, gridding, background correction, and spot irregularities.",
        "homepage": "http://bioinformatics.fccc.edu/software/OpenSource/waveread/index.shtml",
        "name": "WaveRead"
    }
}