{
    "additionDate": "2021-01-18T11:53:27Z",
    "biotoolsCURIE": "biotools:adept",
    "biotoolsID": "adept",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alon.geva@childrens.harvard.edu",
            "name": "Alon Geva",
            "orcidid": "https://orcid.org/0000-0002-8574-0133",
            "typeEntity": "Person"
        }
    ],
    "description": "ADEPT is a tool for a high-sensitivity natural language processing (NLP) pipeline for detecting potential adverse drug events (ADEs) with easily interpretable output for high-efficiency human review and adjudication of true ADEs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hms-dbmi/adept",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-21T13:16:55Z",
    "license": "Apache-2.0",
    "name": "Adverse drug event presentation and tracking (ADEPT)",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/JAMIAOPEN/OOAA031",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Objective: To advance use of real-world data (RWD) for pharmacovigilance, we sought to integrate a highsensitivity natural language processing (NLP) pipeline for detecting potential adverse drug events (ADEs) with easily interpretable output for high-efficiency human review and adjudication of true ADEs. Materials and methods: The adverse drug event presentation and tracking (ADEPT) system employs an open source NLP pipeline to identify in clinical notes mentions of medications and signs and symptoms potentially indicative of ADEs. ADEPT presents the output to human reviewers by highlighting these drug-event pairs within the context of the clinical note. To measure incidence of seizures associated with sildenafil, we applied ADEPT to 149 029 notes for 982 patients with pediatric pulmonary hypertension. Results: Of 416 patients identified as taking sildenafil, NLP found 72 [17%, 95% confidence interval (CI) 14-21] with seizures as a potential ADE. Upon human review and adjudication, only 4 (0.96%, 95% CI 0.37-2.4) patients with seizures were determined to have true ADEs. Reviewers using ADEPT required a median of 89 s (interquartile range 57-142 s) per patient to review potential ADEs. Discussion: ADEPT combines high throughput NLP to increase sensitivity of ADE detection and human review, to increase specificity by differentiating true ADEs from signs and symptoms related to comorbidities, effects of other medications, or other confounders. Conclusion: ADEPT is a promising tool for creating gold standard, patient-level labels for advancing NLP-based pharmacovigilance. ADEPT is a potentially time savings platform for computer-assisted pharmacovigilance based on RWD.",
                "authors": [
                    {
                        "name": "Avillach P."
                    },
                    {
                        "name": "Geva A."
                    },
                    {
                        "name": "Lin C."
                    },
                    {
                        "name": "Mandl K.D."
                    },
                    {
                        "name": "Manzi S.F."
                    },
                    {
                        "name": "Savova G.K."
                    },
                    {
                        "name": "Stedman J.P."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "JAMIA Open",
                "title": "Adverse drug event presentation and tracking (ADEPT): Semiautomated, high throughput pharmacovigilance using real-world data"
            },
            "pmcid": "PMC7660953",
            "pmid": "33215076"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
