{"credit":[{"email":"russ.altman@stanford.edu","name":"Russ B. Altman","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://reducio.princeton.edu/cm/"}],"documentation":[{"type":"GENERAL","url":"http://function.princeton.edu/software/"}],"function":[{"operation":[{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]},{"operation":[{"term":"Imputation","uri":"http://edamontology.org/operation_3557"}]}],"labels":{"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/knnimpute-estimation-missing-values-microarray-data.html"}],"publication":[{"abstract":"Motivation: Gene expression microarray experiments can generate data sets with multiple missing expression values. Unfortunately, many algorithms for gene expression analysis require a complete matrix of gene array values as input. For example, methods such as hierarchical clustering and K-means clustering are not robust to missing data, and may lose effectiveness even with a few missing values. Methods for imputing missing data are needed, therefore, to minimize the effect of incomplete data sets on analyses, and to increase the range of data sets to which these algorithms can be applied. In this report, we investigate automated methods for estimating missing data. Results: We present a comparative study of several methods for the estimation of missing values in gene microarray data. We implemented and evaluated three methods: a Singular Value Decomposition (SVD) based method (SVDimpute), weighted K-nearest neighbors (KNNimpute), and row average. We evaluated the methods using a variety of parameter settings and over different real data sets, and assessed the robustness of the imputation methods to the amount of missing data over the range of 1-20% missing values. We show that KNNimpute appears to provide a more robust and sensitive method for missing value estimation than SVDimpute, and both SVDimpute and KNNimpute surpass the commonly used row average method (as well as filling missing values with zeros). We report results of the comparative experiments and provide recommendations and tools for accurate estimation of missing microarray data under a variety of conditions.","authors":["Troyanskaya O.","Cantor M.","Sherlock G.","Brown P.","Hastie T.","Tibshirani R.","Botstein D.","Altman R.B."],"cit_count":1725,"journal":"Bioinformatics","pmid":"11395428","title":"Missing value estimation methods for DNA microarrays","year":"2001-01-01"}],"summary":{"biotoolsCURIE":"biotools:knnimpute","biotoolsID":"knnimpute","description":"Implementation of the k-nearest neighbors algorithm for estimation of missing values in microarray data. In our comparative study of several different methods used for missing value estimation we determined that KNNimpute provides superior performance in a variety of situations.","homepage":"http://function.princeton.edu/software/","name":"KNNimpute"}}