{"credit":[{"email":"bulee@kribb.re.kr","name":"Byungwook Lee","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://pat.kobic.re.kr/wdac/features.htm"}],"function":[{"operation":[{"term":"Protein fold recognition","uri":"http://edamontology.org/operation_0303"},{"term":"Protein domain recognition","uri":"http://edamontology.org/operation_0246"},{"term":"Protein architecture comparison","uri":"http://edamontology.org/operation_2474"},{"term":"Protein architecture analysis","uri":"http://edamontology.org/operation_0247"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein folds and structural domains","uri":"http://edamontology.org/topic_0736"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Data architecture, analysis and design","uri":"http://edamontology.org/topic_3365"}]},"publication":[{"abstract":"We present DAhunter, a web-based server that identifies homologous proteins by comparing domain architectures, the organization of protein domains. A major obstacle in comparison of domain architecture is the existence of 'promiscuous' domains, which carry out auxiliary functions and appear in many unrelated proteins. To distinguish these promiscuous domains from protein domains, we assigned a weight score to each domain extracted from RefSeq proteins, based on its abundance and versatility. A domain's score represents its importance in the 'protein world' and is used in the comparison of domain architectures. In scoring domains, DAhunter also considers domain combinations as well as single domains. To measure the similarity of two domain architectures, we developed several methods that are based on algorithms used in information retrieval (the cosine similarity, the Goodman-Kruskal gamma function, and domain duplication index) and then combined these into a similarity score. Compared with other domain architecture algorithms, DAhunter is better at identifying homology. The server is available at http://www.dahunter.kr and http://localodom.kobic.re.kr/dahunter/index.htm.","authors":["Lee B.","Lee D."],"cit_count":11,"journal":"Nucleic acids research","pmid":"18411203","title":"DAhunter: a web-based server that identifies homologous proteins by comparing domain architecture.","year":"2008-01-01"},{"abstract":"Background: The general method used to determine the function of newly discovered proteins is to transfer annotations from well-characterized homologous proteins. The process of selecting homologous proteins can largely be classified into sequence-based and domain-based approaches. Domain-based methods have several advantages for identifying distant homology and homology among proteins with multiple domains, as compared to sequence-based methods. However, these methods are challenged by large families defined by 'promiscuous' (or 'mobile') domains. Results: Here we present a measure, called Weighed Domain Architecture Comparison (WDAC), of domain architecture similarity, which can be used to identify homolog of multidomain proteins. To distinguish these promiscuous domains from conventional protein domains, we assigned a weight score to Pfam domain extracted from RefSeq proteins, based on its abundance and versatility. To measure the similarity of two domain architectures, cosine similarity (a similarity measure used in information retrieval) is used. We combined sequence similarity with domain architecture comparisons to identify proteins belonging to the same domain architecture. Using human and nematode proteomes, we compared WDAC with an unweighted domain architecture method (DAC) to evaluate the effectiveness of domain weight scores. We found that WDAC is better at identifying homology among multidomain proteins. Conclusion: Our analysis indicates that considering domain weight scores in domain architecture comparisons improves protein homology identification. We developed a web-based server to allow users to compare their proteins with protein domain architectures. © 2009 Lee and Lee; licensee BioMed Central Ltd.","authors":["Lee B.","Lee D."],"cit_count":18,"journal":"BMC Bioinformatics","pmid":"19958515","title":"Protein comparison at the domain architecture level","year":"2009-12-03"}],"summary":{"biotoolsCURIE":"biotools:wdac","biotoolsID":"wdac","description":"The WDAC (Weighted Domain Architecture Comparison Tool) is a web-based server to perform protein homology search by comparing protein domain architectures, defined as a sequential order of domains in a protein.","homepage":"http://pat.kobic.re.kr/wdac/index.htm","name":"WDAC"}}