{
    "additionDate": "2019-11-14T20:08:20Z",
    "biotoolsCURIE": "biotools:Flye",
    "biotoolsID": "Flye",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fenderglass@gmail.com",
            "name": "Mikhail Kolmogorov",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Support"
            ]
        },
        {
            "name": "Yu Lin",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "Jeffrey Yuan",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "Flye is a de novo assembler for single molecule sequencing reads, such as those produced by PacBio and Oxford Nanopore Technologies. It is designed for a wide range of datasets, from small bacterial projects to large mammalian-scale assemblies. The package represents a complete pipeline: it takes raw PB / ONT reads as input and outputs polished contigs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Mapping assembly",
                    "uri": "http://edamontology.org/operation_0523"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fenderglass/Flye",
    "language": [
        "C++",
        "Python",
        "C"
    ],
    "lastUpdate": "2020-12-29T10:34:11Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/fenderglass/Flye/issues"
        }
    ],
    "name": "Flye",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1099/MGEN.0.000294",
            "metadata": {
                "abstract": "© 2019 The Authors.Illumina sequencing allows rapid, cheap and accurate whole genome bacterial analyses, but short reads (<300 bp) do not usually enable complete genome assembly. Long-read sequencing greatly assists with resolving complex bacterial genomes, particularly when combined with short-read Illumina data (hybrid assembly). However, it is not clear how different long-read sequencing methods affect hybrid assembly accuracy. Relative automation of the assembly process is also crucial to facilitating high-throughput complete bacterial genome reconstruction, avoiding multiple bespoke filtering and data manipulation steps. In this study, we compared hybrid assemblies for 20 bacterial isolates, including two reference strains, using Illumina sequencing and long reads from either Oxford Nanopore Technologies (ONT) or SMRT Pacific Biosciences (PacBio) sequencing platforms. We chose isolates from the family Enterobacteriaceae, as these frequently have highly plastic, repetitive genetic structures, and complete genome reconstruction for these species is relevant for a precise understanding of the epidemiology of antimicrobial resistance. We de novo assembled genomes using the hybrid assembler Unicycler and compared different read processing strategies, as well as comparing to long-read-only assembly with Flye followed by short-read polishing with Pilon. Hybrid assembly with either PacBio or ONT reads facilitated high-quality genome reconstruction, and was superior to the longread assembly and polishing approach evaluated with respect to accuracy and completeness. Combining ONT and Illumina reads fully resolved most genomes without additional manual steps, and at a lower consumables cost per isolate in our setting. Automated hybrid assembly is a powerful tool for complete and accurate bacterial genome assembly.",
                "authors": [
                    {
                        "name": "De Maio N."
                    },
                    {
                        "name": "Shaw L.P."
                    },
                    {
                        "name": "Hubbard A."
                    },
                    {
                        "name": "George S."
                    },
                    {
                        "name": "Sanderson N.D."
                    },
                    {
                        "name": "Swann J."
                    },
                    {
                        "name": "Wick R."
                    },
                    {
                        "name": "Oun M.A."
                    },
                    {
                        "name": "Stubberfield E."
                    },
                    {
                        "name": "Hoosdally S.J."
                    },
                    {
                        "name": "Crook D.W."
                    },
                    {
                        "name": "Peto T.E.A."
                    },
                    {
                        "name": "Sheppard A.E."
                    },
                    {
                        "name": "Bailey M.J."
                    },
                    {
                        "name": "Read D.S."
                    },
                    {
                        "name": "Anjum M.F."
                    },
                    {
                        "name": "Sarah Walker A."
                    },
                    {
                        "name": "Stoesser N."
                    }
                ],
                "citationCount": 54,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Microbial Genomics",
                "title": "Comparison of long-read sequencing technologies in the hybrid assembly of complex bacterial genomes"
            },
            "pmcid": "PMC6807382",
            "pmid": "31483244",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1038/s41587-019-0072-8",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.Accurate genome assembly is hampered by repetitive regions. Although long single molecule sequencing reads are better able to resolve genomic repeats than short-read data, most long-read assembly algorithms do not provide the repeat characterization necessary for producing optimal assemblies. Here, we present Flye, a long-read assembly algorithm that generates arbitrary paths in an unknown repeat graph, called disjointigs, and constructs an accurate repeat graph from these error-riddled disjointigs. We benchmark Flye against five state-of-the-art assemblers and show that it generates better or comparable assemblies, while being an order of magnitude faster. Flye nearly doubled the contiguity of the human genome assembly (as measured by the NGA50 assembly quality metric) compared with existing assemblers.",
                "authors": [
                    {
                        "name": "Kolmogorov M."
                    },
                    {
                        "name": "Yuan J."
                    },
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Pevzner P.A."
                    }
                ],
                "citationCount": 394,
                "date": "2019-05-01T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "Assembly of long, error-prone reads using repeat graphs"
            },
            "pmid": "30936562",
            "type": [
                "Primary",
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1038/s41592-020-00971-x",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature America, Inc.Long-read sequencing technologies have substantially improved the assemblies of many isolate bacterial genomes as compared to fragmented short-read assemblies. However, assembling complex metagenomic datasets remains difficult even for state-of-the-art long-read assemblers. Here we present metaFlye, which addresses important long-read metagenomic assembly challenges, such as uneven bacterial composition and intra-species heterogeneity. First, we benchmarked metaFlye using simulated and mock bacterial communities and show that it consistently produces assemblies with better completeness and contiguity than state-of-the-art long-read assemblers. Second, we performed long-read sequencing of the sheep microbiome and applied metaFlye to reconstruct 63 complete or nearly complete bacterial genomes within single contigs. Finally, we show that long-read assembly of human microbiomes enables the discovery of full-length biosynthetic gene clusters that encode biomedically important natural products.",
                "authors": [
                    {
                        "name": "Kolmogorov M."
                    },
                    {
                        "name": "Bickhart D.M."
                    },
                    {
                        "name": "Behsaz B."
                    },
                    {
                        "name": "Gurevich A."
                    },
                    {
                        "name": "Rayko M."
                    },
                    {
                        "name": "Shin S.B."
                    },
                    {
                        "name": "Kuhn K."
                    },
                    {
                        "name": "Yuan J."
                    },
                    {
                        "name": "Polevikov E."
                    },
                    {
                        "name": "Smith T.P.L."
                    },
                    {
                        "name": "Pevzner P.A."
                    }
                ],
                "citationCount": 21,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "metaFlye: scalable long-read metagenome assembly using repeat graphs"
            },
            "pmid": "33020656",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}