{
    "additionDate": "2017-08-03T18:58:57Z",
    "biotoolsCURIE": "biotools:sagpar",
    "biotoolsID": "sagpar",
    "credit": [
        {
            "email": "rajat@isical.ac.in",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.isical.ac.in/~rajat/"
        }
    ],
    "description": "A fast and robust algorithm that generates any metabolic pathway using some given structural representations of metabolites.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.isical.ac.in/~rajat/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://www.isical.ac.in/~rajat/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sagpar-structural-grammar-based-automated-pathway-reconstruction.html"
        }
    ],
    "name": "SAGPAR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "In-silico metabolic engineering is a very useful branch of systems biology for modeling, analysis and prediction of various outcomes of metabolic pathways. It can also be used for detecting interactions and dynamics within a network. Various protocols have been proposed for modeling a pathway. But most of these protocols have various disadvantages and shortcomings with respect to automated pathway modeling and analysis. In the present article, we have proposed a novel algorithm for automated pathway reconstruction. We have also made a comparative study of our algorithm with other standard protocols and discussed its advantages over others. We present StructurAl Grammar-based automated PAthway Reconstruction (SAGPAR), a fast and robust algorithm that generates any metabolic pathway using some given structural representations of metabolites. Users can model any pathway based on some pre-required features that are asked as an input by the algorithm. The algorithm also takes into considerations various thermodynamic thresholds and structural properties while modeling a pathway. The given algorithm has been tested on the standard pathway datasets of 25 pathways of Mycoplasma pneumoniae M129 and 24 pathways of Homo sapiens. The dataset is taken from KEGG and PubChem Compound data repositories. SAGPAR performs much better than some already present metabolic pathway analysis tools like Copasi, PHT, Gepasi, Jarnac and Path-A. © 2012 International Association of Scientists in the Interdisciplinary Areas and Springer-Verlag Berlin Heidelberg.",
                "authors": [
                    {
                        "name": "De R.K."
                    },
                    {
                        "name": "Tagore S."
                    }
                ],
                "citationCount": 2,
                "date": "2012-06-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "SAGPAR: Structural Grammar-based automated pathway reconstruction"
            },
            "pmid": "22843234"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
