{"credit":[],"documentation":[{"url":"https://tagoos.readthedocs.io"}],"download":[{"type":"Source code","url":"https://github.com/aitgon/tagoos/releases"}],"function":[{"operation":[{"term":"Linkage disequilibrium calculation","uri":"http://edamontology.org/operation_0488"},{"term":"Gene expression QTL analysis","uri":"http://edamontology.org/operation_3232"},{"term":"SNP annotation","uri":"http://edamontology.org/operation_3661"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["Python"],"license":"Unlicense","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"GWAS study","uri":"http://edamontology.org/topic_3517"}]},"link":[{"type":"ISSUE_TRACKER","url":"https://github.com/aitgon/tagoos/issues"}],"publication":[{"abstract":"© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Genome-wide association studies (GWAS) associate single nucleotide polymorphisms (SNPs) to complex phenotypes. Most human SNPs fall in non-coding regions and are likely regulatory SNPs, but linkage disequilibrium (LD) blocks make it difficult to distinguish functional SNPs. Therefore, putative functional SNPs are usually annotated with molecular markers of gene regulatory regions and prioritized with dedicated prediction tools. We integrated associated SNPs, LD blocks and regulatory features into a supervised model called TAGOOS (TAG SNP bOOSting) and computed scores genome-wide. The TAGOOS scores enriched and prioritized unseen associated SNPs with an odds ratio of 4.3 and 3.5 and an area under the curve (AUC) of 0.65 and 0.6 for intronic and intergenic regions, respectively. The TAGOOS score was correlated with the maximal significance of associated SNPs and expression quantitative trait loci (eQTLs) and with the number of biological samples annotated for key regulatory features. Analysis of loci and regions associated to cleft lip and human adult height phenotypes recovered known functional loci and predicted new functional loci enriched in transcriptions factors related to the phenotypes. In conclusion, we trained a supervised model based on associated SNPs to prioritize putative functional regions. The TAGOOS scores, annotations and UCSC genome tracks are available here: https://tagoos.readthedocs.io.","authors":["Gonzalez A.","Artufel M.","Rihet P."],"cit_count":0,"doi":"10.1093/NAR/GKZ320","journal":"Nucleic acids research","pmid":"31045203","title":"TAGOOS: genome-wide supervised learning of non-coding loci associated to complex phenotypes","type":"Primary","year":"2019-08-22"}],"summary":{"biotoolsCURIE":"biotools:TAGOOS","biotoolsID":"TAGOOS","description":"Genome-wide supervised learning of non-coding loci associated to complex phenotypes.","homepage":"https://github.com/aitgon/tagoos","name":"TAGOOS"}}