
{
    "credit": [
        {
            "email": "jlo@ua.pt",
            "name": "José Luis Oliveira",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.ua.pt/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bioinformatics.ua.pt/becas/#!/help"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            },
            {
                "term": "Biomedical science",
                "uri": "http://edamontology.org/topic_3344"
            },
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/becas-biomedical-concept-annotation-tool-api-and-widget.html"
        }
    ],
    "publication": [
        {
            "abstract": "The continuous growth of the biomedical scientific literature has been motivating the development of text-mining tools able to efficiently process all this information. Although numerous domain-specific solutions are available, there is no web-based concept-recognition system that combines the ability to select multiple concept types to annotate, to reference external databases and to automatically annotate nested and intercepted concepts. BeCAS, the Biomedical Concept Annotation System, is an API for biomedical concept identification and a web-based tool that addresses these limitations. MEDLINE abstracts or free text can be annotated directly in the web interface, where identified concepts are enriched with links to reference databases. Using its customizable widget, it can also be used to augment external web pages with concept highlighting features. Furthermore, all text-processing and annotation features are made available through an HTTP REST API, allowing integration in any text-processing pipeline.Availability: BeCAS is freely available for non-commercial use at http://bioinformatics.ua.pt/becas.Contacts: or jlo@ua.pt © 2013 The Author 2013. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.",
            "authors": [
                "Nunes T.",
                "Campos D.",
                "Matos S.",
                "Oliveira J.L."
            ],
            "cit_count": 32,
            "journal": "Bioinformatics",
            "pmid": "23736528",
            "title": "BeCAS: Biomedical concept recognition services and visualization",
            "year": "2013-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:becas",
        "biotoolsID": "becas",
        "description": "Web application, API and widget for biomedical concept identification. It helps researchers, healthcare professionals and developers in the identification of over 1,200,000 biomedical concepts in text and PubMed abstracts.",
        "homepage": "http://bioinformatics.ua.pt/software/becas/",
        "name": "BECAS"
    }
}