{
    "additionDate": "2021-01-18T07:34:30Z",
    "biotoolsCURIE": "biotools:qmgr",
    "biotoolsID": "qmgr",
    "confidence_flag": "tool",
    "description": "A new approach for quantifying mitochondrial genome rearrangement.\n\nqMGR is an algorithm used to study the rearrangement of mitochondrial genomes. Using it, we can calculate rearrangement frequency of a single gene or rearrangement score of a single genome in a certain population.\n\n1. Input a benchmark arrangement.\n\nplease choose... Typical vertebrate arrangement Typical invertebrate arrangement.\n\n2. Input one or more mitogenome arrangements in a taxon.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://qmgr.hnnu.edu.cn/",
    "language": [
        "PHP",
        "Perl"
    ],
    "lastUpdate": "2021-01-31T12:27:31Z",
    "license": "LGPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zhanglab2019/qMGR"
        }
    ],
    "name": "qMGR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.MITO.2020.02.004",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V. and Mitochondria Research SocietyRearrangement is one of the most studied features in the animal mitochondrial genomes. The progress in high-throughput sequencing and comparative genomics has brought opportunities for systematic studies of mitochondrial genome rearrangements. However, there are few reports on globally examining mitogenome rearrangement and distinguishing the rearrangement frequency of each gene, which could contribute to a better understanding of its models and evolution. We presented qMGR, a new approach for large-scale quantifying mitogenome rearrangements considering a single gene as a structural unit. Compared to a reference arrangement, qMGR accumulates the changes of two nearest neighbor genes to calculate rearrangement score (RS) and rearrangement frequency (RF) of each single gene in the mitogenomes of a given taxonomic group. By accumulating RS of all genes in one genome, qMGR was developed to calculate each mitogenome rearrangement score, which can be used as a quantitative feature of the mitogenome rearrangement. Based on the frequency of rearrangement of each gene, qMGR can further detect the conserved gene set and high frequency rearrangement segments within the taxon. They may facilitate the assessment of rearrangement distances and understanding rearrangement mechanisms. qMGR web service is freely available at http://qmgr.hnnu.edu.cn/. The source code is available under GNU GPL at https://github.com/zhanglab2019/qMGR.",
                "authors": [
                    {
                        "name": "Hu S."
                    },
                    {
                        "name": "Kan X."
                    },
                    {
                        "name": "Miao G."
                    },
                    {
                        "name": "Sun Q."
                    },
                    {
                        "name": "Tian W."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 3,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Mitochondrion",
                "title": "qMGR: A new approach for quantifying mitochondrial genome rearrangement"
            },
            "pmid": "32045715"
        }
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
