{
    "additionDate": "2018-07-21T11:27:15Z",
    "biotoolsCURIE": "biotools:bicpams",
    "biotoolsID": "bicpams",
    "credit": [
        {
            "email": "rmch@tecnico.ulisboa.pt",
            "name": "Rui Henriques",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Powerful and flexible tool for the exploratory and unsupervised analysis of tabular and network data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://web.ist.utl.pt/rmch/bicpams/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://web.ist.utl.pt/rmch/bicpams/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "BicPAMS",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1493-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Biclustering has been largely applied for the unsupervised analysis of biological data, being recognised today as a key technique to discover putative modules in both expression data (subsets of genes correlated in subsets of conditions) and network data (groups of coherently interconnected biological entities). However, given its computational complexity, only recent breakthroughs on pattern-based biclustering enabled efficient searches without the restrictions that state-of-the-art biclustering algorithms place on the structure and homogeneity of biclusters. As a result, pattern-based biclustering provides the unprecedented opportunity to discover non-trivial yet meaningful biological modules with putative functions, whose coherency and tolerance to noise can be tuned and made problem-specific. Methods: To enable the effective use of pattern-based biclustering by the scientific community, we developed BicPAMS (Biclustering based on PAttern Mining Software), a software that: 1) makes available state-of-the-art pattern-based biclustering algorithms (BicPAM (Henriques and Madeira, Alg Mol Biol 9:27, 2014), BicNET (Henriques and Madeira, Alg Mol Biol 11:23, 2016), BicSPAM (Henriques and Madeira, BMC Bioinforma 15:130, 2014), BiC2PAM (Henriques and Madeira, Alg Mol Biol 11:1-30, 2016), BiP (Henriques and Madeira, IEEE/ACM Trans Comput Biol Bioinforma, 2015), DeBi (Serin and Vingron, AMB 6:1-12, 2011) and BiModule (Okada et al., IPSJ Trans Bioinf 48(SIG5):39-48, 2007)); 2) consistently integrates their dispersed contributions; 3) further explores additional accuracy and efficiency gains; and 4) makes available graphical and application programming interfaces. Results: Results on both synthetic and real data confirm the relevance of BicPAMS for biological data analysis, highlighting its essential role for the discovery of putative modules with non-trivial yet biologically significant functions from expression and network data. Conclusions: BicPAMS is the first biclustering tool offering the possibility to: 1) parametrically customize the structure, coherency and quality of biclusters; 2) analyze large-scale biological networks; and 3) tackle the restrictive assumptions placed by state-of-the-art biclustering algorithms. These contributions are shown to be key for an adequate, complete and user-assisted unsupervised analysis of biological data. Software: BicPAMS and its tutorial available in http://www.bicpams.com.",
                "authors": [
                    {
                        "name": "Ferreira F.L."
                    },
                    {
                        "name": "Henriques R."
                    },
                    {
                        "name": "Madeira S.C."
                    }
                ],
                "citationCount": 28,
                "date": "2017-02-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BicPAMS: Software for biological data analysis with pattern-based biclustering"
            },
            "pmcid": "PMC5290636",
            "pmid": "28153040"
        }
    ],
    "toolType": [
        "Desktop application",
        "Web API"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
