{
    "additionDate": "2017-02-10T11:35:23Z",
    "biotoolsCURIE": "biotools:rbde",
    "biotoolsID": "rbde",
    "description": "Constructs schematic diagrams of protein sequences to help observe the topology of secondary structure and transmembrane regions, free registration is required to use all features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Topology diagram drawing",
                    "uri": "http://edamontology.org/operation_2486"
                }
            ]
        }
    ],
    "homepage": "http://icb.med.cornell.edu/crt/RbDe/index.xml",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "RbDe",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "An algorithmic method for drawing residue-based schematic diagrams of proteins on a 2D page is presented and illustrated. The method allows the creation of rendering engines dedicated to a given family of sequences, or fold. The initial implementation provides an engine that can produce a 2D diagram representing secondary structure for any trans-membrane protein sequence. We present the details of the strategy for automating the drawing of these diagrams. The most important part of this strategy is the development of an algorithm for laying out residues of a loop that connects to arbitrary points of a 2D plane. As implemented, this algorithm is suitable for real-time modification of the loop layout. This work is of interest for the representation and analysis of data from (1) protein databases, (2) mutagenesis results, or (3) various kinds of protein context-dependent annotations or data. (C) 2000 by Elsevier Science Inc.",
                "authors": [
                    {
                        "name": "Campagne F."
                    },
                    {
                        "name": "Weinstein H."
                    }
                ],
                "citationCount": 13,
                "date": "1999-06-01T00:00:00Z",
                "journal": "Journal of Molecular Graphics and Modelling",
                "title": "Schematic representation of residue-based protein context-dependent data: An application to transmembrane proteins"
            },
            "pmid": "10736778"
        },
        {
            "metadata": {
                "abstract": "The residue-based diagram editor (RbDe) is web-based software that greatly simplifies the construction of schematic diagrams of proteins. Residue-based diagrams display the sequence of a given protein in the context of its secondary and tertiary structure. Such diagrams are frequently used to summarize mutations or sequence features, in the context of the overall topology of a protein. The initial version of RbDe was designed for transmembrane proteins and has enabled many users to create diagrams of large systems such as G protein-coupled receptors or transporters. We present an extended diagram editor that supports other families of proteins. Users can now import custom-diagram layouts, use them to render members of any protein family and generate high-quality output for publication purposes. RbDe is available free over the web, at http://icb.mssm.edu/crt/RbDe.",
                "authors": [
                    {
                        "name": "Campagne F."
                    },
                    {
                        "name": "Skrabanek L."
                    },
                    {
                        "name": "Weinstein H."
                    }
                ],
                "citationCount": 20,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Building protein diagrams on the web with the residue-based diagram editor RbDe"
            },
            "pmid": "12824436"
        },
        {
            "metadata": {
                "abstract": "We announce the Residue-based Diagram Editor (RbDe) web service that allows online construction of residue-based diagrams and the creation of stored diagram libraries. The service has been tuned for the construction of snake-like diagrams (for transmembrane proteins) but can be used to render any protein for which defined secondary structure data or hypotheses are available. RbDe is freely available through the Internet from our web site: http://transport.physbio.mssm.edu/rbde/RbDe.html. Licenses for intranet uses can be obtained upon request.",
                "authors": [
                    {
                        "name": "Campagne F."
                    },
                    {
                        "name": "Konvicka K."
                    },
                    {
                        "name": "Weinstein H."
                    }
                ],
                "citationCount": 21,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Protein Engineering",
                "title": "Interactive construction of residue-based diagrams of proteins: The RbDe web service"
            },
            "pmid": "10877849"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
