{
    "additionDate": "2021-01-18T11:36:05Z",
    "biotoolsCURIE": "biotools:retina",
    "biotoolsID": "retina",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "marquesjoaopedro@gmail.com",
            "name": "João Pedro Marques",
            "orcidid": "https://orcid.org/0000-0002-1014-0483",
            "typeEntity": "Person"
        }
    ],
    "description": "Design, development and deployment of a web-based interoperable registry for inherited retinal dystrophies in Portugal.\n\nDesign, Development and Deployment of a Web-Based Interoperable Registry for Inherited Retinal Dystrophies in Portugal – the IRD-PT.\n\nEm manutenção...por favor tente mais tarde!.\n\nIf you want to know what will expect you here shortly, check out the reel:.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/Ribopeaks (COM.)\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'retina.pt', 'Retina Study Group', 'registries increases', 'Retina Study'",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://retina.com.pt",
    "lastUpdate": "2021-02-06T13:43:46Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.retina.com.pt"
        }
    ],
    "name": "Retina",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S13023-020-01591-6",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: The development of multicenter patient registries promotes the generation of scientific knowledge by using real-world data. A country-wide, web-based registry for inherited retinal dystrophies (IRDs) empowers patients and community organizations, while supporting formal partnerships research. We aim to describe the design, development and deployment of a country-wide, with investigators and stakeholders in the global aim to develop high-value, high-utility web-based, user-friendly and interoperable registry for IRDs—the IRD-PT. Results: The IRD-PT is a clinical/genetic research registry included in the retina.pt platform (https://www.retina.com.pt), which was developed by the Portuguese Retina Study Group. The retina.pt platform collects data on individuals diagnosed with retinal diseases, from several sites across Portugal, with over 1800 participants and over 30,000 consultations to date. The IRD-PT module interacts with the retina.pt core system which provides a range of basic functions for patient data management, while the IRD-PT module allows data capture for the specific purpose of IRDs. All IRDs are coded accordingly to the International Statistical Classification of Diseases and Related Health Problems (ICD) 9, ICD 10, ICD 11, and Orphanet Rare Disease Ontology (ORPHA codes) to make the IRD-PT interoperable with other IRD registries across the world. Furthermore, the genes are coded according to the Ontology of Genes and Genomes and Online Mendelian Inheritance in Man, whereas signs and symptoms are coded according to the Human Phenotype Ontology. The IRD-PT module pre-launched at Centro Hospitalar e Universitário de Coimbra, the largest reference center for IRDs in Portugal. As of April 1st 2020, finalized data from 537 participants were available for this preliminary analysis. Conclusions: In the specific field of rare diseases, the use of registries increases research accessibility for individuals, while providing clinicians/investigators with a coherent data ecosystem necessary to boost research. Appropriate design and implementation of patient registries enables rapid decision making and ongoing data mining, ultimately leading to improved patient outcomes. We have described here the principles behind the design, development and deployment of a web-based, user-friendly and interoperable software tool aimed to generate important knowledge and collecting high-quality data on the epidemiology, genomic landscape and natural history of IRDs in Portugal.",
                "authors": [
                    {
                        "name": "Marques J.P."
                    },
                    {
                        "name": "Carvalho A.L."
                    },
                    {
                        "name": "Henriques J."
                    },
                    {
                        "name": "Murta J.N."
                    },
                    {
                        "name": "Saraiva J."
                    },
                    {
                        "name": "Silva R."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Orphanet Journal of Rare Diseases",
                "title": "Design, development and deployment of a web-based interoperable registry for inherited retinal dystrophies in Portugal: the IRD-PT"
            },
            "pmcid": "PMC7590677",
            "pmid": "33109251"
        },
        {
            "doi": "10.21203/RS.3.RS-29574/V3"
        }
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}