{
    "additionDate": "2020-01-14T09:14:50Z",
    "biotoolsCURIE": "biotools:ICCS",
    "biotoolsID": "ICCS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alberto.diaspro@iit.it",
            "name": "Alberto Diaspro",
            "typeEntity": "Person"
        },
        {
            "email": "luca.lanzano@iit.it",
            "name": "Luca Lanzanò",
            "typeEntity": "Person"
        }
    ],
    "description": "Nanoscale Distribution of Nuclear Sites by Super-Resolved Image Cross-Correlation Spectroscopy.\n\nUser-fiendly code for image cross-correlation specroscopy (ICCS) analysis based on the following article:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/llanzano/ICCS",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-11T08:46:56Z",
    "name": "ICCS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.BPJ.2019.10.036",
            "metadata": {
                "abstract": "© 2019 Biophysical SocietyDeciphering the spatiotemporal coordination between nuclear functions is important to understand its role in the maintenance of human genome. In this context, super-resolution microscopy has gained considerable interest because it can be used to probe the spatial organization of functional sites in intact single-cell nuclei in the 20–250 nm range. Among the methods that quantify colocalization from multicolor images, image cross-correlation spectroscopy (ICCS) offers several advantages, namely it does not require a presegmentation of the image into objects and can be used to detect dynamic interactions. However, the combination of ICCS with super-resolution microscopy has not been explored yet. Here, we combine dual-color stimulated emission depletion (STED) nanoscopy with ICCS (STED-ICCS) to quantify the nanoscale distribution of functional nuclear sites. We show that super-resolved ICCS provides not only a value of the colocalized fraction but also the characteristic distances associated to correlated nuclear sites. As a validation, we quantify the nanoscale spatial distribution of three different pairs of functional nuclear sites in MCF10A cells. As expected, transcription foci and a transcriptionally repressive histone marker (H3K9me3) are not correlated. Conversely, nascent DNA replication foci and the proliferating cell nuclear antigen(PCNA) protein have a high level of proximity and are correlated at a nanometer distance scale that is close to the limit of our experimental approach. Finally, transcription foci are found at a distance of 130 nm from replication foci, indicating a spatial segregation at the nanoscale. Overall, our data demonstrate that STED-ICCS can be a powerful tool for the analysis of the nanoscale distribution of functional sites in the nucleus.",
                "authors": [
                    {
                        "name": "Oneto M."
                    },
                    {
                        "name": "Scipioni L."
                    },
                    {
                        "name": "Sarmento M.J."
                    },
                    {
                        "name": "Cainero I."
                    },
                    {
                        "name": "Pelicci S."
                    },
                    {
                        "name": "Furia L."
                    },
                    {
                        "name": "Pelicci P.G."
                    },
                    {
                        "name": "Dellino G.I."
                    },
                    {
                        "name": "Bianchini P."
                    },
                    {
                        "name": "Faretta M."
                    },
                    {
                        "name": "Gratton E."
                    },
                    {
                        "name": "Diaspro A."
                    },
                    {
                        "name": "Lanzano L."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-03T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "Nanoscale Distribution of Nuclear Sites by Super-Resolved Image Cross-Correlation Spectroscopy"
            },
            "pmcid": "PMC6895719",
            "pmid": "31732142"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}