{
    "additionDate": "2023-09-07T12:12:40.610892Z",
    "biotoolsCURIE": "biotools:gdd",
    "biotoolsID": "gdd",
    "collectionID": [
        "gpcr"
    ],
    "description": "The GDD, a GPCR Decoy Database, with its accompanying GPCR Ligand Library (GLL) have been compiled to help in GPCR docking. The main characteristics of GLL and GDD are:\n\nSets of ligands and decoys for 147 GPCR targets.\nFor each ligand, 39 decoys were drawn from ZINC ensuring physical similarity of six properties (molecular weight, formal charge, hydrogen bond donors and acceptors, rotatable bonds and logP), but structural dissimilarity.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://cavasotto-lab.net/Databases/GDD/",
    "lastUpdate": "2024-02-14T09:35:16.444050Z",
    "name": "GPCR Decoy Database (GDD)",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1021/ci200412p",
            "metadata": {
                "abstract": "We compiled a G protein-coupled receptor (GPCR) ligand library (GLL) for 147 targets, selecting for each ligand 39 decoy molecules, collected in the GPCR Decoy Database (GDD). Decoys were chosen ensuring a ligand-decoy similarity of six physical properties, while enforcing ligand-decoy chemical dissimilarity. The performance in docking of the GDD was evaluated on 19 GPCRs, showing a marked decrease in enrichment compared to biasuncorrected decoy sets. Both the GLL and GDD are freely available for the scientific community. © 2011 American Chemical Society.",
                "authors": [
                    {
                        "name": "Cavasotto C.N."
                    },
                    {
                        "name": "Gatica E.A."
                    }
                ],
                "citationCount": 91,
                "date": "2012-01-23T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Ligand and decoy sets for docking to G protein-coupled receptors"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        }
    ]
}
