{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.biotec.tu-dresden.de/~bhuang/index.html"}],"documentation":[{"url":"http://www.biotec.tu-dresden.de/~bhuang/bdock/manual.html"}],"function":[{"operation":[{"term":"Protein docking","uri":"http://edamontology.org/operation_0478"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/bdock-grid-based-protein-protein-docking-software.html"}],"publication":[{"abstract":"Predicting protein interaction interfaces and protein complexes are two important related problems. For interface prediction, there are a number of tools, such as PPI-Pred, PPISP, PINUP, Promate, and SPPIDER, which predict enzyme-inhibitor interfaces with success rates of 23% to 55% and other interfaces with 10% to 28% on a benchmark dataset of 62 complexes. Here, we develop, metaPPI, a meta server for interface prediction. It significantly improves prediction success rates to 70% for enzyme-inhibitor and 44% for other interfaces. As shown with Promate, predicted interfaces can be used to improve protein docking. Here, we follow this idea using the meta server instead of individual predictions. We confirm that filtering with predicted interfaces significantly improves candidate generation in rigid-body docking based on shape complementarity. Finally, we show that the initial ranking of candidate solutions in rigid-body docking can be further improved for the class of enzyme-inhibitor complexes by a geometrical scoring which rewards deep pockets. A web server of metaPPI is available at scoppi.tu-dresden.de/metappi. The source code of our docking algorithm BDOCK is also available at www.biotec.tu-dresden.de/~bhuang/bdock. © 2008 Elsevier B.V. All rights reserved.","authors":["Huang B.","Schroeder M."],"cit_count":47,"doi":"10.1016/j.gene.2008.06.014","journal":"Gene","title":"Using protein binding site prediction to improve protein docking","type":"Primary","year":"2008-10-01"}],"summary":{"biotoolsCURIE":"biotools:bdock","biotoolsID":"bdock","description":"BDOCK is a novel enzyme-inhibitor docking algorithm based on the degree of burial and conservation of surface residues","homepage":"http://www.biotec.tu-dresden.de/~bhuang/bdock/","name":"BDOCK"}}