{
    "accessibility": "Open access",
    "additionDate": "2017-08-03T19:06:39Z",
    "biotoolsCURIE": "biotools:libroadrunner",
    "biotoolsID": "libroadrunner",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hsauro@uw.edu",
            "name": "Herbert M Sauro",
            "orcidid": "https://orcid.org/0000-0002-3659-6817"
        },
        {
            "name": "Kiri Choi",
            "orcidid": "https://orcid.org/0000-0002-0156-8410"
        },
        {
            "name": "Matthias König",
            "orcidid": "https://orcid.org/0000-0003-1725-179X"
        },
        {
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://libroadrunner.org/contact/"
        }
    ],
    "description": "Extensible, high-performance, cross-platform, open-source software library for the simulation and analysis of models expressed using Systems Biology Markup Language (SBML).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://libroadrunner.org/documentation-2/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://www.libroadrunner.org",
    "language": [
        "C",
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:58:48.503096Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/libroadrunner-high-performance-sbml-jit-compiler-simulation-engine.html"
        }
    ],
    "name": "libRoadRunner",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac770",
            "metadata": {
                "abstract": "Motivation: This article presents libRoadRunner 2.0, an extensible, high-performance, cross-platform, open-source software library for the simulation and analysis of models expressed using the systems biology markup language (SBML). Results: libRoadRunner is a self-contained library, able to run either as a component inside other tools via its Cþþ, C and Python APIs, or interactively through its Python or Julia interface. libRoadRunner uses a custom just-in-time (JIT) compiler built on the widely used LLVM JIT compiler framework. It compiles SBML-specified models directly into native machine code for a large variety of processors, making it fast enough to simulate extremely large models or repeated runs in reasonable timeframes. libRoadRunner is flexible, supporting the bulk of the SBML specification (except for delay and non-linear algebraic equations) as well as several SBML extensions such as hierarchical composition and probability distributions. It offers multiple deterministic and stochastic integrators, as well as tools for steady-state, sensitivity, stability and structural analyses.",
                "authors": [
                    {
                        "name": "Choi K."
                    },
                    {
                        "name": "Konig M."
                    },
                    {
                        "name": "Sauro H.M."
                    },
                    {
                        "name": "Smith L."
                    },
                    {
                        "name": "Welsh C."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "citationCount": 11,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "libRoadRunner 2.0: a high performance SBML simulation and analysis library"
            },
            "pmcid": "PMC9825722",
            "pmid": "36478036"
        },
        {
            "doi": "10.1093/bioinformatics/btv363",
            "metadata": {
                "abstract": "Motivation: This article presents libRoadRunner, an extensible, high-performance, cross-platform, open-source software library for the simulation and analysis of models expressed using Systems Biology Markup Language (SBML). SBML is the most widely used standard for representing dynamic networks, especially biochemical networks. libRoadRunner is fast enough to support large-scale problems such as tissue models, studies that require large numbers of repeated runs and interactive simulations. Results: libRoadRunner is a self-contained library, able to run both as a component inside other tools via its C++ and C bindings, and interactively through its Python interface. Its Python Application Programming Interface (API) is similar to the APIs of MATLAB (www.mathworks.com) and SciPy (http://www.scipy.org/), making it fast and easy to learn. libRoadRunner uses a custom Just-In-Time (JIT) compiler built on the widely used LLVM JIT compiler framework. It compiles SBML-specified models directly into native machine code for a variety of processors, making it appropriate for solving extremely large models or repeated runs. libRoadRunner is flexible, supporting the bulk of the SBML specification (except for delay and non-linear algebraic equations) including several SBML extensions (composition and distributions). It offers multiple deterministic and stochastic integrators, as well as tools for steady-state analysis, stability analysis and structural analysis of the stoichiometric matrix. Availability and implementation: libRoadRunner binary distributions are available for Mac OS X, Linux and Windows. The library is licensed under Apache License Version 2.0. libRoadRunner is also available for ARM-based computers such as the Raspberry Pi. http://www.libroadrunner.org provides online documentation, full build instructions, binaries and a git source repository.",
                "authors": [
                    {
                        "name": "Bouteiller J.-M."
                    },
                    {
                        "name": "Glazier J.A."
                    },
                    {
                        "name": "Konig M."
                    },
                    {
                        "name": "Medley J.K."
                    },
                    {
                        "name": "Sauro H.M."
                    },
                    {
                        "name": "Somogyi E.T."
                    },
                    {
                        "name": "Swat M.H."
                    }
                ],
                "citationCount": 93,
                "date": "2015-03-25T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LibRoadRunner: A high performance SBML simulation and analysis library"
            },
            "pmcid": "PMC4607739",
            "pmid": "26085503"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
