{
    "additionDate": "2023-01-26T14:56:04.484932Z",
    "biotoolsCURIE": "biotools:bgnet",
    "biotoolsID": "bgnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hliu@ict.ac.cn",
            "name": "Hong Liu",
            "typeEntity": "Person"
        },
        {
            "email": "huishuy@vip.163.com",
            "name": "Hui-Shu Yuan",
            "typeEntity": "Person"
        },
        {
            "email": "jiangliang@bjmu.edu.cn",
            "name": "Liang Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "Classification of benign and malignant tumors with MRI multi-plane attention learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/research-med/BgNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-26T14:56:04.487732Z",
    "license": "Not licensed",
    "name": "BgNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FONC.2022.971871",
            "metadata": {
                "abstract": "Copyright © 2022 Liu, Jiao, Xing, Ou-Yang, Yuan, Liu, Li, Wang, Lang, Qian, Jiang, Yuan and Wang.Objectives: To propose a deep learning-based classification framework, which can carry out patient-level benign and malignant tumors classification according to the patient’s multi-plane images and clinical information. Methods: A total of 430 cases of spinal tumor, including axial and sagittal plane images by MRI, of which 297 cases for training (14072 images), and 133 cases for testing (6161 images) were included. Based on the bipartite graph and attention learning, this study proposed a multi-plane attention learning framework, BgNet, for benign and malignant tumor diagnosis. In a bipartite graph structure, the tumor area in each plane is used as the vertex of the graph, and the matching between different planes is used as the edge of the graph. The tumor areas from different plane images are spliced at the input layer. And based on the convolutional neural network ResNet and visual attention learning model Swin-Transformer, this study proposed a feature fusion model named ResNetST for combining both global and local information to extract the correlation features of multiple planes. The proposed BgNet consists of five modules including a multi-plane fusion module based on the bipartite graph, input layer fusion module, feature layer fusion module, decision layer fusion module, and output module. These modules are respectively used for multi-level fusion of patient multi-plane image data to realize the comprehensive diagnosis of benign and malignant tumors at the patient level. Results: The accuracy (ACC: 79.7%) of the proposed BgNet with multi-plane was higher than that with a single plane, and higher than or equal to the four doctors’ ACC (D1: 70.7%, p=0.219; D2: 54.1%, p<0.005; D3: 79.7%, p=0.006; D4: 72.9%, p=0.178). Moreover, the diagnostic accuracy and speed of doctors can be further improved with the aid of BgNet, the ACC of D1, D2, D3, and D4 improved by 4.5%, 21.8%, 0.8%, and 3.8%, respectively. Conclusions: The proposed deep learning framework BgNet can classify benign and malignant tumors effectively, and can help doctors improve their diagnostic efficiency and accuracy. The code is available at https://github.com/research-med/BgNet.",
                "authors": [
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Jiao M.-L."
                    },
                    {
                        "name": "Lang N."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Liu J.-F."
                    },
                    {
                        "name": "Ou-Yang H.-Q."
                    },
                    {
                        "name": "Qian Y.-L."
                    },
                    {
                        "name": "Wang C.-J."
                    },
                    {
                        "name": "Wang X.-D."
                    },
                    {
                        "name": "Xing X.-Y."
                    },
                    {
                        "name": "Yuan H.-S."
                    },
                    {
                        "name": "Yuan Y."
                    }
                ],
                "date": "2022-10-27T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "BgNet: Classification of benign and malignant tumors with MRI multi-plane attention learning"
            },
            "pmcid": "PMC9646829",
            "pmid": "36387085"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}
