{
    "additionDate": "2019-05-19T07:38:03Z",
    "biotoolsCURIE": "biotools:EEG",
    "biotoolsID": "EEG",
    "description": "Platform to enable EEG measurements and general purposes Brain Computer Interface experimentations.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://openeeg.sourceforge.net/",
    "lastUpdate": "2019-05-20T07:14:52Z",
    "name": "Open-Electroencephalography (EEG)",
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.3390/s19040772",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.The Open-electroencephalography (EEG) framework is a popular platform to enable EEG measurements and general purposes Brain Computer Interface experimentations. However, the current platform is limited by the number of available channels and electrode compatibility. In this paper we present a fully configurable platform with up to 32 EEG channels and compatibility with virtually any kind of passive electrodes including textile, rubber and contactless electrodes. Together with the full hardware details, results and performance on a single volunteer participant (limited to alpha wave elicitation), we present the brain computer interface (BCI)2000 EEG source driver together with source code as well as the compiled (.exe). In addition, all the necessary device firmware, gerbers and bill of materials for the full reproducibility of the presented hardware is included. Furthermore, the end user can vary the dry-electrode reference circuitry, circuit bandwidth as well as sample rate to adapt the device to other generalized biopotential measurements. Although, not implemented in the tested prototype, the Biomedical Analogue to Digital Converter BIOADC naturally supports SPI communication for an additional 32 channels including the gain controller. In the appendix we describe the necessary modification to the presented hardware to enable this function.",
                "authors": [
                    {
                        "name": "Gargiulo G.D."
                    },
                    {
                        "name": "Bifulco P."
                    },
                    {
                        "name": "Cesarelli M."
                    },
                    {
                        "name": "McEwan A."
                    },
                    {
                        "name": "Nikpour A."
                    },
                    {
                        "name": "Jin C."
                    },
                    {
                        "name": "Gunawardana U."
                    },
                    {
                        "name": "Sreenivasan N."
                    },
                    {
                        "name": "Wabnitz A."
                    },
                    {
                        "name": "Hamilton T.J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-02-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Fully open-access passive dry electrodes BIOADC: Open-electroencephalography (EEG) re-invented"
            },
            "pmcid": "PMC6413114",
            "pmid": "30781869",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}