{
    "accessibility": "Open access",
    "additionDate": "2023-01-09T23:13:54.707010Z",
    "biotoolsCURIE": "biotools:divcom",
    "biotoolsID": "divcom",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ilias.lagkouvardos@tum.de",
            "name": "Ilias Lagkouvardos",
            "typeEntity": "Person"
        },
        {
            "name": "Evangelia Intze"
        }
    ],
    "description": "A Tool for Systematic Partition of Groups of Microbial Profiles Into Intrinsic Subclusters and Distance-Based Subgroup Comparisons.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Lagkouvardos/DivCom",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:13:03.783521Z",
    "license": "MIT",
    "name": "DivCom",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fbinf.2022.864382",
            "metadata": {
                "abstract": "When analyzing microbiome data, one of the main objectives is to effectively compare the microbial profiles of samples belonging to different groups. Beta diversity measures the level of similarity among samples, usually in the form of dissimilarity matrices. The use of suitable statistical tests in conjunction with those matrices typically provides us with all the necessary information to evaluate the overall similarity of groups of microbial communities. However, in some cases, this approach can lead us to deceptive conclusions, mainly due to the uneven dispersions of the groups and the existence of unique or unexpected substructures in the dataset. To address these issues, we developed divide and compare (DivCom), an automated tool for advanced beta diversity analysis. DivCom reveals the inner structure of groups by dividing their samples into the appropriate number of clusters and then compares the distances of every profile to the centers of these clusters. This information can be used for determining the existing interrelation of the groups. The proposed methodology and the developed tool were assessed by comparing the response of anemic patients with or without inflammatory bowel disease to different iron replacement therapies. DivCom generated results that revealed the inner structure of the dataset, evaluated the relationship among the clusters, and assessed the effect of the treatments. The DivCom tool is freely available at: https://github.com/Lagkouvardos/DivCom.",
                "authors": [
                    {
                        "name": "Intze E."
                    },
                    {
                        "name": "Lagkouvardos I."
                    }
                ],
                "citationCount": 2,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "DivCom: A Tool for Systematic Partition of Groups of Microbial Profiles Into Intrinsic Subclusters and Distance-Based Subgroup Comparisons"
            },
            "pmcid": "PMC9580884",
            "pmid": "36304338"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
