{
    "additionDate": "2015-12-06T15:18:10Z",
    "biotoolsCURIE": "biotools:mlst-db",
    "biotoolsID": "mlst-db",
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "bjorn.herrmann@medsci.uu.se",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Chlamydia trachomatis multilocus sequence typing (MLST) database.",
    "documentation": [
        {
            "type": "General",
            "url": "http://mlstdb.bmc.uu.se/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence features",
                        "uri": "http://edamontology.org/data_1255"
                    }
                }
            ]
        }
    ],
    "homepage": "http://mlstdb.bmc.uu.se/",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "MLST-DB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mikael.borg@bils.se",
    "publication": [
        {
            "doi": "10.1186/1471-2105-5-86",
            "metadata": {
                "abstract": "Background: Multi-locus sequence typing (MLST) is a method of typing that facilitates the discrimination of microbial isolates by comparing the sequences of housekeeping gene fragments. The mlstdbNet software enables the implementation of distributed web-accessible MLST databases that can be linked widely over the Internet. Results: The software enables multiple isolate databases to query a single profiles database that contains allelic profile and sequence definitions. This separation enables isolate databases to be established by individual laboratories, each customised to the needs of the particular project and with appropriate access restrictions, while maintaining the benefits of a single definitive source of profile and sequence information. Databases are described by an XML file that is parsed by a Perl CGI script. The software offers a large number of ways to query the databases and to further break down and export the results generated. Additional features can be enabled by installing third-party (freely available) tools. Conclusion: Development of a distributed structure for MLST databases offers scalability and flexibility, allowing participating centres to maintain ownership of their own data, without introducing duplication and data integrity issues. © 2004 Jolley et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Jolley K.A."
                    },
                    {
                        "name": "Chan M.-S."
                    },
                    {
                        "name": "Maiden M.C.J."
                    }
                ],
                "citationCount": 379,
                "date": "2004-07-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "mlstdbNet - Distributed multi-locus sequence typing (MLST) databases"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}