{
    "additionDate": "2021-01-18T10:47:39Z",
    "biotoolsCURIE": "biotools:idrbp_mmc",
    "biotoolsID": "idrbp_mmc",
    "confidence_flag": "tool",
    "description": "Identifying DNA-Binding Proteins and RNA-Binding Proteins Based on Multi-Label Learning Model and Motif-Based Convolutional Neural Network.\n\nA new sequence-based computational predictor for identifying DNA-binding proteins and RNA-binding proteins. In which, multi-label learning and a novel motif-based convolution neural network were employed. It reduced the cross prediction between DNA-binding proteins and RNA-binding proteins and improved the predictive perfermance for identification of DNA-binding proteins and RNA-binding proteins. It is a useful tool for nucleic acid binding protein prediction. The framework and working process of iDRBP_MMC are shown in Fig.1.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/iDRBP_MMC",
    "lastUpdate": "2021-02-03T07:28:10Z",
    "name": "iDRBP_MMC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2020.09.008",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdDNA-binding protein (DBP) and RNA-binding protein (RBP) are playing crucial roles in gene expression. Accurate identification of them is of great significance, and accurately computational predictors are highly required. In previous studies, DBP recognition and RBP recognition were treated as two separate tasks. Because the functional and structural similarities between DBPs and RBPs are high, the DBP predictors tend to predict RBPs as DBPs, while the RBP predictors tend to predict the DBPs as the RBPs, leading to high cross-prediction rate and low prediction precision. Here we introduced a multi-label learning model based on the motif-based convolutional neural network, and a sequence-based computational method called iDRBP_MMC was proposed to solve the cross-prediction problem so as to improve the predictive performance of DBPs and RBPs. The results on four test datasets showed that it outperformed other state-of-the-art DBP predictors and RBP predictors. When applied to analyze the tomato genome, the results reveal the ability of iDRBP_MMC for large-scale data analysis. Moreover, iDRBP_MMC can identify the proteins binding to both DNA and RNA, which is beyond the scope of existing DBP predictors or RBP predictors. The web-server of iDRBP_MMC is freely available at http://bliulab.net/iDRBP_MMC.",
                "authors": [
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-06T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "iDRBP_MMC: Identifying DNA-Binding Proteins and RNA-Binding Proteins Based on Multi-Label Learning Model and Motif-Based Convolutional Neural Network"
            },
            "pmid": "32920048"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ]
}
