{
    "additionDate": "2021-01-18T07:09:33Z",
    "biotoolsCURIE": "biotools:glassesviewer",
    "biotoolsID": "glassesviewer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "diederick_c.niehorster@humlab.lu.se",
            "name": "Diederick C. Niehorster",
            "orcidid": "https://orcid.org/0000-0002-4672-8756",
            "typeEntity": "Person"
        }
    ],
    "description": "Open-source software for viewing and analyzing data from the Tobii Pro Glasses 2 eye tracker.\n\nThis matlab utility can parse recording files from the Tobii Glasses 2 as stored on the SD card (no need for intervening Tobii software). Once parsed, it will display this data in a MATLAB GUI. Optional eye videos are also supported. In this GUI, sync events can be shown, and data can be optionally annotated (e.g. as slow and fast phase intervals) by hand or by a classifier algorithm, or such annotations can be loaded from file.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dcnieho/GlassesViewer",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-23T10:07:41Z",
    "name": "GlassesViewer",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3758/S13428-019-01314-1",
            "metadata": {
                "abstract": "© 2019, The Author(s).We present GlassesViewer, open-source software for viewing and analyzing eye-tracking data of the Tobii Pro Glasses 2 head-mounted eye tracker as well as the scene and eye videos and other data streams (pupil size, gyroscope, accelerometer, and TTL input) that this headset can record. The software provides the following functionality written in MATLAB: (1) a graphical interface for navigating the study- and recording structure produced by the Tobii Glasses 2; (2) functionality to unpack, parse, and synchronize the various data and video streams comprising a Glasses 2 recording; and (3) a graphical interface for viewing the Glasses 2’s gaze direction, pupil size, gyroscope and accelerometer time-series data, along with the recorded scene and eye camera videos. In this latter interface, segments of data can furthermore be labeled through user-provided event classification algorithms or by means of manual annotation. Lastly, the toolbox provides integration with the GazeCode tool by Benjamins et al. (2018), enabling a completely open-source workflow for analyzing Tobii Pro Glasses 2 recordings.",
                "authors": [
                    {
                        "name": "Benjamins J.S."
                    },
                    {
                        "name": "Hessels R.S."
                    },
                    {
                        "name": "Niehorster D.C."
                    }
                ],
                "citationCount": 10,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "GlassesViewer: Open-source software for viewing and analyzing data from the Tobii Pro Glasses 2 eye tracker"
            },
            "pmcid": "PMC7280338",
            "pmid": "31898293"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
