{
    "accessibility": "Open access",
    "additionDate": "2023-02-08T10:28:54.200956Z",
    "biotoolsCURIE": "biotools:mddi-scl",
    "biotoolsID": "mddi-scl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dqwei@sjtu.edu.cn",
            "name": "Dong-Qing Wei",
            "typeEntity": "Person"
        },
        {
            "email": "xiongyi@sjtu.edu.cn",
            "name": "Yi Xiong",
            "typeEntity": "Person"
        },
        {
            "name": "Shenggeng Lin"
        },
        {
            "name": "Weizhi Chen"
        }
    ],
    "description": "Predicting multi-type drug-drug interactions via supervised contrastive learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ShenggengLin/MDDI-SCL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-08T10:28:54.203616Z",
    "license": "MIT",
    "name": "MDDI-SCL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S13321-022-00659-8",
            "metadata": {
                "abstract": "© 2022, The Author(s).The joint use of multiple drugs may cause unintended drug-drug interactions (DDIs) and result in adverse consequence to the patients. Accurate identification of DDI types can not only provide hints to avoid these accidental events, but also elaborate the underlying mechanisms by how DDIs occur. Several computational methods have been proposed for multi-type DDI prediction, but room remains for improvement in prediction performance. In this study, we propose a supervised contrastive learning based method, MDDI-SCL, implemented by three-level loss functions, to predict multi-type DDIs. MDDI-SCL is mainly composed of three modules: drug feature encoder and mean squared error loss module, drug latent feature fusion and supervised contrastive loss module, multi-type DDI prediction and classification loss module. The drug feature encoder and mean squared error loss module uses self-attention mechanism and autoencoder to learn drug-level latent features. The drug latent feature fusion and supervised contrastive loss module uses multi-scale feature fusion to learn drug pair-level latent features. The prediction and classification loss module predicts DDI types of each drug pair. We evaluate MDDI-SCL on three different tasks of two datasets. Experimental results demonstrate that MDDI-SCL achieves better or comparable performance as the state-of-the-art methods. Furthermore, the effectiveness of supervised contrastive learning is validated by ablation experiment, and the feasibility of MDDI-SCL is supported by case studies. The source codes are available at https://github.com/ShenggengLin/MDDI-SCL.",
                "authors": [
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Wei D.-Q."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Zhou S."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "MDDI-SCL: predicting multi-type drug-drug interactions via supervised contrastive learning"
            },
            "pmcid": "PMC9667597",
            "pmid": "36380384"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
