{
    "additionDate": "2018-05-12T10:26:21Z",
    "biotoolsCURIE": "biotools:coman",
    "biotoolsID": "coman",
    "credit": [
        {
            "email": "yueqiong.ni@hku.hk",
            "name": "Yueqiong Ni",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comprehensive metatranscriptomics analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://147.8.185.62/COMAN/instructions.psp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://147.8.185.62/COMAN/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "COMAN",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-016-2964-Z",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Microbiota-oriented studies based on metagenomic or metatranscriptomic sequencing have revolutionised our understanding on microbial ecology and the roles of both clinical and environmental microbes. The analysis of massive metatranscriptomic data requires extensive computational resources, a collection of bioinformatics tools and expertise in programming. Results: We developed COMAN (Comprehensive Metatranscriptomics Analysis), a web-based tool dedicated to automatically and comprehensively analysing metatranscriptomic data. COMAN pipeline includes quality control of raw reads, removal of reads derived from non-coding RNA, followed by functional annotation, comparative statistical analysis, pathway enrichment analysis, co-expression network analysis and high-quality visualisation. The essential data generated by COMAN are also provided in tabular format for additional analysis and integration with other software. The web server has an easy-to-use interface and detailed instructions, and is freely available at http://sbb.hku.hk/COMAN/ Conclusions: COMAN is an integrated web server dedicated to comprehensive functional analysis of metatranscriptomic data, translating massive amount of reads to data tables and high-standard figures. It is expected to facilitate the researchers with less expertise in bioinformatics in answering microbiota-related biological questions and to increase the accessibility and interpretation of microbiota RNA-Seq data.",
                "authors": [
                    {
                        "name": "Ni Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Panagiotou G."
                    }
                ],
                "citationCount": 12,
                "date": "2016-08-11T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "COMAN: A web server for comprehensive metatranscriptomics analysis"
            },
            "pmcid": "PMC4982211",
            "pmid": "27515514"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}