
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://darwin.uvigo.es/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/mitobank-2-1-automatic-retrieval-parsing-mitochondrial-genomes.html"
        }
    ],
    "publication": [
        {
            "abstract": "A statistical approach was applied to select those models that best fit each individual mitochondrial (mt) protein at different taxonomic levels of metazoans. The existing mitochondrial replacement matrices, MtREV and MtMam, were found to be the best-fit models for the mt-proteins of vertebrates, with the exception of Nd6, at different taxonomic levels. Remarkably, existing mitochondrial matrices generally failed to best-fit invertebrate mt-proteins. In an attempt to better model the evolution of invertebrate mt-proteins, a new replacement matrix, named MtArt, was constructed based on arthropod mt-proteomes. The new model was found to best fit almost all analyzed invertebrate mt-protein data sets. The observed pattern of model fit across the different data sets indicates that no single replacement matrix is able to describe the general evolutionary properties of mt-proteins but rather that taxonomical biases and/or the existence of different mt-genetic codes have great influence on which model is selected. © The Author 2006. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.",
            "authors": [
                "Abascal F.",
                "Posada D.",
                "Zardoya R."
            ],
            "cit_count": 102,
            "doi": "10.1093/molbev/msl136",
            "journal": "Molecular Biology and Evolution",
            "title": "MtArt: A new model of amino acid replacement for Arthropoda",
            "type": "Primary",
            "year": "2007-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mitobank",
        "biotoolsID": "mitobank",
        "description": "MitoBank is a simple perl script to obtain from GeneBank mitochondrial genomes, parse them, and store the different genes in separate files. It can be used to retrieve both coding genes and RNA genes. Coding genes might be obtained in their amino acid or nucleotide sequence.",
        "homepage": "http://darwin.uvigo.es/software/mitobank.html",
        "name": "MitoBank",
        "version": [
            "2.1"
        ]
    }
}