{
    "additionDate": "2017-12-18T00:06:43Z",
    "biotoolsCURIE": "biotools:genehunter",
    "biotoolsID": "genehunter",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.broadinstitute.org/"
        }
    ],
    "description": "Allows the very rapid extraction of complete multipoint inheritance information from pedigrees of moderate size. This information is used in exact computation of multipoint LOD scores and in a method of non-parametric linkage analysis. The multipoint inheritance information allows the reconstruction of maximum-likelihood haplotypes for all individuals in the pedigree and information content mapping which measures the fraction of the total inheritance information extracted from the marker data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.broadinstitute.org/ftp/distribution/software/genehunter/",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-01-15T03:06:16Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/genehunter-2-1-multipoint-analysis-pedigree-data.html"
        }
    ],
    "name": "GENEHUNTER",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "In complex disease studies, it is crucial to perform multipoint linkage analysis with many markers and to use robust nonparametric methods that take account of all pedigree information. Currently available methods fall short in both regards. In this paper, we describe how to extract complete multipoint inheritance information from general pedigrees of moderate size. This information is captured in the multipoint inheritance distribution, which provides a framework for a unified approach to both parametric and nonparametric methods of linkage analysis. Specifically, the approach includes the following: (1) Rapid exact computation of multipoint LOD scores involving dozens of highly polymorphic markers, even in the presence of loops and missing data. (2) Nonparametric linkage (NPL) analysis, a powerful new approach to pedigree analysis. We show that NPL is robust to uncertainty about mode of inheritance, is much more powerful than commonly used nonparametric methods, and loses little power relative to parametric linkage analysis. NPL thus appears to be the method of choice for pedigree studies of complex traits. (3) Information-content mapping, which measures the fraction of the total inheritance information extracted by the available marker data and points out the regions in which typing additional markers is most useful. (4) Maximum-likelihood reconstruction of many-marker haplotypes, even in pedigrees with missing data. We have implemented NPL analysis, LOD-score computation, information-content mapping, and haplotype reconstruction in a new computer package, GENEHUNTER. The package allows efficient multipoint analysis of pedigree data to be performed rapidly in a single user-friendly environment.",
                "authors": [
                    {
                        "name": "Daly M.J."
                    },
                    {
                        "name": "Kruglyak L."
                    },
                    {
                        "name": "Lander E.S."
                    },
                    {
                        "name": "Reeve-Daly M.P."
                    }
                ],
                "citationCount": 2546,
                "date": "1996-05-29T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Parametric and nonparametric linkage analysis: A unified multipoint approach"
            },
            "pmcid": "PMC1915045",
            "pmid": "8651312",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Linkage",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "2.1"
    ]
}
