{
    "additionDate": "2021-10-27T12:38:00.433122Z",
    "biotoolsCURIE": "biotools:strawberry",
    "biotoolsID": "strawberry",
    "description": "Strawberry is a C++ program for fast and accurate ab initio transcript reconstruction and quantification from RNA-seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ruolin/strawberry",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-10-27T16:05:19.332519Z",
    "license": "MIT",
    "name": "Strawberry",
    "owner": "gallardoalba",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005851",
            "metadata": {
                "abstract": "© 2017 Liu, Dickerson.We propose a novel method and software tool, Strawberry, for transcript reconstruction and quantification from RNA-Seq data under the guidance of genome alignment and independent of gene annotation. Strawberry consists of two modules: assembly and quantification. The novelty of Strawberry is that the two modules use different optimization frameworks but utilize the same data graph structure, which allows a highly efficient, expandable and accurate algorithm for dealing large data. The assembly module parses aligned reads into splicing graphs, and uses network flow algorithms to select the most likely transcripts. The quantification module uses a latent class model to assign read counts from the nodes of splicing graphs to transcripts. Strawberry simultaneously estimates the transcript abundances and corrects for sequencing bias through an EM algorithm. Based on simulations, Strawberry outperforms Cufflinks and StringTie in terms of both assembly and quantification accuracies. Under the evaluation of a real data set, the estimated transcript expression by Strawberry has the highest correlation with Nanostring probe counts, an independent experiment measure for transcript expression. Availability: Strawberry is written in C++14, and is available as open source software at https://github.com/ruolin/strawberry under the MIT license.",
                "authors": [
                    {
                        "name": "Dickerson J."
                    },
                    {
                        "name": "Liu R."
                    }
                ],
                "citationCount": 11,
                "date": "2017-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Strawberry: Fast and accurate genome-guided transcript reconstruction and quantification from RNA-Seq"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "version": [
        "1.1.2"
    ]
}
