{
    "additionDate": "2021-01-18T11:00:31Z",
    "biotoolsCURIE": "biotools:pybios",
    "biotoolsID": "pybios",
    "confidence_flag": "tool",
    "description": "A freeware computer software for analysis of cardiovascular signals.\n\nPyBioS was developed in Python language with an intuitive, user-friendly graphical user interface. The basic steps for using PyBioS comprise the opening or creation (simulation) of signals, their visualization, preprocessing and analysis\nAny interested researcher can obtain PyBioS free of charge upon request to the email luizeduardo@usp.br or luizeduardovs@gmail.com.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=32866762",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-08T12:19:20Z",
    "name": "PyBioS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2020.105718",
            "metadata": {
                "abstract": "© 2020Background and Objective: Several software applications have been proposed in the past years as computational tools for assessing biomedical signals. Many of them are focused on heart rate variability series only, with their strengths and limitations depending on the necessity of the user and the scope of the application. Here, we introduce new software, named PyBioS, intended for the analysis of cardiovascular signals, even though any type of biomedical signal can be used. PyBioS has some functionalities that differentiate it from the other software. Methods: PyBioS was developed in Python language with an intuitive, user-friendly graphical user interface. The basic steps for using PyBioS comprise the opening or creation (simulation) of signals, their visualization, preprocessing and analysis. Currently, PyBioS has 8 preprocessing tools and 15 analysis methods, the later providing more than 50 metrics for analysis of the signals’ dynamics. Results: The possibility to create simulated signals and save the preprocessed signals is a strength of PyBioS. Besides, the software allows batch processing of files, making the analysis of a large amount of data easy and fast. Finally, PyBioS has plenty of analysis methods implemented, with the focus on nonlinear and complexity analysis of signals and time series. Conclusions: Although PyBioS is not intended to overcome all the necessities from users, it has useful functionalities that may be helpful in many situations. Moreover, PyBioS is continuously under improvement and several simulated signals, tools and analysis methods are still to be implemented. Also, a new module is being implemented on it to provide machine learning algorithms for classification and regression of data extracted from the biomedical signals.",
                "authors": [
                    {
                        "name": "Fazan R."
                    },
                    {
                        "name": "Marin-Neto J.A."
                    },
                    {
                        "name": "Silva L.E.V."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "PyBioS: A freeware computer software for analysis of cardiovascular signals"
            },
            "pmid": "32866762"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
