{
    "additionDate": "2019-11-14T18:29:08Z",
    "biotoolsCURIE": "biotools:GSSO",
    "biotoolsID": "GSSO",
    "confidence_flag": "tool",
    "description": "The Gender, Sex, and Sexual Orientation (GSSO) Ontology | GSSO is the Gender, Sex, and Sex Orientation ontology, including terms related to gender identity and expression, sexual and romantic identity and orientation, and sexual and reproductive behavior | Gender, Sex, and Sexual Orientation",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Superraptor/GSSO",
    "lastUpdate": "2020-12-07T08:30:34Z",
    "license": "Apache-2.0",
    "name": "GSSO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3233/SHTI190213",
            "metadata": {
                "abstract": "© 2019 International Medical Informatics Association (IMIA) and IOS Press. This article is published online with Open Access by IOS Press and distributed under the terms of the Creative Commons Attribution Non-Commercial License 4.0 (CC BY-NC 4.0).Cultural attitudes, linguistic variation, and historical pathology have led to a plethora of terms concerning gender, sex, and sexual orientation that have caused confusion and uneasiness among both lay people and relevant professionals. For members of the LGBTQIA+ community, these negative reactions are compounded by identities which have historically and contemporarily been mistreated by medical professionals. In an effort to provide a reliable resource for patients and clinicians, we have created the Gender, Sex, and Sexual Orientation (GSSO) ontology, which currently includes over 4,000 entities from multiple disciplines. The GSSO is a manually curated resource utilizing related glossaries from biology, medicine, psychology, sociology, and gender studies. With links to over 20 other ontology resources such as SNOMED-CT and MedDRA, the GSSO aims for accessibility and interoperability with existing systems. It is also open-source and features an easy-to-use web interface (https://github.com/Superraptor/GSSO). Future work involves multiple language support efforts and empirical evaluation.",
                "authors": [
                    {
                        "name": "Kronk C."
                    },
                    {
                        "name": "Tran G.Q."
                    },
                    {
                        "name": "Wu D.T.Y."
                    }
                ],
                "citationCount": 3,
                "date": "2019-08-21T00:00:00Z",
                "journal": "Studies in Health Technology and Informatics",
                "title": "Creating a queer ontology: The gender, sex, and sexual orientation (GSSO) ontology"
            },
            "pmid": "31437915"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Gender medicine",
            "uri": "http://edamontology.org/topic_3410"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}