{
    "additionDate": "2015-01-22T11:45:56Z",
    "biotoolsCURIE": "biotools:phostryp",
    "biotoolsID": "phostryp",
    "credit": [
        {
            "name": "ELIXIR-ITA-TORVERGATA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "citterich@uniroma2.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A phosphorylation site predictor specific for parasitic protozoa of the family trypanosomatidae.",
    "documentation": [
        {
            "type": "General",
            "url": "http://phostryp.bio.uniroma2.it/usage.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://phostryp.bio.uniroma2.it",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "PhosTryp",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-TORVERGATA",
    "publication": [
        {
            "doi": "10.1186/1471-2164-12-614",
            "metadata": {
                "abstract": "Background: Protein phosphorylation modulates protein function in organisms at all levels of complexity. Parasites of the Leishmania genus undergo various developmental transitions in their life cycle triggered by changes in the environment. The molecular mechanisms that these organisms use to process and integrate these external cues are largely unknown. However Leishmania lacks transcription factors, therefore most regulatory processes may occur at a post-translational level and phosphorylation has recently been demonstrated to be an important player in this process. Experimental identification of phosphorylation sites is a time-consuming task. Moreover some sites could be missed due to the highly dynamic nature of this process or to difficulties in phospho-peptide enrichment.Results: Here we present PhosTryp, a phosphorylation site predictor specific for trypansomatids. This method uses an SVM-based approach and has been trained with recent Leishmania phosphosproteomics data. PhosTryp achieved a 17% improvement in prediction performance compared with Netphos, a non organism-specific predictor. The analysis of the peptides correctly predicted by our method but missed by Netphos demonstrates that PhosTryp captures Leishmania-specific phosphorylation features. More specifically our results show that Leishmania kinases have sequence specificities which are different from their counterparts in higher eukaryotes. Consequently we were able to propose two possible Leishmania-specific phosphorylation motifs.We further demonstrate that this improvement in performance extends to the related trypanosomatids Trypanosoma brucei and Trypanosoma cruzi. Finally, in order to maximize the usefulness of PhosTryp, we trained a predictor combining all the peptides from L. infantum, T. brucei and T. cruzi.Conclusions: Our work demonstrates that training on organism-specific data results in an improvement that extends to related species. PhosTryp is freely available at http://phostryp.bio.uniroma2.it. © 2011 Palmeri et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Palmeri A."
                    },
                    {
                        "name": "Gherardini P.F."
                    },
                    {
                        "name": "Tsigankov P."
                    },
                    {
                        "name": "Ausiello G."
                    },
                    {
                        "name": "Spath G.F."
                    },
                    {
                        "name": "Zilberstein D."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    }
                ],
                "citationCount": 12,
                "date": "2011-12-19T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "PhosTryp: A phosphorylation site predictor specific for parasitic protozoa of the family trypanosomatidae"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}