{
    "accessibility": "Open access",
    "additionDate": "2022-07-25T00:56:58.497975Z",
    "biotoolsCURIE": "biotools:scampp",
    "biotoolsID": "scampp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Eleanor Wedell"
        },
        {
            "name": "Tandy Warnow"
        },
        {
            "name": "Yirong Cai"
        }
    ],
    "description": "Scaling Alignment-based Phylogenetic Placement to Large Trees.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chry04/PLUSplacer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-25T00:56:58.500529Z",
    "license": "MIT",
    "name": "SCAMPP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TCBB.2022.3170386",
            "metadata": {
                "abstract": "AuthorPhylogenetic placement, the problem of placing a query sequence into a precomputed phylogenetic backbone tree, is useful for constructing large trees, performing taxon identification of newly obtained sequences, and other applications. The most accurate current methods, such as pplacer and EPA-ng, are based on maximum likelihood and require that the query sequence be provided within a multiple sequence alignment that includes the leaf sequences in the backbone tree. This approach enables high accuracy but also makes these likelihood-based methods computationally intensive on large backbone trees, and can even lead to them failing when the backbone trees are very large (e.g., having 50,000 or more leaves). We present SCAMPP (SCAlable alignMent-based Phylogenetic Placement), a technique to extend the scalability of these likelihood-based placement methods to ultra-large backbone trees. We show that pplacer-SCAMPP and EPA-ng-SCAMPP both scale well to ultra-large backbone trees (even up to 200,000 leaves), with accuracy that improves on APPLES and APPLES-2, two recently developed fast phylogenetic placement methods that scale to ultra-large datasets. EPA-ng-SCAMPP and pplacer-SCAMPP are available at https://github.com/chry04/PLUSplacer.",
                "authors": [
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Warnow T."
                    },
                    {
                        "name": "Wedell E."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "SCAMPP: Scaling Alignment-based Phylogenetic Placement to Large Trees"
            },
            "pmid": "35471888"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}
