{
    "additionDate": "2017-01-13T13:14:14Z",
    "biotoolsCURIE": "biotools:cuda-ec",
    "biotoolsID": "cuda-ec",
    "credit": [
        {
            "name": "Nvidia support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.nvidia.com/object/contact-information.html"
        }
    ],
    "description": "A scalable parallel algorithm for correcting sequencing errors in high-throughput short-read data so that error-free reads can be available before DNA fragment assembly.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.nvidia.com/object/bio_info_life_sciences.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "http://www.nvidia.com/object/bio_info_life_sciences.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-11-25T14:48:15.519526Z",
    "name": "CUDA-EC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1089/cmb.2009.0062",
            "metadata": {
                "abstract": "Emerging DNA sequencing technologies open up exciting new opportunities for genome sequencing by generating read data with a massive throughput. However, produced reads are significantly shorter and more error-prone compared to the traditional Sanger shotgun sequencing method. This poses challenges for de novo DNA fragment assembly algorithms in terms of both accuracy (to deal with short, error-prone reads) and scalability (to deal with very large input data sets). In this article, we present a scalable parallel algorithm for correcting sequencing errors in high-throughput short-read data so that error-free reads can be available before DNA fragment assembly, which is of high importance to many graph-based short-read assembly tools. The algorithm is based on spectral alignment and uses the Compute Unified Device Architecture (CUDA) programming model. To gain efficiency we are taking advantage of the CUDA texture memory using a space-efficient Bloom filter data structure for spectrum membership queries. We have tested the runtime and accuracy of our algorithm using real and simulated Illumina data for different read lengths, error rates, input sizes, and algorithmic parameters. Using a CUDA-enabled mass-produced GPU (available for less than US$400 at any local computer outlet), this results in speedups of 12-84 times for the parallelized error correction, and speedups of 3-63 times for both sequential preprocessing and parallelized error correction compared to the publicly available Euler-SR program. Our implementation is freely available for download from http://cuda-ec.sourceforge.net. © Copyright 2010, Mary Ann Liebert, Inc..",
                "authors": [
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Muller-Wittig W."
                    },
                    {
                        "name": "Schmidt B."
                    },
                    {
                        "name": "Shi H."
                    }
                ],
                "citationCount": 54,
                "date": "2010-04-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "A parallel algorithm for error correction in high-throughput short-read data on CUDA-enabled graphics hardware"
            },
            "pmid": "20426693"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
