
{
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRoles": [
            ]
        },
        {
            "email": "osvaldo.zagordi@bsse.ethz.ch",
            "name": "Osvaldo Zagordi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/cbg-ethz/shorah/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "Python"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Next-generation sequencing technologies can be used to analyse genetically heterogeneous samples at unprecedented detail. The high coverage achievable with these methods enables the detection of many low-frequency variants. However, sequencing errors complicate the analysis of mixed populations and result in inflated estimates of genetic diversity. We developed a probabilistic Bayesian approach to minimize the effect of errors on the detection of minority variants. We applied it to pyrosequencing data obtained from a 1.5kb-fragment of the HIV-1 gag/pol gene in two control and two clinical samples. The effect of PCR amplification was analysed. Error correction resulted in a two- and five-fold decrease of the pyrosequencing base substitution rate, from 0.05 to 0.03 and from 0.25 to 0.05 in the non-PCR and PCR-amplified samples, respectively. We were able to detect viral clones as rare as 0.1 with perfect sequence reconstruction. Probabilistic haplotype inference outperforms the counting-based calling method in both precision and recall. Genetic diversity observed within and between two clinical samples resulted in various patterns of phenotypic drug resistance and suggests a close epidemiological link. We conclude that pyrosequencing can be used to investigate genetically diverse samples with high accuracy if technical errors are properly treated. © 2010 The Author(s).",
            "authors": [
                "Zagordi O.",
                "Klein R.",
                "Daumer M.",
                "Beerenwinkel N."
            ],
            "cit_count": 143,
            "journal": "Nucleic Acids Research",
            "pmid": "20671025",
            "title": "Error correction of next-generation sequencing data and reliable estimation of HIV quasispecies",
            "year": "2010-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:shorah",
        "biotoolsID": "shorah",
        "description": "Inference of a population from a set of short reads. The package contains programs that support mapping of reads to a reference genome, correcting sequencing errors by locally clustering reads in small windows of the alignment, reconstructing a minimal set of global haplotypes that explain the reads, and estimating the frequencies of the inferred haplotypes.",
        "homepage": "https://github.com/ozagordi/shorah",
        "name": "ShoRAH"
    }
}