{
    "additionDate": "2017-08-20T15:59:16Z",
    "biotoolsCURIE": "biotools:trf",
    "biotoolsID": "trf",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "benson@ecology.biomath.mssm.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tandem Repeats Finder. Find tandem repeats in DNA sequences without the need to specify either the pattern or pattern size. It uses the method of k-tuple matching to avoid the need for full scale alignment matrix computations. It requires no a priori knowledge of the pattern, pattern size or number of copies. There are no restrictions on the size of the repeats that can be detected. It determines a consensus pattern for the smallest repetitive unit in the tandem repeat.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://tandem.bu.edu/trf/trf.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence detection",
                    "uri": "http://edamontology.org/operation_0379"
                }
            ]
        }
    ],
    "homepage": "http://tandem.bu.edu/trf/trf.html",
    "lastUpdate": "2024-11-25T14:04:55.402448Z",
    "license": "Other",
    "name": "TRF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/nar/27.2.573",
            "metadata": {
                "abstract": "A tandem repeat in DNA is two or more contiguous, approximate copies of a pattern of nucleotides. Tandem repeats have been shown to cause human disease, may play a variety of regulatory and evolutionary roles and are important laboratory and analytic tools. Extensive knowledge about pattern size, copy number, mutational history, etc. for tandem repeats has been limited by the inability to easily detect them in genomic sequence data. In this paper, we present a new algorithm for finding tandem repeats which works without the need to specify either the pattern or pattern size. We model tandem repeats by percent identity and frequency of indels between adjacent pattern copies and use statistically based recognition criteria. We demonstrate the algorithm's speed and its ability to detect tandem repeats that have undergone extensive mutational change by analyzing four sequences: the human frataxin gene, the human β T cell receptor locus sequence and two yeast chromosomes. These sequences range in size from 3 kb up to 700 kb. A World Wide Web server interface at c3.biomath.mssm.edu/trf.html has been established for automated use of the program.",
                "authors": [
                    {
                        "name": "Benson G."
                    }
                ],
                "citationCount": 6283,
                "date": "1999-01-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Tandem repeats finder: A program to analyze DNA sequences"
            },
            "pmcid": "PMC148217",
            "pmid": "9862982",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}
