{
    "accessibility": "Open access",
    "additionDate": "2021-04-21T22:48:24Z",
    "biotoolsCURIE": "biotools:open-cravat",
    "biotoolsID": "open-cravat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Kyle Moad"
        },
        {
            "name": "Kymberleigh A Pagel"
        },
        {
            "name": "Rachel Karchin"
        },
        {
            "name": "Rick Kim"
        }
    ],
    "description": "OpenCRAVAT is a new open source, scalable decision support system to support variant and gene prioritization. It offers a dynamic GUI, allowing users to easily, download tools from an extensive resource catalog, create customized pipelines, run jobs at speeds that exceed current variant annotation API services, and explore results in a richly detailed viewing environment. OpenCRAVAT is distinguished from similar tools by the amount and diversity of data resources and computational prediction methods available, which span germline, somatic, common, rare, coding and non-coding variants. We have designed the OpenCRAVAT resource catalog to be open and modular to maximize community and developer involvement, and as a result the catalog is being actively developed and growing larger every month.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://open-cravat.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://opencravat.org",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-05-04T08:43:52.294576Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://run.opencravat.org/submit/nocache/index.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/KarchinLab/open-cravat-readthedocs"
        }
    ],
    "name": "open-cravat",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1200/CCI.19.00132",
            "metadata": {
                "abstract": "PURPOSE The modern researcher is confronted with hundreds of published methods to interpret genetic variants. There are databases of genes and variants, phenotype-genotype relationships, algorithms that score and rank genes, and in silico variant effect prediction tools. Because variant prioritization is a multifactorial problem, a welcome development in the field has been the emergence of decision support frameworks, which make it easier to integrate multiple resources in an interactive environment. Current decision support frameworks are typically limited by closed proprietary architectures, access to a restricted set of tools, lack of customizability, Web dependencies that expose protected data, or limited scalability. METHODS We present the Open Custom Ranked Analysis of Variants Toolkit1 (OpenCRAVAT) a new open-source, scalable decision support system for variant and gene prioritization. We have designed the resource catalog to be open and modular to maximize community and developer involvement, and as a result, the catalog is being actively developed and growing every month. Resources made available via the store are well suited for analysis of cancer, as well as Mendelian and complex diseases. RESULTS OpenCRAVAT offers both command-line utility and dynamic graphical user interface, allowing users to install with a single command, easily download tools from an extensive resource catalog, create customized pipelines, and explore results in a richly detailed viewing environment. We present several case studies to illustrate the design of custom workflows to prioritize genes and variants. CONCLUSION OpenCRAVAT is distinguished from similar tools by its capabilities to access and integrate an unprecedented amount of diverse data resources and computational prediction methods, which span germline, somatic, common, rare, coding, and noncoding variants.",
                "authors": [
                    {
                        "name": "Busby B."
                    },
                    {
                        "name": "Karchin R."
                    },
                    {
                        "name": "Kim R."
                    },
                    {
                        "name": "Moad K."
                    },
                    {
                        "name": "Pagel K.A."
                    },
                    {
                        "name": "Ryan M."
                    },
                    {
                        "name": "Tokheim C."
                    },
                    {
                        "name": "Zheng L."
                    }
                ],
                "citationCount": 28,
                "date": "2019-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "Integrated Informatics Analysis of Cancer-Related Variants"
            },
            "pmcid": "PMC7113103",
            "pmid": "32228266"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
