{
    "additionDate": "2021-03-19T09:12:34Z",
    "biotoolsCURIE": "biotools:lncevo",
    "biotoolsID": "lncevo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "miszcz@amu.edu.pl",
            "name": "Michał Wojciech Szcześniak",
            "orcidid": "https://orcid.org/0000-0002-6050-9525",
            "typeEntity": "Person"
        }
    ],
    "description": "automated identification and conservation study of long noncoding RNAs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/spirit678/lncrna_conservation_nf",
    "lastUpdate": "2021-04-11T08:51:42.805299Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://hub.docker.com/repository/docker/spirit678/lncrna_conservation"
        }
    ],
    "name": "lncEvo",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-021-03991-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Long noncoding RNAs represent a large class of transcripts with two common features: they exceed an arbitrary length threshold of 200 nt and are assumed to not encode proteins. Although a growing body of evidence indicates that the vast majority of lncRNAs are potentially nonfunctional, hundreds of them have already been revealed to perform essential gene regulatory functions or to be linked to a number of cellular processes, including those associated with the etiology of human diseases. To better understand the biology of lncRNAs, it is essential to perform a more in-depth study of their evolution. In contrast to protein-encoding transcripts, however, they do not show the strong sequence conservation that usually results from purifying selection; therefore, software that is typically used to resolve the evolutionary relationships of protein-encoding genes and transcripts is not applicable to the study of lncRNAs. Results: To tackle this issue, we developed lncEvo, a computational pipeline that consists of three modules: (1) transcriptome assembly from RNA-Seq data, (2) prediction of lncRNAs, and (3) conservation study—a genome-wide comparison of lncRNA transcriptomes between two species of interest, including search for orthologs. Importantly, one can choose to apply lncEvo solely for transcriptome assembly or lncRNA prediction, without calling the conservation-related part. Conclusions: lncEvo is an all-in-one tool built with the Nextflow framework, utilizing state-of-the-art software and algorithms with customizable trade-offs between speed and sensitivity, ease of use and built-in reporting functionalities. The source code of the pipeline is freely available for academic and nonacademic use under the MIT license at https://gitlab.com/spirit678/lncrna_conservation_nf.",
                "authors": [
                    {
                        "name": "Bryzghalov O."
                    },
                    {
                        "name": "Makalowska I."
                    },
                    {
                        "name": "Szczesniak M.W."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "lncEvo: automated identification and conservation study of long noncoding RNAs"
            },
            "pmcid": "PMC7871587",
            "pmid": "33563213"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}