
{
    "credit": [
        {
            "name": "Department of Biostatistics USC",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://keck.usc.edu/preventive-medicine/contact-us/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://biostats.usc.edu/DownloadGxGScan.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gxgscan-20130418-detect-gxg-interactions-in-a-genome-wide-association-study.html"
        }
    ],
    "publication": [
        {
            "abstract": "Exhaustive testing of all possible SNP pairs in a genome-wide association study (GWAS) generally yields low power to detect gene-gene (G × G) interactions because of small effect sizes and stringent requirements for multiple-testing correction. We introduce a new two-step procedure for testing G × G interactions in case-control GWAS to detect interacting single nucleotide polymorphisms (SNPs) regardless of their marginal effects. In an initial screening step, all SNP pairs are tested for gene-gene association in the combined sample of cases and controls. In the second step, the pairs that pass the screening are followed up with a traditional test for G × G interaction. We show that the two-step method is substantially more powerful to detect G × G interactions than the exhaustive testing approach. For example, with 2,000 cases and 2,000 controls, the two-step method can have more than 90% power to detect an interaction odds ratio of 2.0 compared to less than 50% power for the exhaustive testing approach. Moreover, we show that a hybrid two-step approach that combines our newly proposed two-step test and the two-step test that screens for marginal effects retains the best power properties of both. The two-step procedures we introduce have the potential to uncover genetic signals that have not been previously identified in an initial single-SNP GWAS. We demonstrate the computational feasibility of the two-step G × G procedure by performing a G × G scan in the asthma GWAS of the University of Southern California Children's Health Study. © 2013 WILEY PERIODICALS, INC.",
            "authors": [
                "Lewinger J.P.",
                "Morrison J.L.",
                "Thomas D.C.",
                "Murcray C.E.",
                "Conti D.V.",
                "Li D.",
                "Gauderman W.J."
            ],
            "cit_count": 14,
            "journal": "Genetic Epidemiology",
            "pmid": "23633124",
            "title": "Efficient Two-Step Testing of Gene-Gene Interactions in Genome-Wide Association Studies",
            "year": "2013-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gxgscan",
        "biotoolsID": "gxgscan",
        "description": "Performs the two-step GxG test to detect GxG interactions in a genome-wide association study",
        "homepage": "http://biostats.usc.edu/software",
        "name": "GxGscan"
    }
}