
{
    "credit": [
        {
            "email": "danielle.lemay@ars.usda.gov",
            "name": "Danielle G. LemayEmail author",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/transcript/samsa2/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Workflow"
        ],
        "topic": [
            {
                "term": "Metatranscriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Microbiome",
                "uri": "http://edamontology.org/topic_3697"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "https://github.com/transcript/samsa2"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Background: Complex microbial communities are an area of growing interest in biology. Metatranscriptomics allows researchers to quantify microbial gene expression in an environmental sample via high-throughput sequencing. Metatranscriptomic experiments are computationally intensive because the experiments generate a large volume of sequence data and each sequence must be compared with reference sequences from thousands of organisms. Results: SAMSA2 is an upgrade to the original Simple Annotation of Metatranscriptomes by Sequence Analysis (SAMSA) pipeline that has been redesigned for standalone use on a supercomputing cluster. SAMSA2 is faster due to the use of the DIAMOND aligner, and more flexible and reproducible because it uses local databases. SAMSA2 is available with detailed documentation, and example input and output files along with examples of master scripts for full pipeline execution. Conclusions: SAMSA2 is a rapid and efficient metatranscriptome pipeline for analyzing large RNA-seq datasets in a supercomputing cluster environment. SAMSA2 provides simplified output that can be examined directly or used for further analyses, and its reference databases may be upgraded, altered or customized to fit the needs of any experiment.",
            "authors": [
                "Westreich S.T.",
                "Treiber M.L.",
                "Mills D.A.",
                "Korf I.",
                "Lemay D.G."
            ],
            "cit_count": 0,
            "doi": "10.1186/s12859-018-2189-z",
            "journal": "BMC Bioinformatics",
            "title": "SAMSA2: A standalone metatranscriptome analysis pipeline",
            "type": "Primary",
            "year": "2018-05-21"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:samsa2",
        "biotoolsID": "samsa2",
        "description": "Version 2 of the SAMSA pipeline - faster! Lighter! More options! Less waiting!\nIt is a rapid and efficient metatranscriptome pipeline for analyzing large RNA-seq datasets in a supercomputing cluster environment. It provides simplified output that can be examined directly or used for further analyses, and its reference databases may be upgraded, altered or customized to fit the needs of any experiment.",
        "homepage": "https://transcript.github.io/samsa2/",
        "name": "SAMSA2",
        "version": [
            "2.0"
        ]
    }
}