{"credit":[],"documentation":[{"type":"GENERAL","url":"https://github.com/kevinkovalchik/RawTools/wiki"}],"download":[{"type":"Source code","url":"https://github.com/kevinkovalchik/RawTools/releases"}],"function":[{"input":[{"data":{"term":"Mass spectrometry spectra","uri":"http://edamontology.org/data_0943"},"format":[{"term":"Thermo RAW","uri":"http://edamontology.org/format_3712"}]}],"operation":[{"term":"Parsing","uri":"http://edamontology.org/operation_1812"}],"output":[{"data":{"term":"Mass spectrometry spectra","uri":"http://edamontology.org/data_0943"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"}]}]}],"labels":{"accessibility":["Open access"],"collectionID":["Proteomics"],"cost":"Free of charge","language":["C#"],"license":"Apache-2.0","maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Desktop application"],"topic":[{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"}]},"link":[{"type":"REPOSITORY","url":"https://github.com/kevinkovalchik/RawTools"},{"type":"ISSUE_TRACKER","url":"https://github.com/kevinkovalchik/RawTools/issues"}],"publication":[{"abstract":"Copyright © 2018 American Chemical Society. Optimizing the quality of proteomics data collected from a mass spectrometer (MS) requires careful selection of acquisition parameters and proper assessment of instrument performance. Software tools capable of extracting a broad set of information from raw files, including meta, scan, quantification, and identification data, are needed to provide guidance for MS system management. In this work, direct extraction and utilization of these data is demonstrated using RawTools, a standalone tool for extracting meta and scan data directly from raw MS files generated on Thermo Orbitrap instruments. RawTools generates summarized and detailed plain text outputs after parsing individual raw files, including scan rates and durations, duty cycle characteristics, precursor and reporter ion quantification, and chromatography performance. RawTools also contains a diagnostic module that includes an optional \"preview\" database search for facilitating informed decision-making related to optimization of MS performance based on a variety of metrics. RawTools has been developed in C# and utilizes the Thermo RawFileReader library and thus can process raw MS files with high speed and high efficiency on all major operating systems (Windows, MacOS, Linux). To demonstrate the utility of RawTools, the extraction of meta and scan data from both individual and large collections of raw MS files was carried out to identify problematic characteristics of instrument performance. Taken together, the combined rich feature-set of RawTools with the capability for interrogation of MS and experiment performance makes this software a valuable tool for proteomics researchers.","authors":["Kovalchik K.A.","Colborne S.","Spencer S.E.","Sorensen P.H.","Chen D.D.Y.","Morin G.B.","Hughes C.S."],"cit_count":0,"doi":"10.1021/acs.jproteome.8b00721","journal":"Journal of Proteome Research","pmid":"30462513","title":"RawTools: Rapid and Dynamic Interrogation of Orbitrap Data Files for Mass Spectrometer System Management","year":"2019-02-01"}],"summary":{"biotoolsCURIE":"biotools:rawtools","biotoolsID":"rawtools","description":"A standalone tool for extracting data directly from raw files generated by Thermo Orbitrap family instruments.","homepage":"https://github.com/kevinkovalchik/RawTools","name":"RawTools","version":["1.4.1"]}}