{
    "additionDate": "2018-07-14T09:30:50Z",
    "biotoolsCURIE": "biotools:sim3c",
    "biotoolsID": "sim3c",
    "credit": [
        {
            "email": "aaron.darling@uts.edu.au",
            "name": "Aaron E Darling",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Read-pair simulation of 3C-based sequencing methodologies (HiC, Meta3C, DNase-HiC).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/cerebis/sim3C"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cerebis/sim3C",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "Sim3C",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/gigascience/gix103",
            "metadata": {
                "abstract": "© The Author(s) 2017. Background: Chromosome conformation capture (3C) and Hi-C DNA sequencing methods have rapidly advanced our understanding of the spatial organization of genomes and metagenomes. Many variants of these protocols have been developed, each with their own strengths. Currently there is no systematic means for simulating sequence data from this family of sequencing protocols, potentially hindering the advancement of algorithms to exploit this new datatype. Findings: We describe a computational simulator that, given simple parameters and reference genome sequences, will simulate Hi-C sequencing on those sequences. The simulator models the basic spatial structure in genomes that is commonly observed in Hi-C and 3C datasets, including the distance-decay relationship in proximity ligation, differences in the frequency of interaction within and across chromosomes, and the structure imposed by cells. A means to model the 3D structure of randomly generated topologically associating domains is provided. The simulator considers several sources of error common to 3C and Hi-C library preparation and sequencing methods, including spurious proximity ligation events and sequencing error. Conclusions: We have introduced the first comprehensive simulator for 3C and Hi-C sequencing protocols. We expect the simulator to have use in testing of Hi-C data analysis algorithms, as well as more general value for experimental design, where questions such as the required depth of sequencing, enzyme choice, and other decisions can be made in advance in order to ensure adequate statistical power with respect to experimental hypothesis testing.",
                "authors": [
                    {
                        "name": "DeMaere M.Z."
                    },
                    {
                        "name": "Darling A.E."
                    }
                ],
                "date": "2018-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Sim3C: Simulation of Hi-C and Meta3C proximity ligation sequencing technologies"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}