{
    "additionDate": "2017-08-03T19:06:29Z",
    "biotoolsCURIE": "biotools:jnmfma",
    "biotoolsID": "jnmfma",
    "credit": [
        {
            "email": "hqwang126@126.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Meta-analysis method for identification of DEGs based on joint non-negative matrix factorization.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://academic.oup.com/bioinformatics/article/31/4/572/2748206"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://micblab.iim.ac.cn/jnmfma/",
    "homepage_status": 1,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/jnmfma-meta-analysis-of-omics-data.html"
        }
    ],
    "name": "jNMFMA",
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 The Author.Motivation: Tremendous amount of omics data being accumulated poses a pressing challenge of meta-analyzing the heterogeneous data for mining new biological knowledge. Most existing methods deal with each gene independently, thus often resulting in high false positive rates in detecting differentially expressed genes (DEG). To our knowledge, no or little effort has been devoted to methods that consider dependence structures underlying transcriptomics data for DEG identification in meta-analysis context. Results: This article proposes a new meta-analysis method for identification of DEGs based on joint non-negative matrix factorization (jNMFMA). We mathematically extend non-negative matrix factorization (NMF) to a joint version (jNMF), which is used to simultaneously decompose multiple transcriptomics data matrices into one common submatrix plus multiple individual submatrices. By the jNMF, the dependence structures underlying transcriptomics data can be interrogated and utilized, while the high-dimensional transcriptomics data are mapped into a low-dimensional space spanned by metagenes that represent hidden biological signals. jNMFMA finally identifies DEGs as genes that are associated with differentially expressed metagenes. The ability of extracting dependence structures makes jNMFMA more efficient and robust to identify DEGs in meta-analysis context. Furthermore, jNMFMA is also flexible to identify DEGs that are consistent among various types of omics data, e.g. gene expression and DNA methylation. Experimental results on both simulation data and real-world cancer data demonstrate the effectiveness of jNMFMA and its superior performance over other popular approaches.",
                "authors": [
                    {
                        "name": "Wang H.-Q."
                    },
                    {
                        "name": "Zheng C.-H."
                    },
                    {
                        "name": "Zhao X.-M."
                    }
                ],
                "citationCount": 26,
                "date": "2015-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "JNMFMA: A joint non-negative matrix factorization meta-analysis of transcriptomics data"
            },
            "pmid": "25411328"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}