{"credit":[],"function":[{"operation":[{"term":"Post-translation modification site prediction","uri":"http://edamontology.org/operation_0417"},{"term":"Deisotoping","uri":"http://edamontology.org/operation_3629"},{"term":"Scaffolding","uri":"http://edamontology.org/operation_3216"}]}],"labels":{"topic":[{"term":"Proteomics experiment","uri":"http://edamontology.org/topic_3520"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.Proteins can be phosphorylated at neighboring sites resulting in different functional states, and studying the regulation of these sites has been challenging. Here we present Thesaurus, a search engine that detects and quantifies phosphopeptide positional isomers from parallel reaction monitoring and data-independent acquisition mass spectrometry experiments. We apply Thesaurus to analyze phosphorylation events in the PI3K/AKT signaling pathway and show neighboring sites with distinct regulation.","authors":["Searle B.C.","Lawrence R.T.","MacCoss M.J.","Villen J."],"cit_count":0,"doi":"10.1038/S41592-019-0498-4","journal":"Nature Methods","pmid":"31363206","title":"Thesaurus: quantifying phosphopeptide positional isomers","year":"2019-08-01"}],"summary":{"biotoolsCURIE":"biotools:Thesaurus","biotoolsID":"Thesaurus","description":"quantifying phosphopeptide positional isomers | The human phosphorylation regulatory network represents a complex signaling cascade where proteins can be phosphorylated at multiple sites resulting in different functional states. Here we present Thesaurus, a hybrid search engine that detects, localizes, and quantifies novel positional isomers using site-specific fragment ions directly from data independent acquisition mass spectrometry experiments. This software works for several PTMs in addition to phosphorylation. Check out our paper describing Thesaurus and what it can do at Nature Methods (Searle et al, 2019)!","homepage":"http://bitbucket.org/searleb/thesaurus/","name":"Thesaurus"}}