{
    "additionDate": "2017-05-01T17:08:36Z",
    "biotoolsCURIE": "biotools:ar_nhpred",
    "biotoolsID": "ar_nhpred",
    "credit": [
        {
            "email": "raghava@imtech.res.in",
            "name": "Dr. G. P. S. Raghava",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Predicts the aromatic backbone NH interaction in a given amino acid sequence where the pi ring of aromatic residues interact with the backbone NH groups.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://crdd.osdd.net/raghava/ar_nhpred/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Residue interaction prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://www.imtech.res.in/raghava/ar_nhpred",
    "lastUpdate": "2018-12-10T12:58:51Z",
    "name": "Ar_NHPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In this study, an attempt has been made to develop a neural network-based method for predicting segments in proteins containing aromatic-backbone NH (Ar-NH) interactions using multiple sequence alignment. We have analyzed 3121 segments seven residues long containing Ar-NH interactions, extracted from 2298 non-redundant protein structures where no two proteins have more than 25% sequence identity. Two consecutive feed-forward neural networks with a single hidden layer have been trained with standard back-propagation as learning algorithm. The performance of the method improves from 0.12 to 0.15 in terms of Matthews correlation coefficient (MCC) value when evolutionary information (multiple alignment obtained from PSI-BLAST) is used as input instead of a single sequence. The performance of the method further improves from MCC 0.15 to 0.20 when secondary structure information predicted by PSIPRED is incorporated in the prediction. The final network yields an overall prediction accuracy of 70.1% and an MCC of 0.20 when tested by five-fold cross-validation. Overall the performance is 15.2% higher than the random prediction. The method consists of two neural networks: (i) a sequence-to-structure network which predicts the aromatic residues involved in Ar-NH interaction from multiple alignment of protein sequences and (ii) a structure-to structure network where the input consists of the output obtained from the first network and predicted secondary structure. Further, the actual position of the donor residue within the 'potential' predicted fragment has been predicted using a separate sequence-to-structure neural network. Based on the present study, a server Ar_NHPred has been developed which predicts Ar-NH interaction in a given amino acid sequence. The web server Ar_NHPred is available at http://www.imtech.res. in/raghava/ar_nhpred/ and http://bioinformatics.uams.edu/mirror/ar_nhpred/ (mirror site). © 2004 Federation of European Biochemical Societies. Published by Elsevier B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 7,
                "date": "2004-04-23T00:00:00Z",
                "journal": "FEBS Letters",
                "title": "Role of evolutionary information in prediction of aromatic-backbone NH interactions in proteins"
            },
            "pmid": "15094041"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}