{
    "additionDate": "2020-01-14T20:13:05Z",
    "biotoolsCURIE": "biotools:synaptic_genes",
    "biotoolsID": "synaptic_genes",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "fpazos@iibce.edu.uy",
            "name": "Flavio Pazos Obregón",
            "orcidid": "https://orcid.org/0000-0003-4980-1071",
            "typeEntity": "Person"
        }
    ],
    "description": "An improved catalogue of putative synaptic genes defined exclusively by temporal transcription profiles through an ensemble machine learning approach.\n\nBACKGROUND:Assembly and function of neuronal synapses require the coordinated expression of a yet undetermined set of genes. Previously, we had trained an ensemble machine learning model to assign a probability of having synaptic function to every protein-coding gene in Drosophila melanogaster. This approach resulted in the publication of a catalogue of 893 genes which we postulated to be very enriched in genes with a still undocumented synaptic function. Since then, the scientific community has experimentally identified 79 new synaptic genes. Here we use these new empirical data to evaluate our original prediction. We also implement a series of changes to the training scheme of our model and using the new data we demonstrate that this improves its predictive power",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://synapticgenes.bnd.edu.uy",
    "lastUpdate": "2020-01-14T20:13:05Z",
    "name": "synaptic genes",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6380-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Assembly and function of neuronal synapses require the coordinated expression of a yet undetermined set of genes. Previously, we had trained an ensemble machine learning model to assign a probability of having synaptic function to every protein-coding gene in Drosophila melanogaster. This approach resulted in the publication of a catalogue of 893 genes which we postulated to be very enriched in genes with a still undocumented synaptic function. Since then, the scientific community has experimentally identified 79 new synaptic genes. Here we use these new empirical data to evaluate our original prediction. We also implement a series of changes to the training scheme of our model and using the new data we demonstrate that this improves its predictive power. Finally, we added the new synaptic genes to the training set and trained a new model, obtaining a new, enhanced catalogue of putative synaptic genes. Results: The retrospective analysis demonstrate that our original catalogue was significantly enriched in new synaptic genes. When the changes to the training scheme were implemented using the original training set we obtained even higher enrichment. Finally, applying the new training scheme with a training set including the 79 new synaptic genes, resulted in an enhanced catalogue of putative synaptic genes. Here we present this new catalogue and announce that a regularly updated version will be available online at: Http://synapticgenes.bnd.edu.uy Conclusions: We show that training an ensemble of machine learning classifiers solely with the whole-body temporal transcription profiles of known synaptic genes resulted in a catalogue with a significant enrichment in undiscovered synaptic genes. Using new empirical data provided by the scientific community, we validated our original approach, improved our model an obtained an arguably more precise prediction. This approach reduces the number of genes to be tested through hypothesis-driven experimentation and will facilitate our understanding of neuronal function. Availability: Http://synapticgenes.bnd.edu.uy",
                "authors": [
                    {
                        "name": "Pazos Obregon F."
                    },
                    {
                        "name": "Palazzo M."
                    },
                    {
                        "name": "Soto P."
                    },
                    {
                        "name": "Guerberoff G."
                    },
                    {
                        "name": "Yankilevich P."
                    },
                    {
                        "name": "Cantera R."
                    }
                ],
                "date": "2019-12-23T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "An improved catalogue of putative synaptic genes defined exclusively by temporal transcription profiles through an ensemble machine learning approach"
            },
            "pmcid": "PMC6929295",
            "pmid": "31870293"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}