{"credit":[{"email":"smire002@ucr.edu","name":"Hamid Mirebrahim","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://sites.google.com/a/ucr.edu/slicembler/home/Documentation"}],"function":[{"operation":[{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/slicembler-meta-assembler-designed-for-ultra-deep-sequencing-data.html"}],"publication":[{"abstract":"© The Author 2015. Published by Oxford University Press.We introduce a new divide and conquer approach to deal with the problem of de novo genome assembly in the presence of ultra-deep sequencing data (i.e. coverage of 1000x or higher). Our proposed meta-assembler Slicembler partitions the input data into optimal-sized 'slices' and uses a standard assembly tool (e.g. Velvet, SPAdes, IDBA-UD and Ray) to assemble each slice individually. Slicembler uses majority voting among the individual assemblies to identify long contigs that can be merged to the consensus assembly. To improve its efficiency, Slicembler uses a generalized suffix tree to identify these frequent contigs (or fraction thereof). Extensive experimental results on real ultra-deep sequencing data (8000x coverage) and simulated data show that Slicembler significantly improves the quality of the assembly compared with the performance of the base assembler. In fact, most of the times, Slicembler generates error-free assemblies. We also show that Slicembler is much more resistant against high sequencing error rate than the base assembler.","authors":["Mirebrahim H.","Close T.J.","Lonardi S."],"cit_count":8,"journal":"Bioinformatics","pmid":"26072514","title":"De novo meta-assembly of ultra-deep sequencing data","year":"2015-06-15"}],"summary":{"biotoolsCURIE":"biotools:slicembler","biotoolsID":"slicembler","description":"A meta-assembler designed for ultra-deep sequencing data.","homepage":"https://sites.google.com/a/ucr.edu/slicembler/","name":"SLICEMBLER"}}