{
    "additionDate": "2022-09-23T13:30:40.554561Z",
    "biotoolsCURIE": "biotools:cov2k",
    "biotoolsID": "cov2k",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anna.bernasconi@polimi.it",
            "name": "Anna Bernasconi",
            "orcidid": "https://orcid.org/0000-0001-8016-5750",
            "typeEntity": "Person"
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy."
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "CoV2K is available for exploration as a graph that can be queried through a RESTful API addressing single entities or paths through their relationships",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "http://gmql.eu/cov2k/api/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/DEIB-GECO/cov2k_data_collector/"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-POLIMI"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DEIB-GECO/cov2k_data_collector/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2023-12-02T21:52:35.842210Z",
    "license": "Apache-2.0",
    "name": "CoV2K",
    "owner": "abernasconi",
    "publication": [
        {
            "doi": "10.1007/978-3-030-75018-3_18",
            "metadata": {
                "abstract": "In spite of the current relevance of the topic, there is no universally recognized knowledge base about SARS-CoV-2 variants; viral sequences deposited at recognized repositories are still very few, and the process of tracking new variants is not coordinated. CoV2K is a manually curated knowledge base providing an organized collection of information about SARS-CoV-2 variants, extracted from the scientific literature; it features a taxonomy of variant impacts, organized according to three main categories (protein stability, epidemiology, and immunology) and including levels for these effects (higher, lower, null) resulting from a coherent interpretation of research articles. CoV2K is integrated with ViruSurf, hosted at Politecnico di Milano; ViruSurf is globally the largest database of curated viral sequences and variants, integrated from deposition repositories such as COG-UK, GenBank, and GISAID. Thanks to such integration, variants documented in CoV2K can be analyzed and searched over large volumes of nucleotide and amino acid sequences, e.g., for co-occurrence and impact agreement; the paper sketches some of the data analysis tests that are currently under development.",
                "authors": [
                    {
                        "name": "Al Khalaf R."
                    },
                    {
                        "name": "Alfonsi T."
                    },
                    {
                        "name": "Bernasconi A."
                    },
                    {
                        "name": "Ceri S."
                    }
                ],
                "citationCount": 9,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Lecture Notes in Business Information Processing",
                "title": "CoV2K: A Knowledge Base of SARS-CoV-2 Variant Impacts"
            }
        },
        {
            "doi": "10.1038/S41597-022-01348-9",
            "metadata": {
                "abstract": "Since the outbreak of the COVID-19 pandemic, many research organizations have studied the genome of the SARS-CoV-2 virus; a body of public resources have been published for monitoring its evolution. While we experience an unprecedented richness of information in this domain, we also ascertained the presence of several information quality issues. We hereby propose CoV2K, an abstract model for explaining SARS-CoV-2-related concepts and interactions, focusing on viral mutations, their co-occurrence within variants, and their effects. CoV2K provides a clear and concise route map for understanding different connected types of information related to the virus; it thus drives a process of data and knowledge integration that aggregates information from several current resources, harmonizing their content and overcoming incompleteness and inconsistency issues. CoV2K is available for exploration as a graph that can be queried through a RESTful API addressing single entities or paths through their relationships. Practical use cases demonstrate its application to current knowledge inquiries.",
                "authors": [
                    {
                        "name": "Al Khalaf R."
                    },
                    {
                        "name": "Alfonsi T."
                    },
                    {
                        "name": "Bernasconi A."
                    },
                    {
                        "name": "Ceri S."
                    }
                ],
                "citationCount": 6,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "CoV2K model, a comprehensive representation of SARS-CoV-2 knowledge and data interplay"
            }
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
