{
    "additionDate": "2021-01-18T08:17:05Z",
    "biotoolsCURIE": "biotools:snpmol",
    "biotoolsID": "snpmol",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "joelma.mesquita@unirio.br",
            "name": "Joelma Freire De Mesquita",
            "orcidid": "https://orcid.org/0000-0003-1684-3830",
            "typeEntity": "Person"
        }
    ],
    "description": "SNPMOL- Protein Structures and Genetic Variants Database. In silico analysis of the tryptophan hydroxylase 2 (TPH2) protein variants related to psychiatric disorders.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://www.snpmol.org/",
    "lastUpdate": "2021-02-20T08:45:57Z",
    "name": "SNPMOL",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0229730",
            "metadata": {
                "abstract": "© 2020 Pereira et al.The tryptophan hydroxylase 2 (TPH2) enzyme catalyzes the first step of serotonin biosynthesis. Serotonin is known for its role in several homeostatic systems related to sleep, mood, and food intake. As the reaction catalyzed by TPH2 is the rate-limiting step of serotonin biosynthesis, mutations in TPH2 have been associated with several psychiatric disorders (PD). This work undertakes an in silico analysis of the effects of genetic mutations in the human TPH2 protein. Ten algorithms were used to predict the functional and stability effects of the TPH2 mutations. ConSurf was used to estimate the evolutionary conservation of TPH2 amino acids. GROMACS was used to perform molecular dynamics (MD) simulations of TPH2 WT and P260S, R303W, and R441H, which had already been associated with the development of PD. Forty-six TPH2 variants were compiled from the literature. Among the analyzed variants, those occurring at the catalytic domain were shown to be more damaging to protein structure and function. The ConSurf analysis indicated that the mutations affecting the catalytic domain were also more conserved throughout evolution. The variants S364K and S383F were predicted to be deleterious by all the functional algorithms used and occurred at conserved positions, suggesting that they might be deleterious. The MD analyses indicate that the mutations P206S, R303W, and R441H affect TPH2 flexibility and essential mobility at the catalytic and oligomerization domains. The variants P206S, R303W, and R441H also exhibited alterations in dimer binding affinity and stability throughout the simulations. Thus, these mutations may impair TPH2 functional interactions and, consequently, its function, leading to the development of PD. Furthermore, we developed a database, SNPMOL (http://www.snpmol.org/), containing the results presented in this paper. Understanding the effects of TPH2 mutations on protein structure and function may lead to improvements in existing treatments for PD and facilitate the design of further experiments.",
                "authors": [
                    {
                        "name": "Pereira G.R.C."
                    },
                    {
                        "name": "Tavares G.D.B."
                    },
                    {
                        "name": "De Freitas M.C."
                    },
                    {
                        "name": "De Mesquita J.F."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "In silico analysis of the tryptophan hydroxylase 2 (TPH2) protein variants related to psychiatric disorders"
            },
            "pmcid": "PMC7051086",
            "pmid": "32119710"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein variants",
            "uri": "http://edamontology.org/topic_3120"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ]
}