{
    "additionDate": "2021-01-18T10:06:24Z",
    "biotoolsCURIE": "biotools:adenita",
    "biotoolsID": "adenita",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ivan.barisic@ait.ac.at",
            "name": "Ivan Barisic",
            "orcidid": "https://orcid.org/0000-0002-1301-6197",
            "typeEntity": "Person"
        }
    ],
    "description": "Adenita is a 3D visualization and modeling toolkit for the in silico design of static and dynamic DNA nanostructures. Based on a multiscale data model, it visualizes DNA-based structures on different abstraction levels and enable users to load and create DNA origami structures and combine them with proteins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "DNA structure prediction",
                    "uri": "http://edamontology.org/operation_2442"
                }
            ]
        }
    ],
    "homepage": "https://github.com/edellano/Adenita-SAMSON-Edition-Linux",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-21T13:04:42Z",
    "license": "BSD-3-Clause",
    "name": "Adenita",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA593",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.DNA nanotechnology is a rapidly advancing field, which increasingly attracts interest in many different disciplines, such as medicine, biotechnology, physics and biocomputing. The increasing complexity of novel applications requires significant computational support for the design, modelling and analysis of DNA nanostructures. However, current in silico design tools have not been developed in view of these new applications and their requirements. Here, we present Adenita, a novel software tool for the modelling of DNA nanostructures in a user-friendly environment. A data model supporting different DNA nanostructure concepts (multilayer DNA origami, wireframe DNA origami, DNA tiles etc.) has been developed allowing the creation of new and the import of existing DNA nanostructures. In addition, the nanostructures can be modified and analysed on-the-fly using an intuitive toolset. The possibility to combine and re-use existing nanostructures as building blocks for the creation of new superstructures, the integration of alternative molecules (e.g. proteins, aptamers) during the design process, and the export option for oxDNA simulations are outstanding features of Adenita, which spearheads a new generation of DNA nanostructure modelling software. We showcase Adenita by re-using a large nanorod to create a new nanostructure through user interactions that employ different editors to modify the original nanorod.",
                "authors": [
                    {
                        "name": "De Llano E."
                    },
                    {
                        "name": "Miao H."
                    },
                    {
                        "name": "Ahmadi Y."
                    },
                    {
                        "name": "Wilson A.J."
                    },
                    {
                        "name": "Beeby M."
                    },
                    {
                        "name": "Viola I."
                    },
                    {
                        "name": "Barisic I."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Adenita: interactive 3D modelling and visualization of DNA nanostructures"
            },
            "pmcid": "PMC7470936",
            "pmid": "32692355"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ],
    "validated": 1
}