
{
    "credit": [
        {
            "email": "rhiju@stanford.edu",
            "name": "Rhiju Das",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://ribokit.github.io/Primerize/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Rapid RNA synthesis of comprehensive single mutant libraries and targeted multiple mutant libraries is enabling new multidimensional chemical approaches to solve RNA structures. PCR assembly of DNA templates and in vitro transcription allow synthesis and purification of hundreds of RNA mutants in a cost-effective manner, with sharing of primers across constructs allowing significant reductions in expense. However, these protocols require organization of primer locations across numerous 96 well plates and guidance for pipetting, non-trivial tasks for which informatics and visualization tools can prevent costly errors. We report here an online tool to accelerate synthesis of large libraries of desired mutants through design and efficient organization of primers. The underlying program and graphical interface have been experimentally tested in our laboratory for RNA domains with lengths up to 300 nucleotides and libraries encompassing up to 960 variants. In addition to the freely available Primerize-2D server, the primer design code is available as a stand-alone Python package for broader applications.",
            "authors": [
                "Tian S.",
                "Das R."
            ],
            "cit_count": 1,
            "doi": "10.1093/bioinformatics/btw814",
            "journal": "Bioinformatics",
            "title": "Primerize-2D: Automated primer design for RNA multidimensional chemical mapping",
            "year": "2017-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:primerize-2d",
        "biotoolsID": "primerize-2d",
        "description": "Automated primer design for RNA multidimensional chemical mapping .",
        "homepage": "https://primerize.stanford.edu/primerize2d/",
        "name": "Primerize-2D"
    }
}