{
    "additionDate": "2021-01-18T11:25:53Z",
    "biotoolsCURIE": "biotools:icircrbp-dhn",
    "biotoolsID": "icircrbp-dhn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lixt314@jlu.edu.cn",
            "name": "Xiangtao Li",
            "typeEntity": "Person"
        },
        {
            "email": "kc.w@cityu.edu.hk",
            "name": "Ka-Chun Wong",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of circRNA-RBP interaction sites using deep hierarchical network.\n\nThe tool is developed for circRNA-RBP interaction sites identification using deep hierarchical network.\n\nThe 37 training sets of circular RNA (circRNA) and 31 testing sets of linear RNA are provided to evaluate our iCircRBP-DHN and compare with other methods.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/houzl3416/iCircRBP-DHN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-02T07:30:31Z",
    "name": "iCircRBP-DHN",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA274",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Circular RNAs (circRNAs) are widely expressed in eukaryotes. The genome-wide interactions between circRNAs and RNA-binding proteins (RBPs) can be probed from cross-linking immunoprecipitation with sequencing data. Therefore, computational methods have been developed for identifying RBP binding sites on circRNAs. Unfortunately, those computational methods often suffer from the low discriminative power of feature representations, numerical instability and poor scalability. To address those limitations, we propose a novel computational method called iCircRBP-DHN using deep hierarchical network for discriminating circRNA-RBP binding sites. The network architecture can be regarded as a deep multi-scale residual network followed by bidirectional gated recurrent units (BiGRUs) with the self-attention mechanism, which can simultaneously extract local and global contextual information. Meanwhile, we propose novel encoding schemes by integrating CircRNA2Vec and the K-tuple nucleotide frequency pattern to represent different degrees of nucleotide dependencies. To validate the effectiveness of our proposed iCircRBP-DHN, we compared its performance with other computational methods on 37 circRNAs datasets and 31 linear RNAs datasets, respectively. The experimental results reveal that iCircRBP-DHN can achieve superior performance over those state-of-the-art algorithms. Moreover, we perform motif analysis on circRNAs bound by those different RBPs, demonstrating that our proposed CircRNA2Vec encoding scheme can be promising. The iCircRBP-DHN method is made available at https://github.com/houzl3416/iCircRBP-DHN.",
                "authors": [
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Hou Z."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wong K.-C."
                    }
                ],
                "citationCount": 2,
                "date": "2021-07-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "iCircRBP-DHN: identification of circRNA-RBP interaction sites using deep hierarchical network"
            },
            "pmid": "33126261"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}