{
    "accessibility": "Open access",
    "additionDate": "2021-05-26T20:57:37Z",
    "biotoolsCURIE": "biotools:multisnv",
    "biotoolsID": "multisnv",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "malvina.josephidou@cruk.cam.ac.uk",
            "name": "Malvina Josephidou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "multiSNV is a tool for calling somatic single-nucleotide variants (SNVs) using NGS data from a normal and multiple tumour samples of the same patient.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/joseph07/multisnv/wiki/Home"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/joseph07/multisnv/src/master/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-07-29T18:42:01Z",
    "license": "GPL-3.0",
    "name": "multiSNV",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/nar/gkv135",
            "metadata": {
                "abstract": "© 2015 The Author(s) 2015. Published by Oxford University Press on behalf of Nucleic Acids Research.Somatic variant analysis of a tumour sample and its matched normal has been widely used in cancer research to distinguish germline polymorphisms from somatic mutations. However, due to the extensive intratumour heterogeneity of cancer, sequencing data from a single tumour sample may greatly underestimate the overall mutational landscape. In recent studies, multiple spatially or temporally separated tumour samples from the same patient were sequenced to identify the regional distribution of somatic mutations and study intratumour heterogeneity. There are a number of tools to perform somatic variant calling from matched tumour-normal next-generation sequencing (NGS) data; however none of these allow joint analysis of multiple same-patient samples. We discuss the benefits and challenges of multisample somatic variant calling and present multiSNV, a software package for calling single nucleotide variants (SNVs) using NGS data from multiple same-patient samples. Instead of performing multiple pairwise analyses of a single tumour sample and a matched normal, multiSNV jointly considers all available samples under a Bayesian framework to increase sensitivity of calling shared SNVs. By leveraging information from all available samples, multiSNV is able to detect rare mutations with variant allele frequencies down to 3% from whole-exome sequencing experiments.",
                "authors": [
                    {
                        "name": "Josephidou M."
                    },
                    {
                        "name": "Lynch A.G."
                    },
                    {
                        "name": "Tavare S."
                    }
                ],
                "citationCount": 24,
                "date": "2015-02-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MultiSNV: A probabilistic approach for improving detection of somatic point mutations from multiple related tumour samples"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
