{
    "additionDate": "2021-01-18T08:44:16Z",
    "biotoolsCURIE": "biotools:avatree",
    "biotoolsID": "avatree",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "snousias@upatras.gr",
            "name": "Stavros Nousias",
            "orcidid": "https://orcid.org/0000-0002-2811-235X",
            "typeEntity": "Person"
        }
    ],
    "description": "AVATREE is an open-source computational modelling framework modelling Anatomically Valid Airway TREE conformations and provides capabilities for simulation of broncho-constriction apparent in obstructive pulmonary conditions. Additional functionalities of AVATREE include visualization of spatial probability maps for the airway generations projected on the CT imaging data, and visualization of the airway tree based on local structure properties.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/LungModelling/avatree",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-29T19:30:38Z",
    "name": "AVATREE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0230259",
            "metadata": {
                "abstract": "© 2020 Nousias et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.This paper presents AVATREE, a computational modelling framework that generates Anatomically Valid Airway tree conformations and provides capabilities for simulation of broncho-constriction apparent in obstructive pulmonary conditions. Such conformations are obtained from the personalized 3D geometry generated from computed tomography (CT) data through image segmentation. The patient-specific representation of the bronchial tree structure is extended beyond the visible airway generation depth using a knowledge-based technique built from morphometric studies. Additional functionalities of AVATREE include visualization of spatial probability maps for the airway generations projected on the CT imaging data, and visualization of the airway tree based on local structure properties. Furthermore, the proposed toolbox supports the simulation of broncho-constriction apparent in pulmonary diseases, such as chronic obstructive pulmonary disease (COPD) and asthma. AVATREE is provided as an open-source toolbox in C++ and is supported by a graphical user interface integrating the modelling functionalities. It can be exploited in studies of gas flow, gas mixing, ventilation patterns and particle deposition in the pulmonary system, with the aim to improve clinical decision making.",
                "authors": [
                    {
                        "name": "Nousias S."
                    },
                    {
                        "name": "Zacharaki E.I."
                    },
                    {
                        "name": "Moustakas K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Avatree: An open-source computational modelling framework modelling anatomically valid airway TREE conformations"
            },
            "pmcid": "PMC7122715",
            "pmid": "32243444"
        }
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}