{"credit":[{"email":"ohya@k.u-tokyo.ac.jp","name":"Yoshikazu Ohya","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://scmd.gi.k.u-tokyo.ac.jp/datamine/.;jsessionid=04DE5B90FE285E8F92287BEA8C411072"}],"function":[{"operation":[{"term":"Text mining","uri":"http://edamontology.org/operation_0306"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Data mining","uri":"http://edamontology.org/topic_3473"},{"term":"Natural language processing","uri":"http://edamontology.org/topic_0218"},{"term":"Imaging","uri":"http://edamontology.org/topic_3382"}]},"publication":[{"abstract":"To study the global regulation of cell morphology, a number of groups have recently reported genome-wide screening data for yeast mutants with abnormal morphology. Despite the relatively simple ellipsoidal shape of yeast cells, in the past, cell morphology researchers have processed information on cells manually. These time-consuming, entirely subjective tasks motivated us to develop image-processing software that automatically extracts yeast cells from micrographs and processes them to measure key morphological characteristics such as cell size, roundness, bud neck position angle, nuclear DNA localization and actin localization. To date, we have retrieved 960 609 cells from 52 988 micrographs of 2531 mutants using our software, and we have published the results in the Saccharomyces cerevisiae Morphological Database (SCMD), which facilitates the analysis of abnormal cells. Our system provides quantitative data for shapes of the daughter and mother cells, localization of the nuclear DNA and morphology of the actin patches. To search for mutants with similar morphological traits, the system outputs a list of mutants ranked by similarity of average morphological parameters. The SCMD is available at http://yeast.gi.k.u-tokyo.ac.jp/.","authors":["Saito T.L.","Ohtani M.","Sawai H.","Sano F.","Saka A.","Watanabe D.","Yukawa M.","Ohya Y.","Morishita S."],"cit_count":55,"journal":"Nucleic Acids Research","pmid":"14681423","title":"SCMD: Saccharomyces cerevisiae Morphological Database","year":"2004-01-01"},{"abstract":"For comprehensive understanding of precise morphological changes resulting from loss-of-function mutagenesis, a large collection of 1 899 247 cell images was assembled from 91 271 micrographs of 4782 budding yeast disruptants of non-lethal genes. All the cell images were processed computationally to measure ∼500 morphological parameters in individual mutants. We have recently made this morphological quantitative data available to the public through the Saccharomyces cerevisiae Morphological Database (SCMD). Inspecting the significance of morphological discrepancies between the wild type and the mutants is expected to provide clues to uncover genes that are relevant to the biological processes producing a particular morphology. To facilitate such intensive data mining, a suite of new software tools for visualizing parameter value distributions was developed to present mutants with significant changes in easily understandable forms. In addition, for a given group of mutants associated with a particular function, the system automatically identifies a combination of multiple morphological parameters that discriminates a mutant group from others significantly, thereby characterizing the function effectively. These data mining functions are available through the World Wide Web at http://scmd.gi.k.u-tokyo.ac.jp/. © 2005 Oxford University Press.","authors":["Saito T.L.","Sese J.","Nakatani Y.","Sano F.","Yukawa M.","Ohya Y.","Morishita S."],"cit_count":14,"journal":"Nucleic Acids Research","pmid":"15980577","title":"Data mining tools for the Saccharomyces cerevisiae morphological database","year":"2005-07-01"},{"abstract":"Every living organism has its own species-specific morphology. Despite the relatively simple ellipsoidal shape of budding yeast cells, the global regulation of yeast morphology remains unclear. In the past, each mutated gene from many mutants with abnormal morphology had to be classified manually. To investigate the morphological characteristics of yeast in detail, we developed a novel image-processing program that extracts quantitative data from microscope images automatically. This program extracts data on cells that are often used by yeast morphology researchers, such as cell size, roundness, bud neck position angle, and bud growth direction, and fits an ellipse to the cell outline. We evaluated the ability of the program to extract quantitative parameters. The results suggest that our image-processing program can play a central objective role in yeast morphology studies.","authors":["Ohtani M.","Saka A.","Sano F.","Ohya Y.","Morishita S."],"cit_count":39,"journal":"Journal of bioinformatics and computational biology","pmid":"15290760","title":"Development of image processing program for yeast cell morphology.","year":"2004-01-01"}],"summary":{"biotoolsCURIE":"biotools:scmd","biotoolsID":"scmd","description":"Collection of micrographs of budding yeast mutants, visualization and data mining tools are provided.","homepage":"http://scmd.gi.k.u-tokyo.ac.jp/","name":"SCMD"}}