{
    "additionDate": "2017-02-10T14:14:29Z",
    "biotoolsCURIE": "biotools:pongo",
    "biotoolsID": "pongo",
    "credit": [
        {
            "email": "piero.fariselli@unibo.it",
            "name": "Piero Fariselli",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PONGO allows users to compare topology predictions of membrane proteins made by four different predictors (MEMSAT, TMHMM, ENSEMBLE, and PRODIV). It also displays a signal peptide prediction determined with SPEP.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://betaware.biocomp.unibo.it/BetAware/default/method"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                }
            ]
        }
    ],
    "homepage": "http://pongo.biocomp.unibo.it/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "PONGO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Summary: SPEPlip is a neural network-based method, trained and tested on a set of experimentally derived signal peptides from eukaryotes and prokaryotes. SPEPlip identifies the presence of sorting signals and predicts their cleavage sites. The accuracy in cross-validation is similar to that of other available programs: the rate of false positives is 4 and 6%, for prokaryotes and eukaryotes respectively and that of false negatives is 3% in both cases. When a set of 409 prokaryotic lipoproteins is predicted, SPEPlip predicts 97% of the chains in the signal peptide class. However, by integrating SPEPlip with a regular expression search utility based on the PROSITE pattern, we can successfully discriminate signal peptide-containing chains from lipoproteins. We propose the method for detecting and discriminating signal peptides containing chains and lipoproteins. © Oxford University Press 2001.",
                "authors": [
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Finocchiaro G."
                    }
                ],
                "citationCount": 58,
                "date": "2003-12-12T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SPEPlip: The detection of signal peptide and lipoprotein cleavage sites"
            },
            "pmid": "14668245"
        },
        {
            "metadata": {
                "abstract": "The annotation efforts of the BIOSAPIENS European Network of Excellence have generated several distributed annotation systems (DAS) with the aim of integrating Bioinformatics resources and annotating metazoan genomes (http://www.biosapiens.info). In this context, the PONGO DAS server (http://pongo.biocomp.unibo.it) provides the annotation on predictive basis for the all-alpha membrane proteins in the human genome, not only through DAS queries, but also directly using a simple web interface. In order to produce a more comprehensive analysis of the sequence at hand, this annotation is carried out with four selected and high scoring predictors: TMHMM2.0, MEMSAT, PRODIV and ENSEMBLE1.0. The stored and pre-computed predictions for the human proteins can be searched and displayed in a graphical view. However the web service allows the prediction of the topology of any kind of putative membrane proteins, regardless of the organism and more importantly with the same sequence profile for a given sequence when required. Here we present a new web server that incorporates the state-of-the-art topology predictors in a single framework, so that putative users can interactively compare and evaluate four predictions simultaneously for a given sequence. Together with the predicted topology, the server also displays a signal peptide prediction determined with SPEP. The PONGO web server is available at http://pongo.biocomp.unibo.it/pongo. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Amico M."
                    },
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Elofsson A."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Finelli M."
                    },
                    {
                        "name": "Jones D."
                    },
                    {
                        "name": "Krogh A."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Rossi I."
                    },
                    {
                        "name": "Viklund H."
                    },
                    {
                        "name": "Zauli A."
                    },
                    {
                        "name": "von Heijne G."
                    }
                ],
                "citationCount": 32,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PONGO: A web server for multiple predictions of all-alpha transmembrane proteins"
            },
            "pmid": "16844984"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
