{
    "additionDate": "2019-11-14T19:30:00Z",
    "biotoolsCURIE": "biotools:EnClaSC",
    "biotoolsID": "EnClaSC",
    "confidence_flag": "tool",
    "description": "A novel ensemble approach for accurate and robust cell-type classification of single-cell transcriptomes | Abstract Background In recent years, the rapid development of single-cell RNA-sequencing (scRNA-seq) techniques enables the quantitative characterization of cell types at a single-cell resolution. With the explosive growth of the number of cells profiled in individual scRNA-seq experiments, there is a demand for novel computational methods for classifying newly-generated scRNA-seq data onto annotated labels. Although several methods have recently been proposed for the cell-type classification of single-cell transcriptomic data, such limitations as inadequate accuracy, inferior robustness, and low stability greatly limit their wide applications. Results We propose a novel en semble approach, named EnClaSC, for accurate and robust cell-type cla ssification of s ingle- c ell transcriptomic data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xy-chen16/EnClaSC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-25T14:08:16Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/xy-chen16/EnClaSC/issues"
        }
    ],
    "name": "EnClaSC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/754085"
        },
        {
            "doi": "10.1186/s12859-020-03679-z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: In recent years, the rapid development of single-cell RNA-sequencing (scRNA-seq) techniques enables the quantitative characterization of cell types at a single-cell resolution. With the explosive growth of the number of cells profiled in individual scRNA-seq experiments, there is a demand for novel computational methods for classifying newly-generated scRNA-seq data onto annotated labels. Although several methods have recently been proposed for the cell-type classification of single-cell transcriptomic data, such limitations as inadequate accuracy, inferior robustness, and low stability greatly limit their wide applications. Results: We propose a novel ensemble approach, named EnClaSC, for accurate and robust cell-type classification of single-cell transcriptomic data. Through comprehensive validation experiments, we demonstrate that EnClaSC can not only be applied to the self-projection within a specific dataset and the cell-type classification across different datasets, but also scale up well to various data dimensionality and different data sparsity. We further illustrate the ability of EnClaSC to effectively make cross-species classification, which may shed light on the studies in correlation of different species. EnClaSC is freely available at https://github.com/xy-chen16/EnClaSC. Conclusions: EnClaSC enables highly accurate and robust cell-type classification of single-cell transcriptomic data via an ensemble learning method. We expect to see wide applications of our method to not only transcriptome studies, but also the classification of more general data.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Jiang R."
                    }
                ],
                "date": "2020-09-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EnClaSC: A novel ensemble approach for accurate and robust cell-type classification of single-cell transcriptomes"
            },
            "pmcid": "PMC7496207",
            "pmid": "32938367"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}