{
    "additionDate": "2017-08-03T18:59:50Z",
    "biotoolsCURIE": "biotools:smarts",
    "biotoolsID": "smarts",
    "credit": [
        {
            "email": "zivbj@cs.cmu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sb.cs.cmu.edu/"
        }
    ],
    "description": "A method integrating static and time series data from multiple individuals to reconstruct condition specific response networks in an unsupervised way.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sb.cs.cmu.edu/smarts/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://sb.cs.cmu.edu/smarts/",
    "language": [
        "Shell",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/smarts-0-2-reconstructing-disease-response-networks-from-multiple-individuals.html"
        }
    ],
    "name": "SMARTS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 The Author.Motivation: Current methods for reconstructing dynamic regulatory networks are focused on modeling a single response network using model organisms or cell lines. Unlike these models or cell lines, humans differ in their background expression profiles due to age, genetics and life factors. In addition, there are often differences in start and end times for time series human data and in the rate of progress based on the specific individual. Thus, new methods are required to integrate time series data from multiple individuals when modeling and constructing disease response networks. Results: We developed Scalable Models for the Analysis of Regulation from Time Series (SMARTS), a method integrating static and time series data from multiple individuals to reconstruct condition-specific response networks in an unsupervised way. Using probabilistic graphical models, SMARTS iterates between reconstructing different regulatory networks and assigning individuals to these networks, taking into account varying individual start times and response rates. These models can be used to group different sets of patients and to identify transcription factors that differentiate the observed responses between these groups. We applied SMARTS to analyze human response to influenza and mouse brain development. In both cases, it was able to greatly improve baseline groupings while identifying key relevant TFs that differ between the groups. Several of these groupings and TFs are known to regulate the relevant processes while others represent novel hypotheses regarding immune response and development. Availability and implementation: Software and Supplementary information are available at http://sb.cs.cmu.edu/smarts/.",
                "authors": [
                    {
                        "name": "Wise A."
                    },
                    {
                        "name": "Bar-Joseph Z."
                    }
                ],
                "citationCount": 9,
                "date": "2015-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SMARTS: Reconstructing disease response networks from multiple individuals using time series gene expression data"
            },
            "pmid": "25480376"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}