{
    "additionDate": "2021-03-19T09:12:19Z",
    "biotoolsCURIE": "biotools:msi-r",
    "biotoolsID": "msi-r",
    "confidence_flag": "tool",
    "description": "Adaptive Pixel Mass Recalibration for Mass Spectrometry Imaging Based on Locally Endogenous Biological Signals.\n\nUsing Biological Signals for Mass Recalibration of Mass Spectrometry Imaging Data.\n\nThis repository contains the python script performing the recalibration of mass spectrometry images (MSI) from the associated paper Using Biological Signals for Mass Recalibration of Mass Spectrometry Imaging Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mass spectra calibration",
                    "uri": "http://edamontology.org/operation_3627"
                },
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Target-Decoy",
                    "uri": "http://edamontology.org/operation_3649"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LaRoccaRaphael/MSI_recalibration",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-11T11:14:20Z",
    "license": "Apache-2.0",
    "name": "MSI-R",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.0C05071",
            "metadata": {
                "abstract": "© 2021 American Chemical SocietyMass spectrometry imaging (MSI) is a powerful and convenient method for revealing the spatial chemical composition of different biological samples. Molecular annotation of the detected signals is only possible if a high mass accuracy is maintained over the entire image and the m/z range. However, the change in the number of ions from pixel-to-pixel of the biological samples could lead to small fluctuations in the detected m/z-values, called mass shift. The use of internal calibration is known to offer the best solution to avoid, or at least to reduce, mass shifts. Their “a priori” selection for a global MSI acquisition is prone to false positive detection and therefore to poor recalibration. To fill this gap, this work describes an algorithm that recalibrates each spectrum individually by estimating its mass shift with the help of a list of pixel-specific internal calibrating ions, automatically generated in a data-adaptive manner (https://github.com/ LaRoccaRaphael/MSI_recalibration). Through a practical example, we applied the methodology to a zebrafish whole-body section acquired at a high mass resolution to demonstrate the impact of mass shift on data analysis and the capability of our algorithm to recalibrate MSI data. In addition, we illustrate the broad applicability of the method by recalibrating 31 different public MSI data sets from METASPACE from various samples and types of MSI and show that our recalibration significantly increases the numbers of METASPACE annotations (gaining from 20 up to 400 additional annotations), particularly the high-confidence annotations with a low false discovery rate.",
                "authors": [
                    {
                        "name": "Alexandrov T."
                    },
                    {
                        "name": "Eppe G."
                    },
                    {
                        "name": "Kune C."
                    },
                    {
                        "name": "Quinton L."
                    },
                    {
                        "name": "Rocca R.L."
                    },
                    {
                        "name": "Stuart L."
                    },
                    {
                        "name": "Tiquet M."
                    },
                    {
                        "name": "de Pauw E."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-02T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Adaptive pixel mass recalibration for mass spectrometry imaging based on locally endogenous biological signals"
            },
            "pmid": "33583182"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
