{
    "additionDate": "2021-06-14T13:22:21Z",
    "biotoolsCURIE": "biotools:cyproduct",
    "biotoolsID": "cyproduct",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dwishart@ualberta.ca",
            "name": "David S. Wishart",
            "orcidid": "https://orcid.org/0000-0002-3207-2434",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CyProduct is a software tool for accurately predicting the byproducts of human Cytochrome P450 metabolism.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/wishartlab/cyproduct/src/master/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-08-23T19:46:27Z",
    "name": "CyProduct",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.1C00144",
            "metadata": {
                "abstract": "© Published 2021 by American Chemical Society.In silico metabolism prediction is a cheminformatic task of autonomously predicting the set of metabolic byproducts produced from a specified molecule and a set of enzymes or reactions. Here, we describe a novel machine learned in silico cytochrome P450 (CYP450) metabolism prediction suite, called CyProduct, that accurately predicts metabolic byproducts for a specified molecule and a human CYP450 isoform. It includes three modules: (1) CypReact, a tool that predicts if the query compound reacts with a given CYP450 enzyme, (2) CypBoM, a tool that accurately predicts the \"bond site\"of the reaction (i.e., which specific bonds within the query molecule react with the CYP isoform), and (3) MetaboGen, a tool that generates the metabolic byproducts based on CypBoM's bond-site prediction. CyProduct predicts metabolic biotransformation products for each of the nine most important human CYP450 enzymes. CypBoM uses an important new concept called \"bond of metabolism\"(BoM), which extends the traditional \"site of metabolism\"(SoM) by specifying the information about the set of chemical bonds that is modified or formed in a metabolic reaction (rather than the specific atom). We created a BoM database for 1845 CYP450-mediated Phase I reactions, then used this to train the CypBoM Predictor to predict the reactive bond locations on substrate molecules. CypBoM Predictor's cross-validated Jaccard score for reactive bond prediction ranged from 0.380 to 0.452 over the nine CYP450 enzymes. Over variants of a test set of 68 known CYP450 substrates and 30 nonreactants, CyProduct outperformed the other packages, including ADMET Predictor, BioTransformer, and GLORY, by an average of 200% (with respect to Jaccard score) in terms of predicting metabolites. The CyProduct suite and the data sets are freely available at https://bitbucket.org/wishartlab/cyproduct/src/master/.",
                "authors": [
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Greiner R."
                    },
                    {
                        "name": "Guo A."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Tian S."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "date": "2021-06-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "CyProduct: A Software Tool for Accurately Predicting the Byproducts of Human Cytochrome P450 Metabolism"
            },
            "pmid": "34038112",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
