{
    "additionDate": "2020-01-14T20:19:02Z",
    "biotoolsCURIE": "biotools:Deep_Docking",
    "biotoolsID": "Deep_Docking",
    "confidence_flag": "tool",
    "description": "A Deep Learning Approach for Virtual Screening of Big Chemical Datasets.\n\nDrug discovery is an extensive and rigorous process that requires up to 2 billion dollars of investments and more than ten years of research and development to bring a molecule “from bench to a bedside”. While virtual screening can significantly enhance drug discovery workflow, it ultimately lags the current rate of expansion of chemical databases that already incorporate billions of purchasable compounds. This surge of available small molecules presents great opportunities for drug discovery but also demands for faster virtual screening methods and protocols. In order to address this challenge, we herein introduce Deep Docking ( D 2 ) - a novel deep learning-based approach which is suited for docking billions of molecular structures.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vibudh2209/D2",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T15:05:21Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/vibudh2209/D2/issues"
        }
    ],
    "name": "Deep Docking",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/2019.12.15.877316"
        },
        {
            "doi": "10.1021/acscentsci.0c00229",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Drug discovery is a rigorous process that requires billion dollars of investments and decades of research to bring a molecule \"from bench to a bedside\". While virtual docking can significantly accelerate the process of drug discovery, it ultimately lags the current rate of expansion of chemical databases that already exceed billions of molecular records. This recent surge of small molecules availability presents great drug discovery opportunities, but also demands much faster screening protocols. In order to address this challenge, we herein introduce Deep Docking (DD), a novel deep learning platform that is suitable for docking billions of molecular structures in a rapid, yet accurate fashion. The DD approach utilizes quantitative structure-activity relationship (QSAR) deep models trained on docking scores of subsets of a chemical library to approximate the docking outcome for yet unprocessed entries and, therefore, to remove unfavorable molecules in an iterative manner. The use of DD methodology in conjunction with the FRED docking program allowed rapid and accurate calculation of docking scores for 1.36 billion molecules from the ZINC15 library against 12 prominent target proteins and demonstrated up to 100-fold data reduction and 6000-fold enrichment of high scoring molecules (without notable loss of favorably docked entities). The DD protocol can readily be used in conjunction with any docking program and was made publicly available.",
                "authors": [
                    {
                        "name": "Agrawal V."
                    },
                    {
                        "name": "Ban F."
                    },
                    {
                        "name": "Cherkasov A."
                    },
                    {
                        "name": "Gentile F."
                    },
                    {
                        "name": "Gleave M.E."
                    },
                    {
                        "name": "Hsing M."
                    },
                    {
                        "name": "Norinder U."
                    },
                    {
                        "name": "Ton A.-T."
                    }
                ],
                "citationCount": 22,
                "date": "2020-06-24T00:00:00Z",
                "journal": "ACS Central Science",
                "title": "Deep Docking: A Deep Learning Platform for Augmentation of Structure Based Drug Discovery"
            },
            "pmcid": "PMC7318080",
            "pmid": "32607441"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        }
    ],
    "validated": 1
}
