
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://faculty.uaeu.ac.ae/nzaki/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/freescore-classification-conotoxin-proteins.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Conotoxin has been proven to be effective in drug design and could be used to treat various disorders such as schizophrenia, neuromuscular disorders and chronic pain. With the rapidly growing interest in conotoxin, accurate conotoxin superfamily classification tools are desirable to systematize the increasing number of newly discovered sequences and structures. However, despite the significance and extensive experimental investigations on conotoxin, those tools have not been intensively explored.Results: In this paper, we propose to consider suboptimal alignments of words with restricted length. We developed a scoring system based on local alignment partition functions, called free score. The scoring system plays the key role in the feature extraction step of support vector machine classification. In the classification of conotoxin proteins, our method, SVM-Freescore, features an improved sensitivity and specificity by approximately 5.864% and 3.76%, respectively, over previously reported methods. For the generalization purpose, SVM-Freescore was also applied to classify superfamilies from curated and high quality database such as ConoServer. The average computed sensitivity and specificity for the superfamily classification were found to be 0.9742 and 0.9917, respectively. . Conclusions: The SVM-Freescore method is shown to be a useful sequence-based analysis tool for functional and structural characterization of conotoxin proteins. The datasets and the software are available at http://faculty.uaeu.ac.ae/nzaki/SVM-Freescore.htm. © 2011 Zaki et al; licensee BioMed Central Ltd.",
            "authors": [
                "Zaki N.",
                "Wolfsheimer S.",
                "Nuel G.",
                "Khuri S."
            ],
            "cit_count": 21,
            "doi": "10.1186/1471-2105-12-217",
            "journal": "BMC Bioinformatics",
            "title": "Conotoxin protein classification using free scores of words and support vector machines",
            "type": "Primary",
            "year": "2011-05-29"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:freescore",
        "biotoolsID": "freescore",
        "description": "Freescore is a scoring system based on local alignment partition functions for the classification of conotoxin proteins",
        "homepage": "http://faculty.uaeu.ac.ae/nzaki/SVM-Freescore.htm",
        "name": "Freescore"
    }
}