{
    "additionDate": "2024-04-19T08:16:51.295534Z",
    "biotoolsCURIE": "biotools:singlescan",
    "biotoolsID": "singlescan",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "haoyang.cai@scu.edu.cn",
            "name": "Haoyang Cai",
            "typeEntity": "Person"
        },
        {
            "email": "stardustcx@163.com",
            "name": "Jian Yang",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive resource for single-cell sequencing data processing and mining.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "http://cailab.labshare.cn/SingleScan",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-04-19T08:16:51.298059Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/victorwang123/SingleScan"
        }
    ],
    "name": "SingleScan",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05590-9",
            "metadata": {
                "abstract": "Single-cell sequencing has shed light on previously inaccessible biological questions from different fields of research, including organism development, immune function, and disease progression. The number of single-cell-based studies increased dramatically over the past decade. Several new methods and tools have been continuously developed, making it extremely tricky to navigate this research landscape and develop an up-to-date workflow to analyze single-cell sequencing data, particularly for researchers seeking to enter this field without computational experience. Moreover, choosing appropriate tools and optimal parameters to meet the demands of researchers represents a major challenge in processing single-cell sequencing data. However, a specific resource for easy access to detailed information on single-cell sequencing methods and data processing pipelines is still lacking. In the present study, an online resource called SingleScan was developed to curate all up-to-date single-cell transcriptome/genome analyzing tools and pipelines. All the available tools were categorized according to their main tasks, and several typical workflows for single-cell data analysis were summarized. In addition, spatial transcriptomics, which is a breakthrough molecular analysis method that enables researchers to measure all gene activity in tissue samples and map the site of activity, was included along with a portion of single-cell and spatial analysis solutions. For each processing step, the available tools and specific parameters used in published articles are provided and how these parameters affect the results is shown in the resource. All information used in the resource was manually extracted from related literature. An interactive website was designed for data retrieval, visualization, and download. By analyzing the included tools and literature, users can gain insights into the trends of single-cell studies and easily grasp the specific usage of a specific tool. SingleScan will facilitate the analysis of single-cell sequencing data and promote the development of new tools to meet the growing and diverse needs of the research community. The SingleScan database is publicly accessible via the website at http://cailab.labshare.cn/SingleScan .",
                "authors": [
                    {
                        "name": "Bao G."
                    },
                    {
                        "name": "Cai H."
                    },
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Dong L."
                    },
                    {
                        "name": "Gou Y."
                    },
                    {
                        "name": "Ma W."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SingleScan: a comprehensive resource for single-cell sequencing data processing and mining"
            },
            "pmcid": "PMC10704760",
            "pmid": "38062357"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
