{
    "additionDate": "2020-01-14T20:02:13Z",
    "biotoolsCURIE": "biotools:AmpliconTagger",
    "biotoolsID": "AmpliconTagger",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "julien.tremblay@nrc-cnrc.gc.ca",
            "name": "Julien Tremblay",
            "orcidid": "https://orcid.org/0000-0002-6085-3481",
            "typeEntity": "Person"
        }
    ],
    "description": "Systematic processing of ribosomal RNA gene amplicon sequencing data.\n\nThis is the AmpliconTagger home page.\n\nAmpliconTagger pipeline - for various types of amplicon sequencing data.\n\nBy Julien Tremblay - julien.tremblay_at_nrc-cnrc.gc.ca",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "http://jtremblay.github.io/amplicontagger.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-14T18:38:34Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://jtremblay.github.io/PipelineViewer/amplicontagger.html"
        }
    ],
    "name": "AmpliconTagger",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_019112"
        }
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ146",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Background: With the advent of high-throughput sequencing, microbiology is becoming increasingly data-intensive. Because of its low cost, robust databases, and established bioinformatic workflows, sequencing of 16S/18S/ITS ribosomal RNA (rRNA) gene amplicons, which provides a marker of choice for phylogenetic studies, has become ubiquitous. Many established end-to-end bioinformatic pipelines are available to perform short amplicon sequence data analysis. These pipelines suit a general audience, but few options exist for more specialized users who are experienced in code scripting, Linux-based systems, and high-performance computing (HPC) environments. For such an audience, existing pipelines can be limiting to fully leverage modern HPC capabilities and perform tweaking and optimization operations. Moreover, a wealth of stand-alone software packages that perform specific targeted bioinformatic tasks are increasingly accessible, and finding a way to easily integrate these applications in a pipeline is critical to the evolution of bioinformatic methodologies. Results: Here we describe AmpliconTagger, a short rRNA marker gene amplicon pipeline coded in a Python framework that enables fine tuning and integration of virtually any potential rRNA gene amplicon bioinformatic procedure. It is designed to work within an HPC environment, supporting a complex network of job dependencies with a smart-restart mechanism in case of job failure or parameter modifications. As proof of concept, we present end results obtained with AmpliconTagger using 16S, 18S, ITS rRNA short gene amplicons and Pacific Biosciences long-read amplicon data types as input. Conclusions: Using a selection of published algorithms for generating operational taxonomic units and amplicon sequence variants and for computing downstream taxonomic summaries and diversity metrics, we demonstrate the performance and versatility of our pipeline for systematic analyses of amplicon sequence data.",
                "authors": [
                    {
                        "name": "Tremblay J."
                    },
                    {
                        "name": "Yergeau E."
                    }
                ],
                "citationCount": 12,
                "date": "2019-12-06T00:00:00Z",
                "journal": "GigaScience",
                "title": "Systematic processing of ribosomal RNA gene amplicon sequencing data"
            },
            "pmcid": "PMC6901069",
            "pmid": "31816087"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
