{
    "additionDate": "2018-05-10T20:55:46Z",
    "biotoolsCURIE": "biotools:car",
    "biotoolsID": "car",
    "credit": [
        {
            "email": "cllu@cs.nthu.edu.tw",
            "name": "Dr. Chin Lung Lu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Contig assembly of prokaryotic draft genomes using rearrangements.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genome.cs.nthu.edu.tw/CAR/help/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "homepage": "http://genome.cs.nthu.edu.tw/CAR/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "CAR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-014-0381-3",
            "metadata": {
                "abstract": "© Lu et al.; licensee BioMed Central Ltd.Background: Next generation sequencing technology has allowed efficient production of draft genomes for many organisms of interest. However, most draft genomes are just collections of independent contigs, whose relative positions and orientations along the genome being sequenced are unknown. Although several tools have been developed to order and orient the contigs of draft genomes, more accurate tools are still needed. Results: In this study, we present a novel reference-based contig assembly (or scaffolding) tool, named as CAR, that can efficiently and more accurately order and orient the contigs of a prokaryotic draft genome based on a reference genome of a related organism. Given a set of contigs in multi-FASTA format and a reference genome in FASTA format, CAR can output a list of scaffolds, each of which is a set of ordered and oriented contigs. For validation, we have tested CAR on a real dataset composed of several prokaryotic genomes and also compared its performance with several other reference-based contig assembly tools. Consequently, our experimental results have shown that CAR indeed performs better than all these other reference-based contig assembly tools in terms of sensitivity, precision and genome coverage. Conclusions: CAR serves as an efficient tool that can more accurately order and orient the contigs of a prokaryotic draft genome based on a reference genome. The web server of CAR is freely available at and its stand-alone program can also be downloaded from the same website.",
                "authors": [
                    {
                        "name": "Chen K.-T."
                    },
                    {
                        "name": "Chiu H.-T."
                    },
                    {
                        "name": "Huang S.-Y."
                    },
                    {
                        "name": "Lu C.L."
                    }
                ],
                "citationCount": 27,
                "date": "2014-11-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Car: Contig assembly of prokaryotic draft genomes using rearrangements"
            },
            "pmcid": "PMC4253983",
            "pmid": "25431302"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
