{
    "accessibility": "Open access",
    "additionDate": "2022-12-27T03:15:36.449191Z",
    "biotoolsCURIE": "biotools:lpsn",
    "biotoolsID": "lpsn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Beverley Cherie Millar"
        },
        {
            "name": "John Edmund Moore"
        }
    ],
    "description": "The List of Prokaryotic names with Standing in Nomenclature (LPSN) provides comprehensive information on the nomenclature of prokaryotes and much more.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://lpsn.dsmz.de/",
    "lastUpdate": "2022-12-27T03:15:36.451689Z",
    "name": "LPSN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.4103/IJMY.IJMY_120_22",
            "metadata": {
                "abstract": "© 2022 Wolters Kluwer Medknow Publications. All rights reserved.Background: Nontuberculous mycobacteria (NTMs) have now emerged as important opportunistic bacterial pathogens, particularly among patients with cystic fibrosis (CF). The development of improved molecular technologies and bioinformatics and the adoption of whole-genome sequencing to more isolates have allowed for a reanalysis of the existing taxa within the genus Mycobacterium, resulting in the renaming of some existing NTM Mycobacterium species to three novel genera, viz., Mycolicibacterium gen. nov., Mycolicibacter gen. nov. and Mycobacteroides gen. nov. This has resulted in controversy, particularly within the clinical community, accompanied by a reluctance to adopt and employ these new bacterial names. Therefore, the aims of this study were (i) to identify NTM organisms associated with CF lung disease that have been reported previously in the published literature, (ii) to examine the realignment of NTM organisms previously described in CF within the revised new mycobacterial taxonomy and renaming, and (iii) to identify and explore online taxonomical tools to help educate clinical medicine about recent changes in NTM taxonomy. Methods: Three tasks were performed, namely (i) to identify NTM organisms previously associated with people with CF, (ii) to examine the extent and scope of the reclassification of CF-related NTM species affected by changes in recent taxonomy and nomenclature, and (iii) to identify and examine the educational utility of online taxonomical educational tools/software (LifeMap [http://lifemap.univ-lyon1.fr/]; National Center for Biotechnology Information [NCBI] Taxonomy browser [https://www.ncbi.nlm.nih. gov/guide/taxonomy/]; and List of Prokaryotic names with Standing in Nomenclature [LPSN] [https://lpsn.dsmz.de/]). Mycobacterium (Mycobacteroides) abscessus was selected as the species to evaluate the application of these tools. Results: Twenty-one NTM species have been reported that have been associated with CF lung disease. Of these, two have been reclassified into the Mycobacteroides genus, two into the Mycolicibacter genus, and seven into the Mycolicibacterium genus. LifeMap, NCBI Taxonomy browser, and LPSN offered interactive visual support to better understand the taxonomy and nomenclature of NTM organisms. Conclusion: We, therefore, advocate that clinical and scientific parties employ these online tools to gain a better insight into the familiarization and understanding of such evolving NTM classification, thereby aiding a better lexicon and communication among all stakeholders.",
                "authors": [
                    {
                        "name": "Millar B.C."
                    },
                    {
                        "name": "Moore J.E."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "International Journal of Mycobacteriology",
                "title": "Helping map the taxonomical position of the Nontuberculous Mycobacteria (NTM) in cystic fibrosis"
            },
            "pmid": "36260450"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
