{
    "additionDate": "2019-11-14T20:00:56Z",
    "biotoolsCURIE": "biotools:EvidenceAggregatedDriverRanking",
    "biotoolsID": "EvidenceAggregatedDriverRanking",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "ben.logsdon@sagebionetworks.org",
            "name": "Benjamin A Logsdon",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'IMPLEMENTATION:Source', 'MOTIVATION:Late', 'multiview' (bio.tools/multiview), 'Alzheimer' | Identifying and ranking potential driver genes of Alzheimer's disease using multiview evidence aggregation | Ranking methodology of potential Driver genes using multi-view feature sets | Ranking methodology of potential Driver genes using multi-view feature sets as described in: | Mukherjee, S., Perumal, T., Daily, K., Sieberts, S., Omberg, L., Preuss, C., Carter, G., Mangravite, L. and Logsdon, B., 2019. Identifying and ranking potential driver genes of Alzheimer's Disease using multi-view evidence aggregation. (Accepted to ISMB/ECCB 2019) | git clone https://github.com/Sage-Bionetworks/EvidenceAggregatedDriverRanking.git",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Sage-Bionetworks/EvidenceAggregatedDriverRanking",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T20:00:56Z",
    "license": "Apache-2.0",
    "name": "EvidenceAggregatedDriverRanking",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ365",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Late onset Alzheimer's disease is currently a disease with no known effective treatment options. To better understand disease, new multi-omic data-sets have recently been generated with the goal of identifying molecular causes of disease. However, most analytic studies using these datasets focus on uni-modal analysis of the data. Here, we propose a data driven approach to integrate multiple data types and analytic outcomes to aggregate evidences to support the hypothesis that a gene is a genetic driver of the disease. The main algorithmic contributions of our article are: (i) a general machine learning framework to learn the key characteristics of a few known driver genes from multiple feature sets and identifying other potential driver genes which have similar feature representations, and (ii) A flexible ranking scheme with the ability to integrate external validation in the form of Genome Wide Association Study summary statistics. While we currently focus on demonstrating the effectiveness of the approach using different analytic outcomes from RNA-Seq studies, this method is easily generalizable to other data modalities and analysis types. Results: We demonstrate the utility of our machine learning algorithm on two benchmark multiview datasets by significantly outperforming the baseline approaches in predicting missing labels. We then use the algorithm to predict and rank potential drivers of Alzheimer's. We show that our ranked genes show a significant enrichment for single nucleotide polymorphisms associated with Alzheimer's and are enriched in pathways that have been previously associated with the disease.",
                "authors": [
                    {
                        "name": "Mukherjee S."
                    },
                    {
                        "name": "Perumal T.M."
                    },
                    {
                        "name": "Daily K."
                    },
                    {
                        "name": "Sieberts S.K."
                    },
                    {
                        "name": "Omberg L."
                    },
                    {
                        "name": "Preuss C."
                    },
                    {
                        "name": "Carter G.W."
                    },
                    {
                        "name": "Mangravite L.M."
                    },
                    {
                        "name": "Logsdon B.A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifying and ranking potential driver genes of Alzheimer's disease using multiview evidence aggregation"
            },
            "pmcid": "PMC6612835",
            "pmid": "31510680"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ]
}