{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-28T10:56:50Z",
    "biotoolsCURIE": "biotools:LipidMS",
    "biotoolsID": "LipidMS",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "maialba@alumni.uv.es",
            "name": "M Isabel Alcoriza-Balaguer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R Package for Lipid Annotation in Untargeted Liquid Chromatography-Data Independent Acquisition-Mass Spectrometry Lipidomics.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cran/LipidMS"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=LipidMS",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-07-19T16:36:28Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "LipidMS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.8b03409",
            "metadata": {
                "abstract": "© 2018 American Chemical Society. High resolution LC-MS untargeted lipidomics using data independent acquisition (DIA) has the potential to increase lipidome coverage, as it enables the continuous and unbiased acquisition of all eluting ions. However, the loss of the link between the precursor and the product ions combined with the high dimensionality of DIA data sets hinder accurate feature annotation. Here, we present LipidMS, an R package aimed to confidently identify lipid species in untargeted LC-DIA-MS. To this end, LipidMS combines a coelution score, which links precursor and fragment ions with fragmentation and intensity rules. Depending on the MS evidence reached by the identification function survey, LipidMS provides three levels of structural annotations: (i) \"subclass level\", e.g., PG(34:1); (ii) \"fatty acyl level\", e.g., PG(16:0-18:1); and (iii) \"fatty acyl position level\", e.g., PG(16:0/18:1). The comparison of LipidMS with freely available data dependent acquisition (DDA) and DIA identification tools showed that LipidMS provides significantly more accurate and structural informative lipid identifications. Finally, to exemplify the utility of LipidMS, we investigated the lipidomic serum profile of patients diagnosed with nonalcoholic steatohepatitis (NASH), which is the progressive form of nonalcoholic fatty liver disease, a disorder underlying a strong lipid dysregulation. As previously published, a significant decrease in lysophosphatidylcholines, phosphatidylcholines and cholesterol esters and an increase in phosphatidylethanolamines were observed in NASH patients. Remarkably, LipidMS allowed the identification of a new set of lipids that may be used for NASH diagnosis. Altogether, LipidMS has been validated as a tool to assist lipid identification in the LC-DIA-MS untargeted analysis of complex biological samples.",
                "authors": [
                    {
                        "name": "Alcoriza-Balaguer M.I."
                    },
                    {
                        "name": "Garcia-Canaveras J.C."
                    },
                    {
                        "name": "Lopez A."
                    },
                    {
                        "name": "Conde I."
                    },
                    {
                        "name": "Juan O."
                    },
                    {
                        "name": "Carretero J."
                    },
                    {
                        "name": "Lahoz A."
                    }
                ],
                "date": "2019-01-02T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "LipidMS: An R Package for Lipid Annotation in Untargeted Liquid Chromatography-Data Independent Acquisition-Mass Spectrometry Lipidomics"
            },
            "pmid": "30500173",
            "type": "Primary"
        }
    ],
    "relation": [
        {
            "biotoolsID": "R",
            "type": "uses"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        }
    ],
    "version": [
        "1.0.0"
    ]
}