{
    "additionDate": "2018-10-31T10:57:03Z",
    "biotoolsCURIE": "biotools:altools",
    "biotoolsID": "altools",
    "credit": [
        {
            "email": "scamiolo@uniss.it",
            "name": "Salvatore Camiolo",
            "orcidid": "http://orcid.org/0000-0002-8874-9993",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Altools is a software package that allows the precise detection of polymorphisms and structural variations.",
    "documentation": [
        {
            "note": "Manual is included in the provided archived files.",
            "type": [
                "User manual"
            ],
            "url": "https://sourceforge.net/projects/altools/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/altools/",
    "language": [
        "C++",
        "Java",
        "R"
    ],
    "lastUpdate": "2019-01-13T00:48:53Z",
    "license": "GPL-3.0",
    "name": "Altools",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s13062-016-0110-0",
            "metadata": {
                "abstract": "© 2016 Camiolo et al.Background: Genotyping by re-sequencing has become a standard approach to estimate single nucleotide polymorphism (SNP) diversity, haplotype structure and the biodiversity and has been defined as an efficient approach to address geographical population genomics of several model species. To access core SNPs and insertion/deletion polymorphisms (indels), and to infer the phyletic patterns of speciation, most such approaches map short reads to the reference genome. Variant calling is important to establish patterns of genome-wide association studies (GWAS) for quantitative trait loci (QTLs), and to determine the population and haplotype structure based on SNPs, thus allowing content-dependent trait and evolutionary analysis. Several tools have been developed to investigate such polymorphisms as well as more complex genomic rearrangements such as copy number variations, presence/absence variations and large deletions. The programs available for this purpose have different strengths (e.g. accuracy, sensitivity and specificity) and weaknesses (e.g. low computation speed, complex installation procedure and absence of a user-friendly interface). Here we introduce Altools, a software package that is easy to install and use, which allows the precise detection of polymorphisms and structural variations. Results: Altools uses the BWA/SAMtools/VarScan pipeline to call SNPs and indels, and the dnaCopy algorithm to achieve genome segmentation according to local coverage differences in order to identify copy number variations. It also uses insert size information from the alignment of paired-end reads and detects potential large deletions. A double mapping approach (BWA/BLASTn) identifies precise breakpoints while ensuring rapid elaboration. Finally, Altools implements several processes that yield deeper insight into the genes affected by the detected polymorphisms. Altools was used to analyse both simulated and real next-generation sequencing (NGS) data and performed satisfactorily in terms of positive predictive values, sensitivity, the identification of large deletion breakpoints and copy number detection. Conclusions: Altools is fast, reliable and easy to use for the mining of NGS data. The software package also attempts to link identified polymorphisms and structural variants to their biological functions thus providing more valuable information than similar tools. Reviewers: This article was reviewed by Prof. Lee and Prof. Raghava. Open peer review: Reviewed by Prof. Lee and Prof. Raghava. For the full reviews, please go to the Reviewers' comments section.",
                "authors": [
                    {
                        "name": "Camiolo S."
                    },
                    {
                        "name": "Porceddu A."
                    },
                    {
                        "name": "Sablok G."
                    }
                ],
                "citationCount": 4,
                "date": "2016-02-17T00:00:00Z",
                "journal": "Biology Direct",
                "title": "Altools: A user friendly NGS data analyser"
            },
            "pmcid": "PMC4756442",
            "pmid": "26883204",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
