{
    "additionDate": "2020-01-14T20:14:25Z",
    "biotoolsCURIE": "biotools:DEmiRs",
    "biotoolsID": "DEmiRs",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "zhangshutian@ccmu.edu.cn",
            "name": "Shutian Zhang",
            "orcidid": "https://orcid.org/0000-0003-2356-4397",
            "typeEntity": "Person"
        },
        {
            "email": "minli@ccmu.edu.cn",
            "name": "Li Min",
            "orcidid": "https://orcid.org/0000-0001-9595-5536",
            "typeEntity": "Person"
        }
    ],
    "description": "A Circulating miRNA-Based Scoring System Established by WGCNA to Predict Colon Cancer.\n\nIntroduction:Circulation microRNAs (miRNAs) perform as potential diagnostic biomarkers of many kinds of cancers. This study is aimed at identifying circulation miRNAs as diagnostic biomarkers in colon cancer. Methods:We conducted a weighted gene coexpression network analysis (WGCNA) in miRNAs to find out the expression pattern among circulation miRNAs by using a \"WGCNA\" package in R. Correlation analysis was performed to find cancer-related modules. Differentially expressed miRNAs (DEmiRs) in colon cancer were identified by a \"limma\" package in R. Hub gene analysis was conducted for these DEmiRs in the cancer-related modules by the \"closeness\" method in cytoscape software.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'WGCNA' (bio.tools/wgcna)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31871878",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T20:14:25Z",
    "name": "DEmiRs",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1155/2019/1571045",
            "metadata": {
                "abstract": "© 2019 Da Qin et al.Introduction. Circulation microRNAs (miRNAs) perform as potential diagnostic biomarkers of many kinds of cancers. This study is aimed at identifying circulation miRNAs as diagnostic biomarkers in colon cancer. Methods. We conducted a weighted gene coexpression network analysis (WGCNA) in miRNAs to find out the expression pattern among circulation miRNAs by using a \"WGCNA\" package in R. Correlation analysis was performed to find cancer-related modules. Differentially expressed miRNAs (DEmiRs) in colon cancer were identified by a \"limma\" package in R. Hub gene analysis was conducted for these DEmiRs in the cancer-related modules by the \"closeness\" method in cytoscape software. Then, logistic regression was performed to identify the independent risk factors, and a scoring system was constructed based on these independent risk factors. Then, we use data from the GEO database to confirm the reliability of this scoring system. Results. A total of 9 independent coexpression modules were constructed based on the expression levels of 848 miRNAs by WGCNA. After correlation analysis, green (cor=0.77, p=3×10-25) and yellow (cor=0.65, p=6×10-16) modules were strongly correlated with cancer development. 20 hub genes were found after hub gene analysis in these DEmiRs by cytoscape. Among all these hub genes, hsa-miR-23a-3p (OR=2.6391, p=6.23×10-5) and hsa-miR-663a (OR=1.4220, p=0.0069) were identified as an independent risk factor of colon cancer by multivariate regression. Furthermore, a scoring system was built to predict the probability of colon cancer based on both of these miRNAs, the area under the curve (AUC) of which was 0.828. Data from GSE106817 and GSE112264 was used to confirm this scoring system. And the AUC of them was 0.980 and 0.917, respectively. Conclusion. We built a scoring system based on circulation hub miRNAs found by WGCNA to predict the development of colon cancer.",
                "authors": [
                    {
                        "name": "Qin D."
                    },
                    {
                        "name": "Wei R."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Zhu S."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Min L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Analytical Cellular Pathology",
                "title": "A Circulating miRNA-Based Scoring System Established by WGCNA to Predict Colon Cancer"
            },
            "pmcid": "PMC6913280",
            "pmid": "31871878"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}