{
    "additionDate": "2017-12-18T00:12:29Z",
    "biotoolsCURIE": "biotools:sixpac",
    "biotoolsID": "sixpac",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cs.columbia.edu/~snehitp/"
        }
    ],
    "description": "Scalable search algorithm that finds synergy between pairs of physically unlinked SNPs (genome-wide) in large case-control datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.cs.columbia.edu/~snehitp/sixpac/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sixpac-1-0-2-search-engine-genetic-interactions.html"
        }
    ],
    "name": "SIXPAC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1101/gr.137885.112",
            "metadata": {
                "abstract": "Long-range gene-gene interactions are biologically compelling models for disease genetics and can provide insights on relevant mechanisms and pathways. Despite considerable effort, rigorous interaction mapping in humans has remained prohibitively difficult due to computational and statistical limitations. We introduce a novel algorithmic approach to find long-range interactions in common diseases using a standard two-locus test that contrasts the linkage disequilibrium between SNPs in cases and controls. Our ultrafast method overcomes the computational burden of a genome × genome scan by using a novel randomization technique that requires 10× to 100× fewer tests than a brute-force approach. By sampling small groups of cases and highlighting combinations of alleles carried by all individuals in the group, this algorithm drastically trims the universe of combinations while simultaneously guaranteeing that all statistically significant pairs are reported. Our implementation can comprehensively scan large data sets (2K cases, 3K controls, 500K SNPs) to find all candidate pairwise interactions (LD-contrast p < 10-12) in a few hours-a task that typically took days or weeks to complete by methods running on equivalent desktop computers. We applied our method to the Wellcome Trust bipolar disorder data and found a significant interaction between SNPs located within genes encoding two calcium channel subunits: RYR2 on chr1q43 and CACNA2D4 on chr12p13 (LD-contrast test, p = 4.6 × 10-14). We replicated this pattern of interchromosomal LD between the genes in a separate bipolar data set from the GAIN project, demonstrating an example of gene-gene interaction that plays a role in the largely uncharted genetic landscape of bipolar disorder. © 2012, Published by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Pe'er I."
                    },
                    {
                        "name": "Prabhu S."
                    }
                ],
                "citationCount": 71,
                "date": "2012-11-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Ultrafast genome-wide scan for SNP-SNP interactions in common complex disease"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Interactions",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.2"
    ]
}
