
{
    "credit": [
        {
            "email": "oliver@ugr.es",
            "name": "J. L. Oliver",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://isofinder.sourceforge.net/IsoFinderHelp.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                },
                {
                    "term": "Sequence cutting",
                    "uri": "http://edamontology.org/operation_0369"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Isochores are long genome segments homogeneous in G+C. Here, we describe an algorithm (IsoFinder) running on the web (http://bioinfo2.ugr.es/IsoF/isofinder.html) able to predict isochores at the sequence level. We move a sliding pointer from left to right along the DNA sequence. At each position of the pointer, we compute the mean G+C values to the left and to the right of the pointer. We then determine the position of the pointer for which the difference between left and right mean values (as measured by the t-statistic) reaches its maximum. Next, we determine the statistical significance of this potential cutting point, after filtering out short-scale heterogeneities below 3 kb by applying a coarse-graining technique. Finally, the program checks whether this significance exceeds a probability threshold. If so, the sequence is cut at this point into two subsequences; otherwise, the sequence remains undivided. The procedure continues recursively for each of the two resulting subsequences created by each cut. This leads to the decomposition of a chromosome sequence into long homogeneous genome regions (LHGRs) with well-defined mean G+C contents, each significantly different from the G+C contents of the adjacent LHGRs. Most LHGRs can be identified with Bernardi's isochores, given their correlation with biological features such as gene density, SINE and LINE (short, long interspersed repetitive elements) densities, recombination rate or single nucleotide polymorphism variability. The resulting isochore maps are available at our web site (http://bioinfo2.ugr.es/isochores/), and also at the UCSC Genome Browser (http://genome.cse.ucsc.edu/). © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Oliver J.L.",
                "Carpena P.",
                "Hackenberg M.",
                "Bernaola-Galvan P."
            ],
            "cit_count": 64,
            "journal": "Nucleic Acids Research",
            "pmid": "15215396",
            "title": "IsoFinder: Computational prediction of isochores in genome sequences",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:isofinder",
        "biotoolsID": "isofinder",
        "description": "IsoFinder is a tool for the prediction of isochores for a user-supplied sequence.",
        "homepage": "http://isofinder.sourceforge.net/",
        "name": "IsoFinder"
    }
}