
{
    "credit": [
        {
            "email": "alves@ncbi.nlm.nih.gov",
            "name": "Gelio Alves",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/CBBresearch/Yu/"
        },
        {
            "email": "ogurtsov@ncbi.nlm.nih.gov",
            "name": "Aleksey Ogurtsov",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.ncbi.nlm.nih.gov/CBBresearch/Yu/downloads/MIDAs.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular biology",
                "uri": "http://edamontology.org/topic_3047"
            },
            {
                "term": "Biochemistry",
                "uri": "http://edamontology.org/topic_3292"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/midas-molecular-isotopic-distribution-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "In this paper, we present Molecular Isotopic Distribution Analysis (MIDAs), a new software tool designed to compute molecular isotopic distributions with adjustable accuracies. MIDAs offers two algorithms, one polynomial-based and one Fourier-transform-based, both of which compute molecular isotopic distributions accurately and efficiently. The polynomial-based algorithm contains few novel aspects, whereas the Fourier-transform-based algorithm consists mainly of improvements to other existing Fourier-transform-based algorithms. We have benchmarked the performance of the two algorithms implemented in MIDAs with that of eight software packages (BRAIN, Emass, Mercury, Mercury5, NeutronCluster, Qmass, JFC, IC) using a consensus set of benchmark molecules. Under the proposed evaluation criteria, MIDAs's algorithms, JFC, and Emass compute with comparable accuracy the coarse-grained (low-resolution) isotopic distributions and are more accurate than the other software packages. For fine-grained isotopic distributions, we compared IC, MIDAs's polynomial algorithm, and MIDAs's Fourier transform algorithm. Among the three, IC and MIDAs's polynomial algorithm compute isotopic distributions that better resemble their corresponding exact fine-grained (high-resolution) isotopic distributions. MIDAs can be accessed freely through a user-friendly web-interface at http://www.ncbi.nlm.nih.gov/ CBBresearch/Yu/midas/index.html.[Figure not available: see fulltext.] © 2013 The Author(s).",
            "authors": [
                "Alves G.",
                "Ogurtsov A.Y.",
                "Yu Y.-K."
            ],
            "cit_count": 3,
            "journal": "Journal of the American Society for Mass Spectrometry",
            "pmid": "24254576",
            "title": "Molecular Isotopic Distribution Analysis (MIDAs) with adjustable mass accuracy",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:midas",
        "biotoolsID": "midas",
        "description": "Software designed to compute the theoretical isotopic distribution for molecules of known elemental composition. It computes for a molecule simultaneously two isotopic distributions: the coarse-grained isotopic distribution and the fine-grained isotopic distribution.",
        "homepage": "http://www.ncbi.nlm.nih.gov/CBBresearch/Yu/midas/index.html",
        "name": "MIDAs"
    }
}