{
    "additionDate": "2017-05-16T12:28:28Z",
    "biotoolsCURIE": "biotools:aida",
    "biotoolsID": "aida",
    "credit": [
        {
            "email": "adam@sanfordburnham.org",
            "name": "Adam Godzik",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "AIDA: Ab Initio Domain Assembly Server attempts to find the best domain arrangements while maintaining chain connectivity. The server also supports structure assembly from sequence only and restraint-guided simulation producing a final assembly satisfying user-specified inter-domain distance restraints.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ffas.burnham.org/AIDA/explain.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein domain recognition",
                    "uri": "http://edamontology.org/operation_0246"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://ffas.burnham.org/AIDA/",
    "lastUpdate": "2020-09-02T12:24:48Z",
    "name": "AIDA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv092",
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Most proteins consist of multiple domains, independent structural and evolutionary units that are often reshuffled in genomic rearrangements to form new protein architectures. Template-based modeling methods can often detect homologous templates for individual domains, but templates that could be used to model the entire query protein are often not available. Results: We have developed a fast docking algorithm ab initio domain assembly (AIDA) for assembling multi-domain protein structures, guided by the ab initio folding potential. This approach can be extended to discontinuous domains (i.e. domains with 'inserted' domains). When tested on experimentally solved structures of multi-domain proteins, the relative domain positions were accurately found among top 5000 models in 86% of cases. AIDA server can use domain assignments provided by the user or predict them from the provided sequence. The latter approach is particularly useful for automated protein structure prediction servers. The blind test consisting of 95 CASP10 targets shows that domain boundaries could be successfully determined for 97% of targets. Availability and implementation: The AIDA package as well as the benchmark sets used here are available for download at http://ffas.burnham.org/AIDA/.",
                "authors": [
                    {
                        "name": "Godzik A."
                    },
                    {
                        "name": "Jaroszewski L."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Xu D."
                    }
                ],
                "citationCount": 29,
                "date": "2015-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AIDA: Ab initio domain assembly for automated multi-domain protein structure prediction and domain-domain interaction prediction"
            },
            "pmcid": "PMC4481839",
            "pmid": "25701568"
        },
        {
            "doi": "10.1093/nar/gku369",
            "metadata": {
                "abstract": "AIDA: ab initio domain assembly server, available at http://ffas.burnham. org/AIDA/ is a tool that can identify domains in multi-domain proteins and then predict their 3D structures and relative spatial arrangements. The server is free and open to all users, and there is an option for a user to provide an e-mail to get the link to result page. Domains are evolutionary conserved and often functionally independent units in proteins. Most proteins, especially eukaryotic ones, consist of multiple domains while at the same time, most experimentally determined protein structures contain only one or two domains. As a result, often structures of individual domains in multi-domain proteins can be accurately predicted, but the mutual arrangement of different domains remains unknown. To address this issue we have developed AIDA program, which combines steps of identifying individual domains, predicting (separately) their structures and assembling them into multiple domain complexes using an ab initio folding potential to describe domain-domain interactions. AIDA server not only supports the assembly of a large number of continuous domains, but also allows the assembly of domains inserted into other domains. Users can also provide distance restraints to guide the AIDA energy minimization. © 2014 The Author(s).",
                "authors": [
                    {
                        "name": "Godzik A."
                    },
                    {
                        "name": "Jaroszewski L."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Xu D."
                    }
                ],
                "citationCount": 32,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AIDA: Ab initio domain assembly server"
            },
            "pmcid": "PMC4086082",
            "pmid": "24831546"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
