{
    "additionDate": "2017-03-25T12:40:48Z",
    "biotoolsCURIE": "biotools:bioportal",
    "biotoolsID": "bioportal",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioportal.bioontology.org/feedback?location=http%253A%252F%252Fbioportal.bioontology.org%252F"
        }
    ],
    "description": "BioPortal is a web accessible open repository of biomedical ontologies. Users may browse, search and visualize ontologies, as well as participate in the evaluation and evolution of ontology reviews by adding notes, corrections, reviews, etc. Data from other sources such as GEO, ClinicalTrials.gov and ArrayExpress may also be integrated with the ontologies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.bioontology.org/wiki/index.php/BioPortal_Help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "http://bioportal.bioontology.org",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "BioPortal",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Biomedical ontologies provide essential domain knowledge to drive data integration, information retrieval, data annotation, natural-language processing and decision support. BioPortal (http://bioportal.bioontology.org) is an open repository of biomedical ontologies that provides access via Web services and Web browsers to ontologies developed in OWL, RDF, OBO format and Protégé frames. BioPortal functionality includes the ability to browse, search and visualize ontologies. The Web interface also facilitates community-based participation in the evaluation and evolution of ontology content by providing features to add notes to ontology terms, mappings between terms and ontology reviews based on criteria such as usability, domain coverage, quality of content, and documentation and support. BioPortal also enables integrated search of biomedical data resources such as the Gene Expression Omnibus (GEO), ClinicalTrials.gov, and ArrayExpress, through the annotation and indexing of these resources with ontologies in BioPortal. Thus, BioPortal not only provides investigators, clinicians, and developers 'one-stop shopping' to programmatically access biomedical ontologies, but also provides support to integrate data from a variety of biomedical resources.",
                "authors": [
                    {
                        "name": "Chute C.G."
                    },
                    {
                        "name": "Dai B."
                    },
                    {
                        "name": "Dorf M."
                    },
                    {
                        "name": "Griffith N."
                    },
                    {
                        "name": "Jonquet C."
                    },
                    {
                        "name": "Musen M.A."
                    },
                    {
                        "name": "Noy N.F."
                    },
                    {
                        "name": "Rubin D.L."
                    },
                    {
                        "name": "Shah N.H."
                    },
                    {
                        "name": "Storey M.-A."
                    },
                    {
                        "name": "Whetzel P.L."
                    }
                ],
                "citationCount": 576,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioPortal: Ontologies and integrated data resources at the click of a mouse"
            },
            "pmid": "19483092"
        },
        {
            "metadata": {
                "abstract": "The National Center for Biomedical Ontology (NCBO) is one of the National Centers for Biomedical Computing funded under the NIH Roadmap Initiative. Contributing to the national computing infrastructure, NCBO has developed BioPortal, a web portal that provides access to a library of biomedical ontologies and terminologies (http://bioportal.bioontology.org) via the NCBO Web services. BioPortal enables community participation in the evaluation and evolution of ontology content by providing features to add mappings between terms, to add comments linked to specific ontology terms and to provide ontology reviews. The NCBO Web services (http://www.bioontology.org/wiki/index.php/NCBO- REST-services) enable this functionality and provide a uniform mechanism to access ontologies from a variety of knowledge representation formats, such as Web Ontology Language (OWL) and Open Biological and Biomedical Ontologies (OBO) format. The Web services provide multi-layered access to the ontology content, from getting all terms in an ontology to retrieving metadata about a term. Users can easily incorporate the NCBO Web services into software applications to generate semantically aware applications and to facilitate structured data collection. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Alexander P.R."
                    },
                    {
                        "name": "Musen M.A."
                    },
                    {
                        "name": "Noy N.F."
                    },
                    {
                        "name": "Nyulas C."
                    },
                    {
                        "name": "Shah N.H."
                    },
                    {
                        "name": "Tudorache T."
                    },
                    {
                        "name": "Whetzel P.L."
                    }
                ],
                "citationCount": 411,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioPortal: Enhanced functionality via new Web services from the National Center for Biomedical Ontology to access and use ontologies in software applications"
            },
            "pmid": "21672956"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}
