{
    "additionDate": "2021-01-18T10:00:20Z",
    "biotoolsCURIE": "biotools:glutantbase",
    "biotoolsID": "glutantbase",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "diegomariano@ufmg.br",
            "name": "Diego Mariano",
            "orcidid": "https://orcid.org/0000-0002-5899-2052",
            "typeEntity": "Person"
        },
        {
            "email": "raquelcm@dcc.ufmg.br",
            "name": "Raquel Cardoso de Melo-Minardi",
            "typeEntity": "Person"
        }
    ],
    "description": "A database for improving the rational design of glucose-tolerant β-glucosidases.\n\nA database of mutant β-glucosidases.\n\nGlutantbase is a database, webtool and method to evaluate mutations for β-glucosidases proteins used in industrial applications. Glutantbase shows information of multiplie alignment generated with clustal-omega, structure modeled by homology, catalytic pocket location, catalytic residues, secondary structure, and extrapoled mutations for +3500 GH1 β-glucosidases sequences extracted from UniProt.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.dcc.ufmg.br/glutantbase",
    "lastUpdate": "2021-01-23T10:18:29Z",
    "name": "Glutantbase",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12860-020-00293-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Β-glucosidases are key enzymes used in second-generation biofuel production. They act in the last step of the lignocellulose saccharification, converting cellobiose in glucose. However, most of the β-glucosidases are inhibited by high glucose concentrations, which turns it a limiting step for industrial production. Thus, β-glucosidases have been targeted by several studies aiming to understand the mechanism of glucose tolerance, pH and thermal resistance for constructing more efficient enzymes. In this paper, we present a database of β-glucosidase structures, called Glutantβase. Our database includes 3842 GH1 β-glucosidase sequences collected from UniProt. We modeled the sequences by comparison and predicted important features in the 3D-structure of each enzyme. Glutantβase provides information about catalytic and conserved amino acids, residues of the coevolution network, protein secondary structure, and residues located in the channel that guides to the active site. We also analyzed the impact of beneficial mutations reported in the literature, predicted in analogous positions, for similar enzymes. We suggested these mutations based on six previously described mutants that showed high catalytic activity, glucose tolerance, or thermostability (A404V, E96K, H184F, H228T, L441F, and V174C). Then, we used molecular docking to verify the impact of the suggested mutations in the affinity of protein and ligands (substrate and product). Our results suggest that only mutations based on the H228T mutant can reduce the affinity for glucose (product) and increase affinity for cellobiose (substrate), which indicates an increment in the resistance to product inhibition and agrees with computational and experimental results previously reported in the literature. More resistant β-glucosidases are essential to saccharification in industrial applications. However, thermostable and glucose-tolerant β-glucosidases are rare, and their glucose tolerance mechanisms appear to be related to multiple and complex factors. We gather here, a set of information, and made predictions aiming to provide a tool for supporting the rational design of more efficient β-glucosidases. We hope that Glutantβase can help improve second-generation biofuel production. Glutantβase is available at http://bioinfo.dcc.ufmg.br/glutantbase.",
                "authors": [
                    {
                        "name": "Mariano D."
                    },
                    {
                        "name": "Pantuza N."
                    },
                    {
                        "name": "Santos L.H."
                    },
                    {
                        "name": "Rocha R.E.O."
                    },
                    {
                        "name": "De Lima L.H.F."
                    },
                    {
                        "name": "Bleicher L."
                    },
                    {
                        "name": "De Melo-Minardi R.C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "BMC Molecular and Cell Biology",
                "title": "Glutantβase: A database for improving the rational design of glucose-tolerant β-glucosidases"
            },
            "pmcid": "PMC7329481",
            "pmid": "32611314"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1
}