{
    "additionDate": "2017-01-17T14:50:28Z",
    "biotoolsCURIE": "biotools:patternlab",
    "biotoolsID": "patternlab",
    "collectionID": [
        "ms-utils",
        "Proteomics"
    ],
    "credit": [
        {
            "email": "webmaster@ms-utils.org",
            "typeEntity": "Person",
            "typeRole": [
                "Documentor"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "description": "Suite of pattern recognition software for interpretation of quantiative proteomics data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.patternlabforproteomics.org/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://pcarvalho.com/patternlab/downloads/windows/patternlab/"
        },
        {
            "type": "Source code",
            "url": "http://pcarvalho.com/patternlab/downloads/windows/patternlab/"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "mzML",
                            "uri": "http://edamontology.org/format_3244"
                        },
                        {
                            "term": "Thermo RAW",
                            "uri": "http://edamontology.org/format_3712"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Chromatogram visualisation",
                    "uri": "http://edamontology.org/operation_3203"
                },
                {
                    "term": "Label-free quantification",
                    "uri": "http://edamontology.org/operation_3634"
                },
                {
                    "term": "Blind peptide database search",
                    "uri": "http://edamontology.org/operation_3647"
                },
                {
                    "term": "Mass spectrum visualisation",
                    "uri": "http://edamontology.org/operation_3694"
                },
                {
                    "term": "Labeled quantification",
                    "uri": "http://edamontology.org/operation_3635"
                }
            ]
        }
    ],
    "homepage": "http://pcarvalho.com/patternlab/",
    "language": [
        "C#"
    ],
    "lastUpdate": "2019-03-26T08:29:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://ms-utils.org"
        }
    ],
    "name": "PatternLab",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "msutils_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: A goal of proteomics is to distinguish between states of a biological system by identifying protein expression differences. Liu et al. demonstrated a method to perform semi-relative protein quantitation in shotgun proteomics data by correlating the number of tandem mass spectra obtained for each protein, or \"spectral count\", with its abundance in a mixture; however, two issues have remained open: how to normalize spectral counting data and how to efficiently pinpoint differences between profiles. Moreover, Chen et al. recently showed how to increase the number of identified proteins in shotgun proteomics by analyzing samples with different MS-compatible detergents while performing proteolytic digestion. The latter introduced new challenges as seen from the data analysis perspective, since replicate readings are not acquired. Results: To address the open issues above, we present a program termed PatternLab for proteomics. This program implements existing strategies and adds two new methods to pinpoint differences in protein profiles. The first method, ACFold, addresses experiments with less than three replicates from each state or having assays acquired by different protocols as described by Chen et al. ACFold uses a combined criterion based on expression fold changes, the AC test, and the false-discovery rate, and can supply a \"bird's-eye view\" of differentially expressed proteins. The other method addresses experimental designs having multiple readings from each state and is referred to as nSVM (natural support vector machine) because of its roots in evolutionary computing and in statistical learning theory. Our observations suggest that nSVM's niche comprises projects that select a minimum set of proteins for classification purposes; for example, the development of an early detection kit for a given pathology. We demonstrate the effectiveness of each method on experimental data and confront them with existing strategies. Conclusion: PatternLab offers an easy and unified access to a variety of feature selection and normalization strategies, each having its own niche. Additionally, graphing tools are available to aid in the analysis of high throughput experimental data. PatternLab is available at http://pcarvalho.com/patternlab. © 2008 Carvalho et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Carvalho P.C."
                    },
                    {
                        "name": "Fischer J.S.G."
                    },
                    {
                        "name": "Chen E.I."
                    },
                    {
                        "name": "Yates III J.R."
                    },
                    {
                        "name": "Barbosa V.C."
                    }
                ],
                "citationCount": 115,
                "date": "2008-07-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PatternLab for proteomics: A tool for differential shotgun proteomics"
            },
            "pmid": "18644148"
        }
    ],
    "toolType": [
        "Desktop application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}