{"collectionID": [], "accessibility": [], "topic": [{"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}, {"term": "Protein folds and structural domains", "uri": "http://edamontology.org/topic_0736"}, {"term": "Protein structure analysis", "uri": "http://edamontology.org/topic_2814"}, {"term": "Protein folds and structural domains", "uri": "http://edamontology.org/topic_0736"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "23812990", "type": null, "pmcid": null, "metadata": {"title": "ThreaDom: Extracting protein domain boundary information from multiple threading alignments", "abstract": "Motivation: Protein domains are subunits that can fold and evolve independently. Identification of domain boundary locations is often the first step in protein folding and function annotations. Most of the current methods deduce domain boundaries by sequence-based analysis, which has low accuracy. There is no efficient method for predicting discontinuous domains that consist of segments from separated sequence regions. As template-based methods are most efficient for protein 3D structure modeling, combining multiple threading alignment information should increase the accuracy and reliability of computational domain predictions.Result: We developed a new protein domain predictor, ThreaDom, which deduces domain boundary locations based on multiple threading alignments. The core of the method development is the derivation of a domain conservation score that combines information from template domain structures and terminal and internal alignment gaps. Tested on 630 non-redundant sequences, without using homologous templates, ThreaDom generates correct single- and multi-domain classifications in 81% of cases, where 78% have the domain linker assigned within ±20 residues. In a second test on 486 proteins with discontinuous domains, ThreaDom achieves an average precision 84% and recall 65% in domain boundary prediction. Finally, ThreaDom was examined on 56 targets from CASP8 and had a domain overlap rate 73, 87 and 85% with the target for Free Modeling, Hard multiple-domain and discontinuous domain proteins, respectively, which are significantly higher than most domain predictors in the CASP8. Similar results were achieved on the targets from the most recently CASP9 and CASP10 experiments. © The Author 2013.", "citationCount": 29, "authors": [{"name": "Xue Z."}, {"name": "Xu D."}, {"name": "Wang Y."}, {"name": "Zhang Y."}], "date": "2013-07-01T00:00:00Z", "journal": "Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": "https://zhanglab.ccmb.med.umich.edu/people/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:threadom", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://zhanglab.ccmb.med.umich.edu/ThreaDom/", "function": [{"note": null, "input": [], "operation": [{"term": "Protein fold recognition", "uri": "http://edamontology.org/operation_0303"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:45Z", "otherID": [], "description": "A template-based algorithm for protein domain boundary prediction. Given a protein sequence, ThreaDom first threads the target through the PDB library to identify protein template that have similar structure fold. A domain conservation score (DCS) will be calculated for each residue which combines information from template domain structure, terminal and internal gaps and insertions. Finally, the domain boundary information is derived from the DCS profile distributions.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/threadom-predicting-protein-domain-boundary-by-multiple-threading-alignment.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "threadom", "additionDate": "2017-08-03T19:03:16Z", "name": "ThreaDom", "license": null, "documentation": [{"url": "https://zhanglab.ccmb.med.umich.edu/ThreaDom/", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}