{
    "additionDate": "2017-01-17T15:04:25Z",
    "biotoolsCURIE": "biotools:aroma.light",
    "biotoolsID": "aroma.light",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "henrikb@braju.com",
            "name": "Henrik Bengtsson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "johan.vallon-christersson@med.lu.se",
            "name": "Johan Vallon-Christersson",
            "orcidid": "http://orcid.org/0000-0002-2195-0385",
            "typeEntity": "Person"
        }
    ],
    "description": "Methods for microarray analysis that take basic data types such as matrices and lists of vectors. These methods can be used standalone, be utilized in other packages, or be wrapped up in higher-level classes.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/aroma.light.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/aroma.light_3.4.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/aroma.light.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-16T13:51:02Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/HenrikBengtsson/aroma.light"
        },
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.aroma-project.org"
        }
    ],
    "name": "aroma.light",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-5-177",
            "metadata": {
                "abstract": "Background: Non-linearities in observed log-ratios of gene expressions, also known as intensity dependent log-ratios, can often be accounted for by global biases in the two channels being compared. Any step in a microarray process may introduce such offsets and in this article we study the biases introduced by the microarray scanner and the image analysis software. Results: By scanning the same spotted oligonucleotide microarray at different photomultiplier tube (PMT) gains, we have identified a channel-specific bias present in two-channel microarray data. For the scanners analyzed it was in the range of 15-25 (out of 65,535). The observed bias was very stable between subsequent scans of the same array although the PMT gain was greatly adjusted. This indicates that the bias does not originate from a step preceding the scanner detector parts. The bias varies slightly between arrays. When comparing estimates based on data from the same array, but from different scanners, we have found that different scanners introduce different amounts of bias. So do various image analysis methods. We propose a scanning protocol and a constrained affine model that allows us to identify and estimate the bias in each channel. Backward transformation removes the bias and brings the channels to the same scale. The result is that systematic effects such as intensity dependent log-ratios are removed, but also that signal densities become much more similar. The average scan, which has a larger dynamical range and greater signal-to-noise ratio than individual scans, can then be obtained. Conclusions: The study shows that microarray scanners may introduce a significant bias in each channel. Such biases have to be calibrated for, otherwise systematic effects such as intensity dependent log-ratios will be observed. The proposed scanning protocol and calibration method is simple to use and is useful for evaluating scanner biases or for obtaining calibrated measurements with extended dynamical range and better precision. The cross-platform R package aroma, which implements all described methods, is available for free from http://www.maths.lth.se/bioinformatics/. © 2004 Bengtsson et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bengtsson H."
                    },
                    {
                        "name": "Jonsson G."
                    },
                    {
                        "name": "Vallon-Christersson J."
                    }
                ],
                "citationCount": 37,
                "date": "2004-11-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Calibration and assessment of channel-specific biases in microarray data with extended dynamical range"
            },
            "pmcid": "PMC539274",
            "pmid": "15541170",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "3.4.0"
    ]
}