{
    "additionDate": "2019-11-14T19:39:34Z",
    "biotoolsCURIE": "biotools:ThermoNet",
    "biotoolsID": "ThermoNet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jianpeng@illinois.edu",
            "name": "Jian Peng",
            "orcidid": "https://orcid.org/0000-0002-1736-2978",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrating thermodynamic and sequence contexts improves protein-RNA binding prediction | This is a TensorFlow implementation accompanying our paper. This codebase is based on Shreshthgandhi's Tensorflow implementation of the cdeepbind model. The framework of model training and testing have beed adopted with minor changes. Other code files have been modified and re-structured with changes specific to our model. And the folder, scripts/RNAsubopt is a copy of RNAsubopt from the ViennaRNA project | We used two datasets to evaluate our model. The following datsets were used for training our models | You can download the datasets from the corresponding website. After that, you should prepare the data used in the training code according to the steps below. We use the CLIP-seq dataset as an example | BTW, The ThermoNet implementation is available at invitro bin deepbind_model utils_update.py",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/suyufeng/ThermoNet/tree/master/supplementary"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                },
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                }
            ]
        }
    ],
    "homepage": "https://github.com/suyufeng/ThermoNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T12:22:49Z",
    "name": "ThermoNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007283",
            "metadata": {
                "abstract": "© 2019 Su et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Predicting RNA-binding protein (RBP) specificity is important for understanding gene expression regulation and RNA-mediated enzymatic processes. It is widely believed that RBP binding specificity is determined by both the sequence and structural contexts of RNAs. Existing approaches, including traditional machine learning algorithms and more recently, deep learning models, have been extensively applied to integrate RNA sequence and its predicted or experimental RNA structural probabilities for improving the accuracy of RBP binding prediction. Such models were trained mostly on the large-scale in vitro datasets, such as the RNAcompete dataset. However, in RNAcompete, most synthetic RNAs are unstructured, which makes machine learning methods not effectively extract RBP-binding structural preferences. Furthermore, RNA structure may be variable or multi-modal according to both theoretical and experimental evidence. In this work, we propose Thermo- Net, a thermodynamic prediction model by integrating a new sequence-embedding convolutional neural network model over a thermodynamic ensemble of RNA secondary structures. First, the sequence-embedding convolutional neural network generalizes the existing k-mer based methods by jointly learning convolutional filters and k-mer embeddings to represent RNA sequence contexts. Second, the thermodynamic average of deep-learning predictions is able to explore structural variability and improves the prediction, especially for the structured RNAs. Extensive experiments demonstrate that our method significantly outperforms existing approaches, including RCK, DeepBind and several other recent state-of-the-art methods for predictions on both in vitro and in vivo data. The implementation of ThermoNet is available at https://github.com/suyufeng/ThermoNet.",
                "authors": [
                    {
                        "name": "Su Y."
                    },
                    {
                        "name": "Luo Y."
                    },
                    {
                        "name": "Zhao X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Peng J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Integrating thermodynamic and sequence contexts improves protein-RNA binding prediction"
            },
            "pmcid": "PMC6752863",
            "pmid": "31483777"
        }
    ],
    "topic": [
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}