{
    "additionDate": "2017-08-20T15:59:04Z",
    "biotoolsCURIE": "biotools:snpsift",
    "biotoolsID": "snpsift",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "pcingola@users.sourceforge.net",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Toolbox that allows you to filter and manipulate annotated vcf files.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://snpeff.sourceforge.net/SnpSift.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "homepage": "http://snpeff.sourceforge.net/SnpSift.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-05-16T15:40:58Z",
    "license": "LGPL-3.0",
    "name": "SnpSift",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_015624"
        }
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.3389/fgene.2012.00035",
            "metadata": {
                "abstract": "This paper describes a new program SnpSift for filtering differential DNA sequence variants between two or more experimental genomes after genotoxic chemical exposure. Here, we illustrate how SnpSift can be used to identify candidate phenotype-relevant variants including single nucleotide polymorphisms, multiple nucleotide polymorphisms, insertions, and deletions (InDels) in mutant strains isolated from genome-wide chemical mutagenesis of Drosophila melanogaster. First, the genomes of two independently isolated mutant fly strains that are allelic for a novel recessive male-sterile locus generated by genotoxic chemical exposure were sequenced using the Illumina next-generation DNA sequencer to obtain 20- to 29-fold coverage of the euchromatic sequences. The sequencing reads were processed and variants were called using standard bioinformatic tools. Next, SnpEff was used to annotate all sequence variants and their potential mutational effects on associated genes. Then, SnpSift was used to filter and select differential variants that potentially disrupt a common gene in the two allelic mutant strains. The potential causative DNA lesions were partially validated by capillary sequencing of polymerase chain reaction-amplified DNA in the genetic interval as defined by meiotic mapping and deletions that remove defined regions of the chromosome. Of the five candidate genes located in the genetic interval, the Pka-like gene CG12069 was found to carry a separate pre-mature stop codon mutation in each of the two allelic mutants whereas the other four candidate genes within the interval have wild-type sequences. The Pka-like gene is therefore a strong candidate gene for the male-sterile locus. These results demonstrate that combining SnpEff and SnpSift can expedite the identification of candidate phenotype-causative mutations in chemically mutagenized Drosophila strains. This technique can also be used to characterize the variety of mutations generated by genotoxic chemicals. © 2012 Cingolani, Patel, Coon, Nguyen, Land, Ruden and Lu.",
                "authors": [
                    {
                        "name": "Cingolani P."
                    },
                    {
                        "name": "Coon M."
                    },
                    {
                        "name": "Land S.J."
                    },
                    {
                        "name": "Lu X."
                    },
                    {
                        "name": "Nguyen T."
                    },
                    {
                        "name": "Patel V.M."
                    },
                    {
                        "name": "Ruden D.M."
                    }
                ],
                "citationCount": 360,
                "date": "2012-12-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Using Drosophila melanogaster as a model for genotoxic chemical mutational studies with a new program, SnpSift"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data architecture, analysis and design",
            "uri": "http://edamontology.org/topic_3365"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1
}
