{
    "name": "Plasmodium Autocount", 
    "description": "Automatically identify red blood cells and red blood cells infected with Plasmodium in a set of images. The software identifies cells using a circlular Hough transform, then looks for stained spots within cells as evidence of infection. Identified cells that are misshapen (debris on the slide) or have too much stain (white blood cells) are discarded.", 
    "homepage": "http://www.vicbioinformatics.com/software.autocount.shtml", 
    "biotoolsID": "plasmodium_autocount", 
    "biotoolsCURIE": "biotools:plasmodium_autocount", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3443", 
                    "term": "Image analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2815", 
            "term": "Human biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3324", 
            "term": "Infectious disease"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/plasmodium-autocount-0-1-count-red-blood-cells-infected-plasmodium.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.vicbioinformatics.com/software.autocount.shtml", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21122144", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Automated estimation of parasitaemia of Plasmodium yoelii-infected mice by digital image analysis of Giemsa-stained thin blood smears", 
                "abstract": "Background: Parasitaemia, the percentage of infected erythrocytes, is used to measure progress of experimental Plasmodium infection in infected hosts. The most widely used technique for parasitaemia determination is manual microscopic enumeration of Giemsa-stained blood films. This process is onerous, time consuming and relies on the expertise of the experimenter giving rise to person-to-person variability. Here the development of image-analysis software, named Plasmodium AutoCount, which can automatically generate parasitaemia values from Plasmodium-infected blood smears, is reported. Methods. Giemsa-stained blood smear images were captured with a camera attached to a microscope and analysed using a programme written in the Python programming language. The programme design involved foreground detection, cell and infection detection, and spurious hit filtering. A number of parameters were adjusted by a calibration process using a set of representative images. Another programme, Counting Aid, written in Visual Basic, was developed to aid manual counting when the quality of blood smear preparation is too poor for use with the automated programme. Results. This programme has been validated for use in estimation of parasitemia in mouse infection by Plasmodium yoelii and used to monitor parasitaemia on a daily basis for an entire challenge infection. The parasitaemia values determined by Plasmodium AutoCount were shown to be highly correlated with the results obtained by manual counting, and the discrepancy between automated and manual counting results were comparable to those found among manual counts of different experimenters. Conclusions. Plasmodium AutoCount has proven to be a useful tool for rapid and accurate determination of parasitaemia from infected mouse blood. For greater accuracy when smear quality is poor, Plasmodium AutoCount, can be used in conjunction with Counting Aid. © 2010 Ma et al; licensee BioMed Central Ltd.", 
                "date": "2010-12-03T00:00:00Z", 
                "citationCount": 27, 
                "authors": [
                    {
                        "name": "Ma C."
                    }, 
                    {
                        "name": "Harrison P."
                    }, 
                    {
                        "name": "Wang L."
                    }, 
                    {
                        "name": "Coppel R.L."
                    }
                ], 
                "journal": "Malaria Journal"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "charles.ma@monash.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }, 
        {
            "name": null, 
            "email": "paul.harrison@monash.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:55:56Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}