{
    "accessibility": "Open access",
    "additionDate": "2017-03-25T12:40:35Z",
    "biotoolsCURIE": "biotools:fpocket",
    "biotoolsID": "fpocket",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pierre.tuffery@univ-paris-diderot.fr",
            "name": "Pierre Tufféry",
            "orcidid": "https://orcid.org/0000-0003-1033-9895",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web server which detects small molecule pockets by relying on the geometric alpha sphere theory. It also tracks pockets during molecular dynamics so to provide insight on pocket dynamics (mdpocket) and transposes mdpocket to the combined analysis of homologous structures (hpocket).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bioserv.rpbs.univ-paris-diderot.fr/services/fpocket/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Molecular surface analysis",
                    "uri": "http://edamontology.org/operation_3351"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structural motif",
                        "uri": "http://edamontology.org/data_2878"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://mobyle.rpbs.univ-paris-diderot.fr/cgi-bin/portal.py#forms::fpocket",
    "lastUpdate": "2024-11-24T20:59:53.208420Z",
    "license": "Freeware",
    "maturity": "Mature",
    "name": "Fpocket",
    "owner": "reyjul",
    "publication": [
        {
            "doi": "10.1093/nar/gkq383",
            "metadata": {
                "abstract": "Computational small-molecule binding site detection has several important applications in the biomedical field. Notable interests are the identification of cavities for structure-based drug discovery or functional annotation of structures. fpocket is a small-molecule pocket detection program, relying on the geometric α-sphere theory. The fpocket web server allows: (i) candidate pocket detection-fpocket; (ii) pocket tracking during molecular dynamics, in order to provide insights into pocket dynamics-mdpocket; and (iii) a transposition of mdpocket to the combined analysis of homologous structures-hpocket. These complementary online tools allow to tackle various questions related to the identification and annotation of functional and allosteric sites, transient pockets and pocket preservation within evolution of structural families. The server and documentation are freely available at http://bioserv.rpbs.univ-paris-diderot.fr/fpocket. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Le Guilloux V."
                    },
                    {
                        "name": "Maupetit J."
                    },
                    {
                        "name": "Schmidtke P."
                    },
                    {
                        "name": "Tuffery P."
                    }
                ],
                "citationCount": 219,
                "date": "2010-05-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "fpocket: Online tools for protein ensemble pocket detection and tracking"
            },
            "pmcid": "PMC2896101",
            "pmid": "20478829"
        },
        {
            "doi": "10.1186/1471-2105-10-168",
            "metadata": {
                "abstract": "Background: Virtual screening methods start to be well established as effective approaches to identify hits, candidates and leads for drug discovery research. Among those, structure based virtual screening (SBVS) approaches aim at docking collections of small compounds in the target structure to identify potent compounds. For SBVS, the identification of candidate pockets in protein structures is a key feature, and the recent years have seen increasing interest in developing methods for pocket and cavity detection on protein surfaces. Results: Fpocket is an open source pocket detection package based on Voronoi tessellation and alpha spheres built on top of the publicly available package Qhull. The modular source code is organised around a central library of functions, a basis for three main programs: (i) Fpocket, to perform pocket identification, (ii) Tpocket, to organise pocket detection benchmarking on a set of known protein-ligand complexes, and (iii) Dpocket, to collect pocket descriptor values on a set of proteins. Fpocket is written in the C programming language, which makes it a platform well suited for the scientific community willing to develop new scoring functions and extract various pocket descriptors on a large scale level. Fpocket 1.0, relying on a simple scoring function, is able to detect 94% and 92% of the pockets within the best three ranked pockets from the holo and apo proteins respectively, outperforming the standards of the field, while being faster. Conclusion: Fpocket provides a rapid, open source and stable basis for further developments related to protein pocket detection, efficient pocket descriptor extraction, or drugablity prediction purposes. Fpocket is freely available under the GNU GPL license at http://fpocket.sourceforge.net. © 2009 Le Guilloux et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Le Guilloux V."
                    },
                    {
                        "name": "Schmidtke P."
                    },
                    {
                        "name": "Tuffery P."
                    }
                ],
                "citationCount": 999,
                "date": "2009-05-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Fpocket: An open source platform for ligand pocket detection"
            },
            "pmcid": "PMC2700099",
            "pmid": "19486540",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
