{
    "additionDate": "2020-01-14T19:37:53Z",
    "biotoolsCURIE": "biotools:LEMON",
    "biotoolsID": "LEMON",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "shuaicli@cityu.edu.hk",
            "name": "Shuaicheng Li",
            "typeEntity": "Person"
        }
    ],
    "description": "a method to construct the local strains at horizontal gene transfer sites in gut metagenomics.\n\nIt is a software to reconstruct the HGT inserted local strain.\n\nIt is a software takes use of existing shotgun NGS datasets to detect HGT breakpoints, identify the transferred genome segments, and reconstructs the inserted local strain.\n\nusage: python LEMON/Scripts/get_raw_bkp.py [options].\n\ngit clone --recursive https://github.com/lichen2018/hgt-detection.git",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lichen2018/LEMON",
    "language": [
        "C++",
        "Python",
        "C"
    ],
    "lastUpdate": "2020-01-14T19:37:53Z",
    "name": "LEMON",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3301-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Horizontal Gene Transfer (HGT) refers to the transfer of genetic materials between organisms through mechanisms other than parent-offspring inheritance. HGTs may affect human health through a large number of microorganisms, especially the gut microbiomes which the human body harbors. The transferred segments may lead to complicated local genome structural variations. Details of the local genome structure can elucidate the effects of the HGTs. Results: In this work, we propose a graph-based method to reconstruct the local strains from the gut metagenomics data at the HGT sites. The method is implemented in a package named LEMON. The simulated results indicate that the method can identify transferred segments accurately on reference sequences of the microbiome. Simulation results illustrate that LEMON could recover local strains with complicated structure variation. Furthermore, the gene fusion points detected in real data near HGT breakpoints validate the accuracy of LEMON. Some strains reconstructed by LEMON have a replication time profile with lower standard error, which demonstrates HGT events recovered by LEMON is reliable. Conclusions: Through LEMON we could reconstruct the sequence structure of bacteria, which harbors HGT events. This helps us to study gene flow among different microbial species.",
                "authors": [
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Li S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "LEMON: A method to construct the local strains at horizontal gene transfer sites in gut metagenomics"
            },
            "pmcid": "PMC6933643",
            "pmid": "31881904"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ]
}