{
    "additionDate": "2021-01-18T10:35:46Z",
    "biotoolsCURIE": "biotools:s-lwsr",
    "biotoolsID": "s-lwsr",
    "confidence_flag": "tool",
    "description": "Super Lightweight Super-Resolution Network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Sudo-Biao/s-LWSR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-10T13:51:48Z",
    "license": "MIT",
    "name": "s-LWSR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TIP.2020.3014953",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.In recent years, deep models have achieved great success in the field of single-image super-resolution (SISR) by incorporating a large number of parameters to obtain satisfactory performance. However, this achievement typically gives rise to high computational complexity, which greatly restricts deep SISR applications in deployment on mobile devices with limited computation and storage resources. To address this problem, in this article, we propose a flexibly adjustable super-lightweight SISR pipeline: s-LWSR. First, to efficiently abstract features from low-resolution images, we design a highly efficient U-shaped backbone, along with an information pool, which is constructed to mix multilevel information from the first half of our pipeline. Second, a compression mechanism based on depthwise-separable convolution is employed to further reduce the number of parameters with a negligible degradation in performance. Third, by revealing the specific role of activation in many deep models, we remove several activation layers in our super-resolution (SR) model to retain useful information, leading to a further improvement in the final performance. Extensive experiments demonstrate that our s-LWSR, with limited parameters and operations, can achieve a similar performance to that of other cumbersome but state-of-the-art (SOTA) deep SR methods.",
                "authors": [
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Wang B."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Qi Z."
                    },
                    {
                        "name": "Shi Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "S-LWSR: Super Lightweight Super-Resolution Network"
            },
            "pmid": "32790629"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}