{
    "additionDate": "2017-08-03T19:03:01Z",
    "biotoolsCURIE": "biotools:twigs",
    "biotoolsID": "twigs",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.tau.ac.il/~davidama/"
        }
    ],
    "description": "Tool for advanced analysis of three-way data (e.g., patient-gene-time in gene expression or subject-voxel-time in fMRI). It identifies both core modules that appear in multiple patients and patient-specific augmentations of these core modules that contain additional genes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://acgt.cs.tau.ac.il/twigs/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://acgt.cs.tau.ac.il/twigs/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/twigs-three-way-module-inference-via-gibbs-sampling.html"
        }
    ],
    "name": "TWIGS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Motivation: Detecting modules of co-ordinated activity is fundamental in the analysis of large biological studies. For two-dimensional data (e.g. genes × patients), this is often done via clustering or biclustering. More recently, studies monitoring patients over time have added another dimension. Analysis is much more challenging in this case, especially when time measurements are not synchronized. New methods that can analyze three-way data are thus needed. Results: We present a new algorithm for finding coherent and flexible modules in three-way data. Our method can identify both core modules that appear in multiple patients and patient-specific augmentations of these core modules that contain additional genes. Our algorithm is based on a hierarchical Bayesian data model and Gibbs sampling. The algorithm outperforms extant methods on simulated and on real data. The method successfully dissected key components of septic shock response from time series measurements of gene expression. Detected patient-specific module augmentations were informative for disease outcome. In analyzing brain functional magnetic resonance imaging time series of subjects at rest, it detected the pertinent brain regions involved.",
                "authors": [
                    {
                        "name": "Amar D."
                    },
                    {
                        "name": "Hendler T."
                    },
                    {
                        "name": "Maron-Katz A."
                    },
                    {
                        "name": "Shamir R."
                    },
                    {
                        "name": "Yekutieli D."
                    }
                ],
                "citationCount": 8,
                "date": "2015-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A hierarchical Bayesian model for flexible module discovery in three-way time-series data"
            },
            "pmid": "26072479"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
