{
    "additionDate": "2019-11-14T18:40:25Z",
    "biotoolsCURIE": "biotools:SOPP",
    "biotoolsID": "SOPP",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Academy Nutrition', 'RDNs CNM', 'RDNs', 'CNM' | Revised 2019 Standards of Professional Performance for Registered Dietitian Nutritionists (Competent, Proficient, and Expert) in Clinical Nutrition Management | The Standards of Practice (SOP) and Standards of Professional Performance (SOPP) can be used by credentialed nutrition and dietetics practitioners to assess their individual performance needs",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://eatrightpro.org/SOP",
    "lastUpdate": "2019-11-14T18:40:25Z",
    "link": [
        {
            "type": "Other",
            "url": "http://www.eatrightpro.org/sop"
        }
    ],
    "name": "SOPP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JAND.2019.05.013",
            "metadata": {
                "abstract": "© 2019 Academy of Nutrition and DieteticsClinical nutrition management (CNM) encompasses the varied roles of registered dietitian nutritionists (RDNs) with administrative responsibilities for clinical nutrition services within an organization. Although RDNs in CNM are typically employed in acute care, they are also employed in settings where management of nutrition services is required, such as foodservice departments, ambulatory clinics, telehealth services, public health organizations, post-acute and long-term care, rehabilitation, and correctional facilities, or specialty departments, for example, dialysis units or cancer centers. RDNs in CNM aim to create work environments that support high-quality customer-centered care, attract and retain talented staff, and foster an atmosphere of collaboration and innovation. The CNM Dietetic Practice Group, with guidance from the Academy of Nutrition and Dietetics Quality Management Committee, has revised the Standards of Professional Performance (SOPP) for RDNs in CNM for three levels of practice: competent, proficient, and expert. The SOPP describes six domains that focus on professional performance: Quality in Practice, Competence and Accountability, Provision of Services, Application of Research, Communication and Application of Knowledge, and Utilization and Management of Resources. Indicators outlined in the SOPP depict how these standards apply to practice. The standards and indicators for RDNs in CNM are written with the leader in mind—to support an individual in a leadership role or who has leadership aspirations. The SOPP is intended to be used by RDNs for self-evaluation to assure competent practice and for determining potential education and training needs for advancement to a higher practice level in a variety of settings.",
                "authors": [
                    {
                        "name": "Doley J."
                    },
                    {
                        "name": "Clark K."
                    },
                    {
                        "name": "Roper S."
                    }
                ],
                "date": "2019-09-01T00:00:00Z",
                "journal": "Journal of the Academy of Nutrition and Dietetics",
                "title": "Academy of Nutrition and Dietetics: Revised 2019 Standards of Professional Performance for Registered Dietitian Nutritionists (Competent, Proficient, and Expert) in Clinical Nutrition Management"
            },
            "pmid": "31446936"
        }
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}