{
    "additionDate": "2021-01-18T06:58:40Z",
    "biotoolsCURIE": "biotools:quanttb",
    "biotoolsID": "quanttb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "t.abeel@tudelft.nl",
            "name": "Thomas Abeel",
            "orcidid": "https://orcid.org/0000-0002-7205-7431",
            "typeEntity": "Person"
        }
    ],
    "description": "a method to classify mixed Mycobacterium tuberculosis infections within whole genome sequencing data.\n\nQuantTB is a SNP based method to identify and quantify individual strains present in Tuberculosis whole genome sequencing datasets.\n\nThese instructions will guide you through the process of using QuantTB, so that you can deploy it on your own local system. Tested to work for Mac OSX and Ubuntu.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AbeelLab/quanttb/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-31T14:00:24Z",
    "license": "GPL-3.0",
    "name": "QuantTB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6486-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Mixed infections of Mycobacterium tuberculosis and antibiotic heteroresistance continue to complicate tuberculosis (TB) diagnosis and treatment. Detection of mixed infections has been limited to molecular genotyping techniques, which lack the sensitivity and resolution to accurately estimate the multiplicity of TB infections. In contrast, whole genome sequencing offers sensitive views of the genetic differences between strains of M. tuberculosis within a sample. Although metagenomic tools exist to classify strains in a metagenomic sample, most tools have been developed for more divergent species, and therefore cannot provide the sensitivity required to disentangle strains within closely related bacterial species such as M. tuberculosis. Here we present QuantTB, a method to identify and quantify individual M. tuberculosis strains in whole genome sequencing data. QuantTB uses SNP markers to determine the combination of strains that best explain the allelic variation observed in a sample. QuantTB outputs a list of identified strains, their corresponding relative abundances, and a list of drugs for which resistance-conferring mutations (or heteroresistance) have been predicted within the sample. Results: We show that QuantTB has a high degree of resolution and is capable of differentiating communities differing by less than 25 SNPs and identifying strains down to 1× coverage. Using simulated data, we found QuantTB outperformed other metagenomic strain identification tools at detecting strains and quantifying strain multiplicity. In a real-world scenario, using a dataset of 50 paired clinical isolates from a study of patients with either reinfections or relapses, we found that QuantTB could detect mixed infections and reinfections at rates concordant with a manually curated approach. Conclusion: QuantTB can determine infection multiplicity, identify hetero-resistance patterns, enable differentiation between relapse and re-infection, and clarify transmission events across seemingly unrelated patients-even in low-coverage (1×) samples. QuantTB outperforms existing tools and promises to serve as a valuable resource for both clinicians and researchers working with clinical TB samples.",
                "authors": [
                    {
                        "name": "Anyansi C."
                    },
                    {
                        "name": "Keo A."
                    },
                    {
                        "name": "Walker B.J."
                    },
                    {
                        "name": "Straub T.J."
                    },
                    {
                        "name": "Manson A.L."
                    },
                    {
                        "name": "Earl A.M."
                    },
                    {
                        "name": "Abeel T."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-28T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "QuantTB- A method to classify mixed Mycobacterium tuberculosis infections within whole genome sequencing data"
            },
            "pmcid": "PMC6986090",
            "pmid": "31992201"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ]
}