{
    "additionDate": "2018-07-29T15:54:28Z",
    "biotoolsCURIE": "biotools:fastgenogam",
    "biotoolsID": "fastgenogam",
    "credit": [
        {
            "email": "gagneur@in.tum.de",
            "name": "Julien Gagneur",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A scalable and efficient implementation that is 2 to 3 orders of magnitude faster than the previous version. This is achieved by exploiting the sparsity of the model using the SuperLU direct solver for parameter fitting, and sparse Cholesky factorization together with the sparse inverse subset algorithm for computing standard errors.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/gstricker/fastGenoGAM/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gstricker/fastGenoGAM",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-2.0",
    "name": "fastGenoGAM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2238-7",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: GenoGAM (Genome-wide generalized additive models) is a powerful statistical modeling tool for the analysis of ChIP-Seq data with flexible factorial design experiments. However large runtime and memory requirements of its current implementation prohibit its application to gigabase-scale genomes such as mammalian genomes. Results: Here we present GenoGAM 2.0, a scalable and efficient implementation that is 2 to 3 orders of magnitude faster than the previous version. This is achieved by exploiting the sparsity of the model using the SuperLU direct solver for parameter fitting, and sparse Cholesky factorization together with the sparse inverse subset algorithm for computing standard errors. Furthermore the HDF5 library is employed to store data efficiently on hard drive, reducing memory footprint while keeping I/O low. Whole-genome fits for human ChIP-seq datasets (ca. 300 million parameters) could be obtained in less than 9 hours on a standard 60-core server. GenoGAM 2.0 is implemented as an open source R package and currently available on GitHub. A Bioconductor release of the new version is in preparation. Conclusions: We have vastly improved the performance of the GenoGAM framework, opening up its application to all types of organisms. Moreover, our algorithmic improvements for fitting large GAMs could be of interest to the statistical community beyond the genomics field.",
                "authors": [
                    {
                        "name": "Stricker G."
                    },
                    {
                        "name": "Galinier M."
                    },
                    {
                        "name": "Gagneur J."
                    }
                ],
                "date": "2018-06-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GenoGAM 2.0: Scalable and efficient implementation of genome-wide generalized additive models for gigabase-scale genomes"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btx150",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation: Chromatin immunoprecipitation followed by deep sequencing (ChIP-Seq) is a widely used approach to study protein-DNA interactions. Often, the quantities of interest are the differential occupancies relative to controls, between genetic backgrounds, treatments, or combinations thereof. Current methods for differential occupancy of ChIP-Seq data rely however on binning or sliding window techniques, for which the choice of the window and bin sizes are subjective. Results: Here, we present GenoGAM (Genome-wide Generalized Additive Model), which brings the well-established and flexible generalized additive models framework to genomic applications using a data parallelism strategy. We model ChIP-Seq read count frequencies as products of smooth functions along chromosomes. Smoothing parameters are objectively estimated from the data by crossvalidation, eliminating ad hoc binning and windowing needed by current approaches. GenoGAM provides base-level and region-level significance testing for full factorial designs. Application to a ChIP-Seq dataset in yeast showed increased sensitivity over existing differential occupancy methods while controlling for type I error rate. By analyzing a set of DNA methylation data and illustrating an extension to a peak caller, we further demonstrate the potential of GenoGAM as a generic statistical modeling tool for genome-wide assays.",
                "authors": [
                    {
                        "name": "Stricker G."
                    },
                    {
                        "name": "Engelhardt A."
                    },
                    {
                        "name": "Schulz D."
                    },
                    {
                        "name": "Schmid M."
                    },
                    {
                        "name": "Tresch A."
                    },
                    {
                        "name": "Gagneur J."
                    }
                ],
                "citationCount": 5,
                "date": "2017-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GenoGAM: Genome-wide generalized additive models for ChIP-Seq analysis"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Transcription factors",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}