{
    "name": "SEAR: Search Engine for Antimicrobial Resistance", 
    "description": "Construct full-length, horizontally acquired Antibiotic Resistance Genes (ARGs) from sequencing datasets. It has been designed with environmental metagenomics and microbiome experiments in mind, where the diversity and relative abundance of ARGs need to be determined both quickly and easily.", 
    "homepage": "http://www.github.com/wpmr2/SEAR", 
    "biotoolsID": "sear", 
    "biotoolsCURIE": "biotools:sear", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3482", 
                    "term": "Antimicrobial resistance prediction"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2975", 
                        "term": "Nucleic acid sequence (raw)"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_1930", 
                            "term": "FASTQ"
                        }
                    ]
                }
            ], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Web application", 
        "Database portal"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3174", 
            "term": "Metagenomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }, 
        {
            "uri": "http://edamontology.org/topic_3301", 
            "term": "Microbiology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/will-rowe/SEAR", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0133492", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Search engine for antimicrobial resistance: A cloud compatible pipeline and web interface for rapidly detecting antimicrobial resistance genes directly from sequence data", 
                "abstract": "© 2015 Rowe et al.Background Antimicrobial resistance remains a growing and significant concern in human and veterinary medicine. Current laboratory methods for the detection and surveillance of antimicrobial resistant bacteria are limited in their effectiveness and scope. With the rapidly developing field of whole genome sequencing beginning to be utilised in clinical practice, the ability to interrogate sequencing data quickly and easily for the presence of antimicrobial resistance genes will become increasingly important and useful for informing clinical decisions. Additionally, use of such tools will provide insight into the dynamics of antimicrobial resistance genes in metagenomic samples such as those used in environmental monitoring. Results Here we present the Search Engine for Antimicrobial Resistance (SEAR), a pipeline and web interface for detection of horizontally acquired antimicrobial resistance genes in raw sequencing data. The pipeline provides gene information, abundance estimation and the reconstructed sequence of antimicrobial resistance genes; it also provides web links to additional information on each gene. The pipeline utilises clustering and read mapping to annotate full-length genes relative to a user-defined database. It also uses local alignment of annotated genes to a range of online databases to provide additional information. We demonstrate SEAR's application in the detection and abundance estimation of antimicrobial resistance genes in two novel environmental metagenomes, 32 human faecal microbiome datasets and 126 clinical isolates of Shigella sonnei. Conclusions We have developed a pipeline that contributes to the improved capacity for antimicrobial resistance detection afforded by next generation sequencing technologies, allowing for rapid detection of antimicrobial resistance genes directly from sequencing data. SEAR uses raw sequencing data via an intuitive interface so can be run rapidly without requiring advanced bioinformatic skills or resources. Finally, we show that SEAR is effective in detecting antimicrobial resistance genes in metagenomic and isolate sequencing data from both environmental metagenomes and sequencing data from clinical isolates.", 
                "date": "2015-07-21T00:00:00Z", 
                "citationCount": 21, 
                "authors": [
                    {
                        "name": "Rowe W."
                    }, 
                    {
                        "name": "Baker K.S."
                    }, 
                    {
                        "name": "Verner-Jeffreys D."
                    }, 
                    {
                        "name": "Baker-Austin C."
                    }, 
                    {
                        "name": "Ryan J.J."
                    }, 
                    {
                        "name": "Maskell D."
                    }, 
                    {
                        "name": "Pearce G."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": "cam.ac.uk", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": "Will Rowe", 
            "email": null, 
            "url": "http://www.github.com/wpmr2/SEAR", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "wpmr2@cam.ac.uk", 
    "additionDate": "2016-02-18T10:46:59Z", 
    "lastUpdate": "2019-03-12T15:48:08Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}