{
    "accessibility": "Open access",
    "additionDate": "2024-04-30T12:31:41.312350Z",
    "biotoolsCURIE": "biotools:degronmd",
    "biotoolsID": "degronmd",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhongming.zhao@uth.tmc.edu",
            "name": "Zhongming Zhao",
            "orcidid": "https://orcid.org/0000-0002-3477-0914",
            "typeEntity": "Person"
        },
        {
            "name": "Haodong Xu",
            "typeEntity": "Person"
        },
        {
            "name": "Ruifeng Hu",
            "typeEntity": "Person"
        }
    ],
    "description": "DegronMD: protein-targeted degradation, mutation and drug response to degrons.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://bioinfo.uth.edu/degronmd",
    "lastUpdate": "2024-11-24T14:02:24.376910Z",
    "name": "DegronMD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/molbev/msad253",
            "metadata": {
                "abstract": "Protein-Targeted degradation is an emerging and promising therapeutic approach. The specificity of degradation and the maintenance of cellular homeostasis are determined by the interactions between E3 ubiquitin ligase and degradation signals, known as degrons. The human genome encodes over 600 E3 ligases; however, only a small number of targeted degron instances have been identified so far. In this study, we introduced DegronMD, an open knowledgebase designed for the investigation of degrons, their associated dysfunctional events, and drug responses. We revealed that degrons are evolutionarily conserved and tend to occur near the sites of protein translational modifications, particularly in the regions of disordered structure and higher solvent accessibility. Through pattern recognition and machine learning techniques, we constructed the degrome landscape across the human proteome, yielding over 18,000 new degrons for targeted protein degradation. Furthermore, dysfunction of degrons disrupts the degradation process and leads to the abnormal accumulation of proteins; this process is associated with various types of human cancers. Based on the estimated phenotypic changes induced by somatic mutations, we systematically quantified and assessed the impact of mutations on degron function in pan-cancers; these results helped to build a global mutational map on human degrome, including 89,318 actionable mutations that may induce the dysfunction of degrons and disrupt protein degradation pathways. Multiomics integrative analysis unveiled over 400 drug resistance events associated with the mutations in functional degrons. DegronMD, accessible at https://bioinfo.uth.edu/degronmd, is a useful resource to explore the biological mechanisms, infer protein degradation, and assist with drug discovery and design on degrons.",
                "authors": [
                    {
                        "name": "Hu R."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Zhao Z."
                    }
                ],
                "citationCount": 3,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "DegronMD: Leveraging Evolutionary and Structural Features for Deciphering Protein-Targeted Degradation, Mutations, and Drug Response to Degrons"
            },
            "pmcid": "PMC10701100",
            "pmid": "37992195"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
