{
    "additionDate": "2020-01-09T18:25:03Z",
    "biotoolsCURIE": "biotools:GAMA",
    "biotoolsID": "GAMA",
    "confidence_flag": "tool",
    "description": "GAMA is a modeling and simulation development environment for building spatially explicit agent-based simulations.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://gama-platform.github.io/wiki/Tutorials"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://gama-platform.github.io/download"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://gama-platform.github.io/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-06T16:52:57.046384Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gama-platform/gama"
        }
    ],
    "name": "GAMA",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s10707-018-00339-6",
            "metadata": {
                "abstract": "© 2018, Springer Science+Business Media, LLC, part of Springer Nature.The agent-based modeling approach is now used in many domains such as geography, ecology, or economy, and more generally to study (spatially explicit) socio-environmental systems where the heterogeneity of the actors and the numerous feedback loops between them requires a modular and incremental approach to modeling. One major reason of this success, besides this conceptual facility, can be found in the support provided by the development of increasingly powerful software platforms, which now allow modelers without a strong background in computer science to easily and quickly develop their own models. Another trend observed in the latest years is the development of much more descriptive and detailed models able not only to better represent complex systems, but also answer more intricate questions. In that respect, if all agent-based modeling platforms support the design of small to mid-size models, i.e. models with little heterogeneity between agents, simple representation of the environment, simple agent decision-making processes, etc., very few are adapted to the design of large-scale models. GAMA is one of the latter. It has been designed with the aim of supporting the writing (and composing) of fairly complex models, with a strong support of the spatial dimension, while guaranteeing non-computer scientists an easy access to high-level, otherwise complex, operations. This paper presents GAMA 1.8, the latest revision to date of the platform, with a focus on its modeling language and its capabilities to manage the spatial dimension of models. The capabilities of GAMA are illustrated by the presentation of applications that take advantage of its new features.",
                "authors": [
                    {
                        "name": "Taillandier P."
                    },
                    {
                        "name": "Gaudou B."
                    },
                    {
                        "name": "Grignard A."
                    },
                    {
                        "name": "Huynh Q.-N."
                    },
                    {
                        "name": "Marilleau N."
                    },
                    {
                        "name": "Caillou P."
                    },
                    {
                        "name": "Philippon D."
                    },
                    {
                        "name": "Drogoul A."
                    }
                ],
                "citationCount": 20,
                "date": "2019-04-15T00:00:00Z",
                "journal": "GeoInformatica",
                "title": "Building, composing and experimenting complex spatial models with the GAMA platform"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.7287/PEERJ.PREPRINTS.2231V2",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}