{
    "additionDate": "2017-12-18T00:10:56Z",
    "biotoolsCURIE": "biotools:phobos",
    "biotoolsID": "phobos",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ruhr-uni-bochum.de/spezzoo/cm/cm_en.htm"
        }
    ],
    "description": "Phobos is a tandem repeat search tool for complete genomes.PHOBOS can search for tandem repeats with a unit size of more than 5000 bp, which in the STAMP modules implies that primers can also be designed for minisatellites and tandem repeats with even longer units. Search settings and the output format of PHOBOS can be adjusted in a flexible manner, making it an ideal multipurpose tandem repeat search tool",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.ruhr-uni-bochum.de/spezzoo/cm/cm_phobos.htm",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/phobos-3-3-12-tandem-repeat-search-tool-complete-genomes.html"
        }
    ],
    "name": "Phobos",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-41",
            "metadata": {
                "abstract": "Background: Microsatellites (MSs) are DNA markers with high analytical power, which are widely used in population genetics, genetic mapping, and forensic studies. Currently available software solutions for high-throughput MS design (i) have shortcomings in detecting and distinguishing imperfect and perfect MSs, (ii) lack often necessary interactive design steps, and (iii) do not allow for the development of primers for multiplex amplifications. We present a set of new tools implemented as extensions to the STADEN package, which provides the backbone functionality for flexible sequence analysis workflows. The possibility to assemble overlapping reads into unique contigs (provided by the base functionality of the STADEN package) is important to avoid developing redundant markers, a feature missing from most other similar tools. Results: Our extensions to the STADEN package provide the following functionality to facilitate microsatellite (and also minisatellite) marker design: The new modules (i) integrate the state-of-the-art tandem repeat detection and analysis software PHOBOS into workflows, (ii) provide two separate repeat detection steps - with different search criteria - one for masking repetitive regions during assembly of sequencing reads and the other for designing repeat-flanking primers for MS candidate loci, (iii) incorporate the widely used primer design program PRIMER3 into STADEN workflows, enabling the interactive design and visualization of flanking primers for microsatellites, and (iv) provide the functionality to find optimal locus- and primer pair combinations for multiplex primer design. Furthermore, our extensions include a module for storing analysis results in an SQLite database, providing a transparent solution for data access from within as well as from outside of the STADEN Package. Conclusion: The STADEN package is enhanced by our modules into a highly flexible, high-throughput, interactive tool for conventional and multiplex microsatellite marker design. It gives the user detailed control over the workflow, enabling flexible combinations of manual and automated analysis steps. The software is available under the OpenBSD License 12. The high efficiency of our automated marker design workflow has been confirmed in three microsatellite development projects. © 2009 Kraemer et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Beszteri B."
                    },
                    {
                        "name": "Frickenhaus S."
                    },
                    {
                        "name": "Gabler-Schwarz S."
                    },
                    {
                        "name": "Held C."
                    },
                    {
                        "name": "Kraemer L."
                    },
                    {
                        "name": "Leese F."
                    },
                    {
                        "name": "Mayer C."
                    },
                    {
                        "name": "Pohlmann K."
                    }
                ],
                "citationCount": 34,
                "date": "2009-01-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "STAMP: Extensions to the STADEN sequence analysis package for high throughput interactive microsatellite marker design"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1,
    "version": [
        "3.3.12"
    ]
}
