{
    "additionDate": "2021-01-20T10:51:16Z",
    "biotoolsCURIE": "biotools:triadsim",
    "biotoolsID": "triadsim",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shi2@niehs.nih.gov",
            "name": "M. Shi",
            "orcidid": "https://orcid.org/0000-0001-8265-5307",
            "typeEntity": "Person"
        }
    ],
    "description": "Simulating autosomal genotypes with realistic linkage disequilibrium and a spiked-in genetic effect.\n\nSimulating Triad Genomewide Genotypes.\n\nSimulate genotypes for case-parent triads, case-control, and quantitative trait samples with realistic linkage diequilibrium structure and allele frequency distribution. For studies of epistasis one can simulate models that involve specific SNPs at specific sets of loci, which we will refer to as \"pathways\". TriadSim generates genotype data by resampling triad genotypes from existing data. The details of the method is described in the manuscript under preparation \"Simulating Autosomal Genotypes with Realistic Linkage Disequilibrium and a Spiked in Genetic Effect\" Shi, M., Umbach, D.M., Wise A.S., Weinberg, C.R.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/TriadSim/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-21T06:32:18Z",
    "license": "GPL-3.0",
    "name": "TriadSim",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-017-2004-2",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: To evaluate statistical methods for genome-wide genetic analyses, one needs to be able to simulate realistic genotypes. We here describe a method, applicable to a broad range of association study designs, that can simulate autosome-wide single-nucleotide polymorphism data with realistic linkage disequilibrium and with spiked in, user-specified, single or multi-SNP causal effects. Results: Our construction uses existing genome-wide association data from unrelated case-parent triads, augmented by including a hypothetical complement triad for each triad (same parents but with a hypothetical offspring who carries the non-transmitted parental alleles). We assign offspring qualitative or quantitative traits probabilistically through a specified risk model and show that our approach destroys the risk signals from the original data. Our method can simulate genetically homogeneous or stratified populations and can simulate case-parents studies, case-control studies, case-only studies, or studies of quantitative traits. We show that allele frequencies and linkage disequilibrium structure in the original genome-wide association sample are preserved in the simulated data. We have implemented our method in an R package (TriadSim) which is freely available at the comprehensive R archive network. Conclusion: We have proposed a method for simulating genome-wide SNP data with realistic linkage disequilibrium. Our method will be useful for developing statistical methods for studying genetic associations, including higher order effects like epistasis and gene by environment interactions.",
                "authors": [
                    {
                        "name": "Shi M."
                    },
                    {
                        "name": "Umbach D.M."
                    },
                    {
                        "name": "Wise A.S."
                    },
                    {
                        "name": "Weinberg C.R."
                    }
                ],
                "citationCount": 4,
                "date": "2018-01-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Simulating autosomal genotypes with realistic linkage disequilibrium and a spiked-in genetic effect"
            },
            "pmcid": "PMC5749028",
            "pmid": "29291710"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}