{
    "additionDate": "2021-01-18T08:02:57Z",
    "biotoolsCURIE": "biotools:svxplorer",
    "biotoolsID": "svxplorer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ratan@virginia.edu",
            "name": "Aakrosh Ratan",
            "orcidid": "https://orcid.org/0000-0002-0782-3056",
            "typeEntity": "Person"
        }
    ],
    "description": "Three-tier approach to identification of structural variants via sequential recombination of discordant cluster signatures.\n\nA structural variant caller that uses discordant read-pairs (PE), split-reads (SR) and read-depth (RD) information.\n\nSVXplorer accepts a BAM file of target as input and outputs a BEDPE file (and an equivalent VCF file) containing deletions (DEL), tandem duplications (TD), inversions (INV), non-tandem-duplications, translocations (see below), novel sequence insertions (DN_INS) and undetermined types tagged as \"BND.\" The variant tags listed in parentheses pertain to the BEDPE file, whereas the VCF file follows VCF 4.3 specifications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kunalkathuria/SVXplorer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T13:14:16Z",
    "license": "MIT",
    "name": "SVXplorer",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007737",
            "metadata": {
                "abstract": "© 2020 Kathuria, Ratan. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The identification of structural variants using short-read data remains challenging. Most approaches that use discordant paired-end sequences ignore non-trivial signatures presented by variants containing 3 breakpoints, such as those generated by various copy-paste and cut-paste mechanisms. This can result in lower precision and sensitivity in the identification of the more common structural variants such as deletions and duplications. We present SVXplorer, which uses a graph-based clustering approach streamlined by the integration of non-trivial signatures from discordant paired-end alignments, split-reads and read depth information to improve upon existing methods. We show that SVXplorer is more sensitive and precise compared to several existing approaches on multiple real and simulated datasets. SVXplorer is available for download at https://github.com/kunalkathuria/SVXplorer.",
                "authors": [
                    {
                        "name": "Kathuria K."
                    },
                    {
                        "name": "Ratan A."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "SVXplorer: Three-tier approach to identification of structural variants via sequential recombination of discordant cluster signatures"
            },
            "pmcid": "PMC7100977",
            "pmid": "32182236"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}