
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.imtech.res.in/raghava/ctlpred/team.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.imtech.res.in/raghava/ctlpred/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Immunoproteins, genes and antigens",
                "uri": "http://edamontology.org/topic_2830"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ctlpred-svm-ann-based-ctl-epitope-prediction-method.html"
        }
    ],
    "publication": [
        {
            "abstract": "Cytotoxic T lymphocyte (CTL) epitopes are potential candidates for subunit vaccine design for various diseases. Most of the existing T cell epitope prediction methods are indirect methods that predict MHC class I binders instead of CTL epitopes. In this study, a systematic attempt has been made to develop a direct method for predicting CTL epitopes from an antigenic sequence. This method is based on quantitative matrix (QM) and machine learning techniques such as Support Vector Machine (SVM) and Artificial Neural Network (ANN). This method has been trained and tested on non-redundant dataset of T cell epitopes and non-epitopes that includes 1137 experimentally proven MHC class I restricted T cell epitopes. The accuracy of QM-, ANN- and SVM-based methods was 70.0, 72.2 and 75.2%, respectively. The performance of these methods has been evaluated through Leave One Out Cross-Validation (LOOCV) at a cutoff score where sensitivity and specificity was nearly equal. Finally, both machine-learning methods were used for consensus and combined prediction of CTL epitopes. The performances of these methods were evaluated on blind dataset where machine learning-based methods perform better than QM-based method. We also demonstrated through subgroup analysis that our methods can discriminate between T-cell epitopes and MHC binders (non-epitopes). In brief this method allows prediction of CTL epitopes using QM, SVM, ANN approaches. The method also facilitates prediction of MHC restriction in predicted T cell epitopes. The method is available at http://www.imtech.res.in/raghava/ctlpred/. © 2004 Elsevier Ltd. All rights reserved.",
            "authors": [
                "Bhasin M.",
                "Raghava G.P.S."
            ],
            "cit_count": 165,
            "journal": "Vaccine",
            "pmid": "15297074",
            "title": "Prediction of CTL epitopes using QM, SVM and ANN techniques",
            "year": "2004-08-13"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ctlpred",
        "biotoolsID": "ctlpred",
        "description": "Direct method for prediction of CTL epitopes crucial in subunit vaccine design.In direct methods the information or patterns of T cell epitopes instead of MHC binders were used for the development o f methods. The methods is based on elegant machine learning techniques like a Artificial Neural network and support vector machine .",
        "homepage": "http://www.imtech.res.in/raghava/ctlpred",
        "name": "CTLPred"
    }
}