{
    "additionDate": "2020-01-14T09:31:32Z",
    "biotoolsCURIE": "biotools:hash-cgMLST",
    "biotoolsID": "hash-cgMLST",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "david.eyre@bdi.ox.ac.uk",
            "name": "David W. Eyre",
            "typeEntity": "Person"
        }
    ],
    "description": "Hash-Based Core Genome Multilocus Sequence Typing for Clostridium difficile.\n\nA tool for core-genome MLST typing for bacterial data. This has been initially developed for Clostridium difficile, but could be adpated to other bacteria.\n\nSingularity - instructions can be found here https://github.com/sylabs/singularity/blob/master/INSTALL.md.\n\nThis workflow will run on systems that support the dependencies above. It has been tested on MacOS, Ubuntu and CentOS. Minimal system resources are required to generate hash-cgMLST profiles alone, however generating assemblies using SPAdes is the main resource constraint for the whole pipeline, the amount of memory to use per core can be set in the nextflow.config file, e.g. 8 Gb.\n\nJava version 8 or later (required for nextflow).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                }
            ]
        }
    ],
    "homepage": "https://github.com/davideyre/hash-cgmlst",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-12-07T09:17:13Z",
    "name": "hash-cgMLST",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/JCM.01037-19",
            "metadata": {
                "abstract": "Copyright © 2019 Eyre et al.Pathogen whole-genome sequencing has huge potential as a tool to better understand infection transmission. However, rapidly identifying closely related genomes among a background of thousands of other genomes is challenging. Here, we describe a refinement to core genome multilocus sequence typing (cgMLST) in which alleles at each gene are reproducibly converted to a unique hash, or short string of letters (hash-cgMLST). This avoids the resource-intensive need for a single centralized database of sequentially numbered alleles. We test the reproducibility and discriminatory power of cgMLST/hash-cgMLST compared to those of mapping-based approaches in Clostridium difficile, using repeated sequencing of the same isolates (replicates) and data from consecutive infection isolates from six English hospitals. Hash-cgMLST provided the same results as standard cgMLST, with minimal performance penalty. Comparing 272 replicate sequence pairs using reference-based mapping, there were 0, 1, or 2 single-nucleotide polymorphisms (SNPs) between 262 (96%), 5 (2%), and 1 (<1%) of the pairs, respectively. Using hash-cgMLST, 218 (80%) of replicate pairs assembled with SPAdes had zero gene differences, and 31 (11%), 5 (2%), and 18 (7%) pairs had 1, 2, and >2 differences, respectively. False gene differences were clustered in specific genes and associated with fragmented assemblies, but were reduced using the SKESA assembler. Considering 412 pairs of infections with ≤2 SNPS, i.e., consistent with recent transmission, 376 (91%) had ≤2 gene differences and 16 (4%) had ≥4. Comparing a genome to 100,000 others took <1 min using hash-cgMLST. Hash-cgMLST is an effective surveillance tool for rapidly identifying clusters of related genomes. However, cgMLST/hash-cgMLST generate more false variants than mapping-based approaches. Follow-up mapping-based analyses are likely required to precisely define close genetic relationships.",
                "authors": [
                    {
                        "name": "Eyre D.W."
                    },
                    {
                        "name": "Peto T.E.A."
                    },
                    {
                        "name": "Crook D.W."
                    },
                    {
                        "name": "Sarah Walker A."
                    },
                    {
                        "name": "Wilcox M.H."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Clinical Microbiology",
                "title": "Hash-based core genome multilocus sequence typing for Clostridium difficile"
            },
            "pmcid": "PMC6935933",
            "pmid": "31666367"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}