{
    "additionDate": "2020-01-14T19:46:45Z",
    "biotoolsCURIE": "biotools:sugsvarsel",
    "biotoolsID": "sugsvarsel",
    "confidence_flag": "tool",
    "description": "Fast approximate inference for variable selection in Dirichlet process mixtures, with an application to pan-cancer proteomics.\n\nAn R package for the SUGS and SUGS VarSel algorithms",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ococrook/sugsvarsel",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:52:44.777290Z",
    "name": "sugsvarsel",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1515/sagmb-2018-0065",
            "metadata": {
                "abstract": "The Dirichlet Process (DP) mixture model has become a popular choice for model-based clustering, largely because it allows the number of clusters to be inferred. The sequential updating and greedy search (SUGS) algorithm (Wang & Dunson, 2011) was proposed as a fast method for performing approximate Bayesian inference in DP mixture models, by posing clustering as a Bayesian model selection (BMS) problem and avoiding the use of computationally costly Markov chain Monte Carlo methods. Here we consider how this approach may be extended to permit variable selection for clustering, and also demonstrate the benefits of Bayesian model averaging (BMA) in place of BMS. Through an array of simulation examples and well-studied examples from cancer transcriptomics, we show that our method performs competitively with the current state-of-the-art, while also offering computational benefits. We apply our approach to reverse-phase protein array (RPPA) data from The Cancer Genome Atlas (TCGA) in order to perform a pan-cancer proteomic characterisation of 5157 tumour samples. We have implemented our approach, together with the original SUGS algorithm, in an open-source R package named sugsvarsel, which accelerates analysis by performing intensive computations in C++ and provides automated parallel processing. The R package is freely available from: https://github.com/ococrook/sugsvarsel.",
                "authors": [
                    {
                        "name": "Crook O.M."
                    },
                    {
                        "name": "Gatto L."
                    },
                    {
                        "name": "Kirk P.D.W."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-12T00:00:00Z",
                "journal": "Statistical applications in genetics and molecular biology",
                "title": "Fast approximate inference for variable selection in Dirichlet process mixtures, with an application to pan-cancer proteomics"
            },
            "pmcid": "PMC7614016",
            "pmid": "31829970"
        }
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
