{
    "additionDate": "2017-12-06T18:14:09Z",
    "biotoolsCURIE": "biotools:glynsight",
    "biotoolsID": "glynsight",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "name": "Frederique LISACEK",
            "orcidid": "https://orcid.org/0000-0002-0948-4537",
            "typeEntity": "Person"
        },
        {
            "name": "ExPASy helpdesk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.expasy.org/support"
        }
    ],
    "description": "Web interface to upload, visualize and interactively compare glycan expression profiles. The tool can process N- or O-linked glycan expression data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://glycoproteome.expasy.org/glynsight/about"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://glycoproteome.expasy.org/glynsight/",
    "lastUpdate": "2019-09-04T08:38:48Z",
    "name": "Glynsight",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/glycob/cwy019",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved.Nowadays, due to the advance of experimental techniques in glycomics, large collections of glycan profiles are regularly published. The rapid growth of available glycan data accentuates the lack of innovative tools for visualizing and exploring large amount of information. Scientists resort to using general-purpose spreadsheet applications to create ad hoc data visualization. Thus, results end up being encoded in publication images and text, while valuable curated data is stored in files as supplementary information. To tackle this problem, we have built an interactive pipeline composed with three tools: Glynsight, EpitopeXtractor and Glydin'. Glycan profile data can be imported in Glynsight, which generates a custom interactive glycan profile. Several profiles can be compared and glycan composition is integrated with structural data stored in databases. Glycan structures of interest can then be sent to EpitopeXtractor to perform a glycoepitope extraction. EpitopeXtractor results can be superimposed on the Glydin' glycoepitope network. The network visualization allows fast detection of clusters of glycoepitopes and discovery of potential new targets. Each of these tools is standalone or can be used in conjunction with the others, depending on the data and the specific interest of the user. All the tools composing this pipeline are part of the Glycomics@ExPASy initiative and are available at https://www.expasy.org/glycomics.",
                "authors": [
                    {
                        "name": "Alocci D."
                    },
                    {
                        "name": "Barletta E."
                    },
                    {
                        "name": "Gastaldello A."
                    },
                    {
                        "name": "Ghraichy M."
                    },
                    {
                        "name": "Lisacek F."
                    },
                    {
                        "name": "Mariethoz J."
                    }
                ],
                "citationCount": 9,
                "date": "2018-06-01T00:00:00Z",
                "journal": "Glycobiology",
                "title": "Understanding the glycome: An interactive view of glycosylation from glycocompositions to glycoepitopes"
            },
            "pmid": "29518231",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}
