
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Ion counting",
                    "uri": "http://edamontology.org/operation_3704"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature America, Inc.Matrix-assisted laser desorption–ionization mass spectrometry imaging in transmission-mode geometry (t-MALDI–MSI) can provide molecular information with a pixel size of 1 µm and smaller, which makes this label-free method highly interesting for characterizing the chemical composition of tissues and cells on a (sub)cellular level. However, a major hindrance for wider use of the technology is the reduced ion abundance at small pixel sizes. Here we mitigate this problem by use of laser-induced post-ionization (MALDI-2) and by adapting a t-MALDI-2 ion source to an Orbitrap mass analyzer. We demonstrate the crucial sensitivity and accuracy boosts that are achieved with this combination by visualizing the distribution of numerous phospho- and glycolipids in mouse cerebellum and kidney slices, and in cultured Vero B4 cells. With brain tissue, a pixel size of 600 nm was achieved. Our method could constitute a valuable new tool for research in cell biology and biomedicine.",
            "authors": [
                "Niehaus M.",
                "Soltwisch J.",
                "Belov M.E.",
                "Dreisewerd K."
            ],
            "cit_count": 0,
            "doi": "10.1038/S41592-019-0536-2",
            "journal": "Nature Methods",
            "pmid": "31451764",
            "title": "Transmission-mode MALDI-2 mass spectrometry imaging of cells and tissues at subcellular resolution",
            "year": "2019-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:MALDI-2",
        "biotoolsID": "MALDI-2",
        "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'transmission-mode', 't-MALDI-2', 'post-ionization', 't-MALDI-MSI' | Transmission-mode MALDI-2 mass spectrometry imaging of cells and tissues at subcellular resolution | Platform for metabolite annotation of imaging mass spectrometry data | Your web browser (Chrome 68) is out of date. Update your browser for more security, speed and the best experience on this site. Update browser Ignore | We use cookies to enhance your experience. By continuing to visit this site you agree to our use of cookies. Learn more",
        "homepage": "https://metaspace2020.eu/project/Niehaus-2019-Transmission-MALDI-2",
        "name": "MALDI-2"
    }
}