{
    "additionDate": "2021-01-18T12:26:02Z",
    "biotoolsCURIE": "biotools:ndrindex",
    "biotoolsID": "ndrindex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jinsl@hit.edu.cn",
            "name": "Shuilin Jin",
            "orcidid": "https://orcid.org/0000-0002-2318-432X",
            "typeEntity": "Person"
        }
    ],
    "description": "A method for the quality assessment of single-cell RNA-Seq preprocessing data.\n\nA R package for selecting the best way for RNA-Seq data pretreatment.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zeromakerlovesmiku/NDRindex",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-03-08T09:54:11Z",
    "license": "GPL-3.0",
    "name": "NDRindex",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03883-X",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Single-cell RNA sequencing can be used to fairly determine cell types, which is beneficial to the medical field, especially the many recent studies on COVID-19. Generally, single-cell RNA data analysis pipelines include data normalization, size reduction, and unsupervised clustering. However, different normalization and size reduction methods will significantly affect the results of clustering and cell type enrichment analysis. Choices of preprocessing paths is crucial in scRNA-Seq data mining, because a proper preprocessing path can extract more important information from complex raw data and lead to more accurate clustering results. Results: We proposed a method called NDRindex (Normalization and Dimensionality Reduction index) to evaluate data quality of outcomes of normalization and dimensionality reduction methods. The method includes a function to calculate the degree of data aggregation, which is the key to measuring data quality before clustering. For the five single-cell RNA sequence datasets we tested, the results proved the efficacy and accuracy of our index. Conclusions: This method we introduce focuses on filling the blanks in the selection of preprocessing paths, and the result proves its effectiveness and accuracy. Our research provides useful indicators for the evaluation of RNA-Seq data.",
                "authors": [
                    {
                        "name": "Guo W."
                    },
                    {
                        "name": "Jin S."
                    },
                    {
                        "name": "Lu G."
                    },
                    {
                        "name": "Xiao R."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NDRindex: a method for the quality assessment of single-cell RNA-Seq preprocessing data"
            },
            "pmcid": "PMC7738244",
            "pmid": "33323107"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
