
{
    "credit": [
        {
            "email": "mareschal@ovsa.fr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.ovsa.fr/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinformatics.ovsa.fr/72/Rgb_130"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rgb-0-8-1-genome-browser-for-r.html"
        }
    ],
    "publication": [
        {
            "abstract": "Summary: Thanks to its free licensing and the development of initiatives like Bioconductor, R has become an essential part of the bioinformatics toolbox in the past years and is more and more confronted with genomically located data. While separate solutions are available to manipulate and visualize such data, no R package currently offers the efficiency required for computationally intensive tasks such as interactive genome browsing. The package proposed here fulfills this specific need, providing a multilevel interface suitable for most needs, from a completely interfaced genome browser to low-level classes and methods. Its time and memory efficiency have been challenged in a human dataset, where it outperformed existing solutions by several orders of magnitude. Availability and implementation: R sources and packages are freely available at the CRAN repository and dedicated Web site: http://bioinformatics.ovsa.fr/Rgb. Distributed under the GPL 3 license, compatible with most operating systems (Windows, Linux, Mac OS) and architectures. © The Author 2014.",
            "authors": [
                "Mareschal S.",
                "Dubois S.",
                "Lecroq T.",
                "Jardin F."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "24753490",
            "title": "Rgb: A scriptable genome browser for R",
            "year": "2014-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rgb",
        "biotoolsID": "rgb",
        "description": "This package is dedicated to memory efficient genome browsing strategies (both in scripts and interactive sessions) using the R scripting language. It includes classes and functions to manipulate genomic tracks, and a higher level interactive genome browser.",
        "homepage": "http://bioinformatics.ovsa.fr/72/Rgb_130",
        "name": "Rgb"
    }
}