{
    "accessibility": "Open access",
    "additionDate": "2023-03-03T22:24:15.347943Z",
    "biotoolsCURIE": "biotools:yersiniomics",
    "biotoolsID": "yersiniomics",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Javier Pizarro-Cerdá"
        },
        {
            "name": "Karen Druart"
        },
        {
            "name": "Cyril Savin",
            "orcidid": "https://orcid.org/0000-0003-2659-3433"
        },
        {
            "name": "Olivier Dussurget",
            "orcidid": "https://orcid.org/0000-0001-9924-0837"
        },
        {
            "name": "Pierre Lê-Bury",
            "orcidid": "https://orcid.org/0000-0002-6010-2952"
        }
    ],
    "description": "Multi-Omics Interactive Database for Yersinia Species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://yersiniomics.pasteur.fr/#bacnet.Yersinia",
    "lastUpdate": "2024-11-24T14:56:17.752876Z",
    "name": "Yersiniomics",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1128/spectrum.03826-22",
            "metadata": {
                "abstract": "The genus Yersinia includes a large variety of nonpathogenic and life-threatening pathogenic bacteria, which cause a broad spectrum of diseases in humans and animals, such as plague, enteritis, Far East scarlet-like fever (FESLF), and enteric redmouth disease. Like most clinically relevant microorganisms, Yersinia spp. are currently subjected to intense multi-omics investigations whose numbers have increased extensively in recent years, generating massive amounts of data useful for diagnostic and therapeutic developments. The lack of a simple and centralized way to exploit these data led us to design Yersiniomics, a web-based platform allowing straightforward analysis of Yersinia omics data. Yersiniomics contains a curated multi-omics database at its core, gathering 200 genomic, 317 transcriptomic, and 62 proteomic data sets for Yersinia species. It integrates genomic, transcriptomic, and proteomic browsers, a genome viewer, and a heatmap viewer to navigate within genomes and experimental conditions. For streamlined access to structural and functional properties, it directly links each gene to GenBank, the Kyoto Encyclopedia of Genes and Genomes (KEGG), UniProt, InterPro, IntAct, and the Search Tool for the Retrieval of Interacting Genes/Proteins (STRING) and each experiment to Gene Expression Omnibus (GEO), the European Nucleotide Archive (ENA), or the Proteomics Identifications Database (PRIDE). Yersiniomics provides a powerful tool for microbiologists to assist with investigations ranging from specific gene studies to systems biology studies. IMPORTANCE The expanding genus Yersinia is composed of multiple nonpathogenic species and a few pathogenic species, including the deadly etiologic agent of plague, Yersinia pestis. In 2 decades, the number of genomic, transcriptomic, and proteomic studies on Yersinia grew massively, delivering a wealth of data. We developed Yersiniomics, an interactive web-based platform, to centralize and analyze omics data sets on Yersinia species. The platform allows user-friendly navigation between genomic data, expression data, and experimental conditions. Yersiniomics will be a valuable tool to microbiologists.",
                "authors": [
                    {
                        "name": "Becavin C."
                    },
                    {
                        "name": "Druart K."
                    },
                    {
                        "name": "Dussurget O."
                    },
                    {
                        "name": "Fiol G.M."
                    },
                    {
                        "name": "Le-Bury P."
                    },
                    {
                        "name": "Lechat P."
                    },
                    {
                        "name": "Matondo M."
                    },
                    {
                        "name": "Pizarro-Cerda J."
                    },
                    {
                        "name": "Savin C."
                    }
                ],
                "citationCount": 3,
                "date": "2023-03-01T00:00:00Z",
                "journal": "Microbiology Spectrum",
                "title": "Yersiniomics, a Multi-Omics Interactive Database for Yersinia Species"
            },
            "pmcid": "PMC10100798",
            "pmid": "36847572"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
