
{
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://202.97.205.76:8080/MetaImprint/contact_us.jsp"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://202.97.205.76:8080/MetaImprint/help.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Zoology",
                "uri": "http://edamontology.org/topic_3500"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Genomic imprinting is a complex genetic and epigenetic phenomenon that plays important roles in mammalian development and diseases. Mammalian imprinted genes have been identified widely by experimental strategies or predicted using computational methods. Systematic information for these genes would be necessary for the identification of novel imprinted genes and the analysis of their regulatory mechanisms and functions. Here, a well-designed information repository, MetaImprint (http://bioinfo.hrbmu.edu.cn/ MetaImprint), is presented, which focuses on the collection of information concerning mammalian imprinted genes. The current version of MetaImprint incorporates 539 imprinted genes, including 255 experimentally confirmed genes, and their detailed research courses from eight mammalian species. MetaImprint also hosts genome-wide genetic and epigenetic information of imprinted genes, including imprinting control regions, single nucleotide polymorphisms, non-coding RNAs, DNA methylation and histone modifications. Information related to human diseases and functional annotation was also integrated into MetaImprint. To facilitate data extraction, MetaImprint supports multiple search options, such as by gene ID and disease name. Moreover, a configurable Imprinted Gene Browser was developed to visualize the information on imprinted genes in a genomic context. In addition, an Epigenetic Changes Analysis Tool is provided for online analysis of DNA methylation and histone modification differences of imprinted genes among multiple tissues and cell types. MetaImprint provides a comprehensive information repository of imprinted genes, allowing researchers to investigate systematically the genetic and epigenetic regulatory mechanisms of imprinted genes and their functions in development and diseases. © 2014. Published by The Company of Biologists Ltd.",
            "authors": [
                "Wei Y.",
                "Su J.",
                "Liu H.",
                "Lv J.",
                "Wang F.",
                "Yan H.",
                "Wen Y.",
                "Liu H.",
                "Wu Q.",
                "Zhang Y."
            ],
            "cit_count": 11,
            "doi": "10.1242/DEV.105320",
            "journal": "Development (Cambridge)",
            "pmid": "24850854",
            "title": "Metaimprint: An information repository of mammalian imprinted genes",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metaimprint",
        "biotoolsID": "metaimprint",
        "description": "An information repository of mammalian imprinted genes.",
        "homepage": "http://202.97.205.76:8080/MetaImprint/",
        "name": "MetaImprint"
    }
}