{"credit":[{"email":"hlin@uestc.edu.cn","name":"Hao Lin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://lin.uestc.edu.cn/"}],"documentation":[{"type":"GENERAL","url":"http://lin.uestc.edu.cn/server/Mycobac/readme.html"}],"function":[{"operation":[{"term":"Protein subcellular localisation prediction","uri":"http://edamontology.org/operation_2489"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"},{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mycosub-predicting-subcellular-localization-of-mycobacterial-proteins.html"}],"publication":[{"abstract":"© The Royal Society of Chemistry 2015.Mycobacterium tuberculosis is a bacterium that causes tuberculosis, one of the most prevalent infectious diseases. Predicting the subcellular localization of mycobacterial proteins in this bacterium may provide vital clues for the prediction of protein function as well as for drug discovery and design. Therefore, a computational method that can predict the subcellular localization of mycobacterial proteins with high precision is highly desirable. We propose a computational method to predict the subcellular localization of mycobacterial proteins. An objective and strict benchmark dataset was constructed after collecting 272 non-redundant proteins from the universal protein resource (the UniProt database). Subsequently, a novel feature selection strategy based on binomial distribution was used to optimize the feature vector. Finally, a subset containing 219 chosen tripeptide features was imported into a support vector machine-based method to estimate the performance of the dataset in accurately and sensitively identifying these proteins. We found that the proposed method gave a maximum overall accuracy of 89.71% with an average accuracy of 81.12% in the jackknife cross-validation. The results indicate that our prediction method gave an efficient and powerful performance when compared with other published methods. We made the proposed method available on a purpose built Web server called MycoSub that is freely accessible at http://lin.uestc.edu.cn/server/MycoSub. We anticipate that MycoSub will become a useful tool for studying the functions of mycobacterial proteins and for designing and developing anti-mycobacterium drugs.","authors":["Zhu P.-P.","Li W.-C.","Zhong Z.-J.","Deng E.-Z.","Ding H.","Chen W.","Lin H."],"cit_count":51,"journal":"Molecular BioSystems","pmid":"25437899","title":"Predicting the subcellular localization of mycobacterial proteins by incorporating the optimal tripeptides into the general form of pseudo amino acid composition","year":"2015-02-01"}],"summary":{"biotoolsCURIE":"biotools:mycosub","biotoolsID":"mycosub","description":"This web-server was used to predict the subcellular localizations of mycobacterial proteins based on optimal tripeptide compositions.","homepage":"http://lin.uestc.edu.cn/server/Mycosub","name":"Mycosub"}}