{
    "additionDate": "2017-08-03T19:08:09Z",
    "biotoolsCURIE": "biotools:regshape",
    "biotoolsID": "regshape",
    "credit": [
        {
            "email": "stephen.ramsey@oregonstate.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://lab.saramsey.org/"
        }
    ],
    "description": "This R package  provides a classifier for predicting whether a given oligonucleotide sequence (of length l bp, where l would typically vary from six to as high as 25 bp) is, or is not, a transcription factor (TF) binding site.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ramseylab/regshape/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ramseylab/regshape/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/regshape-dna-shape-based-classifier-for-regulatory-elementsr-pkg.html"
        }
    ],
    "name": "regshape",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: The position-weight matrix (PWM) is a useful representation of a transcription factor binding site (TFBS) sequence pattern because the PWM can be estimated from a small number of representative TFBS sequences. However, because the PWM probability model assumes independence between individual nucleotide positions, the PWMs for some TFs poorly discriminate binding sites from non-binding-sites that have similar sequence content. Since the local three-dimensional DNA structure ('shape') is a determinant of TF binding specificity and since DNA shape has a significant sequence-dependence, we combined DNA shape-derived features into a TF-generalized regulatory score and tested whether the score could improve PWM-based discrimination of TFBS from non-binding-sites. Results: We compared a traditional PWM model to a model that combines the PWM with a DNA shape feature-based regulatory potential score, for accuracy in detecting binding sites for 75 vertebrate transcription factors. The PWM + shape model was more accurate than the PWM-only model, for 45% of TFs tested, with no significant loss of accuracy for the remaining TFs. Availability and implementation: The shape-based model is available as an open-source R package at that is archived on the GitHub software repository at https://github.com/ramseylab/regshape/.",
                "authors": [
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Ramsey S.A."
                    }
                ],
                "citationCount": 14,
                "date": "2015-12-18T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A DNA shape-based regulatory score improves position-weight matrix-based recognition of transcription factor binding sites"
            },
            "pmid": "26130577"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}