{
    "additionDate": "2020-01-14T09:21:29Z",
    "biotoolsCURIE": "biotools:OTP-PRL",
    "biotoolsID": "OTP-PRL",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "marta.ferreiro@uca.es",
            "name": "Marta Ferreiro-González",
            "orcidid": "https://orcid.org/0000-0003-0870-403X",
            "typeEntity": "Person"
        }
    ],
    "description": "an app for occupational risk prevention in policing activities.\n\nAPLICACIÓN OTP-PRL – formacionOTP.\n\nUtilizamos cookies propias y de terceros para mejorar la experiencia de navegación, y ofrecer contenidos y publicidad de interés. Al continuar con la navegación entendemos que se acepta nuestra Política de cookies.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://operativatacticapolicial.org/app-otp-prl",
    "lastUpdate": "2020-01-14T09:21:29Z",
    "name": "OTP-PRL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12889-019-7935-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The rapid progress in information and communication technologies has promoted the development of smartphone applications (apps) for a wide variety of purposes including workplace safety. However, no specific apps for occupational risk prevention in the police domain seemingly exist as yet. In this work, an app running under the iOS and Android operating systems was developed to help police officers become acquainted with policing-related occupational risks and to prevent their damaging consequences. Results: The proposed app, which uses an iterative user-centered design to avoid occupational risks in policing activities, was assessed for performance by a group of users and experts through a System Usability Scale (SUS) questionnaire. The mean overall score for the questionnaire was 82.3. The app has backend support to facilitate continual improvement through contributions from users and administrators. A field test revealed increased awareness of policing occupational risks after using the app in many users. Conclusions: A novel product that covers the needs of ORP requirements of police officers has been developed.",
                "authors": [
                    {
                        "name": "Vera-Jimenez J.C."
                    },
                    {
                        "name": "Ferreiro-Gonzalez M."
                    },
                    {
                        "name": "Barbero G.F."
                    },
                    {
                        "name": "Alvarez J.A."
                    },
                    {
                        "name": "Fernandez-Zacarias F."
                    },
                    {
                        "name": "Ayuso J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-21T00:00:00Z",
                "journal": "BMC Public Health",
                "title": "OTP-PRL: An app for occupational risk prevention in policing activities"
            },
            "pmcid": "PMC6873564",
            "pmid": "31752804"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}