{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:13:32Z",
    "biotoolsCURIE": "biotools:UNCOVER",
    "biotoolsID": "UNCOVER",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fabio.vandin@unipd.it",
            "name": "Fabio Vandin",
            "orcidid": "https://orcid.org/0000-0003-2244-2320",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Efficient algorithms to discover alterations with complementary functional association in cancer.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/VandinLab/UNCOVER/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read pre-processing",
                    "uri": "http://edamontology.org/operation_3219"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VandinLab/UNCOVER",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/VandinLab/UNCOVER/issues"
        }
    ],
    "maturity": "Mature",
    "name": "UNCOVER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1006802",
            "metadata": {
                "abstract": "© 2019 Sarto Basso et al.Recent large cancer studies have measured somatic alterations in an unprecedented number of tumours. These large datasets allow the identification of cancer-related sets of genetic alterations by identifying relevant combinatorial patterns. Among such patterns, mutual exclusivity has been employed by several recent methods that have shown its effectiveness in characterizing gene sets associated to cancer. Mutual exclusivity arises because of the complementarity, at the functional level, of alterations in genes which are part of a group (e.g., a pathway) performing a given function. The availability of quantitative target profiles, from genetic perturbations or from clinical phenotypes, provides additional information that can be leveraged to improve the identification of cancer related gene sets by discovering groups with complementary functional associations with such targets. In this work we study the problem of finding groups of mutually exclusive alterations associated with a quantitative (functional) target. We propose a combinatorial formulation for the problem, and prove that the associated computational problem is computationally hard. We design two algorithms to solve the problem and implement them in our tool UNCOVER. We provide analytic evidence of the effectiveness of UNCOVER in finding high-quality solutions and show experimentally that UNCOVER finds sets of alterations significantly associated with functional targets in a variety of scenarios. In particular, we show that our algorithms find sets which are better than the ones obtained by the state-of-the-art method, even when sets are evaluated using the statistical score employed by the latter. In addition, our algorithms are much faster than the state-of-the-art, allowing the analysis of large datasets of thousands of target profiles from cancer cell lines. We show that on two such datasets, one from project Achilles and one from the Genomics of Drug Sensitivity in Cancer project, UNCOVER identifies several significant gene sets with complementary functional associations with targets. Software available at: https://github.com/ VandinLab/UNCOVER.",
                "authors": [
                    {
                        "name": "Basso R.S."
                    },
                    {
                        "name": "Hochbaum D.S."
                    },
                    {
                        "name": "Vandin F."
                    }
                ],
                "citationCount": 4,
                "date": "2019-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Efficient algorithms to discover alterations with complementary functional association in cancer"
            },
            "pmcid": "PMC6550413",
            "pmid": "31120875",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}