{
    "additionDate": "2017-02-10T11:34:53Z",
    "biotoolsCURIE": "biotools:pdb2pqr",
    "biotoolsID": "pdb2pqr",
    "credit": [
        {
            "name": "Steve Smith",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/orderedlist"
        }
    ],
    "description": "Server that allows users to convert PDB files into PQR files by adding missing atoms, optimizing hydrogen bonding and assigning atomic charge and radius parameters. The resulting PQR file can be used for electrostatic calculations which can give insight into the influence of electrostatics on biomolecular structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.poissonboltzmann.org/pdb2pqr/INSTALL.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                }
            ]
        }
    ],
    "homepage": "http://pdb2pqr.sourceforge.net/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "PDB2PQR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Real-world observable physical and chemical characteristics are increasingly being calculated from the 3D structures of biomolecules. Methods for calculating pK a values, binding constants of ligands, and changes in protein stability are readily available, but often the limiting step in computational biology is the conversion of PDB structures into formats ready for use with biomolecular simulation software. The continued sophistication and integration of biomolecular simulation methods for systems-and genome-wide studies requires a fast, robust, physically realistic and standardized protocol for preparing macromolecular structures for biophysical algorithms. As described previously, the PDB2PQR web server addresses this need for electrostatic field calculations (Dolinsky et al., Nucleic Acids Research, 32, W665-W667, 2004). Here we report the significantly expanded PDB2PQR that includes the following features: robust standalone command line support, improved pK a estimation via the PROPKA framework, ligand parameterization via PEOE-PB charge methodology, expanded set of force fields and easily incorporated user-defined parameters via XML input files, and improvement of atom addition and optimization code. These features are available through a new web interface (http://pdb2pqr.sourceforge.net/), which offers users a wide range of options for PDB file conversion, modification and parameterization. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Dolinsky T.J."
                    },
                    {
                        "name": "Czodrowski P."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Nielsen J.E."
                    },
                    {
                        "name": "Jensen J.H."
                    },
                    {
                        "name": "Klebe G."
                    },
                    {
                        "name": "Baker N.A."
                    }
                ],
                "citationCount": 1198,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PDB2PQR: Expanding and upgrading automated preparation of biomolecular structures for molecular simulations"
            },
            "pmid": "17488841"
        },
        {
            "metadata": {
                "abstract": "Continuum solvation models, such as Poisson-Boltzmann and Generalized Born methods, have become increasingly popular tools for investigating the influence of electrostatics on biomolecular structure, energetics and dynamics. However, the use of such methods requires accurate and complete structural data as well as force field parameters such as atomic charges and radii. Unfortunately, the limiting step in continuum electrostatics calculations is often the addition of missing atomic coordinates to molecular structures from the Protein Data Bank and the assignment of parameters to biomolecular structures. To address this problem, we have developed the PDB2PQR web service (http://agave.wustl.edu/pdb2pqr/). This server automates many of the common tasks of preparing structures for continuum electrostatics calculations, including adding a limited number of missing heavy atoms to biomolecular structures, estimating titration states and protonating biomolecules in a manner consistent with favorable hydrogen bonding, assigning charge and radius parameters from a variety of force fields, and finally generating 'PQR' output compatible with several popular computational biology packages. This service is intended to facilitate the setup and execution of electrostatics calculations for both experts and non-experts and thereby broaden the accessibility to the biological community of continuum electrostatics analyses of biomolecular systems. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Dolinsky T.J."
                    },
                    {
                        "name": "Nielsen J.E."
                    },
                    {
                        "name": "McCammon J.A."
                    },
                    {
                        "name": "Baker N.A."
                    }
                ],
                "citationCount": 2160,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PDB2PQR: An automated pipeline for the setup of Poisson-Boltzmann electrostatics calculations"
            },
            "pmid": "15215472"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}