{
    "additionDate": "2021-12-06T11:55:14.122384Z",
    "biotoolsCURIE": "biotools:sparrpowr",
    "biotoolsID": "sparrpowr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ian.buller@nih.gov",
            "name": "Ian D. Buller",
            "orcidid": "https://orcid.org/0000-0001-9477-8582",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "sparrpowR is a flexible R package to estimate statistical power to identify spatial clustering of two groups and its application. The sparrpowR package is a suite of R functions to calculate the statistical power to detect clusters using the kernel-based spatial relative risk function that is estimated using the sparr package.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/machiela-lab/sparrpowR",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-12-06T11:55:14.124932Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/machiela-lab/sparrpowR/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=sparrpowR"
        }
    ],
    "name": "sparrpowR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12942-021-00267-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Cancer epidemiology studies require sufficient power to assess spatial relationships between exposures and cancer incidence accurately. However, methods for power calculations of spatial statistics are complicated and underdeveloped, and therefore underutilized by investigators. The spatial relative risk function, a cluster detection technique that detects spatial clusters of point-level data for two groups (e.g., cancer cases and controls, two exposure groups), is a commonly used spatial statistic but does not have a readily available power calculation for study design. Results: We developed sparrpowR as an open-source R package to estimate the statistical power of the spatial relative risk function. sparrpowR generates simulated data applying user-defined parameters (e.g., sample size, locations) to detect spatial clusters with high statistical power. We present applications of sparrpowR that perform a power calculation for a study designed to detect a spatial cluster of incident cancer in relation to a point source of numerous environmental emissions. The conducted power calculations demonstrate the functionality and utility of sparrpowR to calculate the local power for spatial cluster detection. Conclusions: sparrpowR improves the current capacity of investigators to calculate the statistical power of spatial clusters, which assists in designing more efficient studies. This newly developed R package addresses a critically underdeveloped gap in cancer epidemiology by estimating statistical power for a common spatial cluster detection technique.",
                "authors": [
                    {
                        "name": "Brown D.W."
                    },
                    {
                        "name": "Buller I.D."
                    },
                    {
                        "name": "Jones R.R."
                    },
                    {
                        "name": "Machiela M.J."
                    },
                    {
                        "name": "Myers T.A."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "International Journal of Health Geographics",
                "title": "sparrpowR: a flexible R package to estimate statistical power to identify spatial clustering of two groups and its application"
            },
            "pmcid": "PMC7977178",
            "pmid": "33736677",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
