{
    "additionDate": "2021-01-18T11:14:21Z",
    "biotoolsCURIE": "biotools:genesetcluster",
    "biotoolsID": "genesetcluster",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ewoud.ewing@ki.se",
            "name": "Ewoud Ewing",
            "orcidid": "https://orcid.org/0000-0001-8644-366X",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for summarizing and integrating gene-set analysis results.\n\nGene-set analysis (GSA) tools aim to provide biological context by identifying gene-sets associated with a given trait or traits of interest. Gene-set analysis tools are frequently gene-centric, using as input results from studies using RNA-seq or microarrays data (e.g. Ingenuity or GSEA among many others), but it has also been adapted for interval-based analysis derived from data-types such as DNA methylation or ChIP/ATAC-seq.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TranslationalBioinformaticsUnit/GeneSetCluster",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-22T19:16:57Z",
    "license": "GPL-3.0",
    "name": "GeneSetCluster",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03784-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Gene-set analysis tools, which make use of curated sets of molecules grouped based on their shared functions, aim to identify which gene-sets are over-represented in the set of features that have been associated with a given trait of interest. Such tools are frequently used in gene-centric approaches derived from RNA-sequencing or microarrays such as Ingenuity or GSEA, but they have also been adapted for interval-based analysis derived from DNA methylation or ChIP/ATAC-sequencing. Gene-set analysis tools return, as a result, a list of significant gene-sets. However, while these results are useful for the researcher in the identification of major biological insights, they may be complex to interpret because many gene-sets have largely overlapping gene contents. Additionally, in many cases the result of gene-set analysis consists of a large number of gene-sets making it complicated to identify the major biological insights. Results: We present GeneSetCluster, a novel approach which allows clustering of identified gene-sets, from one or multiple experiments and/or tools, based on shared genes. GeneSetCluster calculates a distance score based on overlapping gene content, which is then used to cluster them together and as a result, GeneSetCluster identifies groups of gene-sets with similar gene-set definitions (i.e. gene content). These groups of gene-sets can aid the researcher to focus on such groups for biological interpretations. Conclusions: GeneSetCluster is a novel approach for grouping together post gene-set analysis results based on overlapping gene content. GeneSetCluster is implemented as a package in R. The package and the vignette can be downloaded at https://github.com/TranslationalBioinformaticsUnit",
                "authors": [
                    {
                        "name": "Ewing E."
                    },
                    {
                        "name": "Planell-Picola N."
                    },
                    {
                        "name": "Jagodic M."
                    },
                    {
                        "name": "Gomez-Cabrero D."
                    }
                ],
                "date": "2020-10-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GeneSetCluster: A tool for summarizing and integrating gene-set analysis results"
            },
            "pmcid": "PMC7542881",
            "pmid": "33028195"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "ChIP-on-chip",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}