{
    "additionDate": "2018-06-19T20:09:43Z",
    "biotoolsCURIE": "biotools:pytarg",
    "biotoolsID": "pytarg",
    "credit": [
        {
            "email": "vytautas.raskevicius@lsmuni.lt",
            "name": "Vytautas Raskevicius",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Python library for work with genome scale metabolic models. This library contains functions to work with Genome Scale Metabolic Models with the goal of finding drug targets against cancer.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/SergioBordel/pyTARG/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SergioBordel/pyTARG",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "pyTARG",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0190636",
            "metadata": {
                "abstract": "© 2018 Raškevičius et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In this work we aim to show how Genome Scale Metabolic Models (GSMMs) can be used as tools for drug design. By comparing the chemical structures of human metabolites (obtained using their KEGG indexes) and the compounds contained in the DrugBank database, we have observed that compounds showing Tanimoto scores higher than 0.9 with a metabolite, are 29.5 times more likely to bind the enzymes metabolizing the considered metabolite, than ligands chosen randomly. By using RNA-seq data to constrain a human GSMM it is possible to obtain an estimation of its distribution of metabolic fluxes and to quantify the effects of restraining the rate of chosen metabolic reactions (for example using a drug that inhibits the enzymes catalyzing the mentioned reactions). This method allowed us to predict the differential effects of lipoamide analogs on the proliferation of MCF7 (a breast cancer cell line) and ASM (airway smooth muscle) cells respectively. These differential effects were confirmed experimentally, which provides a proof of concept of how human GSMMs could be used to find therapeutic windows against cancer. By using RNA-seq data of 34 different cancer cell lines and 26 healthy tissues, we assessed the putative anticancer effects of the compounds in DrugBank which are structurally similar to human metabolites. Among other results it was predicted that the mevalonate pathway might constitute a good therapeutic window against cancer proliferation, due to the fact that most cancer cell lines do not express the cholesterol transporter NPC1L1 and the lipoprotein lipase LPL, which makes them rely on the mevalonate pathway to obtain cholesterol.",
                "authors": [
                    {
                        "name": "Raskevicius V."
                    },
                    {
                        "name": "Mikalayeva V."
                    },
                    {
                        "name": "Antanaviciute I."
                    },
                    {
                        "name": "Cesleviciene I."
                    },
                    {
                        "name": "Skeberdis V.A."
                    },
                    {
                        "name": "Kairys V."
                    },
                    {
                        "name": "Bordel S."
                    }
                ],
                "citationCount": 13,
                "date": "2018-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Genome scale metabolic models as tools for drug design and personalized medicine"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}