{
    "additionDate": "2020-01-14T09:51:58Z",
    "biotoolsCURIE": "biotools:RDTs_Cryptosporidium_spp_Giardia_duodenalis",
    "biotoolsID": "RDTs_Cryptosporidium_spp_Giardia_duodenalis",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "h.d.schallig@amc.nl",
            "name": "Henk D. F. H. Schallig",
            "orcidid": "https://orcid.org/0000-0002-7096-6279",
            "typeEntity": "Person"
        }
    ],
    "description": "Performance of three rapid diagnostic tests for the detection of Cryptosporidium spp. and Giardia duodenalis in children with severe acute malnutrition and diarrhoea.\n\nBACKGROUND:There is significant need for accurate diagnostic tools for Cryptosporidium spp. and Giardia duodenalis infections in resource limited countries where diarrhoeal disease caused by these parasites is often prevalent. The present study assessed the diagnostic performance of three commercially available rapid diagnostic tests (RDTs) based on faecal-antigen detection for Cryptosporidium spp. and or G. duodenalis infections in stool samples of children admitted with severe acute malnutrition (SAM) and diarrhoea. An established multiplex PCR was used as reference test.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Cryptosporidium spp Giardia duodenalis', 'RDT Cryptosporidium spp Malawi', 'RDTs Cryptosporidium spp Giardia', 'Cryptosporidium spp'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31775877",
    "lastUpdate": "2020-01-14T09:51:58Z",
    "name": "RDTs Cryptosporidium spp Giardia duodenalis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S40249-019-0609-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: There is significant need for accurate diagnostic tools for Cryptosporidium spp. and Giardia duodenalis infections in resource limited countries where diarrhoeal disease caused by these parasites is often prevalent. The present study assessed the diagnostic performance of three commercially available rapid diagnostic tests (RDTs) based on faecal-antigen detection for Cryptosporidium spp. and/or G. duodenalis infections in stool samples of children admitted with severe acute malnutrition (SAM) and diarrhoea. An established multiplex PCR was used as reference test. Methods: Stool samples from children with SAM and diarrhoea enrolled in a randomized controlled trial (registered at clinicaltrials.gov/ct2/show/NCT02246296) in Malawi (n = 175) and Kenya (n = 120) between December 2014 and December 2015 were analysed by a multiplex PCR for the presence of Cryptosporidium spp., G. duodenalis or Entamoeba histolytica parasite DNA. Cryptosporidium-positive samples were species typed using restriction fragment length polymorphism analysis. A sub-sample of the stool specimens (n = 236) was used for testing with three different RDTs. Diagnostic accuracy of the tests under evaluation was assessed using the results of PCR as reference standard using MedCalc software. Pearson Chi-square test and Fisher's exact test were used to determine (significant) difference between the number of cryptosporidiosis or giardiasis cases found by PCR in Malawi and Kenya. The overall diagnostic accuracy of each RDT was calculated by plotting a receiver operating characteristic (ROC) curve for each test and to determine the area under the curve (AUC) using SPSS8 software. Results: Prevalence of Cryptosporidium spp. by PCR was 20.0 and 21.7% in Malawi and Kenya respectively, mostly C. hominis. G. duodenalis prevalence was 23.4 and 5.8% in Malawi and Kenya respectively. E. histolytica was not detected by PCR. RDT testing followed the same pattern of prevalence. RDT sensitivities ranged for cryptosporidiosis from 42.9 to 76.9% and for G. duodenalis from 48.2 to 85.7%. RDT specificities ranged from 88.4 to 100% for Cryptosporidium spp. and from 91.2 to 99.2% for G. duodenalis infections. Based on the estimated area under the curve (AUC) values, all tests under evaluation had an acceptable overall diagnostic accuracy (> 0.7), with the exception of one RDT for Cryptosporidium spp. in Malawi. Conclusions: All three RDTs for Cryptosporidium spp. and Giardia duodenalis evaluated in this study have a moderate sensitivity, but sufficient specificity. The main value of the RDTs is within their rapidness and their usefulness as screening assays in surveys for diarrhoea.",
                "authors": [
                    {
                        "name": "Bitilinyu-Bangoh J."
                    },
                    {
                        "name": "Voskuijl W."
                    },
                    {
                        "name": "Thitiri J."
                    },
                    {
                        "name": "Menting S."
                    },
                    {
                        "name": "Verhaar N."
                    },
                    {
                        "name": "Mwalekwa L."
                    },
                    {
                        "name": "De Jong D.B."
                    },
                    {
                        "name": "Van Loenen M."
                    },
                    {
                        "name": "Mens P.F."
                    },
                    {
                        "name": "Berkley J.A."
                    },
                    {
                        "name": "Bandsma R.H.J."
                    },
                    {
                        "name": "Schallig H.D.F.H."
                    }
                ],
                "date": "2019-11-28T00:00:00Z",
                "journal": "Infectious Diseases of Poverty",
                "title": "Performance of three rapid diagnostic tests for the detection of Cryptosporidium spp. And Giardia duodenalis in children with severe acute malnutrition and diarrhoea"
            },
            "pmcid": "PMC6882336",
            "pmid": "31775877"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ]
}