{
    "additionDate": "2019-11-14T18:42:10Z",
    "biotoolsCURIE": "biotools:Medication",
    "biotoolsID": "Medication",
    "confidence_flag": "low",
    "description": "> LOW CONFIDENCE! | Bridging the Gap Between Consumers' Medication Questions and Trusted Answers | The gold standard corpus for medication question answering introduced in the MedInfo 2019 paper (Bridging the Gap between Consumers’ Medication Questions and Trusted Answers)",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/abachaa/Medication_QA_MedInfo2019",
    "lastUpdate": "2019-11-14T18:42:10Z",
    "name": "Medication",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3233/SHTI190176",
            "metadata": {
                "abstract": "© 2019 International Medical Informatics Association (IMIA) and IOS Press. This article is published online with Open Access by IOS Press and distributed under the terms of the Creative Commons Attribution Non-Commercial License 4.0 (CC BY-NC 4.0).This paper addresses the task of answering consumer health questions about medications. To better understand the challenge and needs in terms of methods and resources, we first introduce a gold standard corpus for Medication Question Answering created using real consumer questions. The gold standard1 consists of six hundred and seventy-four question-answer pairs with annotations of the question focus and type and the answer source. We first present the manual annotation and answering process. In the second part of this paper, we test the performance of recurrent and convolutional neural networks in question type identification and focus recognition. Finally, we discuss the research insights from both the dataset creation process and our experiments. This study provides new resources and experiments on answering consumers' medication questions and discusses the limitations and directions for future research efforts.",
                "authors": [
                    {
                        "name": "Ben Abacha A."
                    },
                    {
                        "name": "Mrabet Y."
                    },
                    {
                        "name": "Sharp M."
                    },
                    {
                        "name": "Goodwin T.R."
                    },
                    {
                        "name": "Shooshan S.E."
                    },
                    {
                        "name": "Demner-Fushman D."
                    }
                ],
                "date": "2019-08-21T00:00:00Z",
                "journal": "Studies in Health Technology and Informatics",
                "title": "Bridging the gap between consumers' medication questions and trusted answers"
            },
            "pmid": "31437878"
        }
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Medical toxicology",
            "uri": "http://edamontology.org/topic_3415"
        }
    ]
}