{
    "additionDate": "2020-01-14T09:42:13Z",
    "biotoolsCURIE": "biotools:In3-x_Se4",
    "biotoolsID": "In3-x_Se4",
    "confidence_flag": "low",
    "credit": [
        {
            "name": "Mirza Humaun Kabir Rubel",
            "typeEntity": "Person"
        },
        {
            "email": "jak_apee@ru.ac.bd",
            "name": "Jaker Hossain",
            "typeEntity": "Person"
        }
    ],
    "description": "Electronic Structure of In3-x Se4 Electron Transport Layer for Chalcogenide/p-Si Heterojunction Solar Cells.\n\nIn this article, we perform density functional theory calculation to investigate the electronic and optical properties of newly reported In3-x Se4 compound using CAmbridge Serial Total Energy Package (CASTEP). Structural parameters obtained from the calculations agree well with the available experimental data, indicating their stability. In the band structure of In3-x Se4 (x = 0, 0.11, and, 0.22), the Fermi level (E F) crossed over several bands in the conduction bands, which is an indication of the n-type metal-like behavior of In3-x Se4 compounds. On the other hand, the band structure of In3-x Se4 (x = 1 3) exhibits semiconducting nature with a band gap of ∼0.2 eV.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'In3-x Se4 p-Si solar', 'In3-x Se4 p-Si', 'In3-x Se4 p-Si heterojunction solar', 'In3-x Se4 p-Si heterojunction'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31681882",
    "lastUpdate": "2020-01-14T09:42:13Z",
    "name": "In3-x Se4",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSOMEGA.9B02210",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.In this article, we perform density functional theory calculation to investigate the electronic and optical properties of newly reported In3-xSe4 compound using CAmbridge Serial Total Energy Package (CASTEP). Structural parameters obtained from the calculations agree well with the available experimental data, indicating their stability. In the band structure of In3-xSe4 (x = 0, 0.11, and, 0.22), the Fermi level (EF) crossed over several bands in the conduction bands, which is an indication of the n-type metal-like behavior of In3-xSe4 compounds. On the other hand, the band structure of In3-xSe4 (x = 1/3) exhibits semiconducting nature with a band gap of ∼0.2 eV. A strong hybridization among Se 4s, Se 4p and In 5s, In 5p orbitals for In3Se4 and that between Se 4p and In 5p orbitals were seen for β-In2Se3 compound. The dispersion of In 5s, In 5p and Se 4s, Se 4p orbitals is responsible for the electrical conductivity of In3Se4 that is confirmed from DOS calculations as well. Moreover, the bonding natures of In3-xSe4 materials have been discussed based on the electronic charge density map. Electron-like Fermi surface in In3Se4 ensures the single-band nature of the compound. The efficiency of the In3-xSe4/p-Si heterojunction solar cells has been calculated by Solar Cell Capacitance Simulator (SCAPS)-1D software using experimental data of In3-xSe4 thin films. The effect of various physical parameters on the photovoltaic performance of In3-xSe4/p-Si solar cells has been investigated to obtain the highest efficiency of the solar cells. The optimized power conversion efficiency of the solar cell is found to be 22.63% with VOC = 0.703 V, JSC = 38.53 mA/cm2, and FF = 83.48%. These entire theoretical predictions indicate the promising applications of In3-xSe4 two-dimensional compound to harness solar energy in near future.",
                "authors": [
                    {
                        "name": "Mondal B.K."
                    },
                    {
                        "name": "Newaz M.A."
                    },
                    {
                        "name": "Rashid M.A."
                    },
                    {
                        "name": "Hossain K.M."
                    },
                    {
                        "name": "Mostaque S.K."
                    },
                    {
                        "name": "Rahman M.F."
                    },
                    {
                        "name": "Rubel M.H.K."
                    },
                    {
                        "name": "Hossain J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-29T00:00:00Z",
                "journal": "ACS Omega",
                "title": "Electronic Structure of In3- xSe4 Electron Transport Layer for Chalcogenide/p-Si Heterojunction Solar Cells"
            },
            "pmcid": "PMC6822117",
            "pmid": "31681882"
        }
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}