{
    "additionDate": "2021-01-18T09:19:44Z",
    "biotoolsCURIE": "biotools:monkeycbp",
    "biotoolsID": "monkeycbp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "youbo@hrbust.edu.cn",
            "name": "Bo You",
            "typeEntity": "Person"
        },
        {
            "email": "jiangtz@nlpr.ia.ac.cn",
            "name": "Tianzi Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "A Toolbox for Connectivity-Based Parcellation of Monkey Brain.\n\nMonkeyCBP (A toolbox for connectivity-based parcellation of monkey brain).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bheAI/MonkeyCBP_CLI",
    "language": [
        "MATLAB",
        "Shell"
    ],
    "lastUpdate": "2021-02-26T09:40:43Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/bheAI/MonkeyCBP_GUI"
        }
    ],
    "name": "MonkeyCBP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FNINF.2020.00014",
            "metadata": {
                "abstract": "© Copyright © 2020 He, Yang, Fan, Gao, Li, Ye, You and Jiang.Non-human primate models are widely used in studying the brain mechanism underlying brain development, cognitive functions, and psychiatric disorders. Neuroimaging techniques, such as magnetic resonance imaging, play an important role in the examinations of brain structure and functions. As an indispensable tool for brain imaging data analysis, brain atlases have been extensively investigated, and a variety of versions constructed. These atlases diverge in the criteria based on which they are plotted. The criteria range from cytoarchitectonic features, neurotransmitter receptor distributions, myelination fingerprints, and transcriptomic patterns to structural and functional connectomic profiles. Among them, brainnetome atlas is tightly related to brain connectome information and built by parcellating the brain on the basis of the anatomical connectivity profiles derived from structural neuroimaging data. The pipeline for building the brainnetome atlas has been published as a toolbox named ATPP (A Pipeline for Automatic Tractography-Based Brain Parcellation). In this paper, we present a variation of ATPP, which is dedicated to monkey brain parcellation, to address the significant differences in the process between the two species. The new toolbox, MonkeyCBP, has major alterations in three aspects: brain extraction, image registration, and validity indices. By parcellating two different brain regions (posterior cingulate cortex) and (frontal pole) of the rhesus monkey, we demonstrate the efficacy of these alterations. The toolbox has been made public (https://github.com/bheAI/MonkeyCBP_CLI, https://github.com/bheAI/MonkeyCBP_GUI). It is expected that the toolbox can benefit the non-human primate neuroimaging community with high-throughput computation and low labor involvement.",
                "authors": [
                    {
                        "name": "He B."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Fan L."
                    },
                    {
                        "name": "Gao B."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Ye C."
                    },
                    {
                        "name": "You B."
                    },
                    {
                        "name": "Jiang T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-04-28T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "MonkeyCBP: A Toolbox for Connectivity-Based Parcellation of Monkey Brain"
            },
            "pmcid": "PMC7198896",
            "pmid": "32410977"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ]
}