{
    "accessibility": "Open access",
    "additionDate": "2021-12-13T15:08:50.656117Z",
    "biotoolsCURIE": "biotools:aipw",
    "biotoolsID": "aipw",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ashley.naimi@emory.edu",
            "name": "Ashley I Naimi",
            "typeEntity": "Person"
        }
    ],
    "description": "An R Package for Augmented Inverse Probability Weighted Estimation of Average Causal Effects",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yqzhong7/AIPW",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:14:07.762591Z",
    "license": "GPL-3.0",
    "name": "AIPW",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/aje/kwab207",
            "metadata": {
                "abstract": "An increasing number of recent studies have suggested that doubly robust estimators with cross-fitting should be used when estimating causal effects with machine learning methods. However, not all existing programs that implement doubly robust estimators support machine learning methods and cross-fitting, or provide estimates on multiplicative scales. To address these needs, we developed AIPW, a software package implementing augmented inverse probability weighting (AIPW) estimation of average causal effects in R (R Foundation for Statistical Computing, Vienna, Austria). Key features of the AIPW package include cross-fitting and flexible covariate adjustment for observational studies and randomized controlled trials (RCTs). In this paper, we use a simulated RCT to illustrate implementation of the AIPW estimator. We also perform a simulation study to evaluate the performance of the AIPW package compared with other doubly robust implementations, including CausalGAM, npcausal, tmle, and tmle3. Our simulation showed that the AIPW package yields performance comparable to that of other programs. Furthermore, we also found that cross-fitting substantively decreases the bias and improves the confidence interval coverage for doubly robust estimators fitted with machine learning algorithms. Our findings suggest that the AIPW package can be a useful tool for estimating average causal effects with machine learning methods in RCTs and observational studies.",
                "authors": [
                    {
                        "name": "Bodnar L.M."
                    },
                    {
                        "name": "Kennedy E.H."
                    },
                    {
                        "name": "Naimi A.I."
                    },
                    {
                        "name": "Zhong Y."
                    }
                ],
                "citationCount": 21,
                "date": "2021-12-01T00:00:00Z",
                "journal": "American Journal of Epidemiology",
                "title": "AIPW: An R Package for Augmented Inverse Probability-Weighted Estimation of Average Causal Effects"
            },
            "pmcid": "PMC8796813",
            "pmid": "34268567"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
