{
    "additionDate": "2017-12-06T18:14:53Z",
    "biotoolsCURIE": "biotools:supertree",
    "biotoolsID": "supertree",
    "credit": [
        {
            "email": "wwwphylo@unil.ch",
            "name": "SuperTree Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SuperTree is a software to assemble phylogenetic trees into a more comprehensive one, called supertree, using specific algorithms",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www2.unil.ch/phylo/bioinformatics/supertree.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "http://www2.unil.ch/phylo/bioinformatics/supertree.html",
    "homepage_status": 1,
    "lastUpdate": "2019-09-04T08:37:32Z",
    "name": "SuperTree",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1080/106351502753475916",
            "metadata": {
                "abstract": "Large and comprehensive phylogenetic trees are desirable for studying macroevolutionary processes and for classification purposes. Such trees can be obtained in two different ways. Either the widest possible range of taxa can be sampled and used in a phylogenetic analysis to produce a \"big tree,\" or preexisting topologies can be used to create a supertree. Although large multigene analyses are often favored, combinable data are not always available, and supertrees offer a suitable solution. The most commonly used method of supertree reconstruction, matrix representation with parsimony (MRP), is presented here. We used a combined data set for the Poaceae to (1) assess the differences between an approach that uses combined data and one that uses different MRP modifications based on the character partitions and (2) investigate the advantages and disadvantages of these modifications. Baum and Ragan and Purvis modifications gave similar results. Incorporating bootstrap support associated with pre-existing topologies improved Baum and Ragan modification and its similarity with a combined analysis. Finally, we used the supertree reconstruction approach on 55 published phylogenies to build one of most comprehensive phylogenetic trees published for the grass family including 403 taxa and discuss its strengths and weaknesses in relation to other published hypotheses. © Oxford University Press 2001.",
                "authors": [
                    {
                        "name": "Salamin N."
                    },
                    {
                        "name": "Hodkinson T.R."
                    },
                    {
                        "name": "Savolainen V."
                    }
                ],
                "citationCount": 81,
                "date": "2002-01-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "Building supertrees: An empirical assessment using the grass family (Poaceae)"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}