{
    "additionDate": "2022-11-08T08:39:27.463563Z",
    "biotoolsCURIE": "biotools:lungdwm",
    "biotoolsID": "lungdwm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guoxian85@gmail.com",
            "name": "Guoxian Yu",
            "typeEntity": "Person"
        },
        {
            "email": "kingjun@sdu.edu.cn",
            "name": "Jun Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "LungDWM is used for lung cancer subtype diagnosis using weakly paired multiomics data. LungDWM leverages attention-based feature encoders to extract the shared and specific features of multiomics data, imputes missing omics data from available ones through generative adversarial learning and makes the subtype diagnosis by fusing real and imputed data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "http://www.sdu-idea.cn/codes.php?name=LungDWM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:21:53.111510Z",
    "name": "LungDWM",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac643",
            "metadata": {
                "abstract": "Motivation: Cancer subtype diagnosis is crucial for its precise treatment and different subtypes need different therapies. Although the diagnosis can be greatly improved by fusing multiomics data, most fusion solutions depend on paired omics data, which are actually weakly paired, with different omics views missing for different samples. Incomplete multiview learning-based solutions can alleviate this issue but are still far from satisfactory because they: (i) mainly focus on shared information while ignore the important individuality of multiomics data and (ii) cannot pick out interpretable features for precise diagnosis. Results: We introduce an interpretable and flexible solution (LungDWM) for Lung cancer subtype Diagnosis using Weakly paired Multiomics data. LungDWM first builds an attention-based encoder for each omics to pick out important diagnostic features and extract shared and complementary information across omics. Next, it proposes an individual loss to jointly extract the specific information of each omics and performs generative adversarial learning to impute missing omics of samples using extracted features. After that, it fuses the extracted and imputed features to diagnose cancer subtypes. Experiments on benchmark datasets show that LungDWM achieves a better performance than recent competitive methods, and has a high authenticity and good interpretability.",
                "authors": [
                    {
                        "name": "Guo W."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yu G."
                    },
                    {
                        "name": "Zain A.M."
                    }
                ],
                "citationCount": 11,
                "date": "2022-11-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Lung cancer subtype diagnosis using weakly-paired multi-omics data"
            },
            "pmid": "36130063"
        }
    ],
    "toolType": [
        "Library",
        "Script"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
