{
    "additionDate": "2018-06-30T16:33:18Z",
    "biotoolsCURIE": "biotools:o-glcnacpred-ii",
    "biotoolsID": "o-glcnacpred-ii",
    "credit": [
        {
            "email": "cangzhijia@dlmu.edu.cn",
            "name": "Cangzhi Jia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Integrated classification algorithm for identifying O-GlcNAcylation sites based on fuzzy undersampling and a K-means PCA oversampling technique.",
    "documentation": [
        {
            "type": "General",
            "url": "http://121.42.167.206/OGlcPred/about.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://121.42.167.206/OGlcPred/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "O-GlcNAcPRED-II",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty039",
            "metadata": {
                "abstract": "© The Author(s) 2018. Motivation Protein O-GlcNAcylation (O-GlcNAc) is an important post-translational modification of serine (S)/threonine (T) residues that involves multiple molecular and cellular processes. Recent studies have suggested that abnormal O-G1cNAcylation causes many diseases, such as cancer and various neurodegenerative diseases. With the available protein O-G1cNAcylation sites experimentally verified, it is highly desired to develop automated methods to rapidly and effectively identify O-GlcNAcylation sites. Although some computational methods have been proposed, their performance has been unsatisfactory, particularly in terms of prediction sensitivity. Results In this study, we developed an ensemble model O-GlcNAcPRED-II to identify potential O-GlcNAcylation sites. A K-means principal component analysis oversampling technique (KPCA) and fuzzy undersampling method (FUS) were first proposed and incorporated to reduce the proportion of the original positive and negative training samples. Then, rotation forest, a type of classifier-integrated system, was adopted to divide the eight types of feature space into several subsets using four sub-classifiers: random forest, k-nearest neighbour, naive Bayesian and support vector machine. We observed that O-GlcNAcPRED-II achieved a sensitivity of 81.05%, specificity of 95.91%, accuracy of 91.43% and Matthew's correlation coefficient of 0.7928 for five-fold cross-validation run 10 times. Additionally, the results obtained by O-GlcNAcPRED-II on two independent datasets also indicated that the proposed predictor outperformed five published prediction tools. Availability and implementation http://121.42.167.206/OGlcPred/ Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Jia C."
                    },
                    {
                        "name": "Zuo Y."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 18,
                "date": "2018-06-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "O-GlcNAcPRED-II: An integrated classification algorithm for identifying O-GlcNAcylation sites based on fuzzy undersampling and a K -means PCA oversampling technique"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Protein variants",
            "uri": "http://edamontology.org/topic_3120"
        }
    ],
    "validated": 1
}