{
    "additionDate": "2021-01-18T11:18:42Z",
    "biotoolsCURIE": "biotools:cystanalyser",
    "biotoolsID": "cystanalyser",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eva.cernadas@usc.es",
            "name": "Eva Cernadas",
            "orcidid": "https://orcid.org/0000-0002-1562-2553",
            "typeEntity": "Person"
        },
        {
            "email": "miguel.garcia.gonzalez@sergas.es",
            "name": "Miguel A. García-González",
            "typeEntity": "Person"
        }
    ],
    "description": "CystAnalyser is a software tool for the automatic detection and quantification of cysts in Polycystic Kidney and Liver Disease, and other cystic disorders. It combines automatic image processing with a friendly graphical user interface (GUI) that allows researchers to supervise and easily correct the image processing before quantification. CystAnalyser is able to provide users the cystic index, the number of cysts and the cystic size profile.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://citius.usc.es/transferencia/software/cystanalyser",
    "lastUpdate": "2021-02-18T19:21:06Z",
    "name": "CystAnalyser",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008337",
            "metadata": {
                "abstract": "Copyright: © 2020 Cordido et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The Polycystic Kidney Disease (PKD) is characterized by progressive renal cyst development and other extrarenal manifestation including Polycystic Liver Disease (PLD). Phenotypical characterization of animal models mimicking human diseases are commonly used, in order to, study new molecular mechanisms and identify new therapeutic approaches. The main biomarker of disease progression is total volume of kidney and liver in both human and mouse, which correlates with organ function. For this reason, the estimation of the number and area of the tissue occupied by cysts, is critical for the understanding of physiological mechanisms underlying the disease. In this regard, cystic index is a robust parameter commonly used to quantify the severity of the disease. To date, the vast majority of biomedical researchers use ImageJ as a software tool to estimate the cystic index by quantifying the cystic areas of histological images after thresholding. This tool has imitations of being inaccurate, largely due to incorrectly identifying non-cystic regions. We have developed a new software, named CystAnalyser (register by Universidade de Santiago de Compostela–USC, and Fundación Investigación Sanitaria de Santiago—FIDIS), that combines automatic image processing with a graphical user friendly interface that allows investigators to oversee and easily correct the image processing before quantification. CystAnalyser was able to generate a cystic profile including cystic index, number of cysts and cyst size. In order to test the CystAnalyser software, 795 cystic kidney, and liver histological images were analyzed. Using CystAnalyser there were no differences calculating cystic index automatically versus user input, except in specific circumstances where it was necessary for the user to distinguish between mildly cystic from non-cystic regions. The sensitivity and specificity of the number of cysts detected by the automatic quantification depends on the type of organ and cystic severity, with values 76.84–78.59% and 76.96–89.66% for the kidney and 87.29–93.80% and 63.42–86.07% for the liver. CystAnalyser, in addition, provides a new tool for estimating the number of cysts and a more specific measure of the cystic index than ImageJ. This study proposes CystAnalyser is a new robust and freely downloadable software tool for analyzing the severity of disease by quantifying histological images of cystic organs for routine biomedical research. CystAnalyser can be downloaded from https://citius.usc.es/ transferencia/software/cystanalyser (for Windows and Linux) for research purposes upon acceptance.",
                "authors": [
                    {
                        "name": "Cordido A."
                    },
                    {
                        "name": "Cernadas E."
                    },
                    {
                        "name": "Fernandez-Delgado M."
                    },
                    {
                        "name": "Garcia-Gonzalez M.A."
                    }
                ],
                "date": "2020-10-22T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CystAnalyser: A new software tool for the automatic detection and quantification of cysts in polycystic kidney and liver disease, and other cystic disorders"
            },
            "pmcid": "PMC7608985",
            "pmid": "33090995"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Hepatic and biliary medicine",
            "uri": "http://edamontology.org/topic_3412"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}