{
    "accessibility": "Open access",
    "additionDate": "2022-06-28T09:28:38.454958Z",
    "biotoolsCURIE": "biotools:ltm-tcm",
    "biotoolsID": "ltm-tcm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tclxcccc@126.com",
            "name": "Xu Li"
        },
        {
            "email": "tsl-wangwenjia@tasly.com",
            "name": "Wenjia Wang"
        },
        {
            "name": "Jing Ren"
        }
    ],
    "description": "A comprehensive database for the linking of Traditional Chinese Medicine with modern medicine at molecular and phenotypic levels.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://cloud.tasly.com/#/tcm/home",
    "lastUpdate": "2022-06-28T09:28:38.457546Z",
    "license": "Not licensed",
    "name": "LTM-TCM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.PHRS.2022.106185",
            "metadata": {
                "abstract": "© 2022 The AuthorsBenefiting from the development of network pharmacology, Traditional Chinese Medicine (TCM) shows great potential in modern drug discovery. Recently, more and more TCM-related databases have been established for both academic and industry research, but they are still insufficient in data standardization, integrity, and precision. To better accelerate the TCM research and overcome these shortcomings, we construct a web-based TCM platform, LTM-TCM, which is currently the most comprehensive TCM database that includes the following advantages: (1) High-quality data integration from fourteen TCM authoritative databases, especially with additional manual collected 41,025 clinical treatment records and 213 ancient Chinese medical books. (2) Accurate correction of multi-source TCM interactions (between symptoms, prescriptions, herbs, ingredients and targets) through in-house Biomedical Natural Language Processing (BioNLP) approaches in more than 30 million articles. (3) Diverse cross-field pipelines (e.g., bioactive ingredients screening, targets prediction, and mechanism prediction, etc.) help integrating traditional medicine with modern science in common aspects at both the molecular and phenotypic levels. In summary, LTM-TCM contains 1928 symptoms, 48,126 prescriptions, 9122 plants, 34,967 ingredients, 13,109 targets and 1170,133 interactions among all TCM related components. LTM-TCM has both Chinese and English interfaces, and it is accessible at http://cloud.tasly.com/#/tcm/home.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Ren J."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Yan K."
                    },
                    {
                        "name": "Yan X."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhou S."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "Pharmacological Research",
                "title": "LTM-TCM: A comprehensive database for the linking of Traditional Chinese Medicine with modern medicine at molecular and phenotypic levels"
            },
            "pmid": "35306140"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ],
    "validated": 1
}
