{"credit":[{"email":"genome@soe.ucsc.edu","name":"Website and data questions","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"genome-mirror@soe.ucsc.edu","name":"Mirror and source code questions","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"genome-www@soe.ucsc.edu","name":"Server and website access problems","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://genome.ucsc.edu/goldenPath/help/hgTracksHelp.html#BLATAlign"}],"function":[{"operation":[{"term":"Sequence alignment","uri":"http://edamontology.org/operation_0292"}]}],"labels":{"language":["C"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"Analyzing vertebrate genomes requires rapid mRNA/DNA and cross-species protein alignments. A new tool, BLAT, is more accurate and 500 times faster than popular existing tools for mRNA/DNA alignments and 50 times faster for protein alignments at sensitivity settings typically used when comparing vertebrate sequences. BLAT's speed stems from an index of all nonoverlapping K-mers in the genome. This index fits inside the RAM of inexpensive computers, and need only be computed once for each genome assembly. BLAT has several major stages. It uses the index to find regions in the genome likely to be homologous to the query sequence. It performs an alignment between homologous regions. It stitches together these aligned regions (often exons) into larger alignments (typically genes). Finally, BLAT revisits small internal exons possibly missed at the first stage and adjusts large gap boundaries that have canonical splice sites where feasible. This paper describes how BLAT was optimized. Effects on speed and sensitivity are explored for various K-mer sizes, mismatch schemes, and number of required index matches. BLAT is compared with other alignment programs on various test sets and then used in several genome-wide applications. http://genome.ucsc.edu hosts a web-based BLAT server for the human genome.","authors":["Kent W.J."],"cit_count":4589,"journal":"Genome Research","pmid":"11932250","title":"BLAT - The BLAST-like alignment tool","year":"2002-04-25"}],"summary":{"biotoolsCURIE":"biotools:blat","biotoolsID":"blat","description":"Fast, accurate spliced alignment of DNA sequences.","homepage":"http://genome.ucsc.edu/cgi-bin/hgBlat?command=start","name":"BLAT"}}