{
    "additionDate": "2021-03-19T09:13:08Z",
    "biotoolsCURIE": "biotools:metadataset",
    "biotoolsID": "metadataset",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gorm.shackelford@gmail.com",
            "name": "Gorm E. Shackelford",
            "orcidid": "https://orcid.org/0000-0003-0949-0934",
            "typeEntity": "Person"
        }
    ],
    "description": "A method of using global evidence for local decision making.\n\nMetadataset (www.metadataset.com) is a collection of open data from scientific publications. These publications are about the management of agricultural and natural resources (e.g., crops, soil, water, and wildlife). The data are extracted from scientific publications, standardized, and summarized using dynamic meta-analysis.\n\nMetadataset is a collection of open data from scientific publications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://www.metadataset.com",
    "language": [
        "JavaScript",
        "Python",
        "R"
    ],
    "lastUpdate": "2021-04-11T09:16:30.728642Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gormshackelford/metadataset"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gormshackelford/metadataset-shiny"
        }
    ],
    "name": "Metadataset",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12915-021-00974-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Meta-analysis is often used to make generalisations across all available evidence at the global scale. But how can these global generalisations be used for evidence-based decision making at the local scale, if the global evidence is not perceived to be relevant to local decisions? We show how an interactive method of meta-analysis—dynamic meta-analysis—can be used to assess the local relevance of global evidence. Results: We developed Metadataset (www.metadataset.com) as a proof-of-concept for dynamic meta-analysis. Using Metadataset, we show how evidence can be filtered and weighted, and results can be recalculated, using dynamic methods of subgroup analysis, meta-regression, and recalibration. With an example from agroecology, we show how dynamic meta-analysis could lead to different conclusions for different subsets of the global evidence. Dynamic meta-analysis could also lead to a rebalancing of power and responsibility in evidence synthesis, since evidence users would be able to make decisions that are typically made by systematic reviewers—decisions about which studies to include (e.g. critical appraisal) and how to handle missing or poorly reported data (e.g. sensitivity analysis). Conclusions: In this study, we show how dynamic meta-analysis can meet an important challenge in evidence-based decision making—the challenge of using global evidence for local decisions. We suggest that dynamic meta-analysis can be used for subject-wide evidence synthesis in several scientific disciplines, including agroecology and conservation biology. Future studies should develop standardised classification systems for the metadata that are used to filter and weight the evidence. Future studies should also develop standardised software packages, so that researchers can efficiently publish dynamic versions of their meta-analyses and keep them up-to-date as living systematic reviews. Metadataset is a proof-of-concept for this type of software, and it is open source. Future studies should improve the user experience, scale the software architecture, agree on standards for data and metadata storage and processing, and develop protocols for responsible evidence use.",
                "authors": [
                    {
                        "name": "Shackelford G.E."
                    },
                    {
                        "name": "Martin P.A."
                    },
                    {
                        "name": "Hood A.S.C."
                    },
                    {
                        "name": "Christie A.P."
                    },
                    {
                        "name": "Kulinskaya E."
                    },
                    {
                        "name": "Sutherland W.J."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Biology",
                "title": "Dynamic meta-analysis: a method of using global evidence for local decision making"
            },
            "pmcid": "PMC7888140",
            "pmid": "33596922"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}