{
    "additionDate": "2017-08-03T19:01:47Z",
    "biotoolsCURIE": "biotools:somart",
    "biotoolsID": "somart",
    "credit": [
        {
            "email": "lifeng@berkeley.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bakerlab.berkeley.edu/"
        },
        {
            "email": "bbaker@berkeley.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web server for miRNA/tasiRNA analysis resources and tools, which is designed for researchers who are interested in identifying miRNAs or tasiRNAs that potentially regulate genes of interest.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bakerlab.berkeley.edu/somart-webserver-mirna-sirna-analysis"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://bakerlab.berkeley.edu/somart-webserver-mirna-sirna-analysis",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/somart-server-for-plant-mirnatasirna-analysis-tools.html"
        }
    ],
    "name": "SoMART",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Plant microRNAs (miRNAs) and trans-acting small interfering RNAs (tasiRNAs) play important roles in a variety of biological processes. Bioinformatics prediction and small RNA (sRNA) cloning are the most important approaches for identification of miRNAs and tasiRNAs and their targets. However, these approaches are not readily accessible to every researcher. Here we present SoMART, a web server for miRNA/tasiRNA analysis resources and tools, which is designed for researchers who are interested in identifying miRNAs or tasiRNAs that potentially regulate genes of interest. The server includes four sets of tools: 'Slicer detector' for detecting sRNAs targeting input genes, 'dRNA mapper' for detecting degradome (d)RNA products derived from input genes, 'PreMIR detector' for identifying miRNA precursors (MIRs) or tasiRNA precursor (TASs) of input sRNAs, and 'sRNA mapper' for mapping sRNAs onto input genes. We also developed a dRNA-seq protocol to achieve longer dRNA reads for better characterization of miRNA precursors by dRNA mapper. To validate the server function and robustness, we installed sRNA, dRNA and collected genomic DNA or transcriptome databases from Arabidopsis and solanaceous plants, and characterized miR172-mediated regulation of the APETALA2 gene in potato (Solanum tuberosum) and demonstrated conservation of MIR390-triggered TAS3 in tomato (Solanum lycopersicum). More importantly, we predicted the existence of MIR482-triggered TAS5 in tomato. We further tested and confirmed the efficiency and accuracy of the server by analyses of 21 validated miRNA targets and 115 miRNA precursors in Arabidopsis thaliana. SoMART is available at. © Published 2012. This article is a US Government work and is in the public domain in the USA.",
                "authors": [
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Orban R."
                    },
                    {
                        "name": "Baker B."
                    }
                ],
                "citationCount": 43,
                "date": "2012-06-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "SoMART: A web server for plant miRNA, tasiRNA and target gene analysis"
            },
            "pmid": "22268718"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}