{
    "additionDate": "2024-02-09T10:33:10.516288Z",
    "biotoolsCURIE": "biotools:clarity_db",
    "biotoolsID": "clarity_db",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wittenburg@fbn-dummerstorf.de",
            "name": "Dörte Wittenburg",
            "typeEntity": "Person"
        }
    ],
    "description": "Shiny app for interactive visualisation of the bovine physical-genetic map.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Physical mapping",
                    "uri": "http://edamontology.org/operation_2944"
                }
            ]
        }
    ],
    "homepage": "https://nmelzer.shinyapps.io/clarity",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:17:01.988351Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/nmelzer/CLARITY"
        }
    ],
    "name": "CLARITY",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fgene.2023.1082782",
            "metadata": {
                "abstract": "The arrangement of markers on the genome can be defined in either physical or linkage terms. While a physical map represents the inter-marker distances in base pairs, a genetic (or linkage) map pictures the recombination rate between pairs of markers. High-resolution genetic maps are key elements for genomic research, such as fine-mapping of quantitative trait loci, but they are also needed for creating and updating chromosome-level assemblies of whole-genome sequences. Based on published results on a large pedigree of German Holstein cattle and newly obtained results with German/Austrian Fleckvieh cattle, we aim at providing a platform that allows users to interactively explore the bovine genetic and physical map. We developed the R Shiny app CLARITY available online at https://nmelzer.shinyapps.io/clarity and as R package at https://github.com/nmelzer/CLARITY that provides access to the genetic maps built on the Illumina Bovine SNP50 genotyping array with markers ordered according to the physical coordinates of the most recent bovine genome assembly ARS-UCD1.2. The user is able to interconnect the physical and genetic map for a whole chromosome or a specific chromosomal region and can inspect a landscape of recombination hotspots. Moreover, the user can investigate which of the frequently used genetic-map functions locally fits best. We further provide auxiliary information about markers being putatively misplaced in the ARS-UCD1.2 release. The corresponding output tables and figures can be downloaded in various formats. By ongoing data integration from different breeds, the app also facilitates comparison of different genome features, providing a valuable tool for education and research purposes.",
                "authors": [
                    {
                        "name": "Ding X."
                    },
                    {
                        "name": "Melzer N."
                    },
                    {
                        "name": "Qanbari S."
                    },
                    {
                        "name": "Wittenburg D."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "CLARITY: a Shiny app for interactive visualisation of the bovine physical-genetic map"
            },
            "pmcid": "PMC10267868",
            "pmid": "37323679"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
