{
    "additionDate": "2024-03-18T17:11:02.458783Z",
    "biotoolsCURIE": "biotools:biocmap",
    "biotoolsID": "biocmap",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lcolladotor@gmail.com",
            "name": "Leonardo Collado-Torres",
            "orcidid": "https://orcid.org/0000-0003-2140-308X",
            "typeEntity": "Person"
        }
    ],
    "description": "Bioconductor-friendly, GPU-accelerated pipeline for bisulfite-sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "DMR identification",
                    "uri": "http://edamontology.org/operation_3809"
                },
                {
                    "term": "Methylation calling",
                    "uri": "http://edamontology.org/operation_3919"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://research.libd.org/BiocMAP/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-03-18T17:11:02.461690Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/LieberInstitute/BiocMAP"
        }
    ],
    "name": "BiocMAP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05461-3",
            "metadata": {
                "abstract": "Background: Bisulfite sequencing is a powerful tool for profiling genomic methylation, an epigenetic modification critical in the understanding of cancer, psychiatric disorders, and many other conditions. Raw data generated by whole genome bisulfite sequencing (WGBS) requires several computational steps before it is ready for statistical analysis, and particular care is required to process data in a timely and memory-efficient manner. Alignment to a reference genome is one of the most computationally demanding steps in a WGBS workflow, taking several hours or even days with commonly used WGBS-specific alignment software. This naturally motivates the creation of computational workflows that can utilize GPU-based alignment software to greatly speed up the bottleneck step. In addition, WGBS produces raw data that is large and often unwieldy; a lack of memory-efficient representation of data by existing pipelines renders WGBS impractical or impossible to many researchers. Results: We present BiocMAP, a Bioconductor-friendly methylation analysis pipeline consisting of two modules, to address the above concerns. The first module performs computationally-intensive read alignment using Arioc, a GPU-accelerated short-read aligner. Since GPUs are not always available on the same computing environments where traditional CPU-based analyses are convenient, the second module may be run in a GPU-free environment. This module extracts and merges DNA methylation proportions—the fractions of methylated cytosines across all cells in a sample at a given genomic site. Bioconductor-based output objects in R utilize an on-disk data representation to drastically reduce required main memory and make WGBS projects computationally feasible to more researchers. Conclusions: BiocMAP is implemented using Nextflow and available at http://research.libd.org/BiocMAP/ . To enable reproducible analysis across a variety of typical computing environments, BiocMAP can be containerized with Docker or Singularity, and executed locally or with the SLURM or SGE scheduling engines. By providing Bioconductor objects, BiocMAP’s output can be integrated with powerful analytical open source software for analyzing methylation data.",
                "authors": [
                    {
                        "name": "Collado-Torres L."
                    },
                    {
                        "name": "Eagles N.J."
                    },
                    {
                        "name": "Jaffe A.E."
                    },
                    {
                        "name": "Wilton R."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BiocMAP: a Bioconductor-friendly, GPU-accelerated pipeline for bisulfite-sequencing data"
            },
            "pmcid": "PMC10498615",
            "pmid": "37704947"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
