{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T16:45:33Z",
    "biotoolsCURIE": "biotools:qTorch",
    "biotoolsID": "qTorch",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "schuylerfried@gmail.com",
            "name": "S. Fried",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "sawayanicolas@gmail.com",
            "name": "N. Sawaya",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The quantum tensor contraction handler.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/aspuru-guzik-group/qtorch/blob/master/README.txt"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/aspuru-guzik-group/qtorch/blob/master/qTORCH_Software_Guide.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/aspuru-guzik-group/qtorch/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://github.com/aspuru-guzik-group/qtorch",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/aspuru-guzik-group/qtorch/issues"
        }
    ],
    "maturity": "Mature",
    "name": "qTorch",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0208510",
            "metadata": {
                "abstract": "© 2018 Fried et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Classical simulation of quantum computation is necessary for studying the numerical behavior of quantum algorithms, as there does not yet exist a large viable quantum computer on which to perform numerical tests. Tensor network (TN) contraction is an algorithmic method that can efficiently simulate some quantum circuits, often greatly reducing the computational cost over methods that simulate the full Hilbert space. In this study we implement a tensor network contraction program for simulating quantum circuits using multi-core compute nodes. We show simulation results for the Max-Cut problem on 3-through 7-regular graphs using the quantum approximate optimization algorithm (QAOA), successfully simulating up to 100 qubits. We test two different methods for generating the ordering of tensor index contractions: one is based on the tree decomposition of the line graph, while the other generates ordering using a straight-forward stochastic scheme. Through studying instances of QAOA circuits, we show the expected result that as the treewidth of the quantum circuit’s line graph decreases, TN contraction becomes significantly more efficient than simulating the whole Hilbert space. The results in this work suggest that tensor contraction methods are superior only when simulating Max-Cut/QAOA with graphs of regularities approximately five and below. Insight into this point of equal computational cost helps one determine which simulation method will be more efficient for a given quantum circuit. The stochastic contraction method outperforms the line graph based method only when the time to calculate a reasonable tree decomposition is prohibitively expensive. Finally, we release our software package, qTorch (Quantum TensOR Contraction Handler), intended for general quantum circuit simulation. For a nontrivial subset of these quantum circuits, 50 to 100 qubits can easily be simulated on a single compute node.",
                "authors": [
                    {
                        "name": "Fried E.S."
                    },
                    {
                        "name": "Sawaya N.P.D."
                    },
                    {
                        "name": "Cao Y."
                    },
                    {
                        "name": "Kivlichan I.D."
                    },
                    {
                        "name": "Romero J."
                    },
                    {
                        "name": "Aspuru-Guzik A."
                    }
                ],
                "citationCount": 6,
                "date": "2018-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "QTOrch: The quantum tensor contraction handler"
            },
            "pmcid": "PMC6287880",
            "pmid": "30532242",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        }
    ]
}