{
    "additionDate": "2017-03-24T11:31:18Z",
    "biotoolsCURIE": "biotools:tico",
    "biotoolsID": "tico",
    "credit": [
        {
            "email": "tico-info@gobics.de",
            "name": "TiCo Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TIS Correction (TiCo) is a tool for improving predictions of prokaryotic Translation Initiation Sites (TIS). TiCo can be used to analyze and reannotate predictions obtained by the program GLIMMER.",
    "documentation": [
        {
            "type": "General",
            "url": "http://tico.gobics.de/algorithm.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Translation initiation site prediction",
                    "uri": "http://edamontology.org/operation_0439"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "homepage": "http://tico.gobics.de/",
    "homepage_status": 1,
    "language": [
        "Java",
        "MATLAB",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "TiCo",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Although it is not difficult for state-of-the-art gene finders to identify coding regions in prokaryotic genomes, exact prediction of the corresponding translation initiation sites (TIS) is still a challenging problem. Recently a number of post-processing tools have been proposed for improving the annotation of prokaryotic TIS. However, inherent difficulties of these approaches arise from the considerable variation of TIS characteristics across different species. Therefore prior assumptions about the properties of prokaryotic gene starts may cause suboptimal predictions for newly sequenced genomes with TIS signals differing from those of well-investigated genomes. Results: We introduce a clustering algorithm for completely unsupervised scoring of potential TIS, based on positionally smoothed probability matrices. The algorithm requires an initial gene prediction and the genomic sequence of the organism to perform the reannotation. As compared with other methods for improving predictions of gene starts in bacterial genomes, our approach is not based on any specific assumptions about prokaryotic TIS. Despite the generality of the underlying algorithm, the prediction rate of our method is competitive on experimentally verified test data from E. coli and B. subtilis. Regarding genomes with high G+C content, in contrast to some previously proposed methods, our algorithm also provides good performance on P. aeruginosa, B. pseudomallei and R. solanacearum. Conclusion: On reliable test data we showed that our method provides good results in post-processing the predictions of the widely-used program GLIMMER. The underlying clustering algorithm is robust with respect to variations in the initial TIS annotation and does not require specific assumptions about prokaryotic gene starts. These features are particularly useful on genomes with high G+C content. The algorithm has been implemented in the tool »TICO«(TIs COrrector) which is publicly available from our web site. © 2006 Tech and Meinicke; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Tech M."
                    },
                    {
                        "name": "Meinicke P."
                    }
                ],
                "citationCount": 20,
                "date": "2006-03-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "An unsupervised classification scheme for improving predictions of prokaryotic TIS"
            },
            "pmid": "16526950"
        },
        {
            "metadata": {
                "abstract": "Summary: We provide the tool 'TICO' (Translation Initiation site COrrection) for improving the results of conventional gene finders for prokaryotic genomes with regard to exact localization of the translation initiation site (TIS). At the current state TICO provides an interface for direct post processing of the predictions obtained from the widely used program GLIMMER. Our program is based on a clustering algorithm for completely unsupervised scoring of potential TIS locations.",
                "authors": [
                    {
                        "name": "Tech M."
                    },
                    {
                        "name": "Pfeifer N."
                    },
                    {
                        "name": "Morgenstern B."
                    },
                    {
                        "name": "Meinicke P."
                    }
                ],
                "citationCount": 20,
                "date": "2005-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TICO: A tool for improving predictions of prokaryotic translation initiation sites"
            },
            "pmid": "15994191"
        },
        {
            "metadata": {
                "abstract": "Exact localization of the translation initiation sites (TIS) in prokaryotic genomes is difficult to achieve using conventional gene finders. We recently introduced the program TICO for postprocessing TIS predictions based on a completely unsupervised learning algorithm. The program can be utilized through our web interface at http:// tico.gobics.de/ and it is also freely available as a commandline version for Linux and Windows. The latest version of our program provides a tool for visualization of the resulting TIS model. Although the underlying method is not based on any specific assumptions about characteristic sequence features of prokaryotic TIS the prediction rates of our tool are competitive on experimentally verified test data. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Tech M."
                    },
                    {
                        "name": "Morgenstern B."
                    },
                    {
                        "name": "Meinicke P."
                    }
                ],
                "citationCount": 7,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TICO: A tool for postprocessing the predictions of prokaryotic translation initiation sites"
            },
            "pmid": "16845076"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1
}