{"collectionID": [], "accessibility": [], "topic": [{"term": "Sequence analysis", "uri": "http://edamontology.org/topic_0080"}, {"term": "RNA", "uri": "http://edamontology.org/topic_0099"}, {"term": "DNA", "uri": "http://edamontology.org/topic_0654"}, {"term": "Transcription factors and regulatory sites", "uri": "http://edamontology.org/topic_0749"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "19210776", "type": null, "pmcid": null, "metadata": {"title": "A reexamination of information theory-based methods for DNA-binding site identification", "abstract": "Background: Searching for transcription factor binding sites in genome sequences is still an open problem in bioinformatics. Despite substantial progress, search methods based on information theory remain a standard in the field, even though the full validity of their underlying assumptions has only been tested in artificial settings. Here we use newly available data on transcription factors from different bacterial genomes to make a more thorough assessment of information theory-based search methods. Results: Our results reveal that conventional benchmarking against artificial sequence data leads frequently to overestimation of search efficiency. In addition, we find that sequence information by itself is often inadequate and therefore must be complemented by other cues, such as curvature, in real genomes. Furthermore, results on skewed genomes show that methods integrating skew information, such as Relative Entropy, are not effective because their assumptions may not hold in real genomes. The evidence suggests that binding sites tend to evolve towards genomic skew, rather than against it, and to maintain their information content through increased conservation. Based on these results, we identify several misconceptions on information theory as applied to binding sites, such as negative entropy, and we propose a revised paradigm to explain the observed results. Conclusion: We conclude that, among information theory-based methods, the most unassuming search methods perform, on average, better than any other alternatives, since heuristic corrections to these methods are prone to fail when working on real data. A reexamination of information content in binding sites reveals that information content is a compound measure of search and binding affinity requirements, a fact that has important repercussions for our understanding of binding site evolution. © 2009 Erill and O'Neill; licensee BioMed Central Ltd.", "citationCount": 25, "authors": [{"name": "Erill I."}, {"name": "O'Neill M.C."}], "date": "2009-02-11T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "jordi.barbe@uab.es"}], "biotoolsCURIE": "biotools:fitom", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://erilllab.umbc.edu/research/software/fitom/", "function": [{"note": null, "input": [], "operation": [{"term": "Transcriptional regulatory element prediction", "uri": "http://edamontology.org/operation_0438"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:45Z", "otherID": [], "description": "Computer program for the detection of binding sites in DNA or RNA sequences. It implements several methods described in the literature to compute an approximation of binding affinity for a particular site based on a collection of binding sequences provided by the user.", "toolType": ["Desktop application"], "editPermission": {"type": "group", "authors": ["mbs_import"]}, "language": [], "link": [{"url": "http://www.mybiosoftware.com/fitom-1-0-detection-binding-sites-dna-rna-sequences.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "fitom", "additionDate": "2017-08-03T18:43:24Z", "name": "FiToM", "license": null, "documentation": [{"url": "http://erilllab.umbc.edu/research/software/fitom/", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}