{
    "additionDate": "2018-10-02T07:56:15Z",
    "biotoolsCURIE": "biotools:populationprofiler",
    "biotoolsID": "populationprofiler",
    "credit": [
        {
            "email": "damian.matuszewski@it.uu.se",
            "name": "Damian J. Matuszewski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PopulationProfiler is a software tool that reduces per-cell measurements to population statistics. The software imports measurements from a simple text file, visualizes population distributions in a compact and comprehensive way, and can create gates for subpopulation classes based on control samples.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://cb.uu.se/~damian/PopulationProfiler/PopulationProfiler_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://cb.uu.se/~damian/PopulationProfiler.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "name": "PopulationProfiler",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0151554",
            "metadata": {
                "abstract": "© 2016 Matuszewski et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Image-based screening typically produces quantitative measurements of cell appearance. Large-scale screens involving tens of thousands of images, each containing hundreds of cells described by hundreds of measurements, result in overwhelming amounts of data. Reducing per-cell measurements to the averages across the image(s) for each treatment leads to loss of potentially valuable information on population variability. We present PopulationProfiler - a new software tool that reduces per-cell measurements to population statistics. The software imports measurements from a simple text file, visualizes population distributions in a compact and comprehensive way, and can create gates for subpopulation classes based on control samples. We validate the tool by showing how PopulationProfiler can be used to analyze the effect of drugs that disturb the cell cycle, and compare the results to those obtained with flow cytometry.",
                "authors": [
                    {
                        "name": "Matuszewski D.J."
                    },
                    {
                        "name": "Wahlby C."
                    },
                    {
                        "name": "Puigvert J.C."
                    },
                    {
                        "name": "Sintorn I.-M."
                    }
                ],
                "citationCount": 6,
                "date": "2016-03-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PopulationProfiler: A tool for population analysis and visualization of image-based cell screening data"
            },
            "pmcid": "PMC4795740",
            "pmid": "26987120",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}