{
    "additionDate": "2020-01-14T20:18:43Z",
    "biotoolsCURIE": "biotools:pancancer",
    "biotoolsID": "pancancer",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "khan@inha.ac.kr",
            "name": "Kyungsook Han",
            "orcidid": "https://orcid.org/0000-0001-9900-6741",
            "typeEntity": "Person"
        }
    ],
    "description": "Finding prognostic gene pairs for cancer from patient-specific gene networks.\n\nDynamically constructing patient-specific gene networks.\n\nBreast invasive carcinoma (BRCA) patient-specific gene networks.\n\nColon adenocarcinoma (COAD) patient-specific gene networks.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/webinterviewer (INHA.AC.KR), bio.tools/pseudoviewer (INHA.AC.KR).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'patient-specific', 'prognostic'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bclab.inha.ac.kr/pancancer",
    "lastUpdate": "2020-01-14T20:18:43Z",
    "name": "pancancer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0634-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Molecular characterization of individual cancer patients is important because cancer is a complex and heterogeneous disease with many possible genetic and environmental causes. Many studies have been conducted to identify diagnostic or prognostic gene signatures for cancer from gene expression profiles. However, some gene signatures may fail to serve as diagnostic or prognostic biomarkers and gene signatures may not be found in gene expression profiles. Methods: In this study, we developed a general method for constructing patient-specific gene correlation networks and for identifying prognostic gene pairs from the networks. A patient-specific gene correlation network was constructed by comparing a reference gene correlation network from normal samples to a network perturbed by a single patient sample. The main difference of our method from previous ones includes (1) it is focused on finding prognostic gene pairs rather than prognostic genes and (2) it can identify prognostic gene pairs from gene expression profiles even when no significant prognostic genes exist. Results: Evaluation of our method with extensive data sets of three cancer types (breast invasive carcinoma, colon adenocarcinoma, and lung adenocarcinoma) showed that our approach is general and that gene pairs can serve as more reliable prognostic signatures for cancer than genes. Conclusions: Our study revealed that prognosis of individual cancer patients is associated with the existence of prognostic gene pairs in the patient-specific network and the size of a subnetwork of the prognostic gene pairs in the patient-specific network. Although preliminary, our approach will be useful for finding gene pairs to predict survival time of patients and to tailor treatments to individual characteristics. The program for dynamically constructing patient-specific gene networks and for finding prognostic gene pairs is available at http://bclab.inha.ac.kr/pancancer.",
                "authors": [
                    {
                        "name": "Park B."
                    },
                    {
                        "name": "Lee W."
                    },
                    {
                        "name": "Park I."
                    },
                    {
                        "name": "Han K."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Finding prognostic gene pairs for cancer from patient-specific gene networks"
            },
            "pmcid": "PMC6923916",
            "pmid": "31856825"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}