
{
    "credit": [
        {
            "email": "shenli.sam@gmail.com",
            "name": "Mount Sinai",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/GeneOverlap.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GeneOverlap_1.10.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "http://shenlab-sinai.github.io/shenlab-sinai/"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016, Association for Research in Vision and Ophthalmology Inc. All rights Reserved. PURPOSE. To identify commonalities between the genes in close proximity to genome-wide association study (GWAS) refractive error and axial length loci, and the genes and proteins differentially expressed in animal models of optically induced refractive error. METHODS. The GWAS catalog was searched for loci significantly (P ≤ 5*10-8) associated with refractive error or axial length. PubMed was searched for exploratory animal transcriptome and proteomics studies of optically induced refractive error. A total of 15 GWAS, 7 transcriptome, and 9 proteomics studies met inclusion criteria. Ensembl’s BioMart was used to identify human orthologs for the differentially expressed genes and proteins from animal studies. These orthologs were then compared to the protein-coding genes within 1 megabase (Mb), 500 kilobases (kb), and 250 kb of human GWAS loci by using the GeneOverlap R package, and Benjamini-Hochberg-adjusted P values and odds ratios (ORs) were calculated for each intersection. RESULTS. The genes near human GWAS loci overlapped significantly with the genes downregulated during early myopia induction in animals (1Mb: OR =1.56, P =0.025; 500 kb: OR =1.92, P =0.010; 250 kb: OR =2.33, P =0.010). There was also significant overlap between the genes and proteins differentially expressed in late myopia (OR =4.12, P =0.018). When animal study results were segregated by methodologic parameters, GWAS candidate genes overlapped significantly with the genes differentially expressed at early (OR =1.50, P =0.010) but not late (OR =1.04, P =0.684) induction time-points. Gene and protein expression responses also appeared well conserved across model species, and there was no evidence of greater GWAS-transcriptome concordance in similar species to humans (e.g., primates or mammals). CONCLUSIONS. These findings suggest that genetic and environmental factors control ocular growth via similar biological pathways across species, and support the continued use of animal models for investigating the biological mechanisms underlying human myopia development.",
            "authors": [
                "Riddell N.",
                "Crewther S.G."
            ],
            "cit_count": 6,
            "doi": "10.1167/iovs.16-20618",
            "journal": "Investigative Ophthalmology and Visual Science",
            "title": "Integrated comparison of GWAS, transcriptome, and proteomics studies highlights similarities in the biological basis of animal and human myopia",
            "type": "Review",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:geneoverlap",
        "biotoolsID": "geneoverlap",
        "description": "Test two sets of gene lists and visualize the results.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/GeneOverlap.html",
        "name": "GeneOverlap",
        "version": [
            "1.10.0"
        ]
    }
}