{
    "additionDate": "2020-01-14T08:55:37Z",
    "biotoolsCURIE": "biotools:PyGMQL",
    "biotoolsID": "PyGMQL",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "luca.nanni@polimi.it",
            "name": "Luca Nanni",
            "orcidid": "https://orcid.org/0000-0001-7021-2007",
            "typeEntity": "Person"
        }
    ],
    "description": "scalable data extraction and analysis for heterogeneous genomic datasets.\n\nPython Library for data analysis based on GMQL.\n\nThe doucumentation can be found at the following link: http://pygmql.readthedocs.io.\n\nAPI for calling interactively the GMQL Engine from Python",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/gecopolimi/pygmql"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DEIB-GECO/PyGMQL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-11T14:08:16Z",
    "license": "Apache-2.0",
    "name": "PyGMQL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3159-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: With the growth of available sequenced datasets, analysis of heterogeneous processed data can answer increasingly relevant biological and clinical questions. Scientists are challenged in performing efficient and reproducible data extraction and analysis pipelines over heterogeneously processed datasets. Available software packages are suitable for analyzing experimental files from such datasets one by one, but do not scale to thousands of experiments. Moreover, they lack proper support for metadata manipulation. Results: We present PyGMQL, a novel software for the manipulation of region-based genomic files and their relative metadata, built on top of the GMQL genomic big data management system. PyGMQL provides a set of expressive functions for the manipulation of region data and their metadata that can scale to arbitrary clusters and implicitly apply to thousands of files, producing millions of regions. PyGMQL provides data interoperability, distribution transparency and query outsourcing. The PyGMQL package integrates scalable data extraction over the Apache Spark engine underlying the GMQL implementation with native Python support for interactive data analysis and visualization. It supports data interoperability, solving the impedance mismatch between executing set-oriented queries and programming in Python. PyGMQL provides distribution transparency (the ability to address a remote dataset) and query outsourcing (the ability to assign processing to a remote service) in an orthogonal way. Outsourced processing can address cloud-based installations of the GMQL engine. Conclusions: PyGMQL is an effective and innovative tool for supporting tertiary data extraction and analysis pipelines. We demonstrate the expressiveness and performance of PyGMQL through a sequence of biological data analysis scenarios of increasing complexity, which highlight reproducibility, expressive power and scalability.",
                "authors": [
                    {
                        "name": "Canakoglu A."
                    },
                    {
                        "name": "Ceri S."
                    },
                    {
                        "name": "Nanni L."
                    },
                    {
                        "name": "Pinoli P."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-08T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PyGMQL: scalable data extraction and analysis for heterogeneous genomic datasets"
            },
            "pmcid": "PMC6842186",
            "pmid": "31703553"
        }
    ],
    "topic": [
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
