
{
    "credit": [
        {
            "email": "folker@mcs.anl.gov",
            "name": "F. Meyer",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "API documentation",
            "url": "http://api.mg-rast.org/api.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript",
            "Perl",
            "Python",
            "C"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Random community genomes (metagenomes) are now commonly used to study microbes in different environments. Over the past few years, the major challenge associated with metagenomics shifted from generating to analyzing sequences. High-throughput, low-cost next-generation sequencing has provided access to metagenomics to a wide range of researchers. Results: A high-throughput pipeline has been constructed to provide high-performance computing to all researchers interested in using metagenomics. The pipeline produces automated functional assignments of sequences in the metagenome by comparing both protein and nucleotide databases. Phylogenetic and functional summaries of the metagenomes are generated, and tools for comparative metagenomics are incorporated into the standard views. User access is controlled to ensure data privacy, but the collaborative environment underpinning the service provides a framework for sharing datasets between multiple users. In the metagenomics RAST, all users retain full control of their data, and everything is available for download in a variety of formats. Conclusion: The open-source metagenomics RAST service provides a new paradigm for the annotation and analysis of metagenomes. With built-in support for multiple data sources and a back end that houses abstract data types, the metagenomics RAST is stable, extensible, and freely available to all researchers. This service has removed one of the primary bottlenecks in metagenome sequence analysis - the availability of high-performance computing for annotating the data. © 2008 Meyer et al; licensee BioMed Central Ltd.",
            "authors": [
                "Meyer F.",
                "Paarmann D.",
                "D'Souza M.",
                "Olson R.",
                "Glass E.M.",
                "Kubal M.",
                "Paczian T.",
                "Rodriguez A.",
                "Stevens R.",
                "Wilke A.",
                "Wilkening J.",
                "Edwards R.A."
            ],
            "cit_count": 1852,
            "journal": "BMC Bioinformatics",
            "pmid": "18803844",
            "title": "The metagenomics RAST server - A public resource for the automatic phylogenetic and functional analysis of metagenomes",
            "year": "2008-09-19"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mg-rast",
        "biotoolsID": "mg-rast",
        "description": "MG-RAST is a fully-automated service for annotating metagenome samples providing analysis tools for comparison",
        "homepage": "http://metagenomics.anl.gov",
        "name": "MG-RAST"
    }
}