{
    "accessibility": "Open access",
    "additionDate": "2024-02-25T15:30:39.742114Z",
    "biotoolsCURIE": "biotools:phybwt2",
    "biotoolsID": "phybwt2",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "alessio.conte@unipi.it",
            "name": "Alessio Conte",
            "typeEntity": "Person"
        },
        {
            "email": "giovanna.rosone@unipi.it",
            "name": "Giovanna Rosone",
            "typeEntity": "Person"
        },
        {
            "email": "roberto.grossi@unipi.it",
            "name": "Roberto Grossi",
            "typeEntity": "Person"
        },
        {
            "email": "veronica.guerrini@unipi.it",
            "name": "Veronica Guerrini",
            "typeEntity": "Person"
        }
    ],
    "description": "Alignment-, assembly-, and reference-free method that builds a partition tree without relying on the pairwise comparison of sequences, thus avoiding to use a distance matrix to infer phylogeny.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/veronicaguerrini/phyBWT2",
    "language": [
        "C++",
        "Shell"
    ],
    "lastUpdate": "2024-02-25T15:30:39.744607Z",
    "name": "phyBWT2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13015-023-00232-4",
            "metadata": {
                "abstract": "Background: Molecular phylogenetics studies the evolutionary relationships among the individuals of a population through their biological sequences. It may provide insights about the origin and the evolution of viral diseases, or highlight complex evolutionary trajectories. A key task is inferring phylogenetic trees from any type of sequencing data, including raw short reads. Yet, several tools require pre-processed input data e.g. from complex computational pipelines based on de novo assembly or from mappings against a reference genome. As sequencing technologies keep becoming cheaper, this puts increasing pressure on designing methods that perform analysis directly on their outputs. From this viewpoint, there is a growing interest in alignment-, assembly-, and reference-free methods that could work on several data including raw reads data. Results: We present phyBWT2, a newly improved version of phyBWT (Guerrini et al. in 22nd International Workshop on Algorithms in Bioinformatics (WABI) 242:23–12319, 2022). Both of them directly reconstruct phylogenetic trees bypassing both the alignment against a reference genome and de novo assembly. They exploit the combinatorial properties of the extended Burrows-Wheeler Transform (eBWT) and the corresponding eBWT positional clustering framework to detect relevant blocks of the longest shared substrings of varying length (unlike the k-mer-based approaches that need to fix the length k a priori). As a result, they provide novel alignment-, assembly-, and reference-free methods that build partition trees without relying on the pairwise comparison of sequences, thus avoiding to use a distance matrix to infer phylogeny. In addition, phyBWT2 outperforms phyBWT in terms of running time, as the former reconstructs phylogenetic trees step-by-step by considering multiple partitions, instead of just one partition at a time, as previously done by the latter. Conclusions: Based on the results of the experiments on sequencing data, we conclude that our method can produce trees of quality comparable to the benchmark phylogeny by handling datasets of different types (short reads, contigs, or entire genomes). Overall, the experiments confirm the effectiveness of phyBWT2 that improves the performance of its previous version phyBWT, while preserving the accuracy of the results.",
                "authors": [
                    {
                        "name": "Conte A."
                    },
                    {
                        "name": "Grossi R."
                    },
                    {
                        "name": "Guerrini V."
                    },
                    {
                        "name": "Liti G."
                    },
                    {
                        "name": "Rosone G."
                    },
                    {
                        "name": "Tattini L."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Algorithms for Molecular Biology",
                "title": "phyBWT2: phylogeny reconstruction via eBWT positional clustering"
            },
            "pmcid": "PMC10399073",
            "pmid": "37537624"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ]
}
