
{
    "credit": [
        {
            "email": "hbshen@sjtu.edu.cn",
            "name": "Hong Bin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.csbio.sjtu.edu.cn/bioinf/MemType/Readme.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Membrane and lipoproteins",
                "uri": "http://edamontology.org/topic_0820"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/memtype-2l-predicting-membrane-protein-types.html"
        }
    ],
    "publication": [
        {
            "abstract": "Given an uncharacterized protein sequence, how can we identify whether it is a membrane protein or not? If it is, which membrane protein type it belongs to? These questions are important because they are closely relevant to the biological function of the query protein and to its interaction process with other molecules in a biological system. Particularly, with the avalanche of protein sequences generated in the Post-Genomic Age and the relatively much slower progress in using biochemical experiments to determine their functions, it is highly desired to develop an automated method that can be used to help address these questions. In this study, a 2-layer predictor, called MemType-2L, has been developed: the 1st layer prediction engine is to identify a query protein as membrane or non-membrane; if it is a membrane protein, the process will be automatically continued with the 2nd-layer prediction engine to further identify its type among the following eight categories: (1) type I, (2) type II, (3) type III, (4) type IV, (5) multipass, (6) lipid-chain-anchored, (7) GPI-anchored, and (8) peripheral. MemType-2L is featured by incorporating the evolution information through representing the protein samples with the Pse-PSSM (Pseudo Position-Specific Score Matrix) vectors, and by containing an ensemble classifier formed by fusing many powerful individual OET-KNN (Optimized Evidence-Theoretic K-Nearest Neighbor) classifiers. The success rates obtained by MemType-2L on a new-constructed stringent dataset by both the jackknife test and the independent dataset test are quite high, indicating that MemType-2L may become a very useful high throughput tool. As a Web server, MemType-2L is freely accessible to the public at http://chou.med.harvard.edu/bioinf/MemType. © 2007 Elsevier Inc. All rights reserved.",
            "authors": [
                "Chou K.-C.",
                "Shen H.-B."
            ],
            "cit_count": 349,
            "journal": "Biochemical and Biophysical Research Communications",
            "pmid": "17586467",
            "title": "MemType-2L: A Web server for predicting membrane proteins and their types by incorporating evolution information through Pse-PSSM",
            "year": "2007-08-24"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:memtype-2l",
        "biotoolsID": "memtype-2l",
        "description": "2-layer predictor for predicting membrane protein types, the first layer will predict whether the query sequence belongs to membrane proteins or not; and the second layer aims to predict exactly the membrane protein types when the output of the first layer is “membrane proteins”.",
        "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/MemType/",
        "name": "MemType-2L"
    }
}