
{
    "credit": [
        {
            "name": "Avi Ma’ayan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.nature.com/articles/sdata201823/email/correspondent/c1/new"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://amp.pharm.mssm.edu/datasets2tools/help"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Loading",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "license": "CC-BY-4.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web API",
            "Database portal"
        ],
        "topic": [
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            },
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            },
            {
                "term": "Data acquisition",
                "uri": "http://edamontology.org/topic_3077"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Biomedical data repositories such as the Gene Expression Omnibus (GEO) enable the search and discovery of relevant biomedical digital data objects. Similarly, resources such as OMICtools, index bioinformatics tools that can extract knowledge from these digital data objects. However, systematic access to pre-generated 'canned' analyses applied by bioinformatics tools to biomedical digital data objects is currently not available. Datasets2Tools is a repository indexing 31,473 canned bioinformatics analyses applied to 6,431 datasets. The Datasets2Tools repository also contains the indexing of 4,901 published bioinformatics software tools, and all the analyzed datasets. Datasets2Tools enables users to rapidly find datasets, tools, and canned analyses through an intuitive web interface, a Google Chrome extension, and an API. Furthermore, Datasets2Tools provides a platform for contributing canned analyses, datasets, and tools, as well as evaluating these digital objects according to their compliance with the findable, accessible, interoperable, and reusable (FAIR) principles. By incorporating community engagement, Datasets2Tools promotes sharing of digital resources to stimulate the extraction of knowledge from biomedical research data. Datasets2Tools is freely available from: http://amp.pharm.mssm.edu/datasets2tools.",
            "authors": [
                "Torre D.",
                "Krawczuk P.",
                "Jagodnik K.M.",
                "Lachmann A.",
                "Wang Z.",
                "Wang L.",
                "Kuleshov M.V.",
                "Ma'Ayan A."
            ],
            "cit_count": 3,
            "doi": "10.1038/sdata.2018.23",
            "journal": "Scientific Data",
            "title": "Datasets2Tools, repository and search engine for bioinformatics datasets, tools and canned analyses",
            "year": "2018-02-27"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:datasets2tools",
        "biotoolsID": "datasets2tools",
        "description": "Repository and search engine for bioinformatics datasets, tools and canned analyses.",
        "homepage": "http://amp.pharm.mssm.edu/datasets2tools/",
        "name": "Datasets2Tools"
    }
}