{
    "additionDate": "2022-06-26T15:30:29.846447Z",
    "biotoolsCURIE": "biotools:geva",
    "biotoolsID": "geva",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mdorn@inf.ufrgs.br",
            "name": "Marcio Dorn"
        },
        {
            "name": "Itamar José Guimarães Nunes"
        }
    ],
    "description": "A R package to evaluate variations in differential expression in multiple biological conditions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sbcblab/geva",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-26T15:30:29.849248Z",
    "name": "GEVA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.JBI.2022.104053",
            "metadata": {
                "abstract": "© 2022 Elsevier Inc.Nowadays, there are thousands of publicly available gene expression datasets which can be analyzed in silico using specialized software or the R programming language. However, transcriptomic studies consider experimental conditions individually, giving one independent result per comparison. Here we describe the Gene Expression Variation Analysis (GEVA), a new R package that accepts multiple differential expression analysis results as input and performs multiple statistical steps, such as weighted summarization, quantiles partition, and clustering to find genes whose differential expression varied less across all experiments. The experimental conditions can be divided into groups, which we call factors, where additional ANOVA (Fisher's and Levene's) tests are applied to identify differentially expressed genes in response either specifically to one factor or dependently to all factors. The final results present three possible classifications for relevant genes: similar, factor-dependent, and factor-specific. To validate these results subsequently to the GEVA's development, 28 transcriptomic datasets were tested using 11 different combinations of the available parameters, including several clustering, quantiles, and summarization methods. The final classifications were validated using knockout studies from different organisms, as they lack genes whose differential expression is expected. Although some of the final classifications differed depending on the parameters’ choice, the test results from the default parameters corroborated with the published experimental studies regarding the selected datasets. Thus, we conclude that GEVA can effectively find similarities between groups of biological conditions, and therefore could be a robust alternative for multiple comparison analyses.",
                "authors": [
                    {
                        "name": "David M.Z."
                    },
                    {
                        "name": "Dorn M."
                    },
                    {
                        "name": "Feltes B.C."
                    },
                    {
                        "name": "Nunes I.J.G."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "Gene Expression Variation Analysis (GEVA): A new R package to evaluate variations in differential expression in multiple biological conditions"
            },
            "pmid": "35318148"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
