{
    "additionDate": "2021-01-18T07:36:57Z",
    "biotoolsCURIE": "biotools:stackcppred",
    "biotoolsID": "stackcppred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xzeng@hnu.edu.cn",
            "name": "Xiangxiang Zeng",
            "typeEntity": "Person"
        },
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "typeEntity": "Person"
        }
    ],
    "description": "a stacking and pairwise energy content-based prediction of cell-penetrating peptides and their uptake efficiency.\n\nIdentifying Cell-Penetrating Peptides and Their Uptake Efficiency.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3901"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Excelsior511/StackCPPred",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-02-21T16:14:11Z",
    "name": "StackCPPred",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA131",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Cell-penetrating peptides (CPPs) are a vehicle for transporting into living cells pharmacologically active molecules, such as short interfering RNAs, nanoparticles, plasmid DNAs and small peptides, thus offering great potential as future therapeutics. Existing experimental techniques for identifying CPPs are time-consuming and expensive. Thus, the prediction of CPPs from peptide sequences by using computational methods can be useful to annotate and guide the experimental process quickly. Many machine learning-based methods have recently emerged for identifying CPPs. Although considerable progress has been made, existing methods still have low feature representation capabilities, thereby limiting further performance improvements. Results: We propose a method called StackCPPred, which proposes three feature methods on the basis of the pairwise energy content of the residue as follows: RECM-composition, PseRECM and RECM-DWT. These features are used to train stacking-based machine learning methods to effectively predict CPPs. On the basis of the CPP924 and CPPsite3 datasets with jackknife validation, StackDPPred achieved 94.5% and 78.3% accuracy, which was 2.9% and 5.8% higher than the state-of-the-art CPP predictors, respectively. StackCPPred can be a powerful tool for predicting CPPs and their uptake efficiency, facilitating hypothesis-driven experimental design and accelerating their applications in clinical therapy.",
                "authors": [
                    {
                        "name": "Cai L."
                    },
                    {
                        "name": "Fu X."
                    },
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 27,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "StackCPPred: A stacking and pairwise energy content-based prediction of cell-penetrating peptides and their uptake efficiency"
            },
            "pmid": "32105326"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
