{"credit":[{"email":"jonathan-wren@omrf.org","name":"Jonathan D. Wren","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"jdwren@gmail.com","name":"Jonathan D. Wren","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/wrenlab/label-extraction/blob/master/README.md"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Data acquisition","uri":"http://edamontology.org/topic_3077"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"}]},"publication":[{"abstract":"© 2017 The Author(s). Background: NCBI's Gene Expression Omnibus (GEO) is a rich community resource containing millions of gene expression experiments from human, mouse, rat, and other model organisms. However, information about each experiment (metadata) is in the format of an open-ended, non-standardized textual description provided by the depositor. Thus, classification of experiments for meta-analysis by factors such as gender, age of the sample donor, and tissue of origin is not feasible without assigning labels to the experiments. Automated approaches are preferable for this, primarily because of the size and volume of the data to be processed, but also because it ensures standardization and consistency. While some of these labels can be extracted directly from the textual metadata, many of the data available do not contain explicit text informing the researcher about the age and gender of the subjects with the study. To bridge this gap, machine-learning methods can be trained to use the gene expression patterns associated with the text-derived labels to refine label-prediction confidence. Results: Our analysis shows only 26% of metadata text contains information about gender and 21% about age. In order to ameliorate the lack of available labels for these data sets, we first extract labels from the textual metadata for each GEO RNA dataset and evaluate the performance against a gold standard of manually curated labels. We then use machine-learning methods to predict labels, based upon gene expression of the samples and compare this to the text-based method. Conclusion: Here we present an automated method to extract labels for age, gender, and tissue from textual metadata and GEO data using both a heuristic approach as well as machine learning. We show the two methods together improve accuracy of label assignment to GEO samples.","authors":["Giles C.B.","Brown C.A.","Ripperger M.","Dennis Z.","Roopnarinesingh X.","Porter H.","Perz A.","Wren J.D."],"cit_count":3,"doi":"10.1186/s12859-017-1888-1","journal":"BMC Bioinformatics","title":"ALE: Automated label extraction from GEO metadata","type":"Primary","year":"2017-12-28"}],"summary":{"biotoolsCURIE":"biotools:ale","biotoolsID":"ale","description":"Automated label extraction from GEO metadata.","homepage":"https://github.com/wrenlab/label-extraction","name":"ALE"}}