{
    "additionDate": "2017-08-03T18:49:00Z",
    "biotoolsCURIE": "biotools:mcdgpa",
    "biotoolsID": "mcdgpa",
    "credit": [
        {
            "email": "xdhu@amss.ac.cn",
            "name": "Asia-Pacific Operations Research Center",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.aporc.org/"
        }
    ],
    "description": "This tool is proposed to identify disease-related genes. It is divided into three steps: module partition, genes prioritization in each disease-associated module, and rank fusion for the global ranking.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://doc.aporc.org/wiki/MCDGPA"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://doc.aporc.org/wiki/MCDGPA",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mcdgpa-modularized-candidate-disease-genes-prioritization-algorithm.html"
        }
    ],
    "name": "MCDGPA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Identifying disease genes is very important not only for better understanding of gene function and biological process but also for human medical improvement. Many computational methods have been proposed based on the similarity between all known disease genes (seed genes) and candidate genes in the entire gene interaction network. Under the hypothesis that potential disease-related genes should be near the seed genes in the network and only the seed genes that are located in the same module with the candidate genes will contribute to disease genes prediction, three modularized candidate disease gene prioritization algorithms (MCDGPAs) are proposed to identify disease-related genes. MCDGPA is divided into three steps: module partition, genes prioritization in each disease-associated module, and rank fusion for the global ranking. When applied to the prostate cancer and breast cancer network, MCDGPA significantly improves previous algorithms in terms of cross-validation and disease-related genes prediction. In addition, the improvement is robust to the selection of gene prioritization methods when implementing prioritization in each disease-associated module and module partition algorithms when implementing network partition. In this sense MCDGPA is a general framework that allows integrating many previous gene prioritization methods and improving predictive accuracy. © 2010, Mary Ann Liebert, Inc.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Yan G.-Y."
                    },
                    {
                        "name": "Liao X.-P."
                    }
                ],
                "citationCount": 20,
                "date": "2010-08-01T00:00:00Z",
                "journal": "OMICS A Journal of Integrative Biology",
                "title": "A novel candidate disease genes prioritization method based on module partition and rank fusion"
            },
            "pmid": "20726795"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        }
    ],
    "validated": 1
}