
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 Elsevier B.V.Background: Previous studies have demonstrated that analysing whisker movements and locomotion allows us to quantify the behavioural consequences of sensory, motor and cognitive deficits in rodents. Independent whisker and feet trackers exist but there is no fully-automated, open-source software and hardware solution, that measures both whisker movements and gait. New method: We present the LocoWhisk arena and new accompanying software (ARTv2) that allows the automatic detection and measurement of both whisker and gait information from high-speed video footage. Results: We demonstrate the new whisker and foot detector algorithms on high-speed video footage of freely moving small mammals, and show that whisker movement and gait measurements collected in the LocoWhisk arena are similar to previously reported values in the literature. Comparison with existing method(s): We demonstrate that the whisker and foot detector algorithms, are comparable in accuracy, and in some cases significantly better, than readily available software and manual trackers. Conclusion: The LocoWhisk system enables the collection of quantitative data from whisker movements and locomotion in freely behaving rodents. The software automatically records both whisker and gait information and provides added statistical tools to analyse the data. We hope the LocoWhisk system and software will serve as a solid foundation from which to support future research in whisker and gait analysis.",
            "authors": [
                "Gillespie D.",
                "Yap M.H.",
                "Hewitt B.M.",
                "Driscoll H.",
                "Simanaviciute U.",
                "Hodson-Tole E.F.",
                "Grant R.A."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.JNEUMETH.2019.108440",
            "journal": "Journal of Neuroscience Methods",
            "pmid": "31560929",
            "title": "Description and validation of the LocoWhisk system: Quantifying rodent exploratory, sensory and motor behaviours",
            "year": "2019-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:LocoWhisk",
        "biotoolsID": "LocoWhisk",
        "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'whisker', 'whisker gait', 'gait', 'footage' | Quantifying rodent exploratory, sensory and motor behaviours | BACKGROUND:Previous studies have demonstrated that analysing whisker movements and locomotion allows us to quantify the behavioural consequences of sensory, motor and cognitive deficits in rodents. Independent whisker and feet trackers exist but there is no fully-automated, open-source software and hardware solution, that measures both whisker movements and gait. NEW METHOD:We present the LocoWhisk arena and new accompanying software (ARTv2) that allows the automatic detection and measurement of both whisker and gait information from high-speed video footage",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31560929",
        "name": "LocoWhisk"
    }
}