{
    "accessibility": "Restricted access",
    "additionDate": "2022-09-23T13:16:43.480853Z",
    "biotoolsCURIE": "biotools:reach",
    "biotoolsID": "reach",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "krejcip@med.muni.cz",
            "name": "Pavel Krejci",
            "orcidid": "https://orcid.org/0000-0003-0618-9134",
            "typeEntity": "Person"
        }
    ],
    "description": "The ReACH registry collected clinical information from 51 pediatric ACH patients during its six years of existence, corresponding to ~ 60% of ACH patients aged 3 months to 14 years that were anticipated to live in the Czechia and Slovak Republic",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.achondroplasia-registry.cz",
    "lastUpdate": "2022-09-23T13:16:43.483437Z",
    "name": "ReACH",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S13023-022-02374-X",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Achondroplasia (ACH) is one of the most prevalent genetic forms of short-limbed skeletal dysplasia, caused by gain-of-function mutations in the receptor tyrosine kinase FGFR3. In August 2021, the C-type natriuretic peptide (CNP) analog vosoritide was approved for the treatment of ACH. A total of six other inhibitors of FGFR3 signaling are currently undergoing clinical evaluation for ACH. This progress creates an opportunity for children with ACH, who may gain early access to the treatment by entering clinical trials before the closure of their epiphyseal growth plates and cessation of growth. Pathophysiology associated with the ACH, however, demands a long observational period before admission to the interventional trial. Public patient registries can facilitate the process by identification of patients suitable for treatment and collecting the data necessary for the trial entry. Results: In 2015, we established the prospective ACH registry in the Czechia and the Slovak Republic (http://www.achondroplasia-registry.cz). Patient data is collected through pediatric practitioners and other relevant specialists. After informed consent is given, the data is entered to the online TrialDB system and stored in the Oracle 9i database. The initial cohort included 51 ACH children (average age 8.5 years, range 3 months to 14 years). The frequency of selected neurological, orthopedic, or ORL diagnoses is also recorded. In 2015–2021, a total of 89 measurements of heights, weights, and other parameters were collected. The individual average growth rate was calculated and showed values without exception in the lower decile for the appropriate age. Evidence of paternal age effect was found, with 58.7% of ACH fathers older than the general average paternal age and 43.5% of fathers older by two or more years. One ACH patient had orthopedic limb extension and one patient received growth hormone therapy. Low blood pressure or renal impairment were not found in any patient. Conclusion: The registry collected the clinical information of 51 pediatric ACH patients during its 6 years of existence, corresponding to ~ 60% of ACH patients living in the Czechia and Slovak Republic. The registry continues to collect ACH patient data with annual frequency to monitor the growth and other parameters in preparation for future therapy.",
                "authors": [
                    {
                        "name": "Krejci P."
                    },
                    {
                        "name": "Pesl M."
                    },
                    {
                        "name": "Skutkova L."
                    },
                    {
                        "name": "Strenkova J."
                    },
                    {
                        "name": "Verescakova H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Orphanet Journal of Rare Diseases",
                "title": "A registry of achondroplasia: a 6-year experience from the Czechia and Slovak Republic"
            },
            "pmcid": "PMC9205086",
            "pmid": "35710503"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
