{
    "additionDate": "2017-08-03T18:59:17Z",
    "biotoolsCURIE": "biotools:scone",
    "biotoolsID": "scone",
    "credit": [
        {
            "email": "sasthana@fas.harvard.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genetics.bwh.harvard.edu/genetics/labs/Sunyaev/index.html"
        }
    ],
    "description": "This tool reports position-specific measures of conservation.",
    "documentation": [
        {
            "type": "Terms of use",
            "url": "http://genetics.bwh.harvard.edu/scone/dist/files/HOW-TO"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                }
            ]
        }
    ],
    "homepage": "http://genetics.bwh.harvard.edu/scone/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/scone-0-61-sequence-conservation-evaluation.html"
        }
    ],
    "name": "SCONE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "One of the major goals of comparative genomics is to understand the evolutionary history of each nucleotide in the human genome sequence, and the degree to which it is under selective pressure. Ascertainment of selective constraint at nucleotide resolution is particularly important for predicting the functional significance of human genetic variation and for analyzing the sequence substructure of cis-regulatory sequences and other functional elements. Current methods for analysis of sequence conservation are focused on delineation of conserved regions comprising tens or even hundreds of consecutive nucleotides. We therefore developed a novel computational approach designed specifically for scoring evolutionary conservation at individual base-pair resolution. Our approach estimates the rate at which each nucleotide position is evolving, computes the probability of neutrality given this rate estimate, and summarizes the result in a Sequence CONservation Evaluation (SCONE) score. We computed SCONE scores in a continuous fashion across 1% of the human genome for which high-quality sequence information from up to 23 genomes are available. We show that SCONE scores are clearly correlated with the allele frequency of human polymorphisms in both coding and noncoding regions. We find that the majority of noncoding conserved nucleotides lie outside of longer conserved elements predicted by other conservation analyses, and are experiencing ongoing selection in modern humans as evident from the allele frequency spectrum of human polymorphism. We also applied SCONE to analyze the distribution of conserved nucleotides within functional regions. These regions are markedly enriched in individually conserved positions and short (<15 bp) conserved \"chunks.\" Our results collectively suggest that the majority of functionally important noncoding conserved positions are highly fragmented and reside outside of canonically defined long conserved noncoding sequences. A small subset of these fragmented positions may be identified with high confidence. © 2007 Asthana et al.",
                "authors": [
                    {
                        "name": "Asthana S."
                    },
                    {
                        "name": "Roytberg M."
                    },
                    {
                        "name": "Stamatoyannopoulos J."
                    },
                    {
                        "name": "Sunyaev S."
                    }
                ],
                "citationCount": 43,
                "date": "2007-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Analysis of sequence conservation at nucleotide resolution"
            },
            "pmid": "18166073"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}