{
    "additionDate": "2020-01-09T17:43:59Z",
    "biotoolsCURIE": "biotools:HaTSPiL",
    "biotoolsID": "HaTSPiL",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "salvatore.oliviero@iigm.it",
            "name": "Salvatore Oliviero",
            "orcidid": "https://orcid.org/0000-0002-3405-765X",
            "typeEntity": "Person"
        }
    ],
    "description": "A modular pipeline for high-throughput sequencing data analysis.\n\nHigh-throughput sequencing pipeline software.\n\nHaTSPiL is a a Python pipeline for High-Throughput Sequencing analysis. It has been designed to be used inside our laboratory, the Salvatore Oliviero lab within the HuGef institute, TO (IT). Whoever find it useful or a good starting point to develop his own pipeline is encouraged to use and hack the code",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dodomorandi/hatspil",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-07T09:21:05Z",
    "license": "MIT",
    "name": "HaTSPiL",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0222512",
            "metadata": {
                "abstract": "© 2019 Morandi et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Next generation sequencing methods are widely adopted for a large amount of scientific purposes, from pure research to health-related studies. The decreasing costs per analysis led to big amounts of generated data and to the subsequent improvement of software for the respective analyses. As a consequence, many approaches have been developed to chain different software in order to obtain reliable and reproducible workflows. However, the large range of applications for NGS approaches entails the challenge to manage many different workflows without losing reliability. Methods We here present a high-throughput sequencing pipeline (HaTSPiL), a Python-powered CLI tool designed to handle different approaches for data analysis with a high level of reliability. The software relies on the barcoding of filenames using a human readable naming convention that contains any information regarding the sample needed by the software to automatically choose different workflows and parameters. HaTSPiL is highly modular and customisable, allowing the users to extend its features for any specific need. Conclusions HaTSPiL is licensed as Free Software under the MIT license and it is available at https://github.com/dodomorandi/hatspil.",
                "authors": [
                    {
                        "name": "Anselmi F."
                    },
                    {
                        "name": "Arruga F."
                    },
                    {
                        "name": "Basile G."
                    },
                    {
                        "name": "Cereda M."
                    },
                    {
                        "name": "Deaglio S."
                    },
                    {
                        "name": "Fagioli F."
                    },
                    {
                        "name": "Incarnato D."
                    },
                    {
                        "name": "Lauria A."
                    },
                    {
                        "name": "Morandi E."
                    },
                    {
                        "name": "Oliviero S."
                    },
                    {
                        "name": "Parlato C."
                    },
                    {
                        "name": "Polignano I.L."
                    },
                    {
                        "name": "Simon L.M."
                    },
                    {
                        "name": "Tirtei E."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "HaTSPiL: A modular pipeline for high throughput sequencing data analysis"
            },
            "pmcid": "PMC6793853",
            "pmid": "31613890"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
