
{
    "credit": [
        {
            "email": "gorodkin@rth.dk",
            "name": "Jan Gorodkin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "backofen@informatik.uni-freiburg.de",
            "name": "Rolf Backofen",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.bioinf.uni-freiburg.de/Software/RNAscClust/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                }
            ]
        }
    ],
    "labels": {
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author. Published by Oxford University Press. All rights reserved.Motivation: Clustering RNA sequences with common secondary structure is an essential step towards studying RNA function. Whereas structural RNA alignment strategies typically identify common structure for orthologous structured RNAs, clustering seeks to group paralogous RNAs based on structural similarities. However, existing approaches for clustering paralogous RNAs, do not take the compensatory base pair changes obtained from structure conservation in orthologous sequences into account. Results: Here, we present RNAscClust, the implementation of a new algorithm to cluster a set of structured RNAs taking their respective structural conservation into account. For a set of multiple structural alignments of RNA sequences, each containing a paralog sequence included in a structural alignment of its orthologs, RNAscClust computes minimum free-energy structures for each sequence using conserved base pairs as prior information for the folding. The paralogs are then clustered using a graph kernel-based strategy, which identifies common structural features. We show that the clustering accuracy clearly benefits from an increasing degree of compensatory base pair changes in the alignments.",
            "authors": [
                "Miladi M.",
                "Junge A.",
                "Costa F.",
                "Seemann S.E.",
                "Havgaard J.H.",
                "Gorodkin J.",
                "Backofen R."
            ],
            "cit_count": 11,
            "doi": "10.1093/bioinformatics/btx114",
            "journal": "Bioinformatics",
            "title": "RNAscClust: Clustering RNA sequences using structure conservation and graph based motifs",
            "year": "2017-07-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rnascclust",
        "biotoolsID": "rnascclust",
        "description": "Clustering RNA sequences using structure conservation and graph based motifs.",
        "homepage": "http://www.bioinf.uni-freiburg.de/Software/RNAscClust/",
        "name": "RNAscClust"
    }
}