{
    "additionDate": "2017-01-13T13:13:38Z",
    "biotoolsCURIE": "biotools:barracuda",
    "biotoolsID": "barracuda",
    "credit": [
        {
            "email": "yhbl2@cam.ac.uk",
            "name": "Klus P.",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Barracuda is a high-speed sequence aligner based on BWA and uses the latest Nvidia CUDA architecture for accelerating alignments of sequence reads generated by the next-generation sequencers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://seqbarracuda.sourceforge.net/",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:36:20.031054Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "BarraCUDA",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006881"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1756-0500-5-27",
            "metadata": {
                "abstract": "Background: With the maturation of next-generation DNA sequencing (NGS) technologies, the throughput of DNA sequencing reads has soared to over 600 gigabases from a single instrument run. General purpose computing on graphics processing units (GPGPU), extracts the computing power from hundreds of parallel stream processors within graphics processing cores and provides a cost-effective and energy efficient alternative to traditional high-performance computing (HPC) clusters. In this article, we describe the implementation of BarraCUDA, a GPGPU sequence alignment software that is based on BWA, to accelerate the alignment of sequencing reads generated by these instruments to a reference DNA sequence. Findings. Using the NVIDIA Compute Unified Device Architecture (CUDA) software development environment, we ported the most computational-intensive alignment component of BWA to GPU to take advantage of the massive parallelism. As a result, BarraCUDA offers a magnitude of performance boost in alignment throughput when compared to a CPU core while delivering the same level of alignment fidelity. The software is also capable of supporting multiple CUDA devices in parallel to further accelerate the alignment throughput. Conclusions: BarraCUDA is designed to take advantage of the parallelism of GPU to accelerate the alignment of millions of sequencing reads generated by NGS instruments. By doing this, we could, at least in part streamline the current bioinformatics pipeline such that the wider scientific community could benefit from the sequencing technology. BarraCUDA is currently available from. © 2012 Klus et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Cheung M."
                    },
                    {
                        "name": "Klus P."
                    },
                    {
                        "name": "Lam B.Y.H."
                    },
                    {
                        "name": "Lam S."
                    },
                    {
                        "name": "Lyberg D."
                    },
                    {
                        "name": "McFarlane I."
                    },
                    {
                        "name": "Pullan G."
                    },
                    {
                        "name": "Yeo G.S.H."
                    }
                ],
                "citationCount": 109,
                "date": "2012-01-16T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "BarraCUDA - A fast short read sequence aligner using graphics processing units"
            },
            "pmcid": "PMC3278344",
            "pmid": "22244497"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
