{"credit":[{"name":"Instruct","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"ccisb@stfc.ac.uk","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://code.google.com/archive/p/acpype/wikis"}],"function":[{"note":"A tool based on Python to use Antechamber to generate topologies for chemical compounds and to interface with other python applications like CCPN and ARIA. It will take a PDB, MDL or MOL2 file of a small organic molecule without open valence and assign charges and forcefield parameterizations according to GAFF (Generalised Amber Force Field).","operation":[{"term":"Structure analysis","uri":"http://edamontology.org/operation_2480"}]}],"labels":{"collectionID":["Instruct"],"cost":"Free of charge","language":["Python"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Structural biology","uri":"http://edamontology.org/topic_1317"},{"term":"NMR","uri":"http://edamontology.org/topic_0593"}]},"publication":[{"abstract":"Background: ACPYPE (or AnteChamber PYthon Parser interfacE) is a wrapper script around the ANTECHAMBER software that simplifies the generation of small molecule topologies and parameters for a variety of molecular dynamics programmes like GROMACS, CHARMM and CNS. It is written in the Python programming language and was developed as a tool for interfacing with other Python based applications such as the CCPN software suite (for NMR data analysis) and ARIA (for structure calculations from NMR data). ACPYPE is open source code, under GNU GPL v3, and is available as a stand-alone application at http://www.ccpn.ac.uk/acpype and as a web portal application at. Findings. We verified the topologies generated by ACPYPE in three ways: by comparing with default AMBER topologies for standard amino acids; by generating and verifying topologies for a large set of ligands from the PDB; and by recalculating the structures for 5 protein-ligand complexes from the PDB. Conclusions: ACPYPE is a tool that simplifies the automatic generation of topology and parameters in different formats for different molecular mechanics programmes, including calculation of partial charges, while being object oriented for integration with other applications. © 2012 da Silva and Vranken; licensee BioMed Central Ltd.","authors":["Sousa Da Silva A.W.","Vranken W.F."],"cit_count":479,"doi":"10.1186/1756-0500-5-367","journal":"BMC Research Notes","title":"ACPYPE - AnteChamber PYthon Parser interfacE","type":"Primary","year":"2012-08-27"}],"summary":{"biotoolsCURIE":"biotools:acpype","biotoolsID":"acpype","description":"A tool based on Python to use Antechamber to generate topologies for chemical compounds and to interface with others python applications like CCPN tools or ARIA.","homepage":"http://code.google.com/p/acpype/","name":"ACPYPE","version":["1"]}}