
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://babylone.ulb.ac.be/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://babylone.ulb.ac.be/autoosc/v0.1/AutooscDoc.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Mathematica"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Computational biology",
                "uri": "http://edamontology.org/topic_3307"
            },
            {
                "term": "Applied mathematics",
                "uri": "http://edamontology.org/topic_3569"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/autoosc-automated-analysis-of-biological-oscillator-models-using-mode-decomposition.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Oscillating signals produced by biological systems have shapes, described by their Fourier spectra, that can potentially reveal the mechanisms that generate them. Extracting this information from measured signals is interesting for the validation of theoretical models, discovery and classification of interaction types, and for optimal experiment design. Results: An automated workflow is described for the analysis of oscillating signals. A software package is developed to match signal shapes to hundreds of a priori viable model structures defined by a class of first-order differential equations. The package computes parameter values for each model by exploiting the mode decomposition of oscillating signals and formulating the matching problem in terms of systems of simultaneous polynomial equations. On the basis of the computed parameter values, the software returns a list of models consistent with the data. In validation tests with synthetic datasets, it not only shortlists those model structures used to generate the data but also shows that excellent fits can sometimes be achieved with alternative equations. The listing of all consistent equations is indicative of how further invalidation might be achieved with additional information. When applied to data from a microarray experiment on mice, the procedure finds several candidate model structures to describe interactions related to the circadian rhythm. This shows that experimental data on oscillators is indeed rich in information about gene regulation mechanisms. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Konopka T."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "21317138",
            "title": "Automated analysis of biological oscillator models using mode decomposition",
            "year": "2011-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:autoosc",
        "biotoolsID": "autoosc",
        "description": "Mathematica package for analyzing time-series of oscillatory signals, particularly those originating from biological/chemical systems.",
        "homepage": "http://babylone.ulb.ac.be/autoosc/",
        "name": "Autoosc"
    }
}