{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T20:31:25.147022Z",
    "biotoolsCURIE": "biotools:portiloop",
    "biotoolsID": "portiloop",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yann.bouteiller@polymtl.ca",
            "name": "Yann Bouteiller",
            "orcidid": "https://orcid.org/0000-0002-1390-6392",
            "typeEntity": "Person"
        },
        {
            "name": "Milo Sobral",
            "orcidid": "https://orcid.org/0000-0002-7213-5970"
        },
        {
            "name": "Nicolas Valenchon",
            "orcidid": "https://orcid.org/0000-0003-4439-3398"
        },
        {
            "name": "Xavier L’Heureux",
            "orcidid": "https://orcid.org/0000-0002-5919-5397"
        }
    ],
    "description": "A deep learning-based open science tool for closed-loop brain stimulation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Portiloop",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-09T20:31:25.149707Z",
    "license": "Not licensed",
    "name": "Portiloop",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0270696",
            "metadata": {
                "abstract": "Copyright: © 2022 Valenchon et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Closed-loop brain stimulation refers to capturing neurophysiological measures such as electroencephalography (EEG), quickly identifying neural events of interest, and producing auditory, magnetic or electrical stimulation so as to interact with brain processes precisely. It is a promising new method for fundamental neuroscience and perhaps for clinical applications such as restoring degraded memory function; however, existing tools are expensive, cumbersome, and offer limited experimental flexibility. In this article, we propose the Portiloop, a deep learning-based, portable and low-cost closed-loop stimulation system able to target specific brain oscillations. We first document open-hardware implementations that can be constructed from commercially available components. We also provide a fast, lightweight neural network model and an exploration algorithm that automatically optimizes the model hyperparameters to the desired brain oscillation. Finally, we validate the technology on a challenging test case of real-time sleep spindle detection, with results comparable to off-line expert performance on the Massive Online Data Annotation spindle dataset (MODA; group consensus). Software and plans are available to the community as an open science initiative to encourage further development and advance closed-loop neuroscience research [https://github.com/Portiloop].",
                "authors": [
                    {
                        "name": "Beltrame G."
                    },
                    {
                        "name": "Bouteiller Y."
                    },
                    {
                        "name": "Coffey E.B.J."
                    },
                    {
                        "name": "Jourde H.R."
                    },
                    {
                        "name": "L'Heureux X."
                    },
                    {
                        "name": "Sobral M."
                    },
                    {
                        "name": "Valenchon N."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "The Portiloop: A deep learning-based open science tool for closed-loop brain stimulation"
            },
            "pmcid": "PMC9394839",
            "pmid": "35994482"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
