{
    "additionDate": "2019-05-06T08:11:04Z",
    "biotoolsCURIE": "biotools:ClinPred",
    "biotoolsID": "ClinPred",
    "credit": [
        {
            "email": "jacek.majewski@mcgill.ca",
            "name": "Jacek Majewski",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "najmeh.alirezaie@mail.mcgill.ca",
            "name": "Najmeh Alirezaie",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Efficient tool for identifying disease-relevant nonsynonymous single nucleotide variants.",
    "download": [
        {
            "note": "ClinPred Scores",
            "type": "Other",
            "url": "https://drive.google.com/uc?export=download&id=1j6bD72XG-8kgWVvGrwHPdp4nFP4ls8Mq"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Pathogenicity prediction",
                    "uri": "http://edamontology.org/operation_3461"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/clinpred/",
    "lastUpdate": "2019-06-03T13:23:05Z",
    "name": "ClinPred",
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1016/j.ajhg.2018.08.005",
            "metadata": {
                "abstract": "© 2018 American Society of Human GeneticsAdvances in high-throughput DNA sequencing have revolutionized the discovery of variants in the human genome; however, interpreting the phenotypic effects of those variants is still a challenge. While several computational approaches to predict variant impact are available, their accuracy is limited and further improvement is needed. Here, we introduce ClinPred, an efficient tool for identifying disease-relevant nonsynonymous variants. Our predictor incorporates two machine learning algorithms that use existing pathogenicity scores and, notably, benefits from inclusion of normal population allele frequency from the gnomAD database as an input feature. Another major strength of our approach is the use of ClinVar—a rapidly growing database that allows selection of confidently annotated disease-causing variants—as a training set. Compared to other methods, ClinPred showed superior accuracy for predicting pathogenicity, achieving the highest area under the curve (AUC) score and increasing both the specificity and sensitivity in different test datasets. It also obtained the best performance according to various other metrics. Moreover, ClinPred performance remained robust with respect to disease type (cancer or rare disease) and mechanism (gain or loss of function). Importantly, we observed that adding allele frequency as a predictive feature—as opposed to setting fixed allele frequency cutoffs—boosts the performance of prediction. We provide pre-computed ClinPred scores for all possible human missense variants in the exome to facilitate its use by the community.",
                "authors": [
                    {
                        "name": "Alirezaie N."
                    },
                    {
                        "name": "Hartley T."
                    },
                    {
                        "name": "Hocking T.D."
                    },
                    {
                        "name": "Kernohan K.D."
                    },
                    {
                        "name": "Majewski J."
                    }
                ],
                "citationCount": 42,
                "date": "2018-10-04T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "ClinPred: Prediction Tool to Identify Disease-Relevant Nonsynonymous Single-Nucleotide Variants"
            },
            "pmcid": "PMC6174354",
            "pmid": "30220433",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}
