{
    "additionDate": "2021-01-18T08:36:49Z",
    "biotoolsCURIE": "biotools:rat",
    "biotoolsID": "rat",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "alexxai@wustl.edu",
            "name": "Alexxai V. Kravitz",
            "orcidid": "https://orcid.org/0000-0001-5983-0218",
            "typeEntity": "Person"
        }
    ],
    "description": "A Machine Vision Rodent Tracking Camera and Closed Loop Control System.\n\nRAT is a low-cost system to track and report mouse activity while they are contained in a simple arena. The system uses an OpenMV M7 microcontroller to acquire images of the arena and process them in real-time to report mouse centroid data to a text file. This data can be used as a measure of mouse movement (i.e speed and distance traveled) for various activity studies. This project is currently ongoing as we test and perfect the prototypes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://hackaday.io/project/162481-rodent-arena-tracker-rat",
    "lastUpdate": "2021-02-03T15:25:29Z",
    "name": "RAT",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1523/ENEURO.0485-19.2020",
            "metadata": {
                "abstract": "© 2020 Krynitsky et al.Video tracking is an essential tool in rodent research. Here, we demonstrate a machine vision rodent tracking camera based on a low-cost, open-source, machine vision camera, the OpenMV Cam M7. We call our device the rodent arena tracker (RAT), and it is a pocket-sized machine vision-based position tracker. The RAT does not require a tethered computer to operate and costs about $120 per device to build. These features make the RAT scalable to large installations and accessible to research institutions and educational set-tings where budgets may be limited. The RAT processes incoming video in real-time at 15 Hz and saves x and y positional information to an onboard microSD card. The RAT also provides a programmable multi-function input/output pin that can be used for controlling other equipment, transmitting tracking information in real time, or receiving data from other devices. Finally, the RAT includes a real-time clock (RTC) for accurate time stamping of data files. Real-time image processing averts the need to save video, greatly re-ducing storage, data handling, and communication requirements. To demonstrate the capabilities of the RAT, we performed three validation studies: (1) a 4-d experiment measuring circadian activity patterns; (2) logging of mouse positional information alongside status information from a pellet dispensing device; and (3) control of an optogenetic stimulation system for a real-time place preference (RTPP) brain stimulation reinforcement study. Our design files, build instructions, and code for the RAT implementation are open source and freely available online to facilitate dissemination and further development of the RAT.",
                "authors": [
                    {
                        "name": "Garmendia-Cedillos M."
                    },
                    {
                        "name": "Kravitz A.V."
                    },
                    {
                        "name": "Krynitsky J."
                    },
                    {
                        "name": "Legaria A.A."
                    },
                    {
                        "name": "Pai J.J."
                    },
                    {
                        "name": "Pohida T."
                    },
                    {
                        "name": "Salem G."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "eNeuro",
                "title": "Rodent arena tracker (Rat): A machine vision rodent tracking camera and closed loop control system"
            },
            "pmcid": "PMC7221356",
            "pmid": "32284342"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
