{"credit":[],"function":[{"operation":[{"term":"Protein identification","uri":"http://edamontology.org/operation_3767"},{"term":"Literature search","uri":"http://edamontology.org/operation_0305"},{"term":"Peptide database search","uri":"http://edamontology.org/operation_3646"}]}],"labels":{"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Plant biology","uri":"http://edamontology.org/topic_0780"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Infectious disease","uri":"http://edamontology.org/topic_3324"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"}]},"publication":[{"abstract":"© 2019, Springer-Verlag GmbH Austria, part of Springer Nature.Emerging infectious diseases (EIDs) are a severe problem caused by fungi in human and plant species across the world. They pose a worldwide threat to food security as well as human health. Fungal infections are increasing now day by day worldwide, and the current antimycotic drugs are not effective due to the emergence of resistant strains. Therefore, it is an urgent need for the finding of new plant-origin antifungal peptides (PhytoAFPs). Huge numbers of peptides were extracted from different plant species which play a protective role against fungal infection. Hundreds of plant-origin peptides with antifungal activity have already been reported. So there is a requirement of a dedicated platform which systematically catalogs plant-origin peptides along with their antifungal properties. PlantAFP database is a resource of experimentally verified plant-origin antifungal peptides, collected from research articles, patents, and public databases. The current release of PlantAFP database contains 2585 peptide entries among which 510 are unique peptides. Each entry provides comprehensive information of a peptide that includes its peptide sequence, peptide name, peptide class, length of the peptide, molecular mass, antifungal activity, and origin of peptides. Besides this primary information, PlantAFP stores peptide sequences in SMILES format. In order to facilitate the user, many tools have been integrated into this database that includes BLAST search, peptide search, SMILES search, and peptide-mapping is also included in the database. PlantAFP database is accessible at http://bioinformatics.cimap.res.in/sharma/PlantAFP/.","authors":["Tyagi A.","Pankaj V.","Singh S.","Roy S.","Semwal M.","Shasany A.K.","Sharma A."],"cit_count":0,"doi":"10.1007/S00726-019-02792-5","journal":"Amino Acids","pmid":"31612325","title":"PlantAFP: a curated database of plant-origin antifungal peptides","year":"2019-11-01"}],"summary":{"biotoolsCURIE":"biotools:PlantAFP","biotoolsID":"PlantAFP","description":"a curated database of plant-origin antifungal peptides.\n\nEmerging infectious diseases (EIDs) are a severe problem caused by fungi in human and plant species across the world. They pose a worldwide threat to food security as well as human health. Fungal infections are increasing now day by day worldwide, and the current antimycotic drugs are not effective due to the emergence of resistant strains. Therefore, it is an urgent need for the finding of new plant-origin antifungal peptides (PhytoAFPs). Huge numbers of peptides were extracted from different plant species which play a protective role against fungal infection. Hundreds of plant-origin peptides with antifungal activity have already been reported. So there is a requirement of a dedicated platform which systematically catalogs plant-origin peptides along with their antifungal properties.\n\n||| HOMEPAGE BROKEN!","homepage":"http://bioinformatics.cimap.res.in/sharma/PlantAFP/","name":"PlantAFP"}}