{
    "additionDate": "2021-01-18T11:33:59Z",
    "biotoolsCURIE": "biotools:elp",
    "biotoolsID": "elp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liping.liu@tufts.edu",
            "name": "Li-Ping Liu",
            "typeEntity": "Person"
        },
        {
            "email": "soha.hassoun@tufts.edu",
            "name": "Soha Hassoun",
            "typeEntity": "Person"
        }
    ],
    "description": "Enzymatic link prediction (ELP) is a tool for predicting the likelihood of an enzymatic transformation between two molecules. ELP models enzymatic reactions cataloged in the KEGG database as a graph.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HassounLab/ELP",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-03-05T16:35:27Z",
    "name": "ELP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA881",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Motivation: The complete characterization of enzymatic activities between molecules remains incomplete, hindering biological engineering and limiting biological discovery. We develop in this work a technique, enzymatic link prediction (ELP), for predicting the likelihood of an enzymatic transformation between two molecules. ELP models enzymatic reactions cataloged in the KEGG database as a graph. ELP is innovative over prior works in using graph embedding to learn molecular representations that capture not only molecular and enzymatic attributes but also graph connectivity. Results: We explore transductive (test nodes included in the training graph) and inductive (test nodes not part of the training graph) learning models. We show that ELP achieves high AUC when learning node embeddings using both graph connectivity and node attributes. Further, we show that graph embedding improves link prediction by 30% in area under curve over fingerprint-based similarity approaches and by 8% over support vector machines. We compare ELP against rule-based methods. We also evaluate ELP for predicting links in pathway maps and for reconstruction of edges in reaction networks of four common gut microbiota phyla: Actinobacteria, bacteroidetes, firmicutes and proteobacteria. To emphasize the importance of graph embedding in the context of biochemical networks, we illustrate how graph embedding can guide visualization.",
                "authors": [
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Liu L.-P."
                    },
                    {
                        "name": "Hassoun S."
                    }
                ],
                "date": "2021-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Learning graph representations of biochemical networks and its application to enzymatic link prediction"
            },
            "pmid": "33051674"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}