{
    "additionDate": "2019-11-14T19:38:56Z",
    "biotoolsCURIE": "biotools:HybridMolDB",
    "biotoolsID": "HybridMolDB",
    "confidence_flag": "high",
    "description": "A Manually Curated Database Dedicated to Hybrid Molecules for Chemical Biology and Drug Discovery | Hybrid Molecules is defined as the design of new chemical molecule that hybridizes two or more pharmacophoric moieties from known identical or non-identical bioactive molecules, or two or more known identical or non-identical bioactive molecules directly into a single molecule to obtain better affinity and efficacy or to improve the properties of the parent molecules or to interact with two or multiple targets or to reduce undesirable side effects or to decrease in drug-drug interactions or reduce emergence of drug resistance | Hybrid Molecule Database (HybridMolDB) provides a versatile resource for the display, search, and analysis of the structure, manual-annotated design protocol, the pharmacological data, some physicochemical and ligand efficiency and druglike and ADMET characteristics and the proﬁle of targets of the well-known hybrid molecules",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Rigid body refinement",
                    "uri": "http://edamontology.org/operation_3456"
                },
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                }
            ]
        }
    ],
    "homepage": "http://www.idruglab.com/HybridMolDB/index.php",
    "lastUpdate": "2019-11-14T19:38:56Z",
    "name": "HybridMolDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00314",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Hybrid-molecule-based drug design is the combination of two or more bioactive molecules into a single chemical entity. This strategy may be used to achieve better affinity and efficacy or improved properties compared with the parent molecules, to interact with two or multiple targets, to reduce undesirable side effects, to decrease drug-drug interactions, or to reduce the emergence of drug resistance. The approach offers the prospect of better drugs for the treatment of many human diseases. Research activity in this area is increasing and has attracted many practitioners worldwide. To accelerate the design and discovery of new hybrid-molecule-based drugs, it is essential to properly collect and annotate experimental data obtained from known hybrid molecules. To address this need, we have developed HybridMolDB (http://www.idruglab.com/HybridMolDB/index.php), a manually curated database dedicated to hybrid molecules for chemical biology and drug discovery. It contains structures, manually annotated design protocols, pharmacological data, some physicochemical properties, ligand efficiency, drug-likeness, and ADMET characteristics, and the biological targets of known hybrid molecules. HybridMolDB supports a range of query types, including searches by text, protein sequence, chemical structure similarity, and property ranges. The database serves as an open source facilitating the development and/or optimization of related in silico tools for the design and discovery of hybrid-molecule-based drugs and chemical probes.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhao C."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhai S."
                    },
                    {
                        "name": "Wei B."
                    },
                    {
                        "name": "Wang L."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "HybridMolDB: A Manually Curated Database Dedicated to Hybrid Molecules for Chemical Biology and Drug Discovery"
            },
            "pmid": "31524396"
        }
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ]
}