{
    "additionDate": "2017-08-03T18:59:44Z",
    "biotoolsCURIE": "biotools:sisrs",
    "biotoolsID": "sisrs",
    "credit": [
        {
            "email": "Rachel.Schwartz@asu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://proteus.biodesign.asu.edu/"
        }
    ],
    "description": "Novel method to rapidly obtain homologous genomic data for phylogenetics directly from next-generation sequencing reads without the use of a reference genome.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/rachelss/SISRS"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (from molecular sequences)",
                    "uri": "http://edamontology.org/operation_0540"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rachelss/SISRS",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/sisrs-site-identification-from-short-read-sequences.html"
        }
    ],
    "name": "SISRS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Schwartz et al. Background: Improvements in sequencing technology now allow easy acquisition of large datasets; however, analyzing these data for phylogenetics can be challenging. We have developed a novel method to rapidly obtain homologous genomic data for phylogenetics directly from next-generation sequencing reads without the use of a reference genome. This software, called SISRS, avoids the time consuming steps of de novo whole genome assembly, multiple genome alignment, and annotation. Results: For simulations SISRS is able to identify large numbers of loci containing variable sites with phylogenetic signal. For genomic data from apes, SISRS identified thousands of variable sites, from which we produced an accurate phylogeny. Finally, we used SISRS to identify phylogenetic markers that we used to estimate the phylogeny of placental mammals. We recovered eight phylogenies that resolved the basal relationships among mammals using datasets with different levels of missing data. The three alternate resolutions of the basal relationships are consistent with the major hypotheses for the relationships among mammals, all of which have been supported previously by different molecular datasets. Conclusions: SISRS has the potential to transform phylogenetic research. This method eliminates the need for expensive marker development in many studies by using whole genome shotgun sequence data directly.",
                "authors": [
                    {
                        "name": "Schwartz R.S."
                    },
                    {
                        "name": "Harkins K.M."
                    },
                    {
                        "name": "Stone A.C."
                    },
                    {
                        "name": "Cartwright R.A."
                    }
                ],
                "citationCount": 5,
                "date": "2015-06-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A composite genome approach to identify phylogenetically informative data from next-generation sequencing"
            },
            "pmid": "26062548"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}