{
    "additionDate": "2021-01-18T08:00:20Z",
    "biotoolsCURIE": "biotools:campp",
    "biotoolsID": "campp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elenap@cancer.dk",
            "name": "Elena Papaleo",
            "orcidid": "https://orcid.org/0000-0002-7376-5894",
            "typeEntity": "Person"
        }
    ],
    "description": "CAncer bioMarker Prediction Pipeline (CAMPP) is a standardized framework for the analysis of quantitative biological data",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/ELELAB/CAncer-bioMarker-Prediction-Pipeline-CAMPP/blob/master/CAMPPManual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ELELAB/CAncer-bioMarker-Prediction-Pipeline-CAMPP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-06T21:29:30Z",
    "license": "Apache-2.0",
    "name": "CAMPP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007665",
            "metadata": {
                "abstract": "© 2020 Terkelsen et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.With the improvement of -omics and next-generation sequencing (NGS) methodologies, along with the lowered cost of generating these types of data, the analysis of high-throughput biological data has become standard both for forming and testing biomedical hypotheses. Our knowledge of how to normalize datasets to remove latent undesirable variances has grown extensively, making for standardized data that are easily compared between studies. Here we present the CAncer bioMarker Prediction Pipeline (CAMPP), an opensource R-based wrapper (https://github.com/ELELAB/CAncer-bioMarker-Prediction- Pipeline -CAMPP) intended to aid bioinformatic software-users with data analyses. CAMPP is called from a terminal command line and is supported by a user-friendly manual. The pipeline may be run on a local computer and requires little or no knowledge of programming. To avoid issues relating to R-package updates, a renv .lock file is provided to ensure R-package stability. Data-management includes missing value imputation, data normalization, and distributional checks. CAMPP performs (I) k-means clustering, (II) differential expression/ abundance analysis, (III) elastic-net regression, (IV) correlation and co-expression network analyses, (V) survival analysis, and (VI) protein-protein/miRNA-gene interaction networks. The pipeline returns tabular files and graphical representations of the results. We hope that CAMPP will assist in streamlining bioinformatic analysis of quantitative biological data, whilst ensuring an appropriate bio-statistical framework.",
                "authors": [
                    {
                        "name": "Krogh A."
                    },
                    {
                        "name": "Papaleo E."
                    },
                    {
                        "name": "Terkelsen T."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "CAncer bioMarker Prediction Pipeline (CAMPP) - A standardized framework for the analysis of quantitative biological data"
            },
            "pmcid": "PMC7108742",
            "pmid": "32176694"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
