{
    "accessibility": "Open access",
    "additionDate": "2023-11-10T15:27:14.815451Z",
    "biotoolsCURIE": "biotools:tfbminer",
    "biotoolsID": "tfbminer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "erik.hanko@manchester.ac.uk",
            "name": "Erik K. R. Hanko",
            "orcidid": "https://orcid.org/0000-0002-2850-7773",
            "typeEntity": "Person"
        }
    ],
    "description": "User-friendly command line tool for the rapid mining of transcription factor-based biosensors.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Compound ID (KEGG)",
                        "uri": "http://edamontology.org/data_2605"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Transcription factor identifier",
                        "uri": "http://edamontology.org/data_1077"
                    }
                }
            ]
        }
    ],
    "homepage": "https://github.com/UoMMIB/TFBMiner",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:31:49.161201Z",
    "license": "MIT",
    "name": "TFBMiner",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acssynbio.2c00679",
            "metadata": {
                "abstract": "Transcription factors responsive to small molecules are essential elements in synthetic biology designs. They are often used as genetically encoded biosensors with applications ranging from the detection of environmental contaminants and biomarkers to microbial strain engineering. Despite our efforts to expand the space of compounds that can be detected using biosensors, the identification and characterization of transcription factors and their corresponding inducer molecules remain labor- and time-intensive tasks. Here, we introduce TFBMiner, a new data mining and analysis pipeline that enables the automated and rapid identification of putative metabolite-responsive transcription factor-based biosensors (TFBs). This user-friendly command line tool harnesses a heuristic rule-based model of gene organization to identify both gene clusters involved in the catabolism of user-defined molecules and their associated transcriptional regulators. Ultimately, biosensors are scored based on how well they fit the model, providing wet-lab scientists with a ranked list of candidates that can be experimentally tested. We validated the pipeline using a set of molecules for which TFBs have been reported previously, including sensors responding to sugars, amino acids, and aromatic compounds, among others. We further demonstrated the utility of TFBMiner by identifying a biosensor for S-mandelic acid, an aromatic compound for which a responsive transcription factor had not been found previously. Using a combinatorial library of mandelate-producing microbial strains, the newly identified biosensor was able to distinguish between low- and high-producing strain candidates. This work will aid in the unraveling of metabolite-responsive microbial gene regulatory networks and expand the synthetic biology toolbox to allow for the construction of more sophisticated self-regulating biosynthetic pathways.",
                "authors": [
                    {
                        "name": "Breitling R."
                    },
                    {
                        "name": "Hanko E.K.R."
                    },
                    {
                        "name": "Joosab Noor Mahomed T.A."
                    },
                    {
                        "name": "Stoney R.A."
                    }
                ],
                "citationCount": 8,
                "date": "2023-05-19T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "TFBMiner: A User-Friendly Command Line Tool for the Rapid Mining of Transcription Factor-Based Biosensors"
            },
            "pmcid": "PMC10204090",
            "pmid": "37053505",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
