{
    "accessibility": "Open access",
    "additionDate": "2022-12-21T22:14:16.979480Z",
    "biotoolsCURIE": "biotools:rascall",
    "biotoolsID": "rascall",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Jimmy.Breen@telethonkids.org.au",
            "name": "James Breen",
            "orcidid": "https://orcid.org/0000-0001-6184-0925",
            "typeEntity": "Person"
        },
        {
            "name": "Jacqueline Rehn"
        },
        {
            "name": "Chelsea Mayoh",
            "orcidid": "https://orcid.org/0000-0002-6398-3046"
        },
        {
            "name": "Laura N Eadie",
            "orcidid": "https://orcid.org/0000-0003-1912-7602"
        }
    ],
    "description": "Rapid (Ra) screening (Sc) of RNA-seq data for prognostically significant genomic alterations in acute lymphoblastic leukaemia (ALL).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deletion detection",
                    "uri": "http://edamontology.org/operation_3962"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/j-rehn/RaScALL",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-12-21T22:14:16.982104Z",
    "license": "AGPL-3.0",
    "name": "RaScALL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PGEN.1010300",
            "metadata": {
                "abstract": "Copyright: © 2022 Rehn et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.RNA-sequencing (RNA-seq) efforts in acute lymphoblastic leukaemia (ALL) have identified numerous prognostically significant genomic alterations which can guide diagnostic risk stratification and treatment choices when detected early. However, integrating RNA-seq in a clinical setting requires rapid detection and accurate reporting of clinically relevant alterations. Here we present RaScALL, an implementation of the k-mer based variant detection tool km, capable of identifying more than 100 prognostically significant lesions observed in ALL, including gene fusions, single nucleotide variants and focal gene deletions. We compared genomic alterations detected by RaScALL and those reported by alignment-based de novo variant detection tools in a study cohort of 180 Australian patient samples. Results were validated using 100 patient samples from a published North American cohort. RaScALL demonstrated a high degree of accuracy for reporting subtype defining genomic alterations. Gene fusions, including difficult to detect fusions involving EPOR and DUX4, were accurately identified in 98% of reported cases in the study cohort (n = 164) and 95% of samples (n = 63) in the validation cohort. Pathogenic sequence variants were correctly identified in 75% of tested samples, including all cases involving subtype defining variants PAX5 p. P80R (n = 12) and IKZF1 p.N159Y (n = 4). Intragenic IKZF1 deletions resulting in aberrant transcript isoforms were also detectable with 98% accuracy. Importantly, the median analysis time for detection of all targeted alterations averaged 22 minutes per sample, significantly shorter than standard alignment-based approaches. The application of RaScALL enables rapid identification and reporting of previously identified genomic alterations of known clinical relevance.",
                "authors": [
                    {
                        "name": "Breen J."
                    },
                    {
                        "name": "Cowley M.J."
                    },
                    {
                        "name": "Eadie L.N."
                    },
                    {
                        "name": "Heatley S.L."
                    },
                    {
                        "name": "Mayoh C."
                    },
                    {
                        "name": "McClure B.J."
                    },
                    {
                        "name": "Rehn J."
                    },
                    {
                        "name": "Schutz C."
                    },
                    {
                        "name": "White D.L."
                    },
                    {
                        "name": "Yeung D.T."
                    }
                ],
                "date": "2022-10-17T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "RaScALL: Rapid (Ra) screening (Sc) of RNA-seq data for prognostically significant genomic alterations in acute lymphoblastic leukaemia (ALL)"
            },
            "pmcid": "PMC9612819",
            "pmid": "36251721"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ]
}
