{
    "additionDate": "2019-11-14T19:36:56Z",
    "biotoolsCURIE": "biotools:CCBGpipe",
    "biotoolsID": "CCBGpipe",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Yu-Chieh Liao",
            "typeEntity": "Person"
        },
        {
            "email": "frchen@nhri.org.tw",
            "name": "Feng-Jui Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "Completing Circular Bacterial Genomes With Assembly Complexity by Using a Sampling Strategy From a Single MinION Run With Barcoding | A pipeline for completing circular bacterial genomes using a sampling strategy | Since CCBGpipe implements many analytical tools, we strongly recommend you to run it with Docker. Alternatively, you can install all dependencies as listed in the Installation section | This pipeline is designed to complete circular bacterial genomes using a sampling strategy from a sinlge MinION with barcoding",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jade-nhri/CCBGpipe",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T14:07:59Z",
    "license": "GPL-3.0",
    "name": "CCBGpipe",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FMICB.2019.02068",
            "metadata": {
                "abstract": "© Copyright © 2019 Liao, Cheng, Wu, Kuo, Lauderdale and Chen.The Oxford Nanopore MinION is an affordable and portable DNA sequencer that can produce very long reads (tens of kilobase pairs), which enable de novo bacterial genome assembly. Although many algorithms and tools have been developed for base calling, read mapping, de novo assembly, and polishing, an automated pipeline is not available for one-stop analysis for circular bacterial genome reconstruction. In this paper, we present the pipeline CCBGpipe for completing circular bacterial genomes. Raw current signals are demultiplexed and base called to generate sequencing data. Sequencing reads are de novo assembled several times by using a sampling strategy to produce circular contigs that have a sequence in common between their start and end. The circular contigs are polished by using raw signals and sequencing reads; then, duplicated sequences are removed to form a linear representation of circular sequences. The circularized contigs are finally rearranged to start at the start position of dnaA/repA or a replication origin based on the GC skew. CCBGpipe implemented in Python is available at https://github.com/jade-nhri/CCBGpipe. Using sequencing data produced from a single MinION run, we obtained 48 circular sequences, comprising 12 chromosomes and 36 plasmids of 12 bacteria, including Acinetobacter nosocomialis, Acinetobacter pittii, and Staphylococcus aureus. With adequate quantities of sequencing reads (80×), CCBGpipe can provide a complete and automated assembly of circular bacterial genomes.",
                "authors": [
                    {
                        "name": "Liao Y.-C."
                    },
                    {
                        "name": "Cheng H.-W."
                    },
                    {
                        "name": "Wu H.-C."
                    },
                    {
                        "name": "Kuo S.-C."
                    },
                    {
                        "name": "Lauderdale T.-L.Y."
                    },
                    {
                        "name": "Chen F.-J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-09-04T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "Completing Circular Bacterial Genomes With Assembly Complexity by Using a Sampling Strategy From a Single MinION Run With Barcoding"
            },
            "pmcid": "PMC6737777",
            "pmid": "31551994"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}