{
    "additionDate": "2020-01-09T17:41:43Z",
    "biotoolsCURIE": "biotools:ATBdiscrimination",
    "biotoolsID": "ATBdiscrimination",
    "confidence_flag": "tool",
    "description": "An in Silico Tool for Identification of Active Tuberculosis Disease Based on Routine Blood Test and T-SPOT.TB Detection Results.\n\nWelcome to ATB assistant discrimination!.\n\nHome Document Datasets Contact Us.\n\nApproximately one third of the world's population is infection with Mycobacterium tuberculosis. They are at a high risk progression to active tuberculosis (ATB) during their lifetime, so it is urgent and vital to develop diagnostic methods that can distinguish ATB from latent tuberculosis infection.\n\nPlease input single sample data in the text form:.\n\nPlease Cite: Jiangpeng Wu, Jun Bai, Wei Wang, Lili Xi, Pengyi Zhang, Jingfeng Lan, Liansheng Zhang*, Shuyan Li*. ATBdiscrimination: An in Silico Tool for Identification of Active Tuberculosis Disease Based on Routine Blood Test and T-SPOT.TB Detection Results. J. Chem. Inf. Model., 2019, doi: 10.1021/acs.jcim.9b00678",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://lishuyan.lzu.edu.cn/ATB/ATBdiscrimination.html",
    "lastUpdate": "2020-12-02T15:46:49Z",
    "name": "ATBdiscrimination",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00678",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Tuberculosis remains one of the deadliest infectious diseases worldwide. Only 5-15% of people infected with Mycobacterium tuberculosis develop active TB disease (ATB), while others remain latently infected (LTBI) during their lifetime, which has a completely different clinical treatment schedule. However, most current clinical diagnostic methods are based on the immune response of M. tuberculosis infections and cannot distinguish ATB from LTBIs. Thus, the rapid diagnosis of active or latent tuberculosis infections remains a serious challenge for clinicians. In this work, based on the test data of a total of 478 patients, 36 blood biochemical data were specially included with T-SPOT.TB detection results which are all from routine clinical practice as commercially available. Then a discrimination method to detect ATB infections was successfully developed based on these data by the random forest algorithm. This method presents a robust classification performance with AUC as 0.9256 and 0.8731 for the cross-validation set and the external validation set, respectively. This work suggests an innovative strategy for identification of ATB disease from a single drop of blood with advantages of being timely, efficient, and economical. It also provides valuable information for the comprehensive understanding of TB with deep associations between TB infection and routine blood test data. The web server of this identification method, called ATBdiscrimination, is now available online at http://lishuyan.lzu.edu.cn/ATB/ATBdiscrimination.html.",
                "authors": [
                    {
                        "name": "Bai J."
                    },
                    {
                        "name": "Lan J."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Xi L."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "ATBdiscrimination: An in Silico Tool for Identification of Active Tuberculosis Disease Based on Routine Blood Test and T-SPOT.TB Detection Results"
            },
            "pmid": "31609612"
        }
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ],
    "validated": 1
}
