
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Natural language processing",
                "uri": "http://edamontology.org/topic_0218"
            },
            {
                "term": "Biology",
                "uri": "http://edamontology.org/topic_3070"
            },
            {
                "term": "Animals",
                "uri": "http://edamontology.org/topic_3500"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Text mining is one promising way of extracting information automatically from the vast biological literature. To maximize its potential, the knowledge encoded in the text should be translated to some semantic representation such as entities and relations, which could be analyzed by machines. But large-scale practical systems for this purpose are rare. We present BeeSpace question/answering (BSQA) system that performs integrated text mining for insect biology, covering diverse aspects from molecular interactions of genes to insect behavior. BSQA recognizes a number of entities and relations in Medline documents about the model insect, Drosophila melanogaster. For any text query, BSQA exploits entity annotation of retrieved documents to identify important concepts in different categories. By utilizing the extracted relations, BSQA is also able to answer many biologically motivated questions, from simple ones such as, which anatomical part is a gene expressed in, to more complex ones involving multiple types of relations. BSQA is freely available at http://www .beespace.uiuc.edu/QuestionAnswer. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "He X.",
                "Li Y.",
                "Khetani R.",
                "Sanders B.",
                "Lu Y.",
                "Ling X.",
                "Zhai C.",
                "Schatz B."
            ],
            "cit_count": 3,
            "journal": "Nucleic Acids Research",
            "pmid": "20576702",
            "title": "BSQA: Integrated text mining using entity relation semantics extracted from biological literature of insects",
            "year": "2010-06-21"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bsqa",
        "biotoolsID": "bsqa",
        "description": "Web server that performs integrated text mining for insect biology, covering diverse aspects from molecular interactions of genes to insect behavior. It recognizes a number of entities and relations in Medline documents about the model insect, Drosophila melanogaster.",
        "homepage": "http://www.beespace.uiuc.edu/QuestionAnswer",
        "name": "BSQA"
    }
}