{
    "additionDate": "2021-01-18T10:25:02Z",
    "biotoolsCURIE": "biotools:brassicaedb",
    "biotoolsID": "brassicaedb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "drlukun@swu.edu.cn",
            "name": "Kun Lu",
            "orcidid": "https://orcid.org/0000-0003-1370-8633",
            "typeEntity": "Person"
        }
    ],
    "description": "The BrassicaEDB provides comprehensive gene expression profile information and a user-friendly visualization interface for rapeseed researchers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://biodb.swu.edu.cn/brassica/",
    "lastUpdate": "2021-02-06T16:55:37Z",
    "name": "BrassicaEDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/IJMS21165831",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.The genus Brassica contains several economically important crops, including rapeseed (Brassica napus, 2n = 38, AACC), the second largest source of seed oil and protein meal worldwide. However, research in rapeseed is hampered because it is complicated and time-consuming for researchers to access different types of expression data. We therefore developed the Brassica Expression Database (BrassicaEDB) for the research community. In the current BrassicaEDB, we only focused on the transcriptome level in rapeseed. We conducted RNA sequencing (RNA-Seq) of 103 tissues from rapeseed cultivar ZhongShuang11 (ZS11) at seven developmental stages (seed germination, seedling, bolting, initial flowering, full-bloom, podding, and maturation). We determined the expression patterns of 101,040 genes via FPKM analysis and displayed the results using the eFP browser. We also analyzed transcriptome data for rapeseed from 70 BioProjects in the SRA database and obtained three types of expression level data (FPKM, TPM, and read counts). We used this information to develop the BrassicaEDB, including “eFP”, “Treatment”, “Coexpression”, and “SRA Project” modules based on gene expression profiles and “Gene Feature”, “qPCR Primer”, and “BLAST” modules based on gene sequences. The BrassicaEDB provides comprehensive gene expression profile information and a user-friendly visualization interface for rapeseed researchers. Using this database, researchers can quickly retrieve the expression level data for target genes in different tissues and in response to different treatments to elucidate gene functions and explore the biology of rapeseed at the transcriptome level.",
                "authors": [
                    {
                        "name": "Chao H."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Luo C."
                    },
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Ruan Y."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Niu Y."
                    },
                    {
                        "name": "Fan Y."
                    },
                    {
                        "name": "Sun W."
                    },
                    {
                        "name": "Zhang K."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Qu C."
                    },
                    {
                        "name": "Lu K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Brassicaedb: A gene expression database for brassica crops"
            },
            "pmcid": "PMC7461608",
            "pmid": "32823802"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}