{
    "additionDate": "2022-09-02T07:13:02.181425Z",
    "biotoolsCURIE": "biotools:bayesherg",
    "biotoolsID": "bayesherg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hjnam@gist.ac.kr",
            "name": "Hojung Nam",
            "typeEntity": "Person"
        },
        {
            "name": "Hyunho Kim"
        }
    ],
    "description": "BayeshERG : A Bayesian Graph Neural Network for predicting hERG blockers.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GIST-CSBL/BayeshERG",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-02T07:13:02.184281Z",
    "license": "GPL-3.0",
    "name": "BayeshERG",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC211",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Unintended inhibition of the human ether-à-go-go-related gene (hERG) ion channel by small molecules leads to severe cardiotoxicity. Thus, hERG channel blockage is a significant concern in the development of new drugs. Several computational models have been developed to predict hERG channel blockage, including deep learning models; however, they lack robustness, reliability and interpretability. Here, we developed a graph-based Bayesian deep learning model for hERG channel blocker prediction, named BayeshERG, which has robust predictive power, high reliability and high resolution of interpretability. First, we applied transfer learning with 300 000 large data in initial pre-training to increase the predictive performance. Second, we implemented a Bayesian neural network with Monte Carlo dropout to calibrate the uncertainty of the prediction. Third, we utilized global multihead attentive pooling to augment the high resolution of structural interpretability for the hERG channel blockers and nonblockers. We conducted both internal and external validations for stringent evaluation; in particular, we benchmarked most of the publicly available hERG channel blocker prediction models. We showed that our proposed model outperformed predictive performance and uncertainty calibration performance. Furthermore, we found that our model learned to focus on the essential substructures of hERG channel blockers via an attention mechanism. Finally, we validated the prediction results of our model by conducting in vitro experiments and confirmed its high validity. In summary, BayeshERG could serve as a versatile tool for discovering hERG channel blockers and helping maximize the possibility of successful drug discovery. The data and source code are available at our GitHub repository (https://github.com/GIST-CSBL/BayeshERG).",
                "authors": [
                    {
                        "name": "Kim H."
                    },
                    {
                        "name": "Lee I."
                    },
                    {
                        "name": "Nam H."
                    },
                    {
                        "name": "Park M."
                    }
                ],
                "date": "2022-07-18T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "BayeshERG: a robust, reliable and interpretable deep learning model for predicting hERG channel blockers"
            },
            "pmid": "35709752"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ],
    "validated": 1
}
