{
    "additionDate": "2023-02-09T13:46:00.115365Z",
    "biotoolsCURIE": "biotools:2dsdb",
    "biotoolsID": "2dsdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Vei Wang"
        }
    ],
    "description": "The 2D semiconductor database (2DSdb) provides an ideal platform for computational modeling and design of new 2D semiconductors and heterostructures in photocatalysis, nanoscale devices, and other applications.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://materialsdb.cn/2dsdb/index.html",
    "lastUpdate": "2024-11-24T15:04:27.622992Z",
    "license": "CC-BY-4.0",
    "name": "2DSdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/acs.jpclett.2c02972",
            "metadata": {
                "abstract": "Two-dimensional (2D) materials have attracted great attention mainly due to their unique physical properties and ability to fulfill the demands of future nanoscale devices. By performing high-throughput first-principles calculations combined with a semiempirical van der Waals dispersion correction, we have screened 73 direct- and 183 indirect-gap 2D nonmagnetic semiconductors from nearly 1000 monolayers according to the criteria for thermodynamic, mechanical, dynamic, and thermal stabilities and conductivity type. We present the calculated lattice constants, formation energy, Young's modulus, Poisson's ratio, shear modulus, anisotropic effective mass, band structure, band gap, ionization energy, electron affinity, and simulated scanning tunnel microscopy for each candidate meeting our criteria. The resulting 2D semiconductor database (2DSdb) can be accessed via the Web site https://materialsdb.cn/2dsdb/index.html. The 2DSdb provides an ideal platform for computational modeling and design of new 2D semiconductors and heterostructures in photocatalysis, nanoscale devices, and other applications. Further, a linear fitting model was proposed to evaluate band gap, ionization energy, and electron affinity of 2D semiconductors from the density functional theory (DFT) calculated data as initial input. This model can be as precise as hybrid DFT but with much lower computational cost.",
                "authors": [
                    {
                        "name": "Geng W.T."
                    },
                    {
                        "name": "Kawazoe Y."
                    },
                    {
                        "name": "Liu Y.-C."
                    },
                    {
                        "name": "Mizuseki H."
                    },
                    {
                        "name": "Nara J."
                    },
                    {
                        "name": "Tang G."
                    },
                    {
                        "name": "Wang R.-T."
                    },
                    {
                        "name": "Wang V."
                    }
                ],
                "citationCount": 84,
                "date": "2022-12-22T00:00:00Z",
                "journal": "Journal of Physical Chemistry Letters",
                "title": "High-Throughput Computational Screening of Two-Dimensional Semiconductors"
            },
            "pmid": "36480578"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}
