{
    "additionDate": "2017-03-30T22:04:17Z",
    "biotoolsCURIE": "biotools:i2d",
    "biotoolsID": "i2d",
    "credit": [
        {
            "email": "juris@ai.utoronto.ca",
            "name": "Igor Jurisica",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "To faciliate experimentation and integrated computational analysis with model organism PPI networks, we have integrated known, experimental and predicted PPIs for five model organisms and human in the I2D database.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ophid.utoronto.ca/ophidv2.204/database.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://ophid.utoronto.ca/ophidv2.204/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "I2D",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Protein-protein interaction (PPI) networks have been transferred between organisms using interologs, allowing model organisms to supplement the interactomes of higher eukaryotes. However, the conservation of various network components has not been fully explored. Unequal conservation of certain network components may limit the ability to fully expand the target interactomes using interologs. Results: In this study, we transfer high quality human interactions to lower eukaryotes, and examine the evolutionary conservation of individual network components. When human proteins are mapped to yeast, we find a strong positive correlation (r = 0.50, P = 3.9 × 10-4) between evolutionary conservation and the number of interacting proteins, which is also found when mapped to other model organisms. Examining overlapping PPI networks, Gene Ontology (GO) terms, and gene expression data, we are able to demonstrate that protein complexes are conserved preferentially, compared to transient interactions in the network. Despite the preferential conservation of complexes, and the fact that the human interactome comprises an abundance of transient interactions, we demonstrate how transferring human PPIs to yeast augments this well-studied protein interaction network, using the coatomer complex and replisome as examples. Conclusion: Human proteins, like yeast proteins, show a correlation between the number of interacting partners and evolutionary conservation. The preferential conservation of proteins with higher degree leads to enrichment in protein complexes when interactions are transferred between organisms using interologs. © 2007 Brown and Jurisica; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Brown K.R."
                    },
                    {
                        "name": "Jurisica I."
                    }
                ],
                "citationCount": 231,
                "date": "2007-12-01T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Unequal evolutionary conservation of human protein interactions in interologous networks"
            },
            "pmid": "17535438"
        },
        {
            "metadata": {
                "abstract": "Motivation: High-throughput experiments are being performed at an ever-increasing rate to systematically elucidate protein-protein interaction (PPI) networks for model organisms, while the complexities of higher eukaryotes have prevented these experiments for humans. Results: The Online Predicted Human Interaction Database (OPHID) is a web-based database of predicted interactions between human proteins. It combines the literature-derived human PPI from BIND, HPRD and MINT, with predictions made from Saccharomyces cerevisiae, Caenorhabditis elegans, Drosophila melanogaster and Mus musculus. The 23 889 predicted interactions currently listed in OPHID are evaluated using protein domains, gene co-expression and Gene Ontology terms. OPHID can be queried using single or multiple IDs and results can be visualized using our custom graph visualization program. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Brown K.R."
                    },
                    {
                        "name": "Jurisica I."
                    }
                ],
                "citationCount": 456,
                "date": "2005-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Online predicted human interaction database"
            },
            "pmid": "15657099"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3557"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
