{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T06:06:33.491743Z",
    "biotoolsCURIE": "biotools:ctnet",
    "biotoolsID": "ctnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Zechao Li"
        }
    ],
    "description": "Context-based Tandem Network for Semantic Segmentation.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/syp2ysy/CTNet",
    "language": [
        "Pascal",
        "Python"
    ],
    "lastUpdate": "2022-06-07T06:06:33.494431Z",
    "license": "Not licensed",
    "name": "CTNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2021.3132068",
            "metadata": {
                "abstract": "IEEEContextual information has been shown to be powerful for semantic segmentation. This work proposes a novel Context-based Tandem Network (CTNet) by interactively exploring the spatial contextual information and the channel contextual information, which can discover the semantic context for semantic segmentation. Specifically, the Spatial Contextual Module (SCM) is leveraged to uncover the spatial contextual dependency between pixels by exploring the correlation between pixels and categories. Meanwhile, the Channel Contextual Module (CCM) is introduced to learn the semantic features including the semantic feature maps and class-specific features by modeling the long-term semantic dependence between channels. The learned semantic features are utilized as the prior knowledge to guide the learning of SCM, which can make SCM obtain more accurate long-range spatial dependency. Finally, to further improve the performance of the learned representations for semantic segmentation, the results of the two context modules are adaptively integrated to achieve better results. Extensive experiments are conducted on four widely-used datasets, i.e., PASCAL-Context, Cityscapes, ADE20K and PASCAL VOC2012. The results demonstrate the superior performance of the proposed CTNet by comparison with several state-of-the-art methods. The source code and models are available at https://github.com/syp2ysy/CTNet.",
                "authors": [
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Tang J."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "CTNet: Context-based Tandem Network for Semantic Segmentation"
            },
            "pmid": "34855586"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ]
}
