{
    "additionDate": "2021-01-18T11:57:50Z",
    "biotoolsCURIE": "biotools:tenet-network",
    "biotoolsID": "tenet-network",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "knn@bmb.sdu.dk",
            "name": "Kedar N Natarajan",
            "typeEntity": "Person"
        },
        {
            "email": "kyoung.won@bric.ku.dk",
            "name": "Kyoung-Jae Won",
            "typeEntity": "Person"
        }
    ],
    "description": "gene network reconstruction using transfer entropy reveals key regulatory factors from single cell transcriptomic data.\n\nA tool for reconstructing Transfer Entropy-based causal gene NETwork from pseudo-time ordered single cell transcriptomic data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/neocaleb/TENET",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-02-26T18:13:03Z",
    "name": "TENET",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1014",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Accurate prediction of gene regulatory rules is important towards understanding of cellular processes. Existing computational algorithms devised for bulk transcriptomics typically require a large number of time points to infer gene regulatory networks (GRNs), are applicable for a small number of genes and fail to detect potential causal relationships effectively. Here, we propose a novel approach 'TENET' to reconstruct GRNs from single cell RNA sequencing (scRNAseq) datasets. Employing transfer entropy (TE) to measure the amount of causal relationships between genes, TENET predicts large-scale gene regulatory cascades/relationships from scRNAseq data. TENET showed better performance than other GRN reconstructors, in identifying key regulators from public datasets. Specifically from scRNAseq, TENET identified key transcriptional factors in embryonic stem cells (ESCs) and during direct cardiomyocytes reprogramming, where other predictors failed. We further demonstrate that known target genes have significantly higher TE values, and TENET predicted higher TE genes were more influenced by the perturbation of their regulator. Using TENET, we identified and validated that Nme2 is a culture condition specific stem cell factor. These results indicate that TENET is uniquely capable of identifying key regulators from scRNAseq data.",
                "authors": [
                    {
                        "name": "Jakobsen S.T."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Natarajan K.N."
                    },
                    {
                        "name": "Won K.-J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-11T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TENET: Gene network reconstruction using transfer entropy reveals key regulatory factors from single cell transcriptomic data"
            },
            "pmid": "33170214"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
