{
    "additionDate": "2019-11-14T18:47:35Z",
    "biotoolsCURIE": "biotools:Norovirus",
    "biotoolsID": "Norovirus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jinxu_125@163.com",
            "name": "Jin Xu",
            "orcidid": "https://orcid.org/0000-0003-2876-2712",
            "typeEntity": "Person"
        }
    ],
    "description": "Genetic diversity and epidemiology of Genogroup II noroviruses in children with acute sporadic gastroenteritis in Shanghai, China, 2012-2017 | BACKGROUND:Noroviruses (NoVs) are considered an important cause of acute gastroenteritis (AGE) across all age groups, especially in children under 5 years of age. We investigated the epidemiology of noroviruses in outpatient children from the Children's Hospital of Fudan University in Shanghai, China. METHODS:Stool specimens were collected between January 2012 and December 2017 from 1433 children under 5 years of age with acute gastroenteritis. All samples were analysed by conventional reverse transcription-polymerase chain reaction (RT-PCR) for genogroup II NoVs amplifying both the RNA-dependent RNA polymerase (RdRp) and partial capsid genes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://www.rivm.nl/mpf/typingtool/norovirus/",
    "lastUpdate": "2021-01-04T08:54:23Z",
    "name": "Norovirus",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12879-019-4360-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Noroviruses (NoVs) are considered an important cause of acute gastroenteritis (AGE) across all age groups, especially in children under 5 years of age. We investigated the epidemiology of noroviruses in outpatient children from the Children's Hospital of Fudan University in Shanghai, China. Methods: Stool specimens were collected between January 2012 and December 2017 from 1433 children under 5 years of age with acute gastroenteritis. All samples were analysed by conventional reverse transcription-polymerase chain reaction (RT-PCR) for genogroup II NoVs amplifying both the RNA-dependent RNA polymerase (RdRp) and partial capsid genes. The Norovirus Genotyping Tool v.2.0 (https://www.rivm.nl/mpf/typingtool/norovirus/) was used for genotyping the strains, and phylogenetic analyses were conducted by MEGA 6.0. Results: From 2012 to 2017, GII NoVs were detected in 15.4% (220/1433) of the samples, with the highest detection rate in children aged 7-12 months (19.2%, 143/746). The seasons with the highest prevalence of GII NoVs infection were autumn and winter. Based on genetic analysis of RdRp, GII.Pe (74.5%%, 137/184) was the most predominant RdRp genotype from 2013 to 2017, while GII.P4 played a dominant role in 2012 (55.6%, 21/36). Among the capsid genotypes, the most prevalent NoV genotype from 2012 to 2017 was GII.4 (74.1%, 163/220). On the basis of genetic analysis of RdRp and capsid sequences, the strains were clustered into - 19 RdRp/capsid genotypes, and 12 of them were discordant, such as GII.Pe/GII.4-Sydney_2012, GII.P12/GII.3, GII.P7/GII.6, GII.Pe/GII.3, and GII.P16/GII.2. Starting with 2013, GII.Pe/GII.4-Sydney_2012 had completely replaced the pandemic GII.P4-2006b/GII.4-2006b subtype and was detected in children across all age groups. Conclusions: The present study shows high detection rates and the genetic diversity of circulating NoV GII genotypes in paediatric AGE samples from Shanghai. The findings emphasize the importance of continuous molecular surveillance of emerging NoV strains.",
                "authors": [
                    {
                        "name": "Lu L."
                    },
                    {
                        "name": "Zhong H."
                    },
                    {
                        "name": "Xu M."
                    },
                    {
                        "name": "Su L."
                    },
                    {
                        "name": "Cao L."
                    },
                    {
                        "name": "Jia R."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "citationCount": 8,
                "date": "2019-08-22T00:00:00Z",
                "journal": "BMC Infectious Diseases",
                "title": "Genetic diversity and epidemiology of Genogroup II noroviruses in children with acute sporadic gastroenteritis in Shanghai, China, 2012-2017"
            },
            "pmcid": "PMC6704660",
            "pmid": "31438883"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}