{
    "accessibility": "Open access",
    "additionDate": "2022-05-07T11:47:33.384793Z",
    "biotoolsCURIE": "biotools:get.stats.app",
    "biotoolsID": "get.stats.app",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ingmar.boeschen@uni-hamburg.de",
            "name": "Ingmar Böschen",
            "orcidid": "https://orcid.org/0000-0003-1159-3991",
            "typeEntity": "Person"
        }
    ],
    "description": "Evaluation of JATSdecoder as an automated text extraction tool for statistical results in scientific reports.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://www.get-stats.app",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-05-07T11:47:33.387272Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://github.com/ingmarboeschen/JATSdecoder"
        }
    ],
    "name": "get.stats.app",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/S41598-021-98782-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).The extraction of statistical results in scientific reports is beneficial for checking studies on plausibility and reliability. The R package JATSdecoder supports the application of text mining approaches to scientific reports. Its function get.stats() extracts all reported statistical results from text and recomputes p values for most standard test results. The output can be reduced to results with checkable or computable p values only. In this article, get.stats()’s ability to extract, recompute and check statistical results is compared to that of statcheck, which is an already established tool. A manually coded data set, containing the number of statistically significant results in 49 articles, serves as an initial indicator for get.stats()’s and statcheck’s differing detection rates for statistical results. Further 13,531 PDF files by 10 mayor psychological journals, 18,744 XML documents by Frontiers of Psychology and 23,730 articles related to psychological research and published by PLoS One are scanned for statistical results with both algorithms. get.stats() almost replicates the manually extracted number of significant results in 49 PDF articles. get.stats() outperforms the statcheck functions in identifying statistical results in every included journal and input format. Furthermore, the raw results extracted by get.stats() increase statcheck’s detection rate. JATSdecoder’s function get.stats() is a highly general and reliable tool to extract statistical results from text. It copes with a wide range of textual representations of statistical standard results and recomputes p values for two- and one-sided tests. It facilitates manual and automated checks on consistency and completeness of the reported results within a manuscript.",
                "authors": [
                    {
                        "name": "Boschen I."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Evaluation of JATSdecoder as an automated text extraction tool for statistical results in scientific reports"
            },
            "pmcid": "PMC8484375",
            "pmid": "34593888"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
