{
    "additionDate": "2018-05-19T17:59:19Z",
    "biotoolsCURIE": "biotools:qq-snv",
    "biotoolsID": "qq-snv",
    "credit": [
        {
            "email": "kvdborgh@its.jnj.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Single nucleotide variant detection at low frequency by comparing the quality quantiles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/qqsnv/files/README-QQ-SNV.pdf/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/qqsnv/",
    "language": [
        "Perl",
        "SAS"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "QQ-SNV",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0812-9",
            "metadata": {
                "abstract": "© 2015 Van der Borght et al.Background: Next generation sequencing enables studying heterogeneous populations of viral infections. When the sequencing is done at high coverage depth (\"deep sequencing\"), low frequency variants can be detected. Here we present QQ-SNV ( http://sourceforge.net/projects/qqsnv ), a logistic regression classifier model developed for the Illumina sequencing platforms that uses the quantiles of the quality scores, to distinguish true single nucleotide variants from sequencing errors based on the estimated SNV probability. To train the model, we created a dataset of an in silico mixture of five HIV-1 plasmids. Testing of our method in comparison to the existing methods LoFreq, ShoRAH, and V-Phaser 2 was performed on two HIV and four HCV plasmid mixture datasets and one influenza H1N1 clinical dataset. Results: For default application of QQ-SNV, variants were called using a SNV probability cutoff of 0.5 (QQ-SNVD). To improve the sensitivity we used a SNV probability cutoff of 0.0001 (QQ-SNVHS). To also increase specificity, SNVs called were overruled when their frequency was below the 80th percentile calculated on the distribution of error frequencies (QQ-SNVHS-P80). When comparing QQ-SNV versus the other methods on the plasmid mixture test sets, QQ-SNVD performed similarly to the existing approaches. QQ-SNVHS was more sensitive on all test sets but with more false positives. QQ-SNVHS-P80 was found to be the most accurate method over all test sets by balancing sensitivity and specificity. When applied to a paired-end HCV sequencing study, with lowest spiked-in true frequency of 0.5 %, QQ-SNVHS-P80 revealed a sensitivity of 100 % (vs. 40-60 % for the existing methods) and a specificity of 100 % (vs. 98.0-99.7 % for the existing methods). In addition, QQ-SNV required the least overall computation time to process the test sets. Finally, when testing on a clinical sample, four putative true variants with frequency below 0.5 % were consistently detected by QQ-SNVHS-P80 from different generations of Illumina sequencers. Conclusions: We developed and successfully evaluated a novel method, called QQ-SNV, for highly efficient single nucleotide variant calling on Illumina deep sequencing virology data.",
                "authors": [
                    {
                        "name": "Aerssens J."
                    },
                    {
                        "name": "Clement L."
                    },
                    {
                        "name": "Reumers J."
                    },
                    {
                        "name": "Thys K."
                    },
                    {
                        "name": "Van der Borght K."
                    },
                    {
                        "name": "Verbist B."
                    },
                    {
                        "name": "Wetzels Y."
                    },
                    {
                        "name": "van Vlijmen H."
                    }
                ],
                "date": "2015-11-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "QQ-SNV: Single nucleotide variant detection at low frequency by comparing the quality quantiles"
            },
            "pmcid": "PMC4641353",
            "pmid": "26554718"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}
