{
    "accessibility": [],
    "additionDate": "2017-08-03T18:36:39Z",
    "biotoolsCURIE": "biotools:bacom",
    "biotoolsID": "bacom",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cbil.ece.vt.edu/index.htm"
        }
    ],
    "description": "Bayesian Analysis of COpy number Mixtures is a statistically-principled in silico approach to accurately estimate genomic deletions and normal tissue contamination, and accordingly recover the true copy number profile in cancer cells. We have developed a cross-platform and open source Java application that implements the whole pipeline of copy number analysis of heterogeneous cancer tissues and other relevant processing steps. We also provide an R interface, bacomR.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "https://storage.googleapis.com/google-code-archive-downloads/v2/code.google.com/bacom/BACOM_manual.pdf"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://code.google.com/p/bacom/",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/bacom-1-0-bayesian-analysis-copy-number-mixtures.html"
        }
    ],
    "maturity": null,
    "name": "BACOM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Motivation: Identification of somatic DNA copy number alterations (CNAs) and significant consensus events (SCEs) in cancer genomes is a main task in discovering potential cancer-driving genes such as oncogenes and tumor suppressors. The recent development of SNP array technology has facilitated studies on copy number changes at a genome-wide scale with high resolution. However, existing copy number analysis methods are oblivious to normal cell contamination and cannot distinguish between contributions of cancerous and normal cells to the measured copy number signals. This contamination could significantly confound downstream analysis of CNAs and affect the power to detect SCEs in clinical samples. Results: We report here a statistically principled in silico approach, Bayesian Analysis of COpy number Mixtures (BACOM), to accurately estimate genomic deletion type and normal tissue contamination, and accordingly recover the true copy number profile in cancer cells. We tested the proposed method on two simulated datasets, two prostate cancer datasets and The Cancer Genome Atlas high-grade ovarian dataset, and obtained very promising results supported by the ground truth and biological plausibility. Moreover, based on a large number of comparative simulation studies, the proposed method gives significantly improved power to detect SCEs after in silico correction of normal tissue contamination. We develop a cross-platform open-source Java application that implements the whole pipeline of copy number analysis of heterogeneous cancer tissues including relevant processing steps. We also provide an R interface, bacomR, for running BACOM within the R environment, making it straightforward to include in existing data pipelines. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Yu G."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Bova G.S."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Shih I.-M."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 19,
                "date": "2011-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "BACOM: In silico detection of genomic deletion types and correction of normal cell contamination in copy number data"
            },
            "note": null,
            "pmcid": null,
            "pmid": "21498400",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1,
    "version": []
}