{
    "accessibility": "Open access",
    "additionDate": "2022-02-17T12:00:14.493756Z",
    "biotoolsCURIE": "biotools:metafunprimer",
    "biotoolsID": "metafunprimer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "adina@iastate.edu",
            "name": "Adina Howe",
            "orcidid": "https://orcid.org/0000-0002-7705-343X",
            "typeEntity": "Person"
        },
        {
            "name": "Jia Liu"
        },
        {
            "name": "Jinlyung Choi"
        },
        {
            "name": "Paul Villanueva"
        },
        {
            "name": "Santosh Gunturu"
        }
    ],
    "description": "An Environment-Specific, High-Throughput Primer Design Tool for Improved Quantification of Target Genes.",
    "documentation": [
        {
            "type": [
                "General",
                "Quick start guide"
            ],
            "url": "https://metafunprimer.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jialiu232/MetaFunPrimer_paper_info.git",
    "lastUpdate": "2022-02-17T12:00:14.496313Z",
    "license": "MIT",
    "name": "MetaFunPrimer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00201-21",
            "metadata": {
                "abstract": "Copyright © 2021 Liu et al.Genes belonging to the same functional group may include numerous and variable gene sequences, making characterizing and quantifying difficult. Therefore, high-throughput design tools are needed to simultaneously create primers for improved quantification of target genes. We developed MetaFunPrimer, a bioinformatic pipeline, to design primers for numerous genes of interest. This tool also enables gene target prioritization based on ranking the presence of genes in user-defined references, such as environment-specific metagenomes. Given inputs of protein and nucleotide sequences for gene targets of interest and an accompanying set of reference metagenomes or genomes, MetaFunPrimer generates primers for ranked genes of interest. To demonstrate the usage and benefits of MetaFunPrimer, a total of 78 primer pairs were designed to target observed ammonia monooxygenase subunit A (amoA) genes of ammonia-oxidizing bacteria (AOB) in 1,550 publicly available soil metagenomes. We demonstrate computationally that these amoA-AOB primers can cover 94% of the amoA-AOB genes observed in the 1,550 soil metagenomes compared with a 49% estimated coverage by previously published primers. Finally, we verified the utility of these primer sets in incubation experiments that used long-term nitrogen fertilized or unfertilized soils. High-throughput quantitative PCR (qPCR) results and statistical analyses showed significant differences in relative quantification patterns between the two soils, and subsequent absolute quantifications also confirmed that target genes enumerated by six selected primer pairs were significantly more abundant in the nitrogen-fertilized soils. This new tool gives microbial ecologists a new approach to assess functional gene abundance and related microbial community dynamics quickly and affordably. IMPORTANCE Amplification-based gene characterization allows for sensitive and specific quantification of functional genes. There is often a large diversity of genes represented for functional gene groups, and multiple primers may be necessary to target associated genes. Current primer design tools are limited to designing primers for only a few genes of interest. MetaFunPrimer allows for high-throughput primer design for various genes of interest and also allows for ranking gene targets by their presence and abundance in environmental data sets. Primers designed by this tool improve the characterization and quantification of functional genes in broad gene amplification platforms and can be powerful with high-throughput qPCR approaches.",
                "authors": [
                    {
                        "name": "Choi J."
                    },
                    {
                        "name": "Cole J.R."
                    },
                    {
                        "name": "Glanville K.R."
                    },
                    {
                        "name": "Gunturu S."
                    },
                    {
                        "name": "Hall S.J."
                    },
                    {
                        "name": "Howe A."
                    },
                    {
                        "name": "Lee J."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "McDaniel M.D."
                    },
                    {
                        "name": "Ouyang Y."
                    },
                    {
                        "name": "Tiemann L.K."
                    },
                    {
                        "name": "Villanueva P."
                    }
                ],
                "citationCount": 1,
                "date": "2021-09-01T00:00:00Z",
                "journal": "mSystems",
                "title": "MetaFunPrimer: an Environment-Specific, High-Throughput Primer Design Tool for Improved Quantification of Target Genes"
            },
            "pmcid": "PMC8547451",
            "pmid": "34546069"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
