{
    "accessibility": "Open access",
    "additionDate": "2022-08-18T22:32:52.956248Z",
    "biotoolsCURIE": "biotools:pier",
    "biotoolsID": "pier",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fh12355@rjh.com.cn",
            "name": "Hai Fang",
            "orcidid": "https://orcid.org/0000-0003-3961-8572",
            "typeEntity": "Person"
        }
    ],
    "description": "Web-based facilities tailored for genetic target prioritisation harnessing human disease genetics, functional genomics and protein interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://www.genetictargets.com/PiER",
    "lastUpdate": "2022-08-18T22:32:52.958922Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/23verse/pier"
        }
    ],
    "name": "PiER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAC379",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Integrative prioritisation promotes translational use of disease genetic findings in target discovery. I report 'PiER' (http://www.genetictargets.com/PiER), web-based facilities that support ab initio and real-time genetic target prioritisation through integrative use of human disease genetics, functional genomics and protein interactions. By design, the PiER features two facilities: elementary and combinatory. The elementary facility is designed to perform specific tasks, including three online tools: eV2CG, utilising functional genomics to link disease-associated variants (particularly located at the non-coding genome) to core genes likely responsible for genetic associations in disease; eCG2PG, using knowledge of protein interactions to 'network' core genes and additional peripheral genes, producing a ranked list of core and peripheral genes; and eCrosstalk, exploiting the information of pathway-derived interactions to identify highly-ranked genes mediating crosstalk between molecular pathways. Each of elementary tasks giving results is sequentially piped to the next one. By chaining together elementary tasks, the combinatory facility automates genetics-led and network-based integrative prioritisation for genetic targets at the gene level (cTGene) and at the crosstalk level (cTCrosstalk). Together with a tutorial-like booklet describing instructions on how to use, the PiER facilities meet multi-tasking needs to accelerate computational translational medicine that leverages human disease genetics and genomics for early-stage target discovery and drug repurposing.",
                "authors": [
                    {
                        "name": "Fang H."
                    }
                ],
                "date": "2022-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PiER: web-based facilities tailored for genetic target prioritisation harnessing human disease genetics, functional genomics and protein interactions"
            },
            "pmcid": "PMC9252812",
            "pmid": "35610036"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Translational medicine",
            "uri": "http://edamontology.org/topic_3342"
        }
    ],
    "validated": 1
}
