{
    "additionDate": "2017-01-13T13:14:07Z",
    "biotoolsCURIE": "biotools:cnd",
    "biotoolsID": "cnd",
    "credit": [
        {
            "email": "webmaster@sanger.ac.uk",
            "name": "Webmaster of CnD",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Program to detect copy number variation in inbred mouse strains.",
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "homepage": "http://www.sanger.ac.uk/science/tools/cnd",
    "language": [
        "D"
    ],
    "lastUpdate": "2024-11-25T14:18:58.682954Z",
    "license": "GPL-3.0",
    "name": "CnD",
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp693",
            "metadata": {
                "abstract": "Summary: We have developed an algorithm to detect copy number variants (CNVs) in homozygous organisms, such as inbred laboratory strains of mice, from short read sequence data. Our novel approach exploits the fact that inbred mice are homozygous at virtually every position in the genome to detect CNVs using a hidden Markov model (HMM). This HMM uses both the density of sequence reads mapped to the genome, and the rate of apparent heterozygous single nucleotide polymorphisms, to determine genomic copy number. We tested our algorithm on short read sequence data generated from re-sequencing chromosome 17 of the mouse strains A/J and CAST/EiJ with the Illumina platform. In total, we identified 118 copy number variants (43 for A/J and 75 for CAST/EiJ). We investigated the performance of our algorithm through comparison to CNVs previously identified by array-comparative genomic hybridization (array CGH). We performed quantitative-PCR validation on a subset of the calls that differed from the array CGH data sets. Availability: The software described in this manuscript, named cnD for copy number detector, is free and released under the GPL. The program is implemented in the D programming language using the Tango library. Source code and pre-compiled binaries are available at http://www.sanger.ac.uk/resources/software/cnd.html. Contact: rd@sanger.ac.uk Supplementary information: Supplementary data are available at Bioinformatics online. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Adams D.J."
                    },
                    {
                        "name": "Durbin R."
                    },
                    {
                        "name": "McIntyre R.E."
                    },
                    {
                        "name": "Simpson J.T."
                    }
                ],
                "citationCount": 39,
                "date": "2009-12-18T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Copy number variant detection in inbred strains from short read sequence data"
            },
            "pmcid": "PMC2820678",
            "pmid": "20022973"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}
