
{
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "Tim.Demeyer@ugent.be",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.biobix.be/research/downloads/mam-pipeline/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "DNA sequence (raw)",
                        "uri": "http://edamontology.org/data_3497"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Locus ID",
                        "uri": "http://edamontology.org/data_1893"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BIG N2N",
            "UGent"
        ],
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research. Monoallelic gene expression is typically initiated early in the development of an organism. Dysregulation of monoallelic gene expression has already been linked to several non-Mendelian inherited genetic disorders. In humans, DNA-methylation is deemed to be an important regulator of monoallelic gene expression, but only few examples are known. One important reason is that current, cost-affordable truly genome-wide methods to assess DNA-methylation are based on sequencing post-enrichment. Here, we present a new methodology based on classical population genetic theory, i.e. the Hardy-Weinberg theorem, that combines methylomic data from MethylCap-seq with associated SNP profiles to identify monoallelically methylated loci. Applied on 334 MethylCap-seq samples of very diverse origin, this resulted in the identification of 80 genomic regions featured by monoallelic DNA-methylation. Of these 80 loci, 49 are located in genic regions of which 25 have already been linked to imprinting. Further analysis revealed statistically significant enrichment of these loci in promoter regions, further establishing the relevance and usefulness of the method. Additional validation was done using both 14 whole-genome bisulfite sequencing data sets and 16 mRNA-seq data sets. Importantly, the developed approach can be easily applied to other enrichment-based sequencing technologies, like the ChIP-seq-based identification of monoallelic histone modifications.",
            "authors": [
                "Steyaert S.",
                "Van Criekinge W.",
                "De Paepe A.",
                "Denil S.",
                "Mensaert K.",
                "Vandepitte K.",
                "Vanden Berghe W.",
                "Trooskens G.",
                "De Meyer T."
            ],
            "cit_count": 4,
            "doi": "10.1093/nar/gku847",
            "journal": "Nucleic acids research",
            "title": "SNP-guided identification of monoallelic DNA-methylation events from enrichment-based sequencing data",
            "type": "Primary",
            "year": "2014-11-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mam-pipeline",
        "biotoolsID": "mam-pipeline",
        "description": "Monoallelic DNA-methylation pipeline for enrichment-based sequencing technologies.",
        "homepage": "http://www.biobix.be/mam/",
        "name": "MAM-pipeline",
        "version": [
            "1"
        ]
    }
}