{
    "accessibility": "Open access",
    "additionDate": "2022-12-31T00:42:15.233812Z",
    "biotoolsCURIE": "biotools:htaadvar",
    "biotoolsID": "htaadvar",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Guoyan Zhu"
        },
        {
            "name": "Wei-Zhen Zhou"
        },
        {
            "name": "Yujing Zhang"
        }
    ],
    "description": "Aggregation and fully automated clinical interpretation of genetic variants in heritable thoracic aortic aneurysm and dissection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene symbol",
                        "uri": "http://edamontology.org/data_1026"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://htaadvar.fwgenetics.org",
    "lastUpdate": "2022-12-31T00:42:15.236585Z",
    "name": "HTAADVar",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.GIM.2022.08.024",
            "metadata": {
                "abstract": "© 2022 The AuthorsPurpose: Early detection and pathogenicity interpretation of disease-associated variants are crucial but challenging in molecular diagnosis, especially for insidious and life-threatening diseases, such as heritable thoracic aortic aneurysm and dissection (HTAAD). In this study, we developed HTAADVar, an unbiased and fully automated system for the molecular diagnosis of HTAAD. Methods: We developed HTAADVar (http://htaadvar.fwgenetics.org) under the American College of Medical Genetics and Genomics/Association for Molecular Pathology framework, with optimizations based on disease- and gene-specific knowledge, expert panel recommendations, and variant observations. HTAADVar provides variant interpretation with a self-built database through the web server and the stand-alone programs. Results: We constructed an expert-reviewed database by integrating 4373 variants in HTAAD genes, with comprehensive metadata curated from 697 publications and an in-house study of 790 patients. We further developed an interpretation system to assess variants automatically. Notably, HTAADVar showed a multifold increase in performance compared with public tools, reaching a sensitivity of 92.64% and specificity of 70.83%. The molecular diagnostic yield of HTAADVar among 790 patients (42.03%) also matched the clinical data, independently demonstrating its good performance in clinical application. Conclusion: HTAADVar represents the first fully automated system for accurate variant interpretation for HTAAD. The framework of HTAADVar could also be generalized for the molecular diagnosis of other genetic diseases.",
                "authors": [
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Luo M."
                    },
                    {
                        "name": "Shen H."
                    },
                    {
                        "name": "Shu C."
                    },
                    {
                        "name": "Yang H."
                    },
                    {
                        "name": "Zeng Q."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhou W.-Z."
                    },
                    {
                        "name": "Zhou Z."
                    },
                    {
                        "name": "Zhu G."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Genetics in Medicine",
                "title": "HTAADVar: Aggregation and fully automated clinical interpretation of genetic variants in heritable thoracic aortic aneurysm and dissection"
            },
            "pmid": "36194209"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
