
{
    "credit": [
        {
            "email": "dan.maclean@tsl.ac.uk",
            "name": "Dan MacLean",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/danmaclean/gee_fu/blob/master/README.mdown"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Ruby"
        ],
        "operatingSystem": [
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Summary: Scientists now use high-throughput sequencing technologies and short-read assembly methods to create draft genome assemblies in just days. Tools and pipelines like the assembler, and the workflow management environments make it easy for a non-specialist to implement complicated pipelines to produce genome assemblies and annotations very quickly. Such accessibility results in a proliferation of assemblies and associated files, often for many organisms. These assemblies get used as a working reference by lots of different workers, from a bioinformatician doing gene prediction or a bench scientist designing primers for PCR. Here we describe Gee Fu, a database tool for genomic assembly and feature data, including next-generation sequence alignments. Gee Fu is an instance of a Ruby-On-Rails web application on a feature database that provides web and console interfaces for input, visualization of feature data via AnnoJ, access to data through a web-service interface, an API for direct data access by Ruby scripts and access to feature data stored in BAM files. Gee Fu provides a platform for storing and sharing different versions of an assembly and associated features that can be accessed and updated by bench biologists and bioinformaticians in ways that are easy and useful for each. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Ramirez-Gonzalez R.",
                "Caccamo M.",
                "Maclean D."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "21803806",
            "title": "Gee Fu: A sequence version and web-services database tool for genomic assembly, genome feature and NGS data",
            "year": "2011-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:geefu",
        "biotoolsID": "geefu",
        "description": "Database tool for genomic assembly and feature data",
        "homepage": "https://github.com/danmaclean/gee_fu",
        "name": "GeeFu"
    }
}