{"credit":[{"email":"blaz.zupan@fri-uni-lj.si","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/marinkaz/fusenet/blob/master/README.md"}],"function":[{"operation":[{"term":"Pathway or network prediction","uri":"http://edamontology.org/operation_3439"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"Molecular genetics","uri":"http://edamontology.org/topic_3321"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/fusenet-gene-network-inference-by-fusing-data-from-diverse-distributions.html"}],"publication":[{"abstract":"© The Author 2015. Published by Oxford University Press. Motivation: Markov networks are undirected graphical models that are widely used to infer relations between genes from experimental data. Their state-of-the-art inference procedures assume the data arise from a Gaussian distribution. High-throughput omics data, such as that from next generation sequencing, often violates this assumption. Furthermore, when collected data arise from multiple related but otherwise nonidentical distributions, their underlying networks are likely to have common features. New principled statistical approaches are needed that can deal with different data distributions and jointly consider collections of datasets. Results: We present FuseNet, a Markov network formulation that infers networks from a collection of nonidentically distributed datasets. Our approach is computationally efficient and general: given any number of distributions from an exponential family, FuseNet represents model parameters through shared latent factors that define neighborhoods of network nodes. In a simulation study, we demonstrate good predictive performance of FuseNet in comparison to several popular graphical models. We show its effectiveness in an application to breast cancer RNA-sequencing and somatic mutation data, a novel application of graphical models. Fusion of datasets offers substantial gains relative to inference of separate networks for each dataset. Our results demonstrate that network inference methods for non-Gaussian data can help in accurate modeling of the data generated by emergent high-throughput technologies.","authors":["Zitnik M.","Zupan B."],"cit_count":10,"journal":"Bioinformatics","pmid":"26072487","title":"Gene network inference by fusing data from diverse distributions","year":"2015-06-15"}],"summary":{"biotoolsCURIE":"biotools:fusenet","biotoolsID":"fusenet","description":"Markov network formulation that infers networks from a collection of nonidentically distributed datasets.","homepage":"https://github.com/marinkaz/fusenet","name":"FuseNet"}}