{
    "additionDate": "2021-03-19T08:37:18Z",
    "biotoolsCURIE": "biotools:bets",
    "biotoolsID": "bets",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bee@princeton.edu",
            "name": "Barbara E. Engelhardt",
            "orcidid": "https://orcid.org/0000-0002-6139-7334",
            "typeEntity": "Person"
        },
        {
            "email": "tim.reddy@duke.edu",
            "name": "Timothy E. Reddy",
            "orcidid": "https://orcid.org/0000-0002-7629-061X",
            "typeEntity": "Person"
        }
    ],
    "description": "Bootstrap Elastic net regression from Time Series (BETS) is a statistical framework based on Granger causality for the recovery of a directed gene network from transcriptional time-series data. BETS uses elastic net regression and stability selection from bootstrapped samples to infer causal relationships among genes. BETS is highly parallelized, enabling efficient analysis of large transcriptional data sets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lujonathanh/BETS",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-04-11T12:55:43Z",
    "license": "Apache-2.0",
    "name": "BETS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008223",
            "metadata": {
                "abstract": "© 2021 Lu et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Gene regulatory network inference is essential to uncover complex relationships among gene pathways and inform downstream experiments, ultimately enabling regulatory network re-engineering. Network inference from transcriptional time-series data requires accurate, interpretable, and efficient determination of causal relationships among thousands of genes. Here, we develop Bootstrap Elastic net regression from Time Series (BETS), a statistical framework based on Granger causality for the recovery of a directed gene network from transcriptional time-series data. BETS uses elastic net regression and stability selection from bootstrapped samples to infer causal relationships among genes. BETS is highly parallelized, enabling efficient analysis of large transcriptional data sets. We show competitive accuracy on a community benchmark, the DREAM4 100-gene network inference challenge, where BETS is one of the fastest among methods of similar performance and additionally infers whether causal effects are activating or inhibitory. We apply BETS to transcriptional time-series data of differentially-expressed genes from A549 cells exposed to glucocorticoids over a period of 12 hours. We identify a network of 2768 genes and 31,945 directed edges (FDR ≤ 0.2). We validate inferred causal network edges using two external data sources: Overexpression experiments on the same glucocorticoid system, and genetic variants associated with inferred edges in primary lung tissue in the Genotype-Tissue Expression (GTEx) v6 project. BETS is available as an open source software package at https://github.com/lujonathanh/BETS. Copyright:",
                "authors": [
                    {
                        "name": "Barrera A."
                    },
                    {
                        "name": "Dumitrascu B."
                    },
                    {
                        "name": "Engelhardt B.E."
                    },
                    {
                        "name": "Hong L.K."
                    },
                    {
                        "name": "Jo B."
                    },
                    {
                        "name": "Leichter S.M."
                    },
                    {
                        "name": "Lu J."
                    },
                    {
                        "name": "McDowell I.C."
                    },
                    {
                        "name": "Reddy T.E."
                    }
                ],
                "date": "2021-01-29T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Causal network inference from gene transcriptional time-series response to glucocorticoids"
            },
            "pmcid": "PMC7875426",
            "pmid": "33513136"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
