{
    "additionDate": "2021-03-19T09:11:54Z",
    "biotoolsCURIE": "biotools:motif-raptor",
    "biotoolsID": "motif-raptor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lpinello@mgh.harvard.edu",
            "typeEntity": "Person"
        }
    ],
    "description": "A Cell Type-Specific and Transcription Factor Centric Approach for Post-GWAS Prioritization of Causal Regulators.\n\nWe present Motif-Raptor, a TF-centric computational tool that integrates sequence-based predic-tive models, chromatin accessibility, gene expression datasets and GWAS summary statistics to systematically investigate how TF function is affected by genetic variants.\n\nGenome-wide association studies (GWAS) have identified thousands of common trait-associated genetic variants but interpretation of their function remains challenging.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pinellolab/MotifRaptor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:37:05.400560Z",
    "license": "AGPL-3.0",
    "name": "Motif-Raptor",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btab072",
            "metadata": {
                "abstract": "Motivation: Genome-wide association studies (GWASs) have identified thousands of common trait-associated genetic variants but interpretation of their function remains challenging. These genetic variants can overlap the binding sites of transcription factors (TFs) and therefore could alter gene expression. However, we currently lack a systematic understanding on how this mechanism contributes to phenotype. Results: We present Motif-Raptor, a TF-centric computational tool that integrates sequence-based predictive models, chromatin accessibility, gene expression datasets and GWAS summary statistics to systematically investigate how TF function is affected by genetic variants. Given trait-associated non-coding variants, Motif-Raptor can recover relevant cell types and critical TFs to drive hypotheses regarding their mechanism of action. We tested Motif-Raptor on complex traits such as rheumatoid arthritis and red blood cell count and demonstrated its ability to prioritize relevant cell types, potential regulatory TFs and non-coding SNPs which have been previously characterized and validated. Availability and implementation: Motif-Raptor is freely available as a Python package at: https://github.com/pinellolab/MotifRaptor.",
                "authors": [
                    {
                        "name": "Bauer D.E."
                    },
                    {
                        "name": "Ferragina P."
                    },
                    {
                        "name": "Lettre G."
                    },
                    {
                        "name": "Pinello L."
                    },
                    {
                        "name": "Reshef Y."
                    },
                    {
                        "name": "Yao Q."
                    }
                ],
                "citationCount": 4,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Motif-Raptor: a cell type-specific and transcription factor centric approach for post-GWAS prioritization of causal regulators"
            },
            "pmcid": "PMC11025460",
            "pmid": "33532840"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
