{
    "additionDate": "2020-01-14T19:33:55Z",
    "biotoolsCURIE": "biotools:TOXcms",
    "biotoolsID": "TOXcms",
    "confidence_flag": "tool",
    "description": "Dose-Response Metabolomics to Understand Biochemical Mechanisms and Off-Target Drug Effects with the TOXcms Software.\n\nJob opportunities are available",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://pattilab.wustl.edu/software/toxcms",
    "lastUpdate": "2020-12-28T16:46:47Z",
    "name": "TOXcms",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.9B03811",
            "metadata": {
                "abstract": "© 2019 American Chemical Society.Small-molecule drugs and toxicants commonly interact with more than a single protein target, each of which may have unique effects on cellular phenotype. Although untargeted metabolomics is often applied to understand the mode of action of these chemicals, simple pairwise comparisons of treated and untreated samples are insufficient to resolve the effects of disrupting two or more independent protein targets. Here, we introduce a workflow for dose-response metabolomics to evaluate chemicals that potentially affect multiple proteins with different potencies. Our approach relies on treating samples with various concentrations of compound prior to analysis with mass spectrometry-based metabolomics. Data are then processed with software we developed called TOXcms, which statistically evaluates dose-response trends for each metabolomic signal according to user-defined tolerances and subsequently groups those that follow the same pattern. Although TOXcms was built upon the XCMS framework, it is compatible with any metabolomic data-processing software. Additionally, to enable correlation of dose responses beyond those that can be measured by metabolomics, TOXcms also accepts data from respirometry, cell death assays, other omic platforms, etc. In this work, we primarily focus on applying dose-response metabolomics to find off-target effects of drugs. Using metformin and etomoxir as examples, we demonstrate that each group of dose-response patterns identified by TOXcms signifies a metabolic response to a different protein target with a unique drug binding affinity. TOXcms is freely available on our laboratory website at http://pattilab.wustl.edu/software/toxcms.",
                "authors": [
                    {
                        "name": "Cho K."
                    },
                    {
                        "name": "Patti G.J."
                    },
                    {
                        "name": "Sindelar M."
                    },
                    {
                        "name": "Stancliffe E."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yao C.-H."
                    },
                    {
                        "name": "Yin W."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-21T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Dose-Response Metabolomics to Understand Biochemical Mechanisms and Off-Target Drug Effects with the TOXcms Software"
            },
            "pmid": "31804057"
        }
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
