{
    "additionDate": "2020-01-14T20:01:09Z",
    "biotoolsCURIE": "biotools:SPROF",
    "biotoolsID": "SPROF",
    "confidence_flag": "tool",
    "description": "To Improve Protein Sequence Profile Prediction through Image Captioning on Pairwise Residue Distance Map.\n\nProtein sequence profile prediction aims to generate multiple sequences from structural information to advance the protein design. Protein sequence profile can be computationally predicted by energy-based method or fragment-based methods. By integrating these methods with neural networks, our previous method, SPIN2 has achieved a sequence recovery rate of 34%. However, SPIN2 employed only one dimensional (1D) structural properties that are not sufficient to represent 3D structures. In this study, we represented 3D structures by 2D maps of pairwise residue distances. and developed a new method (SPROF) to predict protein sequence profile based on an image captioning learning frame. To our best knowledge, this is the first method to employ 2D distance map for predicting protein properties.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biomed-AI/SPROF",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-01-16T14:21:26Z",
    "license": "MIT",
    "name": "SPROF",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B00438",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Protein sequence profile prediction aims to generate multiple sequences from structural information to advance the protein design. Protein sequence profile can be computationally predicted by energy-based or fragment-based methods. By integrating these methods with neural networks, our previous method, SPIN2, has achieved a sequence recovery rate of 34%. However, SPIN2 employed only one-dimensional (1D) structural properties that are not sufficient to represent three-dimensional (3D) structures. In this study, we represented 3D structures by 2D maps of pairwise residue distances and developed a new method (SPROF) to predict protein sequence profiles based on an image captioning learning frame. To our best knowledge, this is the first method to employ a 2D distance map for predicting protein properties. SPROF achieved 39.8% in sequence recovery of residues on the independent test set, representing a 5.2% improvement over SPIN2. We also found the sequence recovery increased with the number of their neighbored residues in 3D structural space, indicating that our method can effectively learn long-range information from the 2D distance map. Thus, such network architecture using a 2D distance map is expected to be useful for other 3D structure-based applications, such as binding site prediction, protein function prediction, and protein interaction prediction. The online server and the source code is available at http://biomed.nscc-gz.cn and https://github.com/biomed-AI/SPROF, respectively.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Sun Z."
                    },
                    {
                        "name": "Lin L."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Chong Y."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Zhao H."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-27T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "To Improve Protein Sequence Profile Prediction through Image Captioning on Pairwise Residue Distance Map"
            },
            "pmid": "31800243"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Protein properties",
            "uri": "http://edamontology.org/topic_0123"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}