{
    "accessibility": "Open access",
    "additionDate": "2019-06-21T07:35:40Z",
    "biotoolsCURIE": "biotools:HULK",
    "biotoolsID": "HULK",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "will.rowe@stfc.ac.uk",
            "name": "Will Rowe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Histosketching Using Little Kmers (HULK) - tool that creates small, fixed-size sketches from streaming microbiome sequencing data, enabling rapid metagenomic dissimilarity analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/will-rowe/hulk/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/will-rowe/hulk/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/will-rowe/hulk",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/will-rowe/hulk/issues"
        }
    ],
    "maturity": "Mature",
    "name": "HULK",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s40168-019-0653-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The growth in publically available microbiome data in recent years has yielded an invaluable resource for genomic research, allowing for the design of new studies, augmentation of novel datasets and reanalysis of published works. This vast amount of microbiome data, as well as the widespread proliferation of microbiome research and the looming era of clinical metagenomics, means there is an urgent need to develop analytics that can process huge amounts of data in a short amount of time. To address this need, we propose a new method for tyrhe compact representation of microbiome sequencing data using similarity-preserving sketches of streaming k-mer spectra. These sketches allow for dissimilarity estimation, rapid microbiome catalogue searching and classification of microbiome samples in near real time. Results: We apply streaming histogram sketching to microbiome samples as a form of dimensionality reduction, creating a compressed 'histosketch' that can efficiently represent microbiome k-mer spectra. Using public microbiome datasets, we show that histosketches can be clustered by sample type using the pairwise Jaccard similarity estimation, consequently allowing for rapid microbiome similarity searches via a locality sensitive hashing indexing scheme. Furthermore, we use a 'real life' example to show that histosketches can train machine learning classifiers to accurately label microbiome samples. Specifically, using a collection of 108 novel microbiome samples from a cohort of premature neonates, we trained and tested a random forest classifier that could accurately predict whether the neonate had received antibiotic treatment (97% accuracy, 96% precision) and could subsequently be used to classify microbiome data streams in less than 3 s. Conclusions: Our method offers a new approach to rapidly process microbiome data streams, allowing samples to be rapidly clustered, indexed and classified. We also provide our implementation, Histosketching Using Little K-mers (HULK), which can histosketch a typical 2 GB microbiome in 50 s on a standard laptop using four cores, with the sketch occupying 3000 bytes of disk space. (https://github.com/will-rowe/hulk).",
                "authors": [
                    {
                        "name": "Rowe W.P."
                    },
                    {
                        "name": "Carrieri A.P."
                    },
                    {
                        "name": "Alcon-Giner C."
                    },
                    {
                        "name": "Caim S."
                    },
                    {
                        "name": "Shaw A."
                    },
                    {
                        "name": "Sim K."
                    },
                    {
                        "name": "Kroll J.S."
                    },
                    {
                        "name": "Hall L.J."
                    },
                    {
                        "name": "Pyzer-Knapp E.O."
                    },
                    {
                        "name": "Winn M.D."
                    }
                ],
                "citationCount": 7,
                "date": "2019-03-16T00:00:00Z",
                "journal": "Microbiome",
                "title": "Streaming histogram sketching for rapid microbiome analytics"
            },
            "pmcid": "PMC6420756",
            "pmid": "30878035",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        }
    ],
    "validated": 1
}