
{
    "credit": [
        {
            "email": "stefan.braese@kit.edu",
            "name": "Stefan Bräse",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/ComPlat/chemotion_ELN"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript",
            "Ruby"
        ],
        "license": "AGPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "Computational chemistry",
                "uri": "http://edamontology.org/topic_3332"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). The development of an electronic lab notebook (ELN) for researchers working in the field of chemical sciences is presented. The web based application is available as an Open Source software that offers modern solutions for chemical researchers. The Chemotion ELN is equipped with the basic functionalities necessary for the acquisition and processing of chemical data, in particular the work with molecular structures and calculations based on molecular properties. The ELN supports planning, description, storage, and management for the routine work of organic chemists. It also provides tools for communicating and sharing the recorded research data among colleagues. Meeting the requirements of a state of the art research infrastructure, the ELN allows the search for molecules and reactions not only within the user's data but also in conventional external sources as provided by SciFinder and PubChem. The presented development makes allowance for the growing dependency of scientific activity on the availability of digital information by providing Open Source instruments to record and reuse research data. The current version of the ELN has been using for over half of a year in our chemistry research group, serves as a common infrastructure for chemistry research and enables chemistry researchers to build their own databases of digital information as a prerequisite for the detailed, systematic investigation and evaluation of chemical reactions and mechanisms.",
            "authors": [
                "Tremouilhac P.",
                "Nguyen A.",
                "Huang Y.-C.",
                "Kotov S.",
                "Lutjohann D.S.",
                "Hubsch F.",
                "Jung N.",
                "Brase S."
            ],
            "cit_count": 2,
            "doi": "10.1186/s13321-017-0240-0",
            "journal": "Journal of Cheminformatics",
            "title": "Chemotion ELN: An Open Source electronic lab notebook for chemists in academia",
            "year": "2017-09-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:chemotion_eln",
        "biotoolsID": "chemotion_eln",
        "description": "Open Source electronic lab notebook for chemists in academia.",
        "homepage": "https://github.com/ComPlat/chemotion_ELN",
        "name": "chemotion_ELN"
    }
}