{
    "additionDate": "2023-01-08T15:04:58.707694Z",
    "biotoolsCURIE": "biotools:citedb",
    "biotoolsID": "citedb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "houl@tsinghua.edu.cn",
            "name": "Lin Hou",
            "orcidid": "https://orcid.org/0000-0002-4283-8501",
            "typeEntity": "Person"
        }
    ],
    "description": "A manually curated database of cell-cell interactions in human.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                }
            ]
        }
    ],
    "homepage": "https://citedb.cn/",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-01-08T15:04:58.710536Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/shanny01/benchmark"
        }
    ],
    "name": "CITEdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC654",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.MOTIVATION: The interactions among various types of cells play critical roles in cell functions and the maintenance of the entire organism. While cell-cell interactions are traditionally revealed from experimental studies, recent developments in single-cell technologies combined with data mining methods have enabled computational prediction of cell-cell interactions, which have broadened our understanding of how cells work together, and have important implications in therapeutic interventions targeting cell-cell interactions for cancers and other diseases. Despite the importance, to our knowledge, there is no database for systematic documentation of high-quality cell-cell interactions at the cell type level, which hinders the development of computational approaches to identify cell-cell interactions. RESULTS: We develop a publicly accessible database, CITEdb (Cell-cell InTEraction database, https://citedb.cn/), which not only facilitates interactive exploration of cell-cell interactions in specific physiological contexts (e.g. a disease or an organ) but also provides a benchmark dataset to interpret and evaluate computationally derived cell-cell interactions from different tools. CITEdb contains 728 pairs of cell-cell interactions in human that are manually curated. Each interaction is equipped with structured annotations including the physiological context, the ligand-receptor pairs that mediate the interaction, etc. Our database provides a web interface to search, visualize and download cell-cell interactions. Users can search for cell-cell interactions by selecting the physiological context of interest or specific cell types involved. CITEdb is the first attempt to catalogue cell-cell interactions at the cell type level, which is beneficial to both experimental, computational and clinical studies of cell-cell interactions. AVAILABILITY AND IMPLEMENTATION: CITEdb is freely available at https://citedb.cn/ and the R package implementing benchmark is available at https://github.com/shanny01/benchmark. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Guo H."
                    },
                    {
                        "name": "Hou L."
                    },
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Ren Y."
                    },
                    {
                        "name": "Shan N."
                    },
                    {
                        "name": "Yan L."
                    },
                    {
                        "name": "Zhao X."
                    }
                ],
                "date": "2022-11-15T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "CITEdb: a manually curated database of cell-cell interactions in human"
            },
            "pmcid": "PMC9665858",
            "pmid": "36179089"
        }
    ],
    "toolType": [
        "Database portal",
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
