{
    "additionDate": "2021-03-19T08:32:23Z",
    "biotoolsCURIE": "biotools:rainforest",
    "biotoolsID": "rainforest",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "j.deridder-4@umcutrecht.nl",
            "name": "Jeroen de Ridder",
            "typeEntity": "Person"
        }
    ],
    "description": "This is a random forest approach to predict treatment benefit in data from (failed) clinical drug trials.\n\nR and Python code to run the RAINFOREST (tReAtment benefIt prediction using raNdom FOREST) algorithm R code was used to generate the original results. The python code may be more user friendly and is more configureable.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                }
            ]
        }
    ],
    "homepage": "http://github.com/jubels/RAINFOREST",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-03-31T12:43:57Z",
    "name": "RAINFOREST",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA799",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: When phase III clinical drug trials fail their endpoint, enormous resources are wasted. Moreover, even if a clinical trial demonstrates a significant benefit, the observed effects are often small and may not outweigh the side effects of the drug. Therefore, there is a great clinical need for methods to identify genetic markers that can identify subgroups of patients which are likely to benefit from treatment as this may (i) rescue failed clinical trials and/or (ii) identify subgroups of patients which benefit more than the population as a whole. When single genetic biomarkers cannot be found, machine learning approaches that find multivariate signatures are required. For single nucleotide polymorphism (SNP) profiles, this is extremely challenging owing to the high dimensionality of the data. Here, we introduce RAINFOREST (tReAtment benefIt prediction using raNdom FOREST), which can predict treatment benefit from patient SNP profiles obtained in a clinical trial setting. Results: We demonstrate the performance of RAINFOREST on the CAIRO2 dataset, a phase III clinical trial which tested the addition of cetuximab treatment for metastatic colorectal cancer and concluded there was no benefit. However, we find that RAINFOREST is able to identify a subgroup comprising 27.7% of the patients that do benefit, with a hazard ratio of 0.69 (P ¼ 0.04) in favor of cetuximab. The method is not specific to colorectal cancer and could aid in reanalysis of clinical trial data and provide a more personalized approach to cancer treatment, also when there is no clear link between a single variant and treatment benefit.",
                "authors": [
                    {
                        "name": "Guchelaar H.-J."
                    },
                    {
                        "name": "Punt C."
                    },
                    {
                        "name": "Schaefers T."
                    },
                    {
                        "name": "Ubels J."
                    },
                    {
                        "name": "de Ridder J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Rainforest: A random forest approach to predict treatment benefit in data from (failed) clinical drug trials"
            },
            "pmid": "33381829"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
