{
    "additionDate": "2021-01-18T08:02:13Z",
    "biotoolsCURIE": "biotools:mainmastseg",
    "biotoolsID": "mainmastseg",
    "confidence_flag": "tool",
    "description": "Automated Map Segmentation Method for Cryo-EM Density Maps with Symmetry.\n\nMAINMAST is a de novo modeling protocol to build an entire protein 3D model directly from near-atomic resolution EM map.\n\nMAINMAST is a fully automated protocol and can generate reliable initial C-alpha models which can be used to construct full atomic models. This new de novo modeling method has several advantages; (1) It does not require reference structures; (2) It does not requre manual interventions; (3) a pool of candidate models are generated.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://kiharalab.org/mainmast_seg",
    "lastUpdate": "2021-02-19T09:10:06Z",
    "name": "MAINMASTseg",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.9B01110",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.For structural interpretation of cryo-electron microscopy (cryo-EM) density maps that contain multiple chains, map segmentation is an important step. If a map is segmented accurately into regions of individual protein components, the structure of each protein can be separately modeled using an existing modeling tool. Here, we developed new software, MAINMASTseg, for segmenting maps with symmetry. MAINMASTseg is an extension of the MAINMAST de novo cryo-EM protein structure modeling tool, which builds protein structures from a graph structure that captures the distribution of salient density points in the map. MAINMASTseg uses this graph and segments the map by considering symmetry corresponding density points in the graph. We tested MAINMASTseg on a data set of 38 experimentally determined EM density maps. MAINMASTseg successfully identified an individual protein unit for the majority of the maps, which was significantly better than two other popular existing methods, Segger and Phenix. The software is made freely available for academic users at http://kiharalab.org/mainmast_seg.",
                "authors": [
                    {
                        "name": "Terashi G."
                    },
                    {
                        "name": "Kagaya Y."
                    },
                    {
                        "name": "Kihara D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "MAINMASTseg: Automated Map Segmentation Method for Cryo-EM Density Maps with Symmetry"
            },
            "pmid": "32197044"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}