{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T10:25:46Z",
    "biotoolsCURIE": "biotools:FeatureSelect",
    "biotoolsID": "FeatureSelect",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "LBBSoft",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/LBBSoft"
        }
    ],
    "description": "Software for feature selection based on machine learning approaches.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LBBSoft/FeatureSelect",
    "language": [
        "Java",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "FeatureSelect",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2754-0",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Feature selection, as a preprocessing stage, is a challenging problem in various sciences such as biology, engineering, computer science, and other fields. For this purpose, some studies have introduced tools and softwares such as WEKA. Meanwhile, these tools or softwares are based on filter methods which have lower performance relative to wrapper methods. In this paper, we address this limitation and introduce a software application called FeatureSelect. In addition to filter methods, FeatureSelect consists of optimisation algorithms and three types of learners. It provides a user-friendly and straightforward method of feature selection for use in any kind of research, and can easily be applied to any type of balanced and unbalanced data based on several score functions like accuracy, sensitivity, specificity, etc. Results: In addition to our previously introduced optimisation algorithm (WCC), a total of 10 efficient, well-known and recently developed algorithms have been implemented in FeatureSelect. We applied our software to a range of different datasets and evaluated the performance of its algorithms. Acquired results show that the performances of algorithms are varying on different datasets, but WCC, LCA, FOA, and LA are suitable than others in the overall state. The results also show that wrapper methods are better than filter methods. Conclusions: FeatureSelect is a feature or gene selection software application which is based on wrapper methods. Furthermore, it includes some popular filter methods and generates various comparison diagrams and statistical measurements. It is available from GitHub (https://github.com/LBBSoft/FeatureSelect) and is free open source software under an MIT license.",
                "authors": [
                    {
                        "name": "Masoudi-Sobhanzadeh Y."
                    },
                    {
                        "name": "Motieghader H."
                    },
                    {
                        "name": "Masoudi-Nejad A."
                    }
                ],
                "citationCount": 34,
                "date": "2019-04-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FeatureSelect: A software for feature selection based on machine learning approaches"
            },
            "pmcid": "PMC6446290",
            "pmid": "30943889",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}