
{
    "credit": [
        {
            "email": "ewton@kias.re.kr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.kias.re.kr/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://lee.kias.re.kr/~newton/sann/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Accessible surface calculation",
                    "uri": "http://edamontology.org/operation_0384"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/sann-solvent-accessibility-prediction-by-nearest-neighbor-method.html"
        }
    ],
    "publication": [
        {
            "abstract": "We present a method to predict the solvent accessibility of proteins which is based on a nearest neighbor method applied to the sequence profiles. Using the method, continuous real-value prediction as well as two-state and three-state discrete predictions can be obtained. The method utilizes the z-score value of the distance measure in the feature vector space to estimate the relative contribution among the k-nearest neighbors for prediction of the discrete and continuous solvent accessibility. The Solvent accessibility database is constructed from 5717 proteins extracted from PISCES culling server with the cutoff of 25% sequence identities. Using optimal parameters, the prediction accuracies (for discrete predictions) of 78.38% (two-state prediction with the threshold of 25%), 65.1% (three-state prediction with the thresholds of 9 and 36%), and the Pearson correlation coefficient (between the predicted and true RSA's for continuous prediction) of 0.676 are achieved An independent benchmark test was performed with the CASP8 targets where we find that the proposed method outperforms existing methods. The prediction accuracies are 80.89% (for two state prediction with the threshold of 25%), 67.58% (three-state prediction), and the Pearson correlation coefficient of 0.727 (for continuous prediction) with mean absolute error of 0.148. We have also investigated the effect of increasing database sizes on the prediction accuracy, where additional improvement in the accuracy is observed as the database size increases. The SANN web server is available at. © 2012 Wiley Periodicals, Inc.",
            "authors": [
                "Joo K.",
                "Lee S.J.",
                "Lee J."
            ],
            "cit_count": 38,
            "journal": "Proteins: Structure, Function and Bioinformatics",
            "pmid": "22434533",
            "title": "Sann: Solvent accessibility prediction of proteins by nearest neighbor method",
            "year": "2012-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sann",
        "biotoolsID": "sann",
        "description": "A web server for prediction of protein solvent accessibility by nearest neighbor method.",
        "homepage": "http://lee.kias.re.kr/~newton/sann/",
        "name": "Sann"
    }
}