{
    "additionDate": "2019-11-14T18:19:18Z",
    "biotoolsCURIE": "biotools:GCMDR",
    "biotoolsID": "GCMDR",
    "confidence_flag": "tool",
    "description": "Graph convolution for predicting associations between miRNA and drug resistance | IMPLEMENT FOR graph convolution for predicting associations between miRNA and drug resistance using raw data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xyzx2019/GCMDR",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T19:55:53Z",
    "name": "GCMDR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ621",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: MicroRNA (miRNA) therapeutics is becoming increasingly important. However, aberrant expression of miRNAs is known to cause drug resistance and can become an obstacle for miRNA-based therapeutics. At present, little is known about associations between miRNA and drug resistance and there is no computational tool available for predicting such association relationship. Since it is known that miRNAs can regulate genes that encode specific proteins that are keys for drug efficacy, we propose here a computational approach, called GCMDR, for finding a three-layer latent factor model that can be used to predict miRNA-drug resistance associations. Results: In this paper, we discuss how the problem of predicting such associations can be formulated as a link prediction problem involving a bipartite attributed graph. GCMDR makes use of the technique of graph convolution to build a latent factor model, which can effectively utilize information of high-dimensional attributes of miRNA/drug in an end-to-end learning scheme. In addition, GCMDR also learns graph embedding features for miRNAs and drugs. We leveraged the data from multiple databases storing miRNA expression profile, drug substructure fingerprints, gene ontology and disease ontology. The test for performance shows that the GCMDR prediction model can achieve AUCs of 0.9301 ± 0.0005, 0.9359 ± 0.0006 and 0.9369 ± 0.0003 based on 2-fold, 5-fold and 10-fold cross validation, respectively. Using this model, we show that the associations between miRNA and drug resistance can be reliably predicted by properly introducing useful side information like miRNA expression profile and drug structure fingerprints.",
                "authors": [
                    {
                        "name": "Huang Y.-A."
                    },
                    {
                        "name": "Hu P."
                    },
                    {
                        "name": "Chan K.C.C."
                    },
                    {
                        "name": "You Z.-H."
                    }
                ],
                "citationCount": 15,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Graph convolution for predicting associations between miRNA and drug resistance"
            },
            "pmid": "31397851"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}