{
    "accessibility": "Open access",
    "additionDate": "2022-03-16T10:56:54.489336Z",
    "biotoolsCURIE": "biotools:crt",
    "biotoolsID": "crt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "charles.bland@jsums.edu",
            "name": "Charles Bland"
        },
        {
            "name": "Fareedah Sabree"
        },
        {
            "name": "Kyndall Brown"
        },
        {
            "name": "Micheal Lowe"
        },
        {
            "name": "Teresa L Ramsey"
        }
    ],
    "description": "CRISPR Recognition Tool",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structural variation detection",
                    "uri": "http://edamontology.org/operation_3228"
                }
            ]
        }
    ],
    "homepage": "http://www.room220.com/crt/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-03-16T10:56:54.491933Z",
    "license": "Not licensed",
    "name": "crt",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/1471-2105-8-209",
            "metadata": {
                "abstract": "Background: Clustered Regularly Interspaced Palindromic Repeats (CRISPRs) are a novel type of direct repeat found in a wide range of bacteria and archaea. CRISPRs are beginning to attract attention because of their proposed mechanism; that is, defending their hosts against invading extrachromosomal elements such as viruses. Existing repeat detection tools do a poor job of identifying CRISPRs due to the presence of unique spacer sequences separating the repeats. In this study, a new tool, CRT, is introduced that rapidly and accurately identifies CRISPRs in large DNA strings, such as genomes and metagenomes. Results: CRT was compared to CRISPR detection tools, Patscan and Pilercr. In terms of correctness, CRT was shown to be very reliable, demonstrating significant improvements over Patscan for measures precision, recall and quality. When compared to Pilercr, CRT showed improved performance for recall and quality. In terms of speed, CRT proved to be a huge improvement over Patscan. Both CRT and Pilercr were comparable in speed, however CRT was faster for genomes containing large numbers of repeats. Conclusion: In this paper a new tool was introduced for the automatic detection of CRISPR elements. This tool, CRT, showed some important improvements over current techniques for CRISPR identification. CRT's approach to detecting repetitive sequences is straightforward. It uses a simple sequential scan of a DNA sequence and detects repeats directly without any major conversion or preprocessing of the input. This leads to a program that is easy to describe and understand; yet it is very accurate, fast and memory efficient, being O(n) in space and O(nm/l) in time. © 2007 Bland et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bland C."
                    },
                    {
                        "name": "Brown K."
                    },
                    {
                        "name": "Hugenholtz P."
                    },
                    {
                        "name": "Kyrpides N.C."
                    },
                    {
                        "name": "Lowe M."
                    },
                    {
                        "name": "Ramsey T.L."
                    },
                    {
                        "name": "Sabree F."
                    }
                ],
                "citationCount": 440,
                "date": "2007-06-18T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CRISPR Recognition Tool (CRT): A tool for automatic detection of clustered regularly interspaced palindromic repeats"
            },
            "pmcid": "PMC1924867",
            "pmid": "17577412"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}
