{
    "additionDate": "2015-12-06T15:18:08Z",
    "biotoolsCURIE": "biotools:base",
    "biotoolsID": "base",
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://base.thep.lu.se/wiki/MailingLists"
        }
    ],
    "description": "A comprehensive free web-based database solution for the massive amounts of data generated by microarray analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://base.thep.lu.se/#Documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression data",
                        "uri": "http://edamontology.org/data_2603"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene expression data",
                        "uri": "http://edamontology.org/data_2603"
                    }
                }
            ]
        }
    ],
    "homepage": "http://base.thep.lu.se",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "BASE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mikael.borg@bils.se",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-330",
            "metadata": {
                "abstract": "Background: Microarray experiments are increasing in size and samples are collected asynchronously over long time. Available data are re-analysed as more samples are hybridized. Systematic use of collected data requires tracking of biomaterials, array information, raw data, and assembly of annotations. To meet the information tracking and data analysis challenges in microarray experiments we reimplemented and improved BASE version 1.2. Results: The new BASE presented in this report is a comprehensive annotable local microarray data repository and analysis application providing researchers with an efficient information management and analysis tool. The information management system tracks all material from biosource, via sample and through extraction and labelling to raw data and analysis. All items in BASE can be annotated and the annotations can be used as experimental factors in downstream analysis. BASE stores all microarray experiment related data regardless if analysis tools for specific techniques or data formats are readily available. The BASE team is committed to continue improving and extending BASE to make it usable for even more experimental setups and techniques, and we encourage other groups to target their specific needs leveraging on the infrastructure provided by BASE. Conclusion: BASE is a comprehensive management application for information, data, and analysis of microarray experiments, available as free open source software at http://base.thep.lu.se under the terms of the GPLv3 license. © 2009 Vallon-Christersson et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Vallon-Christersson J."
                    },
                    {
                        "name": "Nordborg N."
                    },
                    {
                        "name": "Svensson M."
                    },
                    {
                        "name": "Hakkinen J."
                    }
                ],
                "citationCount": 40,
                "date": "2009-10-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BASE - 2nd generation software for microarray data management and analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}