{
    "additionDate": "2019-11-14T20:06:59Z",
    "biotoolsCURIE": "biotools:GRASE",
    "biotoolsID": "GRASE",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asteen1@utk.edu",
            "name": "Andrew D. Steen",
            "orcidid": "https://orcid.org/0000-0003-4297-4332",
            "typeEntity": "Person"
        }
    ],
    "description": "Theoretical and Simulation-Based Investigation of the Relationship between Sequencing Effort, Microbial Community Richness, and Diversity in Binning Metagenome-Assembled Genomes | Genome Relative Abundance to Sequencing Effort: a tool for planning MAG sequencing experiments | grase is a package that estimates the sequencing effort required to achieve a goal of MAG construction. This is based on a model presented in Royalty and Steen (2018)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://adsteen.shinyapps.io/grase",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-07T08:04:24Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/adsteen/GRASE"
        }
    ],
    "name": "GRASE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00384-19",
            "metadata": {
                "abstract": "© 2019 Royalty and Steen.We applied theoretical and simulation-based approaches to characterize how microbial community structure influences the amount of sequencing effort to reconstruct metagenomes that are assembled from short-read sequences. First, a coupon collector equation was proposed as an analytical model for predicting sequencing effort as a function of microbial community structure. Characterization was performed by varying community structure properties such as richness, evenness, and genome size. Simulations demonstrated that while community richness and evenness influenced the sequencing effort required to sequence a community metagenome to exhaustion, the effort necessary to sequence an individual genome to a target fraction of exhaustion depended only on the relative abundance of the genome and its genome size. A second analysis evaluated the quantity, completion, and contamination of metagenome-assembled genomes (MAGs) as a function of sequencing effort on four preexisting sequence read data sets from different environments. These data sets were subsampled to various degrees of completeness to simulate the effect of sequencing effort on MAG retrieval. Modeling suggested that sequencing efforts beyond what is typical in published experiments (1 to 10 Gbp) would generate diminishing returns in terms of MAG binning. A software tool, Genome Relative Abundance to Sequencing Effort (GRASE), was created to assist investigators to further explore this relationship. Reevaluation of the relationship between sequencing effort and binning success in the context of genome relative abundance, as opposed to base pairs, provides a constraint on sequencing experiments based on the relative abundance of microbes in an environment rather than arbitrary levels of sequencing effort. IMPORTANCE Short-read sequencing with Illumina sequencing technology provides an accurate, high-throughput method for characterizing the metabolic potential of microbial communities. Short-read sequences can be assembled and binned into metagenome-assembled genomes, thus shedding light on the function of microbial ecosystems that are important for health, agriculture, and Earth system processes. The work presented here provides an analytical framework for selecting sequencing effort as a function of genome relative abundance. As such, experimental goals in metagenome-assembled genome creation projects can select sequencing effort based on the rarest target genome as a constrained threshold. We hope that the results presented here, as well as GRASE, will be valuable to researchers planning sequencing experiments.",
                "authors": [
                    {
                        "name": "Royalty T.M."
                    },
                    {
                        "name": "Steena A.D."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "mSystems",
                "title": "Theoretical and simulation-based investigation of the relationship between sequencing effort, microbial community richness, and diversity in binning metagenome-assembled genomes"
            },
            "pmcid": "PMC6749106",
            "pmid": "31530648"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        }
    ],
    "validated": 1
}
