{
    "additionDate": "2018-09-19T19:51:27Z",
    "biotoolsCURIE": "biotools:amf",
    "biotoolsID": "amf",
    "credit": [
        {
            "email": "zyuan@sjtu.edu.cn",
            "name": "Zheng Yuan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "AgroMarker Finder (AMF) provides a graphical user interface (GUI) to facilitate the recently developed restriction-site associated DNA (RAD) sequencing data analysis in rice.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://erp.novelbio.com/AMF/AgroMarker%20Finder%20Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://erp.novelbio.com/AMF/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/NovelBioCloud/NBCsoftware"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/NovelBioCloud/NBCsoftware/issues"
        }
    ],
    "name": "AMF",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0147187",
            "metadata": {
                "abstract": "© 2016 Fan et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Rapid and accurate genome-wide marker detection is essential to the marker-assisted breeding and functional genomics studies. In this work, we developed an integrated software, AgroMarker Finder (AMF: http://erp.novelbio.com/AMF), for providing graphical user interface (GUI) to facilitate the recently developed restriction-site associated DNA (RAD) sequencing data analysis in rice. By application of AMF, a total of 90,743 high-quality markers (82,878 SNPs and 7,865 InDels) were detected between rice varieties JP69 and Jiaoyuan5A. The density of the identified markers is 0.2 per Kb for SNP markers, and 0.02 per Kb for InDel markers. Sequencing validation revealed that the accuracy of genomewide marker detection by AMF is 93%. In addition, a validated subset of 82 SNPs and 31 InDels were found to be closely linked to 117 important agronomic trait genes, providing a basis for subsequent marker-assisted selection (MAS) and variety identification. Furthermore, we selected 12 markers from 31 validated InDel markers to identify seed authenticity of variety Jiaoyuanyou69, and we also identified 10 markers closely linked to the fragrant gene BADH2 to minimize linkage drag for Wuxiang075 (BADH2 donor)/Jiachang1 recombinants selection. Therefore, this software provides an efficient approach for marker identification from RAD-seq data, and it would be a valuable tool for plant MAS and variety protection.",
                "authors": [
                    {
                        "name": "Fan W."
                    },
                    {
                        "name": "Zong J."
                    },
                    {
                        "name": "Luo Z."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Zhao X."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Qi Y."
                    },
                    {
                        "name": "Yuan Z."
                    }
                ],
                "citationCount": 5,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Development of a RAD-seq based DNA polymorphism identification software, agromarker finder, and its application in rice marker-assisted breeding"
            },
            "pmcid": "PMC4723255",
            "pmid": "26799713",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}