{
    "additionDate": "2021-01-18T11:56:56Z",
    "biotoolsCURIE": "biotools:ngome-lite",
    "biotoolsID": "ngome-lite",
    "confidence_flag": "tool",
    "description": "Proteome-wide prediction of spontaneous protein deamidation highlights differences between taxa.\n\nNGOME-Lite is a fast algorithm able to predict non-enzymatic deamidation of internal asparagine residues in proteins in the absence of structural data, using sequence-based predictions of secondary structure and intrinsic disorder. NGOME-Lite does not require three-dimensional structures yet yields better predictions than available sequence-only methods. Just protein sequences in FASTA or multi-FASTA format is needed to run NGOME-Lite.\n\nPrediction of spontaneous asparagine deamidation at a proteomic scale.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://ngome.proteinphysiologylab.org",
    "lastUpdate": "2021-03-08T13:57:35Z",
    "name": "NGOME-Lite",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.YMETH.2020.11.001",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.Asparagines in proteins deamidate spontaneously, which changes the chemical structure of a protein and often affects its function. Current prediction algorithms for asparagine deamidation require a structure as an input or are too slow to be applied at a proteomic scale. We present NGOME-Lite, a new version of our sequence-based predictor for spontaneous asparagine deamidation that is faster by over two orders of magnitude at a similar degree of accuracy. The algorithm takes into account intrinsic sequence propensities and slowing down of deamidation by local structure. NGOME-Lite can run in a proteomic analysis mode that provides the half-time of the intact form of each protein, predicted by taking into account sequence propensities and structural protection or sequence propensities only, and a structure protection factor. The detailed analysis mode also provides graphical output for all Asn residues in the query sequence. We applied NGOME-Lite to over 257,000 sequences in 38 proteomes and found that different taxa differ in their predicted deamidation dynamics. Spontaneous protein deamidation is faster in Eukarya than in Bacteria because of a higher degree of structural protection in the latter. Predicted protein deamidation half-lifes correlate with protein turnover in human, mouse, rat, C. elegans and budding yeast but not in two plants and two bacteria. NGOME-Lite is implemented in a docker container available at https://ngome.proteinphysiologylab.org.",
                "authors": [
                    {
                        "name": "Lorenzo J.R."
                    },
                    {
                        "name": "Leonetti C.O."
                    },
                    {
                        "name": "Alonso L.G."
                    },
                    {
                        "name": "Sanchez I.E."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods",
                "title": "NGOME-Lite: Proteome-wide prediction of spontaneous protein deamidation highlights differences between taxa"
            },
            "pmid": "33189829"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}