
{
    "credit": [
        {
            "email": "chengw02@gmail.com",
            "name": "Wei Cheng",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cs.unc.edu/~weicheng/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Regression",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/geqtl-unraveling-group-and-individual-associations-in-eqtl-mapping.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016 Cheng et al.Background: As a promising tool for dissecting the genetic basis of common diseases, expression quantitative trait loci (eQTL) study has attracted increasing research interest. Traditional eQTL methods focus on testing the associations between individual single-nucleotide polymorphisms (SNPs) and gene expression traits. A major drawback of this approach is that it cannot model the joint effect of a set of SNPs on a set of genes, which may correspond to biological pathways. Results: To alleviate this limitation, in this paper, we propose geQTL, a sparse regression method that can detect both group-wise and individual associations between SNPs and expression traits. geQTL can also correct the effects of potential confounders. Our method employs computationally efficient technique, thus it is able to fulfill large scale studies. Moreover, our method can automatically infer the proper number of group-wise associations. We perform extensive experiments on both simulated datasets and yeast datasets to demonstrate the effectiveness and efficiency of the proposed method. The results show that geQTL can effectively detect both individual and group-wise signals and outperforms the state-of-the-arts by a large margin. Conclusions: This paper well illustrates that decoupling individual and group-wise associations for association mapping is able to improve eQTL mapping accuracy, and inferring individual and group-wise associations.",
            "authors": [
                "Cheng W.",
                "Shi Y.",
                "Zhang X.",
                "Wang W."
            ],
            "cit_count": 1,
            "doi": "10.1186/s12859-016-0986-9",
            "journal": "BMC Bioinformatics",
            "title": "Sparse regression models for unraveling group and individual associations in eQTL mapping",
            "type": "Primary",
            "year": "2016-03-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:geqtl",
        "biotoolsID": "geqtl",
        "description": "A sparse regression method that can detect both group-wise and individual associations between SNPs and expression traits.",
        "homepage": "http://www.cs.unc.edu/~weicheng/",
        "name": "geQTL"
    }
}