{
    "additionDate": "2019-11-14T19:45:20Z",
    "biotoolsCURIE": "biotools:mountainClimber",
    "biotoolsID": "mountainClimber",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gxxiao@ucla.edu",
            "name": "Xinshu Xiao",
            "typeEntity": "Person"
        }
    ],
    "description": "MountainClimber Identifies Alternative Transcription Start and Polyadenylation Sites in RNA-Seq | Citation: Cass AA and Xiao X. (2019). mountainClimber identifies alternative transcription start and polyadenylation sites in RNA-Seq. Cell Systems | mountainClimber is a tool built for identifying alternative transcription start sites (ATS) and alternative polyadenylation sites (APA) from RNA-Seq by finding significant change points in read coverage. It is made up of three main steps which can be used in isolation:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "http://github.com/gxiaolab/mountainClimber",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T10:17:28Z",
    "license": "Apache-2.0",
    "name": "mountainClimber",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CELS.2019.07.011",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.Alternative transcription start (ATS) and alternative polyadenylation (APA) create alternative RNA isoforms and modulate many aspects of RNA expression and protein production. However, ATS and APA remain difficult to detect in RNA sequencing (RNA-seq). Here, we developed mountainClimber, a de novo cumulative-sum-based approach to identify ATS and APA as change points. Unlike many existing methods, mountainClimber runs on a single sample and identifies multiple ATS or APA sites anywhere in the transcript. We analyzed 2,342 GTEx samples (36 tissues, 215 individuals) and found that tissue type is the predominant driver of transcript end variations. 75% and 65% of genes exhibited differential APA and ATS across tissues, respectively. In particular, testis displayed longer 5′ untranslated regions (UTRs) and shorter 3′ UTRs, often in genes related to testis-specific biology. Overall, we report the largest study of transcript ends across human tissues to our knowledge. mountainClimber is available at github.com/gxiaolab/mountainClimber. © 2019 Elsevier Inc.mountainClimber identifies both ATS and APA sites de novo in RNA-seq. Unlike many existing methods, mountainClimber runs on a single sample and identifies multiple ATS or APA sites anywhere in the transcript. Analysis of 2,342 GTEx samples revealed that tissue type is the predominant driver of transcript end variations, and most genes exhibit ATS and/or APA. In particular, testis displayed longer 5′ untranslated regions (UTRs) and shorter 3′ UTRs, often in genes related to testis-specific biology.",
                "authors": [
                    {
                        "name": "Cass A.A."
                    },
                    {
                        "name": "Xiao X."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-23T00:00:00Z",
                "journal": "Cell Systems",
                "title": "mountainClimber Identifies Alternative Transcription Start and Polyadenylation Sites in RNA-Seq"
            },
            "pmcid": "PMC6813887",
            "pmid": "31542416"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
