{
    "accessibility": "Open access",
    "additionDate": "2022-10-01T19:43:16.068098Z",
    "biotoolsCURIE": "biotools:moveapps",
    "biotoolsID": "moveapps",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "akoelzsch@ab.mpg.de",
            "name": "Andrea Kölzsch",
            "orcidid": "https://orcid.org/0000-0003-0193-1563",
            "typeEntity": "Person"
        },
        {
            "name": "Clemens Hahn"
        },
        {
            "name": "Dominik Gauggel"
        },
        {
            "name": "Sarah C. Davidson"
        }
    ],
    "description": "MoveApps is a no-code analysis platform for animal tracking data hosted by the Max Planck Institute of Animal Behavior. The aim is to make sophisticated analytical tools accessible to a larger audience.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.moveapps.org",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-01T19:43:16.070815Z",
    "name": "MoveApps",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S40462-022-00327-4",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Bio-logging and animal tracking datasets continuously grow in volume and complexity, documenting animal behaviour and ecology in unprecedented extent and detail, but greatly increasing the challenge of extracting knowledge from the data obtained. A large variety of analysis methods are being developed, many of which in effect are inaccessible to potential users, because they remain unpublished, depend on proprietary software or require significant coding skills. Results: We developed MoveApps, an open analysis platform for animal tracking data, to make sophisticated analytical tools accessible to a global community of movement ecologists and wildlife managers. As part of the Movebank ecosystem, MoveApps allows users to design and share workflows composed of analysis modules (Apps) that access and analyse tracking data. Users browse Apps, build workflows, customise parameters, execute analyses and access results through an intuitive web-based interface. Apps, coded in R or other programming languages, have been developed by the MoveApps team and can be contributed by anyone developing analysis code. They become available to all user of the platform. To allow long-term and cross-system reproducibility, Apps have public source code and are compiled and run in Docker containers that form the basis of a serverless cloud computing system. To support reproducible science and help contributors document and benefit from their efforts, workflows of Apps can be shared, published and archived with DOIs in the Movebank Data Repository. The platform was beta launched in spring 2021 and currently contains 49 Apps that are used by 316 registered users. We illustrate its use through two workflows that (1) provide a daily report on active tag deployments and (2) segment and map migratory movements. Conclusions: The MoveApps platform is meant to empower the community to supply, exchange and use analysis code in an intuitive environment that allows fast and traceable results and feedback. By bringing together analytical experts developing movement analysis methods and code with those in need of tools to explore, answer questions and inform decisions based on data they collect, we intend to increase the pace of knowledge generation and integration to match the huge growth rate in bio-logging data acquisition.",
                "authors": [
                    {
                        "name": "Davidson S.C."
                    },
                    {
                        "name": "Gauggel D."
                    },
                    {
                        "name": "Hahn C."
                    },
                    {
                        "name": "Hirt J."
                    },
                    {
                        "name": "Kays R."
                    },
                    {
                        "name": "Kolzsch A."
                    },
                    {
                        "name": "Lang I."
                    },
                    {
                        "name": "Lohr A."
                    },
                    {
                        "name": "Russell B."
                    },
                    {
                        "name": "Safi K."
                    },
                    {
                        "name": "Scharf A.K."
                    },
                    {
                        "name": "Schneider G."
                    },
                    {
                        "name": "Vinciguerra C.M."
                    },
                    {
                        "name": "Wikelski M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Movement Ecology",
                "title": "MoveApps: a serverless no-code analysis platform for animal tracking data"
            },
            "pmcid": "PMC9290230",
            "pmid": "35843990"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
