{
    "additionDate": "2018-07-08T12:56:29Z",
    "biotoolsCURIE": "biotools:crosscheck",
    "biotoolsID": "crosscheck",
    "credit": [
        {
            "email": "info@proteinguru.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open-source web tool for high-throughput screen data analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proteinguru.com/toolbox/crosscheck/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein comparison",
                    "uri": "http://edamontology.org/operation_2997"
                }
            ]
        }
    ],
    "homepage": "http://proteinguru.com/toolbox/crosscheck/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "CrossCheck",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/s41598-017-05960-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Modern high-throughput screening methods allow researchers to generate large datasets that potentially contain important biological information. However, oftentimes, picking relevant hits from such screens and generating testable hypotheses requires training in bioinformatics and the skills to efficiently perform database mining. There are currently no tools available to general public that allow users to cross-reference their screen datasets with published screen datasets. To this end, we developed CrossCheck, an online platform for high-throughput screen data analysis. CrossCheck is a centralized database that allows effortless comparison of the user-entered list of gene symbols with 16,231 published datasets. These datasets include published data from genome-wide RNAi and CRISPR screens, interactome proteomics and phosphoproteomics screens, cancer mutation databases, low-throughput studies of major cell signaling mediators, such as kinases, E3 ubiquitin ligases and phosphatases, and gene ontological information. Moreover, CrossCheck includes a novel database of predicted protein kinase substrates, which was developed using proteome-wide consensus motif searches. CrossCheck dramatically simplifies high-throughput screen data analysis and enables researchers to dig deep into the published literature and streamline data-driven hypothesis generation. CrossCheck is freely accessible as a web-based application at http://proteinguru.com/crosscheck.",
                "authors": [
                    {
                        "name": "Najafov A."
                    },
                    {
                        "name": "Najafov J."
                    }
                ],
                "citationCount": 3,
                "date": "2017-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "CrossCheck: An open-source web tool for high-throughput screen data analysis"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
