
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www-leca.ujf-grenoble.fr/header-footer/article/contact?lang=fr"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www-leca.ujf-grenoble.fr/moyens-techniques/logiciels/article/population-genomics-software?lang=fr#ScanAFLP"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/scanaflp-1-3-evaluate-aflp-electropherograms-phenotyping-marker-selection.html"
        }
    ],
    "publication": [
        {
            "abstract": "A reliable data set is a fundamental prerequisite for consistent results and conclusions in population genetic studies. However, marker scoring of genetic fingerprints such as amplified fragment length polymorphisms (AFLPs) is a highly subjective procedure, inducing inconsistencies owing to personal or laboratory-specific criteria. We applied two alternative marker selection algorithms, the newly developed script scanAFLP and the recently published AFLPScore, to a large AFLP genome scan to test how population genetic parameters and error rates were affected. These results were confronted with replicated random selections of marker subsets. We show that the newly developed marker selection criteria reduced the mismatch error rate and had a notable influence on estimates of genetic diversity and differentiation. Both effects are likely to influence biological inference. For example, genetic diversity (HS) was 29% lower while genetic differentiation (FST) was 8% higher when applying scanAFLP compared with AFLPScore. Likewise, random selections of markers resulted in substantial deviations of population genetic parameters compared with the data sets including specific selection criteria. These randomly selected marker sets showed surprisingly low variance among replicates. We conclude that stringent marker selection and phenotype calling reduces noise in the data set while retaining patterns of population genetic structure.",
            "authors": [
                "Herrmann D.",
                "Poncet B.N.",
                "Manel S.",
                "Rioux D.",
                "Gielly L.",
                "Taberlet P.",
                "Gugerli F."
            ],
            "cit_count": 29,
            "journal": "Genome",
            "pmid": "20616861",
            "title": "Selection criteria for scoring amplified fragment length polymorphisms (AFLPs) positively affect the reliability of population genetic parameter estimates",
            "year": "2010-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:scanaflp",
        "biotoolsID": "scanaflp",
        "description": "A R script to evaluate AFLP electropherograms for phenotyping and marker selection based on peak height distribution and repeatability using blind controls.",
        "homepage": "http://www-leca.ujf-grenoble.fr/moyens-techniques/logiciels/article/population-genomics-software#ScanAFLP",
        "name": "ScanAFLP"
    }
}