{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T10:35:31.102451Z",
    "biotoolsCURIE": "biotools:iml-tylcvs",
    "biotoolsID": "iml-tylcvs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bala2022@skku.edu",
            "name": "Balachandran Manavalan",
            "typeEntity": "Person"
        },
        {
            "name": "Nattanong Bupi",
            "typeEntity": "Person"
        },
        {
            "name": "Sukchan Lee",
            "typeEntity": "Person"
        },
        {
            "name": "Vinoth Kumar Sangaraju",
            "typeEntity": "Person"
        }
    ],
    "description": "Machine learning framework for identifying severity of tomato yellow leaf curl virus and their experimental validation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://balalab-skku.org/IML-TYLCVs",
    "lastUpdate": "2023-11-07T10:35:31.104959Z",
    "name": "IML-TYLCVs",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.34133/RESEARCH.0016",
            "metadata": {
                "abstract": "Tomato yellow leaf curl virus (TYLCV) dispersed across different countries, specifically to subtropical regions, associated with more severe symptoms. Since TYLCV was first isolated in 1931, it has been a menace to tomato industrial production worldwide over the past century. Three groups were newly isolated from TYLCV-resistant tomatoes in 2022; however, their functions are unknown. The development of machine learning (ML)-based models using characterized sequences and evaluating blind predictions is one of the major challenges in interdisciplinary research. The purpose of this study was to develop an integrated computational framework for the accurate identification of symptoms (mild or severe) based on TYLCV sequences (isolated in Korea). For the development of the framework, we first extracted 11 different feature encodings and hybrid features from the training data and then explored 8 different classifiers and developed their respective prediction models by using randomized 10-fold cross-validation. Subsequently, we carried out a systematic evaluation of these 96 developed models and selected the top 90 models, whose predicted class labels were combined and considered as reduced features. On the basis of these features, a multilayer perceptron was applied and developed the final prediction model (IML-TYLCVs). We conducted blind prediction on 3 groups using IML-TYLCVs, and the results indicated that 2 groups were severe and 1 group was mild. Furthermore, we confirmed the prediction with virus-challenging experiments of tomato plant phenotypes using infectious clones from 3 groups. Plant virologists and plant breeding professionals can access the user-friendly online IML-TYLCVs web server at https://balalab-skku.org/ IML-TYLCVs, which can guide them in developing new protection strategies for newly emerging viruses.",
                "authors": [
                    {
                        "name": "Bupi N."
                    },
                    {
                        "name": "Ho P.T."
                    },
                    {
                        "name": "Lal A."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Phan L.T."
                    },
                    {
                        "name": "Qureshi M.A."
                    },
                    {
                        "name": "Sangaraju V.K."
                    },
                    {
                        "name": "Tabassum M."
                    },
                    {
                        "name": "Vo T.T.B."
                    }
                ],
                "citationCount": 5,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Research",
                "title": "An Effective Integrated Machine Learning Framework for Identifying Severity of Tomato Yellow Leaf Curl Virus and Their Experimental Validation"
            },
            "pmcid": "PMC10013792",
            "pmid": "36930763"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
