{
    "additionDate": "2017-08-03T18:46:43Z",
    "biotoolsCURIE": "biotools:ibdmap",
    "biotoolsID": "ibdmap",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.cs.technion.ac.il/index2.html#people"
        }
    ],
    "description": "Factorial HMM based algorithm. Several models are supported in this implementation, including both the standard model and the 4-track model which uses a first order Markovian model for the LD process in a subset of the founders.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioinfo.cs.technion.ac.il/IBDmap/IBDmap.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Probabilistic data generation",
                    "uri": "http://edamontology.org/operation_3480"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.cs.technion.ac.il/IBDmap/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ibdmap-identical-descent-mapping.html"
        }
    ],
    "name": "IBDmap",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Association analysis is the method of choice for studying complex multifactorial diseases. The premise of this method is that affected persons contain some common genomic regions with similar SNP alleles and such areas will be found in this analysis. An important disadvantage of GWA studies is that it does not distinguish between genomic areas that are inherited from a common ancestor [identical by descent (IBD)] and areas that are identical merely by state [identical by state (IBS)]. Clearly, areas that can be marked with higher probability as IBD and have the same correlation with the disease status of identical areas that are more probably only IBS, are better candidates to be causative, and yet this distinction is not encoded in standard association analysis. Results: We develop a factorial hidden Markov model-based algorithm for computing genome-wide IBD sharing. The algorithm accepts as input SNP data of measured individuals and estimates the probability of IBD at each locus for every pair of individuals. For two g-degree relatives, when g≥8, the computation yields a precision of IBD tagging of over 50% higher than previous methods for 95% recall. Our algorithm uses a first-order Markovian model for the linkage disequilibrium process and employs a reduction of the state space of the inheritance vector from being exponential in g to quadratic. The higher accuracy along with the reduced time complexity marks our method as a feasible means for IBD mapping in practical scenarios. Availability: A software implementation, called IBDMAP, is freely available at http://bioinfo.cs.technion.ac.il/IBDmap. Contact: sberco@gmail.com. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Bercovici S."
                    },
                    {
                        "name": "Meek C."
                    },
                    {
                        "name": "Wexler Y."
                    },
                    {
                        "name": "Geiger D."
                    }
                ],
                "citationCount": 17,
                "date": "2010-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Estimating genome-wide IBD sharing from SNP data via an efficient hidden Markov model of LD with application to gene mapping"
            },
            "pmid": "20529903"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}