{
    "additionDate": "2021-01-18T10:36:36Z",
    "biotoolsCURIE": "biotools:wu-neat",
    "biotoolsID": "wu-neat",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vesoulis_z@wustl.edu",
            "name": "Zachary A. Vesoulis",
            "typeEntity": "Person"
        }
    ],
    "description": "Neonatal EEG Analysis Toolbox (NEAT). A clinically validated, open-source MATLAB toolbox for limited-channel neonatal EEG analysis.\n\nMany qualitative and quantitative metrics have been developed to analyze the output of limited-channel EEG recordings in neonates. A significant roadblock in the widespread dissemination of these techniques is the device-specific, “black-box” nature of the analytic algorithms, preventing comparison between studies and the obsolescence of old recordings as software is abandoned. We have developed NEAT (Neonatal EEG Analysis Toolbox) as an open-source software platform to overcome these challenges. NEAT runs within MATLAB and is designed to work with any single-channel EEG input, regardless of source or sampling rate. The second release adds support for GNU Octave.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://research.peds.wustl.edu/neat",
    "lastUpdate": "2021-03-18T10:26:38Z",
    "name": "WU-NEAT",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2020.105716",
            "metadata": {
                "abstract": "© 2020Background: Limited-channel EEG research in neonates is hindered by lack of open, accessible analytic tools. To overcome this limitation, we have created the Washington University-Neonatal EEG Analysis Toolbox (WU-NEAT), containing two of the most commonly used tools, provided in an open-source, clinically-validated package running within MATLAB. Methods: The first algorithm is the amplitude-integrated EEG (aEEG), which is generated by filtering, rectifying and time-compressing the original EEG recording, with subsequent semi-logarithmic display. The second algorithm is the spectral edge frequency (SEF), calculated as the critical frequency below which a user-defined proportion of the EEG spectral power is located. The aEEG algorithm was validated by three experienced reviewers. Reviewers evaluated aEEG recordings of fourteen preterm/term infants, displayed twice in random order, once using a reference algorithm and again using the WU-NEAT aEEG algorithm. Using standard methodology, reviewers assigned a background pattern classification. Inter/intra-rater reliability was assessed. For the SEF, calculations were made using the same fourteen recordings, first with the reference and then with the WU-NEAT algorithm. Results were compared using Pearson's correlation coefficient. Results: For the aEEG algorithm, intra- and inter-rater reliability was 100% and 98%, respectively. For the SEF, the mean±SD Pearson correlation coefficient between algorithms was 0.96±0.04. Conclusion: We have demonstrated a clinically-validated toolbox for generating the aEEG as well as calculating the SEF from EEG data. Open-source access will enable widespread use of common analytic algorithms which are device-independent and unlikely to become outdated as technology changes, thereby facilitating future collaborative research in neonatal EEG.",
                "authors": [
                    {
                        "name": "Vesoulis Z.A."
                    },
                    {
                        "name": "Gamble P.G."
                    },
                    {
                        "name": "Jain S."
                    },
                    {
                        "name": "Ters N.M.E."
                    },
                    {
                        "name": "Liao S.M."
                    },
                    {
                        "name": "Mathur A.M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "WU-NEAT: A clinically validated, open-source MATLAB toolbox for limited-channel neonatal EEG analysis"
            },
            "pmcid": "PMC7606381",
            "pmid": "32858282"
        }
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        }
    ]
}