{
    "accessibility": [],
    "additionDate": "2018-08-12T10:56:01Z",
    "biotoolsCURIE": "biotools:bed_bayesian",
    "biotoolsID": "bed_bayesian",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "regmjeb@ucl.ac.uk",
            "gridid": null,
            "name": "James E. Barrett",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Detection and comparison of epialleles within multiple tumour regions enables phylogenetic analyses, identification of differentially expressed epialleles, and provides a measure of epigenetic heterogeneity.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/james-e-barrett/bed",
    "homepage_status": 0,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "Bayesian Epiallele Detection (BED)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1753-2",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: Epigenetic heterogeneity within a tumour can play an important role in tumour evolution and the emergence of resistance to treatment. It is increasingly recognised that the study of DNA methylation (DNAm) patterns along the genome - so-called 'epialleles' - offers greater insight into epigenetic dynamics than conventional analyses which examine DNAm marks individually. Results: We have developed a Bayesian model to infer which epialleles are present in multiple regions of the same tumour. We apply our method to reduced representation bisulfite sequencing (RRBS) data from multiple regions of one lung cancer tumour and a matched normal sample. The model borrows information from all tumour regions to leverage greater statistical power. The total number of epialleles, the epiallele DNAm patterns, and a noise hyperparameter are all automatically inferred from the data. Uncertainty as to which epiallele an observed sequencing read originated from is explicitly incorporated by marginalising over the appropriate posterior densities. The degree to which tumour samples are contaminated with normal tissue can be estimated and corrected for. By tracing the distribution of epialleles throughout the tumour we can infer the phylogenetic history of the tumour, identify epialleles that differ between normal and cancer tissue, and define a measure of global epigenetic disorder. Conclusions: Detection and comparison of epialleles within multiple tumour regions enables phylogenetic analyses, identification of differentially expressed epialleles, and provides a measure of epigenetic heterogeneity. R code is available at github.com/james-e-barrett.",
                "authors": [
                    {
                        "name": "Barrett J.E."
                    },
                    {
                        "name": "Feber A."
                    },
                    {
                        "name": "Herrero J."
                    },
                    {
                        "name": "Tanic M."
                    },
                    {
                        "name": "Wilson G.A."
                    },
                    {
                        "name": "Swanton C."
                    },
                    {
                        "name": "Beck S."
                    }
                ],
                "citationCount": 2,
                "date": "2017-07-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Quantification of tumour evolution and heterogeneity via Bayesian epiallele detection"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1,
    "version": []
}