{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T13:26:53.082434Z",
    "biotoolsCURIE": "biotools:vcrnet",
    "biotoolsID": "vcrnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jianjun Lei",
            "orcidid": "https://orcid.org/0000-0003-3171-7680"
        },
        {
            "name": "Sam Kwong",
            "orcidid": "https://orcid.org/0000-0001-7484-7261"
        },
        {
            "name": "Yuming Fang",
            "orcidid": "https://orcid.org/0000-0002-6946-3586"
        },
        {
            "name": "Zhaoqing Pan",
            "orcidid": "https://orcid.org/0000-0003-1390-399X"
        }
    ],
    "description": "Visual Compensation Restoration Network for No-Reference Image Quality Assessment.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NUIST-Videocoding/VCRNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-08T13:26:53.085058Z",
    "license": "Not licensed",
    "name": "VCRNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TIP.2022.3144892",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.Guided by the free-energy principle, generative adversarial networks (GAN)-based no-reference image quality assessment (NR-IQA) methods have improved the image quality prediction accuracy. However, the GAN cannot well handle the restoration task for the free-energy principle-guided NR-IQA methods, especially for the severely destroyed images, which results in that the quality reconstruction relationship between the distorted image and its restored image cannot be accurately built. To address this problem, a visual compensation restoration network (VCRNet)-based NR-IQA method is proposed, which uses a non-adversarial model to efficiently handle the distorted image restoration task. The proposed VCRNet consists of a visual restoration network and a quality estimation network. To accurately build the quality reconstruction relationship between the distorted image and its restored image, a visual compensation module, an optimized asymmetric residual block, and an error map-based mixed loss function, are proposed for increasing the restoration capability of the visual restoration network. For further addressing the NR-IQA problem of severely destroyed images, the multi-level restoration features which are obtained from the visual restoration network are used for the image quality estimation. To prove the effectiveness of the proposed VCRNet, seven representative IQA databases are used, and experimental results show that the proposed VCRNet achieves the state-of-the-art image quality prediction accuracy. The implementation of the proposed VCRNet has been released at https://github.com/NUIST-Videocoding/VCRNet.",
                "authors": [
                    {
                        "name": "Fang Y."
                    },
                    {
                        "name": "Kwong S."
                    },
                    {
                        "name": "Lei J."
                    },
                    {
                        "name": "Pan Z."
                    },
                    {
                        "name": "Shao X."
                    },
                    {
                        "name": "Yuan F."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "VCRNet: Visual Compensation Restoration Network for No-Reference Image Quality Assessment"
            },
            "pmid": "35081029"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
