
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ehu.es/biologiacomputacional/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://cplexa.sourceforge.net/mathematica/CplexA_Tutorial.html"
        },
        {
            "type": "User manual",
            "url": "http://cplexa.sourceforge.net/python/CplexA_Tutorial.html"
        },
        {
            "type": "User manual",
            "url": "http://cplexa.sourceforge.net/matlab/CplexA_Tutorial.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Mathematica",
            "MATLAB",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Promoters",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Interactions",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "DNA binding sites",
                "uri": "http://edamontology.org/topic_3125"
            },
            {
                "term": "Transcription factors",
                "uri": "http://edamontology.org/topic_0749"
            },
            {
                "term": "Transcription",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/cplexa-mathematica-package-study-macromolecular-assembly-control.html"
        }
    ],
    "publication": [
        {
            "abstract": "Summary: Macromolecular assembly coordinates essential cellular processes, such as gene regulation and signal transduction. A major challenge for conventional computational methods to study these processes is tackling the exponential increase of the number of configurational states with the number of components. CplexA is a Mathematica package that uses functional programming to efficiently compute probabilities and average properties over such exponentially large number of states from the energetics of the interactions. The package is particularly suited to study gene expression at complex promoters controlled by multiple, local and distal, DNA binding sites for transcription factors. © The Author 2010. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Vilar J.M.G.",
                "Saiz L."
            ],
            "cit_count": 24,
            "doi": "10.1093/bioinformatics/btq328",
            "journal": "Bioinformatics",
            "title": "CplexA: A Mathematica package to study macromolecular-assembly control of gene expression",
            "type": "Primary",
            "year": "2010-06-18"
        },
        {
            "abstract": "The formation and regulation of macromolecular complexes provides the backbone of most cellular processes, including gene regulation and signal transduction. The inherent complexity of assembling macromolecular structures makes current computational methods strongly limited for understanding how the physical interactions between cellular components give rise to systemic properties of cells. Here, we present a stochastic approach to study the dynamics of networks formed by macromolecular complexes in terms of the molecular interactions of their components. Exploiting key thermodynamic concepts, this approach makes it possible to both estimate reaction rates and incorporate the resulting assembly dynamics into the stochastic kinetics of cellular networks. As prototype systems, we consider the lac operon and phage λ induction switches, which rely on the formation of DNA loops by proteins and on the integration of these protein-DNA complexes into intracellular networks. This cross-scale approach offers an effective starting point to move forward from network diagrams, such as those of protein-protein and DNA-protein interaction networks, to the actual dynamics of cellular processes. © 2006 EMBO and Nature Publishing Group.",
            "authors": [
                "Saiz L.",
                "Vilar J.M.G."
            ],
            "cit_count": 38,
            "doi": "10.1038/msb4100061",
            "journal": "Molecular Systems Biology",
            "title": "Stochastic dynamics of macromolecular-assembly networks",
            "type": "Primary",
            "year": "2006-05-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cplexa",
        "biotoolsID": "cplexa",
        "description": "CplexA is a Mathematica package that uses functional programming to efficiently compute probabilities and average properties over such exponentially large number of states from the energetics of the interactions. The package is particularly suited to study gene expression at complex promoters controlled by multiple, local and distal, DNA binding sites for transcription factors.",
        "homepage": "http://cplexa.sourceforge.net/",
        "name": "CplexA",
        "version": [
            "20121212"
        ]
    }
}