{
    "additionDate": "2019-11-14T19:33:37Z",
    "biotoolsCURIE": "biotools:regBase",
    "biotoolsID": "regBase",
    "confidence_flag": "tool",
    "description": "whole genome base-wise aggregation and functional prediction for human non-coding regulatory variants | Base-wise aggregation and functional prediction for human non-coding regulatory variants | regBase is a comprehensively integrated non-coding regulatory prediction scores and composite prediction models from existing tools for base-wise annotation of human genome. As such, the regBase resource provides convenience to prioritize functional regulatory SNVs and assist the fine mapping of causal regulatory SNVs without queries from numerus sources",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mulinlab/regBase",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-13T16:37:37Z",
    "license": "BSD-3-Clause",
    "name": "regBase",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ774",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Predicting the functional or pathogenic regulatory variants in the human non-coding genome facilitates the interpretation of disease causation. While numerous prediction methods are available, their performance is inconsistent or restricted to specific tasks, which raises the demand of developing comprehensive integration for those methods. Here, we compile whole genome base-wise aggregations, regBase, that incorporate largest prediction scores. Building on different assumptions of causality, we train three composite models to score functional, pathogenic and cancer driver non-coding regulatory variants respectively. We demonstrate the superior and stable performance of our models using independent benchmarks and show great success to fine-map causal regulatory variants on specific locus or at base-wise resolution. We believe that regBase database together with three composite models will be useful in different areas of human genetic studies, such as annotation-based casual variant fine-mapping, pathogenic variant discovery as well as cancer driver mutation identification. regBase is freely available at https://github.com/mulinlab/regBase.",
                "authors": [
                    {
                        "name": "Chen K."
                    },
                    {
                        "name": "Dong X."
                    },
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Huang D."
                    },
                    {
                        "name": "Li M.J."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Sham P.C."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Yao H."
                    },
                    {
                        "name": "Yi X."
                    },
                    {
                        "name": "Zhai H."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Zhao K."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-02T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "regBase: whole genome base-wise aggregation and functional prediction for human non-coding regulatory variants"
            },
            "pmid": "31511901"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
