{
    "additionDate": "2021-01-20T10:53:12Z",
    "biotoolsCURIE": "biotools:sorva",
    "biotoolsID": "sorva",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aliz.rao@ucla.edu",
            "name": "Aliz R. Rao",
            "orcidid": "https://orcid.org/0000-0003-3843-4210",
            "typeEntity": "Person"
        }
    ],
    "description": "Calculating the statistical significance of rare variants causal for Mendelian and complex disorders.\n\n<h4>Background< h4>With the expanding use of next-gen sequencing (NGS) to diagnose the thousands of rare Mendelian genetic diseases, it is critical to be able to interpret individual DNA variation. To calculate the significance of finding a rare protein-altering variant in a given gene, one must know the frequency of seeing a variant in the general population that is at least as damaging as the variant in question.<h4>Methods< h4>We developed a general method to better interpret the likelihood that a rare variant is disease causing if observed in a given gene or genic region mapping to a described protein domain, using genome-wide information from a large control sample",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://sorva.genome.ucla.edu",
    "lastUpdate": "2021-05-20T06:20:15Z",
    "name": "SORVA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12920-018-0371-9",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: With the expanding use of next-gen sequencing (NGS) to diagnose the thousands of rare Mendelian genetic diseases, it is critical to be able to interpret individual DNA variation. To calculate the significance of finding a rare protein-altering variant in a given gene, one must know the frequency of seeing a variant in the general population that is at least as damaging as the variant in question. Methods: We developed a general method to better interpret the likelihood that a rare variant is disease causing if observed in a given gene or genic region mapping to a described protein domain, using genome-wide information from a large control sample. Based on data from 2504 individuals in the 1000 Genomes Project dataset, we calculated the number of individuals who have a rare variant in a given gene for numerous filtering threshold scenarios, which may be used for calculating the significance of an observed rare variant being causal for disease. Additionally, we calculated mutational burden data on the number of individuals with rare variants in genic regions mapping to protein domains. Results: We describe methods to use the mutational burden data for calculating the significance of observing rare variants in a given proportion of sequenced individuals. We present SORVA, an implementation of these methods as a web tool, and we demonstrate application to 20 relevant but diverse next-gen sequencing studies. Specifically, we calculate the statistical significance of findings involving multi-family studies with rare Mendelian disease and a large-scale study of a complex disorder, autism spectrum disorder. If we use the frequency counts to rank genes based on intolerance for variation, the ranking correlates well with pLI scores derived from the Exome Aggregation Consortium (ExAC) dataset (ρ = 0.515), with the benefit that the scores are directly interpretable. Conclusions: We have presented a strategy that is useful for vetting candidate genes from NGS studies and allows researchers to calculate the significance of seeing a variant in a given gene or protein domain. This approach is an important step towards developing a quantitative, statistics-based approach for presenting clinical findings.",
                "authors": [
                    {
                        "name": "Nelson S.F."
                    },
                    {
                        "name": "Rao A.R."
                    }
                ],
                "citationCount": 7,
                "date": "2018-06-13T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Calculating the statistical significance of rare variants causal for Mendelian and complex disorders"
            },
            "pmcid": "PMC6001062",
            "pmid": "29898714"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
