{
    "additionDate": "2019-11-14T19:33:59Z",
    "biotoolsCURIE": "biotools:ATC-NLSP",
    "biotoolsID": "ATC-NLSP",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dqwei@sjtu.edu.cn",
            "name": "Dong-Qing Wei",
            "typeEntity": "Person"
        },
        {
            "email": "xiongyi@sjtu.edu.cn",
            "name": "Yi Xiong",
            "typeEntity": "Person"
        },
        {
            "name": "Xiangeng Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Yanjing Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of the Classes of Anatomical Therapeutic Chemicals Using a Network-Based Label Space Partition Method | codes for the drug class prediction paper | Codes and dataset for \"Network-based label space partition for predicting the classes of anatomical therapeutic chemicals\"",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chemical similarity enrichment",
                    "uri": "http://edamontology.org/operation_3502"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dqwei-lab/ATC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T15:50:04Z",
    "license": "GPL-3.0",
    "name": "ATC-NLSP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPHAR.2019.00971",
            "metadata": {
                "abstract": "Copyright © 2019 Wang, Wang, Xu, Xiong and Wei. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.Anatomical Therapeutic Chemical (ATC) classification system proposed by the World Health Organization is a widely accepted drug classification scheme in both academic and industrial realm. It is a multilabeling system which categorizes drugs into multiple classes according to their therapeutic, pharmacological, and chemical attributes. In this study, we adopted a data-driven network-based label space partition (NLSP) method for prediction of ATC classes of a given compound within the multilabel learning framework. The proposed method ATC-NLSP is trained on the similarity-based features such as chemical-chemical interaction and structural and fingerprint similarities of a compound to other compounds belonging to the different ATC categories. The NLSP method trains predictors for each label cluster (possibly intersecting) detected by community detection algorithms and takes the ensemble labels for a compound as final prediction. Experimental evaluation based on the jackknife test on the benchmark dataset demonstrated that our method has boosted the absolute true rate, which is the most stringent evaluation metrics in this study, from 0.6330 to 0.7497, in comparison to the state-of-the-art approaches. Moreover, the community structures of the label relation graph were detected through the label propagation method. The advantage of multilabel learning over the single-label models was shown by label-wise analysis. Our study indicated that the proposed method ATC-NLSP, which adopts ideas from network research community and captures the correlation of labels in a data driven manner, is the top-performing model in the ATC prediction task. We believed that the power of NLSP remains to be unleashed for the multilabel learning tasks in drug discovery. The source codes are freely available at https://github.com/dqwei-lab/ATC.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wei D.-Q."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Xu Z."
                    }
                ],
                "citationCount": 10,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Pharmacology",
                "title": "ATC-NLSP: Prediction of the classes of anatomical therapeutic chemicals using a network-based label space partition method"
            },
            "pmcid": "PMC6739564",
            "pmid": "31543820"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        }
    ],
    "validated": 1
}
