{
    "additionDate": "2017-08-03T18:49:44Z",
    "biotoolsCURIE": "biotools:mlsta",
    "biotoolsID": "mlsta",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.prc.boun.edu.tr/"
        }
    ],
    "description": "Machine learning integration for predicting the effect of single amino acid substitutions on protein stability.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.prc.boun.edu.tr/appserv/prc/mlsta/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://www.prc.boun.edu.tr/appserv/prc/mlsta/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mlsta-machine-learning-integration-for-predicting-the-effect-of-single-amino-acid-substitutions-on-protein-stability.html"
        }
    ],
    "name": "MLSTA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background. Computational prediction of protein stability change due to single-site amino acid substitutions is of interest in protein design and analysis. We consider the following four ways to improve the performance of the currently available predictors: (1) We include additional sequence- and structure-based features, namely, the amino acid substitution likelihoods, the equilibrium fluctuations of the alpha- and beta-carbon atoms, and the packing density. (2) By implementing different machine learning integration approaches, we combine information from different features or representations. (3) We compare classification vs. regression methods to predict the sign vs. the output of stability change. (4) We allow a reject option for doubtful cases where the risk of misclassification is high. Results. We investigate three different approaches: early, intermediate and late integration, which respectively combine features, kernels over feature subsets, and decisions. We perform simulations on two data sets: (1) S1615 is used in previous studies, (2) S2783 is the updated version (as of July 2, 2009) extracted also from ProTherm. For S1615 data set, our highest accuracy using both sequence and structure information is 0.842 on cross-validation and 0.904 on testing using early integration. Newly added features, namely, local compositional packing and the mobility extent of the mutated residues, improve accuracy significantly with intermediate integration. For S2783 data set, we also train regression methods to estimate not only the sign but also the amount of stability change and apply risk-based classification to reject when the learner has low confidence and the loss of misclassification is high. The highest accuracy is 0.835 on cross-validation and 0.832 on testing using only sequence information. The percentage of false positives can be decreased to less than 0.005 by rejecting 10 per cent using late integration. Conclusion. We find that in both early and late integration, combining inputs or decisions is useful in increasing accuracy. Intermediate integration allows assessing the contributions of individual features by looking at the assigned weights. Overall accuracy of regression is not better than that of classification but it has less false positives, especially when combined with the reject option. The server for stability prediction for three integration approaches and the data sets are available at http://www.prc.boun. edu.tr/appserv/prc/mlsta. © 2009 zen et al.",
                "authors": [
                    {
                        "name": "Ozen A."
                    },
                    {
                        "name": "Gonen M."
                    },
                    {
                        "name": "Alpaydn E."
                    },
                    {
                        "name": "Haliloglu T."
                    }
                ],
                "citationCount": 15,
                "date": "2009-12-28T00:00:00Z",
                "journal": "BMC Structural Biology",
                "title": "Machine learning integration for predicting the effect of single amino acid substitutions on protein stability"
            },
            "pmid": "19840377"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        }
    ],
    "validated": 1
}