{
    "accessibility": "Open access",
    "additionDate": "2022-10-01T19:53:41.906858Z",
    "biotoolsCURIE": "biotools:morethananova",
    "biotoolsID": "morethananova",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yyanglian@163.com",
            "name": "Lian Yang",
            "orcidid": "https://orcid.org/0000-0003-0457-9323",
            "typeEntity": "Person"
        },
        {
            "name": "Wanyanhan Jiang"
        },
        {
            "name": "Xiaoqi Pan"
        },
        {
            "name": "Han Chen",
            "orcidid": "https://orcid.org/0000-0003-0367-4847"
        }
    ],
    "description": "A user-friendly Shiny/R application for exploring and comparing data with interactive visualization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://hanchen.shinyapps.io/moreThanANOVA/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-01T19:53:41.909592Z",
    "license": "Not licensed",
    "name": "moreThanANOVA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0271185",
            "metadata": {
                "abstract": "© 2022 Jiang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.In the case of comparing means of various groups, data exploration and comparison for affecting factors or relative indices would be involved. This process is not only complex requiring extensive statistical knowledge and methods, but also challenging for the complex installation of existing tools for users who lack of statistical knowledge and coding experience. Like, the normal distribution and equal variance are crucial premises of parametric statistical analysis. But some studies reported that associated data from various industries violated the normal distribution and equal variance, parametric analysis still involved leading to invalid results. This is owing to that the normal distribution tests and homogeneity of variance test for different variables are time-cost and error-prone, posing an urgent need for an automatic and user-friendly analysis application, not only integrating normal distribution tests and homogeneity of variance test, but also associated the following statistical analysis. To address this, we developed a Shiny/R application, moreThanANOVA, which is an interactive, user-friendly, open-source and cloud-based visualization application to achieve automatic distribution tests, and correlative significance tests, then customize post-hoc analysis based on the considerations to the trade-off of Type I and Type II errors (deployed at https:// hanchen.shinyapps.io/moreThanANOVA/). moreThanANOVA enables novice users to perform their complex statistical analyses quickly and credibly with interactive visualization and download publication-ready graphs for further analysis.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Jiang W."
                    },
                    {
                        "name": "Pan X."
                    },
                    {
                        "name": "Yang L."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "moreThanANOVA: A user-friendly Shiny/R application for exploring and comparing data with interactive visualization"
            },
            "pmcid": "PMC9269871",
            "pmid": "35802729"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
