{
    "name": "Metagenome-Kin", 
    "description": "Metagenome@Kin is an automated high throughput sequencing data analysis tool for the 16S/28S/ITS rRNA genes. It measures the composition and diversity of microbial and fungal species in natural environments.", 
    "homepage": "http://www.w-fusionus.com/metagenome-kin", 
    "biotoolsID": "metagenome-kin", 
    "biotoolsCURIE": "biotools:metagenome-kin", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3221", 
                    "term": "Species frequency estimation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_2238", 
                    "term": "Statistical calculation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3174", 
            "term": "Metagenomics"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1186/s12876-015-0330-2", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Comparison of the gut microbiota composition between obese and non-obese individuals in a Japanese population, as analyzed by terminal restriction fragment length polymorphism and next-generation sequencing", 
                "abstract": "© 2015 Kasai et al. Background: Obesity has become one of the most serious social problems in developed countries, including Japan. The relationship between the gut microbiota and obesity has recently attracted the attention of many researchers. Although the gut microbiota was long thought to contribute to obesity, the exact association remains largely unknown. We examined the human gut microbiota composition in a Japanese population in order to determine its relationship to obesity. Methods: Stool samples from 23 non-obese subjects (body mass index [BMI] <20 kg/m<sup>2</sup>) and 33 obese subjects (BMI ≥25 kg/m<sup>2</sup>) were collected and DNA was extracted prior to colonoscopy. After terminal restriction fragment length polymorphism (T-RFLP) analysis, samples from 10 subjects (4 non-obese and 6 obese) were selected and subjected to next-generation sequencing for species-level analysis. Results: T-RFLP analysis showed significantly reduced numbers of Bacteroidetes and a higher Firmicutes to Bacteroidetes ratio in obese subjects compared with non-obese subjects. Bacterial diversity was significantly greater in obese subjects compared with non-obese subjects. Next-generation sequencing revealed that obese and non-obese subjects had different gut microbiota compositions and that certain bacterial species were significantly associated with each group (obese: Blautia hydrogenotorophica, Coprococcus catus, Eubacterium ventriosum, Ruminococcus bromii, Ruminococcus obeum; non-obese: Bacteroides faecichinchillae, Bacteroides thetaiotaomicron, Blautia wexlerae, Clostridium bolteae, Flavonifractor plautii). Conclusion: Gut microbial properties differ between obese and non-obese subjects in Japan, suggesting that gut microbiota composition is related to obesity.", 
                "date": "2015-08-11T00:00:00Z", 
                "citationCount": 74, 
                "authors": [
                    {
                        "name": "Kasai C."
                    }, 
                    {
                        "name": "Sugimoto K."
                    }, 
                    {
                        "name": "Moritani I."
                    }, 
                    {
                        "name": "Tanaka J."
                    }, 
                    {
                        "name": "Oya Y."
                    }, 
                    {
                        "name": "Inoue H."
                    }, 
                    {
                        "name": "Tameda M."
                    }, 
                    {
                        "name": "Shiraki K."
                    }, 
                    {
                        "name": "Ito M."
                    }, 
                    {
                        "name": "Takei Y."
                    }, 
                    {
                        "name": "Takase K."
                    }
                ], 
                "journal": "BMC Gastroenterology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Contact Form", 
            "email": null, 
            "url": "http://www.w-fusionus.com/contact-purchase", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:15:21Z", 
    "lastUpdate": "2018-12-10T12:58:53Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}