{
    "additionDate": "2019-11-14T18:46:31Z",
    "biotoolsCURIE": "biotools:brea",
    "biotoolsID": "brea",
    "confidence_flag": "tool",
    "description": "A general semiparametric Bayesian discrete-time recurrent events model | Event time variables are often recorded in a discrete fashion, especially in the case of patient-reported outcomes. This work is motivated by a study of illicit drug users, in which time to drug use cessation has been recorded as a number of whole months. Existing approaches for handling such discrete data include treating the survival times as continuous (with adjustments for inevitable tied outcomes), or using discrete models that omit important features like random effects. We provide a general Bayesian discrete-time proportional hazards model, incorporating a number of features popular in continuous-time models such as competing risks and frailties. Our model also provides flexible baseline hazards for time effects, as well as generalized additive models style semiparametric incorporation of other time-varying covariates",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://cran.r-project.org/web/packages/brea/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:52:23.167079Z",
    "name": "brea",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/biostatistics/kxz029",
            "metadata": {
                "abstract": "Event time variables are often recorded in a discrete fashion, especially in the case of patient-reported outcomes. This work is motivated by a study of illicit drug users, in which time to drug use cessation has been recorded as a number of whole months. Existing approaches for handling such discrete data include treating the survival times as continuous (with adjustments for inevitable tied outcomes), or using discrete models that omit important features like random effects. We provide a general Bayesian discrete-time proportional hazards model, incorporating a number of features popular in continuous-time models such as competing risks and frailties. Our model also provides flexible baseline hazards for time effects, as well as generalized additive models style semiparametric incorporation of other time-varying covariates. Our specific modeling choices enable efficient Markov chain Monte Carlo inference algorithms, which we provide to the user in the form of a freely available R package called brea. We demonstrate that our model performs better on our motivating substance abuse application than existing approaches. We also present a reproducible application of the brea software to a freely available data set from a clinical trial of anesthesia administration methods.",
                "authors": [
                    {
                        "name": "King A.J."
                    },
                    {
                        "name": "Weiss R.E."
                    }
                ],
                "citationCount": 2,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Biostatistics",
                "title": "A general semiparametric Bayesian discrete-time recurrent events model"
            },
            "pmcid": "PMC8546916",
            "pmid": "31373358"
        }
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
