{
    "additionDate": "2018-05-28T14:23:41Z",
    "biotoolsCURIE": "biotools:pep2path",
    "biotoolsID": "pep2path",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "marnixmedema@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automate the identification of biosynthetic gene clusters for peptides analyzed by tandem MS approaches, by matching mass shift sequences from mass spectra to the gene clusters that most likely encode the corresponding peptide.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pep2path.sourceforge.net/installation.html"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://pep2path.sourceforge.net/usage.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Tag-based peptide identification",
                    "uri": "http://edamontology.org/operation_3643"
                }
            ]
        }
    ],
    "homepage": "http://pep2path.sourceforge.net",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-03-26T08:30:25Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://sourceforge.net/projects/pep2path/files/"
        }
    ],
    "name": "Pep2Path",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1003822",
            "metadata": {
                "abstract": "© 2014 Medema et al.Nonribosomally and ribosomally synthesized bioactive peptides constitute a source of molecules of great biomedical importance, including antibiotics such as penicillin, immunosuppressants such as cyclosporine, and cytostatics such as bleomycin. Recently, an innovative mass-spectrometry-based strategy, peptidogenomics, has been pioneered to effectively mine microbial strains for novel peptidic metabolites. Even though mass-spectrometric peptide detection can be performed quite fast, true high-throughput natural product discovery approaches have still been limited by the inability to rapidly match the identified tandem mass spectra to the gene clusters responsible for the biosynthesis of the corresponding compounds. With Pep2Path, we introduce a software package to fully automate the peptidogenomics approach through the rapid Bayesian probabilistic matching of mass spectra to their corresponding biosynthetic gene clusters. Detailed benchmarking of the method shows that the approach is powerful enough to correctly identify gene clusters even in data sets that consist of hundreds of genomes, which also makes it possible to match compounds from unsequenced organisms to closely related biosynthetic gene clusters in other genomes. Applying Pep2Path to a data set of compounds without known biosynthesis routes, we were able to identify candidate gene clusters for the biosynthesis of five important compounds. Notably, one of these clusters was detected in a genome from a different subphylum of Proteobacteria than that in which the molecule had first been identified. All in all, our approach paves the way towards high-throughput discovery of novel peptidic natural products. Pep2Path is freely available from http://pep2path.sourceforge.net/, implemented in Python, licensed under the GNU General Public License v3 and supported on MS Windows, Linux and Mac OS X.",
                "authors": [
                    {
                        "name": "Medema M.H."
                    },
                    {
                        "name": "Paalvast Y."
                    },
                    {
                        "name": "Nguyen D.D."
                    },
                    {
                        "name": "Melnik A."
                    },
                    {
                        "name": "Dorrestein P.C."
                    },
                    {
                        "name": "Takano E."
                    },
                    {
                        "name": "Breitling R."
                    }
                ],
                "citationCount": 56,
                "date": "2014-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Pep2Path: Automated Mass Spectrometry-Guided Genome Mining of Peptidic Natural Products"
            },
            "pmcid": "PMC4154637",
            "pmid": "25188327"
        }
    ],
    "toolType": [
        "Suite",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": [
        "1.1.0"
    ]
}