{
    "additionDate": "2019-11-14T18:33:15Z",
    "biotoolsCURIE": "biotools:COLMARm",
    "biotoolsID": "COLMARm",
    "confidence_flag": "tool",
    "description": "Automated Tools for the Analysis of 1D-NMR and 2D-NMR Spectra | COLMARm 13C-1H HSQC, HSQC-TOCSY and TOCSY Query and Verification | Visit a step by step how-to with figures here | Bingol, K.; Li, DW.; Zhang, B.; Brüschweiler, R.; Comprehensive metabolite identification strategy using multiple two-dimensional NMR spectra of a complex mixture implemented in the COLMARm web server; Anal. Chem; 2016, 88, 12411-12418;",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "http://spin.ccic.ohio-state.edu/index.php/colmarm/index",
    "lastUpdate": "2021-02-17T08:42:02Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://spin.ccic.osu.edu/index.php/colmarm/index2"
        }
    ],
    "name": "COLMARm",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9690-2_24",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Nuclear magnetic resonance (NMR) spectroscopy is becoming increasingly automated. Most modern NMR spectrometers are now equipped with auto-tune/auto-match probes along with automated locking and shimming systems. Likewise, more and more instruments, especially for NMR-based metabolomics applications, are equipped with automated sample changers. All this instrumental automation allows NMR data to be collected at a rate of &gt;100 samples/day. However, a continuing bottleneck in NMR-based metabolomics has been the time required to manually analyze and annotate the collected NMR spectra. In many cases, manual spectral annotation and analysis can take one or more hours per spectrum. Fortunately, over the past few years, several software tools have been developed that largely automate the spectral deconvolution or spectral annotation process. Using these tools requires that the samples must be prepared and the NMR spectra must be acquired in a very specific manner. In this chapter, we will describe the step-by-step preparation of biofluid samples along with the required protocols for acquiring optimal spectra for automated NMR metabolomics analysis. We will also discuss the use of three common tools (Chenomx NMR Suite, Bayesil, and COLMARm) for (semi-) automated profiling, and annotation of 1D- and 2D-NMR spectra of biofluids.",
                "authors": [
                    {
                        "name": "Lipfert M."
                    },
                    {
                        "name": "Rout M.K."
                    },
                    {
                        "name": "Berjanskii M."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Automated Tools for the Analysis of 1D-NMR and 2D-NMR Spectra"
            },
            "pmid": "31463859"
        },
        {
            "doi": "10.1021/ACS.JPROTEOME.9B00845",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Accurate identification of lipids in biological samples is a key step in lipidomics studies. Multidimensional nuclear magnetic resonance (NMR) spectroscopy is a powerful analytical tool for this purpose as it provides comprehensive structural information on lipid composition at atomic resolution. However, the interpretation of NMR spectra of complex lipid mixtures is currently hampered by limited spectral resolution and the absence of a customized lipid NMR database along with user-friendly spectral analysis tools. We introduce a new two-dimensional (2D) NMR metabolite database \"COLMAR Lipids\" that was specifically curated for hydrophobic metabolites presently containing 501 compounds with accurate experimental 2D 13C-1H heteronuclear single quantum coherence (HSQC) chemical shift data measured in CDCl3. A new module in the public COLMAR suite of NMR web servers was developed for the (semi)automated analysis of complex lipidomics mixtures (http://spin.ccic.osu.edu/index.php/colmarm/index2). To obtain 2D HSQC spectra with the necessary high spectral resolution along both 13C and 1H dimensions, nonuniform sampling in combination with pure shift spectroscopy was applied allowing the extraction of an abundance of unique cross-peaks belonging to hydrophobic compounds in complex lipidomics mixtures. As shown here, this information is critical for the unambiguous identification of underlying lipid molecules by means of the new COLMAR Lipids web server, also in combination with mass spectrometry, as is demonstrated for Caco-2 cell and lung tissue cell extracts.",
                "authors": [
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Timari I."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Li D.-W."
                    },
                    {
                        "name": "Leggett A."
                    },
                    {
                        "name": "Amer A.O."
                    },
                    {
                        "name": "Bruschweiler-Li L."
                    },
                    {
                        "name": "Kopec R.E."
                    },
                    {
                        "name": "Bruschweiler R."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-03T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "COLMAR Lipids Web Server and Ultrahigh-Resolution Methods for Two-Dimensional Nuclear Magnetic Resonance- And Mass Spectrometry-Based Lipidomics"
            },
            "pmid": "32073269"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ],
    "validated": 1
}