
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "MRI",
                "uri": "http://edamontology.org/topic_3444"
            }
        ]
    },
    "link": [
        {
            "type": "Other",
            "url": "http://spin.ccic.ohio-state.edu/index.php/colmarm"
        }
    ],
    "publication": [
        {
            "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2019.Nuclear magnetic resonance (NMR) spectroscopy is becoming increasingly automated. Most modern NMR spectrometers are now equipped with auto-tune/auto-match probes along with automated locking and shimming systems. Likewise, more and more instruments, especially for NMR-based metabolomics applications, are equipped with automated sample changers. All this instrumental automation allows NMR data to be collected at a rate of &gt;100 samples/day. However, a continuing bottleneck in NMR-based metabolomics has been the time required to manually analyze and annotate the collected NMR spectra. In many cases, manual spectral annotation and analysis can take one or more hours per spectrum. Fortunately, over the past few years, several software tools have been developed that largely automate the spectral deconvolution or spectral annotation process. Using these tools requires that the samples must be prepared and the NMR spectra must be acquired in a very specific manner. In this chapter, we will describe the step-by-step preparation of biofluid samples along with the required protocols for acquiring optimal spectra for automated NMR metabolomics analysis. We will also discuss the use of three common tools (Chenomx NMR Suite, Bayesil, and COLMARm) for (semi-) automated profiling, and annotation of 1D- and 2D-NMR spectra of biofluids.",
            "authors": [
                "Lipfert M.",
                "Rout M.K.",
                "Berjanskii M.",
                "Wishart D.S."
            ],
            "cit_count": 0,
            "doi": "10.1007/978-1-4939-9690-2_24",
            "journal": "Methods in Molecular Biology",
            "pmid": "31463859",
            "title": "Automated Tools for the Analysis of 1D-NMR and 2D-NMR Spectra",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:COLMARm",
        "biotoolsID": "COLMARm",
        "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'Bayesil', 'Chenomx', 'Chenomx NMR', '2D-NMR' | Automated Tools for the Analysis of 1D-NMR and 2D-NMR Spectra | COLMARm 13C-1H HSQC, HSQC-TOCSY and TOCSY Query and Verification | Visit a step by step how-to with figures here | Bingol, K.; Li, DW.; Zhang, B.; Brüschweiler, R.; Comprehensive metabolite identification strategy using multiple two-dimensional NMR spectra of a complex mixture implemented in the COLMARm web server; Anal. Chem; 2016, 88, 12411-12418;",
        "homepage": "http://spin.ccic.ohio-state.edu/index.php/colmarm/index",
        "name": "COLMARm"
    }
}