{
    "additionDate": "2020-01-09T18:13:27Z",
    "biotoolsCURIE": "biotools:EvoClustRNA",
    "biotoolsID": "EvoClustRNA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.magnus@cent.uw.edu.pl",
            "name": "Marcin Magnus",
            "orcidid": "https://orcid.org/0000-0002-5232-2234",
            "typeEntity": "Person"
        },
        {
            "email": "rhiju@stanford.edu",
            "name": "Rhiju Das",
            "typeEntity": "Person"
        }
    ],
    "description": "RNA 3D structure prediction guided by independent folding of homologous sequences and  multiple sequence alignment information docs @ http://EvoClustRNA.rtfd.io.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://evoclustrna.rtfd.io"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mmagnus/EvoClustRNA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T14:23:46Z",
    "license": "GPL-3.0",
    "name": "EvoClustRNA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3120-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The understanding of the importance of RNA has dramatically changed over recent years. As in the case of proteins, the function of an RNA molecule is encoded in its tertiary structure, which in turn is determined by the molecule's sequence. The prediction of tertiary structures of complex RNAs is still a challenging task. Results: Using the observation that RNA sequences from the same RNA family fold into conserved structure, we test herein whether parallel modeling of RNA homologs can improve ab initio RNA structure prediction. EvoClustRNA is a multi-step modeling process, in which homologous sequences for the target sequence are selected using the Rfam database. Subsequently, independent folding simulations using Rosetta FARFAR and SimRNA are carried out. The model of the target sequence is selected based on the most common structural arrangement of the common helical fragments. As a test, on two blind RNA-Puzzles challenges, EvoClustRNA predictions ranked as the first of all submissions for the L-glutamine riboswitch and as the second for the ZMP riboswitch. Moreover, through a benchmark of known structures, we discovered several cases in which particular homologs were unusually amenable to structure recovery in folding simulations compared to the single original target sequence. Conclusion: This work, for the first time to our knowledge, demonstrates the importance of the selection of the target sequence from an alignment of an RNA family for the success of RNA 3D structure prediction. These observations prompt investigations into a new direction of research for checking 3D structure \"foldability\" or \"predictability\" of related RNA sequences to obtain accurate predictions. To support new research in this area, we provide all relevant scripts in a documented and ready-to-use form. By exploring new ideas and identifying limitations of the current RNA 3D structure prediction methods, this work is bringing us closer to the near-native computational RNA 3D models.",
                "authors": [
                    {
                        "name": "Bujnicki J.M."
                    },
                    {
                        "name": "Das R."
                    },
                    {
                        "name": "Kappel K."
                    },
                    {
                        "name": "Magnus M."
                    }
                ],
                "citationCount": 8,
                "date": "2019-10-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RNA 3D structure prediction guided by independent folding of homologous sequences"
            },
            "pmcid": "PMC6806525",
            "pmid": "31640563"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
