{
    "additionDate": "2021-01-18T11:23:52Z",
    "biotoolsCURIE": "biotools:trfdb",
    "biotoolsID": "trfdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lingeng.lu@yale.edu",
            "name": "Lingeng Lu",
            "typeEntity": "Person"
        },
        {
            "email": "zuoheng.wang@yale.edu",
            "name": "Zuoheng Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A relational database of Transfer RNA related Fragments.\n\ntRFs are 14-32 base long single-stranded RNA derived from mature or precursor tRNA and are distinct from the stress-induced tRNA fragments created by cleavage in the anti-codon loop. tRFs have been shown to be important for cell-cycle progression and for regulating the dynamics of RISC.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://genome.bioch.virginia.edu/trfdb/",
    "lastUpdate": "2021-03-04T09:03:52Z",
    "name": "tRFdb",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA831",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Transfer RNA-derived fragments (tRFs) are a new class of small non-coding RNAs and play important roles in biological and physiological processes. Prediction of tRF target genes and binding sites is crucial in understanding the biological functions of tRFs in the molecular mechanisms of human diseases. We developed a publicly accessible web-based database, tRFtarget (http://trftarget.net), for tRF target prediction. It contains the computationally predicted interactions between tRFs and mRNA transcripts using the two state-of-the-art prediction tools RNAhybrid and IntaRNA, including location of the binding sites on the target, the binding region, and free energy of the binding stability with graphic illustration. tRFtarget covers 936 tRFs and 135 thousand predicted targets in eight species. It allows researchers to search either target genes by tRF IDs or tRFs by gene symbols/transcript names. We also integrated the manually curated experimental evidence of the predicted interactions into the database. Furthermore, we provided a convenient link to the DAVID® web server to perform downstream functional pathway analysis and gene ontology annotation on the predicted target genes. This database provides useful information for the scientific community to experimentally validate tRF target genes and facilitate the investigation of the molecular functions and mechanisms of tRFs.",
                "authors": [
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Lu L."
                    },
                    {
                        "name": "Shan N."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TRFtarget: A database for transfer RNA-derived fragment targets"
            },
            "pmid": "33035346"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
