{
    "additionDate": "2020-01-09T18:26:09Z",
    "biotoolsCURIE": "biotools:Machine_Learning",
    "biotoolsID": "Machine_Learning",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "zxhe@isa.ac.cn",
            "name": "Zhixiong He",
            "typeEntity": "Person"
        }
    ],
    "description": "Machine learning classification models for fetal skeletal development performance prediction using maternal bone metabolic proteins in goats.\n\nMachine Learning for goat bone prediction.\n\nClassifiers for Liuyang black goats bone profiles using maternal serum bone metabolism.\n\nDatasets and results will be uploaded after the manuscript will be send to a journal",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://gitlab.com/muntisa/goat-bones-machine-learning",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-09T18:26:09Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/muntisa/Goat-Bones-Machine-Learning"
        }
    ],
    "name": "Machine Learning",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7840",
            "metadata": {
                "abstract": "Copyright 2019 Liu et al.Background. In developing countries, maternal undernutrition is the major intrauterine environmental factor contributing to fetal development and adverse pregnancy outcomes. Maternal nutrition restriction (MNR) in gestation has proven to impact overall growth, bone development, and proliferation and metabolism of mesenchymal stem cells in offspring. However, the efficient method for elucidation of fetal bone development performance through maternal bone metabolic biochemical markers remains elusive. Methods. We adapted goats to elucidate fetal bone development state with maternal serum bone metabolic proteins under malnutrition conditions in mid- and late-gestation stages. We used the experimental data to create 72 datasets by mixing different input features such as one-hot encoding of experimental conditions, metabolic original data, experimental-centered features and experimental condition probabilities. Seven Machine Learning methods have been used to predict six fetal bone parameters (weight, length, and diameter of femur/humerus). Results. The results indicated that MNR influences fetal bone development (femur and humerus) and fetal bone metabolic protein levels (C-terminal telopeptides of collagen I, CTx, in middle-gestation and N-terminal telopeptides of collagen I, NTx, in late-gestation), and maternal bone metabolites (low bone alkaline phosphatase, BALP, in middle-gestation and high BALP in late-gestation). The results show the importance of experimental conditions (ECs) encoding by mixing the information with the serum metabolic data. The best classification models obtained for femur weight (Fw) and length (FI), and humerus weight (Hw) are Support Vector Machines classifiers with the leave-one-out cross-validation accuracy of 1. The rest of the accuracies are 0.98, 0.946 and 0.696 for the diameter of femur (Fd), diameter and length of humerus (Hd, Hl), respectively. With the feature importance analysis, the moving averages mixed ECs are generally more important for the majority of the models. The moving average of parathyroid hormone (PTH) within nutritional conditions (MA-PTH-experim) is important for Fd, Hd and Hl prediction models but its removal for enhancing the Fw, Fl and Hw model performance. Further, using one feature models, it is possible to obtain even more accurate models compared with the feature importance analysis models. In conclusion, the machine learning is an efficient method to confirm the important role of PTH and BALP mixed with nutritional conditions for fetal bone growth performance of goats. All the Python scripts including results and comments are available into an open repository at https://gitlab.com/muntisa/goat-bones-machine-learning.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Munteanu C.R."
                    },
                    {
                        "name": "Yan Q."
                    },
                    {
                        "name": "Pedreira N."
                    },
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "Tang S."
                    },
                    {
                        "name": "Zhou C."
                    },
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Tan Z."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Machine learning classification models for fetal skeletal development performance prediction using maternal bone metabolic proteins in goats"
            },
            "pmcid": "PMC6802673",
            "pmid": "31649832"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}