{
    "additionDate": "2021-03-31T13:22:31Z",
    "biotoolsCURIE": "biotools:arena3dweb",
    "biotoolsID": "arena3dweb",
    "credit": [
        {
            "name": "Georgios Pavlopoulos",
            "orcidid": "http://orcid.org/0000-0002-4577-8276"
        }
    ],
    "description": "Arena3Dweb is the first, fully interactive and dependency-free, web application which allows the visualization of multi-layered graphs in 3D space. With Arena3Dweb, users can integrate multiple networks in a single view along with their intra- and inter-layer connections. For clearer and more informative views, users can choose between a plethora of layout algorithms and apply them on a set of selected layers either individually or in combination. Users can align networks and highlight node topological features, whereas each layer as well as the whole scene can be translated, rotated and scaled in 3D space. User-selected edge colors can be used to highlight important paths, while node positioning, coloring and resizing can be adjusted on-the-fly. In its current version, Arena3Dweb supports weighted and unweighted undirected graphs, is written in R, Shiny and Javascript.",
    "documentation": [
        {
            "type": [
                "Code of conduct"
            ],
            "url": "https://github.com/PavlopoulosLab/Arena3Dweb"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/PavlopoulosLab/Arena3Dweb"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://bib.fleming.gr:3838/Arena3D/",
    "lastUpdate": "2024-11-24T20:27:20.860723Z",
    "name": "Arena3Dweb",
    "owner": "g.pavlopoulos",
    "publication": [
        {
            "doi": "10.1093/nar/gkab278",
            "metadata": {
                "abstract": "Efficient integration and visualization of heterogeneous biomedical information in a single view is a key challenge. In this study, we present Arena3Dweb, the first, fully interactive and dependency-free, web application which allows the visualization of multilayered graphs in 3D space. With Arena3Dweb, users can integrate multiple networks in a single view along with their intra- and inter-layer connections. For clearer and more informative views, users can choose between a plethora of layout algorithms and apply them on a set of selected layers either individually or in combination. Users can align networks and highlight node topological features, whereas each layer as well as the whole scene can be translated, rotated and scaled in 3D space. User-selected edge colors can be used to highlight important paths, while node positioning, coloring and resizing can be adjusted on-the-fly. In its current version, Arena3Dweb supports weighted and unweighted undirected graphs and is written in R, Shiny and JavaScript. We demonstrate the functionality of Arena3Dweb using two different use-case scenarios; one regarding drug repurposing for SARS-CoV-2 and one related to GPCR signaling pathways implicated in melanoma. Arena3Dweb is available at http://bib.fleming.gr:3838/Arena3D or http://bib.fleming.gr/Arena3D.",
                "authors": [
                    {
                        "name": "Baltoumas F.A."
                    },
                    {
                        "name": "Karatzas E."
                    },
                    {
                        "name": "Panayiotou N.A."
                    },
                    {
                        "name": "Pavlopoulos G.A."
                    },
                    {
                        "name": "Schneider R."
                    }
                ],
                "citationCount": 20,
                "date": "2021-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Arena3Dweb: Interactive 3D visualization of multilayered networks"
            },
            "pmcid": "PMC8128064",
            "pmid": "33885790"
        }
    ]
}
