{
    "additionDate": "2021-01-18T09:14:19Z",
    "biotoolsCURIE": "biotools:cmfmtl",
    "biotoolsID": "cmfmtl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "scliu@mail.hzau.edu.cn",
            "name": "Shichao Liu",
            "typeEntity": "Person"
        },
        {
            "email": "fcni_cn@mail.hzau.edu.cn",
            "name": "Fuchuan Ni",
            "typeEntity": "Person"
        }
    ],
    "description": "A script for predicting drug-disease associations via multi-task learning based on collective matrix factorization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LoseHair/CMFMTL",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-02-13T19:08:12Z",
    "name": "CMFMTL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00218",
            "metadata": {
                "abstract": "© Copyright © 2020 Huang, Qiu, Li, Liu and Ni.Identifying drug-disease associations is integral to drug development. Computationally prioritizing candidate drug-disease associations has attracted growing attention due to its contribution to reducing the cost of laboratory screening. Drug-disease associations involve different association types, such as drug indications and drug side effects. However, the existing models for predicting drug-disease associations merely concentrate on independent tasks: recommending novel indications to benefit drug repositioning, predicting potential side effects to prevent drug-induced risk, or only determining the existence of drug-disease association. They ignore crucial prior knowledge of the correlations between different association types. Since the Comparative Toxicogenomics Database (CTD) annotates the drug-disease associations as therapeutic or marker/mechanism, we consider predicting the two types of association. To this end, we propose a collective matrix factorization-based multi-task learning method (CMFMTL) in this paper. CMFMTL handles the problem as multi-task learning where each task is to predict one type of association, and two tasks complement and improve each other by capturing the relatedness between them. First, drug-disease associations are represented as a bipartite network with two types of links representing therapeutic effects and non-therapeutic effects. Then, CMFMTL, respectively, approximates the association matrix regarding each link type by matrix tri-factorization, and shares the low-dimensional latent representations for drugs and diseases in the two related tasks for the goal of collective learning. Finally, CMFMTL puts the two tasks into a unified framework and an efficient algorithm is developed to solve our proposed optimization problem. In the computational experiments, CMFMTL outperforms several state-of-the-art methods both in the two tasks. Moreover, case studies show that CMFMTL helps to find out novel drug-disease associations that are not included in CTD, and simultaneously predicts their association types.",
                "authors": [
                    {
                        "name": "Huang F."
                    },
                    {
                        "name": "Qiu Y."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Ni F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-09T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Predicting Drug-Disease Associations via Multi-Task Learning Based on Collective Matrix Factorization"
            },
            "pmcid": "PMC7179666",
            "pmid": "32373595"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}