{
    "accessibility": "Open access",
    "additionDate": "2023-08-07T20:19:22.746493Z",
    "biotoolsCURIE": "biotools:sysvac",
    "biotoolsID": "sysvac",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pilica@rki.de",
            "name": "Antonia Pilic",
            "orcidid": "https://orcid.org/0000-0001-6502-7982",
            "typeEntity": "Person"
        }
    ],
    "description": "The SYSVAC resources aim to support National Immunization Technical Advisory Groups (NITAGs) and the World Health Organization Strategic Advisory Group of Experts on Immunization (WHO SAGE) in the development of evidence-based vaccination recommendations by simplifying the identification of relevant systematic reviews and access guidance on how to use existing reviews.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                }
            ]
        }
    ],
    "homepage": "https://www.nitag-resource.org/sysvac-systematic-reviews",
    "lastUpdate": "2023-08-07T20:19:22.755627Z",
    "license": "CC-BY-3.0",
    "name": "SYSVAC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.VACCINE.2023.02.027",
            "metadata": {
                "abstract": "National immunization technical advisory groups (NITAGs) develop immunization-related recommendations and assist policy-makers in making evidence informed decisions. Systematic reviews (SRs) that summarize the available evidence on a specific topic are a valuable source of evidence in the development of such recommendations. However, conducting SRs requires significant human, time, and financial resources, which many NITAGs lack. Given that SRs already exist for many immunization-related topics, and to prevent duplication and overlap of reviews, a more practical approach may be for NITAGs to use existing SRs. Nevertheless, it can be challenging to identify relevant SRs, to select one SR from among multiple SRs, or to critically assess and effectively use them. To support NITAGs, the London School of Hygiene and Tropical Medicine, Robert Koch Institute and collaborators developed the SYSVAC project, which consists of an online registry of systematic reviews on immunization-related topics and an e-learning course, that supports the use of them (both freely accessible at https://www.nitag-resource.org/sysvac-systematic-reviews). Drawing from the e-learning course and recommendations from an expert panel, this paper outlines methods for using existing systematic reviews when making immunization-related recommendations. With specific examples and reference to the SYSVAC registry and other resources, it offers guidance on locating existing systematic reviews; assessing their relevance to a research question, up-to-dateness, and methodological quality and/or risk of bias; and considering the transferability and applicability of their findings to other populations or settings.",
                "authors": [
                    {
                        "name": "Bastias M."
                    },
                    {
                        "name": "Burchett H."
                    },
                    {
                        "name": "Campbell P."
                    },
                    {
                        "name": "Gamage D."
                    },
                    {
                        "name": "Harder T."
                    },
                    {
                        "name": "Henaff L."
                    },
                    {
                        "name": "Jo C.L."
                    },
                    {
                        "name": "Kagina B."
                    },
                    {
                        "name": "Kulper-Schiek W."
                    },
                    {
                        "name": "Lunny C."
                    },
                    {
                        "name": "Marti M."
                    },
                    {
                        "name": "Muloiwa R."
                    },
                    {
                        "name": "Pieper D."
                    },
                    {
                        "name": "Pilic A."
                    },
                    {
                        "name": "Reda S."
                    },
                    {
                        "name": "Thomas J."
                    },
                    {
                        "name": "Tunis M.C."
                    },
                    {
                        "name": "Wichmann O."
                    },
                    {
                        "name": "Younger Z."
                    }
                ],
                "date": "2023-03-17T00:00:00Z",
                "journal": "Vaccine",
                "title": "Use of existing systematic reviews for the development of evidence-based vaccination recommendations: Guidance from the SYSVAC expert panel"
            },
            "pmcid": "PMC10015272",
            "pmid": "36804216"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
