{
    "additionDate": "2020-01-09T17:40:34Z",
    "biotoolsCURIE": "biotools:G-WIZ",
    "biotoolsID": "G-WIZ",
    "confidence_flag": "tool",
    "description": "Assessing the performance of genome-wide association studies for predicting disease risk.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jonaspatronjp/GWIZ-Rscript/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-06T16:16:02.396786Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/jonaspatronjp/GWIZ-Rscript/issues"
        }
    ],
    "name": "G-WIZ",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/701086"
        },
        {
            "doi": "10.1371/JOURNAL.PONE.0220215",
            "metadata": {
                "abstract": "© 2019 Patron et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.To date more than 3700 genome-wide association studies (GWAS) have been published that look at the genetic contributions of single nucleotide polymorphisms (SNPs) to human conditions or human phenotypes. Through these studies many highly significant SNPs have been identified for hundreds of diseases or medical conditions. However, the extent to which GWAS-identified SNPs or combinations of SNP biomarkers can predict disease risk is not well known. One of the most commonly used approaches to assess the performance of predictive biomarkers is to determine the area under the receiver-operator characteristic curve (AUROC). We have developed an R package called G-WIZ to generate ROC curves and calculate the AUROC using summary-level GWAS data. We first tested the performance of G-WIZ by using AUROC values derived from patient-level SNP data, as well as literature- reported AUROC values. We found that G-WIZ predicts the AUROC with <3% error. Next, we used the summary level GWAS data from GWAS Central to determine the ROC curves and AUROC values for 569 different GWA studies spanning 219 different conditions. Using these data we found a small number of GWA studies with SNP-derived risk predictors that have very high AUROCs (>0.75). On the other hand, the average GWA study produces a multi-SNP risk predictor with an AUROC of 0.55. Detailed AUROC comparisons indicate that most SNP-derived risk predictions are not as good as clinically based disease risk predictors. All our calculations (ROC curves, AUROCs, explained heritability) are in a publicly accessible database called GWAS-ROCS (http://gwasrocs.ca). The G-WIZ code is freely available for download at https://github.com/jonaspatronjp/GWIZ-Rscript/.",
                "authors": [
                    {
                        "name": "Patron J."
                    },
                    {
                        "name": "Serra-Cayuela A."
                    },
                    {
                        "name": "Han B."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Assessing the performance of genome-wide association studies for predicting disease risk"
            },
            "pmcid": "PMC6894795",
            "pmid": "31805043",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}