{
    "additionDate": "2019-11-14T18:13:58Z",
    "biotoolsCURIE": "biotools:LM-GlycomeAtlas",
    "biotoolsID": "LM-GlycomeAtlas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "chiaki-okatani@aist.go.jp",
            "name": "Chiaki Nagai-Okatani",
            "orcidid": "https://orcid.org/0000-0003-4084-3128",
            "typeEntity": "Person"
        },
        {
            "email": "atsu-kuno@aist.go.jp",
            "name": "Atsushi Kuno",
            "orcidid": "https://orcid.org/0000-0002-6147-6171",
            "typeEntity": "Person"
        }
    ],
    "description": "A Novel Visualization Tool for Lectin Microarray-Based Glycomic Profiles of Mouse Tissue Sections | LM-GlycomeAtlas v.1.0 is a web tool visualizing the data from Lectin Microarray analyses using 45 lectins by the Kuno Laboratory at AIST | This work was supported by a project for utilizing glycans in the development of innovative drug discovery technologies in the project focused on developing key technology for discovering and manufacturing drugs for next-generation treatment and diagnosis from the Japan Agency for Medical Research and Development (AMED) | CFG(Consortium for Functional Glycomics) Glycan Profilling data | Mapping data of human serum data was from Dr. Shunji Natsuka of Niigata University, Japan",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://glycosmos.gitlab.io/lm-glycomeatlas",
    "lastUpdate": "2021-05-27T07:55:45Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://glycosmos.gitlab.io/glycomeatlas"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/glycosmos/lm-glycomeatlas"
        }
    ],
    "name": "LM-GlycomeAtlas",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/MOLECULES24162962",
            "metadata": {
                "abstract": "© 2019 by the authors.For the effective discovery of the biological roles and disease-specific alterations concerning protein glycosylation in tissue samples, it is important to know beforehand the quantitative and qualitative variations of glycan structures expressed in various types of cells, sites, and tissues. To this end, we used laser microdissection-assisted lectin microarray (LMA) to establish a simple and reproducible method for high-throughput and in-depth glycomic profiling of formalin-fixed paraffin-embedded tissue sections. Using this “tissue glycome mapping” approach, we present 234 glycomic profiling data obtained from nine tissue sections (pancreas, heart, lung, thymus, gallbladder, stomach, small intestine, colon, and skin) of two 8-week-old male C57BL/6J mice. We provided this LMA-based dataset in the similar interface as that of GlycomeAtlas, a previously developed tool for mass spectrometry-based tissue glycomic profiling, allowing easy comparison of the two types of data. This online tool, called “LM-GlycomeAtlas”, allows users to visualize the LMA-based tissue glycomic profiling data associated with the sample information as an atlas. Since the present dataset allows the comparison of glycomic profiles, it will facilitate the evaluation of site- and tissue-specific glycosylation patterns. Taking advantage of its extensibility, this tool will continue to be updated with the expansion of deposited data.",
                "authors": [
                    {
                        "name": "Nagai-Okatani C."
                    },
                    {
                        "name": "Aoki-Kinoshita K.F."
                    },
                    {
                        "name": "Kakuda S."
                    },
                    {
                        "name": "Nagai M."
                    },
                    {
                        "name": "Hagiwara K."
                    },
                    {
                        "name": "Kiyohara K."
                    },
                    {
                        "name": "Fujita N."
                    },
                    {
                        "name": "Suzuki Y."
                    },
                    {
                        "name": "Sato T."
                    },
                    {
                        "name": "Angata K."
                    },
                    {
                        "name": "Kuno A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-15T00:00:00Z",
                "journal": "Molecules",
                "title": "LM-Glycomeatlas ver. 1.0: A novel visualization tool for lectin microarray-based glycomic profiles of mouse tissue sections"
            },
            "pmcid": "PMC6719194",
            "pmid": "31443278"
        },
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00907",
            "metadata": {
                "abstract": "© 2020 American Chemical Society. All rights reserved.Laser microdissection-assisted lectin microarray has been used to obtain quantitative and qualitative information on glycans on proteins expressed in microscopic regions of formalin-fixed paraffin-embedded tissue sections. For the effective visualization of this \"tissue glycome mapping\"data, a novel online tool, LM-GlycomeAtlas (https://glycosmos.org/lm_glycomeatlas/index), was launched in the freely available glycoscience portal, the GlyCosmos Portal (https://glycosmos.org). In LM-GlycomeAtlas Version 1.0, nine tissues from normal mice were used to provide one data set of glycomic profiles. Here we introduce an updated version of LM-GlycomeAtlas, which includes more spatial information. We designed it to deposit multiple data sets of glycomic profiles with high-resolution histological images, which included staining images with multiple lectins on the array. The additionally implemented interfaces allow users to display multiple histological images of interest (e.g., diseased and normal mice), thereby facilitating the evaluation of tissue glycomic profiling and glyco-pathological analysis. Using these updated interfaces, 451 glycomic profiling data and 42 histological images obtained from 14 tissues of normal and diseased mice were successfully visualized. By easy integration with other tools for glycoproteomic data and protein glycosylation machinery, LM-GlycomeAtlas will be one of the most valuable open resources that contribute to both glycoscience and proteomics communities.",
                "authors": [
                    {
                        "name": "Nagai-Okatani C."
                    },
                    {
                        "name": "Zou X."
                    },
                    {
                        "name": "Fujita N."
                    },
                    {
                        "name": "Sogabe I."
                    },
                    {
                        "name": "Arakawa K."
                    },
                    {
                        "name": "Nagai M."
                    },
                    {
                        "name": "Angata K."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Aoki-Kinoshita K.F."
                    },
                    {
                        "name": "Kuno A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "LM-GlycomeAtlas Ver. 2.0: An Integrated Visualization for Lectin Microarray-based Mouse Tissue Glycome Mapping Data with Lectin Histochemistry"
            },
            "pmid": "33657805"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}