{
    "additionDate": "2018-09-03T08:23:05Z",
    "biotoolsCURIE": "biotools:prn",
    "biotoolsID": "prn",
    "credit": [
        {
            "email": "ycg.yan@gmail.com",
            "name": "Chao-Gan Yan, Ph.D.",
            "orcidid": "http://orcid.org/0000-0003-3413-5977",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Preprints of the R-fMRI Network. A community funded preprint hosting service. Provides free-submission and free hosting of manuscripts for resting state functional magnetic resonance imaging (R-fMRI) and neuroscience related studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://rfmri.org/PRN",
    "lastUpdate": "2019-01-11T00:34:23Z",
    "name": "PRN",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.5951.2",
            "metadata": {
                "abstract": "© 2015 Yan Cg et al.Sharing drafts of scientific manuscripts on preprint hosting services for early exposure and pre-publication feedback is a well-accepted practice in fields such as physics, astronomy, or mathematics. The field of neuroscience, however, has yet to adopt the preprint model. A reason for this reluctance might partly be the lack of central preprint services for the field of neuroscience. To address this issue, we announce the launch of Preprints of the R-fMRI Network (PRN), a community funded preprint hosting service. PRN provides free-submission and free hosting of manuscripts for resting state functional magnetic resonance imaging (R-fMRI) and neuroscience related studies. Submitted articles are openly discussed and receive feedback from readers and a panel of invited consultants from the R-fMRI Network. All manuscripts and feedback are freely accessible online with citable permanent URL for open-access. The goal of PRN is to supplement the peer reviewed journal publication system - by more rapidly communicating the latest research achievements throughout the world. We hope PRN would help the field to embrace the preprint model and thus further accelerate R-fMRI and neuroscience related studies, eventually enhancing human mental health.",
                "authors": [
                    {
                        "name": "Gao L."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Yan C.-G."
                    }
                ],
                "date": "2015-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "PRN: A preprint service for catalyzing R-fMRI and neuroscience related studies"
            },
            "pmcid": "PMC4367516",
            "pmid": "25844159",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
