{
    "additionDate": "2018-08-07T09:28:34Z",
    "biotoolsCURIE": "biotools:bmodeltest",
    "biotoolsID": "bmodeltest",
    "credit": [
        {
            "email": "remco@cs.auckland.ac.nz",
            "name": "Remco R. Bouckaert",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Bayesian phylogenetic site model averaging and model comparison.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BEAST2-Dev/bModelTest/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BEAST2-Dev/bModelTest",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "LGPL-2.0",
    "name": "bModelTest",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12862-017-0890-6",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Reconstructing phylogenies through Bayesian methods has many benefits, which include providing a mathematically sound framework, providing realistic estimates of uncertainty and being able to incorporate different sources of information based on formal principles. Bayesian phylogenetic analyses are popular for interpreting nucleotide sequence data, however for such studies one needs to specify a site model and associated substitution model. Often, the parameters of the site model is of no interest and an ad-hoc or additional likelihood based analysis is used to select a single site model. Results: bModelTest allows for a Bayesian approach to inferring and marginalizing site models in a phylogenetic analysis. It is based on trans-dimensional Markov chain Monte Carlo (MCMC) proposals that allow switching between substitution models as well as estimating the posterior probability for gamma-distributed rate heterogeneity, a proportion of invariable sites and unequal base frequencies. The model can be used with the full set of time-reversible models on nucleotides, but we also introduce and demonstrate the use of two subsets of time-reversible substitution models. Conclusion: With the new method the site model can be inferred (and marginalized) during the MCMC analysis and does not need to be pre-determined, as is now often the case in practice, by likelihood-based methods. The method is implemented in the bModelTest package of the popular BEAST 2 software, which is open source, licensed under the GNU Lesser General Public License and allows joint site model and tree inference under a wide range of models.",
                "authors": [
                    {
                        "name": "Bouckaert R.R."
                    },
                    {
                        "name": "Drummond A.J."
                    }
                ],
                "citationCount": 138,
                "date": "2017-02-06T00:00:00Z",
                "journal": "BMC Evolutionary Biology",
                "title": "bModelTest: Bayesian phylogenetic site model averaging and model comparison"
            },
            "pmcid": "PMC5294809",
            "pmid": "28166715"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        }
    ],
    "validated": 1
}