
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://medicine.yale.edu/ysph/people/hongyu_zhao.profile"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://zhaocenter.org/software/#Genomic_Protein_Sequence_Analysis"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/psafe-pooled-sequencing-allele-frequency-estimation.html"
        }
    ],
    "publication": [
        {
            "abstract": "Next-generation sequencing is widely used to study complex diseases because of its ability to identify both common and rare variants without prior single nucleotide polymorphism (SNP) information. Pooled sequencing of implicated target regions can lower costs and allow more samples to be analyzed, thus improving statistical power for disease-associated variant detection. Several methods for disease association tests of pooled data and for optimal pooling designs have been developed under certain assumptions of the pooling process, for example, equal/unequal contributions to the pool, sequencing depth variation, and error rate. However, these simplified assumptions may not portray the many factors affecting pooled sequencing data quality, such as PCR amplification during target capture and sequencing, reference allele preferential bias, and others. As a result, the properties of the observed data may differ substantially from those expected under the simplified assumptions. Here, we use real datasets from targeted sequencing of pooled samples, together with microarray SNP genotypes of the same subjects, to identify and quantify factors (biases and errors) affecting the observed sequencing data. Through simulations, we find that these factors have a significant impact on the accuracy of allele frequency estimation and the power of association tests. Furthermore, we develop a workflow protocol to incorporate these factors in data analysis to reduce the potential biases and errors in pooled sequencing data and to gain better estimation of allele frequencies. The workflow, Psafe, is available at http://bioinformatics.med.yale.edu/group/. © 2012 Wiley Periodicals, Inc.",
            "authors": [
                "Chen X.",
                "Listman J.B.",
                "Slack F.J.",
                "Gelernter J.",
                "Zhao H."
            ],
            "cit_count": 16,
            "journal": "Genetic Epidemiology",
            "pmid": "22674656",
            "title": "Biases and Errors on Allele Frequency Estimation and Disease Association Tests of Next-Generation Sequencing of Pooled Samples",
            "year": "2012-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:psafe",
        "biotoolsID": "psafe",
        "description": "Pipeline to adjust the biases and errors of sequencing data to gain more accurate allele frequency estimation.",
        "homepage": "http://zhaocenter.org/software/#Genomic_Protein_Sequence_Analysis",
        "name": "Psafe"
    }
}