
{
    "credit": [
        {
            "email": "xuyan@ustb.edu.cn",
            "name": "Yan Xu Close",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://app.aporc.org/iNitro-Tyr/ReadMe.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/initro-tyr-prediction-of-nitrotyrosine-sites-in-proteins-with-general-pseudo-amino-acid-composition.html"
        }
    ],
    "publication": [
        {
            "abstract": "Nitrotyrosine is one of the post-translational modifications (PTMs) in proteins that occurs when their tyrosine residue is nitrated. Compared with healthy people, a remarkably increased level of nitrotyrosine is detected in those suffering from rheumatoid arthritis, septic shock, and coeliac disease. Given an uncharacterized protein sequence that contains many tyrosine residues, which one of them can be nitrated and which one cannot? This is a challenging problem, not only directly related to in-depth understanding the PTM's mechanism but also to the nitrotyrosine-based drug development. Particularly, with the avalanche of protein sequences generated in the postgenomic age, it is highly desired to develop a high throughput tool in this regard. Here, a new predictor called \"iNitro-Tyr\" was developed by incorporating the position-specific dipeptide propensity into the general pseudo amino acid composition for discriminating the nitrotyrosine sites from non-nitrotyrosine sites in proteins. It was demonstrated via the rigorous jackknife tests that the new predictor not only can yield higher success rate but also is much more stable and less noisy. A web-server for iNitro-Tyr is accessible to the public at http://app.aporc.org/iNitro-Tyr/. For the convenience of most experimental scientists, we have further provided a protocol of step-by-step guide, by which users can easily get their desired results without the need to follow the complicated mathematics that were presented in this paper just for the integrity of its development process. It has not escaped our notice that the approach presented here can be also used to deal with the other PTM sites in proteins. © 2014 Xu et al.",
            "authors": [
                "Xu Y.",
                "Wen X.",
                "Wen L.-S.",
                "Wu L.-Y.",
                "Deng N.-Y.",
                "Chou K.-C."
            ],
            "cit_count": 150,
            "doi": "10.1371/journal.pone.0105018",
            "journal": "PLoS ONE",
            "title": "INitro-Tyr: Prediction of nitrotyrosine sites in proteins with general pseudo amino acid composition",
            "type": "Primary",
            "year": "2014-08-14"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:initro-tyr",
        "biotoolsID": "initro-tyr",
        "description": "New predictor was developed by incorporating the position-specific dipeptide propensity into the general pseudo amino acid composition for discriminating the nitrotyrosine sites from non-nitrotyrosine sites in proteins.",
        "homepage": "http://app.aporc.org/iNitro-Tyr/",
        "name": "iNitro-Tyr"
    }
}