{
    "additionDate": "2021-06-14T13:06:52Z",
    "biotoolsCURIE": "biotools:cetoolbox",
    "biotoolsID": "cetoolbox",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yfrancois@unistra.fr",
            "name": "Yannis Nicolas François",
            "orcidid": "https://orcid.org/0000-0002-8776-071X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The CEToolbox application is a calculator for capillary electrophoresis. It aims to provide several information on the separation of compounds like the hydrodynamic injection, the volume of the capillary, the injection plug length or the quantity of injected analyte. The application works with any type of CE system.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://cetoolbox.github.io/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-08-20T06:35:51.296349Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cetoolbox/cetoolbox"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cetoolbox/cetoolbox/issues"
        }
    ],
    "name": "CEToolbox",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/ELPS.202100036",
            "metadata": {
                "abstract": "© 2021 Wiley-VCH GmbHCE has been demonstrated to be a useful and powerful separation method for the characterization of charged and neutral molecules. Since the end of the 1980s and the development of the first commercialized CE device, the use of this separation method has continued to grow for academic and industrial research involving inexorably increasing of the number of CE users. Whatever the application domain, each CE user is daily confronted to the same problems often based on basic calculations of separation properties. In order to help the community of CE users to get quickly and easily a lot of information, and desiring to provide a tool running on mobile platforms, CEToolbox has been developed as a free Android application. Within few clicks, CEToolbox offers extensive injection information as injected volume, total capillary volume, proportion and amount of injected sample, rinsing time, and electrical field. Moreover, three additional tabs allow to obtain the calculation of the viscosity and the conductivity of BGE, and the separation flow rates. Finally, a last tab is dedicated to the calculation of electroosmotic mobility and effective mobilities for a maximum of 20 compounds. CEToolbox, which can be downloaded for free on Google and F-Droid application stores, was developed to simplify the daily of CE users regardless of the CE devices.",
                "authors": [
                    {
                        "name": "Francois Y.N."
                    },
                    {
                        "name": "Biacchi M."
                    },
                    {
                        "name": "Gahoual R."
                    },
                    {
                        "name": "Vezin A."
                    },
                    {
                        "name": "Pansanel J."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "Electrophoresis",
                "title": "CEToolbox: Specialized calculator for capillary electrophoresis users as an android application"
            },
            "pmid": "33890318"
        }
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}