{
    "accessibility": "Open access",
    "additionDate": "2022-10-02T20:53:44.994762Z",
    "biotoolsCURIE": "biotools:itritikbdb",
    "biotoolsID": "itritikbdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rkaundal@usu.edu",
            "name": "Rakesh Kaundal",
            "orcidid": "https://orcid.org/0000-0001-8683-1240",
            "typeEntity": "Person"
        },
        {
            "name": "Naveen Duhan",
            "orcidid": "https://orcid.org/0000-0003-3014-4921"
        },
        {
            "name": "Raghav Kataria",
            "orcidid": "https://orcid.org/0000-0002-1355-3187"
        }
    ],
    "description": "A Functional Annotation Resource for Deciphering the Complete Interaction Networks in Wheat-Karnal Bunt Pathosystem.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.usu.edu/tritikbdb/",
    "lastUpdate": "2022-10-02T20:53:44.997275Z",
    "name": "iTritiKBdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/IJMS23137455",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.The study of molecular interactions, especially the inter-species protein-protein interactions, is crucial for understanding the disease infection mechanism in plants. These interactions play an important role in disease infection and host immune responses against pathogen attack. Among various critical fungal diseases, the incidences of Karnal bunt (Tilletia indica) around the world have hindered the export of the crops such as wheat from infected regions, thus causing substantial economic losses. Due to sparse information on T. indica, limited insight is available with regard to gaining in-depth knowledge of the interaction mechanisms between the host and pathogen proteins during the disease infection process. Here, we report the development of a comprehensive database and webserver, TritiKBdb, that implements various tools to study the protein-protein interactions in the Triticum species-Tilletia indica pathosystem. The novel ‘interactomics’ tool allows the user to visualize/compare the networks of the predicted interactions in an enriched manner. TritiKBdb is a user-friendly database that provides functional annotations such as subcellular localization, available domains, KEGG pathways, and GO terms of the host and pathogen proteins. Additionally, the information about the host and pathogen proteins that serve as transcription factors and effectors, respectively, is also made available. We believe that TritiKBdb will serve as a beneficial resource for the research community, and aid the community in better understanding the infection mechanisms of Karnal bunt and its interactions with wheat. The database is freely available for public use at http://bioinfo.usu.edu/tritikbdb/.",
                "authors": [
                    {
                        "name": "Duhan N."
                    },
                    {
                        "name": "Kataria R."
                    },
                    {
                        "name": "Kaundal R."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "TritiKBdb: A Functional Annotation Resource for Deciphering the Complete Interaction Networks in Wheat-Karnal Bunt Pathosystem"
            },
            "pmcid": "PMC9267065",
            "pmid": "35806459"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
