{
    "name": "miRNALasso", 
    "description": "Adaptive Lasso based method that integrates full spectrum of sequence features for microRNA target prediction.", 
    "homepage": "http://nba.uth.tmc.edu/homepage/liu/miRNALasso/", 
    "biotoolsID": "mirnalasso", 
    "biotoolsCURIE": "biotools:mirnalasso", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2423", 
                    "term": "Prediction and recognition"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0160", 
            "term": "Sequence sites, features and motifs"
        }, 
        {
            "uri": "http://edamontology.org/topic_0659", 
            "term": "Functional, regulatory and non-coding RNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0099", 
            "term": "RNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mirnalasso-microrna-target-prediction.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://nba.uth.tmc.edu/homepage/liu/miRNALasso/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "26130578", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Integrating full spectrum of sequence features into predicting functional microRNA-mRNA interactions", 
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: MicroRNAs (miRNAs) play important roles in general biological processes and diseases pathogenesis. Identifying miRNA target genes is an essential step to fully understand the regulatory effects of miRNAs. Many computational methods based on the sequence complementary rules and the miRNA and mRNA expression profiles have been developed for this purpose. It is noted that there have been many sequence features of miRNA targets available, including the context features of the target sites, the thermodynamic stability and the accessibility energy for miRNA-mRNA interaction. However, most of current computational methods that combine sequence and expression information do not effectively integrate full spectrum of these features; instead, they perceive putative miRNA-mRNA interactions from sequence-based prediction as equally meaningful. Therefore, these sequence features have not been fully utilized for improving miRNA target prediction. Results: We propose a novel regularized regression approach that is based on the adaptive Lasso procedure for detecting functional miRNA-mRNA interactions. Our method fully takes into account the gene sequence features and the miRNA and mRNA expression profiles. Given a set of sequence features for each putative miRNA-mRNA interaction and their expression values, our model quantifies the down-regulation effect of each miRNA on its targets while simultaneously estimating the contribution of each sequence feature to predicting functional miRNA-mRNA interactions. By applying our model to the expression datasets from two cancer studies, we have demonstrated our prediction results have achieved better sensitivity and specificity and are more biologically meaningful compared with those based on other methods. Availability and implementation: The source code is available at: http://nba.uth.tmc.edu/homepage/liu/miRNALasso.", 
                "date": "2015-12-18T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Wang Z."
                    }, 
                    {
                        "name": "Xu W."
                    }, 
                    {
                        "name": "Liu Y."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Yin Liu", 
            "email": "yin.liu@uth.tmc.edu", 
            "url": "http://nba.uth.tmc.edu/homepage/liu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:07:02Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}