{
    "additionDate": "2017-12-18T00:08:47Z",
    "biotoolsCURIE": "biotools:mimo",
    "biotoolsID": "mimo",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.picb.ac.cn/ClinicalGenomicNTW/"
        }
    ],
    "description": "MIMO addresses the first problem by allowing the introduction of gaps and mismatches between query and template pathways and permits -when necessary- supervised queries incorporating a priori biological information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.picb.ac.cn/ClinicalGenomicNTW/MIMO-1.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.picb.ac.cn/ClinicalGenomicNTW/MIMO.html",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mimo-1-0-molecular-interaction-maps-overlap.html"
        }
    ],
    "name": "MIMO",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-159",
            "metadata": {
                "abstract": "Background: Molecular pathways represent an ensemble of interactions occurring among molecules within the cell and between cells. The identification of similarities between molecular pathways across organisms and functions has a critical role in understanding complex biological processes. For the inference of such novel information, the comparison of molecular pathways requires to account for imperfect matches (flexibility) and to efficiently handle complex network topologies. To date, these characteristics are only partially available in tools designed to compare molecular interaction maps. Results: Our approach MIMO (Molecular Interaction Maps Overlap) addresses the first problem by allowing the introduction of gaps and mismatches between query and template pathways and permits -when necessary- supervised queries incorporating a priori biological information. It then addresses the second issue by relying directly on the rich graph topology described in the Systems Biology Markup Language (SBML) standard, and uses multidigraphs to efficiently handle multiple queries on biological graph databases. The algorithm has been here successfully used to highlight the contact point between various human pathways in the Reactome database. Conclusions: MIMO offers a flexible and efficient graph-matching tool for comparing complex biological pathways. © 2013 Di Lena et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lena P.D."
                    },
                    {
                        "name": "Wu G."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Casadio R."
                    },
                    {
                        "name": "Nardini C."
                    }
                ],
                "citationCount": 12,
                "date": "2013-05-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MIMO: An efficient tool for molecular interaction maps overlap"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Pathways",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}