
{
    "credit": [
        {
            "email": "scop@mrc-lmb.cam.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://scop.mrc-lmb.cam.ac.uk/scop/intro.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure classification",
                    "uri": "http://edamontology.org/operation_2996"
                },
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "publication": [
        {
            "abstract": "To facilitate understanding of, and access to, the information available for protein structures, we have constructed the Structural Classification of Proteins (scop) database. This database provides a detailed and comprehensive description of the structural and evolutionary relationships of the proteins of known structure. It also provides for each entry links to co-ordinates, images of the structure, interactive viewers, sequence data and literature references. Two search facilities are available. The homology search permits users to enter a sequence and obtain a list of any structures to which it has significant levels of sequence similarity. The key word search finds, for a word entered by the user, matches from both the text of the scop database and the headers of Brookhaven Protein Databank structure files. The database is freely accessible on World Wide Web (WWW) with an entry point to URL http://scop.mrc-lmb.cam.ac.uk/scop/. scop: an old English poet or minstrel (Oxford English Dictionary);. ckon: pile, accumulation (Russian Dictionary). © 1995 Academic Press Limited.",
            "authors": [
                "Murzin A.G.",
                "Brenner S.E.",
                "Hubbard T.",
                "Chothia C."
            ],
            "cit_count": 5236,
            "journal": "Journal of Molecular Biology",
            "pmid": "7723011",
            "title": "SCOP: A structural classification of proteins database for the investigation of sequences and structures",
            "year": "1995-04-07"
        },
        {
            "abstract": "The SCOP (Structural Classification of Proteins) database is a comprehensive ordering of all proteins of known structure, according to their evolutionary and structural relationships. Protein domains in SCOP are grouped into species and hierarchically classified into families, superfamilies, folds and classes. Recently, we introduced a new set of features with the aim of standardizing access to the database, and providing a solid basis to manage the increasing number of experimental structures expected from structural genomics projects. These features include: a new set of identifiers, which uniquely identify each entry in the hierarchy; a compact representation of protein domain classification; a new set of parseable files, which fully describe all domains in SCOP and the hierarchy itself. These new features are reflected in the ASTRAL compendium. The SCOP search engine has also been updated, and a set of links to external resources added at the level of domain entries. SCOP can be accessed at http://scop.mrc-lmb.cam.ac.uk/scop.",
            "authors": [
                "Lo Conte L.",
                "Brenner S.E.",
                "Hubbard T.J.P.",
                "Chothia C.",
                "Murzin A.G."
            ],
            "cit_count": 407,
            "journal": "Nucleic Acids Research",
            "pmid": "11752311",
            "title": "SCOP database in 2002: Refinements accomodate structural genomics",
            "year": "2002-01-01"
        },
        {
            "abstract": "The Structural Classification of Proteins (SCOP) database is a comprehensive ordering of all proteins of known structure, according to their evolutionary and structural relationships. The SCOP hierarchy comprises the following levels: Species, Protein, Family, Superfamily, Fold and Class. While keeping the original classification scheme intact, we have changed the production of SCOP in order to cope with a rapid growth of new structural data and to facilitate the discovery of new protein relationships. We describe ongoing developments and new features implemented in SCOP. A new update protocol supports batch classification of new protein structures by their detected relationships at Family and Superfamily levels in contrast to our previous sequential handling of new structural data by release date. We introduce pre-SCOP, a preview of the SCOP developmental version that enables earlier access to the information on new relationships. We also discuss the impact of worldwide Structural Genomics initiatives, which are producing new protein structures at an increasing rate, on the rates of discovery and growth of protein families and superfamilies. SCOP can be accessed at http://scop.mrc-lmb.cam.ac.uk/scop. © 2007 The Author(s).",
            "authors": [
                "Andreeva A.",
                "Howorth D.",
                "Chandonia J.-M.",
                "Brenner S.E.",
                "Hubbard T.J.P.",
                "Chothia C.",
                "Murzin A.G."
            ],
            "cit_count": 751,
            "journal": "Nucleic Acids Research",
            "pmid": "18000004",
            "title": "Data growth and its impact on the SCOP database: New developments",
            "year": "2008-01-01"
        },
        {
            "abstract": "The Structural Classification of Proteins (SCOP) database provides a detailed and comprehensive description of the relationships of all known proteins structures. The classification is on hierarchical levels: the first two levels, family and superfamily, describe near and far evolutionary relationships; the third, fold, describes geometrical relationships. The distinction between evolutionary relationships and those that arise from the physics and chemistry of proteins is a feature that is unique to this database, so far. The database can be used as a source of data to calibrate sequence search algorithms and for the generation of population statistics on protein structures. The database and its associated files are freely accessible from a number of WWW sites mirrored from URL http://scop.mrc-lmb.cam.ac.uk/scop/.",
            "authors": [
                "Hubbard T.J.P.",
                "Ailey B.",
                "Brenner S.E.",
                "Murzin A.G.",
                "Chothia C."
            ],
            "cit_count": 179,
            "journal": "Nucleic Acids Research",
            "pmid": "9847194",
            "title": "SCOP: A structural classification of proteins database",
            "year": "1999-01-01"
        },
        {
            "abstract": "The Structural Classification of Proteins (SCOP) database provides a detailed and comprehensive description of the relationships of known protein structures. The classification is on hierarchical levels: the first two levels, family and superfamily, describe near and distant evolutionary relationships; the third, fold, describes geometrical relationships. The distinction between evolutionary relationships and those that arise from the physics and chemistry of proteins is a feature that is unique to this database so far. The sequences of proteins in SCOP provide the basis of the ASTRAL sequence libraries that can be used as a source of data to calibrate sequence search algorithms and for the generation of statistics on, or selections of, protein structures. Links can be made from SCOP to PDB-ISL: a library containing sequences homologous to proteins of known structure. Sequences of proteins of unknown structure can be matched to distantly related proteins of known structure by using pairwise sequence comparison methods to find homologues in PDB-ISL. The database and its associated files are freely accessible from a number of WWW sites mirrored from URL http://scop.mrc-lmb.cam.ac.uk/scop/.",
            "authors": [
                "Lo Conte L.",
                "Ailey B.",
                "Hubbard T.J.P.",
                "Brenner S.E.",
                "Murzin A.G.",
                "Chothia C."
            ],
            "cit_count": 480,
            "journal": "Nucleic Acids Research",
            "pmid": "10592240",
            "title": "SCOP: A structural classification of proteins database",
            "year": "2000-01-01"
        },
        {
            "abstract": "The Structural Classification of Proteins (SCOP) database is a comprehensive ordering of all proteins of known structure, according to their evolutionary and structural relationships. Protein domains in SCOP are hierarchically classified into families, superfamilies, folds and classes. The continual accumulation of sequence and structural data allows more rigorous analysis and provides important information for understanding the protein world and its evolutionary repertoire. SCOP participates in a project that aims to rationalize and integrate the data on proteins held in several sequence and structure databases. As part of this project, starting with release 1.63, we have initiated a refinement of the SCOP classification, which introduces a number of changes mostly at the levels below superfamily. The pending SCOP reclassification will be carried out gradually through a number of future releases. In addition to the expanded set of static links to external resources, available at the level of domain entries, we have started modernization of the interface capabilities of SCOP allowing more dynamic links with other databases. SCOP can be accessed at http://scop.mrc-lmb.cam.ac.uk/scop.",
            "authors": [
                "Andreeva A.",
                "Howorth D.",
                "Brenner S.E.",
                "Hubbard T.J.P.",
                "Chothia C.",
                "Murzin A.G."
            ],
            "cit_count": 735,
            "journal": "Nucleic Acids Research",
            "pmid": "14681400",
            "title": "SCOP database in 2004: Refinements integrate structure and sequence family data",
            "year": "2004-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:scop",
        "biotoolsID": "scop",
        "description": "Database created by a combination of manual inspection and automated methods. Comprehensive ordering of all proteins of known structure, according to evolutionary and structural relationships.",
        "homepage": "http://scop.mrc-lmb.cam.ac.uk/scop/",
        "name": "SCOP"
    }
}