{
    "additionDate": "2021-11-29T12:29:27.480801Z",
    "biotoolsCURIE": "biotools:schictools",
    "biotoolsID": "schictools",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "drjieliu@umich.edu",
            "name": "Jie Liu",
            "orcidid": "https://orcid.org/0000-0002-9504-0587",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "scHiCTools is a computational toolbox for analyzing single cell Hi-C (high-throughput sequencing for 3C) data which includes functions for Loading single-cell HiC datasets, Screening valid single-cell data, Smoothing the contact maps with linear convolution, random walk or network enhancing, Calculating pairwise similarity using measures include InnerProduct, HiCRep and Selfish, Calculating embeddings for single cell HiC datasets efficiently with MDS, t-SNE and PHATE, Clustering the cells using scHiCluster, k-means and spectral clustering, and Visualizing embedded cells via 2-D or 3-D scatter plot.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/liu-bioinfo-lab/scHiCTools",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-29T12:29:27.483344Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/liu-bioinfo-lab/scHiCTools/issues"
        }
    ],
    "name": "scHiCTools",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008978",
            "metadata": {
                "abstract": "Copyright: © 2021 Li et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Single-cell Hi-C (scHi-C) sequencing technologies allow us to investigate three-dimensional chromatin organization at the single-cell level. However, we still need computational tools to deal with the sparsity of the contact maps from single cells and embed single cells in a lower-dimensional Euclidean space. This embedding helps us understand relationships between the cells in different dimensions, such as cell-cycle dynamics and cell differentiation. We present an open-source computational toolbox, scHiCTools, for analyzing single-cell Hi-C data comprehensively and efficiently. The toolbox provides two methods for screening single cells, three common methods for smoothing scHi-C data, three efficient methods for calculating the pairwise similarity of cells, three methods for embedding single cells, three methods for clustering cells, and a build-in function to visualize the cells embedding in a two-dimensional or three-dimensional plot. scHiCTools, written in Python3, is compatible with different platforms, including Linux, macOS, and Windows.",
                "authors": [
                    {
                        "name": "Feng F."
                    },
                    {
                        "name": "Leung W.Y."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Pu H."
                    }
                ],
                "date": "2021-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "scHiCTools: A computational toolbox for analyzing single-cell Hi-C data"
            },
            "pmcid": "PMC8162587",
            "pmid": "34003823",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
