
{
    "credit": [
        {
            "email": "xhx@ics.uci.edu",
            "name": "Xiaohui Xie",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/jakebiesinger/AREM"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/jakebiesinger/AREM"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            }
        ]
    },
    "publication": [
        {
            "abstract": "High-throughput sequencing coupled to chromatin immunoprecipitation (ChIP-Seq) is widely used in characterizing genome-wide binding patterns of transcription factors, cofactors, chromatin modifiers, and other DNA binding proteins. A key step in ChIP-Seq data analysis is to map short reads from high-throughput sequencing to a reference genome and identify peak regions enriched with short reads. Although several methods have been proposed for ChIP-Seq analysis, most existing methods only consider reads that can be uniquely placed in the reference genome, and therefore have low power for detecting peaks located within repeat sequences. Here, we introduce a probabilistic approach for ChIP-Seq data analysis that utilizes all reads, providing a truly genome-wide view of binding patterns. Reads are modeled using a mixture model corresponding to K enriched regions and a null genomic background. We use maximum likelihood to estimate the locations of the enriched regions, and implement an expectation-maximization (E-M) algorithm, called AREM (aligning reads by expectation maximization), to update the alignment probabilities of each read to different genomic locations. We apply the algorithm to identify genome-wide binding events of two proteins: Rad21, a component of cohesin and a key factor involved in chromatid cohesion, and Srebp-1, a transcription factor important for lipid/cholesterol homeostasis. Using AREM, we were able to identify 19,935 Rad21 peaks and 1,748 Srebp-1 peaks in the mouse genome with high confidence, including 1,517 (7.6%) Rad21 peaks and 227 (13%) Srebp-1 peaks that were missed using only uniquely mapped reads. The open source implementation of our algorithm is available at http://sourceforge. net/projects/arem. © Copyright 2011, Mary Ann Liebert, Inc.",
            "authors": [
                "Newkirk D.",
                "Biesinger J.",
                "Chon A.",
                "Yokomori K.",
                "Xie X."
            ],
            "cit_count": 15,
            "journal": "Journal of Computational Biology",
            "pmid": "22035330",
            "title": "AREM: Aligning short reads from ChIP-sequencing by expectation maximization",
            "year": "2011-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:arem",
        "biotoolsID": "arem",
        "description": "AREM: Aligning Short Reads from ChIP-sequencing by Expectation Maximisation",
        "homepage": "https://github.com/jakebiesinger/AREM",
        "name": "AREM"
    }
}