{
    "accessibility": "Open access",
    "additionDate": "2022-10-09T10:47:06.395258Z",
    "biotoolsCURIE": "biotools:cs-co",
    "biotoolsID": "cs-co",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Hairong Lv"
        },
        {
            "name": "Pengshuai Yang"
        }
    ],
    "description": "CS-CO is a hybrid self-supervised visual representation learning method tailored for H&E-stained histopathological images.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/easonyang1996/CS-CO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-10-09T10:47:06.397879Z",
    "license": "MIT",
    "name": "CS-CO",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2022.102539",
            "metadata": {
                "abstract": "© 2022Visual representation extraction is a fundamental problem in the field of computational histopathology. Considering the powerful representation capacity of deep learning and the scarcity of annotations, self-supervised learning has emerged as a promising approach to extract effective visual representations from unlabeled histopathological images. Although a few self-supervised learning methods have been specifically proposed for histopathological images, most of them suffer from certain defects that may hurt the versatility or representation capacity. In this work, we propose CS-CO, a hybrid self-supervised visual representation learning method tailored for H&E-stained histopathological images, which integrates advantages of both generative and discriminative approaches. The proposed method consists of two self-supervised learning stages: cross-stain prediction (CS) and contrastive learning (CO). In addition, a novel data augmentation approach named stain vector perturbation is specifically proposed to facilitate contrastive learning. Our CS-CO makes good use of domain-specific knowledge and requires no side information, which means good rationality and versatility. We evaluate and analyze the proposed CS-CO on three H&E-stained histopathological image datasets with downstream tasks of patch-level tissue classification and slide-level cancer prognosis and subtyping. Experimental results demonstrate the effectiveness and robustness of the proposed CS-CO on common computational histopathology tasks. Furthermore, we also conduct ablation studies and prove that cross-staining prediction and contrastive learning in our CS-CO can complement and enhance each other. Our code is made available at https://github.com/easonyang1996/CS-CO.",
                "authors": [
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Jiang R."
                    },
                    {
                        "name": "Lu H."
                    },
                    {
                        "name": "Lv H."
                    },
                    {
                        "name": "Yang P."
                    },
                    {
                        "name": "Yin X."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "CS-CO: A Hybrid Self-Supervised Visual Representation Learning Method for H&E-stained Histopathological Images"
            },
            "pmid": "35926337"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
