{
    "additionDate": "2018-07-04T15:08:45Z",
    "biotoolsCURIE": "biotools:mtm-align",
    "biotoolsID": "mtm-align",
    "credit": [
        {
            "email": "yangjy@nankai.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Efficient protein structure comparisons, which includes are two related modules. The first is for fast database search with one input structure. The second is for multiple structure alignment with two or more input structures. After the search is done, a multiple structure alignment is performed automatically with the top 10 structure, using the second module. The users are also able to select other structures from the returned list to perform multiple structure alignment.",
    "documentation": [
        {
            "type": "General",
            "url": "http://yanglab.nankai.edu.cn/mTM-align/help/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://yanglab.nankai.edu.cn/mTM-align/version/download.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple structure alignment",
                    "uri": "http://edamontology.org/operation_0504"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structural similarity search",
                    "uri": "http://edamontology.org/operation_0360"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                }
            ]
        }
    ],
    "homepage": "http://yanglab.nankai.edu.cn/mTM-align/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "mTM-align",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky430",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research. With the rapid increase of the number of protein structures in the Protein Data Bank, it becomes urgent to develop algorithms for efficient protein structure comparisons. In this article, we present the mTM-align server, which consists of two closely related modules: one for structure database search and the other for multiple structure alignment. The database search is speeded up based on a heuristic algorithm and a hierarchical organization of the structures in the database. The multiple structure alignment is performed using the recently developed algorithm mTM-align. Benchmark tests demonstrate that our algorithms outperform other peering methods for both modules, in terms of speed and accuracy. One of the unique features for the server is the interplay between database search and multiple structure alignment. The server provides service not only for performing fast database search, but also for making accurate multiple structure alignment with the structures found by the search. For the database search, it takes about 2-5 min for a structure of a medium size (- 1/4300 residues). For the multiple structure alignment, it takes a few seconds for - 1/410 structures of medium sizes. The server is freely available at: http://yanglab.nankai.edu.cn/mTM-align/.",
                "authors": [
                    {
                        "name": "Dong R."
                    },
                    {
                        "name": "Pan S."
                    },
                    {
                        "name": "Peng Z."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Yang J."
                    }
                ],
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MTM-align: A server for fast protein structure database search and multiple protein structure alignment"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}