{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T15:19:15.691740Z",
    "biotoolsCURIE": "biotools:rawhash",
    "biotoolsID": "rawhash",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "canfirtina@gmail.com",
            "name": "Can Firtina",
            "typeEntity": "Person"
        },
        {
            "name": "Joel Lindegger",
            "typeEntity": "Person"
        },
        {
            "name": "Nika Mansouri Ghiasi",
            "typeEntity": "Person"
        }
    ],
    "description": "Hash-based mechanism to map raw nanopore signals to a reference genome in real-time. To achieve this, it 1) generates an index from the reference genome and 2) efficiently and accurately maps the raw signals to the reference genome such that it can match the throughput of nanopore sequencing even when analyzing large genomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CMU-SAFARI/RawHash",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2024-11-24T14:32:25.829035Z",
    "license": "GPL-3.0",
    "name": "RawHash",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad272",
            "metadata": {
                "abstract": "Nanopore sequencers generate electrical raw signals in real-time while sequencing long genomic strands. These raw signals can be analyzed as they are generated, providing an opportunity for real-time genome analysis. An important feature of nanopore sequencing, Read Until, can eject strands from sequencers without fully sequencing them, which provides opportunities to computationally reduce the sequencing time and cost. However, existing works utilizing Read Until either (i) require powerful computational resources that may not be available for portable sequencers or (ii) lack scalability for large genomes, rendering them inaccurate or ineffective. We propose RawHash, the first mechanism that can accurately and efficiently perform real-time analysis of nanopore raw signals for large genomes using a hash-based similarity search. To enable this, RawHash ensures the signals corresponding to the same DNA content lead to the same hash value, regardless of the slight variations in these signals. RawHash achieves an accurate hash-based similarity search via an effective quantization of the raw signals such that signals corresponding to the same DNA content have the same quantized value and, subsequently, the same hash value. We evaluate RawHash on three applications: (i) read mapping, (ii) relative abundance estimation, and (iii) contamination analysis. Our evaluations show that RawHash is the only tool that can provide high accuracy and high throughput for analyzing large genomes in real-time. When compared to the state-of-the-art techniques, UNCALLED and Sigmap, RawHash provides (i) 25:8× and 3:4× better average throughput and (ii) significantly better accuracy for large genomes, respectively. Source code is available at https://github.com/CMU-SAFARI/RawHash.",
                "authors": [
                    {
                        "name": "Cavlak M.B."
                    },
                    {
                        "name": "Firtina C."
                    },
                    {
                        "name": "Ghiasi N.M."
                    },
                    {
                        "name": "Lindegger J."
                    },
                    {
                        "name": "Mao H."
                    },
                    {
                        "name": "Mutlu O."
                    },
                    {
                        "name": "Singh G."
                    }
                ],
                "citationCount": 6,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RawHash: enabling fast and accurate real-time analysis of raw nanopore signals for large genomes"
            },
            "pmcid": "PMC10311405",
            "pmid": "37387139"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
