{
    "additionDate": "2021-01-18T08:35:15Z",
    "biotoolsCURIE": "biotools:irna5hmc",
    "biotoolsID": "irna5hmc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ran.su@tju.edu.cn",
            "name": "Ran Su",
            "typeEntity": "Person"
        },
        {
            "email": "chenweiimu@gmail.com",
            "name": "Wei Chen",
            "typeEntity": "Person"
        },
        {
            "email": "weileyi@sdu.edu.cn",
            "name": "Leyi Wei",
            "typeEntity": "Person"
        }
    ],
    "description": "The First Predictor to Identify RNA 5-Hydroxymethylcytosine Modifications Using Machine Learning.\n\nA generic webserver for predicting RNA 5hmC sites.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://server.malab.cn/iRNA5hmC",
    "lastUpdate": "2021-02-11T10:08:44Z",
    "name": "iRNA5hmC",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00227",
            "metadata": {
                "abstract": "© Copyright © 2020 Liu, Chen, Su, Chen and Wei.RNA 5-hydroxymethylcytosine (5hmC) modification plays an important role in a series of biological processes. Characterization of its distributions in transcriptome is fundamentally important to reveal the biological functions of 5hmC. Sequencing-based technologies allow the high-throughput identification of 5hmC; however, they are labor-intensive, time-consuming, as well as expensive. Thus, there is an urgent need to develop more effective and efficient computational methods, at least complementary to the high-throughput technologies. In this study, we developed iRNA5hmC, a computational predictive protocol to identify RNA 5hmC sites using machine learning. In this predictor, we introduced a sequence-based feature algorithm consisting of two feature representations, (1) k-mer spectrum and (2) positional nucleotide binary vector, to capture the sequential characteristics of 5hmC sites. Afterward, we utilized a two-stage feature space optimization strategy to improve the feature representation ability, and trained a predictive model using support vector machine (SVM). Our feature analysis results showed that feature optimization can help to capture the most discriminative features. As compared to well-known existing feature descriptors, our proposed representations can more accurately separate true 5hmC from non-5hmC sites. To the best of our knowledge, iRNA5hmC is the first RNA 5hmC predictor that enables to make predictions based on RNA primary sequences only, without any need of prior experimental knowledge. Importantly, we have established an easy-to-use webserver which is currently available at http://server.malab.cn/iRNA5hmC. We expect it has potential to be a useful tool for the prediction of 5hmC sites.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Chen D."
                    },
                    {
                        "name": "Su R."
                    },
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Wei L."
                    }
                ],
                "citationCount": 3,
                "date": "2020-03-31T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "iRNA5hmC: The First Predictor to Identify RNA 5-Hydroxymethylcytosine Modifications Using Machine Learning"
            },
            "pmcid": "PMC7137033",
            "pmid": "32296686"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}