{
    "additionDate": "2018-05-06T14:58:18Z",
    "biotoolsCURIE": "biotools:symbiogenomesdb",
    "biotoolsID": "symbiogenomesdb",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://symbiogenomesdb.uv.es/acknowledgements.html"
        }
    ],
    "description": "A database for the integration and access to knowledge on host-symbiont relationships.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://symbiogenomesdb.uv.es/quick-tour.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://symbiogenomesdb.uv.es/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "SymbioGenomesDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAV109",
            "metadata": {
                "abstract": "© 2015 The Author(s) 2015.Symbiotic relationships occur naturally throughout the tree of life, either in a commensal, mutualistic or pathogenic manner. The genomes of multiple organisms involved in symbiosis are rapidly being sequenced and becoming available, especially those from the microbial world. Currently, there are numerous databases that offer information on specific organisms or models, but none offer a global understanding on relationships between organisms, their interactions and capabilities within their niche, as well as their role as part of a system, in this case, their role in symbiosis. We have developed the SymbioGenomesDB as a community database resource for laboratories which intend to investigate and use information on the genetics and the genomics of organisms involved in these relationships. The ultimate goal of SymbioGenomesDB is to host and support the growing and vast symbiotic-host relationship information, to uncover the genetic basis of such associations. SymbioGenomesDB maintains a comprehensive organization of information on genomes of symbionts from diverse hosts throughout the Tree of Life, including their sequences, their metadata and their genomic features. This catalog of relationships was generated using computational tools, custom R scripts and manual integration of data available in public literature. As a highly curated and comprehensive systems database, SymbioGenomesDB provides web access to all the information of symbiotic organisms, their features and links to the central database NCBI. Three different tools can be found within the database to explore symbiosis-related organisms, their genes and their genomes. Also, we offer an orthology search for one or multiple genes in one or multiple organisms within symbiotic relationships, and every table, graph and output file is downloadable and easy to parse for further analysis. The robust SymbioGenomesDB will be constantly updated to cope with all the data being generated and included in major databases, in order to serve as an important, useful and timesaving tool.",
                "authors": [
                    {
                        "name": "Reyes-Prieto M."
                    },
                    {
                        "name": "Vargas-Chavez C."
                    },
                    {
                        "name": "Latorre A."
                    },
                    {
                        "name": "Moya A."
                    }
                ],
                "citationCount": 4,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Database",
                "title": "SymbioGenomesDB: A database for the integration and access to knowledge on host-symbiont relationships"
            },
            "pmcid": "PMC4659445",
            "pmid": "26607947"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}