{
    "accessibility": "Open access",
    "additionDate": "2024-03-28T16:51:14.572282Z",
    "biotoolsCURIE": "biotools:ksfinder",
    "biotoolsID": "ksfinder",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "manjua@udel.edu",
            "name": "Manju Anandakrishnan",
            "typeEntity": "Person"
        },
        {
            "name": "Cathy H. Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "Knowledge graph model for link prediction of novel phosphorylated substrates of kinases.\n\nKSFinder changes based on major revision comments from PeerJ.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://github.com/manju-anandakrishnan/ksfinder/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:05:50.521446Z",
    "name": "KSFinder",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/peerj.16164",
            "metadata": {
                "abstract": "Background. Aberrant protein kinase regulation leading to abnormal substrate phosphorylation is associated with several human diseases. Despite the promise of therapies targeting kinases, many human kinases remain understudied. Most existing computational tools predicting phosphorylation cover less than 50% of known human kinases. They utilize local feature selection based on protein sequences, motifs, domains, structures, and/or functions, and do not consider the heterogeneous relationships of the proteins. In this work, we present KSFinder, a tool that predicts kinase-substrate links by capturing the inherent association of proteins in a network comprising 85% of the known human kinases. We also postulate the potential role of two understudied kinases based on their substrate predictions from KSFinder. Methods. KSFinder learns the semantic relationships in a phosphoproteome knowledge graph using a knowledge graph embedding algorithm and represents the nodes in low- dimensional vectors. A multilayer perceptron (MLP) classifier is trained to discern kinase-substrate links using the embedded vectors. KSFinder uses a strategic negative generation approach that eliminates biases in entity representation and combines data from experimentally validated non-interacting protein pairs, proteins from different subcellular locations, and random sampling. We assess KSFinder's generalization capability on four different datasets and compare its performance with other state- of-the-art prediction models. We employ KSFinder to predict substrates of 68 \"dark\"kinases considered understudied by the Illuminating the Druggable Genome program and use our text-mining tool, RLIMS-P along with manual curation, to search for literature evidence for the predictions. In a case study, we performed functional enrichment analysis for two dark kinases - HIPK3 and CAMKK1 using their predicted substrates. Results. KSFinder shows improved performance over other kinase-substrate prediction models and generalized prediction ability on different datasets. We identified literature evidence for 17 novel predictions involving an understudied kinase. All of these 17 predictions had a probability score ≥ 0:7 (nine at > 0:9, six at 0.8-0.9, and two at 0.7-0.8). The evaluation of 93,593 negative predictions (probability ≤0:3) identified four false negatives. The top enriched biological processes of HIPK3 substrates relate to the regulation of extracellular matrix and epigenetic gene expression, while CAMKK1 substrates include lipid storage regulation and glucose homeostasis. Conclusions. KSFinder outperforms the current kinase-substrate prediction tools with higher kinase coverage. The strategically developed negatives provide a superior generalization ability for KSFinder. We predicted substrates of 432 kinases, 68 of which are understudied, and hypothesized the potential functions of two dark kinases using their predicted substrates.",
                "authors": [
                    {
                        "name": "Anandakrishnan M."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Cowart J."
                    },
                    {
                        "name": "Ross K.E."
                    },
                    {
                        "name": "Shanker V."
                    },
                    {
                        "name": "Wu C.H."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "KSFinder-a knowledge graph model for link prediction of novel phosphorylated substrates of kinases"
            },
            "pmcid": "PMC10561642",
            "pmid": "37818330"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        }
    ]
}
