{
    "additionDate": "2023-02-11T07:33:12.088013Z",
    "biotoolsCURIE": "biotools:sampling",
    "biotoolsID": "sampling",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Daniel Winter Heck"
        }
    ],
    "description": "New iOS Application for Assessment of Damage by Diseases and Insect Pests Using Sequential Sampling Plans.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://apple.co/3pUiYKy",
    "lastUpdate": "2024-11-24T15:03:03.890242Z",
    "name": "Sampling",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1094/pdis-04-22-0800-sr",
            "metadata": {
                "abstract": "Regular scouting for plant diseases and insect pests by growers, crop consultants, extension educators, and researchers (herein defined as stakeholders) is the cornerstone of integrated pest management practices. Sequential sampling plans have the potential to save time and labor in field scouting and reduce the frequency of errors surrounding decision-making. The incorporation of the algorithms behind sequential sampling plans into mobile devices can make scouting for diseases and insect pests more straightforward, practical, and enjoyable. Here, we introduce an iOS application called Sampling. The application was designed for stakeholders to use on a mobile device for assessing disease and insect pest incidence in the field using sequential sampling plans. The application allows users to select a disease or insect pest from a prepopulated list and specify the objective of sampling: Estimation or classification. Conducting sequential sampling depends upon different precision levels and action thresholds within each objective. Detailed instructions for each sequential sampling plan are available as a guide. When sampling begins, users enter the number of diseased individuals at each sampling unit. The specific algorithm developed for the disease or insect pest will inform the user when to stop sampling for the desired goal and return the final incidence and precision or threshold achieved. Results are automatically saved in the application, and the user can inspect and share results by exporting them to a range of compatible programs. The initial version of Sampling (1.1) was released with the sequential sampling plans for Cercospora leaf spot of table beet. Sequential sampling plans for additional diseases or pests will be added to Sampling in subsequent versions. Sampling is available as a free download from the Apple Store (https://apple.co/ 3pUiYKy) and is compatible with iOS 14.0 or greater on the iPhone or iPad.",
                "authors": [
                    {
                        "name": "Heck D.W."
                    },
                    {
                        "name": "Kikkert J.R."
                    },
                    {
                        "name": "Pethybridge S.J."
                    },
                    {
                        "name": "Sharma P."
                    }
                ],
                "citationCount": 2,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Plant Disease",
                "title": "Sampling, a New iOS Application for Assessment of Damage by Diseases and Insect Pests Using Sequential Sampling Plans"
            },
            "pmid": "36428257"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}
