{
    "additionDate": "2019-11-14T19:45:02Z",
    "biotoolsCURIE": "biotools:Hintra",
    "biotoolsID": "Hintra",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ester@cs.sfu.ca",
            "name": "Martin Ester",
            "typeEntity": "Person"
        }
    ],
    "description": "Collaborative intra-tumor heterogeneity detection | An algorithm for collaborative intra-tumor heterogeneity detection | We introduce a method called Hintra for intra-tumor heterogeneity detection | Despite the remarkable advances in sequencing and computational techniques, noise in the data and complexity of the underlying biological mechanisms render deconvolution of the phylogenetic relationships between cancer mutations difficult",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sahandk/HINTRA",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-10T08:26:54Z",
    "name": "Hintra",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ355",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Despite the remarkable advances in sequencing and computational techniques, noise in the data and complexity of the underlying biological mechanisms render deconvolution of the phylogenetic relationships between cancer mutations difficult. Besides that, the majority of the existing datasets consist of bulk sequencing data of single tumor sample of an individual. Accurate inference of the phylogenetic order of mutations is particularly challenging in these cases and the existing methods are faced with several theoretical limitations. To overcome these limitations, new methods are required for integrating and harnessing the full potential of the existing data. Results: We introduce a method called Hintra for intra-tumor heterogeneity detection. Hintra integrates sequencing data for a cohort of tumors and infers tumor phylogeny for each individual based on the evolutionary information shared between different tumors. Through an iterative process, Hintra learns the repeating evolutionary patterns and uses this information for resolving the phylogenetic ambiguities of individual tumors. The results of synthetic experiments show an improved performance compared to two state-of-the-art methods. The experimental results with a recent Breast Cancer dataset are consistent with the existing knowledge and provide potentially interesting findings.",
                "authors": [
                    {
                        "name": "Khakabimamaghani S."
                    },
                    {
                        "name": "Malikic S."
                    },
                    {
                        "name": "Tang J."
                    },
                    {
                        "name": "DIng D."
                    },
                    {
                        "name": "Morin R."
                    },
                    {
                        "name": "Chindelevitch L."
                    },
                    {
                        "name": "Ester M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Collaborative intra-tumor heterogeneity detection"
            },
            "pmcid": "PMC6612880",
            "pmid": "31510674"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}