
{
    "credit": [
        {
            "email": "xuyan@ustb.edu.cn",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://app.aporc.org/Phogly-PseAAC/ReadMe.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/phogly-pseaac-prediction-of-lysine-phosphoglycerylation-in-proteins.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Elsevier Ltd. Large-scale characterization of post-translational modifications (PTMs), such as posphorylation, acetylation and ubiquitination, has highlighted their importance in the regulation of a myriad of signaling events. However, as another type of PTMs-lysine phosphoglycerylation, the data of phosphoglycerylated sites has just been manually experimented in recent years. Given an uncharacterized protein sequence that contains many lysine residues, which one of them can be phosphoglycerylated and which one not? This is a challenging problem. In view of this, establishing a useful computational method and developing an efficient predictor are highly desired. Here a new predictor named Phogly-PseAAC was developed which incorporated with the position specific amino acid propensity. The feature importance through F-score value has also been ranked. The predictor with the best feature set obtained the accuracy 75.10%, sensitivity 68.87%, specificity 75.57% and MCC 0.2538 in LOO test cross validation with center nearest neighbor algorithm. Meanwhile, a web-server for Phogly-PseAAC is accessible at http://app.aporc.org/Phogly-PseAAC/. For the convenience of most experimental scientists, we have further provided a brief instruction for the web-server, by which users can easily get their desired results without the need to follow the complicated mathematics presented in this paper. It is anticipated that Phogly-PseAAC may become a useful high throughput tool for identifying the lysine phosphoglycerylation sites.",
            "authors": [
                "Xu Y.",
                "Ding Y.-X.",
                "Ding J.",
                "Wu L.-Y.",
                "Deng N.-Y."
            ],
            "cit_count": 9,
            "journal": "Journal of Theoretical Biology",
            "pmid": "25913879",
            "title": "Phogly-PseAAC: Prediction of lysine phosphoglycerylation in proteins incorporating with position-specific propensity",
            "year": "2015-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phogly-pseaac",
        "biotoolsID": "phogly-pseaac",
        "description": "Predicting lysine phosphoglycerylation sites in proteins incorporating with position-specific propensity.",
        "homepage": "http://app.aporc.org/Phogly-PseAAC/",
        "name": "Phogly-PseAAC"
    }
}