{
    "additionDate": "2022-08-23T10:44:07.537747Z",
    "biotoolsCURIE": "biotools:gatecda",
    "biotoolsID": "gatecda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangjingpu@hncj.edu.cn",
            "name": "Jingpu Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "A computational framework (GATECDA) based on graph attention auto-encoder to predict circRNA-drug sensitivity associations.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene regulatory network prediction",
                    "uri": "http://edamontology.org/operation_2437"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yjslzx/GATECDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-23T10:44:07.540275Z",
    "license": "Not licensed",
    "name": "GATECDA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04694-Y",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Circular RNAs (circRNAs) play essential roles in cancer development and therapy resistance. Many studies have shown that circRNA is closely related to human health. The expression of circRNAs also affects the sensitivity of cells to drugs, thereby significantly affecting the efficacy of drugs. However, traditional biological experiments are time-consuming and expensive to validate drug-related circRNAs. Therefore, it is an important and urgent task to develop an effective computational method for predicting unknown circRNA-drug associations. Results: In this work, we propose a computational framework (GATECDA) based on graph attention auto-encoder to predict circRNA-drug sensitivity associations. In GATECDA, we leverage multiple databases, containing the sequences of host genes of circRNAs, the structure of drugs, and circRNA-drug sensitivity associations. Based on the data, GATECDA employs Graph attention auto-encoder (GATE) to extract the low-dimensional representation of circRNA/drug, effectively retaining critical information in sparse high-dimensional features and realizing the effective fusion of nodes’ neighborhood information. Experimental results indicate that GATECDA achieves an average AUC of 89.18% under 10-fold cross-validation. Case studies further show the excellent performance of GATECDA. Conclusions: Many experimental results and case studies show that our proposed GATECDA method can effectively predict the circRNA-drug sensitivity associations.",
                "authors": [
                    {
                        "name": "Deng L."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Qian Y."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predicting circRNA-drug sensitivity associations via graph attention auto-encoder"
            },
            "pmcid": "PMC9066932",
            "pmid": "35508967"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
