
{
    "credit": [
        {
            "email": "fog@mpi-bremen.de",
            "name": "Frank Oliver Glöckner",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://treeviewer.mpi-bremen.de/tree_viewer_public/doc/userguide.html"
        },
        {
            "url": "http://treeviewer.mpi-bremen.de/tree_viewer_public/doc/tutorial-search.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: Phylogenetic trees are an important tool to study the evolutionary relationships among organisms. The huge amount of available taxa poses difficulties in their interactive visualization. This hampers the interaction with the users to provide feedback for the further improvement of the taxonomic framework. Results: The SILVA Tree Viewer is a web application designed for visualizing large phylogenetic trees without requiring the download of any software tool or data files. The SILVA Tree Viewer is based on Web Geographic Information Systems (Web-GIS) technology with a PostgreSQL backend. It enables zoom and pan functionalities similar to Google Maps. The SILVA Tree Viewer enables access to two phylogenetic (guide) trees provided by the SILVA database: the SSU Ref NR99 inferred from high-quality, full-length small subunit sequences, clustered at 99% sequence identity and the LSU Ref inferred from high-quality, full-length large subunit sequences. Conclusions: The Tree Viewer provides tree navigation, search and browse tools as well as an interactive feedback system to collect any kinds of requests ranging from taxonomy to data curation and improving the tool itself.",
            "authors": [
                "Beccati A.",
                "Gerken J.",
                "Quast C.",
                "Yilmaz P.",
                "Glockner F.O."
            ],
            "cit_count": 1,
            "doi": "10.1186/s12859-017-1841-3",
            "journal": "BMC Bioinformatics",
            "title": "SILVA tree viewer: Interactive web browsing of the SILVA phylogenetic guide trees",
            "type": "Primary",
            "year": "2017-09-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:silva_tree_viewer",
        "biotoolsID": "silva_tree_viewer",
        "description": "Interactive web browsing of the SILVA phylogenetic guide trees.",
        "homepage": "http://treeviewer.mpi-bremen.de/tree_viewer_public/",
        "name": "SILVA Tree Viewer"
    }
}