{
    "additionDate": "2017-12-06T18:14:26Z",
    "biotoolsCURIE": "biotools:das-tmfilter",
    "biotoolsID": "das-tmfilter",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "miklos@bip.bham.ac.uk",
            "name": "Miklos Cserzo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DAS (Dense Alignment Surface) is based on low-stringency dot-plots of the query sequence against a set of library sequences - non-homologous membrane proteins - using a previously derived, special scoring matrix. The method provides a high precision hyrdophobicity profile for the query from which the location of the potential transmembrane segments can be obtained. The novelty of the DAS-TMfilter algorithm is a second prediction cycle to predict TM segments in the sequences of the TM-library.",
    "documentation": [
        {
            "type": "General",
            "url": "http://mendel.imp.ac.at/sat/DAS/first.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://mendel.imp.ac.at/sat/DAS/DAS.html",
    "lastUpdate": "2019-09-04T08:38:46Z",
    "name": "DAS-TMfilter",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1093/protein/15.9.745",
            "metadata": {
                "abstract": "While helical transmembrane (TM) region prediction tools achieve high (>90%) success rates for real integral membrane proteins, they produce a considerable number of false positive hits in sequences of known non-transmembrane queries. We propose a modification of the dense alignment surface (DAS) method that achieves a substantial decrease in the false positive error rate. Essentially, a sequence that includes possible transmembrane regions is compared in a second step with TM segments in a sequence library of documented transmembrane proteins. If the performance of the query sequence against the library of documented TM segment-containing sequences in this test is lower than an empirical threshold, it is classified as a non-transmembrane protein. The probability of false positive prediction for trusted TM region hits is expressed in terms of E-values. The modified DAS method, the DAS-TMfilter algorithm, has an unchanged high sensitivity for TM segments (∼95% detected in a learning set of 128 documented transmembrane proteins). At the same time, the selectivity measured over a non-redundant set of 526 soluble proteins with known 3D structure is ∼99%, mainly because a large number of falsely predicted single membrane-pass proteins are eliminated by the DAS-TMfilter algorithm.",
                "authors": [
                    {
                        "name": "Cserzo M."
                    },
                    {
                        "name": "Eisenhaber F."
                    },
                    {
                        "name": "Eisenhaber B."
                    },
                    {
                        "name": "Simon I."
                    }
                ],
                "citationCount": 112,
                "date": "2002-09-01T00:00:00Z",
                "journal": "Protein Engineering",
                "title": "On filtering false positive transmembrane protein predictions"
            },
            "pmid": "12456873",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        }
    ]
}