{
    "additionDate": "2018-05-28T11:24:30Z",
    "biotoolsCURIE": "biotools:netcooperate",
    "biotoolsID": "netcooperate",
    "credit": [
        {
            "email": "roie@uw.edu",
            "name": "Roie Levy",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "rogan@uw.edu",
            "name": "Rogan Carr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "anat.kreimer@berkeley.edu",
            "name": "Anat Kreimer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "shiri@agri.gov.il",
            "name": "Shiri Freilich",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "elbo@uw.edu",
            "name": "Elhanan Borenstein",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Determining host-microbe and microbe-microbe cooperative potential. It specifically calculates two previously developed and validated metrics for species interaction: the Biosynthetic Support Score which quantifies the ability of a host species to supply the nutritional requirements of a parasitic or a commensal species, and the Metabolic Complementarity Index which quantifies the complementarity of a pair of microbial organisms’ niches.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://elbo.gs.washington.edu/software_netcooperate/NetCooperateManual.pdf"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://elbo.gs.washington.edu/software_netcooperate_examples.html"
        }
    ],
    "download": [
        {
            "note": "Python module to add NetCooperate's functionality to your custom analysis programs.",
            "type": "Software package",
            "url": "http://elbo.gs.washington.edu/software_netcooperate/NetCooperatePython.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "http://elbo.gs.washington.edu/software_netcooperate.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "GPL-2.0",
    "name": "NetCooperate",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0588-y",
            "metadata": {
                "abstract": "© 2015 Levy et al.Background: Host-microbe and microbe-microbe interactions are often governed by the complex exchange of metabolites. Such interactions play a key role in determining the way pathogenic and commensal species impact their host and in the assembly of complex microbial communities. Recently, several studies have demonstrated how such interactions are reflected in the organization of the metabolic networks of the interacting species, and introduced various graph theory-based methods to predict host-microbe and microbe-microbe interactions directly from network topology. Using these methods, such studies have revealed evolutionary and ecological processes that shape species interactions and community assembly, highlighting the potential of this reverse-ecology research paradigm. Results: NetCooperate is a web-based tool and a software package for determining host-microbe and microbe-microbe cooperative potential. It specifically calculates two previously developed and validated metrics for species interaction: the Biosynthetic Support Score which quantifies the ability of a host species to supply the nutritional requirements of a parasitic or a commensal species, and the Metabolic Complementarity Index which quantifies the complementarity of a pair of microbial organisms' niches. NetCooperate takes as input a pair of metabolic networks, and returns the pairwise metrics as well as a list of potential syntrophic metabolic compounds. Conclusions: The Biosynthetic Support Score and Metabolic Complementarity Index provide insight into host-microbe and microbe-microbe metabolic interactions. NetCooperate determines these interaction indices from metabolic network topology, and can be used for small- or large-scale analyses. NetCooperate is provided as both a web-based tool and an open-source Python module; both are freely available online at http://elbo.gs.washington.edu/software_netcooperate.html.",
                "authors": [
                    {
                        "name": "Levy R."
                    },
                    {
                        "name": "Carr R."
                    },
                    {
                        "name": "Kreimer A."
                    },
                    {
                        "name": "Freilich S."
                    },
                    {
                        "name": "Borenstein E."
                    }
                ],
                "citationCount": 31,
                "date": "2015-05-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NetCooperate: A network-based tool for inferring host-microbe and microbe-microbe cooperation"
            },
            "pmcid": "PMC4434858",
            "pmid": "25980407"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}