{"credit":[{"email":"jlo@ua.pt","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinformatics.ua.pt/"}],"documentation":[{"type":"GENERAL","url":"http://bioinformatics.ua.pt/software/variobox/"}],"function":[{"operation":[{"term":"Sequence comparison","uri":"http://edamontology.org/operation_2451"},{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"},{"term":"Sequence annotation","uri":"http://edamontology.org/operation_0361"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/variobox-1-4-4-exploring-human-genetic-variations.html"}],"publication":[{"abstract":"Triggered by the sequencing of the human genome, personalized medicine has been one of the fastest growing research areas in the last decade. Multiple software and hardware technologies have been developed by several projects, culminating in the exponential growth of genetic data. Considering the technological developments in this field, it is now fairly easy and inexpensive to obtain genetic profiles for unique individuals, such as those performed by several genetic analysis companies. The availability of computational tools that simplify genetic data analysis and the disclosure of biomedical evidences are of utmost importance. We present Variobox, a desktop tool to annotate, analyze, and compare human genes. Variobox obtains variant annotation data from WAVe, protein metadata annotations from Protein Data Bank, and sequences are obtained from Locus Reference Genomic or RefSeq databases. To explore the data, Variobox provides an advanced sequence visualization that enables agile navigation through genetic regions. DNA sequencing data can be compared with reference sequences retrieved from LRG or RefSeq records, identifying and automatically annotating new potential variants. These features and data, ranging from patient sequences to HGVS-compliant variant descriptions, are combined in an intuitive interface to analyze genes and variants. Variobox is a Java application, available at http://bioinformatics.ua.pt/variobox. © 2013 WILEY PERIODICALS, INC.","authors":["Gaspar P.","Lopes P.","Oliveira J.","Santos R.","Dalgleish R.","Oliveira J.L."],"cit_count":5,"journal":"Human Mutation","pmid":"24186831","title":"Variobox: Automatic detection and annotation of human genetic variants","year":"2014-02-01"}],"summary":{"biotoolsCURIE":"biotools:variobox","biotoolsID":"variobox","description":"Desktop tool for the annotation, analysis and comparison of human genes. Variant annotation data are obtained from WAVe, protein metadata annotations are gathered from PDB and UniProt, and sequence metadata is obtained from Locus Reference Genomic (LRG) and RefSeq databases.","homepage":"http://bioinformatics.ua.pt/software/variobox/","name":"VarioBox"}}