{
    "accessibility": "Open access",
    "additionDate": "2017-03-10T10:49:52Z",
    "biotoolsCURIE": "biotools:minepath",
    "biotoolsID": "minepath",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "koumakis@gmail.com",
            "name": "Lefteris Koumakis",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.minepath.org"
        }
    ],
    "description": "A pathway analysis tool.\nMinePath identifies of differentially expressed functional paths or sub-paths within a gene regulatory network (GRN) using gene expression data analysis. The analysis takes advantage of interactions among genes (e.g. activation/expression, inhibition) as nodes of a graph network, which are derived from expression data.",
    "documentation": [
        {
            "note": "MinePath Manual",
            "type": [
                "User manual"
            ],
            "url": "http://www.minepath.org/manual/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression data",
                        "uri": "http://edamontology.org/data_2603"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "Biological pathway or network format",
                            "uri": "http://edamontology.org/format_2013"
                        }
                    ]
                }
            ],
            "note": "MinePath identifies of differentially expressed functional paths or sub-paths within a gene regulatory network (GRN) using gene expression data analysis.",
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "Biological pathway or network report format",
                            "uri": "http://edamontology.org/format_3166"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://www.minepath.org/",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:20Z",
    "link": [
        {
            "note": "MinePath web server",
            "type": [
                "Other"
            ],
            "url": "http://www.minepath.org"
        }
    ],
    "maturity": "Mature",
    "name": "MinePath",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "koumakis",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005187",
            "metadata": {
                "abstract": "© 2016 Koumakis et al.Pathway analysis methodologies couple traditional gene expression analysis with knowledge encoded in established molecular pathway networks, offering a promising approach towards the biological interpretation of phenotype differentiating genes. Early pathway analysis methodologies, named as gene set analysis (GSA), view pathways just as plain lists of genes without taking into account either the underlying pathway network topology or the involved gene regulatory relations. These approaches, even if they achieve computational efficiency and simplicity, consider pathways that involve the same genes as equivalent in terms of their gene enrichment characteristics. Most recent pathway analysis approaches take into account the underlying gene regulatory relations by examining their consistency with gene expression profiles and computing a score for each profile. Even with this approach, assessing and scoring single-relations limits the ability to reveal key gene regulation mechanisms hidden in longer pathway sub-paths. We introduce MinePath, a pathway analysis methodology that addresses and overcomes the aforementioned problems. MinePath facilitates the decomposition of pathways into their constituent sub-paths. Decomposition leads to the transformation of single-relations to complex regulation sub-paths. Regulation sub-paths are then matched with gene expression sample profiles in order to evaluate their functional status and to assess phenotype differential power. Assessment of differential power supports the identification of the most discriminant profiles. In addition, MinePath assess the significance of the pathways as a whole, ranking them by their p-values. Comparison results with state-of-the-art pathway analysis systems are indicative for the soundness and reliability of the MinePath approach. In contrast with many pathway analysis tools, MinePath is a web-based system (www.minepath.org) offering dynamic and rich pathway visualization functionality, with the unique characteristic to color regulatory relations between genes and reveal their phenotype inclination. This unique characteristic makes MinePath a valuable tool for in silico molecular biology experimentation as it serves the biomedical researchers’ exploratory needs to reveal and interpret the regulatory mechanisms that underlie and putatively govern the expression of target phenotypes.",
                "authors": [
                    {
                        "name": "Koumakis L."
                    },
                    {
                        "name": "Kanterakis A."
                    },
                    {
                        "name": "Kartsaki E."
                    },
                    {
                        "name": "Chatzimina M."
                    },
                    {
                        "name": "Zervakis M."
                    },
                    {
                        "name": "Tsiknakis M."
                    },
                    {
                        "name": "Vassou D."
                    },
                    {
                        "name": "Kafetzopoulos D."
                    },
                    {
                        "name": "Marias K."
                    },
                    {
                        "name": "Moustakis V."
                    },
                    {
                        "name": "Potamias G."
                    }
                ],
                "citationCount": 10,
                "date": "2016-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "MinePath: Mining for Phenotype Differential Sub-paths in Molecular Pathways"
            },
            "pmcid": "PMC5104320",
            "pmid": "27832067",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkx278",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.Minepath (www.minepath.org) is a web-based platform that elaborates on, and radically extends the identification of differentially expressed sub-paths in molecular pathways. Besides the network topology, the underlying MinePath algorithmic processes exploit exact gene-gene molecular relationships (e.g. activation, inhibition) and are able to identify differentially expressed pathway parts. Each pathway is decomposed into all its constituent sub-paths, which in turn are matched with corresponding gene expression profiles. The highly ranked, and phenotype inclined sub-paths are kept. Apart from the pathway analysis algorithm, the fundamental innovation of the MinePath web-server concerns its advanced visualization and interactive capabilities. To our knowledge, this is the first pathway analysis server that introduces and offers visualization of the underlying and active pathway regulatory mechanisms instead of genes. Other features include live interaction, immediate visualization of functional sub-paths per phenotype and dynamic linked annotations for the engaged genes and molecular relations. The user can download not only the results but also the corresponding web viewer framework of the performed analysis. This feature provides the flexibility to immediately publish results without publishing source/expression data, and get all the functionality of a web based pathway analysis viewer.",
                "authors": [
                    {
                        "name": "Koumakis L."
                    },
                    {
                        "name": "Roussos P."
                    },
                    {
                        "name": "Potamias G."
                    }
                ],
                "citationCount": 4,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Minepath.org: A free interactive pathway analysis web server"
            },
            "pmid": "28431175",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}