{
    "additionDate": "2021-01-18T08:44:09Z",
    "biotoolsCURIE": "biotools:tarpan",
    "biotoolsID": "tarpan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tcashby@uams.edu",
            "name": "Cody Ashby",
            "orcidid": "https://orcid.org/0000-0002-9361-0283",
            "typeEntity": "Person"
        }
    ],
    "description": "TarPan Viewer is a tool used to visually inspect targeted panel sequencing data. an easily adaptable targeted sequencing panel viewer for research and clinical use.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tcashby/tarpan",
    "language": [
        "R",
        "Python",
        "SQL"
    ],
    "lastUpdate": "2021-02-26T16:15:35Z",
    "license": "GPL-3.0",
    "name": "TarPan",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3477-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The study of cancer genomics continually matures as the number of patient samples sequenced increases. As more data is generated, oncogenic drivers for specific cancer types are discovered along with their associated risks. This in turn leads to potential treatment strategies that pave the way to precision medicine. However, significant financial and analytical barriers make it infeasible to sequence the entire genome of every patient. In contrast, targeted sequencing panels give reliable information on relevant portions of the genome at a fiscally responsible cost. Therefore, we have created the Targeted Panel (TarPan) Viewer, a software tool, to investigate this type of data. Results: TarPan Viewer helps investigators understand data from targeted sequencing data by displaying the information through a web browser interface. Through this interface, investigators can easily observe copy number changes, mutations, and structural events in cancer samples. The viewer runs in R Shiny with a robust SQLite backend and its input is generated from bioinformatic algorithms reliably described in the literature. Here we show the results from using TarPan Viewer on publicly available follicular lymphoma, breast cancer, and multiple myeloma data. In addition, we have tested and utilized the viewer internally, and this data has been used in high-impact peer-reviewed publications. Conclusions: We have designed a flexible, simple to setup viewer that is easily adaptable to any type of cancer targeted sequencing, and has already proven its use in a research laboratory environment. Further, we believe with deeper sequencing and/or more targeted application it could be of use in the clinic in conjunction with an appropriate targeted sequencing panel as a cost-effective diagnostic test, especially in cancers such as acute leukemia or diffuse large B-cell lymphoma that require rapid interventions.",
                "authors": [
                    {
                        "name": "Ashby C."
                    },
                    {
                        "name": "Rutherford M."
                    },
                    {
                        "name": "Bauer M.A."
                    },
                    {
                        "name": "Peterson E.A."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Boyle E.M."
                    },
                    {
                        "name": "Wardell C.P."
                    },
                    {
                        "name": "Walker B.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TarPan: An easily adaptable targeted sequencing panel viewer for research and clinical use"
            },
            "pmcid": "PMC7158102",
            "pmid": "32293247"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}