{
    "additionDate": "2017-08-03T18:58:55Z",
    "biotoolsCURIE": "biotools:sable",
    "biotoolsID": "sable",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sable.cchmc.org/cgi-bin/contact_page.cgi?Server=SABLE"
        }
    ],
    "description": "This server can be used for predicting real valued relative solvent possibilities of amino acid residues in proteins, and for improved prediction of secondary structures using evolutionary profiles and predicted relative solvent accessibility of an amino acid residue as a fingerprint of the overall packing.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sable.cchmc.org/sable_doc.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://sable.cchmc.org/",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sable-2-0-accurate-sequence-based-prediction-of-relative-solvent-accessibilities.html"
        }
    ],
    "name": "SABLE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Many sequence-based predictors of structural and functional properties of proteins have been developed in the past. In this study, we developed new methods for predicting measures of conformational flexibility in proteins, including X-ray structure-derived temperature (B-) factors and the variance within NMR structural ensemble, as effectively measured by the solvent accessibility standard deviations (SASDs). We further tested whether these predicted measures of conformational flexibility in crystal lattices and solution, respectively, can be used to improve the prediction of phosphorylation in proteins. The latter is an example of a common post-translational modification that modulates protein function, e.g., by affecting interactions and conformational flexibility of phosphorylated sites. Using robust epsilon-insensitive support vector regression (ε-SVR) models, we assessed two specific representations of protein sequences: one based on the position-specific scoring matrices (PSSMs) derived from multiple sequence alignments, and an augmented representation that incorporates real-valued solvent accessibility and secondary structure predictions (RSA/SS) as additional measures of local structural propensities. We showed that a combination of PSSMs and real-valued SS/RSA predictions provides systematic improvements in the accuracy of both B-factors and SASD prediction. These intermediate predictions were subsequently combined into an enhanced predictor of phosphorylation that was shown to significantly outperform methods based on PSSM alone. We would like to stress that to the best of our knowledge, this is the first example of using predicted from sequence NMR structure-based measures of conformational flexibility in solution for the prediction of other properties of proteins. Phosphorylation prediction methods typically employ a two-class classification approach with the limitation that the set of negative examples used for training may include some sites that are simply unknown to be phosphorylated. While one-class classification techniques have been considered in the past as a solution to this problem, their performance has not been systematically compared to two-class techniques. In this study, we developed and compared one- and two-class support vector machine (SVM)-based predictors for several commonly used sets of attributes. [These predictors are being made available at http://sable.cchmc.org/]. © 2010 Springer Science+Business Media, LLC.",
                "authors": [
                    {
                        "name": "Swaminathan K."
                    },
                    {
                        "name": "Adamczak R."
                    },
                    {
                        "name": "Porollo A."
                    },
                    {
                        "name": "Meller J."
                    }
                ],
                "citationCount": 11,
                "date": "2010-12-01T00:00:00Z",
                "journal": "Advances in Experimental Medicine and Biology",
                "title": "Enhanced prediction of conformational flexibility and phosphorylation in proteins"
            },
            "pmid": "20865514"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}