
{
    "credit": [
    ],
    "documentation": [
        {
            "type": "API_DOCUMENTATION",
            "url": "https://www.basissetexchange.org/api/metadata"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "BSD-3-Clause",
        "topic": [
            {
                "term": "Chemistry",
                "uri": "http://edamontology.org/topic_3314"
            },
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            },
            {
                "term": "Literature and language",
                "uri": "http://edamontology.org/topic_3068"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/MolSSI-BSE/basis_set_exchange"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 American Chemical Society.The Basis Set Exchange (BSE) has been a prominent fixture in the quantum chemistry community. First publicly available in 2007, it is recognized by both users and basis set creators as the de facto source for information related to basis sets. This popular resource has been rewritten, utilizing modern software design and best practices. The basis set data has been separated into a stand-alone library with an accessible API, and the Web site has been updated to use the current generation of web development libraries. The general layout and workflow of the Web site is preserved, while helpful features requested by the user community have been added. Overall, this design should increase adaptability and lend itself well into the future as a dependable resource for the computational chemistry community. This article will discuss the decision to rewrite the BSE, the new architecture and design, and the new features that have been added.",
            "authors": [
                "Pritchard B.P.",
                "Altarawy D.",
                "Didier B.",
                "Gibson T.D.",
                "Windus T.L."
            ],
            "cit_count": 1,
            "doi": "10.1021/ACS.JCIM.9B00725",
            "journal": "Journal of Chemical Information and Modeling",
            "pmid": "31600445",
            "title": "New Basis Set Exchange: An Open, Up-to-Date Resource for the Molecular Sciences Community",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:New_Basis_Set_Exchange",
        "biotoolsID": "New_Basis_Set_Exchange",
        "description": "An Open, Up-to-Date Resource for the Molecular Sciences Community.\n\nA repository for quantum chemistry basis sets.\n\nThe new Basis Set Exchange (BSE) for Quantum Chemistry.\n\nIf you are looking for the Basis Set Exchange website (which can be used to browse and download this data in a more user-friendly way), visit https://www.basissetexchange.org.\n\nThis project is a library containing basis sets for use in quantum chemistry calculations. In addition, this library has functionality for manipulation of basis set data.\n\nThis library is used to form the backend of the new Basis Set Exchange website.\n\nA New Basis Set Exchange: An Open, Up-to-date Resource for the Molecular Sciences Community Benjamin P. Pritchard, Doaa Altarawy, Brett Didier, Tara D. Gibson, and Theresa L. Windus J. Chem. Inf. Model. 2019, 59(11), 4814-4820 doi:10.1021/acs.jcim.9b00725.\n\nA New Basis Set Exchange: An Open, Up-to-date Resource for the Molecular Sciences Community",
        "homepage": "https://www.basissetexchange.org",
        "name": "New Basis Set Exchange"
    }
}