{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-31T16:07:02Z",
    "biotoolsCURIE": "biotools:Lead-DBS",
    "biotoolsID": "Lead-DBS",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.lead-dbs.org/contact/"
        }
    ],
    "description": "MATLAB-toolbox facilitating deep brain stimulation electrode locations and connectomic imaging.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/netstim/leaddbs"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.lead-dbs.org/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2019-05-31T16:07:02Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Lead-DBS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1016/j.neuroimage.2018.08.068",
            "metadata": {
                "abstract": "© 2018 Elsevier Inc. Deep brain stimulation (DBS) is a highly efficacious treatment option for movement disorders and a growing number of other indications are investigated in clinical trials. To ensure optimal treatment outcome, exact electrode placement is required. Moreover, to analyze the relationship between electrode location and clinical results, a precise reconstruction of electrode placement is required, posing specific challenges to the field of neuroimaging. Since 2014 the open source toolbox Lead-DBS is available, which aims at facilitating this process. The tool has since become a popular platform for DBS imaging. With support of a broad community of researchers worldwide, methods have been continuously updated and complemented by new tools for tasks such as multispectral nonlinear registration, structural/functional connectivity analyses, brain shift correction, reconstruction of microelectrode recordings and orientation detection of segmented DBS leads. The rapid development and emergence of these methods in DBS data analysis require us to revisit and revise the pipelines introduced in the original methods publication. Here we demonstrate the updated DBS and connectome pipelines of Lead-DBS using a single patient example with state-of-the-art high-field imaging as well as a retrospective cohort of patients scanned in a typical clinical setting at 1.5T. Imaging data of the 3T example patient is co-registered using five algorithms and nonlinearly warped into template space using ten approaches for comparative purposes. After reconstruction of DBS electrodes (which is possible using three methods and a specific refinement tool), the volume of tissue activated is calculated for two DBS settings using four distinct models and various parameters. Finally, four whole-brain tractography algorithms are applied to the patient‘s preoperative diffusion MRI data and structural as well as functional connectivity between the stimulation volume and other brain areas are estimated using a total of eight approaches and datasets. In addition, we demonstrate impact of selected preprocessing strategies on the retrospective sample of 51 PD patients. We compare the amount of variance in clinical improvement that can be explained by the computer model depending on the preprocessing method of choice. This work represents a multi-institutional collaborative effort to develop a comprehensive, open source pipeline for DBS imaging and connectomics, which has already empowered several studies, and may facilitate a variety of future studies in the field.",
                "authors": [
                    {
                        "name": "Horn A."
                    },
                    {
                        "name": "Li N."
                    },
                    {
                        "name": "Dembek T.A."
                    },
                    {
                        "name": "Kappel A."
                    },
                    {
                        "name": "Boulay C."
                    },
                    {
                        "name": "Ewert S."
                    },
                    {
                        "name": "Tietze A."
                    },
                    {
                        "name": "Husch A."
                    },
                    {
                        "name": "Perera T."
                    },
                    {
                        "name": "Neumann W.-J."
                    },
                    {
                        "name": "Reisert M."
                    },
                    {
                        "name": "Si H."
                    },
                    {
                        "name": "Oostenveld R."
                    },
                    {
                        "name": "Rorden C."
                    },
                    {
                        "name": "Yeh F.-C."
                    },
                    {
                        "name": "Fang Q."
                    },
                    {
                        "name": "Herrington T.M."
                    },
                    {
                        "name": "Vorwerk J."
                    },
                    {
                        "name": "Kuhn A.A."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Lead-DBS v2: Towards a comprehensive pipeline for deep brain stimulation imaging"
            },
            "pmid": "30179717",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "version": [
        "2"
    ]
}