{"collectionID": [], "accessibility": [], "topic": [{"term": "RNA-seq", "uri": "http://edamontology.org/topic_3170"}, {"term": "RNA", "uri": "http://edamontology.org/topic_0099"}], "owner": "migle_sur", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/s12859-017-1831-5", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "SimBA: A methodology and tools for evaluating the performance of RNA-Seq bioinformatic pipelines", "abstract": "© 2017 The Author(s).Background: The evolution of next-generation sequencing (NGS) technologies has led to increased focus on RNA-Seq. Many bioinformatic tools have been developed for RNA-Seq analysis, each with unique performance characteristics and configuration parameters. Users face an increasingly complex task in understanding which bioinformatic tools are best for their specific needs and how they should be configured. In order to provide some answers to these questions, we investigate the performance of leading bioinformatic tools designed for RNA-Seq analysis and propose a methodology for systematic evaluation and comparison of performance to help users make well informed choices. Results: To evaluate RNA-Seq pipelines, we developed a suite of two benchmarking tools. SimCT generates simulated datasets that get as close as possible to specific real biological conditions accompanied by the list of genomic incidents and mutations that have been inserted. BenchCT then compares the output of any bioinformatics pipeline that has been run against a SimCT dataset with the simulated genomic and transcriptional variations it contains to give an accurate performance evaluation in addressing specific biological question. We used these tools to simulate a real-world genomic medicine question s involving the comparison of healthy and cancerous cells. Results revealed that performance in addressing a particular biological context varied significantly depending on the choice of tools and settings used. We also found that by combining the output of certain pipelines, substantial performance improvements could be achieved. Conclusion: Our research emphasizes the importance of selecting and configuring bioinformatic tools for the specific biological question being investigated to obtain optimal results. Pipeline designers, developers and users should include benchmarking in the context of their biological question as part of their design and quality control process. Our SimBA suite of benchmarking tools provides a reliable basis for comparing the performance of RNA-Seq bioinformatics pipelines in addressing a specific biological question. We would like to see the creation of a reference corpus of data-sets that would allow accurate comparison between benchmarks performed by different groups and the publication of more benchmarks based on this public corpus. SimBA software and data-set are available at http://cractools.gforge.inria.fr/softwares/simba/.", "citationCount": 0, "authors": [{"name": "Audoux J."}, {"name": "Salson M."}, {"name": "Grosset C.F."}, {"name": "Beaumeunier S."}, {"name": "Holder J.-M."}, {"name": "Commes T."}, {"name": "Philippe N."}], "date": "2017-09-29T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "CracTools Support", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "cractools-bugs@lists.gforge.inria.fr"}], "biotoolsCURIE": "biotools:simba-cractools", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://cractools.gforge.inria.fr/softwares/simba/", "function": [{"note": null, "input": [], "operation": [{"term": "Modelling and simulation", "uri": "http://edamontology.org/operation_2426"}, {"term": "RNA-Seq analysis", "uri": "http://edamontology.org/operation_3680"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:59:01Z", "otherID": [], "description": "Methodology and tools for evaluating the performance of RNA-Seq bioinformatic pipelines.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "simba-cractools", "additionDate": "2018-08-05T09:42:50Z", "name": "SimBA", "license": null, "documentation": [{"url": "http://cractools.gforge.inria.fr/getting-started/", "note": null, "type": "General"}], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Mac"]}