{
    "additionDate": "2018-10-02T08:08:30Z",
    "biotoolsCURIE": "biotools:imet-q",
    "biotoolsID": "imet-q",
    "credit": [
        {
            "email": "tsung@iis.sinica.edu.tw",
            "name": "Ting-Yi Sung",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "iMet-Q (intelligent Metabolomic Quantitation) is a software that quantifies metabolites in full-scan liquid chromatography-mass spectrometry (LC-MS) data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://ms.iis.sinica.edu.tw/comics/Software/iMet-Q/iMet-Q_UserGuide.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://ms.iis.sinica.edu.tw/comics/Software_iMet-Q.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-06-27T09:10:31Z",
    "license": "Other",
    "name": "iMet-Q",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0146112",
            "metadata": {
                "abstract": "© 2016 Chang et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Efficient and accurate quantitation of metabolites fromLC-MS data has become an important topic. Here we present an automated tool, called iMet-Q (intelligent Metabolomic Quantitation), for label-freemetabolomics quantitation fromhigh-throughput MS1 data. By performing peak detection and peak alignment, iMet-Q provides a summary of quantitation results and reports ion abundance at both replicate level and sample level. Furthermore, it gives the charge states and isotope ratios of detected metabolite peaks to facilitate metabolite identification. An in-house standard mixture and a public Arabidopsismetabolome data set were analyzed by iMet-Q. Three public quantitation tools, including XCMS,MetAlign, andMZmine 2, were used for performance comparison. Fromthe mixture data set, seven standard metabolites were detected by the four quantitation tools, for which iMet-Q had a smaller quantitation error of 12%in both profile and centroid data sets. Our tool also correctly determined the charge states of seven standard metabolites. By searching the mass values for those standard metabolites against Human Metabolome Database, we obtained a total of 183metabolite candidates.With the isotope ratios calculated by iMet-Q, 49%(89 out of 183) metabolite candidates were filtered out. From the public Arabidopsis data set reported with two internal standards and 167 elucidatedmetabolites, iMet-Q detected all of the peaks corresponding to the internal standards and 167 metabolites. Meanwhile, our tool had small abundance variation (≤0.19) when quantifying the two internal standards and had higher abundance correlation (≥0.92) when quantifying the 167 metabolites. iMet-Q provides user-friendly interfaces and is publicly available for download at http://ms.iis.sinica.edu.tw/comics/Software-iMet-Q.html.",
                "authors": [
                    {
                        "name": "Chang H.-Y."
                    },
                    {
                        "name": "Chen C.-T."
                    },
                    {
                        "name": "Lih T.M."
                    },
                    {
                        "name": "Lynn K.-S."
                    },
                    {
                        "name": "Juo C.-G."
                    },
                    {
                        "name": "Hsu W.-L."
                    },
                    {
                        "name": "Sung T.-Y."
                    }
                ],
                "citationCount": 10,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "IMet-Q: A user-friendly tool for label-free metabolomics quantitation using dynamic peak-width determination"
            },
            "pmcid": "PMC4718670",
            "pmid": "26784691",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}