{
    "additionDate": "2023-02-14T12:31:37.322910Z",
    "biotoolsCURIE": "biotools:cppa",
    "biotoolsID": "cppa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Guo-sheng Hu"
        }
    ],
    "description": "CPPA (Cancer Proteome and Phosphoproteome Atlas), a web tool to mine abnormalities of the proteome and phosphoproteome in cancer based on published data sets.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Differential protein expression profiling",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cppa.site/cppa",
    "language": [
        "JavaScript",
        "Python",
        "R"
    ],
    "lastUpdate": "2023-02-14T12:31:37.326218Z",
    "license": "Not licensed",
    "name": "CPPA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.2C00512",
            "metadata": {
                "abstract": "© 2022 The Authors. Published by American Chemical Society.A tremendous amount of proteomic and phosphoproteomic data has been produced over the years with the development of mass spectrometry techniques, providing us with new opportunities to explore and understand the proteome and phosphoproteome as well as the function of proteins and protein phosphorylation sites. However, a lack of powerful tools that we can utilize to explore these valuable data limits our understanding of the proteome and phosphoproteome, particularly in diseases such as cancer. To address these unmet needs, we established CPPA (Cancer Proteome and Phosphoproteome Atlas), a web tool to mine abnormalities of the proteome and phosphoproteome in cancer based on published data sets. All analysis results are presented in CPPA with a flexible web interface to provide key customization utilities, including general analysis, differential expression profiling, statistical analysis of protein phosphorylation sites, correlation analysis, similarity analysis, survival analysis, pathological stage analysis, etc. CPPA greatly facilitates the process of data mining and therapeutic target discovery by providing a comprehensive analysis of proteomic and phosphoproteomic data in normal and tumor tissues with a simple click, which helps to unlock the precious value of mass spectrometry data by bridging the gap between raw data and experimental biologists. CPPA is currently available at https://cppa.site/cppa.",
                "authors": [
                    {
                        "name": "He Y.-H."
                    },
                    {
                        "name": "Hu G.-S."
                    },
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Wang D.-C."
                    },
                    {
                        "name": "Zheng Z.-Z."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "CPPA: A Web Tool for Exploring Proteomic and Phosphoproteomic Data in Cancer"
            },
            "pmid": "36507870"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
