{
    "additionDate": "2017-08-20T15:58:54Z",
    "biotoolsCURIE": "biotools:samsa",
    "biotoolsID": "samsa",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "stwestreich@ucdavis.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The purpose of this pipeline is to handle beginning-to-end metatranscriptome analysis.  Starting with a raw sequenced file in fastq format, it performs cleaning and removal of adaptor contamination, and then aligns paired-end files (if specified).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/transcript/SAMSA"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://github.com/transcript/SAMSA",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2019-09-04T08:38:28Z",
    "license": "GPL-3.0",
    "name": "SAMSA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/s12859-016-1270-8",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Although metatranscriptomics-the study of diverse microbial population activity based on RNA-seq data-is rapidly growing in popularity, there are limited options for biologists to analyze this type of data. Current approaches for processing metatranscriptomes rely on restricted databases and a dedicated computing cluster, or metagenome-based approaches that have not been fully evaluated for processing metatranscriptomic datasets. We created a new bioinformatics pipeline, designed specifically for metatranscriptome dataset analysis, which runs in conjunction with Metagenome-RAST (MG-RAST) servers. Designed for use by researchers with relatively little bioinformatics experience, SAMSA offers a breakdown of metatranscriptome transcription activity levels by organism or transcript function, and is fully open source. We used this new tool to evaluate best practices for sequencing stool metatranscriptomes. Results: Working with the MG-RAST annotation server, we constructed the Simple Annotation of Metatranscriptomes by Sequence Analysis (SAMSA) software package, a complete pipeline for the analysis of gut microbiome data. SAMSA can summarize and evaluate raw annotation results, identifying abundant species and significant functional differences between metatranscriptomes. Using pilot data and simulated subsets, we determined experimental requirements for fecal gut metatranscriptomes. Sequences need to be either long reads (longer than 100 bp) or joined paired-end reads. Each sample needs 40-50 million raw sequences, which can be expected to yield the 5-10 million annotated reads necessary for accurate abundance measures. We also demonstrated that ribosomal RNA depletion does not equally deplete ribosomes from all species within a sample, and remaining rRNA sequences should be discarded. Using publicly available metatranscriptome data in which rRNA was not depleted, we were able to demonstrate that overall organism transcriptional activity can be measured using mRNA counts. We were also able to detect significant differences between control and experimental groups in both organism transcriptional activity and specific cellular functions. Conclusions: By making this new pipeline publicly available, we have created a powerful new tool for metatranscriptomics research, offering a new method for greater insight into the activity of diverse microbial communities. We further recommend that stool metatranscriptomes be ribodepleted and sequenced in a 100 bp paired end format with a minimum of 40 million reads per sample.",
                "authors": [
                    {
                        "name": "Westreich S.T."
                    },
                    {
                        "name": "Korf I."
                    },
                    {
                        "name": "Mills D.A."
                    },
                    {
                        "name": "Lemay D.G."
                    }
                ],
                "citationCount": 25,
                "date": "2016-09-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SAMSA: A comprehensive metatranscriptome analysis pipeline"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1
}