{
    "additionDate": "2019-11-14T20:01:46Z",
    "biotoolsCURIE": "biotools:PBWT-Query",
    "biotoolsID": "PBWT-Query",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "degui.zhi@uth.tmc.edu",
            "name": "Degui Zhi",
            "typeEntity": "Person"
        },
        {
            "email": "shzhang@cs.ucf.edu",
            "name": "Shaojie Zhang",
            "orcidid": "https://orcid.org/0000-0002-4051-5549",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/activetf (UCF.EDU) | > CORRECT NAME OF TOOL COULD ALSO BE 'L-PBWT-Query', 'PBWT' (bio.tools/pbwt), 'PBWT-Query L-PBWT-Query' | Efficient haplotype matching between a query and a panel for genealogical search | Efficient haplotype matching between a query and panel using PBWT-Query | Ardalan Naseri, Erwin Holzhauser, Degui Zhi, Shaojie Zhang",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://genome.ucf.edu/pbwt-query",
    "lastUpdate": "2019-11-14T20:01:46Z",
    "name": "PBWT-Query",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ347",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: With the wide availability of whole-genome genotype data, there is an increasing need for conducting genetic genealogical searches efficiently. Computationally, this task amounts to identifying shared DNA segments between a query individual and a very large panel containing millions of haplotypes. The celebrated Positional Burrows-Wheeler Transform (PBWT) data structure is a pre-computed index of the panel that enables constant time matching at each position between one haplotype and an arbitrarily large panel. However, the existing algorithm (Durbin's Algorithm 5) can only identify set-maximal matches, the longest matches ending at any location in a panel, while in real genealogical search scenarios, multiple 'good enough' matches are desired. Results: In this work, we developed two algorithmic extensions of Durbin's Algorithm 5, that can find all L-long matches, matches longer than or equal to a given length L, between a query and a panel. In the first algorithm, PBWT-Query, we introduce 'virtual insertion' of the query into the PBWT matrix of the panel, and then scanning up and down for the PBWT match blocks with length greater than L. In our second algorithm, L-PBWT-Query, we further speed up PBWT-Query by introducing additional data structures that allow us to avoid iterating through blocks of incomplete matches. The efficiency of PBWT-Query and L-PBWT-Query is demonstrated using the simulated data and the UK Biobank data. Our results show that our proposed algorithms can detect related individuals for a given query efficiently in very large cohorts which enables a fast on-line query search.",
                "authors": [
                    {
                        "name": "Naseri A."
                    },
                    {
                        "name": "Holzhauser E."
                    },
                    {
                        "name": "Zhi D."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Efficient haplotype matching between a query and a panel for genealogical search"
            },
            "pmcid": "PMC6612857",
            "pmid": "31510689"
        }
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}