{
    "additionDate": "2016-04-22T09:23:38Z",
    "biotoolsCURIE": "biotools:lailaps",
    "biotoolsID": "lailaps",
    "collectionID": [
        "denbi-gcbn",
        "de.NBI",
        "JIB.tools"
    ],
    "credit": [
        {
            "name": "Leibniz Institute of Plant Genetics and Crop Plant Research (IPK) Gatersleben",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "ipk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "lange@ipk-gatersleben.de",
            "name": "Dr. Matthias Lange",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "chenj@ipk-gatersleben.de",
            "name": "Jinbo Chen",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "lange@ipk-gatersleben.de",
            "name": "Dr. Matthias Lange",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "chenj@ipk-gatersleben.de",
            "name": "Jinbo Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A search engine which provides an exploration of plant genomic data for forward genetic research and comprises millions of quarterly updated and indexed information from major life science databases as well as millions of evidence ranked gene annotations to associate these facts to plant genome loci.",
    "documentation": [
        {
            "type": [
                "Terms of use"
            ],
            "url": "http://lailaps.ipk-gatersleben.de/license_and_disclaimer.html"
        },
        {
            "type": [
                "Citation instructions"
            ],
            "url": "http://dx.doi.org/10.1093/pcp/pcu185"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://lailaps.ipk-gatersleben.de/"
        }
    ],
    "editPermission": {
        "authors": [
            "bjsommer"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://webapps.ipk-gatersleben.de/lailaps/app",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-09-18T18:32:06Z",
    "link": [
        {
            "note": "LAILAPS@JIB.tools - a web registry of tools published in the Journal of Integrative Bioinformatics",
            "type": [
                "Software catalogue"
            ],
            "url": "https://jib.tools/details.php?id=60"
        }
    ],
    "name": "LAILAPS Search Engine (transPLANT instance)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ipk",
    "publication": [
        {
            "doi": "10.1093/pcp/pcu185",
            "metadata": {
                "abstract": "© 2014 The Author.With the number of sequenced plant genomes growing, the number of predicted genes and functional annotations is also increasing. The association between genes and phenotypic traits is currently of great interest. Unfortunately, the information available today is widely scattered over a number of different databases. Information retrieval (IR) has become an all-encompassing bioinformatics methodology for extracting knowledge from complex, heterogeneous and distributed databases, and therefore can be a useful tool for obtaining a comprehensive view of plant genomics, from genes to traits. Here we describe LAILAPS (http://lailaps.ipk-gatersleben.de), an IR system designed to link plant genomic data in the context of phenotypic attributes for a detailed forward genetic research. LAILAPS comprises around 65 million indexed documents, encompassing >13 major life science databases with around 80 million links to plant genomic resources. The LAILAPS search engine allows fuzzy querying for candidate genes linked to specific traits over a loosely integrated system of indexed and interlinked genome databases. Query assistance and an evidence-based annotation system enable time-efficient and comprehensive information retrieval. An artificial neural network incorporating user feedback and behavior tracking allows relevance sorting of results. We fully describe LAILAPS's functionality and capabilities by comparing this system's performance with other widely used systems and by reporting both a validation in maize and a knowledge discovery use-case focusing on candidate genes in barley.",
                "authors": [
                    {
                        "name": "Esch M."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Colmsee C."
                    },
                    {
                        "name": "Klapperstuck M."
                    },
                    {
                        "name": "Grafahrend-Belau E."
                    },
                    {
                        "name": "Scholz U."
                    },
                    {
                        "name": "Lange M."
                    }
                ],
                "citationCount": 7,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Plant and Cell Physiology",
                "title": "LAILAPS: The plant science search engine"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.2390/biecoll-jib-2010-118",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.2390/biecoll-jib-2010-110",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.2390/biecoll-jib-2014-237",
            "metadata": {
                "abstract": "Information Retrieval (IR) plays a central role in the exploration and interpretation of integrated biological datasets that represent the heterogeneous ecosystem of life sciences. Here, keyword based query systems are popular user interfaces. In turn, to a large extend, the used query phrases determine the quality of the search result and the effort a scientist has to invest for query refinement. In this context, computer aided query expansion and suggestion is one of the most challenging tasks for life science information systems. Existing query front-ends support aspects like spelling correction, query refinement or query expansion. However, the majority of the front-ends only make limited use of enhanced IR algorithms to implement comprehensive and computer aided query refinement workflows. In this work, we present the design of a multi-stage query suggestion workflow and its implementation in the life science IR system LAILAPS. The presented workflow includes enhanced tokenisation, word breaking, spelling correction, query expansion and query suggestion ranking. A spelling correction benchmark with 5,401 queries and manually selected use cases for query expansion demonstrate the performance of the implemented workflow and its advantages compared with state-of-the-art systems.",
                "authors": [
                    {
                        "name": "Esch M."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Weise S."
                    },
                    {
                        "name": "Hassani-Pak K."
                    },
                    {
                        "name": "Scholz U."
                    },
                    {
                        "name": "Lange M."
                    }
                ],
                "citationCount": 3,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Journal of integrative bioinformatics",
                "title": "A query suggestion workflow for life science IR-systems"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}