{
    "additionDate": "2021-01-18T07:31:50Z",
    "biotoolsCURIE": "biotools:schaplotyper",
    "biotoolsID": "schaplotyper",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yanliyingkind@aliyun.com",
            "name": "Liying Yan",
            "typeEntity": "Person"
        }
    ],
    "description": "haplotype construction and visualization for genetic diagnosis using single cell DNA sequencing data.\n\nHaplotyping reveals chromosome blocks inherited from parents to in vitro fertilized (IVF) embryos in preimplantation genetic diagnosis (PGD), enabling the observation of the transmission of disease alleles between generations. However, the methods of haplotyping that are suitable for single cells are limited because a whole genome amplification (WGA) process is performed before sequencing or genotyping in PGD, and true haplotype profiles of embryos need to be constructed based on genotypes that can contain many WGA artifacts. RESULTS:Here, we offer scHaplotyper as a genetic diagnosis tool that reconstructs and visualizes the haplotype profiles of single cells based on the Hidden Markov Model (HMM). scHaplotyper can trace the origin of each haplotype block in the embryo, enabling the detection of carrier status of disease alleles in each embryo.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yzqheart/scHaplotyper",
    "lastUpdate": "2021-02-11T17:53:19Z",
    "name": "scHaplotyper",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3381-5",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Haplotyping reveals chromosome blocks inherited from parents to in vitro fertilized (IVF) embryos in preimplantation genetic diagnosis (PGD), enabling the observation of the transmission of disease alleles between generations. However, the methods of haplotyping that are suitable for single cells are limited because a whole genome amplification (WGA) process is performed before sequencing or genotyping in PGD, and true haplotype profiles of embryos need to be constructed based on genotypes that can contain many WGA artifacts. Results: Here, we offer scHaplotyper as a genetic diagnosis tool that reconstructs and visualizes the haplotype profiles of single cells based on the Hidden Markov Model (HMM). scHaplotyper can trace the origin of each haplotype block in the embryo, enabling the detection of carrier status of disease alleles in each embryo. We applied this method in PGD in two families affected with genetic disorders, and the result was the healthy live births of two children in the two families, demonstrating the clinical application of this method. Conclusion: Next generation sequencing (NGS) of preimplantation embryos enable genetic screening for families with genetic disorders, avoiding the birth of affected babies. With the validation and successful clinical application, we showed that scHaplotyper is a convenient and accurate method to screen out embryos. More patients with genetic disorder will benefit from the genetic diagnosis of embryos. The source code of scHaplotyper is available at GitHub repository: https://github.com/yzqheart/ scHaplotyper.",
                "authors": [
                    {
                        "name": "Chang D."
                    },
                    {
                        "name": "Guan S."
                    },
                    {
                        "name": "Kuo Y."
                    },
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Nie Y."
                    },
                    {
                        "name": "Qiao J."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Yan L."
                    },
                    {
                        "name": "Yan Z."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ScHaplotyper: Haplotype construction and visualization for genetic diagnosis using single cell DNA sequencing data"
            },
            "pmcid": "PMC6995221",
            "pmid": "32007105"
        }
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
