{
    "additionDate": "2023-09-11T07:10:47.090802Z",
    "biotoolsCURIE": "biotools:galaxy7tm",
    "biotoolsID": "galaxy7tm",
    "description": "The Galaxy7TM server improves an input GPCR structure by simultaneous ligand docking and flexible structure refinement using GALAXY methods.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://galaxy.seoklab.org/7TM/",
    "lastUpdate": "2023-09-11T07:10:47.096853Z",
    "name": "Galaxy7TM",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1093/nar/gkw360",
            "metadata": {
                "abstract": "G-protein-coupled receptors (GPCRs) play important physiological roles related to signal transduction and form a major group of drug targets. Prediction of GPCR-ligand complex structures has therefore important implications to drug discovery. With previously available servers, it was only possible to first predict GPCR structures by homology modeling and then perform ligand docking on the model structures. However, model structures generated without explicit consideration of specific ligands of interest can be inaccurate because GPCR structures can be affected by ligand binding. The Galaxy7TM server, freely accessible at http://galaxy.seoklab.org/7TM, improves an input GPCR structure by simultaneous ligand docking and flexible structure refinement using GALAXY methods. The server shows better performance in both ligand docking and GPCR structure refinement than commonly used programs AutoDock Vina and Rosetta MPrelax, respectively.",
                "authors": [
                    {
                        "name": "Lee G.R."
                    },
                    {
                        "name": "Seok C."
                    }
                ],
                "citationCount": 26,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Galaxy7TM: flexible GPCR-ligand docking by structure refinement"
            },
            "type": [
                "Primary"
            ]
        }
    ]
}
