
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "Apache-2.0",
        "topic": [
            {
                "term": "Medicinal chemistry",
                "uri": "http://edamontology.org/topic_0209"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 American Chemical Society.Inspecting protein and ligand electrostatic potential (ESP) surfaces in order to optimize electrostatic complementarity is a key activity in drug design. These ESP surfaces need to reflect the true electrostatic nature of the molecules, which typically means time-consuming high-level quantum mechanics (QM) calculations are required. For interactive design much faster alternative methods are required. Here, we present a graph convolutional deep neural network (DNN) model, trained on ESP surfaces derived from high quality QM calculations, that generates ESP surfaces for ligands in a fraction of a second. Additionally, we describe a method for constructing fast QM-trained ESP surfaces for proteins. We show that the DNN model generates ESP surfaces that are in good agreement with QM and that the ESP values correlate well with experimental properties relevant to medicinal chemistry. We believe that these high-quality, interactive ESP surfaces form a powerful tool for driving drug discovery programs forward. The trained model and associated code are available from https://github.com/AstexUK/ESP_DNN.",
            "authors": [
                "Rathi P.C.",
                "Ludlow R.F.",
                "Verdonk M.L."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JMEDCHEM.9B01129",
            "journal": "Journal of Medicinal Chemistry",
            "pmid": "31553186",
            "title": "Practical high-quality electrostatic potential surfaces for drug discovery using a graph-convolutional deep neural network",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:DNN",
        "biotoolsID": "DNN",
        "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'ESP' (bio.tools/esp) | Practical High-Quality Electrostatic Potential Surfaces for Drug Discovery Using a Graph-Convolutional Deep Neural Network | A Graph-Convolutional Deep Neural Network for predicting electrostatic potential surfaces | For generating ligand PQR files, a graph convolutional deep neural network (DNN) model, trained on ESP surfaces derived using DFT calculations for ~100,000 molecules, is used. For proteins, parametrized charges for amino acids are used, which are fully compatible with the ligand ESP surfaces generated using the DNN model",
        "homepage": "https://github.com/AstexUK/ESP_DNN",
        "name": "DNN"
    }
}