{
    "additionDate": "2020-01-09T17:38:41Z",
    "biotoolsCURIE": "biotools:CauseMap",
    "biotoolsID": "CauseMap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cyrusmaher@gmail.com",
            "name": "M. Cyrus Maher",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast inference of causality from complex time series.\n\nCausal inference in non-linear dynamics systems.\n\nWelcome to CauseMap — CauseMap 0.1.0 documentation.\n\nCauseMap is an implementation of Convergent Cross Mapping (CCM), written in Julia.\n\nCauseMap is an implementation of Convergent Cross Mapping (CCM) [1], written in Julia",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://cyrusmaher.github.io/CauseMap.jl",
    "language": [
        "Julia",
        "Python"
    ],
    "lastUpdate": "2021-01-24T13:51:20Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cyrusmaher/CauseMap.jl"
        }
    ],
    "name": "CauseMap",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7287/PEERJ.PREPRINTS.583V2",
            "pmcid": "PMC4359046",
            "pmid": "25780776"
        },
        {
            "doi": "10.7717/peerj.824",
            "metadata": {
                "abstract": "© 2015 Maher and Hernandez.Background. Establishing health-related causal relationships is a central pursuit in biomedical research. Yet, the interdependent non-linearity of biological systems renders causal dynamics laborious and at times impractical to disentangle. This pursuit is further impeded by the dearth of time series that are sufficiently long to observe and understand recurrent patterns of flux. However, as data generation costs plummet and technologies like wearable devices democratize data collection, we anticipate a coming surge in the availability of biomedically-relevant time series data. Given the life-saving potential of these burgeoning resources, it is critical to invest in the development of open source software tools that are capable of drawing meaningful insight fromvast amounts of time series data. Results. Here we present CauseMap, the first open source implementation of convergent cross mapping (CCM), a method for establishing causality from long time series data (≳25 observations). Compared to existing time series methods, CCM has the advantage of being model-free and robust to unmeasured confounding that could otherwise induce spurious associations. CCM builds on Takens' Theorem, a well-established result from dynamical systems theory that requires only mild assumptions. This theorem allows us to reconstruct high dimensional system dynamics using a time series of only a single variable. These reconstructions can be thought of as shadows of the true causal system. If reconstructed shadows can predict points from opposing time series, we can infer that the corresponding variables are providing views of the same causal system, and so are causally related. Unlike traditional metrics, this test can establish the directionality of causation, even in the presence of feedback loops. Furthermore, since CCM can extract causal relationships fromtimes series of, e.g., a single individual, it may be a valuable tool to personalized medicine. We implement CCM in Julia, a high-performance programming language designed for facile technical computing. Our software package, CauseMap, is platform-independent and freely available as an official Julia package. Conclusions. CauseMap is an efficient implementation of a state-of-the-art algorithm for detecting causality from time series data. We believe this tool will be a valuable resource for biomedical research and personalized medicine.",
                "authors": [
                    {
                        "name": "Maher M.C."
                    },
                    {
                        "name": "Hernandez R.D."
                    }
                ],
                "citationCount": 5,
                "date": "2015-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "CauseMap: Fast inference of causality fromcomplex time series"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}