{
    "accessibility": "Restricted access",
    "additionDate": "2022-03-21T12:05:27.515908Z",
    "biotoolsCURIE": "biotools:automatic_segmentation_tool",
    "biotoolsID": "automatic_segmentation_tool",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "credit": [
        {
            "email": "marcial.garcia.sspa@juntadeandalucia.es",
            "name": "Marcial García Rojo",
            "note": "All the code of this tool has been developed by Blanca Priego Torres.",
            "orcidid": "https://orcid.org/0000-0001-6272-9401",
            "typeEntity": "Project"
        }
    ],
    "description": "Tool that automatically detects the histological type of a tumor region of interest from Whole Slide Imaging technique",
    "editPermission": {
        "authors": [
            "IreneBernalFlorindo",
            "Valderas"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "Federated Human Data"
    ],
    "elixirNode": [
        "Spain"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://telemed.uca.es:443/",
    "language": [
        "Other",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-03-21T12:07:44.136655Z",
    "link": [
        {
            "type": [
                "Technical monitoring"
            ],
            "url": "https://github.com/INiBICA-CO07/Automatic-Segmentation-Tool"
        }
    ],
    "maturity": "Emerging",
    "name": "Automatic segmentation tool",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "IreneBernalFlorindo",
    "publication": [
        {
            "doi": "10.1016/j.eswa.2020.113387",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdThe segmentation of malignant breast tissue from histological images represents a crucial task for the diagnosis of breast cancer (BC). This is a time-consuming process that could be alleviated with the help of computerized segmentation methods, leading to elevated precision and reproducibility results. However, this automated segmentation poses a challenge due to the large size of histological whole-slide images and the significant variability, heterogeneity and complexity of features in them. In this research, we propose a processing pipeline for the automatic segmentation of stained BC images presenting different types of histopathological patterns. To deal with the gigantic size of whole-slide images, the digital preparations were processed in a tile-wise manner: a large part of the image is split into patches. Then, the segmentation of each tile was accomplished by applying a deep convolutional neural network (DCNN) along with an encoder-decoder with separable atrous convolution architecture, which, once successfully validated, has revealed to be a promising method to segment pathological image patches. Next, in order to combine the local segmentation results (segmented tiles), while avoiding discontinuities and inconsistencies, an improved merging strategy based on an efficient fully connected Conditional Random Field (CRF) was applied. Experimental results on a collection of patches of breast cancer images demonstrate how the designed processing pipeline performs properly regardless the size, texture or any other colour-shape features typical of the malignant carcinomas considered in this study. The estimated segmentation accuracy and frequency weighted intersection over union (FWIoU) were 95.62%, 92.52%, respectively. Additionally, in order to facilitate the collaboration between pathologists and researchers to extract the specialist knowledge in form of training datasets that allows the training of new algorithms, a web-based platform which includes a slide-viewer and an annotation tool was developed. The automatic segmentation method proposed in this work was integrated into this platform and currently, it is being used as a decision support tool by pathologists.",
                "authors": [
                    {
                        "name": "Fernandez-Granero M.A."
                    },
                    {
                        "name": "Garcia-Rojo M."
                    },
                    {
                        "name": "Priego-Torres B.M."
                    },
                    {
                        "name": "Sanchez-Morillo D."
                    }
                ],
                "citationCount": 16,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Expert Systems with Applications",
                "title": "Automatic segmentation of whole-slide H&E stained breast histopathology images using a deep convolutional neural network architecture"
            }
        }
    ],
    "relation": [
        {
            "biotoolsID": "slides_viewer",
            "type": "includedIn"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
