{
    "additionDate": "2020-01-14T09:37:39Z",
    "biotoolsCURIE": "biotools:THEDS",
    "biotoolsID": "THEDS",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "paolo.fusar-poli@kcl.ac.uk",
            "name": "Paolo Fusar-Poli",
            "typeEntity": "Person"
        }
    ],
    "description": "Pan-London Network for Psychosis-Prevention (PNP).\n\nTower Hamlets Early Detection Service.\n\nI used to have so many problems, I didn’t feel that life was worth much. Being with THEDS has satisfied me because I feel that I have got the help and support I want. Service User Tower Hamlets.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Pan-London', 'PNP', 'South-London', 'CHR-P'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                }
            ]
        }
    ],
    "homepage": "https://theds.elft.nhs.uk/",
    "lastUpdate": "2020-01-14T09:37:39Z",
    "name": "THEDS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPSYT.2019.00707",
            "metadata": {
                "abstract": "© Copyright © 2019 Fusar-Poli, Estradé, Spencer, Gupta, Murguia-Asensio, Eranti, Wilding, Andlauer, Buhagiar, Smith, Fitzell, Sear, Ademan, De Micheli and McGuire.Background: The empirical success of the Clinical High Risk for Psychosis (CHR-P) paradigm is determined by the concurrent integration of efficient detection of cases at-risk, accurate prognosis, and effective preventive treatment within specialized clinical services. The characteristics of the CHR-P services are relatively under-investigated. Method: A Pan-London Network for psychosis prevention (PNP) was created across urban CHR-P services. These services were surveyed to collect the following: description of the service and catchment area, outreach, service users, interventions, and outcomes. The results were analyzed with descriptive statistics and Kaplan Meier failure function. Results: The PNP included five CHR-P services across two NHS Trusts: Outreach and Support In South-London (OASIS) in Lambeth and Southwark, OASIS in Croydon and Lewisham, Tower Hamlets Early Detection Service (THEDS), City & Hackney At-Risk Mental State Service (HEADS UP) and Newham Early Intervention Service (NEIS). The PNP serves a total population of 2,318,515 Londoners (830,889; age, 16–35 years), with a yearly recruitment capacity of 220 CHR-P individuals (age, 22.55 years). Standalone teams (OASIS and THEDS) are more established and successful than teams that share their resources with other mental health services (HEADS UP, NEIS). Characteristics of the catchment areas, outreach and service users, differ across PNP services; all of them offer psychotherapy to prevent psychosis. The PNP is supporting several CHR-P translational research projects. Conclusions: The PNP is the largest CHR-P clinical network in the UK; it represents a reference benchmark for implementing detection, prognosis, and care in the real-world clinical routine, as well as for translating research innovations into practice.",
                "authors": [
                    {
                        "name": "Fusar-Poli P."
                    },
                    {
                        "name": "Estrade A."
                    },
                    {
                        "name": "Spencer T.J."
                    },
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Murguia-Asensio S."
                    },
                    {
                        "name": "Eranti S."
                    },
                    {
                        "name": "Wilding K."
                    },
                    {
                        "name": "Andlauer O."
                    },
                    {
                        "name": "Buhagiar J."
                    },
                    {
                        "name": "Smith M."
                    },
                    {
                        "name": "Fitzell S."
                    },
                    {
                        "name": "Sear V."
                    },
                    {
                        "name": "Ademan A."
                    },
                    {
                        "name": "De Micheli A."
                    },
                    {
                        "name": "McGuire P."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-11T00:00:00Z",
                "journal": "Frontiers in Psychiatry",
                "title": "Pan-London Network for Psychosis-Prevention (PNP)"
            },
            "pmcid": "PMC6798006",
            "pmid": "31681029"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}