{
    "accessibility": "Open access",
    "additionDate": "2022-03-11T12:39:42.207790Z",
    "biotoolsCURIE": "biotools:te-hi-gcn",
    "biotoolsID": "te-hi-gcn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "caopeng@cse.neu.edu.cn",
            "name": "Peng Cao",
            "typeEntity": "Person"
        },
        {
            "name": "Guangqi Wen"
        },
        {
            "name": "Hao Jiang"
        },
        {
            "name": "Jinzhu Yang"
        },
        {
            "name": "Lanting Li"
        },
        {
            "name": "Mingyi Xu"
        },
        {
            "name": "Osmar Zaiane"
        },
        {
            "name": "Xiaoli Liu"
        }
    ],
    "description": "An Ensemble of Transfer Hierarchical Graph Convolutional Networks for Disorder Diagnosis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/llt1836/TE-HI-GCN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-11T12:39:42.210603Z",
    "license": "Not licensed",
    "name": "TE-HI-GCN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S12021-021-09548-1",
            "metadata": {
                "abstract": "© 2021, The Author(s), under exclusive licence to Springer Science+Business Media, LLC, part of Springer Nature.Accurate diagnosis of psychiatric disorders plays a critical role in improving the quality of life for patients and potentially supports the development of new treatments. Graph convolutional networks (GCNs) are shown to be successful in modeling applications with graph structures. However, training an accurate GCNs model for brain networks faces several challenges, including high dimensional and noisy correlation in the brain networks, limited labeled training data, and depth limitation of GCN learning. Generalization and interpretability are important in developing predictive models for clinical diagnosis. To address these challenges, we proposed an ensemble framework involving hierarchical GCN and transfer learning for sparse brain networks, which allows GCN to capture the intrinsic correlation among the subjects and domains, to improve the network embedding learning for disease diagnosis. Extensive experiments on two real medical clinical applications: diagnosis of Autism spectrum disorder (ASD) and diagnosis of Alzheimer’s disease (AD) on both the ADNI and ABIDE databases, showing the effectiveness of the proposed framework. We achieved state-of-the-art accuracy and AUC for AD/MCI and ASD/NC (Normal control) classification in comparison with studies that used functional connectivity as features or GCN models. The proposed TE-HI-GCN model achieves the best classification performance, leading to about 27.93% (31.38%) improvement for ASD and 16.86% (44.50%) for AD in terms of accuracy and AUC compared with the traditional GCN model. Moreover, the obtained clustering results show high correspondence with the previous neuroimaging derived evidence of within and between-networks biomarkers for ASD. The discovered subnetworks are used as evidence for the proposed TE-HI-GCN model. Furthermore, this work is the first attempt of transfer learning on the two related disorder domains to uncover the correlation among the two diseases with a transfer learning scheme.",
                "authors": [
                    {
                        "name": "Cao P."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wen G."
                    },
                    {
                        "name": "Xu M."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zaiane O."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "TE-HI-GCN: An Ensemble of Transfer Hierarchical Graph Convolutional Networks for Disorder Diagnosis"
            },
            "pmid": "34761367"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ]
}
