
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/amkozlov"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/amkozlov/sativa"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            },
            {
                "term": "Evolutionary biology",
                "uri": "http://edamontology.org/topic_3299"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/sativa-semi-automatic-taxonomy-improvement-and-validation-algorithm.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research. Molecular sequences in public databases are mostly annotated by the submitting authors without further validation. This procedure can generate erroneous taxonomic sequence labels. Mislabeled sequences are hard to identify, and they can induce downstream errors because new sequences are typically annotated using existing ones. Furthermore, taxonomic mislabelings in reference sequence databases can bias metagenetic studies which rely on the taxonomy. Despite significant efforts to improve the quality of taxonomic annotations, the curation rate is low because of the labor-intensive manual curation process. Here, we present SATIVA, a phylogeny-aware method to automatically identify taxonomically mislabeled sequences ('mislabels') using statistical models of evolution. We use the Evolutionary Placement Algorithm (EPA) to detect and score sequences whose taxonomic annotation is not supported by the underlying phylogenetic signal, and automatically propose a corrected taxonomic classification for those. Using simulated data, we show that our method attains high accuracy for identification (96.9% sensitivity/91.7% precision) as well as correction (94.9% sensitivity/89.9% precision) of mislabels. Furthermore, an analysis of four widely used microbial 16S reference databases (Greengenes, LTP, RDP and SILVA) indicates that they currently contain between 0.2% and 2.5% mislabels. Finally, we use SATIVA to perform an in-depth evaluation of alternative taxonomies for Cyanobacteria.",
            "authors": [
                "Kozlov A.M.",
                "Zhang J.",
                "Yilmaz P.",
                "Glockner F.O.",
                "Stamatakis A."
            ],
            "cit_count": 15,
            "journal": "Nucleic Acids Research",
            "pmid": "27166378",
            "title": "Phylogeny-aware identification and correction of taxonomically mislabeled sequences",
            "year": "2016-06-20"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sativa",
        "biotoolsID": "sativa",
        "description": "A pipeline that uses Evolutionary Placement Algorithm (EPA) to identify taxonomically mislabeled sequences and suggest corrections.",
        "homepage": "https://github.com/amkozlov/sativa",
        "name": "SATIVA"
    }
}