{
    "additionDate": "2021-03-19T08:39:15Z",
    "biotoolsCURIE": "biotools:ienhancer-kl",
    "biotoolsID": "ienhancer-kl",
    "confidence_flag": "tool",
    "description": "A novel two-layer predictor for identifying enhancer by position specific of nucleotide composition.\n\nAn enhancer is a short region of DNA with the ability to recruit transcription factors and their complexes, thus increasing the likelihood of the transcription possibility. Considering the importance of enhancers, the enhancer identification was popular in computational biology. In this paper, we propose a two-layer enhancer predictor, called iEnhancer-KL. Kullback-Leibler (KL) divergence is taken into consideration to improve feature extraction method PSTNP. Furthermore, LASSO is used to reduce the dimension of features to get better prediction performance. Finally, the selected features are tested on several machine learning models to find the best model with great performance",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Not-so-middle/iEnhancer-KL.git",
    "language": [
        "C++",
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-03-31T18:20:53Z",
    "name": "iEnhancer-KL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TCBB.2021.3053608",
            "metadata": {
                "abstract": "IEEEAn enhancer is a short region of DNA with the ability to recruit transcription factors and their complexes, thus increasing the likelihood of the transcription possibility. Considering the importance of enhancers, the enhancer identification was popular in computational biology. In this paper, we propose a two-layer enhancer predictor, called iEnhancer-KL. Kullback&#x2013;Leibler (KL) divergence is taken into consideration to improve feature extraction method PSTNP. Furthermore, LASSO is used to reduce the dimension of features to get better prediction performance. Finally, the selected features are tested on several machine learning models to find the best model with great performance. The rigorous cross-validations have indicated that our proposed predictor is remarkably superior to the existing state-of-the-art methods with an accuracy of 84.23% and the MCC of 0.6849 for identifying enhancer. Our code and results can be freely download from https://github.com/Not-so-middle/iEnhancer-KL.git.",
                "authors": [
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Guo F."
                    },
                    {
                        "name": "He W."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Lyu Y."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "iEnhancer-KL: a novel two-layer predictor for identifying enhancer by position specific of nucleotide composition"
            },
            "pmid": "33481715"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
