{
    "additionDate": "2019-11-14T20:07:27Z",
    "biotoolsCURIE": "biotools:immunedeconv",
    "biotoolsID": "immunedeconv",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "g.sturm@tum.de",
            "name": "Gregor Sturm",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive evaluation of transcriptome-based cell-type quantification methods for immuno-oncology | Reproducible pipeline for \"Comprehensive evaluation of cell-type quantification methods for immuno-oncology\", Sturm et al. 2019, https://doi.org/10.1093/bioinformatics/btz363 | Comprehensive evaluation of cell-type quantification methods for immuno-oncology | A unified interface to immune deconvolution methods (CIBERSORT, EPIC, quanTIseq, TIMER, xCell, MCPcounter) | immunedeconv - an R package for unified access to computational methods for estimating immune cell fractions from bulk RNA sequencing data | Sturm, G., Finotello, F., Petitprez, F., Zhang, J | The source code in this project can be used to reproduce the results described in the paper",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/grst/immune_deconvolution_benchmark",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-14T09:16:37Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/grst/immunedeconv"
        }
    ],
    "name": "immunedeconv",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ363",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: The composition and density of immune cells in the tumor microenvironment (TME) profoundly influence tumor progression and success of anti-cancer therapies. Flow cytometry, immunohistochemistry staining or single-cell sequencing are often unavailable such that we rely on computational methods to estimate the immune-cell composition from bulk RNA-sequencing (RNA-seq) data. Various methods have been proposed recently, yet their capabilities and limitations have not been evaluated systematically. A general guideline leading the research community through cell type deconvolution is missing. Results: We developed a systematic approach for benchmarking such computational methods and assessed the accuracy of tools at estimating nine different immune- and stromal cells from bulk RNA-seq samples. We used a single-cell RNA-seq dataset of ∼11 000 cells from the TME to simulate bulk samples of known cell type proportions, and validated the results using independent, publicly available gold-standard estimates. This allowed us to analyze and condense the results of more than a hundred thousand predictions to provide an exhaustive evaluation across seven computational methods over nine cell types and ∼1800 samples from five simulated and real-world datasets. We demonstrate that computational deconvolution performs at high accuracy for well-defined cell-type signatures and propose how fuzzy cell-type signatures can be improved. We suggest that future efforts should be dedicated to refining cell population definitions and finding reliable signatures.",
                "authors": [
                    {
                        "name": "Aneichyk T."
                    },
                    {
                        "name": "Baumbach J."
                    },
                    {
                        "name": "Finotello F."
                    },
                    {
                        "name": "Fridman W.H."
                    },
                    {
                        "name": "List M."
                    },
                    {
                        "name": "Petitprez F."
                    },
                    {
                        "name": "Sturm G."
                    },
                    {
                        "name": "Zhang J.D."
                    }
                ],
                "citationCount": 100,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Comprehensive evaluation of transcriptome-based cell-type quantification methods for immuno-oncology"
            },
            "pmcid": "PMC6612828",
            "pmid": "31510660"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
