{
    "additionDate": "2018-08-11T08:48:31Z",
    "biotoolsCURIE": "biotools:poets",
    "biotoolsID": "poets",
    "credit": [
        {
            "email": "dmb457@cornell.edu",
            "name": "David M. Bassen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Constrained multiobjective optimization approach to estimate biochemical model ensembles in the Julia programming language.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/varnerlab/POETs.jl"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular model refinement",
                    "uri": "http://edamontology.org/operation_0322"
                }
            ]
        }
    ],
    "homepage": "https://github.com/varnerlab/POETs.jl",
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "POETs",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12918-016-0380-2",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Ensemble modeling is a promising approach for obtaining robust predictions and coarse grained population behavior in deterministic mathematical models. Ensemble approaches address model uncertainty by using parameter or model families instead of single best-fit parameters or fixed model structures. Parameter ensembles can be selected based upon simulation error, along with other criteria such as diversity or steady-state performance. Simulations using parameter ensembles can estimate confidence intervals on model variables, and robustly constrain model predictions, despite having many poorly constrained parameters. Results: In this software note, we present a multiobjective based technique to estimate parameter or models ensembles, the Pareto Optimal Ensemble Technique in the Julia programming language (JuPOETs). JuPOETs integrates simulated annealing with Pareto optimality to estimate ensembles on or near the optimal tradeoff surface between competing training objectives. We demonstrate JuPOETs on a suite of multiobjective problems, including test functions with parameter bounds and system constraints as well as for the identification of a proof-of-concept biochemical model with four conflicting training objectives. JuPOETs identified optimal or near optimal solutions approximately six-fold faster than a corresponding implementation in Octave for the suite of test functions. For the proof-of-concept biochemical model, JuPOETs produced an ensemble of parameters that gave both the mean of the training data for conflicting data sets, while simultaneously estimating parameter sets that performed well on each of the individual objective functions. Conclusions: JuPOETs is a promising approach for the estimation of parameter and model ensembles using multiobjective optimization. JuPOETs can be adapted to solve many problem types, including mixed binary and continuous variable types, bilevel optimization problems and constrained problems without altering the base algorithm. JuPOETs is open source, available under an MIT license, and can be installed using the Julia package manager from the JuPOETs GitHub repository",
                "authors": [
                    {
                        "name": "Bassen D.M."
                    },
                    {
                        "name": "Butcher J.T."
                    },
                    {
                        "name": "Minot M."
                    },
                    {
                        "name": "Varner J.D."
                    },
                    {
                        "name": "Vilkhovoy M."
                    }
                ],
                "citationCount": 6,
                "date": "2017-01-25T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "JuPOETs: A constrained multiobjective optimization approach to estimate biochemical model ensembles in the Julia programming language"
            },
            "pmcid": "PMC5264316",
            "pmid": "28122561"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}
