{
    "additionDate": "2017-12-18T00:09:58Z",
    "biotoolsCURIE": "biotools:osirix",
    "biotoolsID": "osirix",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dim.hcuge.ch/uin/01_Presentation_EN.htm"
        }
    ],
    "description": "OsiriX is an image processing software dedicated to DICOM images (“.dcm” / “.DCM” extension) produced by imaging equipment (MRI, CT, PET, PET-CT, SPECT-CT, Ultrasounds, …). It is fully compliant with the DICOM standard for image comunication and image file formats. OsiriX is able to receive images transferred by DICOM communication protocol from any PACS or imaging modality (C-STORE SCP/SCU, and Query/Retrieve : C-MOVE SCU/SCP, C-FIND SCU/SCP, C-GET SCU/SCP, WADO) .",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.osirix-viewer.com/about/story/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Processing",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.osirix-viewer.com/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:27:52.009895Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/osirix-3-9-2-dicom-viewer.html"
        }
    ],
    "name": "OsiriX",
    "operatingSystem": [
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_013618"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1007/s10278-004-1014-6",
            "metadata": {
                "abstract": "A multidimensional image navigation and display software was designed for display and interpretation of large sets of multidimensional and multimodality images such as combined PET-CT studies. The software is developed in Objective-C on a Macintosh platform under the MacOS X operating system using the GNUstep development environment. It also benefits from the extremely fast and optimized 3D graphic capabilities of the OpenGL graphic standard widely used for computer games optimized for taking advantage of any hardware graphic accelerator boards available. In the design of the software special attention was given to adapt the user interface to the specific and complex tasks of navigating through large sets of image data. An interactive jog-wheel device widely used in the video and movie industry was implemented to allow users to navigate in the different dimensions of an image set much faster than with a traditional mouse or on-screen cursors and sliders. The program can easily be adapted for very specific tasks that require a limited number of functions, by adding and removing tools from the program's toolbar and avoiding an overwhelming number of unnecessary tools and functions. The processing and image rendering tools of the software are based on the open-source libraries ITK and VTK. This ensures that all new developments in image processing that could emerge from other academic institutions using these libraries can be directly ported to the OsiriX program. OsiriX is provided free of charge under the GNU open-source licensing agreement at http://homepage.mac.com/rossetantoine/osirix. Copyright © 2004 by SCAR (Society for Computer Applications in Radiology).",
                "authors": [
                    {
                        "name": "Ratib O."
                    },
                    {
                        "name": "Rosset A."
                    },
                    {
                        "name": "Spadola L."
                    }
                ],
                "citationCount": 1540,
                "date": "2004-09-01T00:00:00Z",
                "journal": "Journal of Digital Imaging",
                "title": "OsiriX: An open-source software for navigating in multidimensional DICOM images"
            },
            "pmcid": "PMC3046608",
            "pmid": "15534753",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        }
    ],
    "validated": 1,
    "version": [
        "6.5.1"
    ]
}
