{
    "accessibility": "Open access",
    "additionDate": "2024-01-02T02:11:50.145026Z",
    "biotoolsCURIE": "biotools:umetaflow",
    "biotoolsID": "umetaflow",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tiwe@biosustain.dtu.dk",
            "name": "Tilmann Weber",
            "typeEntity": "Person"
        }
    ],
    "description": "Untargeted metabolomics workflow for high-throughput data processing and analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biosustain/snakemake_UmetaFlow",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:25:26.220285Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/biosustain/pyOpenMS_UmetaFlow"
        }
    ],
    "name": "UmetaFlow",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s13321-023-00724-w",
            "metadata": {
                "abstract": "Metabolomics experiments generate highly complex datasets, which are time and work-intensive, sometimes even error-prone if inspected manually. Therefore, new methods for automated, fast, reproducible, and accurate data processing and dereplication are required. Here, we present UmetaFlow, a computational workflow for untargeted metabolomics that combines algorithms for data pre-processing, spectral matching, molecular formula and structural predictions, and an integration to the GNPS workflows Feature-Based Molecular Networking and Ion Identity Molecular Networking for downstream analysis. UmetaFlow is implemented as a Snakemake workflow, making it easy to use, scalable, and reproducible. For more interactive computing, visualization, as well as development, the workflow is also implemented in Jupyter notebooks using the Python programming language and a set of Python bindings to the OpenMS algorithms (pyOpenMS). Finally, UmetaFlow is also offered as a web-based Graphical User Interface for parameter optimization and processing of smaller-sized datasets. UmetaFlow was validated with in-house LC–MS/MS datasets of actinomycetes producing known secondary metabolites, as well as commercial standards, and it detected all expected features and accurately annotated 76% of the molecular formulas and 65% of the structures. As a more generic validation, the publicly available MTBLS733 and MTBLS736 datasets were used for benchmarking, and UmetaFlow detected more than 90% of all ground truth features and performed exceptionally well in quantification and discriminating marker selection. We anticipate that UmetaFlow will provide a useful platform for the interpretation of large metabolomics datasets. Graphical Abstract: [Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Alka O."
                    },
                    {
                        "name": "Kohlbacher O."
                    },
                    {
                        "name": "Kontou E.E."
                    },
                    {
                        "name": "Mohite O.S."
                    },
                    {
                        "name": "Nuhamunada M."
                    },
                    {
                        "name": "Pfeuffer J."
                    },
                    {
                        "name": "Sachsenberg T."
                    },
                    {
                        "name": "Walter A."
                    },
                    {
                        "name": "Weber T."
                    }
                ],
                "citationCount": 7,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "UmetaFlow: an untargeted metabolomics workflow for high-throughput data processing and analysis"
            },
            "pmcid": "PMC10176759",
            "pmid": "37173725"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
