{
    "additionDate": "2020-01-14T19:47:56Z",
    "biotoolsCURIE": "biotools:ceRNA",
    "biotoolsID": "ceRNA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jinyan.li@uts.edu.au",
            "name": "Jinyan Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A method for constructing a competing endogenous RNA (ceRNA) network from RNA-seq data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChaowangLan/ceRNA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-09T13:39:04Z",
    "name": "ceRNA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6321-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: A long noncoding RNA (lncRNA) can act as a competing endogenous RNA (ceRNA) to compete with an mRNA for binding to the same miRNA. Such an interplay between the lncRNA, miRNA, and mRNA is called a ceRNA crosstalk. As an miRNA may have multiple lncRNA targets and multiple mRNA targets, connecting all the ceRNA crosstalks mediated by the same miRNA forms a ceRNA network. Methods have been developed to construct ceRNA networks in the literature. However, these methods have limits because they have not explored the expression characteristics of total RNAs. Results: We proposed a novel method for constructing ceRNA networks and applied it to a paired RNA-seq data set. The first step of the method takes a competition regulation mechanism to derive candidate ceRNA crosstalks. Second, the method combines a competition rule and pointwise mutual information to compute a competition score for each candidate ceRNA crosstalk. Then, ceRNA crosstalks which have significant competition scores are selected to construct the ceRNA network. The key idea, pointwise mutual information, is ideally suitable for measuring the complex point-to-point relationships embedded in the ceRNA networks. Conclusion: Computational experiments and results demonstrate that the ceRNA networks can capture important regulatory mechanism of breast cancer, and have also revealed new insights into the treatment of breast cancer. The proposed method can be directly applied to other RNA-seq data sets for deeper disease understanding.",
                "authors": [
                    {
                        "name": "Lan C."
                    },
                    {
                        "name": "Peng H."
                    },
                    {
                        "name": "Hutvagner G."
                    },
                    {
                        "name": "Li J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Construction of competing endogenous RNA networks from paired RNA-seq data sets by pointwise mutual information"
            },
            "pmcid": "PMC6929403",
            "pmid": "31874629"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}