{
    "additionDate": "2020-01-09T18:33:24Z",
    "biotoolsCURIE": "biotools:ensembl_autogenerated",
    "biotoolsID": "ensembl_autogenerated",
    "confidence_flag": "very low",
    "description": "DNA methylation profiles of genes associated with angiogenesis in the samples of placenta in pregnancies complicated by intrauterine growth restriction.\n\nExport custom datasets from Ensembl with this data-mining tool.\n\nEnsembl is a genome browser for vertebrate genomes that supports research in comparative genomics, evolution, sequence variation and transcriptional regulation. Ensembl annotate genes, computes multiple alignments, predicts regulatory function and collects disease data. Ensembl tools include BLAST, BLAT, BioMart and the Variant Effect Predictor (VEP) for all supported species.\n\n||| NAME (ensembl) SIMILAR TO (PUB. DIFFERENT) bio.tools/ensembl (Ensembl).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'IUGR pregnancies', 'CpGi IUGR', 'IUGR', 'CpGi'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://www.ensembl.org",
    "lastUpdate": "2020-01-09T18:33:24Z",
    "name": "ensembl_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/14767058.2019.1671344",
            "metadata": {
                "abstract": "© 2019, © 2019 Informa UK Limited, trading as Taylor & Francis Group.Background: Impairment in placental angiogenesis is blamed for the etiopathogenesis of intrauterine growth restriction (IUGR). Aim: To assess the genes related to angiogenesis in placental biopsies of pregnancies complicated by IUGR that could be aberrantly methylated and adversely affect placental angiogenesis. Methods: The methylation profiles of soluble fms-like tyrosine kinase-1 (sFLT-1), vascular endothelial growth factor (VEGF), and the placental growth factor (PIGF) were evaluated using Illumina MiSeq™ System in placental biopsies from term IUGR pregnancies without preeclampsia (n = 18) and healthy controls (n = 17). DNA was isolated from samples of tissue collected from the fetal side of the placenta. In the targeted regions, we have identified 30, 24, and 29 CpG islands (CpGi) within sFLT-1, VEGF and PIGF genes, respectively. CpGi which are most methylated in the promoter regions of three genes were selected for the study from the database http://www.ensembl.org. Result(s): IUGR fetuses had significantly lower placental and fetal birth weight than controls. The promoter of sFLT-1 at three CpGi and VEGF at six CpGi were the regions with significant methylation differences between IUGR and control placentas. sFLT-1 was hypermethylated at 265 and 352 CpGi; however, hypermethylation was lower in IUGR group compared to control group at this position. sFLT-1 was hypomethylated at 456 CpGi in IUGR group and hypermethylated at the same region in control group. VEGF was hypomethylated at 668, 703, and 710 CpGi in control and IUGR groups; however, hypomethylation at these positions was significantly higher in control group compared to IUGR. 776, 845, and 863 CpGi of VEGF promoter were significantly hypermethylated in IUGR group whereas hypomethylated in control group. The methylation profile of PIGF did not differ between the groups. After adjustment for the factors known to affect fetal birth weight, DNA methylation of VEGF 668 CpGi had a significant negative association with fetal birth weight in the control and the IUGR group and a positive association with IUGR pregnancies. Conclusion(s): Our results do not support the hypothesis that altered DNA methylation in the placental angiogenic genes is a major mechanism generally involved in IUGR. Only a specific region (at 668 CpGi) corresponding to the promoter of VEGF may serve as an epigenetic marker of IUGR and may be involved in the mechanism of IUGR. Large sample-sized studies are needed to understand the effects of DNA methylation on placental gene function and how they might influence fetal growth.",
                "authors": [
                    {
                        "name": "Selcen Cebe F."
                    },
                    {
                        "name": "Nur Tola E."
                    },
                    {
                        "name": "Aslan Kosar P."
                    },
                    {
                        "name": "Oral B."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Maternal-Fetal and Neonatal Medicine",
                "title": "DNA methylation profiles of genes associated with angiogenesis in the samples of placenta in pregnancies complicated by intrauterine growth restriction"
            },
            "pmid": "31581866"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Gynaecology and obstetrics",
            "uri": "http://edamontology.org/topic_3411"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}