{
    "additionDate": "2018-07-22T08:45:03Z",
    "biotoolsCURIE": "biotools:grcalculator",
    "biotoolsID": "grcalculator",
    "credit": [
        {
            "email": "clarkno@mail.uc.edu",
            "name": "Nicholas A. Clark",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Online tool for calculating and mining dose–response data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.grcalculator.org/grcalculator/example.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Dose-responce calculation",
            "operation": [
                {
                    "term": "Calculation",
                    "uri": "http://edamontology.org/operation_3438"
                }
            ]
        }
    ],
    "homepage": "http://www.grcalculator.org/grcalculator/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "GRcalculator",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12885-017-3689-3",
            "metadata": {
                "abstract": "BACKGROUND: Quantifying the response of cell lines to drugs or other perturbagens is the cornerstone of pre-clinical drug development and pharmacogenomics as well as a means to study factors that contribute to sensitivity and resistance. In dividing cells, traditional metrics derived from dose-response curves such as IC 50 , AUC, and E max , are confounded by the number of cell divisions taking place during the assay, which varies widely for biological and experimental reasons. Hafner et al. (Nat Meth 13:521-627, 2016) recently proposed an alternative way to quantify drug response, normalized growth rate (GR) inhibition, that is robust to such confounders. Adoption of the GR method is expected to improve the reproducibility of dose-response assays and the reliability of pharmacogenomic associations (Hafner et al. 500-502, 2017).RESULTS: We describe here an interactive website ( www.grcalculator.org ) for calculation, analysis, and visualization of dose-response data using the GR approach and for comparison of GR and traditional metrics. Data can be user-supplied or derived from published datasets. The web tools are implemented in the form of three integrated Shiny applications (grcalculator, grbrowser, and grtutorial) deployed through a Shiny server. Intuitive graphical user interfaces (GUIs) allow for interactive analysis and visualization of data. The Shiny applications make use of two R packages (shinyLi and GRmetrics) specifically developed for this purpose. The GRmetrics R package is also available via Bioconductor and can be used for offline data analysis and visualization. Source code for the Shiny applications and associated packages (shinyLi and GRmetrics) can be accessed at www.github.com/uc-bd2k/grcalculator and www.github.com/datarail/gr_metrics .CONCLUSIONS: GRcalculator is a powerful, user-friendly, and free tool to facilitate analysis of dose-response data. It generates publication-ready figures and provides a unified platform for investigators to analyze dose-response data across diverse cell types and perturbagens (including drugs, biological ligands, RNAi, etc.). GRcalculator also provides access to data collected by the NIH LINCS Program ( http://www.lincsproject.org /) and other public domain datasets. The GRmetrics Bioconductor package provides computationally trained users with a platform for offline analysis of dose-response data and facilitates inclusion of GR metrics calculations within existing R analysis pipelines. These tools are therefore well suited to users in academia as well as industry.",
                "authors": [
                    {
                        "name": "Clark N.A."
                    },
                    {
                        "name": "Hafner M."
                    },
                    {
                        "name": "Kouril M."
                    },
                    {
                        "name": "Williams E.H."
                    },
                    {
                        "name": "Muhlich J.L."
                    },
                    {
                        "name": "Pilarczyk M."
                    },
                    {
                        "name": "Niepel M."
                    },
                    {
                        "name": "Sorger P.K."
                    },
                    {
                        "name": "Medvedovic M."
                    }
                ],
                "citationCount": 24,
                "date": "2017-10-24T00:00:00Z",
                "journal": "BMC cancer",
                "title": "GRcalculator: an online tool for calculating and mining dose-response data"
            },
            "pmcid": "PMC5655815",
            "pmid": "29065900"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Medicines research and development",
            "uri": "http://edamontology.org/topic_3376"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        }
    ],
    "validated": 1
}