{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T17:09:23.129542Z",
    "biotoolsCURIE": "biotools:ssd-kd",
    "biotoolsID": "ssd-kd",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chunyan Miao"
        },
        {
            "name": "Yongwei Wang",
            "orcidid": "https://orcid.org/0000-0001-9712-8964"
        },
        {
            "name": "Yuheng Wang",
            "orcidid": "https://orcid.org/0000-0001-5252-7005"
        },
        {
            "name": "Z. Jane Wang",
            "orcidid": "https://orcid.org/0000-0002-3791-0249"
        }
    ],
    "description": "A self-supervised diverse knowledge distillation method for lightweight skin lesion classification using dermoscopic images.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/enkiwang/Portable-Skin-Lesion-Diagnosis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:02:30.337742Z",
    "license": "MIT",
    "name": "SSD-KD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.media.2022.102693",
            "metadata": {
                "abstract": "Skin cancer is one of the most common types of malignancy, affecting a large population and causing a heavy economic burden worldwide. Over the last few years, computer-aided diagnosis has been rapidly developed and make great progress in healthcare and medical practices due to the advances in artificial intelligence, particularly with the adoption of convolutional neural networks. However, most studies in skin cancer detection keep pursuing high prediction accuracies without considering the limitation of computing resources on portable devices. In this case, the knowledge distillation (KD) method has been proven as an efficient tool to help improve the adaptability of lightweight models under limited resources, meanwhile keeping a high-level representation capability. To bridge the gap, this study specifically proposes a novel method, termed SSD-KD, that unifies diverse knowledge into a generic KD framework for skin disease classification. Our method models an intra-instance relational feature representation and integrates it with existing KD research. A dual relational knowledge distillation architecture is self-supervised trained while the weighted softened outputs are also exploited to enable the student model to capture richer knowledge from the teacher model. To demonstrate the effectiveness of our method, we conduct experiments on ISIC 2019, a large-scale open-accessed benchmark of skin diseases dermoscopic images. Experiments show that our distilled MobileNetV2 can achieve an accuracy as high as 85% for the classification tasks of 8 different skin diseases with minimal parameters and computing requirements. Ablation studies confirm the effectiveness of our intra- and inter-instance relational knowledge integration strategy. Compared with state-of-the-art knowledge distillation techniques, the proposed method demonstrates improved performance. To the best of our knowledge, this is the first deep knowledge distillation application for multi-disease classification on the large-scale dermoscopy database. Our codes and models are available at https://github.com/enkiwang/Portable-Skin-Lesion-Diagnosis.",
                "authors": [
                    {
                        "name": "Cai J."
                    },
                    {
                        "name": "Lee T.K."
                    },
                    {
                        "name": "Miao C."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Z.J."
                    }
                ],
                "citationCount": 55,
                "date": "2023-02-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "SSD-KD: A self-supervised diverse knowledge distillation method for lightweight skin lesion classification using dermoscopic images"
            },
            "pmid": "36462373"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Dermatology",
            "uri": "http://edamontology.org/topic_3404"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
