{
    "additionDate": "2017-01-17T15:03:52Z",
    "biotoolsCURIE": "biotools:riboseqr",
    "biotoolsID": "riboseqr",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "tjh48@cam.ac.uk",
            "name": "Thomas J. Hardcastle",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Plotting functions, frameshift detection and parsing of sequencing data from ribosome profiling experiments.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/riboSeqR.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/riboSeqR_1.8.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/riboSeqR.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "GPL-3.0",
    "name": "riboSeqR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1080/15476286.2016.1141862",
            "metadata": {
                "abstract": "© 2016 The Author(s). Published with license by Taylor & Francis Group, LLC.Ribosome profiling (ribo-seq) is a technique that uses high-throughput sequencing to reveal the exact locations and densities of translating ribosomes at the entire transcriptome level. The technique has become very popular since its inception in 2009. Yet experimentalists who generate ribo-seq data often have to rely on bioinformaticians to process and analyze their data. We present RiboGalaxy (http://ribogalaxy.ucc.ie), a freely available Galaxy-based web server for processing and analyzing ribosome profiling data with the visualization functionality provided by GWIPS-viz (http://gwips.ucc.ie). RiboGalaxy offers researchers a suite of tools specifically tailored for processing ribo-seq and corresponding mRNA-seq data. Researchers can take advantage of the published workflows which reduce the multi-step alignment process to a minimum of inputs from the user. Users can then explore their own aligned data as custom tracks in GWIPS-viz and compare their ribosome profiles to existing ribo-seq tracks from published studies. In addition, users can assess the quality of their ribo-seq data, determine the strength of the triplet periodicity signal, generate meta-gene ribosome profiles as well as analyze the relative impact of mRNA sequence features on local read density. RiboGalaxy is accompanied by extensive documentation and tips for helping users. In addition we provide a forum (http://gwips.ucc.ie/Forum) where we encourage users to post their questions and feedback to improve the overall RiboGalaxy service.",
                "authors": [
                    {
                        "name": "Michel A.M."
                    },
                    {
                        "name": "Mullan J.P.A."
                    },
                    {
                        "name": "Velayudhan V."
                    },
                    {
                        "name": "O'Connor P.B.F."
                    },
                    {
                        "name": "Donohue C.A."
                    },
                    {
                        "name": "Baranov P.V."
                    }
                ],
                "citationCount": 57,
                "date": "2016-03-03T00:00:00Z",
                "journal": "RNA Biology",
                "title": "RiboGalaxy: A browser based platform for the alignment, analysis and visualization of ribosome profiling data"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1,
    "version": [
        "1.8.0"
    ]
}