{
    "accessibility": "Open access",
    "additionDate": "2022-09-30T22:03:51.371903Z",
    "biotoolsCURIE": "biotools:orsum",
    "biotoolsID": "orsum",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ozan.ozisik@univ-amu.fr",
            "name": "Ozan Ozisik",
            "orcidid": "https://orcid.org/0000-0001-5980-8002",
            "typeEntity": "Person"
        },
        {
            "email": "anais.baudot@univ-amu.fr",
            "name": "Anaïs Baudot",
            "typeEntity": "Person"
        },
        {
            "name": "Morgane Térézol"
        }
    ],
    "description": "A Python package for filtering and comparing enrichment analyses using a simple principle.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://anaconda.org/bioconda/orsum",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-30T22:03:51.375554Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ozanozisik/orsum/"
        }
    ],
    "name": "orsum",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04828-2",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Enrichment analyses are widely applied to investigate lists of genes of interest. However, such analyses often result in long lists of annotation terms with high redundancy, making the interpretation and reporting difficult. Long annotation lists and redundancy also complicate the comparison of results obtained from different enrichment analyses. An approach to overcome these issues is using down-sized annotation collections composed of non-redundant terms. However, down-sized collections are generic and the level of detail may not fit the user’s study. Other available approaches include clustering and filtering tools, which are based on similarity measures and thresholds that can be complicated to comprehend and set. Result: We propose orsum, a Python package to filter enrichment results. orsum can filter multiple enrichment results collectively and highlight common and specific annotation terms. Filtering in orsum is based on a simple principle: a term is discarded if there is a more significant term that annotates at least the same genes; the remaining more significant term becomes the representative term for the discarded term. This principle ensures that the main biological information is preserved in the filtered results while reducing redundancy. In addition, as the representative terms are selected from the original enrichment results, orsum outputs filtered terms tailored to the study. As a use case, we applied orsum to the enrichment analyses of four lists of genes, each associated with a neurodegenerative disease. Conclusion: orsum provides a comprehensible and effective way of filtering and comparing enrichment results. It is available at https://anaconda.org/bioconda/orsum.",
                "authors": [
                    {
                        "name": "Baudot A."
                    },
                    {
                        "name": "Ozisik O."
                    },
                    {
                        "name": "Terezol M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "orsum: a Python package for filtering and comparing enrichment analyses using a simple principle"
            },
            "pmcid": "PMC9308244",
            "pmid": "35870894"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
