{
    "additionDate": "2020-01-09T18:10:17Z",
    "biotoolsCURIE": "biotools:SSEThread",
    "biotoolsID": "SSEThread",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "saltzberg@salilab.org",
            "name": "Daniel J. Saltzberg",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrative threading of the DNA-PKcs sequence based on data from chemical cross-linking and hydrogen deuterium exchange.\n\nX-ray crystallography and electron microscopy maps resolved to 3-8 Å are generally sufficient for tracing the path of the polypeptide chain in space, while often insufficient for unambiguously registering the sequence on the path (i.e., threading). Frequently, however, additional information is available from other biophysical experiments, physical principles, statistical analyses, and other prior models. Here, we formulate an integrative approach for sequence assignment to a partial backbone model as an optimization problem, which requires three main components: the representation of the system, the scoring function, and the optimization method.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Integrative Modeling', 'Integrative Modeling Platform', 'threading', 'DNA-PKcs'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "Protein threading",
                    "uri": "http://edamontology.org/operation_0302"
                },
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31570166",
    "lastUpdate": "2020-01-09T18:10:17Z",
    "name": "SSEThread",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.PBIOMOLBIO.2019.09.003",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdX-ray crystallography and electron microscopy maps resolved to 3–8 Å are generally sufficient for tracing the path of the polypeptide chain in space, while often insufficient for unambiguously registering the sequence on the path (i.e., threading). Frequently, however, additional information is available from other biophysical experiments, physical principles, statistical analyses, and other prior models. Here, we formulate an integrative approach for sequence assignment to a partial backbone model as an optimization problem, which requires three main components: the representation of the system, the scoring function, and the optimization method. The method is implemented in the open source Integrative Modeling Platform (IMP) (https://integrativemodeling.org), allowing a number of different terms in the scoring function. We apply this method to localizing the sequence assignment within a 199-residue disordered region of three structured and sequence unassigned helices in the DNA-PKcs crystallographic structure, using chemical crosslinks, hydrogen deuterium exchange, and sequence connectivity. The resulting ensemble of threading models provides two major solutions, one of which suggests that the crucial ABCDE cluster of phosphorylation sites cannot undergo intra-molecular autophosphorylation without a conformational rearrangement. The ensemble of solutions embodies the most accurate and precise sequence threading given the available information.",
                "authors": [
                    {
                        "name": "Saltzberg D.J."
                    },
                    {
                        "name": "Hepburn M."
                    },
                    {
                        "name": "Pilla K.B."
                    },
                    {
                        "name": "Schriemer D.C."
                    },
                    {
                        "name": "Lees-Miller S.P."
                    },
                    {
                        "name": "Blundell T.L."
                    },
                    {
                        "name": "Sali A."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "Progress in Biophysics and Molecular Biology",
                "title": "SSEThread: Integrative threading of the DNA-PKcs sequence based on data from chemical cross-linking and hydrogen deuterium exchange"
            },
            "pmcid": "PMC6903780",
            "pmid": "31570166"
        }
    ],
    "topic": [
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        }
    ]
}