{
    "additionDate": "2016-07-23T16:07:47Z",
    "biotoolsCURIE": "biotools:variant",
    "biotoolsID": "variant",
    "collectionID": [
        "ELIXIR-ES"
    ],
    "credit": [
        {
            "name": "Computational Genomics Department. Prince Felipe Research Center (CIPF)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "http://bioinfo.cipf.es",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "cipf.es",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "babelomics@cipf.es",
            "name": "babelomics@cipf.es  (Francisco García)",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Command line, web service, and web interface for fast and accurate functional characterization of variants found by Next Generation Sequencing.",
    "documentation": [
        {
            "type": "General",
            "url": "http://docs.bioinfo.cipf.es/projects/variant/wiki/Tutorial"
        }
    ],
    "editPermission": {
        "authors": [
            "gelpi@ub.edu"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        }
    ],
    "homepage": "http://variant.bioinfo.cipf.es/",
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "VARIANT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "fgarcia@cipf.es",
    "publication": [
        {
            "doi": "10.1093/nar/gks572",
            "metadata": {
                "abstract": "The massive use of Next-Generation Sequencing (NGS) technologies is uncovering an unexpected amount of variability. The functional characterization of such variability, particularly in the most common form of variation found, the Single Nucleotide Variants (SNVs), has become a priority that needs to be addressed in a systematic way. VARIANT (VARIant ANalyis Tool) reports information on the variants found that include consequence type and annotations taken from different databases and repositories (SNPs and variants from dbSNP and 1000 genomes, and disease-related variants from the Genome-Wide Association Study (GWAS) catalog, Online Mendelian Inheritance in Man (OMIM), Catalog of Somatic Mutations in Cancer (COSMIC) mutations, etc). VARIANT also produces a rich variety of annotations that include information on the regulatory (transcription factor or miRNA-binding sites, etc.) or structural roles, or on the selective pressures on the sites affected by the variation. This information allows extending the conventional reports beyond the coding regions and expands the knowledge on the contribution of non-coding or synonymous variants to the phenotype studied. Contrarily to other tools, VARIANT uses a remote database and operates through efficient RESTful Web Services that optimize search and transaction operations. In this way, local problems of installation, update or disk size limitations are overcome without the need of sacrifice speed (thousands of variants are processed per minute). VARIANT is available at: http://variant.bioinfo.cipf.es. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Medina I."
                    },
                    {
                        "name": "De Maria A."
                    },
                    {
                        "name": "Bleda M."
                    },
                    {
                        "name": "Salavert F."
                    },
                    {
                        "name": "Alonso R."
                    },
                    {
                        "name": "Gonzalez C.Y."
                    },
                    {
                        "name": "Dopazo J."
                    }
                ],
                "citationCount": 33,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VARIANT: Command Line, Web service and Web interface for fast and accurate functional characterization of variants found by Next-Generation Sequencing"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}