{
    "additionDate": "2021-01-18T07:28:53Z",
    "biotoolsCURIE": "biotools:fastmm",
    "biotoolsID": "fastmm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "huangjf@mail.kiz.ac.cn",
            "name": "Jingfei Huang",
            "typeEntity": "Person"
        },
        {
            "email": "wenzhong.xiao@mgh.harvard.edu",
            "name": "Wenzhong Xiao",
            "typeEntity": "Person"
        }
    ],
    "description": "FastMM is an efficient toolbox for personalized constraint-based metabolic modeling. In FastMM, most of the time-cost functions of metabolic modeling are written by C. These functions including: flux variability analysis, genome-wide single gene knockout analysis, genome-wide double gene knockout analysis, genome-wide single metabolite knockout analysis, genome-wide double metabolite knockout analysis, and MCMC sampling.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/GonghuaLi/FastMM/tree/master/doc"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GonghuaLi/FastMM",
    "language": [
        "C",
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2021-03-10T20:29:40Z",
    "license": "GPL-3.0",
    "name": "FastMM",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3410-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Constraint-based metabolic modeling has been applied to understand metabolism related disease mechanisms, to predict potential new drug targets and anti-metabolites, and to identify biomarkers of complex diseases. Although the state-of-art modeling toolbox, COBRA 3.0, is powerful, it requires substantial computing time conducting flux balance analysis, knockout analysis, and Markov Chain Monte Carlo (MCMC) sampling, which may limit its application in large scale genome-wide analysis. Results: Here, we rewrote the underlying code of COBRA 3.0 using C/C++, and developed a toolbox, termed FastMM, to effectively conduct constraint-based metabolic modeling. The results showed that FastMM is 2~400 times faster than COBRA 3.0 in performing flux balance analysis and knockout analysis and returns consistent outputs. When applied to MCMC sampling, FastMM is 8 times faster than COBRA 3.0. FastMM is also faster than some efficient metabolic modeling applications, such as Cobrapy and Fast-SL. In addition, we developed a Matlab/Octave interface for fast metabolic modeling. This interface was fully compatible with COBRA 3.0, enabling users to easily perform complex applications for metabolic modeling. For example, users who do not have deep constraint-based metabolic model knowledge can just type one command in Matlab/Octave to perform personalized metabolic modeling. Users can also use the advance and multiple threading parameters for complex metabolic modeling. Thus, we provided an efficient and user-friendly solution to perform large scale genome-wide metabolic modeling. For example, FastMM can be applied to the modeling of individual cancer metabolic profiles of hundreds to thousands of samples in the Cancer Genome Atlas (TCGA). Conclusion: FastMM is an efficient and user-friendly toolbox for large-scale personalized constraint-based metabolic modeling. It can serve as a complementary and invaluable improvement to the existing functionalities in COBRA 3.0. FastMM is under GPL license and can be freely available at GitHub site: http://github.com/GonghuaLi/FastMM.",
                "authors": [
                    {
                        "name": "Li G.-H."
                    },
                    {
                        "name": "Dai S."
                    },
                    {
                        "name": "Han F."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Xiao W."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FastMM: An efficient toolbox for personalized constraint-based metabolic modeling"
            },
            "pmcid": "PMC7035665",
            "pmid": "32085724"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}