{
    "additionDate": "2020-01-14T09:38:02Z",
    "biotoolsCURIE": "biotools:RPANDA",
    "biotoolsID": "RPANDA",
    "confidence_flag": "tool",
    "description": "RPAND is an R package for evolutionary biologists interested in understanding how past diversity dynamics have shaped present-day diversity. It could also be useful in other contexts, such as for analyzing clade–clade competitive effects or the effect of species richness on phenotypic divergence.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                },
                {
                    "term": "Protein extinction coefficient calculation",
                    "uri": "http://edamontology.org/operation_0399"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hmorlon/PANDA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-15T19:49:36Z",
    "name": "RPANDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/SYSBIO/SYZ057",
            "metadata": {
                "abstract": "© 2019 The Author(s). All rights reserved.Estimating how the number of species in a given group varied in the deep past is of key interest to evolutionary biologists. However, current phylogenetic approaches for obtaining such estimates have limitations, such as providing unrealistic diversity estimates at the origin of the group. Here, we develop a robust probabilistic approach for estimating diversity through time curves and uncertainty around these estimates from phylogenetic data. We show with simulations that under various realistic scenarios of diversification, this approach performs better than previously proposed approaches. We also characterize the effect of tree size and undersampling on the performance of the approach. We apply our method to understand patterns of species diversity in anurans (frogs and toads). We find that Archaeobatrachia - a species-poor group of old frog clades often found in temperate regions - formerly had much higher diversity and net diversification rate, but the group declined in diversity as younger, nested clades diversified. This diversity decline seems to be linked to a decline in speciation rate rather than an increase in extinction rate. Our approach, implemented in the R package RPANDA, should be useful for evolutionary biologists interested in understanding how past diversity dynamics have shaped present-day diversity. It could also be useful in other contexts, such as for analyzing clade-clade competitive effects or the effect of species richness on phenotypic divergence.",
                "authors": [
                    {
                        "name": "Billaud O."
                    },
                    {
                        "name": "Moen D.S."
                    },
                    {
                        "name": "Morlon H."
                    },
                    {
                        "name": "Parsons T.L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Systematic Biology",
                "title": "Estimating Diversity through Time Using Molecular Phylogenies: Old and Species-Poor Frog Families are the Remnants of a Diverse Past"
            },
            "pmid": "31682272"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ],
    "validated": 1
}
