{
    "additionDate": "2021-01-20T10:56:11Z",
    "biotoolsCURIE": "biotools:opa2vec",
    "biotoolsID": "opa2vec",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "robert.hoehndorf@kaust.edu.sa",
            "name": "Xin Gao",
            "typeEntity": "Person"
        },
        {
            "email": "xin.gao@kaust.edu.sa",
            "name": "Robert Hoehndorf",
            "typeEntity": "Person"
        }
    ],
    "description": "Combining formal and informal content of biomedical ontologies to improve similarity-based prediction.\n\nOntologies Plus Annotations to Vectors: OPA2Vec.\n\nOPA2Vec is a tool that can be used to produce feature vectors for biological entities from an ontology. OPA2Vec uses mainly metadata from the ontology in the form of annotation properties as the main source of data. It also uses formal ontology axioms as well as entity-concept associations as sources of information. This document provides instructions on how to run OPA2Vec as a tool and contains also a detailed documentation of the implementation of OPA2Vec for users willing to change the code according to their needs which is quite easy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bio-ontology-research-group/opa2vec",
    "language": [
        "Groovy",
        "Python",
        "Perl"
    ],
    "lastUpdate": "2021-05-18T05:37:35Z",
    "license": "GPL-3.0",
    "name": "OPA2Vec",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTY933",
            "metadata": {
                "abstract": "© The Author(s) 2018.Motivation: Ontologies are widely used in biology for data annotation, integration and analysis. In addition to formally structured axioms, ontologies contain meta-data in the form of annotation axioms which provide valuable pieces of information that characterize ontology classes. Annotation axioms commonly used in ontologies include class labels, descriptions or synonyms. Despite being a rich source of semantic information, the ontology meta-data are generally unexploited by ontology-based analysis methods such as semantic similarity measures. Results: We propose a novel method, OPA2Vec, to generate vector representations of biological entities in ontologies by combining formal ontology axioms and annotation axioms from the ontology meta-data. We apply a Word2Vec model that has been pre-Trained on either a corpus or abstracts or full-Text articles to produce feature vectors from our collected data. We validate our method in two different ways: first, we use the obtained vector representations of proteins in a similarity measure to predict protein'protein interaction on two different datasets. Second, we evaluate our method on predicting gene'disease associations based on phenotype similarity by generating vector representations of genes and diseases using a phenotype ontology, and applying the obtained vectors to predict gene'disease associations using mouse model phenotypes. We demonstrate that OPA2Vec significantly outperforms existing methods for predicting gene'disease associations. Using evidence from mouse models, we apply OPA2Vec to identify candidate genes for several thousand rare and orphan diseases. OPA2Vec can be used to produce vector representations of any biomedical entity given any type of biomedical ontology.",
                "authors": [
                    {
                        "name": "Smaili F.Z."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Hoehndorf R."
                    }
                ],
                "citationCount": 11,
                "date": "2019-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "OPA2Vec: Combining formal and informal content of biomedical ontologies to improve similarity-based prediction"
            },
            "pmid": "30407490"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}