{
    "additionDate": "2015-07-02T13:45:28Z",
    "biotoolsCURIE": "biotools:pariga",
    "biotoolsID": "pariga",
    "credit": [
        {
            "name": "CRS4",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "ELIXIR-ITA-CRS4",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "orsini@crs4.it",
            "name": "Massimiliano Orsini",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "gmauro@crs4.it",
            "name": "Gianmauro Cuccuru",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "orsini@crs4.it",
            "name": "Massimiliano Orsini",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "gmauro@crs4.it",
            "name": "Gianmauro Cuccuru",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Performs BLAST searches on two sets of sequences selected by the user, storing the output in a python-serialized-objects database. Results can be interrogated by the user using logical operations, for example to retrieve cases where two queries match same targets, or when sequences from the two datasets are reciprocal best hits, or when a query matches a target in multiple regions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "homepage": "http://resources.bioinformatica.crs4.it/pariga/",
    "lastUpdate": "2019-03-12T15:40:06Z",
    "name": "Pariga",
    "owner": "ELIXIR-ITA-CRS4",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0062224",
            "metadata": {
                "abstract": "BLAST-based similarity searches are commonly used in several applications involving both nucleotide and protein sequences. These applications span from simple tasks such as mapping sequences over a database to more complex procedures as clustering or annotation processes. When the amount of analysed data increases, manual inspection of BLAST results become a tedious procedure. Tools for parsing or filtering BLAST results for different purposes are then required. We describe here PARIGA (http://resources.bioinformatica.crs4.it/pariga/), a server that enables users to perform all-against-all BLAST searches on two sets of sequences selected by the user. Moreover, since it stores the two BLAST output in a python-serialized-objects database, results can be filtered according to several parameters in real-time fashion, without re-running the process and avoiding additional programming efforts. Results can be interrogated by the user using logical operations, for example to retrieve cases where two queries match same targets, or when sequences from the two datasets are reciprocal best hits, or when a query matches a target in multiple regions. The Pariga web server is designed to be a helpful tool for managing the results of sequence similarity searches. The design and implementation of the server renders all operations very fast and easy to use. © 2013 Orsini et al.",
                "authors": [
                    {
                        "name": "Orsini M."
                    },
                    {
                        "name": "Carcangiu S."
                    },
                    {
                        "name": "Cuccuru G."
                    },
                    {
                        "name": "Uva P."
                    },
                    {
                        "name": "Tramontano A."
                    }
                ],
                "date": "2013-05-07T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "The PARIGA Server for Real Time Filtering and Analysis of Reciprocal BLAST Results"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "version": [
        "1.0"
    ]
}