
{
    "credit": [
        {
            "email": "sandmann.t@gmail.com",
            "name": "Thomas Sandmann",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/gCMAPWeb.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/gCMAPWeb_1.14.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "Artistic-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Connections between disease phenotypes and drug effects can be made by identifying commonalities in the associated patterns of differential gene expression. Searchable databases that record the impacts of chemical or genetic perturbations on the transcriptome-here referred to as 'connectivity maps'-permit discovery of such commonalities. We describe two R packages, gCMAP and gCMAPWeb, which provide a complete framework to construct and query connectivity maps assembled from user-defined collections of differential gene expression data. Microarray or RNAseq data are processed in a standardized way, and results can be interrogated using various well-established gene set enrichment methods. The packages also feature an easy-to-deploy web application that facilitates reproducible research through automatic generation of graphical and tabular reports.Availability and implementation: The gCMAP and gCMAPWeb R packages are freely available for UNIX, Windows and Mac OS X operating systems at Bioconductor (http://www.bioconductor.org).Contact: Supplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author .",
            "authors": [
                "Sandmann T.",
                "Kummerfeld S.K.",
                "Gentleman R.",
                "Bourgon R."
            ],
            "cit_count": 9,
            "doi": "10.1093/bioinformatics/btt592",
            "journal": "Bioinformatics",
            "pmid": "24132929",
            "title": "GCMAP: User-friendly connectivity mapping with R",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gcmapweb",
        "biotoolsID": "gcmapweb",
        "description": "This R package provides a graphical user interface for the gCMAP package. It uses the Rook package and can be used either on a local machine, leveraging R's internal web server, or run on a dedicated rApache web server installation. It allows users to search their own data sources and instructions to generate reference datasets from public repositories are included with the package.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/gCMAPWeb.html",
        "name": "gCMAPWeb",
        "version": [
            "1.14.0"
        ]
    }
}