{"credit":[{"name":"BioCatalogue","typeEntity":"Project","typeRoles":["Documentor"],"url":"https://www.biocatalogue.org"},{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://webs2.kazusa.or.jp/mfsearcher/"}],"documentation":[{"type":"GENERAL","url":"http://webs2.kazusa.or.jp/mfsearcher/"}],"function":[{"operation":[{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web API"],"topic":[{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"https://www.biocatalogue.org/services/3736"}],"publication":[{"abstract":"High-accuracy mass values detected by high-resolution mass spectrometry analysis enable prediction of elemental compositions, and thus are used for metabolite annotations in metabolomic studies. Here, we report an application of a relational database to significantly improve the rate of elemental composition predictions. By searching a database of pre-calculated elemental compositions with fixed kinds and numbers of atoms, the approach eliminates redundant evaluations of the same formula that occur in repeated calculations with other tools. When our approach is compared with HR2, which is one of the fastest tools available, our database search times were at least 109 times shorter than those of HR2. When a solid-state drive (SSD) was applied, the search time was 488 times shorter at 5 ppm mass tolerance and 1833 times at 0.1 ppm. Even if the search by HR2 was performed with 8 threads in a high-spec Windows 7 PC, the database search times were at least 26 and 115 times shorter without and with the SSD. These improvements were enhanced in a low spec Windows XP PC. We constructed a web service 'MFSearcher' to query the database in a RESTful manner. © 2012 The Author. Published by Oxford University Press. All rights reserved.","authors":["Sakurai N.","Ara T.","Kanaya S.","Nakamura Y.","Iijima Y.","Enomoto M.","Motegi T.","Aoki K.","Suzuki H.","Shibata D."],"cit_count":12,"doi":"10.1093/bioinformatics/bts660","journal":"Bioinformatics","title":"An application of a relational database system for high-throughput prediction of elemental compositions from accurate mass values","type":"Primary","year":"2013-01-15"}],"summary":{"biotoolsCURIE":"biotools:mfsearcher","biotoolsID":"mfsearcher","description":"RESTful web service for high-throughput prediction of elemental compositions from accurate mass values detected by high-resolution mass spectrometers.","homepage":"http://webs2.kazusa.or.jp/mfsearcher/","name":"MFSearcher","version":["1"]}}