{
    "additionDate": "2022-03-28T11:14:29.823802Z",
    "biotoolsCURIE": "biotools:bigl",
    "biotoolsID": "bigl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stijn.hawinkel@psb.vib-ugent.be",
            "name": "Stijn Hawinkel",
            "orcidid": "https://orcid.org/0000-0002-4501-5180",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Primary contact"
            ]
        },
        {
            "email": "maxim.nazarov@openanalytics.eu",
            "name": "Maxim Nazarov",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Documentor"
            ]
        }
    ],
    "description": "BIGL R-package which allows for a quick screening of drug combinations. Combination therapies are increasingly adopted as the standard of care for various diseases to improve treatment response, minimise the development of resistance and or minimise adverse events. Therefore, synergistic combinations are screened early in the drug discovery process, in which their potential is evaluated by comparing the observed combination effect to that expected under a null model.",
    "documentation": [
        {
            "note": "Methodology vignette",
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/BIGL/vignettes/methodology.html"
        },
        {
            "note": "Vignette for synergy analysis",
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/BIGL/vignettes/analysis.html"
        },
        {
            "type": [
                "API documentation"
            ],
            "url": "https://cran.r-project.org/web/packages/BIGL/BIGL.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=BIGL",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-03-28T11:14:29.827836Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/openanalytics/BIGL/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/openanalytics/BIGL"
        }
    ],
    "name": "BIGL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/PST.2173",
            "metadata": {
                "abstract": "© 2021 John Wiley & Sons Ltd.Combination therapies are increasingly adopted as the standard of care for various diseases to improve treatment response, minimise the development of resistance and/or minimise adverse events. Therefore, synergistic combinations are screened early in the drug discovery process, in which their potential is evaluated by comparing the observed combination effect to that expected under a null model. Such methodology is implemented in the BIGL R-package which allows for a quick screening of drug combinations. We extend the meanR and maxR tests from this package by allowing non-constant variance of the responses and by extending the list of null models (Loewe, Loewe2, HSA, Bliss). These new tests are evaluated in a comprehensive simulation study under various models for additivity and synergy, various monotherapeutic dose–response models (complete, partial and incomplete responders) and various types of deviation from the constant variance assumption. In addition, the BIGL package is extended with bootstrap confidence intervals for the individual off-axis points and for the overall synergy strength, which were demonstrated to have reliable coverage and can complement the existing tests. We conclude that the differences in performance between the different null models are small and depend on the simulation scenario. As a result, the choice of null model should be driven by expert knowledge on the particular problem. Finally, we demonstrate the new features of the BIGL package and the difference between the synergy models on a real dataset from drug discovery. The BIGL package is available at CRAN (https://CRAN.R-project.org/package=BIGL) and as a Shiny app (https://synergy.openanalytics.eu/app).",
                "authors": [
                    {
                        "name": "Bijnens L."
                    },
                    {
                        "name": "Hawinkel S."
                    },
                    {
                        "name": "Mutambanengwe K."
                    },
                    {
                        "name": "Nazarov M."
                    },
                    {
                        "name": "Thas O."
                    },
                    {
                        "name": "Tourny A."
                    },
                    {
                        "name": "Verbist B."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Pharmaceutical Statistics",
                "title": "Statistical detection of synergy: New methods and a comparative study"
            },
            "pmid": "34608741",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
