
{
    "credit": [
        {
            "email": "m.p.cox@massey.ac.nz",
            "name": "Murray P. Cox",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://solexaqa.sourceforge.net/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: Illumina's second-generation sequencing platform is playing an increasingly prominent role in modern DNA and RNA sequencing efforts. However, rapid, simple, standardized and independent measures of run quality are currently lacking, as are tools to process sequences for use in downstream applications based on read-level quality data.Results: We present SolexaQA, a user-friendly software package designed to generate detailed statistics and at-a-glance graphics of sequence data quality both quickly and in an automated fashion. This package contains associated software to trim sequences dynamically using the quality scores of bases within individual reads.Conclusion: The SolexaQA package produces standardized outputs within minutes, thus facilitating ready comparison between flow cell lanes and machine runs, as well as providing immediate diagnostic information to guide the manipulation of sequence data for downstream analyses. © 2010 Cox et al; licensee BioMed Central Ltd.",
            "authors": [
                "Cox M.P.",
                "Peterson D.A.",
                "Biggs P.J."
            ],
            "cit_count": 593,
            "journal": "BMC Bioinformatics",
            "pmid": "20875133",
            "title": "SolexaQA: At-a-glance quality assessment of Illumina second-generation sequencing data",
            "year": "2010-09-27"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:solexaqa",
        "biotoolsID": "solexaqa",
        "description": "User-friendly software package designed to generate detailed statistics and at-a-glance graphics of sequence data quality both quickly and in an automated fashion. This package contains associated software to trim sequences dynamically using the quality scores of bases within individual reads.",
        "homepage": "http://solexaqa.sourceforge.net/",
        "name": "SolexaQA"
    }
}