{
    "additionDate": "2017-08-03T19:04:25Z",
    "biotoolsCURIE": "biotools:wasabi",
    "biotoolsID": "wasabi",
    "credit": [
        {
            "email": "ari.loytynoja@helsinki.fi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://loytynojalab.biocenter.helsinki.fi/"
        }
    ],
    "description": "Tool for visualisation and manipulation of rich MSAs and a graphical interface to command-line programs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://wasabiapp.org/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://wasabiapp.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/wasabi-powerful-multiple-sequence-alignment-browser.html"
        }
    ],
    "name": "Wasabi",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.Wasabi is an open source, web-based environment for evolutionary sequence analysis. Wasabi visualizes sequence data together with a phylogenetic tree within a modern, user-friendly interface: The interface hides extraneous options, supports context sensitive menus, drag- And-drop editing, and displays additional information, such as ancestral sequences, associated with specific tree nodes. The Wasabi environment supports reproducibility by automatically storing intermediate analysis steps and includes built-in functions to share data between users and publish analysis results. For computational analysis, Wasabi supports PRANK and PAGAN for phylogeny- Aware alignment and alignment extension, and it can be easily extended with other tools. Along with drag- And-drop import of local files,Wasabi can access remote data through URL and import sequence data, GeneTrees and EPO alignments directly from Ensembl. To demonstrate a typical workflow using Wasabi, we reproduce key findings from recent comparative genomics studies, including a reanalysis of the EGLN1 gene from the tiger genome study: These case studies can be browsed within Wasabi at http://wasabiapp.org:8000?id=usecases. Wasabi runs inside a web browser and does not require any installation. One can start using it at http://wasabiapp.org. All source code is licensed under the AGPLv3.",
                "authors": [
                    {
                        "name": "Veidenberg A."
                    },
                    {
                        "name": "Medlar A."
                    },
                    {
                        "name": "Loytynoja A."
                    }
                ],
                "citationCount": 11,
                "date": "2016-04-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Wasabi: An integrated platform for evolutionary sequence analysis and data visualization"
            },
            "pmid": "26635364"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}