{
    "accessibility": "Open access",
    "additionDate": "2021-12-05T23:30:07.585697Z",
    "biotoolsCURIE": "biotools:kaea",
    "biotoolsID": "kaea",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Nicolas.Bonadies@insel.ch",
            "name": "Nicolas Bonadies",
            "orcidid": "https://orcid.org/0000-0001-8761-2066",
            "typeEntity": "Person"
        },
        {
            "name": "Jovana Jankovic"
        },
        {
            "name": "Mahmoud Hallal"
        },
        {
            "name": "Sophie Braga-Lagache"
        }
    ],
    "description": "Inference of kinase-signaling networks in human myeloid cell line models by Phosphoproteomics using kinase activity enrichment analysis (KAEA).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/Mahmoudhallal/KAEA/blob/master/KAEA_tutorial_v3.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Mahmoudhallal/KAEA",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-12-05T23:32:52.607525Z",
    "license": "Not licensed",
    "name": "KAEA",
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12885-021-08479-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Despite the introduction of targeted therapies, most patients with myeloid malignancies will not be cured and progress. Genomics is useful to elucidate the mutational landscape but remains limited in the prediction of therapeutic outcome and identification of targets for resistance. Dysregulation of phosphorylation-based signaling pathways is a hallmark of cancer, and therefore, kinase-inhibitors are playing an increasingly important role as targeted treatments. Untargeted phosphoproteomics analysis pipelines have been published but show limitations in inferring kinase-activities and identifying potential biomarkers of response and resistance. Methods: We developed a phosphoproteomics workflow based on titanium dioxide phosphopeptide enrichment with subsequent analysis by liquid chromatography tandem mass spectrometry (LC-MS). We applied a novel Kinase-Activity Enrichment Analysis (KAEA) pipeline on differential phosphoproteomics profiles, which is based on the recently published SetRank enrichment algorithm with reduced false positive rates. Kinase activities were inferred by this algorithm using an extensive reference database comprising five experimentally validated kinase-substrate meta-databases complemented with the NetworKIN in-silico prediction tool. For the proof of concept, we used human myeloid cell lines (K562, NB4, THP1, OCI-AML3, MOLM13 and MV4–11) with known oncogenic drivers and exposed them to clinically established kinase-inhibitors. Results: Biologically meaningful over- and under-active kinases were identified by KAEA in the unperturbed human myeloid cell lines (K562, NB4, THP1, OCI-AML3 and MOLM13). To increase the inhibition signal of the driving oncogenic kinases, we exposed the K562 (BCR-ABL1) and MOLM13/MV4–11 (FLT3-ITD) cell lines to either Nilotinib or Midostaurin kinase inhibitors, respectively. We observed correct detection of expected direct (ABL, KIT, SRC) and indirect (MAPK) targets of Nilotinib in K562 as well as indirect (PRKC, MAPK, AKT, RPS6K) targets of Midostaurin in MOLM13/MV4–11, respectively. Moreover, our pipeline was able to characterize unexplored kinase-activities within the corresponding signaling networks. Conclusions: We developed and validated a novel KAEA pipeline for the analysis of differential phosphoproteomics MS profiling data. We provide translational researchers with an improved instrument to characterize the biological behavior of kinases in response or resistance to targeted treatment. Further investigations are warranted to determine the utility of KAEA to characterize mechanisms of disease progression and treatment failure using primary patient samples. Graphical abstract: [Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Allam R."
                    },
                    {
                        "name": "Bonadies N."
                    },
                    {
                        "name": "Braga-Lagache S."
                    },
                    {
                        "name": "Bruggmann R."
                    },
                    {
                        "name": "Hallal M."
                    },
                    {
                        "name": "Heller M."
                    },
                    {
                        "name": "Jankovic J."
                    },
                    {
                        "name": "Simillion C."
                    },
                    {
                        "name": "Uldry A.-C."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Cancer",
                "title": "Inference of kinase-signaling networks in human myeloid cell line models by Phosphoproteomics using kinase activity enrichment analysis (KAEA)"
            },
            "pmcid": "PMC8268341",
            "pmid": "34238254"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
