{
    "additionDate": "2021-01-18T11:26:28Z",
    "biotoolsCURIE": "biotools:kul-vbg",
    "biotoolsID": "kul-vbg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ahmed.radwan@kuleuven.be",
            "typeEntity": "Person"
        }
    ],
    "description": "Enabling whole brain parcellation in the presence of large lesions.\n\nA workflow to allow Freesurfer recon-all to run on brain images with large lesions. VBG is a bash script tested in Mac OSX, Ubuntu 18.0 and CentOS.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/KUL-Radneuron/KUL_VBG",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2021-07-07T11:53:25Z",
    "license": "MPL-2.0",
    "name": "KUL-VBG",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1101/2020.09.30.20204701"
        },
        {
            "doi": "10.1016/J.NEUROIMAGE.2021.117731",
            "metadata": {
                "abstract": "© 2021Brain atlases and templates are at the heart of neuroimaging analyses, for which they facilitate multimodal registration, enable group comparisons and provide anatomical reference. However, as atlas-based approaches rely on correspondence mapping between images they perform poorly in the presence of structural pathology. Whilst several strategies exist to overcome this problem, their performance is often dependent on the type, size and homogeneity of any lesions present. We therefore propose a new solution, referred to as Virtual Brain Grafting (VBG), which is a fully-automated, open-source workflow to reliably parcellate magnetic resonance imaging (MRI) datasets in the presence of a broad spectrum of focal brain pathologies, including large, bilateral, intra- and extra-axial, heterogeneous lesions with and without mass effect. The core of the VBG approach is the generation of a lesion-free T1-weighted image, which enables further image processing operations that would otherwise fail. Here we validated our solution based on Freesurfer recon-all parcellation in a group of 10 patients with heterogeneous gliomatous lesions, and a realistic synthetic cohort of glioma patients (n = 100) derived from healthy control data and patient data. We demonstrate that VBG outperforms a non-VBG approach assessed qualitatively by expert neuroradiologists and Mann-Whitney U tests to compare corresponding parcellations (real patients U(6,6) = 33, z = 2.738, P <. 010, synthetic-patients U(48,48) = 2076, z = 7.336, P <. 001). Results were also quantitatively evaluated by comparing mean dice scores from the synthetic-patients using one-way ANOVA (unilateral VBG = 0.894, bilateral VBG = 0.903, and non-VBG = 0.617, P <. 001). Additionally, we used linear regression to show the influence of lesion volume, lesion overlap with, and distance from the Freesurfer volumes of interest, on labeling accuracy. VBG may benefit the neuroimaging community by enabling automated state-of-the-art MRI analyses in clinical populations using methods such as FreeSurfer, CAT12, SPM, Connectome Workbench, as well as structural and functional connectomics. To fully maximize its availability, VBG is provided as open software under a Mozilla 2.0 license (https://github.com/KUL-Radneuron/KUL_VBG).",
                "authors": [
                    {
                        "name": "Blommaert J."
                    },
                    {
                        "name": "Dupont P."
                    },
                    {
                        "name": "Emsell L."
                    },
                    {
                        "name": "Kovacs S."
                    },
                    {
                        "name": "Radwan A.M."
                    },
                    {
                        "name": "Sollmann N."
                    },
                    {
                        "name": "Sunaert S."
                    },
                    {
                        "name": "Theys T."
                    },
                    {
                        "name": "Zhylka A."
                    }
                ],
                "date": "2021-04-01T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Virtual brain grafting: Enabling whole brain parcellation in the presence of large lesions"
            },
            "pmid": "33454411"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
