{
    "additionDate": "2017-01-17T15:05:18Z",
    "biotoolsCURIE": "biotools:mdqc",
    "biotoolsID": "mdqc",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "gcohen@mrl.ubc.ca",
            "name": "Gabriela Cohen-Freue",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multivariate quality assessment method for microarrays based on quality control (QC) reports. The Mahalanobis distance of an array's quality attributes is used to measure the similarity of the quality of that array against the quality of the other arrays. Then, arrays with unusually high distances can be flagged as potentially low-quality.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/mdqc.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/mdqc_1.36.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/mdqc.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": "GPL-2.0",
    "name": "mdqc",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm487",
            "metadata": {
                "abstract": "Motivation: The process of producing microarray data involves multiple steps, some of which may suffer from technical problems and seriously damage the quality of the data. Thus, it is essential to identify those arrays with low quality. This article addresses two questions: (1) how to assess the quality of a microarray dataset using the measures provided in quality control (QC) reports; (2) how to identify possible sources of the quality problems. Results: We propose a novel multivariate approach to evaluate the quality of an array that examines the 'Mahalanobis distance' of its quality attributes from those of other arrays. Thus, we call it Mahalanobis Distance Quality Control (MDQC) and examine different approaches of this method. MDQC flags problematic arrays based on the idea of outlier detection, i.e. it flags those arrays whose quality attributes jointly depart from those of the bulk of the data. Using two case studies, we show that a multivariate analysis gives substantially richer information than analyzing each parameter of the QC report in isolation. Moreover, once the QC report is produced, our quality assessment method is computationally inexpensive and the results can be easily visualized and interpreted. Finally, we show that computing these distances on subsets of the quality measures in the report may increase the method's ability to detect unusual arrays and helps to identify possible reasons of the quality problems. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Freue G.V.C."
                    },
                    {
                        "name": "Hollander Z."
                    },
                    {
                        "name": "Shen E."
                    },
                    {
                        "name": "Zamar R.H."
                    },
                    {
                        "name": "Balshaw R."
                    },
                    {
                        "name": "Scherer A."
                    },
                    {
                        "name": "Mcmanus B."
                    },
                    {
                        "name": "Keown P."
                    },
                    {
                        "name": "Mcmaster W.R."
                    },
                    {
                        "name": "Ng R.T."
                    }
                ],
                "citationCount": 26,
                "date": "2007-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MDQC: A new quality assessment method for microarrays based on quality control reports"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.36.0"
    ]
}