{
    "additionDate": "2024-02-09T11:00:23.536773Z",
    "biotoolsCURIE": "biotools:carot",
    "biotoolsID": "carot",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "javid.dadashkarimi@yale.edu",
            "name": "Javid Dadashkarimi",
            "typeEntity": "Person"
        }
    ],
    "description": "Creating connectomes for different atlases when raw data is not available.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://carotproject.com/",
    "lastUpdate": "2024-02-09T11:00:23.539554Z",
    "name": "CAROT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2023.102864",
            "metadata": {
                "abstract": "Open-source, publicly available neuroimaging datasets – whether from large-scale data collection efforts or pooled from multiple smaller studies – offer unprecedented sample sizes and promote generalization efforts. Releasing data can democratize science, increase the replicability of findings, and lead to discoveries. Partly due to patient privacy, computational, and data storage concerns, researchers typically release preprocessed data with the voxelwise time series parcellated into a map of predefined regions, known as an atlas. However, releasing preprocessed data also limits the choices available to the end-user. This is especially true for connectomics, as connectomes created from different atlases are not directly comparable. Since there exist several atlases with no gold standards, it is unrealistic to have processed, open-source data available from all atlases. Together, these limitations directly inhibit the potential benefits of open-source neuroimaging data. To address these limitations, we introduce Cross Atlas Remapping via Optimal Transport (CAROT) to find a mapping between two atlases. This approach allows data processed from one atlas to be directly transformed into a connectome based on another atlas without the need for raw data access. To validate CAROT, we compare reconstructed connectomes against their original counterparts (i.e., connectomes generated directly from an atlas), demonstrate the utility of transformed connectomes in downstream analyses, and show how a connectome-based predictive model can generalize to publicly available data that was processed with different atlases. Overall, CAROT can reconstruct connectomes from an extensive set of atlases – without needing the raw data – allowing already processed connectomes to be easily reused in a wide range of analyses while eliminating redundant processing efforts. We share this tool as both source code and as a stand-alone web application (http://carotproject.com/).",
                "authors": [
                    {
                        "name": "Adkinson B."
                    },
                    {
                        "name": "Camp C."
                    },
                    {
                        "name": "Dadashkarimi J."
                    },
                    {
                        "name": "Dai W."
                    },
                    {
                        "name": "Farruggia M."
                    },
                    {
                        "name": "Foster M."
                    },
                    {
                        "name": "Jiang R."
                    },
                    {
                        "name": "Karbasi A."
                    },
                    {
                        "name": "Liang Q."
                    },
                    {
                        "name": "Noble S."
                    },
                    {
                        "name": "Pollatou A."
                    },
                    {
                        "name": "Rodriguez R."
                    },
                    {
                        "name": "Rosenblatt M."
                    },
                    {
                        "name": "Scheinost D."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Tejavibulya L."
                    },
                    {
                        "name": "Ye J."
                    }
                ],
                "date": "2023-08-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "Cross Atlas Remapping via Optimal Transport (CAROT): Creating connectomes for different atlases when raw data is not available"
            },
            "pmcid": "PMC10526726",
            "pmid": "37352650"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
