{
    "additionDate": "2023-01-28T13:43:29.100681Z",
    "biotoolsCURIE": "biotools:gaitforemer",
    "biotoolsID": "gaitforemer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eadeli@stanford.edu",
            "name": "Ehsan Adeli",
            "typeEntity": "Person"
        }
    ],
    "description": "GaitForeMer (Gait Forecasting and impairment estimation transforMer) predicts MDS-UPDRS gait impairment severity scores using learned motion features from the pre-training task of human motion forecasting.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/markendo/GaitForeMer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-28T13:43:29.103394Z",
    "license": "GPL-3.0",
    "name": "GaitForeMer",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/978-3-031-16452-1_13",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive license to Springer Nature Switzerland AG.Parkinson’s disease (PD) is a neurological disorder that has a variety of observable motor-related symptoms such as slow movement, tremor, muscular rigidity, and impaired posture. PD is typically diagnosed by evaluating the severity of motor impairments according to scoring systems such as the Movement Disorder Society Unified Parkinson’s Disease Rating Scale (MDS-UPDRS). Automated severity prediction using video recordings of individuals provides a promising route for non-intrusive monitoring of motor impairments. However, the limited size of PD gait data hinders model ability and clinical potential. Because of this clinical data scarcity and inspired by the recent advances in self-supervised large-scale language models like GPT-3, we use human motion forecasting as an effective self-supervised pre-training task for the estimation of motor impairment severity. We introduce GaitForeMer, Gait Forecasting and impairment estimation transforMer, which is first pre-trained on public datasets to forecast gait movements and then applied to clinical data to predict MDS-UPDRS gait impairment severity. Our method outperforms previous approaches that rely solely on clinical data by a large margin, achieving an F$$:1$$ score of 0.76, precision of 0.79, and recall of 0.75. Using GaitForeMer, we show how public human movement data repositories can assist clinical use cases through learning universal motion representations. The code is available at https://github.com/markendo/GaitForeMer.",
                "authors": [
                    {
                        "name": "Adeli E."
                    },
                    {
                        "name": "Endo M."
                    },
                    {
                        "name": "Fei-Fei L."
                    },
                    {
                        "name": "Pohl K.M."
                    },
                    {
                        "name": "Poston K.L."
                    },
                    {
                        "name": "Sullivan E.V."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
                "title": "GaitForeMer: Self-supervised Pre-training of Transformers via Human Motion Forecasting for Few-Shot Gait Impairment Severity Estimation"
            },
            "pmcid": "PMC9635991",
            "pmid": "36342887"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ]
}
