{
    "additionDate": "2021-01-20T10:55:22Z",
    "biotoolsCURIE": "biotools:findsitesupcomb2.0",
    "biotoolsID": "findsitesupcomb2.0",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "skolnick@gatech.edu",
            "name": "Jeffrey Skolnick",
            "typeEntity": "Person"
        }
    ],
    "description": "A New Approach for Virtual Ligand Screening of Proteins and Virtual Target Screening of Biomolecules.\n\nCenter for the Study of Systems Biology.\n\nFINDSITEcomb2.0: A Drug Discovery Tool is an upgrade of the FINDSITEcomb algorithm that was compared to several commercially and freely available docking programs against the DUD set A Directory of Useful Decoys.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein threading",
                    "uri": "http://edamontology.org/operation_0302"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://pwp.gatech.edu/cssb/FINDSITE-COMB-2",
    "lastUpdate": "2021-05-17T06:32:30Z",
    "name": "FINDSITEsupcomb2.0",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.8B00309",
            "metadata": {
                "abstract": "© 2018 American Chemical Society.Computational approaches for predicting protein-ligand interactions can facilitate drug lead discovery and drug target determination. We have previously developed a threading/structural-based approach, FINDSITEcomb, for the virtual ligand screening of proteins that has been extensively experimentally validated. Even when low resolution predicted protein structures are employed, FINDSITEcomb has the advantage of being faster and more accurate than traditional high-resolution structure-based docking methods. It also overcomes the limitations of traditional QSAR methods that require a known set of seed ligands that bind to the given protein target. Here, we further improve FINDSITEcomb by enhancing its template ligand selection from the PDB/DrugBank/ChEMBL libraries of known protein-ligand interactions by (1) parsing the template proteins and their corresponding binding ligands in the DrugBank and ChEMBL libraries into domains so that the ligands with falsely matched domains to the targets will not be selected as template ligands; (2) applying various thresholds to filter out falsely matched template structures in the structure comparison process and thus their corresponding ligands for template ligand selection. With a sequence identity cutoff of 30% of target to templates and modeled target structures, FINDSITEcomb2.0 is shown to significantly improve upon FINDSITEcomb on the DUD-E benchmark set by increasing the 1% enrichment factor from 16.7 to 22.1, with a p-value of 4.3 × 10-3 by the Student t-test. With an 80% sequence identity cutoff of target to templates for the DUD-E set and modeled target structures, FINDSITEcomb2.0, having a 1% ROC enrichment factor of 52.39, also outperforms state-of-the-art methods that employ machine learning such as a deep convolutional neural network, CNN, with an enrichment of 29.65. Thus, FINDSITEcomb2.0 represents a significant improvement in the state-of-the-art. The FINDSITEcomb2.0 web service is freely available for academic users at http://pwp.gatech.edu/cssb/FINDSITE-COMB-2.",
                "authors": [
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Skolnick J."
                    },
                    {
                        "name": "Zhou H."
                    }
                ],
                "citationCount": 11,
                "date": "2018-11-26T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "FINDSITEcomb2.0: A New Approach for Virtual Ligand Screening of Proteins and Virtual Target Screening of Biomolecules"
            },
            "pmcid": "PMC6437778",
            "pmid": "30278128"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
