{"credit":[{"email":"mikko.vainio@abo.fi","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://users.abo.fi/mivainio/shaep/faq.htm"}],"function":[{"operation":[{"term":"Molecular surface comparison","uri":"http://edamontology.org/operation_3666"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Compound libraries and screening","uri":"http://edamontology.org/topic_3343"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/shaep-1-0-7-915-align-rigid-3d-molecular-structure-models.html"}],"publication":[{"abstract":"ShaEP is a tool for rigid-body superimposition and similarity evaluation of ligand-sized molecules. Molecular overlay methods traditionally work on either substructures, molecular surfaces or interaction fields, or atom-centered Gaussian functions representing the molecular volume. While substructure searches are unlikely to reveal hits that are chemically different from the template structure, the other methods are capable of \"scaffold hopping\". Methods that match characteristic points in interaction fields can find alignments in situations where only some portions of the structures match but potentially miss good alignments if the used point sets are not detailed enough, which in turn increases the runtime of the used graph algorithms beyond practical limits. The faster, polynomially scaling volumetric methods consider the whole space to be equally important, which works well for molecules of equal size but partial matches might go undetected. ShaEP aims to capture the strengths of both field-based and volumetric approaches. It generates initial superimpositions using a matching algorithm on graphs that coarsely represent the electrostatic potential and local shape at points close to the molecular surfaces. The initial alignments are then optimized by maximization of the volume overlap of the molecules, computed using Gaussian functions. ShaEP overlays drug-sized molecules on a subsecond timescale, allowing for the screening of large virtual libraries. The program is available free of charge from www.abo.fi/fak/mnf/bkf/research/johnson/software.php. © 2009 American Chemical Society.","authors":["Vainio M.J.","Puranen J.S.","Johnson M.S."],"cit_count":104,"journal":"Journal of Chemical Information and Modeling","pmid":"19434847","title":"ShaEP: Molecular overlay based on shape and electrostatic potential","year":"2009-02-23"}],"summary":{"biotoolsCURIE":"biotools:shaep","biotoolsID":"shaep","description":"This tool aligns (superimposes) two rigid 3D molecular structure models and computes a similarity index for the overlay. It can be used for the virtual screening of libraries of chemical structures against a known active molecule, or as a preparative step for 3D QSAR methods.","homepage":"http://users.abo.fi/mivainio/shaep/","name":"ShaEP"}}