{
    "accessibility": "Open access",
    "additionDate": "2021-12-13T23:32:38.116019Z",
    "biotoolsCURIE": "biotools:smart-hf",
    "biotoolsID": "smart-hf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tohyama@cardiol.med.kyushu-u.ac.jp",
            "name": "Takeshi Tohyama",
            "orcidid": "https://orcid.org/0000-0002-7300-8180",
            "typeEntity": "Person"
        },
        {
            "email": "tomomi_i@cardiol.med.kyushu-u.ac.jp",
            "name": "Tomomi Ide",
            "typeEntity": "Person"
        },
        {
            "name": "Hidetaka Kaku"
        },
        {
            "name": "Masataka Ikeda"
        },
        {
            "name": "Nobuyuki Enzan"
        }
    ],
    "description": "SMART-HF is an online AI app for risk stratification of heart failure patients, based on the Japanese heart failure registry (JROADHF) of ten thousands of people. SMART-HF predicts the prognosis of one-year survival ratio after hospitalization due to acute decompensated heart failure. This app is designed for not only healthcare providers but also non-healthcare providers.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://hfriskcalculator.herokuapp.com",
    "lastUpdate": "2021-12-13T23:32:38.118632Z",
    "license": "Not licensed",
    "name": "SMART-HF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/EHF2.13556",
            "metadata": {
                "abstract": "© 2021 The Authors. ESC Heart Failure published by John Wiley & Sons Ltd on behalf of European Society of Cardiology.Aims: Individual risk stratification is a fundamental strategy in managing patients with heart failure (HF). Artificial intelligence, particularly machine learning (ML), can develop superior models for predicting the prognosis of HF patients, and administrative claim data (ACD) are suitable for ML analysis because ACD is a structured database. The objective of this study was to analyse ACD using an ML algorithm, predict the 1 year mortality of patients with HF, and finally develop an easy-to-use prediction model with high accuracy using the top predictors identified by the ML algorithm. Methods and results: Machine learning-based prognostic prediction models were developed from the ACD on 10 175 HF patients from the Japanese Registry of Acute Decompensated Heart Failure with 17% mortality during 1 year follow-up. The top predictors for prognosis in HF were identified by the permutation feature importance technique, and an easy-to-use prediction model was developed based on these predictors. The c-statistics and Brier scores of the developed ML-based models were compared with those of conventional risk models: Seattle Heart Failure Model (SHFM) and Meta-Analysis Global Group in Chronic Heart Failure (MAGGIC). A voting classifier algorithm (ACD-VC) achieved the highest c-statistics among the six ML algorithms. The permutation feature importance technique enabled identification of the top predictors such as Barthel index, age, body mass index, duration of hospitalization, last hospitalization, renal disease, and non-loop diuretics use (feature importance values were 0.054, 0.025, 0.010, 0.005, 0.005, 0.004, and 0.004, respectively). Upon combination of some of the predictors that can be assessed from a brief interview, the Simple Model by ARTificial intelligence for HF risk stratification (SMART-HF) was established as an easy-to-use prediction model. Compared with the conventional models, SMART-HF achieved a higher c-statistic {ACD-VC: 0.777 [95% confidence interval (CI) 0.751–0.803], SMART-HF: 0.765 [95% CI 0.739–0.791], SHFM: 0.713 [95% CI 0.684–0.742], MAGGIC: 0.726 [95% CI 0.698–0.753]} and better Brier scores (ACD-VC: 0.121, SMART-HF: 0.124, SHFM: 0.139, MAGGIC: 0.130). Conclusions: The ML model based on ACD predicted the 1 year mortality of HF patients with high accuracy, and SMART-HF along with the ML model achieved superior performance to that of the conventional risk models. The SMART-HF model has the clear merit of easy operability even by non-healthcare providers with a user-friendly online interface (https://hfriskcalculator.herokuapp.com/). Risk models developed using SMART-HF may provide a novel modality for risk stratification of patients with HF.",
                "authors": [
                    {
                        "name": "Enzan N."
                    },
                    {
                        "name": "Funakoshi K."
                    },
                    {
                        "name": "Ide T."
                    },
                    {
                        "name": "Ikeda M."
                    },
                    {
                        "name": "Kaku H."
                    },
                    {
                        "name": "Kishimoto J."
                    },
                    {
                        "name": "Matsushima S."
                    },
                    {
                        "name": "Todaka K."
                    },
                    {
                        "name": "Tohyama T."
                    },
                    {
                        "name": "Tsutsui H."
                    }
                ],
                "date": "2021-10-01T00:00:00Z",
                "journal": "ESC Heart Failure",
                "title": "Machine learning-based model for predicting 1 year mortality of hospitalized patients with heart failure"
            },
            "pmcid": "PMC8497366",
            "pmid": "34390311"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}
