{
    "accessibility": "Open access",
    "additionDate": "2022-06-13T09:52:17.009965Z",
    "biotoolsCURIE": "biotools:easymicroplot",
    "biotoolsID": "easymicroplot",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jiypan@vip.163.com",
            "name": "Jiyang Pan",
            "typeEntity": "Person"
        },
        {
            "email": "xielw@gdim.cn",
            "name": "Liwei Xie",
            "typeEntity": "Person"
        }
    ],
    "description": "EasyMicroPlot package for microbiome analysis tool on R platform that accomplishes the core tasks of metagenomic down-stream analysis from start to finish, specially designed by screening popular microbial analysis and visualization.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xielab2017/EasyMicroPlot",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-13T09:52:17.012503Z",
    "license": "GPL-3.0",
    "name": "EasyMicroPlot",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.803627",
            "metadata": {
                "abstract": "Copyright © 2022 Liu, Huang, Liu, Pan, Cui, Pan and Xie.Advances in next-generation sequencing (NGS) have revolutionized microbial studies in many fields, especially in clinical investigation. As the second human genome, microbiota has been recognized as a new approach and perspective to understand the biological and pathologic basis of various diseases. However, massive amounts of sequencing data remain a huge challenge to researchers, especially those who are unfamiliar with microbial data analysis. The mathematic algorithm and approaches introduced from another scientific field will bring a bewildering array of computational tools and acquire higher quality of script experience. Moreover, a large cohort research together with extensive meta-data including age, body mass index (BMI), gender, medical results, and others related to subjects also aggravate this situation. Thus, it is necessary to develop an efficient and convenient software for clinical microbiome data analysis. EasyMicroPlot (EMP) package aims to provide an easy-to-use microbial analysis tool based on R platform that accomplishes the core tasks of metagenomic downstream analysis, specially designed by incorporation of popular microbial analysis and visualization used in clinical microbial studies. To illustrate how EMP works, 694 bio-samples from Guangdong Gut Microbiome Project (GGMP) were selected and analyzed with EMP package. Our analysis demonstrated the influence of dietary style on gut microbiota and proved EMP package's powerful ability and excellent convenience to address problems for this field.",
                "authors": [
                    {
                        "name": "Cui Z."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Pan J."
                    },
                    {
                        "name": "Pan X."
                    },
                    {
                        "name": "Xie L."
                    }
                ],
                "date": "2022-01-04T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "EasyMicroPlot: An Efficient and Convenient R Package in Microbiome Downstream Analysis and Visualization for Clinical Study"
            },
            "pmcid": "PMC8764268",
            "pmid": "35058973"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
