{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T12:57:42.233738Z",
    "biotoolsCURIE": "biotools:lrgapcloser",
    "biotoolsID": "lrgapcloser",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lijt@cafs.ac.cn",
            "name": "Jiong-Tang Li",
            "orcidid": "https://orcid.org/0000-0002-7277-1942",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "LR_Gapcloser is a gap closing tool using long reads from studied species. The long reads could be downloaed from public read archive database (for instance, NCBI SRA database ) or be your own data. Then they are fragmented and aligned to scaffolds using BWA mem algorithm in BWA package. In the package, we provided a compiled bwa, so the user needn't to install bwa. LR_Gapcloser uses the alignments to find the bridging that cross the gap, and then fills the long read original sequence into the genomic gaps.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffold gap completion",
                    "uri": "http://edamontology.org/operation_3217"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CAFS-bioinformatics/LR_Gapcloser",
    "language": [
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T20:10:48.268221Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/CAFS-bioinformatics/LR_Gapcloser/issues"
        }
    ],
    "name": "LR_Gapcloser",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/gigascience/giy157",
            "metadata": {
                "abstract": "Completing a genome is an important goal of genome assembly. However, many assemblies, including reference assemblies, are unfinished and have a number of gaps. Long reads obtained from third-generation sequencing (TGS) platforms can help close these gaps and improve assembly contiguity. However, current gap-closure approaches using long reads require extensive runtime and high memory usage. Thus, a fast and memory-efficient approach using long reads is needed to obtain complete genomes. Findings: We developed LR Gapcloser to rapidly and efficiently close the gaps in genome assembly. This tool utilizes long reads generated from TGS sequencing platforms. Tested on de novo assembled gaps, repeat-derived gaps, and real gaps, LR Gapcloser closed a higher number of gaps faster and with a lower error rate and a much lower memory usage than two existing, state-of-the art tools. This tool utilized raw reads to fill more gaps than when using error-corrected reads. It is applicable to gaps in the assemblies by different approaches and from large and complex genomes. After performing gap-closure using this tool, the contig N50 size of the human CHM1 genome was improved from 143 kb to 19 Mb, a 132-fold increase. We also closed the gaps in the Triticum urartu genome, a large genome rich in repeats; the contig N50 size was increased by 40%. Further, we evaluated the contiguity and correctness of six hybrid assembly strategies by combining the optimal TGS-based and next-generation sequencing-based assemblers with LR Gapcloser. A proposed and optimal hybrid strategy generated a new human CHM1 genome assembly with marked contiguity. The contig N50 value was greater than 28 Mb, which is larger than previous non-reference assemblies of the diploid human genome. Conclusions: LR Gapcloser is a fast and efficient tool that can be used to close gaps and improve the contiguity of genome assemblies. A proposed hybrid assembly including this tool promises reference-grade assemblies.",
                "authors": [
                    {
                        "name": "Li J.-T."
                    },
                    {
                        "name": "Li S.-Q."
                    },
                    {
                        "name": "Wang H.-W."
                    },
                    {
                        "name": "Xu G.-C."
                    },
                    {
                        "name": "Xu T.-J."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhu R."
                    }
                ],
                "citationCount": 118,
                "date": "2018-12-21T00:00:00Z",
                "journal": "GigaScience",
                "title": "LR-Gapcloser: A tiling path-based gap closer that uses long reads to complete genome assembly"
            },
            "pmcid": "PMC6324547",
            "pmid": "30576505",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
