{
    "accessibility": "Open access",
    "additionDate": "2024-03-08T09:28:34.034220Z",
    "biotoolsCURIE": "biotools:cilialyzer",
    "biotoolsID": "cilialyzer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "martin.frenz@unibe.ch",
            "name": "Martin Frenz",
            "orcidid": "https://orcid.org/0000-0002-6741-9434",
            "typeEntity": "Person"
        },
        {
            "email": "martin.schneiter@unibe.ch",
            "name": "Martin Schneiter",
            "orcidid": "https://orcid.org/0000-0003-4900-8807",
            "typeEntity": "Person"
        }
    ],
    "description": "A freely available open-source software for the analysis of mucociliary activity in respiratory cells.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://msdev87.github.io/Cilialyzer/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/msdev87/Cilialyzer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-03-08T09:29:17.218191Z",
    "license": "MIT",
    "name": "Cilialyzer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2023.107744",
            "metadata": {
                "abstract": "Background and Objective: Primary ciliary dyskinesia (PCD) is a rare genetic disorder causing a defective ciliary structure, which predominantly leads to an impaired mucociliary clearance and associated airway disease. As there is currently no single diagnostic gold standard test, PCD is diagnosed by a combination of several methods comprising genetic testing and the examination of the ciliary structure and function. Among the approved diagnostic methods, only high-speed video microscopy (HSVM) allows to directly observe the ciliary motion and therefore, to directly assess ciliary function. In the present work, we present our recently developed freely available open-source software – termed “Cilialyzer”, which has been specifically designed to support and facilitate the analysis of the mucociliary activity in respiratory epithelial cells captured by high-speed video microscopy. Methods: In its current state, the Cilialyzer software enables clinical PCD analysts to load, preprocess and replay recorded image sequences as well as videos with a feature-rich replaying module facilitating the commonly performed qualitative visual assessment of ciliary function (including the assessment of the ciliary beat pattern). The image processing methods made accessible through an intuitive user interface allow clinical specialists to comfortably compute the ciliary beating frequency (CBF), the activity map and the “frequency correlation length” – an observable getting newly introduced. Furthermore, the Cilialyzer contains a simple-to-use particle tracking interface to determine the mucociliary transport speed. Results: Cilialyzer is fully written in the Python programming language and freely available under the terms of the MIT license. The proper functioning of the computational analysis methods constituting the Cilialyzer software is demonstrated by using simulated and representative sample data from clinical practice. Additionally, the software was used to analyze high-speed videos showing samples obtained from healthy controls and genetically confirmed PCD cases (DNAI1 and DNAH11 mutations) to show its clinical applicability. Conclusions: Cilialyzer serves as a useful clinical tool for PCD analysts and provides new quantitative information awaiting to be clinically evaluated using cohorts of PCD. As Cilialyzer is freely available under the terms of a permissive open-source license, it serves as a ground frame for further development of computational methods aiming at the quantification and automation of the analysis of mucociliary activity captured by HSVM.",
                "authors": [
                    {
                        "name": "Escher A."
                    },
                    {
                        "name": "Frenz M."
                    },
                    {
                        "name": "Muller L."
                    },
                    {
                        "name": "Schneiter M."
                    },
                    {
                        "name": "Tschanz S.A."
                    }
                ],
                "date": "2023-11-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "The Cilialyzer – A freely available open-source software for the analysis of mucociliary activity in respiratory cells"
            },
            "pmid": "37598471"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
