{
    "accessibility": "Open access",
    "additionDate": "2022-11-04T09:57:33.128103Z",
    "biotoolsCURIE": "biotools:gluclas",
    "biotoolsID": "gluclas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "J. Pavan"
        },
        {
            "name": "S. Del Favero"
        }
    ],
    "description": "Gluclas (GLUcose CLamp ASsistant) is a free software for suggesting glucose infusion rate adjustments during manual glucose clamp experiments.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/jp993/gluclas_dev"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jp993/gluclas",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-11-04T09:57:33.130621Z",
    "license": "CC-BY-NC-ND-4.0",
    "name": "Gluclas",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2022.107104",
            "metadata": {
                "abstract": "© 2022Background and Objective: The glucose clamp (GC) is an experimental technique for assessing several aspects of glucose metabolism. In these experiments, investigators face the non-trivial challenge of accurately adjusting the rate of intravenous glucose infusion to drive subjects’ blood glucose (BG) concentration towards a desired plateau level. In this work we present Gluclas, an open-source software to support researchers in the modulation of glucose infusion rate (GIR) during GC experiments. Methods: Gluclas uses a proportional-integrative-derivative controller to provide GIR suggestions based on BG measurements. The controller embeds an anti-wind-up scheme to account for actuator physical limits and suitable corrections of control action to accommodate for possible sampling jitter due to manual measurement and actuation. The software also provides a graphic user interface to increase its usability. A preliminary validation of the controller is performed for different clamp scenarios (hyperglycemic, euglycemic, hypoglycemic) on a simulator of glucose metabolism in healthy subjects, which also includes models of measurement error and sampling delay for increased realism. In silico trials are performed on 50 virtual subjects. We also report the results of the first in-vivo application of the software in three subjects undergoing a hypoglycemic clamp. Results: In silico, during the plateau period, the coefficient of variation (CV) is in median below 5% for every protocol, with 5% being considered the threshold for sufficient quality. In terms of median [5th percentile, 95th percentile], average BG level during the plateau period is 12.18 [11.58 - 12.53] mmol/l in the hyperglycemic clamp (target: 12.4 mmol/), 4.92 [4.51 – 5.14] mmol/l in the euglycemic clamp (target: 5.5 mmol/) and 2.38 [2.33 – 2.64] in the hypoglycemic clamp (target: 2.5 mmol/). Results in vivo are consistent with those obtained in silico during the plateau period: average BG levels are between 2.56 and 2.68 mmol/l (target: 2.5 mmol/l); CV is below 5% for all three experiments. Conclusions: Gluclas offered satisfactory control for tested GC protocols. Although its safety and efficacy need to be further validated in vivo, this preliminary validation suggest that Gluclas offers a reliable and non-expensive solution for reducing investigator bias and improving the quality of GC experiments.",
                "authors": [
                    {
                        "name": "Bally L."
                    },
                    {
                        "name": "Dalla Man C."
                    },
                    {
                        "name": "Del Favero S."
                    },
                    {
                        "name": "Herzig D."
                    },
                    {
                        "name": "Pavan J."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "Gluclas: A software for computer-aided modulation of glucose infusion in glucose clamp experiments"
            },
            "pmid": "36088892"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "validated": 1
}
