{
    "additionDate": "2020-01-09T18:01:24Z",
    "biotoolsCURIE": "biotools:B47",
    "biotoolsID": "B47",
    "confidence_flag": "high",
    "description": "Current Management of Malignant Colorectal Polyps Across a Regional United Kingdom Cancer Network.\n\nThe requested resource https://links.lww.com/_redirect.aspx?404;https://links.lww.com:443/DCR/B47.MANEJO was not found!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'polipos colorrectales malignos', 'polipos colorrectales malignos presentados'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://links.lww.com/DCR/B47",
    "lastUpdate": "2020-01-09T18:01:24Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://links.lww.com/DCR/B47.MANEJO"
        }
    ],
    "name": "B47",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1097/DCR.0000000000001509",
            "metadata": {
                "abstract": "BACKGROUND: The incidence of malignant colorectal polyps has increased secondary to the greater use of diagnostic colonoscopy and introduction of screening programs. Faced with the dilemma of whether major resection is required or whether polypectomy has been sufficient treatment, the clinician relies on high- and low-risk histological parameters to guide decision-making. OBJECTIVE: The purpose of this study was to review current practice and evaluate multidisciplinary team decision-making across a United Kingdom Regional Cancer Network to establish the efficacy of previously set guidance from the Association of Coloproctology of Great Britain and Ireland (2013). DESIGN: This was a retrospective cohort study. SETTINGS: The study was conducted at a United Kingdom Regional Cancer Network composed of 4 separate National Health Service Hospital Trusts, covering an overall population of 1.5 million. PATIENTS: All patients with malignant colorectal polyps who presented to the colorectal multidisciplinary team over a 3-year period (April 1, 2012 to April 1, 2015) were included. MAIN OUTCOME MEASURES: Rate of residual disease after major resection, recurrence of cancer after polypectomy and surveillance alone, reporting of histological features, adherence to endoscopic surveillance guidelines, and outcomes of surveillance cross-sectional imaging were measured. RESULTS: A total of 173 patients (median age = 69 y) with a malignant colorectal polyp were identified during the study period, with a median of 2.7 years of follow-up. Thirty-seven patients (21.4%) underwent primary surgical resection with a residual disease rate of 43% (16/37). The remaining 136 patients (76.8%) were managed conservatively with recurrence in 6 cases (4.4%). Endoscopic follow-up at 3 months occurred in 61% of cases. Histological reporting was varied, with tumor differentiation and resection margin being reported in 84% of cases and lymphovascular invasion and depth of invasion in 71% and 59% of cases, respectively. LIMITATIONS: This was an observational retrospective study. CONCLUSIONS: The residual disease rate in patients treated surgically was higher than previously reported (43.2%). Incidence of recurrence in patients treated conservatively was low (4.4%). Areas of improvements have been identified in adherence to endoscopic follow-up, histopathological reporting, and potential overuse of radiological surveillance. See Video Abstract at http://links.lww.com/DCR/B47. MANEJO ACTUAL DE PÓLIPOS COLORRECTALES MALIGNOS A TRAVÉS DE UNA RED REGIONAL DE CÁNCER DEL REINO UNIDO: La incidencia de pólipos colorrectales malignos ha aumentado secundariamente al mayor uso de la colonoscopia diagnóstica y a la introducción de programas de detección. Ante el dilema de si se requiere una resección mayor o si la polipectomía ha sido un tratamiento suficiente, el médico se basa en parámetros histológicos de alto y bajo riesgo, para guiarse en la toma de decisiones.Revisar la práctica actual y evaluar la toma de decisiones, del equipo multidisciplinario de una red regional de cáncer del Reino Unido, para establecer la eficacia de las recomendaciones previamente establecidas, por la Asociación de Coloproctología de la Gran Bretaña e Irlanda (2013).Estudio de cohorte retrospectivo.Red Regional del Cáncer del Reino Unido, que comprende cuatro Fideicomisos Hospitalarios del Servicio Nacional de Salud y que cubren una población general de 1,5 millones de personas.Todos los pacientes con pólipos colorrectales malignos presentados al equipo colorrectal multidisciplinario durante un período de 3 años (01/04/2012-01/04/2015).Tasa de enfermedad residual después de una resección mayor, recurrencia de cáncer después de polipectomía y vigilancia sola, informe de características histológicas, adherencia a directrices de vigilancia endoscópica y resultados de la vigilancia de la imagen transversal.Se identificaron un total de 173 pacientes (mediana de edad de 69 años) con pólipo colorrectal maligno durante el período de estudio, con una mediana de seguimiento de 2.7 años. 37 pacientes (21,4%) fueron sometidos a resección quirúrgica primaria con tasa de enfermedad residual del 43% (16/37). Los 136 pacientes restantes (76.8%) fueron manejados conservadoramente, con recurrencia en 6 casos (4.4%). El seguimiento endoscópico a los 3 meses, ocurrió en el 61% de los casos. El reporte histológico varió con la diferenciación tumoral. El margen de resección se informó en el 84% de los casos. La invasión linfovascular y la profundidad de la invasión fue del 71% y 59% de los casos.Estudio observacional retrospectivo.La tasa de enfermedad residual en pacientes tratados quirúrgicamente, fue más alta que la reportada previamente (43.2%). La incidencia de recurrencia en pacientes tratados de forma conservadora fue baja (4,4%). Se han identificado áreas de mejoras en cumplimiento del seguimiento endoscópico, informe histopatológico y el posible uso excesivo de la vigilancia radiológica. Vea el Resumen del Video en http://links.lww.com/DCR/B47.",
                "authors": [
                    {
                        "name": "Sharma V."
                    },
                    {
                        "name": "Junejo M.A."
                    },
                    {
                        "name": "Mitchell P.J."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Diseases of the colon and rectum",
                "title": "Current Management of Malignant Colorectal Polyps Across a Regional United Kingdom Cancer Network"
            },
            "pmid": "31569095"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}