{
    "accessibility": [],
    "additionDate": "2017-03-27T07:56:39Z",
    "biotoolsCURIE": "biotools:emage",
    "biotoolsID": "emage",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "emage@emouseatlas.org",
            "gridid": null,
            "name": "EMAGE Support",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "Freely available online database of in situ gene expression patterns in the developing mouse embryo. Gene expression domains from raw images are extracted and integrated spatially into a set of standard 3D virtual mouse embryos at different stages, allowing data interrogation by spatial methods. An anatomy ontology is also used to describe sites of expression, data can be queried using text-based methods. Data coverage has been increased by sourcing from a greater selection of journals.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.emouseatlas.org/emap/help/tutorials.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.emouseatlas.org/emage/",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "EMAGE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "EMAGE (http://www.emouseatlas.org/emage) is a freely available online database of in situ gene expression patterns in the developing mouse embryo. Gene expression domains from raw images are extracted and integrated spatially into a set of standard 3D virtual mouse embryos at different stages of development, which allows data interrogation by spatial methods. An anatomy ontology is also used to describe sites of expression, which allows data to be queried using text-based methods. Here, we describe recent enhancements to EMAGE including: the release of a completely re-designed website, which offers integration of many different search functions in HTML web pages, improved user feedback and the ability to find similar expression patterns at the click of a button; back-end refactoring from an object oriented to relational architecture, allowing associated SQL access; and the provision of further access by standard formatted URLs and a Java API. We have also increased data coverage by sourcing from a greater selection of journals and developed automated methods for spatial data annotation that are being applied to spatially incorporate the genome-wide (~19 000 gene) 'EURExpress' dataset into EMAGE. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Richardson L."
                    },
                    {
                        "name": "Venkataraman S."
                    },
                    {
                        "name": "Stevenson P."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Burton N."
                    },
                    {
                        "name": "Rao J."
                    },
                    {
                        "name": "Fisher M."
                    },
                    {
                        "name": "Baldock R.A."
                    },
                    {
                        "name": "Davidson D.R."
                    },
                    {
                        "name": "Christiansen J.H."
                    }
                ],
                "citationCount": 74,
                "date": "2009-09-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EMAGE mouse embryo spatial gene expression database: 2010 update"
            },
            "note": null,
            "pmcid": null,
            "pmid": "19767607",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Here, we describe the BioMart interface to the eMouseAtlas gene expression database EMAGE. EMAGE is a spatiotemporal database of in situ gene expression patterns in the developing mouse embryo. BioMart provides a generic web query interface and programmable access using web services. The BioMart interface extends access to EMAGE via a powerful method of structuring complex queries and one with which users may already be familiar with from other BioMart implementations. The interface is structured into several data sets providing the user with comprehensive query access to the EMAGE data. The federated nature of BioMart allows scope for integration and cross querying of EMAGE with other similar BioMarts. © The Author(s) 2011.",
                "authors": [
                    {
                        "name": "Stevenson P."
                    },
                    {
                        "name": "Richardson L."
                    },
                    {
                        "name": "Venkataraman S."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Baldock R."
                    }
                ],
                "citationCount": 12,
                "date": "2011-12-01T00:00:00Z",
                "journal": "Database",
                "title": "The BioMart interface to the eMouseAtlas gene expression database EMAGE"
            },
            "note": null,
            "pmcid": null,
            "pmid": "21930504",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "EMAGE (http://genex.hgu.mrc.ac.uk/Emage/database) is a database of in situ gene expression patterns in the developing mouse embryo. Domains of expression from raw data images are spatially integrated into a set of standard 3D virtual mouse embryos at different stages of development, allowing data interrogation by spatial methods. Sites of expression are also described using an anatomy ontology and data can be queried using text-based methods. Here we describe recent enhancements to EMAGE which include advances in spatial search methods including: a refined local spatial similarity search algorithm, a method to allow global spatial comparison of patterns in EMAGE and subsequent hierarchical-clustering, and spatial searches across multiple stages of development. In addition, we have extended data access by the introduction of web services and new HTML-based search interfaces, which allow access to data that has not yet been spatially annotated. We have also started incorporating full 3D images of gene expression that have been generated using optical projection tomography (OPT). © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Venkataraman S."
                    },
                    {
                        "name": "Stevenson P."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Richardson L."
                    },
                    {
                        "name": "Burton N."
                    },
                    {
                        "name": "Perry T.P."
                    },
                    {
                        "name": "Smith P."
                    },
                    {
                        "name": "Baldock R.A."
                    },
                    {
                        "name": "Davidson D.R."
                    },
                    {
                        "name": "Christiansen J.H."
                    }
                ],
                "citationCount": 27,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EMAGE - Edinburgh mouse atlas of gene expression: 2008 update"
            },
            "note": null,
            "pmcid": null,
            "pmid": "18077470",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "EMAGE (http://genex.hgu.mrc.ac.uk/Emage/database) is a freely available, curated database of gene expression patterns generated by in situ techniques in the developing mouse embryo. It is unique in that it contains standardized spatial representations of the sites of gene expression for each gene, denoted against a set of virtual reference embryo models. As such, the data can be interrogated in a novel and abstract manner by using space to define a query. Accompanying the spatial representations of gene expression patterns are text descriptions of the sites of expression, which also allows searching of the data by more conventional text-based methods.",
                "authors": [
                    {
                        "name": "Christiansen J.H."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Venkataraman S."
                    },
                    {
                        "name": "Richardson L."
                    },
                    {
                        "name": "Stevenson P."
                    },
                    {
                        "name": "Burton N."
                    },
                    {
                        "name": "Baldock R.A."
                    },
                    {
                        "name": "Davidson D.R."
                    }
                ],
                "citationCount": 75,
                "date": "2006-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "EMAGE: a spatial database of gene expression patterns during mouse embryo development."
            },
            "note": null,
            "pmcid": null,
            "pmid": "16381949",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1,
    "version": []
}