{
    "accessibility": "Open access",
    "additionDate": "2024-03-08T09:21:28.108634Z",
    "biotoolsCURIE": "biotools:virify",
    "biotoolsID": "virify",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "guillermo.pineros@sund.ku.dk",
            "name": "Guillermo Rangel-Pineros",
            "orcidid": "https://orcid.org/0000-0003-3848-4330",
            "typeEntity": "Person"
        },
        {
            "email": "rdf@ebi.ac.uk",
            "name": "Robert D. Finn",
            "orcidid": "https://orcid.org/0000-0001-8626-2148",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated detection, annotation and taxonomic classification pipeline using virus-specific protein profile hidden Markov models.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/EBI-Metagenomics/emg-viral-pipeline",
    "lastUpdate": "2024-11-24T14:10:52.709653Z",
    "license": "Apache-2.0",
    "name": "VIRify",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1011422",
            "metadata": {
                "abstract": "The study of viral communities has revealed the enormous diversity and impact these biological entities have on various ecosystems. These observations have sparked widespread interest in developing computational strategies that support the comprehensive characterization of viral communities based on sequencing data. Here we introduce VIRify, a new computational pipeline designed to provide a user-friendly and accurate functional and taxonomic characterization of viral communities. VIRify identifies viral contigs and prophages from metagenomic assemblies and annotates them using a collection of viral profile hidden Markov models (HMMs). These include our manually-curated profile HMMs, which serve as specific taxonomic markers for a wide range of prokaryotic and eukaryotic viral taxa and are thus used to reliably classify viral contigs. We tested VIRify on assemblies from two microbial mock communities, a large metagenomics study, and a collection of publicly available viral genomic sequences from the human gut. The results showed that VIRify could identify sequences from both prokaryotic and eukaryotic viruses, and provided taxonomic classifications from the genus to the family rank with an average accuracy of 86.6%. In addition, VIRify allowed the detection and taxonomic classification of a range of prokaryotic and eukaryotic viruses present in 243 marine metagenomic assemblies. Finally, the use of VIRify led to a large expansion in the number of taxonomically classified human gut viral sequences and the improvement of outdated and shallow taxonomic classifications. Overall, we demonstrate that VIRify is a novel and powerful resource that offers an enhanced capability to detect a broad range of viral contigs and taxonomically classify them.",
                "authors": [
                    {
                        "name": "Almeida A."
                    },
                    {
                        "name": "Beracochea M."
                    },
                    {
                        "name": "Finn R.D."
                    },
                    {
                        "name": "Holzer M."
                    },
                    {
                        "name": "Marz M."
                    },
                    {
                        "name": "Munoz A.R."
                    },
                    {
                        "name": "Rangel-Pineros G."
                    },
                    {
                        "name": "Sakharova E."
                    }
                ],
                "citationCount": 8,
                "date": "2023-08-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "VIRify: An integrated detection, annotation and taxonomic classification pipeline using virus-specific protein profile hidden Markov models"
            },
            "pmcid": "PMC10491390",
            "pmid": "37639475"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
