{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:23:06Z",
    "biotoolsCURIE": "biotools:Haloarchaeal_Genomes",
    "biotoolsID": "Haloarchaeal_Genomes",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "sdassarma@som.umaryland.edu",
            "name": "Shiladitya DasSarma",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Haloarchaeal genomes database.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://halo.umbc.edu/cgi-bin/haloweb/haloweb.pl"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://halo.umbc.edu/",
    "lastUpdate": "2024-11-24T21:02:27.279140Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "Haloarchaeal Genomes",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/1746-1448-6-12",
            "metadata": {
                "abstract": "Background: Complete genome sequencing together with post-genomic studies provide the opportunity for a comprehensive 'systems biology' understanding of model organisms. For maximum effectiveness, an integrated database containing genomic, transcriptomic, and proteomic data is necessary.Description: To improve data access and facilitate functional genomic studies on haloarchaea in our laboratory, a dedicated database and website, named HaloWeb, was developed. It incorporates all finished and publicly released haloarchaeal genomes, including gene, protein and RNA sequences and annotation data, as well as other features such as insertion element sequences. The HaloWeb database was designed for easy data access and mining, and includes tools for tasks such as genome map generation, sequence extraction, and sequence editing. Popular resources at other sites, e.g., NCBI PubMed and BLAST, COG and KOG protein clusters, KEGG pathways, and GTOP structures were dynamically linked. The HaloWeb site is located at http://halo4.umbi.umd.edu, and at a mirror site, http://halo5.umbi.umd.edu, with all public genomic data and NCBI, KEGG, and GTOP links available for use by the academic community. The database is curated and updated on a regular basis.Conclusions: The HaloWeb site includes all completely sequenced haloarchaeal genomes from public databases. It is currently being used as a tool for comparative genomics, including analysis of gene and genome structure, organization, and function. The database and website are up-to-date resources for researchers worldwide. © 2010 DasSarma et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Capes M.D."
                    },
                    {
                        "name": "DasSarma P."
                    },
                    {
                        "name": "DasSarma S."
                    },
                    {
                        "name": "DasSarma S.L."
                    }
                ],
                "citationCount": 40,
                "date": "2010-12-30T00:00:00Z",
                "journal": "Saline Systems",
                "title": "HaloWeb: The haloarchaeal genomes database"
            },
            "pmcid": "PMC3023673",
            "pmid": "21192823",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
