{
    "accessibility": "Open access",
    "additionDate": "2019-07-13T13:33:20Z",
    "biotoolsCURIE": "biotools:CRA_toolbox",
    "biotoolsID": "CRA_toolbox",
    "cost": "Free of charge",
    "description": "Software package for conditional robustness analysis of cancer systems biology models in MATLAB.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gitlab.ict4life.com/SysBiOThe/CRA-Matlab/wikis/home"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://gitlab.ict4life.com/SysBiOThe/CRA-Matlab",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T21:03:18.854515Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "http://gitlab.ict4life.com/SysBiOThe/CRA-Matlab/issues"
        }
    ],
    "maturity": "Mature",
    "name": "CRA toolbox",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2933-z",
            "metadata": {
                "abstract": "Background: In cancer research, robustness of a complex biochemical network is one of the most relevant properties to investigate for the development of novel targeted therapies. In cancer systems biology, biological networks are typically modeled through Ordinary Differential Equation (ODE) models. Hence, robustness analysis consists in quantifying how much the temporal behavior of a specific node is influenced by the perturbation of model parameters. The Conditional Robustness Algorithm (CRA) is a valuable methodology to perform robustness analysis on a selected output variable, representative of the proliferation activity of cancer disease. Results: Here we introduce our new freely downloadable software, the CRA Toolbox. The CRA Toolbox is an Object-Oriented MATLAB package which implements the features of CRA for ODE models. It offers the users the ability to import a mathematical model in Systems Biology Markup Language (SBML), to perturb the model parameter space and to choose the reference node for the robustness analysis. The CRA Toolbox allows the users to visualize and save all the generated results through a user-friendly Graphical User Interface (GUI). The CRA Toolbox has a modular and flexible architecture since it is designed according to some engineering design patterns. This tool has been successfully applied in three nonlinear ODE models: the Prostate-specific Pten -/- mouse model, the Pulse Generator Network and the EGFR-IGF1R pathway. Conclusions: The CRA Toolbox for MATLAB is an open-source tool implementing the CRA to perform conditional robustness analysis. With its unique set of functions, the CRA Toolbox is a remarkable software for the topological study of biological networks. The source and example code and the corresponding documentation are freely available at the web site: http://gitlab.ict4life.com/SysBiOThe/CRA-Matlab.",
                "authors": [
                    {
                        "name": "Antonini C."
                    },
                    {
                        "name": "Bianconi F."
                    },
                    {
                        "name": "Tomassoni L."
                    },
                    {
                        "name": "Valigi P."
                    }
                ],
                "citationCount": 7,
                "date": "2019-07-09T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CRA toolbox: Software package for conditional robustness analysis of cancer systems biology models in MATLAB"
            },
            "pmcid": "PMC6617887",
            "pmid": "31288758",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
