{
    "name": "StrainInfo", 
    "description": "The largest integrated microbial knowledge base.", 
    "homepage": "http://www.straininfo.net/", 
    "biotoolsID": "straininfo", 
    "biotoolsCURIE": "biotools:straininfo", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2421", 
                    "term": "Database search"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2912", 
                        "term": "Strain accession"
                    }, 
                    "format": []
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2912", 
                        "term": "Strain accession"
                    }, 
                    "format": []
                }, 
                {
                    "data": {
                        "uri": "http://edamontology.org/data_0850", 
                        "term": "Sequence set"
                    }, 
                    "format": []
                }, 
                {
                    "data": {
                        "uri": "http://edamontology.org/data_2526", 
                        "term": "Text data"
                    }, 
                    "format": []
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Database portal"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3473", 
            "term": "Data mining"
        }, 
        {
            "uri": "http://edamontology.org/topic_0621", 
            "term": "Model organisms"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [
        "BIG N2N", 
        "UGent"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.straininfo.net/docs/doku.php?id=help", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1109/TKDE.2005.131", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Knowledge accumulation and resolution of data inconsistencies during the integration of microbial information sources", 
                "abstract": "The Internet has emerged as an ever-increasing environment of multiple heterogeneous and autonomous data sources that contain relevant but overlapping information on microorganisms. Microbiologists might therefore seriously benefit from the design of intelligent software agents that assist in the navigation through this information-rich environment, together with the development of data mining tools that can aid in the discovery of new information. These applications heavily depend upon well-conditioned data samples that are correlated with multiple information sources, hence, accurate database merging operations are desirable. Information systems designed for joining the related knowledge provided by different microbial data sources are hampered by the labeling mechanism for referencing microbial strains and cultures that suffers from syntactical variation in the practical usage of the labels, whereas, additionally, synonymy and homonymy are also known to exist amongst the labels. This situation is even complicated by the observation that the label equivalence knowledge is itself fragmentarily recorded over several data sources which can be suspected of providing information that might be both incomplete and incorrect. This paper presents how extraction and integration of label equivalence information from several distributed data sources has led to the construction of a so-called integrated strain database, which helps to resolve most of the above problems. Given the fact that information retrieved from autonomous resources might be overlapping, incomplete, and incorrect, much energy was spent into the completion of missing information, the discovery of new associations between information objects, and the development and application of tools for error detection and correction. Through a thorough evaluation of the different levels of incompleteness and incorrectness encountered within the incorporated data sources, we have finally given proof of the added value of the integrated strain database as a necessary service provider for the seamless integration of microbial information sources. © 2005 IEEE.", 
                "date": "2005-08-01T00:00:00Z", 
                "citationCount": 53, 
                "authors": [
                    {
                        "name": "Dawyndt P."
                    }, 
                    {
                        "name": "Vancanneyt M."
                    }, 
                    {
                        "name": "De Meyer H."
                    }, 
                    {
                        "name": "Swings J."
                    }
                ], 
                "journal": "IEEE Transactions on Knowledge and Data Engineering"
            }
        }
    ], 
    "credit": [
        {
            "name": "ugent.be", 
            "email": null, 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Institute", 
            "typeRole": [
                "Provider"
            ], 
            "note": null
        }, 
        {
            "name": null, 
            "email": "Peter.Dawyndt@ugent.be", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "Katrijn.Vannerum@ugent.be", 
    "additionDate": "2016-05-17T10:18:38Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}