{
    "additionDate": "2021-01-18T08:12:49Z",
    "biotoolsCURIE": "biotools:ppiipred",
    "biotoolsID": "ppiipred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "denis.shields@ucd.ie",
            "name": "Denis C. Shields",
            "orcidid": "https://orcid.org/0000-0003-4015-2474",
            "typeEntity": "Person"
        }
    ],
    "description": "Prediction of polyproline II secondary structure propensity in proteins.\n\nPlease read the guide for details on how to tuse PPIIPred.\n\nPredicts polyproline II secondary structure from primary amino acid sequence using a bidirectional recurrent neural network.\n\nThis can generate an alignment for an existing UNIPROT sequence and then run it through PPIIPred, instead of entering your own sequence (enter UNIPROT ID here).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "http://bioware.ucd.ie/PPIIPRED",
    "lastUpdate": "2021-01-27T16:15:22Z",
    "name": "PPIIPRED",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1098/RSOS.191239",
            "metadata": {
                "abstract": "© 2020 The Authors. Published by the Royal Society under the terms of the Creative Commons Attribution License http://creativecommons.org/licenses/by/4.0/, which permits unrestricted use, provided the original author and source are credited.Background: The polyproline II helix (PPIIH) is an extended protein left-handed secondary structure that usually but not necessarily involves prolines. Short PPIIHs are frequently, but not exclusively, found in disordered protein regions, where they may interact with peptide-binding domains. However, no readily usable software is available to predict this state. Results: We developed PPIIPRED to predict polyproline II helix secondary structure from protein sequences, using bidirectional recurrent neural networks trained on known three-dimensional structures with dihedral angle filtering. The performance of the method was evaluated in an external validation set. In addition to proline, PPIIPRED favours amino acids whose side chains extend from the backbone (Leu, Met, Lys, Arg, Glu, Gln), as well as Ala and Val. Utility for individual residue predictions is restricted by the rarity of the PPIIH feature compared to structurally common features. Conclusion: The software, available at http://bioware.ucd.ie/PPIIPRED, is useful in large-scale studies, such as evolutionary analyses of PPIIH, or computationally reducing large datasets of candidate binding peptides for further experimental validation.",
                "authors": [
                    {
                        "name": "Lopez C."
                    },
                    {
                        "name": "Mooney C."
                    },
                    {
                        "name": "O'Brien K.T."
                    },
                    {
                        "name": "Pollastri G."
                    },
                    {
                        "name": "Shields D.C."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Royal Society Open Science",
                "title": "Prediction of polyproline II secondary structure propensity in proteins"
            },
            "pmcid": "PMC7029904",
            "pmid": "32218953"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
