
{
    "credit": [
        {
            "email": "encode-help@lists.stanford.edu",
            "name": "Encode DCC Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "TRAINING_MATERIAL",
            "url": "https://www.encodeproject.org/tutorials/"
        },
        {
            "type": "API_DOCUMENTATION",
            "url": "https://www.encodeproject.org/help/rest-api/"
        },
        {
            "type": "GENERAL",
            "url": "https://www.encodeproject.org/help/getting-started/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The ENCODE project is an international consortium with a goal of cataloguing all the functional elements in the human genome. The ENCODE Data Coordination Center (DCC) at the University of California, Santa Cruz serves as the central repository for ENCODE data. In this role, the DCC offers a collection of high-throughput, genome-wide data generated with technologies such as ChIP-Seq, RNA-Seq, DNA digestion and others. This data helps illuminate transcription factor-binding sites, histone marks, chromatin accessibility, DNA methylation, RNA expression, RNA binding and other cell-state indicators. It includes sequences with quality scores, alignments, signals calculated from the alignments, and in most cases, element or peak calls calculated from the signal data. Each data set is available for visualization and download via the UCSC Genome Browser (http://genome.ucsc.edu/). ENCODE data can also be retrieved using a metadata system that captures the experimental parameters of each assay. The ENCODE web portal at UCSC (http://encodeproject.org/) provides information about the ENCODE data and links for access. © The Author(s) 2010.",
            "authors": [
                "Raney B.J.",
                "Cline M.S.",
                "Rosenbloom K.R.",
                "Dreszer T.R.",
                "Learned K.",
                "Barber G.P.",
                "Meyer L.R.",
                "Sloan C.A.",
                "Malladi V.S.",
                "Roskin K.M.",
                "Suh B.B.",
                "Hinrichs A.S.",
                "Clawson H.",
                "Zweig A.S.",
                "Kirkup V.",
                "Fujita P.A.",
                "Rhead B.",
                "Smith K.E.",
                "Pohl A.",
                "Kuhn R.M.",
                "Karolchik D.",
                "Haussler D.",
                "Kent W.J."
            ],
            "cit_count": 136,
            "journal": "Nucleic Acids Research",
            "pmid": "21037257",
            "title": "ENCODE whole-genome data in the UCSC genome browser (2011 update)",
            "year": "2011-01-01"
        },
        {
            "abstract": "The Encyclopedia of DNA Elements (ENCODE) project is an international consortium of investigators funded to analyze the human genome with the goal of producing a comprehensive catalog of functional elements. The ENCODE Data Coordination Center at The University of California, Santa Cruz (UCSC) is the primary repository for experimental results generated by ENCODE investigators. These results are captured in the UCSC Genome Bioinformatics database and download server for visualization and data mining via the UCSC Genome Browser and companion tools (Rhead et al. The UCSC Genome Browser Database: update 2010, in this issue). The ENCODE web portal at UCSC (http://encodeproject.org or http://genome.ucsc.edu/ENCODE) provides information about the ENCODE data and convenient links for access. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Rosenbloom K.R.",
                "Dreszer T.R.",
                "Pheasant M.",
                "Barber G.P.",
                "Meyer L.R.",
                "Pohl A.",
                "Raney B.J.",
                "Wang T.",
                "Hinrichs A.S.",
                "Zweig A.S.",
                "Fujita P.A.",
                "Learned K.",
                "Rhead B.",
                "Smith K.E.",
                "Kuhn R.M.",
                "Karolchik D.",
                "Haussler D.",
                "Kent W.J."
            ],
            "cit_count": 186,
            "journal": "Nucleic Acids Research",
            "pmid": "19920125",
            "title": "ENCODE whole-genome data in the UCSC Genome Browser",
            "year": "2009-11-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:encode_dcc",
        "biotoolsID": "encode_dcc",
        "description": "It has a goal of cataloguing all the functional elements in the human genome. The ENCODE Data Coordination Center (DCC) serves as the central repository for ENCODE data. The DCC contains a collection of high-throughput, genome-wide data generated with technologies such as ChIP-Seq, RNA-Seq, DNA digestion and others. It includes sequences with quality scores, alignments, signals calculated from the alignments, and in most cases, element or peak calls calculated from the signal data.",
        "homepage": "http://encodeproject.org/ENCODE/",
        "name": "ENCODE DCC"
    }
}