
{
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "chiara.romualdi@unipd.it",
            "name": "Chiara Romualdi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://romualdi.bio.unipd.it/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://cran.r-project.org/web/packages/parmigene/parmigene.pdf"
        }
    ],
    "function": [
        {
            "note": "R package. It implements different algorithms for the reconstruction of regulatory network using mutual information.",
            "operation": [
                {
                    "term": "Sequence alignment analysis (site correlation)",
                    "uri": "http://edamontology.org/operation_0449"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "AGPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Inferring large transcriptional networks using mutual information has been shown to be effective in several experimental setup. Unfortunately, this approach has two main drawbacks: (i) several mutual information estimators are prone to biases and (ii) available software still has large computational costs when processing thousand of genes. Results: Here, we present parmigene (PARallel Mutual Information estimation for GEne NEtwork reconstruction), an R package that tries to fill the above gaps. It implements a mutual information estimator based on k-nearest neighbor distances that is minimally biased with respect to the other methods and uses a parallel computing paradigm to reconstruct gene regulatory networks. We test parmigene on in silico and real data. We show that parmigene gives more precise results than existing softwares with strikingly less computational costs. © The Author 2011. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Sales G.",
                "Romualdi C."
            ],
            "cit_count": 43,
            "doi": "10.1093/bioinformatics/btr274",
            "journal": "Bioinformatics",
            "pmid": "21531770",
            "title": "Parmigene-a parallel R package for mutual information estimation and gene network reconstruction",
            "type": "Primary",
            "year": "2011-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:parmigene",
        "biotoolsID": "parmigene",
        "description": "The package provides a parallel estimation of the mutual information based on entropy estimates from k-nearest neighbours distances and algorithms for the reconstruction of gene regulatory networks.",
        "homepage": "http://cran.r-project.org/web/packages/parmigene/index.html",
        "name": "parmigene",
        "version": [
            "1.0.2"
        ]
    }
}