{
    "additionDate": "2021-01-18T08:13:51Z",
    "biotoolsCURIE": "biotools:star-retinex",
    "biotoolsID": "star-retinex",
    "confidence_flag": "tool",
    "description": "A Structure and Texture Aware Retinex Model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "https://github.com/csjunxu/STAR",
    "language": [
        "MATLAB",
        "C",
        "C++",
        "Java"
    ],
    "lastUpdate": "2021-02-21T16:30:22Z",
    "name": "STAR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TIP.2020.2974060",
            "metadata": {
                "abstract": "© 2020 IEEE.Retinex theory is developed mainly to decompose an image into the illumination and reflectance components by analyzing local image derivatives. In this theory, larger derivatives are attributed to the changes in reflectance, while smaller derivatives are emerged in the smooth illumination. In this paper, we utilize exponentiated local derivatives (with an exponent γ ) of an observed image to generate its structure map and texture map. The structure map is produced by been amplified with γ > 1, while the texture map is generated by been shrank with γ < 1. To this end, we design exponential filters for the local derivatives, and present their capability on extracting accurate structure and texture maps, influenced by the choices of exponents γ. The extracted structure and texture maps are employed to regularize the illumination and reflectance components in Retinex decomposition. A novel Structure and Texture Aware Retinex (STAR) model is further proposed for illumination and reflectance decomposition of a single image. We solve the STAR model by an alternating optimization algorithm. Each sub-problem is transformed into a vectorized least squares regression, with closed-form solutions. Comprehensive experiments on commonly tested datasets demonstrate that, the proposed STAR model produce better quantitative and qualitative performance than previous competing methods, on illumination and reflectance decomposition, low-light image enhancement, and color correction. The code is publicly available at https://github.com/csjunxu/STAR.",
                "authors": [
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Hou Y."
                    },
                    {
                        "name": "Ren D."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Zhu F."
                    },
                    {
                        "name": "Yu M."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Shao L."
                    }
                ],
                "citationCount": 25,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "STAR: A Structure and Texture Aware Retinex Model"
            },
            "pmid": "32167892"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}