{
    "additionDate": "2020-01-09T17:56:53Z",
    "biotoolsCURIE": "biotools:EvoEF2",
    "biotoolsID": "EvoEF2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiaoqiah@umich.edu",
            "name": "Dr. Xiaoqiang Huang",
            "typeEntity": "Person",
            "typeRole": [
                "Support"
            ]
        }
    ],
    "description": "Accurate and fast energy function for computational protein design.\n\nenergy potential for protein design.\n\nEvoEF is a composite energy force field that contains two versions. The first version, EvoEF1, includes five energy terms with parameters optimized on two large sets of thermodynamics mutation data (ΔΔGstability and ΔΔGbind), while the second version, EvoEF2, includes nine energy terms and optimized based on recapitulation of protein sequence design. Extensive benchmark and analysis showed that the usefulness of energy functions is highly correlated with the parameter optimization processes. While EvoEF1 performs better than EvoEF2 on ΔΔG estimation, EvoEF2 significantly outperforms EvoEF2 on de novo protein sequence design. Therefore, we suggest users download the two versions according to their own needs.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                }
            ]
        }
    ],
    "homepage": "https://zhanglab.ccmb.med.umich.edu/EvoEF",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2020-12-28T14:28:50Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/tommyhuangthu/EvoEF2/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/tommyhuangthu/EvoEF2"
        }
    ],
    "name": "EvoEF2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ740",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: The accuracy and success rate of de novo protein design remain limited, mainly due to the parameter over-fitting of current energy functions and their inability to discriminate incorrect designs from correct designs. Results: We developed an extended energy function, EvoEF2, for efficient de novo protein sequence design, based on a previously proposed physical energy function, EvoEF. Remarkably, EvoEF2 recovered 32.5%, 47.9% and 22.3% of all, core and surface residues for 148 test monomers, and was generally applicable to protein-protein interaction design, as it recapitulated 30.9%, 42.4%, 31.3% and 21.4% of all, core, interface and surface residues for 88 test dimers, significantly outperforming EvoEF on the native sequence recapitulation. We further used I-TASSER to evaluate the foldability of the 148 designed monomer sequences, where all of them were predicted to fold into structures with high fold-and atomic-level similarity to their corresponding native structures, as demonstrated by the fact that 87.8% of the predicted structures shared a root-mean-square-deviation less than 2 Å to their native counterparts. The study also demonstrated that the usefulness of physical energy functions is highly correlated with the parameter optimization processes, and EvoEF2, with parameters optimized using sequence recapitulation, is more suitable for computational protein sequence design than EvoEF, which was optimized on thermodynamic mutation data.",
                "authors": [
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Pearce R."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 18,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "EvoEF2: Accurate and fast energy function for computational protein design"
            },
            "pmid": "31588495"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
