
{
    "credit": [
        {
            "email": "pleissner@mpiib-berlin.mpg.de",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.algorithmus.com/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://web.mpiib-berlin.mpg.de/pdbs/2d-page/downloads.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/topspot-3-0-analysis-gel-image.html"
        }
    ],
    "publication": [
        {
            "abstract": "The master gel of the human myocardial two-dimensional electrophoresis (2-DE) gel database contains about 3300 protein spots characterized in terms of isoelectric point (pI) and molecular mass. A high-performance technique was applied, using large gels (23 x 30 cm). Isoelectric focusing with anodic sample preparation and nonequilibrium running conditions (NEPHGE) was combined with sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) in 15% acrylamide gels in the second dimension. The range of pI extends from pH 4.5 to 9.6. Seventy proteins were identified by combinations of amino acid analysis, N-terminal and internal sequencing, immunostaining, matrix assisted laser desorption/ionization-mass spectrometry (MALDI-MS) peptide mass fingerprinting, post-source decay MALDI-MS and ladder sequencing by carboxypeptidase P. The identification of additional proteins, not found in the master gel, was achieved by immunoblotting. Unequivocal identification with high sensitivity and good yield was obtained by combining internal sequencing and MALDI-MS. In-gel digestion, the concentration and purification of peptides in a peptide collecting device, and the improved FRAGMOD program for peptide mass fingerprinting have added to the security and sensitivity of identification. The high-performance human myocardial 2-DE database was built up with proteins detected by the TOPSPOT program. Spots within six sections of the whole pattern are clickable. Protein description includes detailed information about identification, characterization, and links to the related SWISS-PROT, other 2-DE-databases and Medline entries. The database is constructed in accordance with four of the rules for a federated database.",
            "authors": [
                "Muller E.-C.",
                "Thiede B.",
                "Zimny-Arndt U.",
                "Scheler C.",
                "Prehm J.",
                "Muller-Werdan U.",
                "Wittmann-Liebold B.",
                "Otto A.",
                "Jungblut P."
            ],
            "cit_count": 56,
            "journal": "Electrophoresis",
            "pmid": "8982602",
            "title": "High-performance human myocardial two-dimensional electrophoresis database: Edition 1996",
            "year": "1996-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:topspot",
        "biotoolsID": "topspot",
        "description": "A software which has been developed for the purpose of analysing 2-dimensional electrophoretic imaging (2DE) of gels. It enables the user to obtain qualitative and quantitative gel data from gel images available in a BMP format or obtained using a scanner.",
        "homepage": "http://web.mpiib-berlin.mpg.de/pdbs/2d-page/downloads.html",
        "name": "TopSpot"
    }
}