{
    "additionDate": "2021-01-25T09:55:43Z",
    "biotoolsCURIE": "biotools:oncogenomiclandscapes",
    "biotoolsID": "oncogenomiclandscapes",
    "description": "The widespread incorporation of next-generation sequencing into clinical oncology has yielded an unprecedented amount of molecular data from thousands of patients. A main current challenge is to find out reliable ways to extrapolate results from one group of patients to another and to bring rationale to individual cases in the light of what is known from the cohorts. We present OncoGenomic Landscapes, a framework to analyze and display thousands of cancer genomic profiles in a 2D space. Our tool allows users to rapidly assess the heterogeneity of large cohorts, enabling the comparison to other groups of patients, and using driver genes as landmarks to aid in the interpretation of the landscapes. In our web-server, we also offer the possibility of mapping new samples and cohorts onto 22 predefined landscapes related to cancer cell line panels, organoids, patient-derived xenografts, and clinical tumor samples.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://oglandscapes.irbbarcelona.org/",
    "lastUpdate": "2021-01-25T09:56:13Z",
    "name": "OncogenomicLandscapes",
    "owner": "ptck72",
    "publication": [
        {
            "doi": "10.1186/s13073-018-0571-0",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: The widespread incorporation of next-generation sequencing into clinical oncology has yielded an unprecedented amount of molecular data from thousands of patients. A main current challenge is to find out reliable ways to extrapolate results from one group of patients to another and to bring rationale to individual cases in the light of what is known from the cohorts. Results: We present OncoGenomic Landscapes, a framework to analyze and display thousands of cancer genomic profiles in a 2D space. Our tool allows users to rapidly assess the heterogeneity of large cohorts, enabling the comparison to other groups of patients, and using driver genes as landmarks to aid in the interpretation of the landscapes. In our web-server, we also offer the possibility of mapping new samples and cohorts onto 22 predefined landscapes related to cancer cell line panels, organoids, patient-derived xenografts, and clinical tumor samples. Conclusions: Contextualizing individual subjects in a more general landscape of human cancer is a valuable aid for basic researchers and clinical oncologists trying to identify treatment opportunities, maybe yet unapproved, for patients that ran out of standard therapeutic options. The web-server can be accessed at https://oglandscapes.irbbarcelona.org /.",
                "authors": [
                    {
                        "name": "Mateo L."
                    },
                    {
                        "name": "Guitart-Pla O."
                    },
                    {
                        "name": "Duran-Frigola M."
                    },
                    {
                        "name": "Aloy P."
                    }
                ],
                "citationCount": 4,
                "date": "2018-08-03T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Exploring the OncoGenomic Landscape of cancer"
            },
            "pmid": "30071882"
        }
    ],
    "validated": 1
}