{
    "additionDate": "2020-01-14T08:52:29Z",
    "biotoolsCURIE": "biotools:MoMI-G",
    "biotoolsID": "MoMI-G",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mkasa@k.u-tokyo.ac.jp",
            "name": "Masahiro Kasahara",
            "orcidid": "https://orcid.org/0000-0001-8430-1414",
            "typeEntity": "Person"
        }
    ],
    "description": "Modular multi-scale integrated genome graph browser.\n\nLong-read sequencing allows for more sensitive and accurate discovery of SVs, which requires to filter and validate thousands of candidates. However, no existing genome browser meets the demand for cancer genomics. Because most visualization tools show an only range of a linear sequence, making them unsuitable for large (over megabase) or nested SVs. Also, no existing genome browsers allow users to simultaneously inspect the read alignments that span the reference allele and an alternative allele caused by a heterozygous SV. Here we present MoMI-G, a graph genome browser to visualize SVs on the variation graph, that provides a graph-based view that displays a genome with branches and alignments on them. Users can filter, visualize with genomic annotations, and inspect SVs with read alignments.\n\nA genome graph browser for visualization of structural variants (SVs) as a variation graph:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MoMI-G/MoMI-G",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2020-12-29T10:06:49Z",
    "license": "MIT",
    "name": "MoMI-G",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3145-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Genome graph is an emerging approach for representing structural variants on genomes with branches. For example, representing structural variants of cancer genomes as a genome graph is more natural than representing such genomes as differences from the linear reference genome. While more and more structural variants are being identified by long-read sequencing, many of them are difficult to visualize using existing structural variants visualization tools. To this end, visualization method for large genome graphs such as human cancer genome graphs is demanded. Results: We developed MOdular Multi-scale Integrated Genome graph browser, MoMI-G, a web-based genome graph browser that can visualize genome graphs with structural variants and supporting evidences such as read alignments, read depth, and annotations. This browser allows more intuitive recognition of large, nested, and potentially more complex structural variations. MoMI-G has view modules for different scales, which allow users to view the whole genome down to nucleotide-level alignments of long reads. Alignments spanning reference alleles and those spanning alternative alleles are shown in the same view. Users can customize the view, if they are not satisfied with the preset views. In addition, MoMI-G has Interval Card Deck, a feature for rapid manual inspection of hundreds of structural variants. Herein, we describe the utility of MoMI-G by using representative examples of large and nested structural variations found in two cell lines, LC-2/ad and CHM1. Conclusions: Users can inspect complex and large structural variations found by long-read analysis in large genomes such as human genomes more smoothly and more intuitively. In addition, users can easily filter out false positives by manually inspecting hundreds of identified structural variants with supporting long-read alignments and annotations in a short time. Software availability: MoMI-G is freely available at https://github.com/MoMI-G/MoMI-G under the MIT license.",
                "authors": [
                    {
                        "name": "Kasahara M."
                    },
                    {
                        "name": "Sakamoto Y."
                    },
                    {
                        "name": "Seki M."
                    },
                    {
                        "name": "Suzuki Y."
                    },
                    {
                        "name": "Yokoyama T.T."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MoMI-G: Modular multi-scale integrated genome graph browser"
            },
            "pmcid": "PMC6833150",
            "pmid": "31690272"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
