
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://code.google.com/p/mzq-lib/"
        }
    ],
    "documentation": [
        {
            "type": "Training material",
            "url": "https://github.com/HUPO-PSI/mzQuantML/tree/master/examples/version1.0"
        },
        {
            "type": "General",
            "url": "https://github.com/HUPO-PSI/mzQuantML/raw/master/documentation/version1.0/TwentyMinuteGuideToMzQuantML.docx"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Proteomics experiment",
                "uri": "http://edamontology.org/topic_3520"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mzqlibrary-java-library-supporting-the-hupo-psi-quantitative-proteomics-standard.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim.The mzQuantML standard has been developed by the Proteomics Standards Initiative for capturing, archiving and exchanging quantitative proteomic data, derived from mass spectrometry. It is a rich XML-based format, capable of representing data about two-dimensional features from LC-MS data, and peptides, proteins or groups of proteins that have been quantified from multiple samples. In this article we report the development of an open source Java-based library of routines for mzQuantML, called the mzqLibrary, and associated software for visualising data called the mzqViewer. The mzqLibrary contains routines for mapping (peptide) identifications on quantified features, inference of protein (group)-level quantification values from peptide-level values, normalisation and basic statistics for differential expression. These routines can be accessed via the command line, via a Java programming interface access or a basic graphical user interface. The mzqLibrary also contains several file format converters, including import converters (to mzQuantML) from OpenMS, Progenesis LC-MS and MaxQuant, and exporters (from mzQuantML) to other standards or useful formats (mzTab, HTML, csv). The mzqViewer contains in-built routines for viewing the tables of data (about features, peptides or proteins), and connects to the R statistical library for more advanced plotting options. The mzqLibrary and mzqViewer packages are available from https://code.google.com/p/mzq-lib/.",
            "authors": [
                "Qi D.",
                "Zhang H.",
                "Fan J.",
                "Perkins S.",
                "Pisconti A.",
                "Simpson D.M.",
                "Bessant C.",
                "Hubbard S.",
                "Jones A.R."
            ],
            "cit_count": 4,
            "journal": "Proteomics",
            "pmid": "26037908",
            "title": "The mzqLibrary - An open source Java library supporting the HUPO-PSI quantitative proteomics standard",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mzqlibrary",
        "biotoolsID": "mzqlibrary",
        "description": "XML-based format that captures extensive information from quantitative proteomics experiments.This library project intends to develop a set of easy-to-use post-processing APIs/applications to facilitate utilizing the standard in the field.",
        "homepage": "http://www.psidev.info/mzquantml",
        "name": "mzqLibrary"
    }
}