{
    "additionDate": "2017-01-17T15:02:40Z",
    "biotoolsCURIE": "biotools:snm",
    "biotoolsID": "snm",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jstorey@princeton.edu",
            "name": "John D. Storey",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Modeling strategy to normalize high-throughput genomic data, converting them into either biological variables that represent the target of the statistical analysis, or adjustment variables that represent factors arising from the experimental or biological setting the data is drawn from. This approach models all study-specific variables simultaneously in order to more accurately characterize the biological or clinical variables of interest.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/snm.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/snm_1.22.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/snm.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-29T14:39:15Z",
    "license": "GPL-3.0",
    "name": "snm",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq118",
            "metadata": {
                "abstract": "Motivation: A major challenge in utilizing microarray technologies to measure nucleic acid abundances is 'normalization', the goal of which is to separate biologically meaningful signal from other confounding sources of signal, often due to unavoidable technical factors. It is intuitively clear that true biological signal and confounding factors need to be simultaneously considered when performing normalization. However, the most popular normalization approaches do not utilize what is known about the study, both in terms of the biological variables of interest and the known technical factors in the study, such as batch or array processing date. Results: We show here that failing to include all study-specific biological and technical variables when performing normalization leads to biased downstream analyses. We propose a general normalization framework that fits a study-specific model employing every known variable that is relevant to the expression study. The proposed method is generally applicable to the full range of existing probe designs, as well as to both single-channel and dual-channel arrays. We show through real and simulated examples that the method has favorable operating characteristics in comparison to some of the most highly used normalization methods. Availability: An R package called snm implementing the methodology will be made available from Bioconductor (http://bioconductor.org). Contact: jstorey@princeton.edu. Supplementary information: Supplementary data are available at Bioinformatics online. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Mecham B.H."
                    },
                    {
                        "name": "Nelson P.S."
                    },
                    {
                        "name": "Storey J.D."
                    }
                ],
                "citationCount": 67,
                "date": "2010-03-31T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Supervised normalization of microarrays"
            },
            "pmcid": "PMC2865860",
            "pmid": "20363728",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1,
    "version": [
        "1.22.0"
    ]
}