{
    "accessibility": "Open access",
    "additionDate": "2021-11-28T13:23:47.673579Z",
    "biotoolsCURIE": "biotools:fm-track",
    "biotoolsID": "fm-track",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "msacks@oden.utexas.edu",
            "name": "Michael S. Sacks",
            "typeEntity": "Person"
        }
    ],
    "description": "A fiducial marker tracking software for studying cell mechanics in a three-dimensional environment.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/elejeune11/FM-Track",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-28T13:24:24.509566Z",
    "license": "MIT",
    "name": "FM-Track",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.SOFTX.2020.100417",
            "metadata": {
                "abstract": "© 2020 The AuthorsTracking the deformation of fiducial markers in the vicinity of living cells embedded in compliant synthetic or biological gels is a powerful means to study cell mechanics and mechanobiology in three-dimensional environments. However, current approaches to track and quantify three-dimensional (3D) fiducial marker displacements remain ad-hoc, can be difficult to implement, and may not produce reliable results. Herein, we present a compact software package entitled “FM-Track,” written in the popular Python language, to facilitate feature-based particle tracking tailored for 3D cell micromechanical environment studies. FM-Track contains functions for pre-processing images, running fiducial marker tracking, and post-processing and visualization. FM-Track can thus aid the study of cellular mechanics and mechanobiology by providing an extensible software platform to more reliably extract complex local 3D cell contractile information in transparent compliant gel systems.",
                "authors": [
                    {
                        "name": "Khang A."
                    },
                    {
                        "name": "Lejeune E."
                    },
                    {
                        "name": "Sacks M.S."
                    },
                    {
                        "name": "Sansom J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "SoftwareX",
                "title": "FM-Track: A fiducial marker tracking software for studying cell mechanics in a three-dimensional environment"
            },
            "pmcid": "PMC8291167",
            "pmid": "34291145"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
