{
    "accessibility": "Open access",
    "additionDate": "2022-06-08T13:54:53.763258Z",
    "biotoolsCURIE": "biotools:treesist-tb",
    "biotoolsID": "treesist-tb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Taane.clark@lshtm.ac.uk",
            "name": "Taane G. Clark",
            "typeEntity": "Person"
        },
        {
            "name": "Jody Phelan"
        },
        {
            "name": "Luigi Palla"
        }
    ],
    "description": "A modified decision tree approach to improve the prediction and mutation discovery for drug resistance in Mycobacterium tuberculosis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WDee/Treesist-TB",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-06-08T13:54:53.765907Z",
    "license": "Not licensed",
    "name": "Treesist-TB",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12864-022-08291-4",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Drug resistant Mycobacterium tuberculosis is complicating the effective treatment and control of tuberculosis disease (TB). With the adoption of whole genome sequencing as a diagnostic tool, machine learning approaches are being employed to predict M. tuberculosis resistance and identify underlying genetic mutations. However, machine learning approaches can overfit and fail to identify causal mutations if they are applied out of the box and not adapted to the disease-specific context. We introduce a machine learning approach that is customized to the TB setting, which extracts a library of genomic variants re-occurring across individual studies to improve genotypic profiling. Results: We developed a customized decision tree approach, called Treesist-TB, that performs TB drug resistance prediction by extracting and evaluating genomic variants across multiple studies. The application of Treesist-TB to rifampicin (RIF), isoniazid (INH) and ethambutol (EMB) drugs, for which resistance mutations are known, demonstrated a level of predictive accuracy similar to the widely used TB-Profiler tool (Treesist-TB vs. TB-Profiler tool: RIF 97.5% vs. 97.6%; INH 96.8% vs. 96.5%; EMB 96.8% vs. 95.8%). Application of Treesist-TB to less understood second-line drugs of interest, ethionamide (ETH), cycloserine (CYS) and para-aminosalisylic acid (PAS), led to the identification of new variants (52, 6 and 11, respectively), with a high number absent from the TB-Profiler library (45, 4, and 6, respectively). Thereby, Treesist-TB had improved predictive sensitivity (Treesist-TB vs. TB-Profiler tool: PAS 64.3% vs. 38.8%; CYS 45.3% vs. 30.7%; ETH 72.1% vs. 71.1%). Conclusion: Our work reinforces the utility of machine learning for drug resistance prediction, while highlighting the need to customize approaches to the disease-specific context. Through applying a modified decision learning approach (Treesist-TB) across a range of anti-TB drugs, we identified plausible resistance-encoding genomic variants with high predictive ability, whilst potentially overcoming the overfitting challenges that can affect standard machine learning applications.",
                "authors": [
                    {
                        "name": "Campino S."
                    },
                    {
                        "name": "Clark T.G."
                    },
                    {
                        "name": "Deelder W."
                    },
                    {
                        "name": "Napier G."
                    },
                    {
                        "name": "Palla L."
                    },
                    {
                        "name": "Phelan J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A modified decision tree approach to improve the prediction and mutation discovery for drug resistance in Mycobacterium tuberculosis"
            },
            "pmcid": "PMC8753810",
            "pmid": "35016609"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
