{
    "accessibility": "Open access",
    "additionDate": "2021-11-22T14:11:32.189077Z",
    "biotoolsCURIE": "biotools:virtual_herbarium_altb",
    "biotoolsID": "virtual_herbarium_altb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vaganov_vav@mail.ru",
            "name": "Aleksey V. Vaganov",
            "orcidid": "https://orcid.org/0000-0002-7584-5150",
            "typeEntity": "Person"
        },
        {
            "name": "Aleksey A. Kechaykin",
            "orcidid": "https://orcid.org/0000-0002-0754-4698"
        },
        {
            "name": "Alena A. Alekseevna Shibanova",
            "orcidid": "https://orcid.org/0000-0002-5210-1431"
        },
        {
            "name": "Petr A. Kosachev",
            "orcidid": "https://orcid.org/0000-0002-4087-6336"
        }
    ],
    "description": "The Virtual Herbarium ALTB (Russian interface ) is the largest digital collection of plants from the transboundary territory of the Altai Mountain Country",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://altb.asu.ru",
    "lastUpdate": "2021-11-22T14:11:32.191638Z",
    "name": "Virtual Herbarium ALTB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3897/BDJ.9.E67616",
            "metadata": {
                "abstract": "© 2021. Vaganov A et al. All Rights Reserved.Background The herbarium of the South-Siberian Botanical Garden of Altai State University (ALTB) houses the largest collection of plants from the Altai Mountain Country (AMC), an area that extends across Russia, Kazakhstan, Mongolia and China. The collection of ALTB includes more than 450,00 specimens, making it the seventh largest in Russia and the fourth largest amongst Russian university herbaria. Altai State University (ASU), the home of ALTB, is one of the most important centres of academic education and research in Siberia and the Russian Far East. It is a sociocultural centre that provides a distinguished learning environment for undergraduate and graduate students in many scholarly and professional fields, meeting the needs of today's knowledge-based post-industrial society and contributing to regional development. It actively promotes international cooperation and strategic collaboration amongst countries of the AMC in the fields of science, education and culture. In particular, the activities of the South-Siberian Botanical Garden include: development of measures to protect rare and endangered plant species, research on the flora and vegetation of the AMC, preparation and publication of a multi-volume work \"Flora Altaica\", monographic study of individual plant groups, conducting laboratory classes, summer practicals and special courses. The main purpose of this article is to attract the attention of the scientific community to the botanical research of transboundary territory of the Altai Mountain Country (Russia, Kazakhstan, China and Mongolia) and to the future development of digital plant collections in partnership with Global Biodiversity Information Facility (GBIF). New information The Virtual Herbarium ALTB (Russian interface - altb.asu.ru) is the largest digital collection of plants from the transboundary territory of the Altai Mountain Country and the main source of primary material for the \"Flora Altaica\" project (http://altaiflora.asu.ru/en/). Since 2017, when Altai State University became a GBIF data publisher, data from the Virtual Herbarium ALTB has been exported to the dataset \"Virtual Herbarium ALTB (South-Siberian Botanical Garden)\" in GBIF. Currently, it includes images and data from 22,466 vascular plants, of which 67% have geographic coordinates (accessed on 30.03.2021). Most of the specimens have been collected since 1977, with the most intensive collecting years being 1995-2008. In 2019, the label-data table of the Virtual Herbarium ALTB was modified to bring it into conformity with the Darwin Core specification (http://altb.asu.ru/). This effectively solved the major impediment to sharing plant diversity data from the AMC and adjacent regions in a multilingual environment.",
                "authors": [
                    {
                        "name": "Antonyuk E.V."
                    },
                    {
                        "name": "Batkin A.A."
                    },
                    {
                        "name": "Belkin D.L."
                    },
                    {
                        "name": "Dmitriev D.A."
                    },
                    {
                        "name": "Gudkova P.D."
                    },
                    {
                        "name": "Kasatkin D.E."
                    },
                    {
                        "name": "Kechaykin A.A."
                    },
                    {
                        "name": "Kopytina T.M."
                    },
                    {
                        "name": "Kosachev P.A."
                    },
                    {
                        "name": "Medvedeva K.E."
                    },
                    {
                        "name": "Shalimov A.P."
                    },
                    {
                        "name": "Shibanova A.A."
                    },
                    {
                        "name": "Shmakov A.I."
                    },
                    {
                        "name": "Sinitsyna T.A."
                    },
                    {
                        "name": "Smirnov S.V."
                    },
                    {
                        "name": "Usik N.A."
                    },
                    {
                        "name": "Vaganov A.V."
                    },
                    {
                        "name": "Zaikov V.F."
                    },
                    {
                        "name": "Zholnerova E.A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Biodiversity Data Journal",
                "title": "Virtual Herbarium ALTB: collection of vascular plants of the Altai Mountain Country"
            },
            "pmcid": "PMC8292289",
            "pmid": "34316271"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1
}
