{
    "additionDate": "2021-01-18T11:10:26Z",
    "biotoolsCURIE": "biotools:openpepxl",
    "biotoolsID": "openpepxl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eugen.netz@tuebingen.mpg.de",
            "name": "Eugen Netz",
            "typeEntity": "Person"
        },
        {
            "email": "oliver.kohlbacher@uni-tuebingen.de",
            "name": "Oliver Kohlbacher",
            "typeEntity": "Person"
        }
    ],
    "description": "An Open-Source Tool for Sensitive Identification of Cross-Linked Peptides in XL-MS.\n\nProtein-Protein Cross-Linking (OpenPepXL) – OpenMS.\n\nOpenPepXL is a protein-protein cross-link identification tool implemented in C++ as part of OpenMS. It works with all uncleavable labeled and label-free cross-linkers but not (yet) with cleavable ones.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://openms.org/openpepxl",
    "lastUpdate": "2021-03-15T09:24:27Z",
    "license": "BSD-3-Clause",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.openms.de/openpepxl"
        }
    ],
    "name": "OpenPepXL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1074/MCP.TIR120.002186",
            "metadata": {
                "abstract": "© 2020 Netz et al. Published under exclusive license by The American Society for Biochemistry and Molecular Biology, Inc.Cross-linking MS (XL-MS) has been recognized as an effective source of information about protein structures and interactions. In contrast to regular peptide identification, XL-MS has to deal with a quadratic search space, where peptides from every protein could potentially be cross-linked to any other protein. To cope with this search space, most tools apply different heuristics for search space reduction. We introduce a new open-source XL-MS database search algorithm, OpenPepXL, which offers increased sensitivity compared with other tools. OpenPepXL searches the full search space of an XL-MS experiment without using heuristics to reduce it. Because of efficient data structures and built-in parallelization OpenPepXL achieves excellent runtimes and can also be deployed on large compute clusters and cloud services while maintaining a slim memory footprint. We compared OpenPepXL to several other commonly used tools for identification of noncleavable labeled and label-free cross-linkers on a diverse set of XL-MS experiments. In our first comparison, we used a data set from a fraction of a cell lysate with a protein database of 128 targets and 128 decoys. At 5% FDR, OpenPepXL finds from 7% to over 50% more unique residue pairs (URPs) than other tools. On data sets with available high-resolution structures for cross-link validation OpenPepXL reports from 7% to over 40% more structurally validated URPs than other tools. Additionally, we used a synthetic peptide data set that allows objective validation of cross-links without relying on structural information and found that OpenPepXL reports at least 12% more validated URPs than other tools. It has been built as part of the OpenMS suite of tools and supports Windows, macOS, and Linux operating systems. OpenPepXL also supports the MzIdentML 1.2 format for XL-MS identification results. It is freely available under a three-clause BSD license at https://openms.org/openpepxl.",
                "authors": [
                    {
                        "name": "Netz E."
                    },
                    {
                        "name": "Dijkstra T.M.H."
                    },
                    {
                        "name": "Sachsenberg T."
                    },
                    {
                        "name": "Zimmermann L."
                    },
                    {
                        "name": "Walzer M."
                    },
                    {
                        "name": "Monecke T."
                    },
                    {
                        "name": "Ficner R."
                    },
                    {
                        "name": "Dybkov O."
                    },
                    {
                        "name": "Urlaub H."
                    },
                    {
                        "name": "Kohlbacher O."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "OpenPepXL: An Open-Source Tool for Sensitive Identification of Cross-Linked Peptides in XL-MS"
            },
            "pmcid": "PMC7710140",
            "pmid": "33067342"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}