{
    "accessibility": "Open access",
    "additionDate": "2021-11-15T20:40:13.736177Z",
    "biotoolsCURIE": "biotools:tcr_epItope_bimodal_attention_networks",
    "biotoolsID": "tcr_epItope_bimodal_attention_networks",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jannis Born"
        },
        {
            "name": "Anna Weber",
            "orcidid": "https://orcid.org/0000-0003-3200-8210",
            "typeEntity": "Person"
        },
        {
            "name": "María Rodriguez Martínez",
            "typeEntity": "Person"
        }
    ],
    "description": "T-cell receptor specificity prediction with bimodal attention networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PaccMann/TITAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-15T20:40:13.738624Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/PaccMann/TITAN"
        }
    ],
    "name": "TITAN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB294",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press.Motivation: The activity of the adaptive immune system is governed by T-cells and their specific T-cell receptors (TCR), which selectively recognize foreign antigens. Recent advances in experimental techniques have enabled sequencing of TCRs and their antigenic targets (epitopes), allowing to research the missing link between TCR sequence and epitope binding specificity. Scarcity of data and a large sequence space make this task challenging, and to date only models limited to a small set of epitopes have achieved good performance. Here, we establish a k-nearest-neighbor (K-NN) classifier as a strong baseline and then propose Tcr epITope bimodal Attention Networks (TITAN), a bimodal neural network that explicitly encodes both TCR sequences and epitopes to enable the independent study of generalization capabilities to unseen TCRs and/or epitopes. Results: By encoding epitopes at the atomic level with SMILES sequences, we leverage transfer learning and data augmentation to enrich the input data space and boost performance. TITAN achieves high performance in the prediction of specificity of unseen TCRs (ROC-AUC 0.87 in 10-fold CV) and surpasses the results of the current state-of-the-art (ImRex) by a large margin. Notably, our Levenshtein-based K-NN classifier also exhibits competitive performance on unseen TCRs. While the generalization to unseen epitopes remains challenging, we report two major breakthroughs. First, by dissecting the attention heatmaps, we demonstrate that the sparsity of available epitope data favors an implicit treatment of epitopes as classes. This may be a general problem that limits unseen epitope performance for sufficiently complex models. Second, we show that TITAN nevertheless exhibits significantly improved performance on unseen epitopes and is capable of focusing attention on chemically meaningful molecular structures.",
                "authors": [
                    {
                        "name": "Born J."
                    },
                    {
                        "name": "Rodriguez Martinez M."
                    },
                    {
                        "name": "Weber A."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TITAN: T-cell receptor specificity prediction with bimodal attention networks"
            },
            "pmcid": "PMC8275323",
            "pmid": "34252922"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
