{
    "accessibility": "Open access",
    "additionDate": "2022-05-27T13:48:52.379855Z",
    "biotoolsCURIE": "biotools:hla-epi",
    "biotoolsID": "hla-epi",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pierre-antoine.gourraud@univ-nantes.fr",
            "name": "Pierre-Antoine Gourraud"
        },
        {
            "email": "nicolas.vince@univ-nantes.fr",
            "name": "Nicolas Vince",
            "orcidid": "https://orcid.org/0000-0002-3767-6210"
        },
        {
            "name": "Estelle Geffard"
        }
    ],
    "description": "A new EPIsode in exploring donor/recipient epitopic compatibilities.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://hla.univ-nantes.fr",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-05-27T13:48:52.383993Z",
    "name": "HLA-Epi",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1111/TAN.14505",
            "metadata": {
                "abstract": "© 2021 The Authors. HLA: Immune Response Genetics published by John Wiley & Sons Ltd.The HLA system plays a pivotal role both in transplantation and immunology. While classical HLA genotypes matching is made at the allelic level, recent progresses were developed to explore antibody–antigen recognition by studying epitopes. Donor to recipient matching at the epitopic level is becoming a trending topic in the transplantation research field because anti-HLA antibodies are epitope-specific rather than allele-specific. Indeed, different HLA alleles often share common epitopes. We present the HLA-Epi tool (hla.univ-nantes.fr) to study an HLA genotype at the epitope level. Using the international HLA epitope registry (Epregistry.com.br) as a reference, we developed HLA-Epi to easily determine epitopic and allelic compatibility levels between several HLA genotypes. The epitope database covers the most common HLA alleles (N = 2976 HLA alleles), representing more than 99% of the total observed frequency of HLA alleles. The freely accessible web tool HLA-Epi calculates an epitopic mismatch load between different sets of potential recipient-donor pairs at different resolution levels. We have characterized the epitopic mismatches distribution in a cohort of more than 10,000 kidney transplanted pairs from European ancestry, which showed low number of epitopic mismatches: 56.9 incompatibilities on average. HLA-Epi allows the exploration of epitope pairing matching to better understand epitopes contribution to immune responses regulation, particularly during transplantation. This free and ready-to-use bioinformatics tool not only addresses limitations of other related tools, but also offers a cost-efficient and reproducible strategy to analyze HLA epitopes as an alternative to HLA allele compatibility. In the future, this could improve sensitization prevention for allograft allocation decisions and reduce the risk of alloreactivity.",
                "authors": [
                    {
                        "name": "Boussamet L."
                    },
                    {
                        "name": "Delbos F."
                    },
                    {
                        "name": "Geffard E."
                    },
                    {
                        "name": "Gourraud P.-A."
                    },
                    {
                        "name": "Limou S."
                    },
                    {
                        "name": "Vince N."
                    },
                    {
                        "name": "Walencik A."
                    }
                ],
                "date": "2022-02-01T00:00:00Z",
                "journal": "HLA",
                "title": "HLA-EPI: A new EPIsode in exploring donor/recipient epitopic compatibilities"
            },
            "pmid": "34862850"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}
