{
    "additionDate": "2021-01-18T12:02:58Z",
    "biotoolsCURIE": "biotools:xg-m7g",
    "biotoolsID": "xg-m7g",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cangzhijia@dlmu.edu.cn",
            "name": "Cangzhi Jia",
            "typeEntity": "Person"
        },
        {
            "email": "fuyi.li@monash.edu",
            "name": "Fuyi Li",
            "typeEntity": "Person"
        },
        {
            "email": "jiangning.song@monash.edu",
            "name": "Jiangning Song",
            "typeEntity": "Person"
        }
    ],
    "description": "An Interpretable Prediction Model for Identifying N<sup>7</sup>-Methylguanosine Sites Based on XGBoost and SHAP.\n\nRecent studies have increasingly shown that the chemical modification of mRNA plays an important role in the regulation of gene expression. N<sup>7< sup>-methylguanosine (m7G) is a type of positively-charged mRNA modification that plays an essential role for efficient gene expression and cell viability. However, the research on m7G has received little attention to date. Bioinformatics tools can be applied as auxiliary methods to identify m7G sites in transcriptomes. In this study, we develop a novel interpretable machine learning-based approach termed XG-m7G for the differentiation of m7G sites using the XGBoost algorithm and six different types of sequence-encoding schemes. Both 10-fold and jackknife cross-validation tests indicate that XG-m7G outperforms iRNA-m7G",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "http://flagship.erc.monash.edu/XG-m7G/",
    "lastUpdate": "2021-03-18T11:13:58Z",
    "name": "XG-m7G",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.OMTN.2020.08.022",
            "metadata": {
                "abstract": "© 2020 The Author(s)Recent studies have increasingly shown that the chemical modification of mRNA plays an important role in the regulation of gene expression. N7-methylguanosine (m7G) is a type of positively-charged mRNA modification that plays an essential role for efficient gene expression and cell viability. However, the research on m7G has received little attention to date. Bioinformatics tools can be applied as auxiliary methods to identify m7G sites in transcriptomes. In this study, we develop a novel interpretable machine learning-based approach termed XG-m7G for the differentiation of m7G sites using the XGBoost algorithm and six different types of sequence-encoding schemes. Both 10-fold and jackknife cross-validation tests indicate that XG-m7G outperforms iRNA-m7G. Moreover, using the powerful SHAP algorithm, this new framework also provides desirable interpretations of the model performance and highlights the most important features for identifying m7G sites. XG-m7G is anticipated to serve as a useful tool and guide for researchers in their future studies of mRNA modification sites. © 2020 The Author(s)N7-methylguanosine modification of mRNA plays a key role in the regulation of gene expression. In this study, we developed a computational model termed XG-m7G based on XGBoost and SHAP to identify N7-methylguanosine sites from sequence information. This will help the discovery of N7-methylguansine and its genetic function.",
                "authors": [
                    {
                        "name": "Bi Y."
                    },
                    {
                        "name": "Ge Z."
                    },
                    {
                        "name": "Jia C."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Xiang D."
                    }
                ],
                "citationCount": 9,
                "date": "2020-12-04T00:00:00Z",
                "journal": "Molecular Therapy - Nucleic Acids",
                "title": "An Interpretable Prediction Model for Identifying N7-Methylguanosine Sites Based on XGBoost and SHAP"
            },
            "pmcid": "PMC7533297",
            "pmid": "33230441"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
