{
    "additionDate": "2019-11-14T19:31:35Z",
    "biotoolsCURIE": "biotools:bioseq-analysis",
    "biotoolsID": "bioseq-analysis",
    "confidence_flag": "tool",
    "description": "an updated platform for analyzing DNA, RNA and protein sequences at sequence level and residue level based on machine learning approaches | BioSeq-Analysis2.0: an updated platform for analyzing DNA, RNA, and protein sequences at sequence level and residue level based on machine learning approaches | : Home : Server : Tutorial : Document : Download : Citation : Contact us : | Established in 2017, the platform BioSeq-Analysis (1) is for the first time proposed to analyze various biological sequences at sequence-level based on machine learning approaches, which can do the following main steps automatically: feature extraction, predictor construction, and performance evaluation. BioSeq-Analysis has been increasingly and extensively applied in many areas of computational biology",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://bliulab.net/BioSeq-Analysis2.0/download/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Nucleic acid folding analysis",
                    "uri": "http://edamontology.org/operation_0279"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/BioSeq-Analysis2.0/",
    "lastUpdate": "2020-12-09T14:07:07Z",
    "name": "BioSeq-Analysis 2.0",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ740",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.As the first web server to analyze various biological sequences at sequence level based on machine learning approaches, many powerful predictors in the field of computational biology have been developed with the assistance of the BioSeq-Analysis. However, the BioSeq-Analysis can be only applied to the sequence-level analysis tasks, preventing its applications to the residue-level analysis tasks, and an intelligent tool that is able to automatically generate various predictors for biological sequence analysis at both residue level and sequence level is highly desired. In this regard, we decided to publish an important updated server covering a total of 26 features at the residue level and 90 features at the sequence level called BioSeq-Analysis2.0 (http://bliulab.net/BioSeq-Analysis2.0/), by which the users only need to upload the benchmark dataset, and the BioSeq-Analysis2.0 can generate the predictors for both residue-level analysis and sequence-level analysis tasks. Furthermore, the corresponding stand-alone tool was also provided, which can be downloaded from http://bliulab.net/BioSeq-Analysis2.0/download/. To the best of our knowledge, the BioSeq-Analysis2.0 is the first tool for generating predictors for biological sequence analysis tasks at residue level. Specifically, the experimental results indicated that the predictors developed by BioSeq-Analysis2.0 can achieve comparable or even better performance than the existing state-of-the-art predictors.",
                "authors": [
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 108,
                "date": "2019-11-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioSeq-Analysis2.0: An updated platform for analyzing DNA, RNA and protein sequences at sequence level and residue level based on machine learning approaches"
            },
            "pmid": "31504851"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
