{
    "additionDate": "2020-01-09T18:29:31Z",
    "biotoolsCURIE": "biotools:demo_m",
    "biotoolsID": "demo_m",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "zdenek.sedlacek@lfmotol.cuni.cz",
            "name": "Zdenek Sedlacek",
            "orcidid": "https://orcid.org/0000-0001-6575-9163",
            "typeEntity": "Person"
        }
    ],
    "description": "development and evaluation of an e-learning application for medical molecular genetics.\n\nPRACTICAL \"GENOMICS AND BIOINFORMATICS - SINGLE-GENE ANALYSIS\".\n\nAuthors: Kamila Procházková, Zdeněk Sedláček.\n\nDepartment of Biology and Medical Genetics,.\n\nCharles University 2nd Faculty of Medicine, Prague.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Teaching difficult topic using problem-based concept resembling computer game'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://medbio.lf2.cuni.cz/demo_m/",
    "lastUpdate": "2020-01-09T18:29:31Z",
    "name": "demo_m",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12909-019-1817-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Genetic testing rapidly penetrates into all medical specialties and medical students must acquire skills in this area. However, many of them consider it difficult. Furthermore, many find these topics less appealing and not connected to their future specialization in different fields of clinical medicine. Student-centred strategies such as problem-based learning, gamification and the use of real data can increase the appeal of a difficult topic such as genetic testing, a field at the crossroads of genetics, molecular biology and bioinformatics. Methods: We designed an electronic teaching application which students registered in the undergraduate Medical Biology course can access online. A study was carried out to assess the influence of implementation of the new method. We performed pretest/posttest evaluation and analyzed the results using the sign test with median values. We also collected students' personal comments. Results: The newly developed interactive application simulates the process of molecular genetic diagnostics of a hereditary disorder in a family. Thirteen tasks guide students through clinical and laboratory steps needed to reach the final diagnosis. Genetics and genomics are fields strongly dependent on electronic databases and computer-based data analysis tools. The tasks employ publicly available internet bioinformatic resources used routinely in medical genetics departments worldwide. Authenticity is assured by the use of modified and de-identified clinical and laboratory data from real families analyzed in our previous research projects. Each task contains links to databases and data processing tools needed to solve the task, and an answer box. If the entered answer is correct, the system allows the user to proceed to the next task. The solving of consecutive tasks arranged into a single narrative resembles a computer game, making the concept appealing. There was a statistically significant improvement of knowledge and skills after the practical class, and most comments on the application were positive. A demo version is available at https://medbio.lf2.cuni.cz/demo-m/. Full version is available on request from the authors. Conclusions: Our concept proved to be appealing to the students and effective in teaching medical molecular genetics. It can be modified for training in the use of electronic information resources in other medical specialties.",
                "authors": [
                    {
                        "name": "Prochazkova K."
                    },
                    {
                        "name": "Novotny P."
                    },
                    {
                        "name": "Hancarova M."
                    },
                    {
                        "name": "Prchalova D."
                    },
                    {
                        "name": "Sedlacek Z."
                    }
                ],
                "date": "2019-10-24T00:00:00Z",
                "journal": "BMC Medical Education",
                "title": "Teaching a difficult topic using a problem-based concept resembling a computer game: Development and evaluation of an e-learning application for medical molecular genetics"
            },
            "pmcid": "PMC6813102",
            "pmid": "31651301"
        }
    ],
    "topic": [
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}