{
    "additionDate": "2024-05-24T08:52:02.148415Z",
    "biotoolsCURIE": "biotools:rt_transformer",
    "biotoolsID": "rt_transformer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liweihua@ynu.edu.cn",
            "name": "WeiHua Li",
            "orcidid": "https://orcid.org/0000-0002-9060-382X",
            "typeEntity": "Person"
        }
    ],
    "description": "Retention time prediction for metabolite annotation to assist in metabolite identification.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://huggingface.co/spaces/Xue-Jun/RT-Transformer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:56:25.664221Z",
    "name": "RT-Transformer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btae084",
            "metadata": {
                "abstract": "Motivation: Liquid chromatography retention times prediction can assist in metabolite identification, which is a critical task and challenge in nontargeted metabolomics. However, different chromatographic conditions may result in different retention times for the same metabolite. Current retention time prediction methods lack sufficient scalability to transfer from one specific chromatographic method to another. Results: Therefore, we present RT-Transformer, a novel deep neural network model coupled with graph attention network and 1D-Transformer, which can predict retention times under any chromatographic methods. First, we obtain a pre-trained model by training RT-Transformer on the large small molecule retention time dataset containing 80 038 molecules, and then transfer the resulting model to different chromatographic methods based on transfer learning. When tested on the small molecule retention time dataset, as other authors did, the average absolute error reached 27.30 after removing not retained molecules. Still, it reached 33.41 when no samples were removed. The pretrained RT-Transformer was further transferred to 5 datasets corresponding to different chromatographic conditions and fine-tuned. According to the experimental results, RT-Transformer achieves competitive performance compared to state-of-the-art methods. In addition, RT-Transformer was applied to 41 external molecular retention time datasets. Extensive evaluations indicate that RT-Transformer has excellent scalability in predicting retention times for liquid chromatography and improves the accuracy of metabolite identification. Availability and implementation: The source code for the model is available at https://github.com/01dadada/RT-Transformer. The web server is available at https://huggingface.co/spaces/Xue-Jun/RT-Transformer.",
                "authors": [
                    {
                        "name": "Ji H."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Wang B."
                    },
                    {
                        "name": "Xue J."
                    }
                ],
                "citationCount": 3,
                "date": "2024-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RT-Transformer: retention time prediction for metabolite annotation to assist in metabolite identification"
            },
            "pmcid": "PMC10914443",
            "pmid": "38402516"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
