{
    "additionDate": "2021-01-18T08:57:29Z",
    "biotoolsCURIE": "biotools:acrfinder",
    "biotoolsID": "acrfinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yyin@unl.edu",
            "name": "Yanbin Yin",
            "orcidid": "https://orcid.org/0000-0001-7667-881X",
            "typeEntity": "Person"
        }
    ],
    "description": "AcrFinder is a tool used to identify Anti-CRISPR proteins (Acr) using both sequence homology and guilt-by-association approaches.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Operon drawing",
                    "uri": "http://edamontology.org/operation_0579"
                },
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "http://bcb.unl.edu/AcrFinder/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-21T12:39:58Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/HaidYi/acrfinder"
        }
    ],
    "name": "AcrFinder",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA351",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited. For commercial re-use, please contact journals.permissions@oup.comAnti-CRISPR (Acr) proteins encoded by (pro)phages/(pro)viruses have a great potential to enable a more controllable genome editing. However, genome mining new Acr proteins is challenging due to the lack of a conserved functional domain and the low sequence similarity among experimentally characterized Acr proteins. We introduce here AcrFinder, a web server (http://bcb.unl.edu/AcrFinder) that combines three well-accepted ideas used by previous experimental studies to pre-screen genomic data for Acr candidates. These ideas include homology search, guilt-by-association (GBA), and CRISPR-Cas self-targeting spacers. Compared to existing bioinformatics tools, AcrFinder has the following unique functions: (i) it is the first online server specifically mining genomes for Acr-Aca operons; (ii) it provides a most comprehensive Acr and Aca (Acr-associated regulator) database (populated by GBA-based Acr and Aca datasets); (iii) it combines homology-based, GBA-based, and self-targeting approaches in one software package; and (iv) it provides a user-friendly web interface to take both nucleotide and protein sequence files as inputs, and output a result page with graphic representation of the genomic contexts of Acr-Aca operons. The leave-one-out cross-validation on experimentally characterized Acr-Aca operons showed that AcrFinder had a 100% recall. AcrFinder will be a valuable web resource to help experimental microbiologists discover new Anti-CRISPRs.",
                "authors": [
                    {
                        "name": "Yi H."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Yang B."
                    },
                    {
                        "name": "Gomez J."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Yin Y."
                    }
                ],
                "citationCount": 4,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AcrFinder: Genome mining anti-CRISPR operons in prokaryotes and their viruses"
            },
            "pmcid": "PMC7319584",
            "pmid": "32402073"
        }
    ],
    "toolType": [
        "Web application",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}