{
    "additionDate": "2020-01-14T20:09:28Z",
    "biotoolsCURIE": "biotools:Ex-DOMAIN",
    "biotoolsID": "Ex-DOMAIN",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "yo_narusaka@bio-ribs.com",
            "name": "Yoshihiro Narusaka",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficient identification of NLR by using a genome-wide protein domain and motif survey program, Ex-DOMAIN.\n\nGenomic and amino acid sequences of organisms are freely available from various public databases. We designed a genome-wide survey program, named \"Ex-DOMAIN\" (exhaustive domain and motif annotator using InterProScan), of protein domains and motifs to aid in the identification and characterization of proteins by using the InterProScan sequence analysis application, which can display information and annotations of targeted proteins and genes, conserved protein domains and motifs, chromosomal locations, and structural diversities of target proteins.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'cucumber'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31819721",
    "lastUpdate": "2020-01-14T20:09:28Z",
    "name": "Ex-DOMAIN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.5511/PLANTBIOTECHNOLOGY.18.0418A",
            "metadata": {
                "abstract": "© 2018 The Japanese Society for Plant Cell and Molecular Biology.Genomic and amino acid sequences of organisms are freely available from various public databases. We designed a genome-wide survey program, named “Ex-DOMAIN” (exhaustive domain and motif annotator using InterProScan), of protein domains and motifs to aid in the identification and characterization of proteins by using the InterProScan sequence analysis application, which can display information and annotations of targeted proteins and genes, conserved protein domains and motifs, chromosomal locations, and structural diversities of target proteins. In this study, we indicated the disease resistance genes (proteins) that play an important role in defense against pathogens in Arabidopsis thaliana (thale cress) and Cucumis sativus (cucumber), by searches based on the conserved protein domains, NB-ARC (a nucleotide-binding adaptor shared by the apoptotic protease-activating factor-1, plant resistance proteins, and Caenorhabditis elegans death-4 protein) and C-terminal leucine-rich repeat (LRR), in the nucleotide-binding domain and LRR (NLR) proteins. Our findings suggest that this program will enable searches for various protein domains and motifs in all organisms.",
                "authors": [
                    {
                        "name": "Narusaka M."
                    },
                    {
                        "name": "Yunokawa H."
                    },
                    {
                        "name": "Narusaka Y."
                    }
                ],
                "date": "2018-01-01T00:00:00Z",
                "journal": "Plant Biotechnology",
                "title": "Efficient identification of NLR by using a genome-wide protein domain and motif survey program, Ex-DOMAIN"
            },
            "pmcid": "PMC6879387",
            "pmid": "31819721"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ]
}