{
    "additionDate": "2020-01-14T09:30:07Z",
    "biotoolsCURIE": "biotools:CAGI",
    "biotoolsID": "CAGI",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "dmitrypenzar1996@gmail.com",
            "name": "Dmitry D. Penzar",
            "typeEntity": "Person"
        },
        {
            "email": "vsevolod.makeev@vigg.ru",
            "name": "Vsevolod J. Makeev",
            "typeEntity": "Person"
        },
        {
            "email": "ivan.kulakovskiy@gmail.com",
            "name": "Ivan V. Kulakovskiy",
            "typeEntity": "Person"
        }
    ],
    "description": "The Local Context of Cis-Regulatory Modules Complicates Prediction of Regulatory Variants.\n\nMany problems of modern genetics and functional genomics require the assessment of functional effects of sequence variants, including gene expression changes. Machine learning is considered to be a promising approach for solving this task, but its practical applications remain a challenge due to the insufficient volume and diversity of training data. A promising source of valuable data is a saturation mutagenesis massively parallel reporter assay, which quantitatively measures changes in transcription activity caused by sequence variants. Here, we explore the computational predictions of the effects of individual single-nucleotide variants on gene transcription measured in the massively parallel reporter assays, based on the data from the recent \"Regulation Saturation\" Critical Assessment of Genome Interpretation challenge.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'expression-variants'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/autosomeru_cagi2018/cagi2018_regsat",
    "lastUpdate": "2020-01-14T09:30:07Z",
    "name": "CAGI",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01078",
            "metadata": {
                "abstract": "© 2019 Penzar, Zinkevich, Vorontsov, Sitnik, Favorov, Makeev and Kulakovskiy.Many problems of modern genetics and functional genomics require the assessment of functional effects of sequence variants, including gene expression changes. Machine learning is considered to be a promising approach for solving this task, but its practical applications remain a challenge due to the insufficient volume and diversity of training data. A promising source of valuable data is a saturation mutagenesis massively parallel reporter assay, which quantitatively measures changes in transcription activity caused by sequence variants. Here, we explore the computational predictions of the effects of individual single-nucleotide variants on gene transcription measured in the massively parallel reporter assays, based on the data from the recent “Regulation Saturation” Critical Assessment of Genome Interpretation challenge. We show that the estimated prediction quality strongly depends on the structure of the training and validation data. Particularly, training on the sequence segments located next to the validation data results in the “information leakage” caused by the local context. This information leakage allows reproducing the prediction quality of the best CAGI challenge submissions with a fairly simple machine learning approach, and even obtaining notably better-than-random predictions using irrelevant genomic regions. Validation scenarios preventing such information leakage dramatically reduce the measured prediction quality. The performance at independent regulatory regions entirely excluded from the training set appears to be much lower than needed for practical applications, and even the performance estimation will become reliable only in the future with richer data from multiple reporters. The source code and data are available at https://bitbucket.org/autosomeru_cagi2018/cagi2018_ regsat and https://genomeinterpretation.org/content/expression-variants.",
                "authors": [
                    {
                        "name": "Penzar D.D."
                    },
                    {
                        "name": "Zinkevich A.O."
                    },
                    {
                        "name": "Vorontsov I.E."
                    },
                    {
                        "name": "Sitnik V.V."
                    },
                    {
                        "name": "Favorov A.V."
                    },
                    {
                        "name": "Makeev V.J."
                    },
                    {
                        "name": "Kulakovskiy I.V."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "What do neighbors tell about you: The local context of cis-regulatory modules complicates prediction of regulatory variants"
            },
            "pmcid": "PMC6834773",
            "pmid": "31737053"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}