{
    "additionDate": "2019-11-14T19:38:42Z",
    "biotoolsCURIE": "biotools:FLEXOR",
    "biotoolsID": "FLEXOR",
    "confidence_flag": "high",
    "description": "A support tool for efficient and seamless experiment data processing to evaluate musculo-articular stiffness | FLEXOR is a multiplatform software tool to simplify traditional complex and manual procedures for MAS analysis",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/FlexorSoftware/flexor",
    "lastUpdate": "2019-11-14T19:38:42Z",
    "license": "GPL-3.0",
    "name": "FLEXOR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2019.105048",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Background and objective: The evaluation of musculo-articular stiffness (MAS) is an increasingly demanded procedure with applications in different fields, such as sports performance and lower limbs injury prevention. However, this task is non-automated, time-consuming and error-prone due to manual handling of data streams and files across several software applications. Despite the fact that process automation of validated procedures helps to prevent errors, there is still a lack of easy-to-use tools for analysis, management and visualization of MAS trials. Methods: In the present work a tool called FLEXOR has been developed which applies mathematical methods and novel algorithms to automatically adjust curves of data streams for MAS analysis decreasing substantially time employed and errors. This tool permits to define different adjustment parameters, detect curve peaks and valleys, and display the results on the fly. FLEXOR has been implemented through a component-based software development (CBSD) process. All physiological fundamentals for the biomechanical measurement have been included in the tool developed. To describe the integration of all required components a 4 + 1 view model architecture has been used. The installation guide, the FLEXOR software and some data samples can be found on its GitHub repository (https://github.com/FlexorSoftware/flexor). Results: A multiplatform software tool to simplify traditional complex and manual procedures for MAS analysis is obtained. The tool turns them into a simple all-in-one procedure, reducing processing times from hours to a few minutes. The methodology was tested on multiple datasets generated by previous tools in former procedures as well as on real-time trials in the laboratory, showing identical results. Conclusion: The results show that the developed tool can accomplish an unfilled essential task in the analysis, management and visualization of MAS measurement. The presented software tool empowers analysts to handle the different studies, investigate different parameters related to each experiment and even test with different output parameters in each experiment, enabling real-time trials and shared studies between different analysts.",
                "authors": [
                    {
                        "name": "Paris-Garcia F."
                    },
                    {
                        "name": "Ruiz-Zafra A."
                    },
                    {
                        "name": "Noguera M."
                    },
                    {
                        "name": "Barroso-Caro A."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "FLEXOR: A support tool for efficient and seamless experiment data processing to evaluate musculo-articular stiffness"
            },
            "pmid": "31473443"
        }
    ],
    "topic": [
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}