{
    "additionDate": "2018-07-21T10:03:21Z",
    "biotoolsCURIE": "biotools:qubils-mas",
    "biotoolsID": "qubils-mas",
    "credit": [
        {
            "email": "jricky31@gmail.com",
            "name": "José R. Valdés-Martiní",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Calculation of 2D molecular descriptors based on the bilinear, quadratic and linear algebraic forms. Compute these kinds of indices, applying matrix transformations (simple-stochastic, double-stochastic and mutual probability), cut-offs, local calculations and aggregation operators.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://tomocomd.com/qubils-mas"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "http://tomocomd.com/qubils-mas",
    "language": [
        "Java",
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "QuBiLs-MAS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0211-5",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: In previous reports, Marrero-Ponce et al. proposed algebraic formalisms for characterizing topological (2D) and chiral (2.5D) molecular features through atom- and bond-based ToMoCoMD-CARDD (acronym for Topological Molecular Computational Design-Computer Aided Rational Drug Design) molecular descriptors. These MDs codify molecular information based on the bilinear, quadratic and linear algebraic forms and the graph-theoretical electronic-density and edge-adjacency matrices in order to consider atom- and bond-based relations, respectively. These MDs have been successfully applied in the screening of chemical compounds of different therapeutic applications ranging from antimalarials, antibacterials, tyrosinase inhibitors and so on. To compute these MDs, a computational program with the same name was initially developed. However, this in house software barely offered the functionalities required in contemporary molecular modeling tasks, in addition to the inherent limitations that made its usability impractical. Therefore, the present manuscript introduces the QuBiLS-MAS (acronym for Quadratic, Bilinear and N-Linear mapS based on graph-theoretic electronic-density Matrices and Atomic weightingS) software designed to compute topological (0-2.5D) molecular descriptors based on bilinear, quadratic and linear algebraic forms for atom- and bond-based relations. Results: The QuBiLS-MAS module was designed as standalone software, in which extensions and generalizations of the former ToMoCoMD-CARDD 2D-algebraic indices are implemented, considering the following aspects: (a) two new matrix normalization approaches based on double-stochastic and mutual probability formalisms; (b) topological constraints (cut-offs) to take into account particular inter-atomic relations; (c) six additional atomic properties to be used as weighting schemes in the calculation of the molecular vectors; (d) four new local-fragments to consider molecular regions of interest; (e) number of lone-pair electrons in chemical structure defined by diagonal coefficients in matrix representations; and (f) several aggregation operators (invariants) applied over atom/bond-level descriptors in order to compute global indices. This software permits the parallel computation of the indices, contains a batch processing module and data curation functionalities. This program was developed in Java v1.7 using the Chemistry Development Kit library (version 1.4.19). The QuBiLS-MAS software consists of two components: a desktop interface (GUI) and an API library allowing for the easy integration of the latter in chemoinformatics applications. The relevance of the novel extensions and generalizations implemented in this software is demonstrated through three studies. Firstly, a comparative Shannon’s entropy based variability study for the proposed QuBiLS-MAS and the DRAGON indices demonstrates superior performance for the former. A principal component analysis reveals that the QuBiLS-MAS approach captures chemical information orthogonal to that codified by the DRAGON descriptors. Lastly, a QSAR study for the binding affinity to the corticosteroid-binding globulin using Cramer’s steroid dataset is carried out. Conclusions: From these analyses, it is revealed that the QuBiLS-MAS approach for atom-pair relations yields similar-to-superior performance with regard to other QSAR methodologies reported in the literature. Therefore, the QuBiLS-MAS approach constitutes a useful tool for the diversity analysis of chemical compound datasets and high-throughput screening of structure-activity data. [Figure not available: see fulltext. Caption: .]",
                "authors": [
                    {
                        "name": "Valdes-Martini J.R."
                    },
                    {
                        "name": "Marrero-Ponce Y."
                    },
                    {
                        "name": "Garcia-Jacas C.R."
                    },
                    {
                        "name": "Martinez-Mayorga K."
                    },
                    {
                        "name": "Barigye S.J."
                    },
                    {
                        "name": "Vaz D'Almeida Y.S."
                    },
                    {
                        "name": "Pham-The H."
                    },
                    {
                        "name": "Perez-Gimenez F."
                    },
                    {
                        "name": "Morell C.A."
                    }
                ],
                "citationCount": 39,
                "date": "2017-06-07T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "QuBiLS-MAS, open source multi-platform software for atom- and bond-based topological (2D) and chiral (2.5D) algebraic molecular descriptors computations"
            },
            "pmcid": "PMC5462671",
            "pmid": "29086120"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}