{"credit":[],"function":[{"operation":[{"term":"Peak detection","uri":"http://edamontology.org/operation_3215"},{"term":"Protein structure assignment","uri":"http://edamontology.org/operation_0320"},{"term":"Fold recognition","uri":"http://edamontology.org/operation_0303"},{"term":"Protein structure validation","uri":"http://edamontology.org/operation_0321"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"topic":[{"term":"NMR","uri":"http://edamontology.org/topic_0593"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"publication":[{"abstract":"© 2019 Wiley Periodicals, Inc.CASP13 has investigated the impact of sparse NMR data on the accuracy of protein structure prediction. NOESY and 15N-1H residual dipolar coupling data, typical of that obtained for 15N,13C-enriched, perdeuterated proteins up to about 40 kDa, were simulated for 11 CASP13 targets ranging in size from 80 to 326 residues. For several targets, two prediction groups generated models that are more accurate than those produced using baseline methods. Real NMR data collected for a de novo designed protein were also provided to predictors, including one data set in which only backbone resonance assignments were available. Some NMR-assisted prediction groups also did very well with these data. CASP13 also assessed whether incorporation of sparse NMR data improves the accuracy of protein structure prediction relative to nonassisted regular methods. In most cases, incorporation of sparse, noisy NMR data results in models with higher accuracy. The best NMR-assisted models were also compared with the best regular predictions of any CASP13 group for the same target. For six of 13 targets, the most accurate model provided by any NMR-assisted prediction group was more accurate than the most accurate model provided by any regular prediction group; however, for the remaining seven targets, one or more regular prediction method provided a more accurate model than even the best NMR-assisted model. These results suggest a novel approach for protein structure determination, in which advanced prediction methods are first used to generate structural models, and sparse NMR data is then used to validate and/or refine these models.","authors":["Sala D.","Huang Y.J.","Cole C.A.","Snyder D.A.","Liu G.","Ishida Y.","Swapna G.V.T.","Brock K.P.","Sander C.","Fidelis K.","Kryshtafovych A.","Inouye M.","Tejero R.","Valafar H.","Rosato A.","Montelione G.T."],"cit_count":0,"doi":"10.1002/PROT.25837","journal":"Proteins: Structure, Function and Bioinformatics","pmid":"31603581","title":"Protein structure prediction assisted with sparse NMR data in CASP13","year":"2019-12-01"}],"summary":{"biotoolsCURIE":"biotools:CASP13","biotoolsID":"CASP13","description":"Protein structure prediction assisted with sparse NMR data in CASP13.\n\n13th Community Wide Experiment on the.\n\nCritical Assessment of Techniques for Protein Structure Prediction.\n\nCASP13 provides an independent mechanism for the assessment of methods of protein structure modeling.\n\n||| NAME (CASP13) SIMILAR TO (PUB. DIFFERENT) bio.tools/casp (CASP).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'NMR-assisted'","homepage":"http://www.predictioncenter.org/casp13/index.cgi","name":"CASP13"}}