{
    "additionDate": "2017-12-18T00:05:00Z",
    "biotoolsCURIE": "biotools:csnap",
    "biotoolsID": "csnap",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.biochemistry.ucla.edu/biochem/Faculty/torres/index.html"
        }
    ],
    "description": "CSNAP is a computational approach for compound target identification based on network similarity graphs. Query and reference compounds are populated on the network connectivity map and a graph-based neighbor counting method is applied to rank the consensus targets among the neighborhood of each query ligand. The CSNAP approach can facilitate high-throughput target discovery and off-target prediction for any compound set identified from phenotype-based or cell-based chemical screens.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://services.mbi.ucla.edu/CSNAP/html/tutorial2.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://services.mbi.ucla.edu/CSNAP/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2019-01-11T00:30:46Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/csnap-chemical-similarity-network-analysis-pull-down.html"
        }
    ],
    "name": "CSNAP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1004153",
            "metadata": {
                "abstract": "© 2015 Lo et al.Target identification is one of the most critical steps following cell-based phenotypic chemical screens aimed at identifying compounds with potential uses in cell biology and for developing novel disease therapies. Current in silico target identification methods, including chemical similarity database searches, are limited to single or sequential ligand analysis that have limited capabilities for accurate deconvolution of a large number of compounds with diverse chemical structures. Here, we present CSNAP (Chemical Similarity Network Analysis Pulldown), a new computational target identification method that utilizes chemical similarity networks for large-scale chemotype (consensus chemical pattern) recognition and drug target profiling. Our benchmark study showed that CSNAP can achieve an overall higher accuracy (>80%) of target prediction with respect to representative chemotypes in large (>200) compound sets, in comparison to the SEA approach (60–70%). Additionally, CSNAP is capable of integrating with biological knowledge-based databases (Uniprot, GO) and high-throughput biology platforms (proteomic, genetic, etc) for system-wise drug target validation. To demonstrate the utility of the CSNAP approach, we combined CSNAP's target prediction with experimental ligand evaluation to identify the major mitotic targets of hit compounds from a cell-based chemical screen and we highlight novel compounds targeting microtubules, an important cancer therapeutic target. The CSNAP method is freely available and can be accessed from the CSNAP web server (http://services.mbi.ucla.edu/CSNAP/).",
                "authors": [
                    {
                        "name": "Lo Y.-C."
                    },
                    {
                        "name": "Senese S."
                    },
                    {
                        "name": "Li C.-M."
                    },
                    {
                        "name": "Hu Q."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Damoiseaux R."
                    },
                    {
                        "name": "Torres J.Z."
                    }
                ],
                "citationCount": 36,
                "date": "2015-03-31T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Large-Scale Chemical Similarity Networks for Target Profiling of Compounds Identified in Cell-Based Chemical Screens"
            },
            "pmcid": "PMC4380459",
            "pmid": "25826798",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Targets",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}