{
    "additionDate": "2020-01-14T19:52:28Z",
    "biotoolsCURIE": "biotools:OCSVM",
    "biotoolsID": "OCSVM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "abdollah.dehzangi@morgan.edu",
            "name": "Abdollah Dehzangi",
            "orcidid": "https://orcid.org/0000-0001-8577-0271",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel one-class classification approach to accurately predict disease-gene association in acute myeloid leukemia cancer.\n\nDisease causing gene identification is considered as an important step towards drug design and drug discovery. In disease gene identification and classification, the main aim is to identify disease genes while identifying non-disease genes are of less or no significant. Hence, this task can be defined as a one-class classification problem. Existing machine learning methods typically take into consideration known disease genes as positive training set and unknown genes as negative samples to build a binary-class classification model. Here we propose a new One-class Classification Support Vector Machines (OCSVM) method to precisely classify candidate disease genes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                }
            ]
        }
    ],
    "homepage": "https://github.com/imandehzangi/OCSVM",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-04T12:52:00Z",
    "name": "OCSVM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0226115",
            "metadata": {
                "abstract": "© 2019 Vasighizaker et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Disease causing gene identification is considered as an important step towards drug design and drug discovery. In disease gene identification and classification, the main aim is to identify disease genes while identifying non-disease genes are of less or no significant. Hence, this task can be defined as a one-class classification problem. Existing machine learning methods typically take into consideration known disease genes as positive training set and unknown genes as negative samples to build a binary-class classification model. Here we propose a new One-class Classification Support Vector Machines (OCSVM) method to precisely classify candidate disease genes. Our aim is to build a model that concentrate its focus on detecting known disease-causing gene to increase sensitivity and precision. We investigate the impact of our proposed model using a benchmark consisting of the gene expression dataset for Acute Myeloid Leukemia (AML) cancer. Compared with the traditional methods, our experimental result shows the superiority of our proposed method in terms of precision, recall, and F-measure to detect disease causing genes for AML. OCSVM codes and our extracted AML benchmark are publicly available at: Https://github. com/imandehzangi/OCSVM.",
                "authors": [
                    {
                        "name": "Vasighizaker A."
                    },
                    {
                        "name": "Sharma A."
                    },
                    {
                        "name": "Dehzangi A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A novel one-class classification approach to accurately predict disease-gene association in acute myeloid leukemia cancer"
            },
            "pmcid": "PMC6905554",
            "pmid": "31825992"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}