{
    "accessibility": "Open access",
    "additionDate": "2022-05-24T18:22:14.961833Z",
    "biotoolsCURIE": "biotools:legui",
    "biotoolsID": "legui",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tyler.davis@hsc.utah.edu",
            "name": "Tyler S. Davis",
            "typeEntity": "Person"
        },
        {
            "name": "Elliot H Smith"
        },
        {
            "name": "John D Rolston"
        }
    ],
    "description": "A Fast and Accurate Graphical User Interface for Automated Detection and Anatomical Localization of Intracranial Electrodes.",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://github.com/Rolston-Lab/LeGUI/blob/main/LeGUI_InstallationGuide.pdf"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/Rolston-Lab/LeGUI/blob/main/LeGUI_UserManual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Rolston-Lab/LeGUI",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-05-24T18:22:14.964337Z",
    "license": "GPL-3.0",
    "name": "LeGUI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNINS.2021.769872",
            "metadata": {
                "abstract": "Copyright © 2021 Davis, Caston, Philip, Charlebois, Anderson, Weaver, Smith and Rolston.Accurate anatomical localization of intracranial electrodes is important for identifying the seizure foci in patients with epilepsy and for interpreting effects from cognitive studies employing intracranial electroencephalography. Localization is typically performed by coregistering postimplant computed tomography (CT) with preoperative magnetic resonance imaging (MRI). Electrodes are then detected in the CT, and the corresponding brain region is identified using the MRI. Many existing software packages for electrode localization chain together separate preexisting programs or rely on command line instructions to perform the various localization steps, making them difficult to install and operate for a typical user. Further, many packages provide solutions for some, but not all, of the steps needed for confident localization. We have developed software, Locate electrodes Graphical User Interface (LeGUI), that consists of a single interface to perform all steps needed to localize both surface and depth/penetrating intracranial electrodes, including coregistration of the CT to MRI, normalization of the MRI to the Montreal Neurological Institute template, automated electrode detection for multiple types of electrodes, electrode spacing correction and projection to the brain surface, electrode labeling, and anatomical targeting. The software is written in MATLAB, core image processing is performed using the Statistical Parametric Mapping toolbox, and standalone executable binaries are available for Windows, Mac, and Linux platforms. LeGUI was tested and validated on 51 datasets from two universities. The total user and computational time required to process a single dataset was approximately 1 h. Automatic electrode detection correctly identified 4362 of 4695 surface and depth electrodes with only 71 false positives. Anatomical targeting was verified by comparing electrode locations from LeGUI to locations that were assigned by an experienced neuroanatomist. LeGUI showed a 94% match with the 482 neuroanatomist-assigned locations. LeGUI combines all the features needed for fast and accurate anatomical localization of intracranial electrodes into a single interface, making it a valuable tool for intracranial electrophysiology research.",
                "authors": [
                    {
                        "name": "Anderson D.N."
                    },
                    {
                        "name": "Caston R.M."
                    },
                    {
                        "name": "Charlebois C.M."
                    },
                    {
                        "name": "Davis T.S."
                    },
                    {
                        "name": "Philip B."
                    },
                    {
                        "name": "Rolston J.D."
                    },
                    {
                        "name": "Smith E.H."
                    },
                    {
                        "name": "Weaver K.E."
                    }
                ],
                "date": "2021-12-09T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "LeGUI: A Fast and Accurate Graphical User Interface for Automated Detection and Anatomical Localization of Intracranial Electrodes"
            },
            "pmcid": "PMC8695687",
            "pmid": "34955721"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
