{
    "accessibility": "Open access",
    "additionDate": "2022-08-29T09:13:41.619299Z",
    "biotoolsCURIE": "biotools:weconet",
    "biotoolsID": "weconet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rkaundal@gmail.com",
            "name": "Rakesh Kaundal",
            "orcidid": "https://orcid.org/0000-0001-8683-1240",
            "typeEntity": "Person"
        },
        {
            "name": "Raghav Kataria",
            "orcidid": "https://orcid.org/0000-0002-1355-3187"
        }
    ],
    "description": "A host-pathogen interactome database for deciphering crucial molecular networks of wheat-common bunt cross-talk mechanisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.usu.edu/weconet/",
    "lastUpdate": "2024-11-24T15:45:47.702014Z",
    "name": "WeCoNET",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s13007-022-00897-9",
            "metadata": {
                "abstract": "Background: Triticum aestivum is the most important staple food grain of the world. In recent years, the outbreak of a major seed-borne disease, common bunt, in wheat resulted in reduced quality and quantity of the crop. The disease is caused by two fungal pathogens, Tilletia caries and Tilletia laevis, which show high similarity to each other in terms of life cycle, germination, and disease symptoms. The host–pathogen protein–protein interactions play a crucial role in initiating the disease infection mechanism as well as in plant defense responses. Due to the availability of limited information on Tilletia species, the elucidation of infection mechanisms is hampered. Results: We constructed a database WeCoNET (http://bioinfo.usu.edu/weconet/), providing functional annotations of the pathogen proteins and various tools to exploit host–pathogen interactions and other relevant information. The database implements a host–pathogen interactomics tool to predict protein–protein interactions, followed by network visualization, BLAST search tool, advanced ‘keywords-based’ search module, etc. Other features in the database include various functional annotations of host and pathogen proteins such as gene ontology terms, functional domains, and subcellular localization. The pathogen proteins that serve as effector and secretory proteins have also been incorporated in the database, along with their respective descriptions. Additionally, the host proteins that serve as transcription factors were predicted, and are available along with the respective transcription factor family and KEGG pathway to which they belong. Conclusion: WeCoNET is a comprehensive, efficient resource to the molecular biologists engaged in understanding the molecular mechanisms behind the common bunt infection in wheat. The data integrated into the database can also be beneficial to the breeders for the development of common bunt-resistant cultivars.",
                "authors": [
                    {
                        "name": "Kataria R."
                    },
                    {
                        "name": "Kaundal R."
                    }
                ],
                "citationCount": 7,
                "date": "2022-12-01T00:00:00Z",
                "journal": "Plant Methods",
                "title": "WeCoNET: a host–pathogen interactome database for deciphering crucial molecular networks of wheat-common bunt cross-talk mechanisms"
            },
            "pmcid": "PMC9164323",
            "pmid": "35658913"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        }
    ],
    "validated": 1
}
