{
    "additionDate": "2018-08-11T08:46:59Z",
    "biotoolsCURIE": "biotools:primerxl",
    "biotoolsID": "primerxl",
    "credit": [
        {
            "email": "Steve.Lefever@UGent.be",
            "name": "Steve Lefever",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Primer3 based high-throughput primer design pipeline with in silico assay evaluation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.primerxl.org/help.php"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.primerxl.org/primerxl_manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ]
        }
    ],
    "homepage": "http://www.primerxl.org/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "primerXL",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1809-3",
            "metadata": {
                "abstract": "© 2017 The Author(s). Background: Although the sequencing landscape is rapidly evolving and sequencing costs are continuously decreasing, whole genome sequencing is still too expensive for use on a routine basis. Targeted resequencing of only the regions of interest decreases both costs and the complexity of the downstream data-analysis. Various target enrichment strategies are available, but none of them obtain the degree of coverage uniformity, flexibility and specificity of PCR-based enrichment. On the other hand, the biggest limitation of target enrichment by PCR is the need to design large numbers of partially overlapping assays to cover the target. Results: To overcome the aforementioned hurdles, we have developed primerXL, a state-of-the-art PCR primer design pipeline for targeted resequencing. It uses an optimized design criteria relaxation cascade and a thorough downstream in silico evaluation process to generate high quality singleplex PCR assays, reducing the need for amplicon normalization, and outperforming other target enrichment strategies and similar primer design tools when considering assay quality, coverage uniformity and target coverage. Results of four different sequencing projects with 2348 amplicons in total covering 470kb are presented. PrimerXL can be accessed at www.primerxl.org. Conclusion: PrimerXL is an state-of-the-art, easy to use primer design webtool capable of generating high-quality targeted resequencing assays. The workflow is fully customizable to suit every researchers' needs, while an innovative relaxation cascade ensures maximal target coverage.",
                "authors": [
                    {
                        "name": "Lefever S."
                    },
                    {
                        "name": "Pattyn F."
                    },
                    {
                        "name": "De Wilde B."
                    },
                    {
                        "name": "Coppieters F."
                    },
                    {
                        "name": "De Keulenaer S."
                    },
                    {
                        "name": "Hellemans J."
                    },
                    {
                        "name": "Vandesompele J."
                    }
                ],
                "citationCount": 2,
                "date": "2017-09-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "High-throughput PCR assay design for targeted resequencing using primerXL"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}