{
    "additionDate": "2021-01-18T11:23:46Z",
    "biotoolsCURIE": "biotools:codina",
    "biotoolsID": "codina",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "deisy.ccnr@gmail.com",
            "name": "Deisy Morselli Gysi",
            "orcidid": "https://orcid.org/0000-0002-5771-8182",
            "typeEntity": "Person"
        },
        {
            "email": "katja.nowick@fu-berlin.de",
            "name": "Katja Nowick",
            "typeEntity": "Person"
        }
    ],
    "description": "Whole transcriptomic network analysis using Co-expression Differential Network Analysis (CoDiNA). CoDiNA categorizes links and nodes from multiple networks in 3 categories: Common links (alpha) specific links (gamma), and different links (beta). Also categorizes the links into sub-categories and groups. The package includes a visualization tool for the networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                }
            ]
        }
    ],
    "homepage": "https://CRAN.R-project.org/package=CoDiNA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-14T16:25:57Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/CoDiNA/"
        }
    ],
    "name": "CoDiNA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0240523",
            "metadata": {
                "abstract": "Copyright: © 2020 Morselli Gysi et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Biological and medical sciences are increasingly acknowledging the significance of gene co-expression-networks for investigating complex-systems, phenotypes or diseases. Typically, complex phenotypes are investigated under varying conditions. While approaches for comparing nodes and links in two networks exist, almost no methods for the comparison of multiple networks are available and—to best of our knowledge—no comparative method allows for whole transcriptomic network analysis. However, it is the aim of many studies to compare networks of different conditions, for example, tissues, diseases, treatments, time points, or species. Here we present a method for the systematic comparison of an unlimited number of networks, with unlimited number of transcripts: Co-expression Differential Network Analysis (CoDiNA). In particular, CoDiNA detects links and nodes that are common, specific or different among the networks. We developed a statistical framework to normalize between these different categories of common or changed network links and nodes, resulting in a comprehensive network analysis method, more sophisticated than simply comparing the presence or absence of network nodes. Applying CoDiNA to a neurogenesis study we identified candidate genes involved in neuronal differentiation. We experimentally validated one candidate, demonstrating that its overexpression resulted in a significant disturbance in the underlying gene regulatory network of neurogenesis. Using clinical studies, we compared whole transcriptome co-expression networks from individuals with or without HIV and active tuberculosis (TB) and detected signature genes specific to HIV. Furthermore, analyzing multiple cancer transcription factor (TF) networks, we identified common and distinct features for particular cancer types. These CoDiNA applications demonstrate the successful detection of genes associated with specific phenotypes. Moreover, CoDiNA can also be used for comparing other types of undirected networks, for example, metabolic, protein-protein interaction, ecological and psychometric networks. CoDiNA is publicly available as an R package in CRAN (https://CRAN.R-project.org/package=CoDiNA).",
                "authors": [
                    {
                        "name": "Gysi D.M."
                    },
                    {
                        "name": "de Miranda Fragoso T."
                    },
                    {
                        "name": "Zebardast F."
                    },
                    {
                        "name": "Bertoli W."
                    },
                    {
                        "name": "Busskamp V."
                    },
                    {
                        "name": "Almaas E."
                    },
                    {
                        "name": "Nowick K."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Whole transcriptomic network analysis using Co-expression Differential Network Analysis (CoDiNA)"
            },
            "pmcid": "PMC7561188",
            "pmid": "33057419"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ]
}