{
    "accessibility": "Open access",
    "additionDate": "2022-07-05T10:32:51.146477Z",
    "biotoolsCURIE": "biotools:phosvardeep",
    "biotoolsID": "phosvardeep",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mhwang@ustc.edu.cn",
            "name": "Minghui Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Ao Li"
        },
        {
            "name": "Xia Liu"
        }
    ],
    "description": "Deep-learning based prediction of phospho-variants using sequence information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lisalikegaga/PhosVarDeep",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-05T10:32:51.149027Z",
    "license": "Not licensed",
    "name": "PhosVarDeep",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.7717/PEERJ.12847",
            "metadata": {
                "abstract": "© 2022 Liu et al.Human DNA sequencing has revealed numerous single nucleotide variants associated with complex diseases. Researchers have shown that these variants have potential effects on protein function, one of which is to disrupt protein phosphorylation. Based on conventional machine learning algorithms, several computational methods for predicting phospho-variants have been developed, but their performance still leaves considerable room for improvement. In recent years, deep learning has been successfully applied in biological sequence analysis with its efficient sequence pattern learning ability, which provides a powerful tool for improving phospho-variant prediction based on protein sequence information. In the study, we present PhosVarDeep, a novel unified deep-learning framework for phospho-variant prediction. PhosVarDeep takes reference and variant sequences as inputs and adopts a Siamese-like CNN architecture containing two identical subnetworks and a prediction module. In each subnetwork, general phosphorylation sequence features are extracted by a pre-trained sequence feature encoding network and then fed into a CNN module for capturing variantaware phosphorylation sequence features. After that, a prediction module is introduced to integrate the outputs of the two subnetworks and generate the prediction results of phospho-variants. Comprehensive experimental results on phospho-variant data demonstrates that our method significantly improves the prediction performance of phospho-variants and compares favorably with existing conventional machine learning methods.",
                "authors": [
                    {
                        "name": "Li A."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wang M."
                    }
                ],
                "date": "2022-03-14T00:00:00Z",
                "journal": "PeerJ",
                "title": "PhosVarDeep: deep-learning based prediction of phospho-variants using sequence information"
            },
            "pmcid": "PMC8929166",
            "pmid": "35310161"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
