{
    "additionDate": "2021-01-18T10:44:59Z",
    "biotoolsCURIE": "biotools:stab",
    "biotoolsID": "stab",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "weihuachen@hust.edu.cn",
            "name": "Wei-Hua Chen",
            "typeEntity": "Person"
        },
        {
            "email": "xmzhao@fudan.edu.cn",
            "name": "Xing-Ming Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "a spatio-temporal cell atlas of the human brain.\n\nThe human brain is the most complex organ consisting of billions of neuronal and non-neuronal cells that are organized into distinct anatomical and functional regions. Elucidating the cellular and transcriptome architecture underlying the brain is crucial for understanding brain functions and brain disorders. Thanks to the single-cell RNA sequencing technologies, it is becoming possible to dissect the cellular compositions of the brain. Although great effort has been made to explore the transcriptome architecture of the human brain, a comprehensive database with dynamic cellular compositions and molecular characteristics of the human brain during the lifespan is still not available",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://stab.comp-sysbio.org",
    "lastUpdate": "2021-02-21T16:12:08Z",
    "name": "STAB",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA762",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.The human brain is the most complex organ consisting of billions of neuronal and non-neuronal cells that are organized into distinct anatomical and functional regions. Elucidating the cellular and transcriptome architecture underlying the brain is crucial for understanding brain functions and brain disorders. Thanks to the single-cell RNA sequencing technologies, it is becoming possible to dissect the cellular compositions of the brain. Although great effort has been made to explore the transcriptome architecture of the human brain, a comprehensive database with dynamic cellular compositions and molecular characteristics of the human brain during the lifespan is still not available. Here, we present STAB (a Spatio-Temporal cell Atlas of the human Brain), a database consists of single-cell transcriptomes across multiple brain regions and developmental periods. Right now, STAB contains single-cell gene expression profiling of 42 cell subtypes across 20 brain regions and 11 developmental periods. With STAB, the landscape of cell types and their regional heterogeneity and temporal dynamics across the human brain can be clearly seen, which can help to understand both the development of the normal human brain and the etiology of neuropsychiatric disorders. STAB is available at http://stab.comp-sysbio.org.",
                "authors": [
                    {
                        "name": "Chen W.-H."
                    },
                    {
                        "name": "Jia L."
                    },
                    {
                        "name": "Pan S."
                    },
                    {
                        "name": "Song L."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhao X.-M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "STAB: A spatio-temporal cell atlas of the human brain"
            },
            "pmid": "32976581"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
