
{
    "credit": [
        {
            "email": "qunyuan@wustl.edu",
            "name": "Qunyuan Zhang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://dsgweb.wustl.edu/qunyuan/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://dsgwebwp.wustl.edu/methods-software/smartscan/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Microbiology",
                "uri": "http://edamontology.org/topic_3301"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/smartscan-1-0-variable-grouping-model-selection-assocaition-analysis-of-microbiome-sequece-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press.Motivation: Establishment of a statistical association between microbiome features and clinical outcomes is of growing interest because of the potential for yielding insights into biological mechanisms and pathogenesis. Extracting microbiome features that are relevant for a disease is challenging and existing variable selection methods are limited due to large number of risk factor variables from microbiome sequence data and their complex biological structure. Results: We propose a tree-based scanning method, Selection of Models for the Analysis of Risk factor Trees (referred to as SMART-scan), for identifying taxonomic groups that are associated with a disease or trait. SMART-scan is a model selection technique that uses a predefined taxonomy to organize the large pool of possible predictors into optimized groups, and hierarchically searches and determines variable groups for association test. We investigate the statistical properties of SMART-scan through simulations, in comparison to a regular single-variable analysis and three commonly-used variable selection methods, stepwise regression, least absolute shrinkage and selection operator (LASSO) and classification and regression tree (CART). When there are taxonomic group effects in the data, SMART-scan can significantly increase power by using bacterial taxonomic information to split large numbers of variables into groups. Through an application to microbiome data from a vervet monkey diet experiment, we demonstrate that SMART-scan can identify important phenotype-associated taxonomic features missed by single-variable analysis, stepwise regression, LASSO and CART.",
            "authors": [
                "Zhang Q.",
                "Abel H.",
                "Wells A.",
                "Lenzini P.",
                "Gomez F.",
                "Province M.A.",
                "Templeton A.A.",
                "Weinstock G.M.",
                "Salzman N.H.",
                "Borecki I.B."
            ],
            "cit_count": 6,
            "journal": "Bioinformatics",
            "pmid": "25568281",
            "title": "Selection of models for the analysis of risk-factor trees: Leveraging biological knowledge to mine large sets of risk factors with application to microbiome data",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:smartscan",
        "biotoolsID": "smartscan",
        "description": "A taxa tree based variable grouping and model selection method for identifying phenotype-assocaited microbiome variables.",
        "homepage": "https://dsgwebwp.wustl.edu/methods-software/smartscan/",
        "name": "SMARTscan"
    }
}