{
    "additionDate": "2021-01-18T10:37:43Z",
    "biotoolsCURIE": "biotools:dstabilize",
    "biotoolsID": "dstabilize",
    "confidence_flag": "tool",
    "description": "DStabilize is a server to generate enantiomers of peptides and proteins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                }
            ]
        }
    ],
    "homepage": "http://dstabilize.bii.a-star.edu.sg/",
    "lastUpdate": "2021-03-03T20:25:50Z",
    "name": "DStabilize",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.STR.2020.07.014",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdPeptides comprising D-amino acids have been shown to be resistant to proteolysis. This makes them potential candidates as probes of cellular interactions, notably protein-biomolecule interactions. However, the empirical conversion of the amino acids that constitute a peptide from L-forms to D-forms will result in abrogation of the normal interactions made by the L-amino acids due to side-chain orientation changes that are associated with the changes in chirality. These interactions can be preserved by reversing the sequence of the D-peptide. We present a web server (http://dstabilize.bii.a-star.edu.sg/) that allows users to convert between L-proteins and D-proteins and for sequence reversal of D-peptides, along with the capability of performing other empirical geometric transforms. This resource allows the user to generate structures of interest easily for subsequent in silico processing. The importance of D-amino acid-containing peptides as therapeutics is increasingly being recognized. In this work, Malik et al. present a webserver allowing users to easily interconvert between L- and D-forms of peptides/protein structures, apply custom geometrical transforms, and generate retro-inverso forms of peptides for in silico investigations.",
                "authors": [
                    {
                        "name": "Malik A.J."
                    },
                    {
                        "name": "Aronica P.G.A."
                    },
                    {
                        "name": "Verma C.S."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Structure",
                "title": "DStabilize: A Web Resource to Generate Mirror Images of Biomolecules"
            },
            "pmid": "32783952"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}