{
    "additionDate": "2021-01-18T10:57:36Z",
    "biotoolsCURIE": "biotools:cmcrpred",
    "biotoolsID": "cmcrpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Gajendra P.S. Raghava",
            "typeEntity": "Person"
        }
    ],
    "description": "Risk prediction in cutaneous melanoma patients from their clinico-pathological features.\n\nCMcrpred:Risk prediction in cutaneous melanoma patients using clinical featurs",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/cmcrpred/",
    "lastUpdate": "2021-02-12T16:26:36Z",
    "name": "CMcrpred",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.HELIYON.2020.E04811",
            "metadata": {
                "abstract": "© 2020Bioinformatics; Cancer research; Genetics; Oncology; Cancer; Prognosis; Melanoma; Survival analysis; Skin; Risk prediction. © 2020Risk assessment in cutaneous melanoma (CM) patients is one of the major challenges in the effective treatment of CM patients. Traditionally, clinico-pathological features such as Breslow thickness, American Joint Committee on Cancer (AJCC) tumor staging, etc. are utilized for this purpose. However, due to advancements in technology, most of the upcoming risk prediction methods are gene-expression profile (GEP) based. In this study, we have tried to develop new GEP and clinico-pathological features-based biomarkers and assessed their prognostic strength in contrast to existing prognostic methods. We developed risk prediction models using the expression of the genes associated with different cancer-related pathways and got a maximum hazard ratio (HR) of 2.52 with p-value ~10−8 for the apoptotic pathway. Another model, based on combination of apoptotic and notch pathway genes boosted the HR to 2.57. Next, we developed models based on individual clinical features and got a maximum HR of 2.45 with p-value ~10−6 for Breslow thickness. We also developed models using the best features of clinical as well as gene-expression data and obtained a maximum HR of 3.19 with p-value ~10−9. Finally, we developed a new ensemble method using clinical variables only and got a maximum HR of 6.40 with p-value ~10−15. Based on this method, a web-based service and an android application named ‘CMcrpred’ is available at (https://webs.iiitd.edu.in/raghava/cmcrpred/) and Google Play Store respectively to facilitate scientific community. This study reveals that our new ensemble method based on only clinico-pathological features overperforms methods based on GEP based profiles as well as currently used AJCC staging. It also highlights the need to explore the full potential of clinical variables for prognostication of cancer patients.",
                "authors": [
                    {
                        "name": "Arora C."
                    },
                    {
                        "name": "Kaur D."
                    },
                    {
                        "name": "Lathwal A."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Heliyon",
                "title": "Risk prediction in cutaneous melanoma patients from their clinico-pathological features: superiority of clinical data over gene expression data"
            },
            "pmcid": "PMC7472860",
            "pmid": "32913910"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}