{
    "additionDate": "2020-01-14T19:50:07Z",
    "biotoolsCURIE": "biotools:WB-Pro",
    "biotoolsID": "WB-Pro",
    "confidence_flag": "high",
    "description": "Creating a theoretically based multidimensional measure of well-being to advance theory, research, policy, and practice.\n\nAustralian Catholic University (ACU).\n\n1. I feel free to do whatever I decide to do.\n\n2. I feel free to make my own choices.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'well-being profile'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://ippe.acu.edu.au/research/research-instruments/wb-pro",
    "lastUpdate": "2020-01-14T19:50:07Z",
    "name": "WB-Pro",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1037/PAS0000787",
            "metadata": {
                "abstract": "© 2019 American Psychological Association.There is no universally agreed definition of well-being as a subjective experience, but Huppert and So (2013) adopted and systematically applied the definition of well-being as positive mental health-the opposite of the common mental disorders described in standard mental health classifications (e.g., Diagnostic and Statistical Manual of Mental Disorders). We extended their theoretical approach to include multi-item scales, using 2 waves of nationally representative U.S. adult samples to develop, test, and validate our multidimensional measure of well-being (WB-Pro). This resulted in a good-fitting a priori (48-item, 15-factor) model that was invariant over time, education, gender, and age; showed good reliability (coefficient αs .81-.93), test-retest correlation (.73-.85; M = .80), and convergent/ discriminant validity based on a multitrait-multimethod analysis, and relations with demographic variables, selected psychological measures, and other multidimensional and purportedly unidimensional well-being measures. Further, we found that items from 2 widely used, purportedly unidimensional well-being measures loaded on different WB-Pro factors consistent with a priori predictions based on the WB-Pro factor structure, thereby calling into question their claimed unidimensionality and theoretical rationale. Because some applications require a short global measure, we used a machine-learning algorithm to construct 2 global well-being short versions (five- and 15-item forms) and tested these formative measures in relation to the full-form and validity criteria (to download short and long versions see https://ippe.acu.edu.au/research/research-instruments/wb-pro). The WB-Pro appears to be one of the most comprehensive measures of subjective well-being, based on a sound conceptual model and empirical support, with broad applicability for research and practice, as well as providing a framework for evaluating the breadth of other well-being measures.",
                "authors": [
                    {
                        "name": "Marsh H.W."
                    },
                    {
                        "name": "Huppert F.A."
                    },
                    {
                        "name": "Donald J.N."
                    },
                    {
                        "name": "Horwood M.S."
                    },
                    {
                        "name": "Sahdra B.K."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Psychological Assessment",
                "title": "The Well-Being Profile (WB-Pro): Creating a Theoretically Based Multidimensional Measure of Well- Being to Advance Theory, Research, Policy, and Practice"
            },
            "pmid": "31829640"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}