{
    "accessibility": "Open access",
    "additionDate": "2022-02-16T22:22:07.605431Z",
    "biotoolsCURIE": "biotools:mitolink",
    "biotoolsID": "mitolink",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Anshu Bhardwaj"
        },
        {
            "name": "Amol Narwade"
        },
        {
            "name": "Bani Jolly"
        },
        {
            "name": "Neeraj K Rajput"
        },
        {
            "name": "Rakesh Kumar"
        }
    ],
    "description": "A generic integrated web-based workflow system to evaluate genotype-phenotype correlations in human mitochondrial diseases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://ab-openlab.csir.res.in/mitolink/",
    "lastUpdate": "2022-02-16T22:22:07.607834Z",
    "license": "Not licensed",
    "name": "MitoLink",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.MITO.2021.09.005",
            "metadata": {
                "abstract": "© 2021MitoLink is a generic, scalable and modular web-based workflow system developed to study genotype-phenotype correlations in human mitochondrial diseases. MitoLink integrates applications for assessment of genomic variation and currently houses genome-wide datasets from GenomeAsia Pilot project, gnomAD, ClinVar and DisGenNet. In this study, a reference list of nearly 3975 proteins (both nuclear and mitochondrial encoded) with mitochondrial function is reported. This protein set is mapped to disease associated variants in the GenomeAsia Pilot Project and DisGenNet and evaluated for pathogenicity as defined by ClinVar. Observations of shared genetic components in potential comorbidities are discussed from gene-disease network in Asian population, however, the platform is generic and can be applied to any population dataset. MitoLink is a unique customized workflow system that allows for systematic storage, extraction, analysis and visualization of genomic variation to understand genotype-phenotype correlations for mitochondrial diseases. Given the modularity of tool and data integration, MitoLink is a scalable system that can accommodate a diverse set of applications linked via standard data structure within the framework of Galaxy. MitoLink is built on FAIR principles and supports creation of reproducible workflows towards understanding genotype-phenotype correlations across several disease phenotypes globally.",
                "authors": [
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "K Rajput N."
                    },
                    {
                        "name": "Jolly B."
                    },
                    {
                        "name": "Narwade A."
                    },
                    {
                        "name": "Bhardwaj A."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "Mitochondrion",
                "title": "MitoLink: A generic integrated web-based workflow system to evaluate genotype-phenotype correlations in human mitochondrial diseases: Observations from the GenomeAsia Pilot project"
            },
            "pmid": "34571248"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}