{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T11:15:08Z",
    "biotoolsCURIE": "biotools:epiclass",
    "biotoolsID": "epiclass",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tpisanic@jhu.edu",
            "name": "Thomas R. Pisanic II",
            "typeEntity": "Person"
        },
        {
            "email": "elnitski@mail.nih.gov",
            "name": "Laura Elnitski",
            "typeEntity": "Person"
        }
    ],
    "description": "EpiClass is a Optimizing and predicting performance of DNA methylation biomarkers using sequence methylation density information. EpiClass is a software program to distinguish case samples from control samples using methylation density profiles of each sample.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation calling",
                    "uri": "http://edamontology.org/operation_3919"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                },
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Elnitskilab/EpiClass",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T07:51:31Z",
    "name": "EpiClass",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13148-020-00939-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Variation in intercellular methylation patterns can complicate the use of methylation biomarkers for clinical diagnostic applications such as blood-based cancer testing. Here, we describe development and validation of a methylation density binary classification method called EpiClass (available for download at https://github.com/Elnitskilab/EpiClass) that can be used to predict and optimize the performance of methylation biomarkers, particularly in challenging, heterogeneous samples such as liquid biopsies. This approach is based upon leveraging statistical differences in single-molecule sample methylation density distributions to identify ideal thresholds for sample classification. Results: We developed and tested the classifier using reduced representation bisulfite sequencing (RRBS) data derived from ovarian carcinoma tissue DNA and controls. We used these data to perform in silico simulations using methylation density profiles from individual epiallelic copies of ZNF154, a genomic locus known to be recurrently methylated in numerous cancer types. From these profiles, we predicted the performance of the classifier in liquid biopsies for the detection of epithelial ovarian carcinomas (EOC). In silico analysis indicated that EpiClass could be leveraged to better identify cancer-positive liquid biopsy samples by implementing precise thresholds with respect to methylation density profiles derived from circulating cell-free DNA (cfDNA) analysis. These predictions were confirmed experimentally using DREAMing to perform digital methylation density analysis on a cohort of low volume (1-ml) plasma samples obtained from 26 EOC-positive and 41 cancer-free women. EpiClass performance was then validated in an independent cohort of 24 plasma specimens, derived from a longitudinal study of 8 EOC-positive women, and 12 plasma specimens derived from 12 healthy women, respectively, attaining a sensitivity/specificity of 91.7%/100.0%. Direct comparison of CA-125 measurements with EpiClass demonstrated that EpiClass was able to better identify EOC-positive women than standard CA-125 assessment. Finally, we used independent whole genome bisulfite sequencing (WGBS) datasets to demonstrate that EpiClass can also identify other cancer types as well or better than alternative methylation-based classifiers. Conclusions: Our results indicate that assessment of intramolecular methylation density distributions calculated from cfDNA facilitates the use of methylation biomarkers for diagnostic applications. Furthermore, we demonstrated that EpiClass analysis of ZNF154 methylation was able to outperform CA-125 in the detection of etiologically diverse ovarian carcinomas, indicating broad utility of ZNF154 for use as a biomarker of ovarian cancer.",
                "authors": [
                    {
                        "name": "Miller B.F."
                    },
                    {
                        "name": "Pisanic II T.R."
                    },
                    {
                        "name": "Margolin G."
                    },
                    {
                        "name": "Petrykowska H.M."
                    },
                    {
                        "name": "Athamanolap P."
                    },
                    {
                        "name": "Goncearenco A."
                    },
                    {
                        "name": "Osei-Tutu A."
                    },
                    {
                        "name": "Annunziata C.M."
                    },
                    {
                        "name": "Wang T.-H."
                    },
                    {
                        "name": "Elnitski L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Clinical Epigenetics",
                "title": "Leveraging locus-specific epigenetic heterogeneity to improve the performance of blood-based DNA methylation biomarkers"
            },
            "pmcid": "PMC7574234",
            "pmid": "33081832"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}