{
    "additionDate": "2024-02-21T14:20:32.341494Z",
    "biotoolsCURIE": "biotools:mcnebula",
    "biotoolsID": "mcnebula",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "caogang33@163.com",
            "name": "Gang Cao"
        }
    ],
    "description": "Critical chemical classes for the classification and boost identification by visualization for untargeted LC-MS/MS data analysis.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://mcnebula.netlify.app/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:14:41.484073Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Cao-lab-zcmu/MCnebula2"
        }
    ],
    "name": "MCnebula",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.3c01072",
            "metadata": {
                "abstract": "Untargeted mass spectrometry is a robust tool for biology, but it usually requires a large amount of time on data analysis, especially for system biology. A framework called Multiple-Chemical nebula (MCnebula) was developed herein to facilitate the LC-MS data analysis process by focusing on critical chemical classes and visualization in multiple dimensions. This framework consists of three vital steps as follows: (1) abundance-based classes (ABC) selection algorithm, (2) critical chemical classes to classify “features” (corresponding to compounds), and (3) visualization as multiple Child-Nebulae (network graph) with annotation, chemical classification, and structure. Notably, MCnebula can be used to explore the classification and structural characteristic of unknown compounds beyond the limit of the spectral library. Moreover, it is intuitive and convenient for pathway analysis and biomarker discovery because of its function of ABC selection and visualization. MCnebula was implemented in the R language. A series of tools in R packages were provided to facilitate downstream analysis in an MCnebula-featured way, including feature selection, homology tracing of top features, pathway enrichment analysis, heat map clustering analysis, spectral visualization analysis, chemical information query, and output analysis reports. The broad utility of MCnebula was illustrated by a human-derived serum data set for metabolomics analysis. The results indicated that “Acyl carnitines” were screened out by tracing structural classes of biomarkers, which was consistent with the reference. A plant-derived data set was investigated to achieve a rapid annotation and discovery of compounds in E. ulmoides.",
                "authors": [
                    {
                        "name": "Cao G."
                    },
                    {
                        "name": "Huang L."
                    },
                    {
                        "name": "Lyu Q."
                    },
                    {
                        "name": "Shan Q."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "citationCount": 3,
                "date": "2023-07-04T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "MCnebula: Critical Chemical Classes for the Classification and Boost Identification by Visualization for Untargeted LC-MS/MS Data Analysis"
            },
            "pmid": "37314081"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
