{
    "accessibility": "Open access",
    "additionDate": "2022-08-19T19:11:21.470117Z",
    "biotoolsCURIE": "biotools:desp",
    "biotoolsID": "desp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xwwang@tsinghua.edu.cn",
            "name": "Xiaowo Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A flexible framework for systematic error simulation in DNA storage and can be adapted to a wide range of experiment pipelines.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WangLabTHU/DeSP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-19T19:11:21.472685Z",
    "license": "MIT",
    "link": [
        {
            "note": "A a live demo of the tool is found here",
            "type": [
                "Other"
            ],
            "url": "http://170.106.110.86/"
        }
    ],
    "name": "DeSP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04723-W",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Using DNA as a storage medium is appealing due to the information density and longevity of DNA, especially in the era of data explosion. A significant challenge in the DNA data storage area is to deal with the noises introduced in the channel and control the trade-off between the redundancy of error correction codes and the information storage density. As running DNA data storage experiments in vitro is still expensive and time-consuming, a simulation model is needed to systematically optimize the redundancy to combat the channel's particular noise structure. Results: Here, we present DeSP, a systematic DNA storage error Simulation Pipeline, which simulates the errors generated from all DNA storage stages and systematically guides the optimization of encoding redundancy. It covers both the sequence lost and the within-sequence errors in the particular context of the data storage channel. With this model, we explained how errors are generated and passed through different stages to form final sequencing results, analyzed the influence of error rate and sampling depth to final error rates, and demonstrated how to systemically optimize redundancy design in silico with the simulation model. These error simulation results are consistent with the in vitro experiments. Conclusions: DeSP implemented in Python is freely available on Github (https://github.com/WangLabTHU/DeSP). It is a flexible framework for systematic error simulation in DNA storage and can be adapted to a wide range of experiment pipelines.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xie Z."
                    },
                    {
                        "name": "Yuan L."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeSP: a systematic DNA storage error simulation pipeline"
            },
            "pmcid": "PMC9116035",
            "pmid": "35581548"
        }
    ],
    "toolType": [
        "Web application",
        "Workbench",
        "Workflow"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
