{
    "additionDate": "2020-01-14T19:43:29Z",
    "biotoolsCURIE": "biotools:HastaLaVista",
    "biotoolsID": "HastaLaVista",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "julien.wist@correounivalle.edu.co",
            "name": "Julien Wist",
            "orcidid": "https://orcid.org/0000-0002-3416-2572",
            "typeEntity": "Person"
        }
    ],
    "description": "Web-based user interface for NMR-based untargeted metabolic profiling analysis in biomedical sciences.\n\nR package that provide interactive graphical interface for metabolic profiling.\n\nIf you find it useful, please cite this work.\n\nto convert R variables into a JSON object and save it as a file.\n\nhastaLaVista is developed and tested using Chrome, although it is known to work with other browser. In the case that a feature is not working as expected please try using Chrome before filling an issue",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jwist/hastaLaVista",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2020-12-07T09:20:22Z",
    "license": "MIT",
    "name": "HastaLaVista",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13321-019-0399-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Metabolic profiling has been shown to be useful to improve our understanding of complex metabolic processes. Shared data are key to the analysis and validation of metabolic profiling and untargeted spectral analysis and may increase the pace of new discovery. Improving the existing portfolio of open software may increase the fraction of shared data by decreasing the amount of effort required to publish them in a manner that is useful to others. However, a weakness of open software, when compared to commercial ones, is the lack of user-friendly graphical interface that may discourage inexperienced researchers. Here, a web-browser-oriented solution is presented and demonstrated for metabolic profiling analysis that combines the power of R for back-end statistical analyses and of JavaScript for front-end visualisations and user interactivity. This unique combination of statistical programming and web-browser visualisation brings enhanced data interoperability and interactivity into the open source realm. It is exemplified by characterizing the extent to which bariatric surgery perturbs the metabolisms of rats, showing the value of the approach in iterative analysis by the end-user to establish a deeper understanding of the system perturbation. HastaLaVista is available at: (https://github.com/jwist/hastaLaVista, https://doi.org/10.5281/zenodo.3544800) under MIT license. The approach described in this manuscript can be extended to connect the interface to other scripting languages such as Python, and to create interfaces for other types of data analysis.",
                "authors": [
                    {
                        "name": "Wist J."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-05T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "HastaLaVista, a web-based user interface for NMR-based untargeted metabolic profiling analysis in biomedical sciences: Towards a new publication standard"
            },
            "pmcid": "PMC6896291"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
