{
    "accessibility": "Open access",
    "additionDate": "2022-11-04T09:42:16.793934Z",
    "biotoolsCURIE": "biotools:gic",
    "biotoolsID": "gic",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Eugene.Laska@nyulangone.org",
            "name": "Eugene Laska",
            "typeEntity": "Person"
        },
        {
            "name": "Carole Siegel"
        },
        {
            "name": "Ziqiang Lin"
        }
    ],
    "description": "An iterative algorithm that improves the proximity matrix (PM) from a random forest (RF) and the resulting clusters as measured by the silhouette score.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/GIC/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-11-04T09:42:16.796267Z",
    "license": "GPL-3.0",
    "name": "GIC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/SAM.11573",
            "metadata": {
                "abstract": "© 2022 The Authors. Statistical Analysis and Data Mining published by Wiley Periodicals LLC.The quality of a cluster analysis of unlabeled units depends on the quality of the between units dissimilarity measures. Data-dependent dissimilarity is more objective than data independent geometric measures such as Euclidean distance. As suggested by Breiman, many data driven approaches are based on decision tree ensembles, such as a random forest (RF), that produce a proximity matrix that can easily be transformed into a dissimilarity matrix. An RF can be obtained using labels that distinguish units with real data from units with synthetic data. The resulting dissimilarity matrix is input to a clustering program and units are assigned labels corresponding to cluster membership. We introduce a general iterative cluster (GIC) algorithm that improves the proximity matrix and clusters of the base RF. The cluster labels are used to grow a new RF yielding an updated proximity matrix, which is entered into the clustering program. The process is repeated until convergence. The same procedure can be used with many base procedures such as the extremely randomized tree ensemble. We evaluate the performance of the GIC algorithm using benchmark and simulated data sets. The properties measured by the Silhouette score are substantially superior to the base clustering algorithm. The GIC package has been released in R: https://cran.r-project.org/web/packages/GIC/index.html.",
                "authors": [
                    {
                        "name": "Laska E."
                    },
                    {
                        "name": "Lin Z."
                    },
                    {
                        "name": "Siegel C."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "Statistical Analysis and Data Mining",
                "title": "A general iterative clustering algorithm"
            },
            "pmcid": "PMC9438941",
            "pmid": "36061078"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
