{
    "additionDate": "2021-01-18T07:10:49Z",
    "biotoolsCURIE": "biotools:lep-anchor",
    "biotoolsID": "lep-anchor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pasi.rastas@helsinki.fi",
            "name": "Pasi Rastas",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated construction of linkage map anchored haploid genomes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/lep-anchor",
    "lastUpdate": "2021-06-22T08:50:34Z",
    "license": "GPL-3.0",
    "name": "Lep-Anchor",
    "owner": "prastas",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ978",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Linkage mapping provides a practical way to anchor de novo genome assemblies into chromosomes and to detect chimeric or otherwise erroneous contigs. Such anchoring improves with higher number of markers and individuals, as long as the mapping software can handle all the information. Recent software Lep-MAP3 can robustly construct linkage maps for millions of genotyped markers and on thousands of individuals, providing optimal maps for genome anchoring. For such large datasets, automated and robust genome anchoring tool is especially valuable and can significantly reduce intensive computational and manual work involved. Results: Here, we present a software Lep-Anchor (LA) to anchor genome assemblies automatically using dense linkage maps. As the main novelty, it takes into account the uncertainty of the linkage map positions caused by low recombination regions, cross type or poor mapping data quality. Furthermore, it can automatically detect and cut chimeric contigs, and use contig-contig, single read or alternative genome assembly alignments as additional information on contig order and orientations and to collapse haplotype contigs. We demonstrate the performance of LA using real data and show that it outperforms ALLMAPS on anchoring completeness and speed. Accuracy-wise LA and ALLMAPS are about equal, but at the expense of lower completeness of ALLMAPS. The software Chromonomer was faster than the other two methods but has major limitations and is lower in accuracy. We also show that with additional information, such as contig-contig and read alignments, the anchoring completeness can be improved by up to 70% without significant loss in accuracy. Based on simulated data, we conclude that the anchoring accuracy can be improved by utilizing information about map position uncertainty. Accuracy is the rate of contigs in correct orientation and completeness is the number contigs with inferred orientation.",
                "authors": [
                    {
                        "name": "Rastas P."
                    }
                ],
                "citationCount": 5,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Lep-Anchor: Automated construction of linkage map anchored haploid genomes"
            },
            "pmid": "31913460"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}