{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:07:51Z",
    "biotoolsCURIE": "biotools:HiCNN",
    "biotoolsID": "HiCNN",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zheng.wang@miami.edu",
            "name": "Zheng Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Computational method for resolution enhancement of Hi-C data. It uses a very deep convolutional neural network to learn the mapping between low-resolution and high-resolution Hi-C contact matrices.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://dna.cs.miami.edu/HiCNN/HiCNN_package.tar.gz"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://dna.cs.miami.edu/HiCNN/HiCNN_package.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://dna.cs.miami.edu/HiCNN/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "HiCNN",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ251",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: High-resolution Hi-C data are indispensable for the studies of three-dimensional (3D) genome organization at kilobase level. However, generating high-resolution Hi-C data (e.g. 5 kb) by conducting Hi-C experiments needs millions of mammalian cells, which may eventually generate billions of paired-end reads with a high sequencing cost. Therefore, it will be important and helpful if we can enhance the resolutions of Hi-C data by computational methods. Results: We developed a new computational method named HiCNN that used a 54-layer very deep convolutional neural network to enhance the resolutions of Hi-C data. The network contains both global and local residual learning with multiple speedup techniques included resulting in fast convergence. We used mean squared errors and Pearson's correlation coefficients between real high-resolution and computationally predicted high-resolution Hi-C data to evaluate the method. The evaluation results show that HiCNN consistently outperforms HiCPlus, the only existing tool in the literature, when training and testing data are extracted from the same cell type (i.e. GM12878) and from two different cell types in the same or different species (i.e. GM12878 as training with K562 as testing, and GM12878 as training with CH12-LX as testing). We further found that the HiCNN-enhanced high-resolution Hi-C data are more consistent with real experimental high-resolution Hi-C data than HiCPlus-enhanced data in terms of indicating statistically significant interactions. Moreover, HiCNN can efficiently enhance low-resolution Hi-C data, which eventually helps recover two chromatin loops that were confirmed by 3D-FISH. Availability and implementation: HiCNN is freely available at http://dna.cs.miami.edu/HiCNN/. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Wang Z."
                    }
                ],
                "citationCount": 12,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HiCNN: A very deep convolutional neural network to better enhance the resolution of Hi-C data"
            },
            "pmid": "31056636",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}