{
    "additionDate": "2018-08-14T01:48:59Z",
    "biotoolsCURIE": "biotools:prober-chem",
    "biotoolsID": "prober-chem",
    "credit": [
        {
            "email": "lpachter@caltech.edu",
            "name": "Lior Pachter",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pachterlab.github.io/PROBer/contact/"
        }
    ],
    "description": "PROBer is a program to quantify chemical modification profiles for a general set of sequencing-based ‘toeprinting’ assays, which aim at probing RNA structures (DMS/SHAPE-seq), detecting RNA modifications (Pseudo-seq), and investigating RNA-protein interactions (iCLIP).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://pachterlab.github.io/PROBer/manual/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "http://pachterlab.github.io/PROBer/",
    "language": [
        "Perl",
        "Python",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "PROBer",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.cels.2017.04.007",
            "metadata": {
                "abstract": "© 2017 Elsevier Inc.A number of sequencing-based transcriptase drop-off assays have recently been developed to probe post-transcriptional dynamics of RNA-protein interaction, RNA structure, and RNA modification. Although these assays survey a diverse set of epitranscriptomic marks, we use the term toeprinting assays since they share methodological similarities. Their interpretation is predicated on addressing a similar computational challenge: how to learn isoform-specific chemical modification profiles in the face of complex read multi-mapping. We introduce PROBer, a statistical model and associated software, that addresses this challenge for the analysis of toeprinting assays. PROBer takes sequencing data as input and outputs estimated transcript abundances and isoform-specific modification profiles. Results on both simulated and biological data demonstrate that PROBer significantly outperforms individual methods tailored for specific toeprinting assays. Since the space of toeprinting assays is ever expanding and these assays are likely to be performed and analyzed together, we believe PROBer's unified data analysis solution will be valuable to the RNA community.",
                "authors": [
                    {
                        "name": "Aviran S."
                    },
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Pachter L."
                    },
                    {
                        "name": "Tambe A."
                    }
                ],
                "citationCount": 10,
                "date": "2017-05-24T00:00:00Z",
                "journal": "Cell Systems",
                "title": "PROBer Provides a General Toolkit for Analyzing Sequencing-Based Toeprinting Assays"
            },
            "pmcid": "PMC5758053",
            "pmid": "28501650",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1,
    "version": [
        "0.3.1"
    ]
}
