
{
    "credit": [
        {
            "email": "gingproc@iim.csic.es",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sites.google.com/site/synbadm/documentation"
        }
    ],
    "function": [
        {
            "note": "Gene circuit design",
            "operation": [
                {
                    "term": "Design",
                    "uri": "http://edamontology.org/operation_2430"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Biotechnology",
                "uri": "http://edamontology.org/topic_3297"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/synbadm-toolbox-for-automatic-optimal-design-in-synthetic-biology.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2016. Published by Oxford University Press. All rights reserved. Motivation: The design of de novo circuits with predefined performance specifications is a challenging problem in Synthetic Biology. Computational models and tools have proved to be crucial for a successful wet lab implementation. Natural gene circuits are complex, subject to evolutionary tradeoffs and playing multiple roles. However, most synthetic designs implemented to date are simple and perform a single task. As the field progresses, advanced computational tools are needed in order to handle greater levels of circuit complexity in a more flexible way and considering multiple design criteria. Results: This works presents SYNBADm (SYNthetic Biology Automated optimal Design in Matlab), a software toolbox for the automatic optimal design of gene circuits with targeted functions from libraries of components. This tool makes use of global optimization to simultaneously search the space of structures and kinetic parameters. SYNBADm can efficiently handle high levels of circuit complexity and can consider multiple design criteria through multiobjective optimization. Further, it provides flexible design capabilities, i.e. the user can define the modeling framework, library of components and target performance function(s).",
            "authors": [
                "Otero-Muras I.",
                "Henriques D.",
                "Banga J.R."
            ],
            "cit_count": 12,
            "journal": "Bioinformatics",
            "pmid": "27402908",
            "title": "SYNBADm: A tool for optimization-based automated design of synthetic gene circuits",
            "year": "2016-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:synbadm",
        "biotoolsID": "synbadm",
        "description": "A Matlab-based toolbox for the automatic design of gene circuits with targeted functions from libraries of components.",
        "homepage": "https://sites.google.com/site/synbadm/",
        "name": "SYNBADm"
    }
}