{
    "additionDate": "2018-07-22T07:50:21Z",
    "biotoolsCURIE": "biotools:jmrui",
    "biotoolsID": "jmrui",
    "credit": [
        {
            "email": "jmj@isibrno.cz",
            "name": "Michał Jabłoński",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software package for advanced time-domain analysis of magnetic resonance spectroscopy (MRS) and spectroscopic imaging (MRSI) data. Through a user-friendly graphical interface biomedical researchers and clinical radiologists can use state-of-the-art signal processing algorithms to analyse and quantify spectroscopic data: from a single spectrum to a full multidimensional MRSI dataset.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jmrui.eu/features/"
        }
    ],
    "editPermission": {
        "authors": [
            "Mareike345",
            "NMoore",
            "ajmal",
            "eckb",
            "jmslade",
            "yulu"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://www.jmrui.eu/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-06-01T18:39:33.381174Z",
    "name": "jMRUI",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1459-5",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Proton magnetic resonance spectroscopy is a non-invasive measurement technique which provides information about concentrations of up to 20 metabolites participating in intracellular biochemical processes. In order to obtain any metabolic information from measured spectra a processing should be done in specialized software, like jMRUI. The processing is interactive and complex and often requires many trials before obtaining a correct result. This paper proposes a jMRUI enhancement for efficient and unambiguous history tracking and file identification. Results: A database storing all processing steps, parameters and files used in processing was developed for jMRUI. The solution was developed in Java, authors used a SQL database for robust storage of parameters and SHA-256 hash code for unambiguous file identification. The developed system was integrated directly in jMRUI and it will be publically available. A graphical user interface was implemented in order to make the user experience more comfortable. The database operation is invisible from the point of view of the common user, all tracking operations are performed in the background. Conclusions: The implemented jMRUI database is a tool that can significantly help the user to track the processing history performed on data in jMRUI. The created tool is oriented to be user-friendly, robust and easy to use. The database GUI allows the user to browse the whole processing history of a selected file and learn e.g. what processing lead to the results, where the original data are stored, to obtain the list of all processing actions performed on spectra.",
                "authors": [
                    {
                        "name": "Jablonski M."
                    },
                    {
                        "name": "Starcuk Z."
                    },
                    {
                        "name": "Starcukova J."
                    }
                ],
                "citationCount": 3,
                "date": "2017-01-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Processing tracking in jMRUI software for magnetic resonance spectra quantitation reproducibility assurance"
            },
            "pmcid": "PMC5260066",
            "pmid": "28114896"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
