{
    "additionDate": "2021-03-19T08:46:41Z",
    "biotoolsCURIE": "biotools:rgcode",
    "biotoolsID": "rgcode",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lies.degroef@kuleuven.be",
            "name": "Lies De Groef",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel retinal ganglion cell quantification tool based on deep learning.\n\nGlaucoma is a disease associated with the loss of retinal ganglion cells (RGCs), and remains one of the primary causes of blindness worldwide. Major research efforts are presently directed towards the understanding of disease pathogenesis and the development of new therapies, with the help of rodent models as an important preclinical research tool. The ultimate goal is reaching neuroprotection of the RGCs, which requires a tool to reliably quantify RGC survival. Hence, we demonstrate a novel deep learning pipeline that enables fully automated RGC quantification in the entire murine retina. This software, called RGCode (Retinal Ganglion Cell quantification based On DEep learning), provides a user-friendly interface that requires the input of RBPMS-immunostained flatmounts and returns the total RGC count, retinal area and density, together with output images showing the computed counts and isodensity maps",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/NCDRlab/rgcode",
    "lastUpdate": "2021-04-02T16:02:42Z",
    "license": "MIT",
    "name": "RGCode",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41598-020-80308-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Glaucoma is a disease associated with the loss of retinal ganglion cells (RGCs), and remains one of the primary causes of blindness worldwide. Major research efforts are presently directed towards the understanding of disease pathogenesis and the development of new therapies, with the help of rodent models as an important preclinical research tool. The ultimate goal is reaching neuroprotection of the RGCs, which requires a tool to reliably quantify RGC survival. Hence, we demonstrate a novel deep learning pipeline that enables fully automated RGC quantification in the entire murine retina. This software, called RGCode (Retinal Ganglion Cell quantification based On DEep learning), provides a user-friendly interface that requires the input of RBPMS-immunostained flatmounts and returns the total RGC count, retinal area and density, together with output images showing the computed counts and isodensity maps. The counting model was trained on RBPMS-stained healthy and glaucomatous retinas, obtained from mice subjected to microbead-induced ocular hypertension and optic nerve crush injury paradigms. RGCode demonstrates excellent performance in RGC quantification as compared to manual counts. Furthermore, we convincingly show that RGCode has potential for wider application, by retraining the model with a minimal set of training data to count FluoroGold-traced RGCs.",
                "authors": [
                    {
                        "name": "Andries L."
                    },
                    {
                        "name": "Bergmans S."
                    },
                    {
                        "name": "Claes M."
                    },
                    {
                        "name": "Cools L."
                    },
                    {
                        "name": "Davis B.M."
                    },
                    {
                        "name": "De Groef L."
                    },
                    {
                        "name": "Masin L."
                    },
                    {
                        "name": "Moons L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "A novel retinal ganglion cell quantification tool based on deep learning"
            },
            "pmcid": "PMC7804414",
            "pmid": "33436866"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
