{
    "additionDate": "2017-01-13T13:14:31Z",
    "biotoolsCURIE": "biotools:exomepicks",
    "biotoolsID": "exomepicks",
    "credit": [
        {
            "email": "cfuchsb@umich.edu",
            "name": "Christian Fuchsberger",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ExomePicks is a program that suggests individuals to be sequenced in a large pedigree.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://genome.sph.umich.edu/wiki/ExomePicks",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "ExomePicks",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1038/ejhg.2014.216",
            "metadata": {
                "abstract": "© 2015 Macmillan Publishers Limited All rights reserved.The utility of genotype imputation in genome-wide association studies is increasing as progressively larger reference panels are improved and expanded through whole-genome sequencing. Developing general guidelines for optimally cost-effective imputation, however, requires evaluation of performance issues that include the relative utility of study-specific compared with general/multipopulation reference panels; genotyping with various array scaffolds; effects of different ethnic backgrounds; and assessment of ranges of allele frequencies. Here we compared the effectiveness of study-specific reference panels to the commonly used 1000 Genomes Project (1000G) reference panels in the isolated Sardinian population and in cohorts of European ancestry including samples from Minnesota (USA). We also examined different combinations of genome-wide and custom arrays for baseline genotypes. In Sardinians, the study-specific reference panel provided better coverage and genotype imputation accuracy than the 1000G panels and other large European panels. In fact, even gene-centered custom arrays (interrogating ∼200 000 variants) provided highly informative content across the entire genome. Gain in accuracy was also observed for Minnesotans using the study-specific reference panel, although the increase was smaller than in Sardinians, especially for rare variants. Notably, a combined panel including both study-specific and 1000G reference panels improved imputation accuracy only in the Minnesota sample, and only at rare sites. Finally, we found that when imputation is performed with a study-specific reference panel, cutoffs different from the standard thresholds of MACH-Rsq and IMPUTE-INFO metrics should be used to efficiently filter badly imputed rare variants. This study thus provides general guidelines for researchers planning large-scale genetic studies.",
                "authors": [
                    {
                        "name": "Pistis G."
                    },
                    {
                        "name": "Porcu E."
                    },
                    {
                        "name": "Vrieze S.I."
                    },
                    {
                        "name": "Sidore C."
                    },
                    {
                        "name": "Steri M."
                    },
                    {
                        "name": "Danjou F."
                    },
                    {
                        "name": "Busonero F."
                    },
                    {
                        "name": "Mulas A."
                    },
                    {
                        "name": "Zoledziewska M."
                    },
                    {
                        "name": "Maschio A."
                    },
                    {
                        "name": "Brennan C."
                    },
                    {
                        "name": "Lai S."
                    },
                    {
                        "name": "Miller M.B."
                    },
                    {
                        "name": "Marcelli M."
                    },
                    {
                        "name": "Urru M.F."
                    },
                    {
                        "name": "Pitzalis M."
                    },
                    {
                        "name": "Lyons R.H."
                    },
                    {
                        "name": "Kang H.M."
                    },
                    {
                        "name": "Jones C.M."
                    },
                    {
                        "name": "Angius A."
                    },
                    {
                        "name": "Iacono W.G."
                    },
                    {
                        "name": "Schlessinger D."
                    },
                    {
                        "name": "McGue M."
                    },
                    {
                        "name": "Cucca F."
                    },
                    {
                        "name": "Abecasis G.R."
                    },
                    {
                        "name": "Sanna S."
                    }
                ],
                "citationCount": 32,
                "date": "2015-01-01T00:00:00Z",
                "journal": "European Journal of Human Genetics",
                "title": "Rare variant genotype imputation with thousands of study-specific whole-genome sequences: Implications for cost-effective study designs"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}