{
    "additionDate": "2021-11-01T14:40:49.214418Z",
    "biotoolsCURIE": "biotools:phyloprimer",
    "biotoolsID": "phyloprimer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gilda.varliero@bristol.ac.uk",
            "name": "Gilda Varliero",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PhyloPrimer is a taxon-specific oligonucleotide design platform. PhyloPrimer was born from a collaboration between the University of Bristol and ENOVEO, a company involved in bioremediation and microbial monitoring projects that looks into a wide variety of environmental samples with the aim of identifying specific genes and microorganisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                }
            ]
        }
    ],
    "homepage": "https://www.cerealsdb.uk.net/cerealgenomics/phyloprimer",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2021-11-01T14:41:05.969961Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/gvMicroarctic/PhyloPrimer/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gvMicroarctic/PhyloPrimer"
        }
    ],
    "name": "PhyloPrimer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.7717/PEERJ.11120",
            "metadata": {
                "abstract": "Copyright 2021 Varliero et al.Many environmental and biomedical biomonitoring and detection studies aim to explore the presence of specific organisms or gene functionalities in microbiome samples. In such cases, when the study hypotheses can be answered with the exploration of a small number of genes, a targeted PCR-approach is appropriate. However, due to the complexity of environmental microbial communities, the design of specific primers is challenging and can lead to non-specific results. We designed PhyloPrimer, the first user-friendly platform to semi-automate the design of taxon-specific oligos (i.e., PCR primers) for a gene of interest. The main strength of PhyloPrimer is the ability to retrieve and align GenBank gene sequences matching the user’s input, and to explore their relationships through an online dynamic tree. PhyloPrimer then designs oligos specific to the gene sequences selected from the tree and uses the tree non-selected sequences to look for and maximize oligo differences between targeted and non-targeted sequences, therefore increasing oligo taxon-specificity (positive/negative consensus approach). Designed oligos are then checked for the presence of secondary structure with the nearest-neighbor (NN) calculation and the presence of off-target matches with in silico PCR tests, also processing oligos with degenerate bases. Whilst the main function of PhyloPrimer is the design of taxon-specific oligos (down to the species level), the software can also be used for designing oligos to target a gene without any taxonomic specificity, for designing oligos from preselected sequences and for checking predesigned oligos. We validated the pipeline on four commercially available microbial mock communities using PhyloPrimer to design genus- and species-specific primers for the detection of Streptococcus species in the mock communities. The software performed well on these mock microbial communities and can be found at https://www.cerealsdb.uk.net/cerealgenomics/phyloprimer.",
                "authors": [
                    {
                        "name": "Barker G."
                    },
                    {
                        "name": "Malandain C."
                    },
                    {
                        "name": "Varliero G."
                    },
                    {
                        "name": "Wray J."
                    }
                ],
                "date": "2021-04-29T00:00:00Z",
                "journal": "PeerJ",
                "title": "PhyloPrimer: A taxon-specific oligonucleotide design platform"
            },
            "pmcid": "PMC8098674",
            "pmid": "33986979",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
