{"credit":[{"email":"Chen.Li@monash.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://lightning.med.monash.edu/periscope/contact.html"}],"documentation":[{"type":"GENERAL","url":"http://lightning.med.monash.edu/periscope/introduction.jsp"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"},{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein expression","uri":"http://edamontology.org/topic_0108"},{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"},{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/periscope-a-predictor-for-soluble-protein-expression-in-the-periplasm-of-escherichia-coli.html"}],"publication":[{"abstract":"Periplasmic expression of soluble proteins in Escherichia coli not only offers a much-simplified downstream purification process, but also enhances the probability of obtaining correctly folded and biologically active proteins. Different combinations of signal peptides and target proteins lead to different soluble protein expression levels, ranging from negligible to several grams per litre. Accurate algorithms for rational selection of promising candidates can serve as a powerful tool to complement with current trial-and-error approaches. Accordingly, proteomics studies can be conducted with greater efficiency and cost-effectiveness. Here, we developed a predictor with a two-stage architecture, to predict the real-valued expression level of target protein in the periplasm. The output of the first-stage support vector machine (SVM) classifier determines which second-stage support vector regression (SVR) classifier to be used. When tested on an independent test dataset, the predictor achieved an overall prediction accuracy of 78% and a Pearson's correlation coefficient (PCC) of 0.77. We further illustrate the relative importance of various features with respect to different models. The results indicate that the occurrence of dipeptide glutamine and aspartic acid is the most important feature for the classification model. Finally, we provide access to the implemented predictor through the Periscope webserver, freely accessible at http://lightning.med.monash.edu/periscope/.","authors":["Chang C.C.H.","Li C.","Webb G.I.","Tey B.","Song J.","Ramanan R.N."],"cit_count":7,"journal":"Scientific Reports","pmid":"26931649","title":"Periscope: Quantitative prediction of soluble protein expression in the periplasm of Escherichia coli","year":"2016-03-02"}],"summary":{"biotoolsCURIE":"biotools:periscope","biotoolsID":"periscope","description":"Constructed based on the rising popularity of periplasmic expression, this tool is a sequence-based predictor with a two-stage architecture that estimates the expression level and yield of soluble protein in the periplasm of E. coli.","homepage":"http://lightning.med.monash.edu/periscope/","name":"Periscope"}}