{
    "additionDate": "2017-01-13T13:14:26Z",
    "biotoolsCURIE": "biotools:edena",
    "biotoolsID": "edena",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "david.hernandez@genomic.ch",
            "name": "Dr David HERNANDEZ",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A program for assembling de novo bacterial genomes from short reads produced by Illumina sequencing platform.",
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://www.genomic.ch/edena",
    "lastUpdate": "2018-12-10T12:58:49Z",
    "license": "GPL-3.0",
    "name": "EDENA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Novel high-throughput DNA sequencing technologies allow researchers to characterize a bacterial genome during a single experiment and at a moderate cost. However, the increase in sequencing throughput that is allowed by using such platforms is obtained at the expense of individual sequence read length, which must be assembled into longer contigs to be exploitable. This study focuses on the Illumina sequencing platform that produces millions of very short sequences that are 35 bases in length. We propose a de novo assembler software that is dedicated to process such data. Based on a classical overlap graph representation and on the detection of potentially spurious reads, our software generates a set of accurate contigs of several kilobases that cover most of the bacterial genome. The assembly results were validated by comparing data sets that were obtained experimentally for Staphylococcus aureus strain MW2 and Helicobacter acinonychis strain Sheeba with that of their published genomes acquired by conventional sequencing of 1.5- to 3.0-kb fragments. We also provide indications that the broad coverage achieved by high-throughput sequencing might allow for the detection of clonal polymorphisms in the set of DNA molecules being sequenced. ©2008 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Hernandez D."
                    },
                    {
                        "name": "Francois P."
                    },
                    {
                        "name": "Farinelli L."
                    },
                    {
                        "name": "Osteras M."
                    },
                    {
                        "name": "Schrenzel J."
                    }
                ],
                "citationCount": 449,
                "date": "2008-05-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "De novo bacterial genome sequencing: Millions of very short reads assembled on a desktop computer"
            },
            "pmid": "18332092"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": [
        "3"
    ]
}