{
    "additionDate": "2017-01-17T15:08:22Z",
    "biotoolsCURIE": "biotools:glimmer",
    "biotoolsID": "glimmer",
    "collectionID": [
        "ELIXIR Trainer Tools"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://ccb.jhu.edu/contact.shtml"
        }
    ],
    "description": "System for finding genes in microbial DNA, especially the genomes of bacteria, archaea, and viruses. It uses interpolated Markov models (IMMs) to identify the coding regions and distinguish them from noncoding DNA.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://ccb.jhu.edu/software/glimmer/glim302notes.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://ccb.jhu.edu/software/glimmer/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "Glimmer",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "training_go_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm009",
            "metadata": {
                "abstract": "Motivation: The Glimmer gene-finding software has been successfully used for finding genes in bacteria, archæa and viruses representing hundreds of species. We describe several major changes to the Glimmer system, including improved methods for identifying both coding regions and start codons. We also describe a new module of Glimmer that can distinguish host and endosymbiont DNA. This module was developed in response to the discovery that eukaryotic genome sequencing projects sometimes inadvertently capture the DNA of intracellular bacteria living in the host. Results: The new methods dramatically reduce the rate of false-positive predictions, while maintaining Glimmer's 99% sensitivity rate at detecting genes in most species, and they find substantially more correct start sites, as measured by comparisons to known and well-curated genes. We show that our interpolated Markov model (IMM) DNA discriminator correctly separated 99% of the sequences in a recent genome project that produced a mixture of sequences from the bacterium Prochloron didemni and its sea squirt host, Lissoclinum patella. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Delcher A.L."
                    },
                    {
                        "name": "Bratke K.A."
                    },
                    {
                        "name": "Powers E.C."
                    },
                    {
                        "name": "Salzberg S.L."
                    }
                ],
                "citationCount": 1860,
                "date": "2007-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifying bacterial genes and endosymbiont DNA with Glimmer"
            }
        }
    ],
    "toolType": [
        "Web application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ],
    "validated": 1
}