{
    "additionDate": "2017-01-17T15:08:22Z",
    "biotoolsCURIE": "biotools:glimmer",
    "biotoolsID": "glimmer",
    "collectionID": [
        "ELIXIR Trainer Tools"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://ccb.jhu.edu/contact.shtml"
        }
    ],
    "description": "System for finding genes in microbial DNA, especially the genomes of bacteria, archaea, and viruses. It uses interpolated Markov models (IMMs) to identify the coding regions and distinguish them from noncoding DNA.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://ccb.jhu.edu/software/glimmer/glim302notes.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://ccb.jhu.edu/software/glimmer/",
    "lastUpdate": "2022-06-23T12:34:30.563352Z",
    "name": "Glimmer",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "training_go_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btm009",
            "metadata": {
                "abstract": "Motivation: The Glimmer gene-finding software has been successfully used for finding genes in bacteria, archæa and viruses representing hundreds of species. We describe several major changes to the Glimmer system, including improved methods for identifying both coding regions and start codons. We also describe a new module of Glimmer that can distinguish host and endosymbiont DNA. This module was developed in response to the discovery that eukaryotic genome sequencing projects sometimes inadvertently capture the DNA of intracellular bacteria living in the host. Results: The new methods dramatically reduce the rate of false-positive predictions, while maintaining Glimmer's 99% sensitivity rate at detecting genes in most species, and they find substantially more correct start sites, as measured by comparisons to known and well-curated genes. We show that our interpolated Markov model (IMM) DNA discriminator correctly separated 99% of the sequences in a recent genome project that produced a mixture of sequences from the bacterium Prochloron didemni and its sea squirt host, Lissoclinum patella. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Bratke K.A."
                    },
                    {
                        "name": "Delcher A.L."
                    },
                    {
                        "name": "Powers E.C."
                    },
                    {
                        "name": "Salzberg S.L."
                    }
                ],
                "citationCount": 2067,
                "date": "2007-03-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Identifying bacterial genes and endosymbiont DNA with Glimmer"
            }
        },
        {
            "doi": "10.1093/nar/26.2.544",
            "metadata": {
                "abstract": "This paper describes a new system, GLIMMER, for finding genes in microbial genomes. In a series of tests on Haemophilus influenzae, Helicobacter pylori and other complete microbial genomes, this system has proven to be very accurate at locating virtually all the genes in these sequences, outperforming previous methods. A conservative estimate based on experiments on H. pylori and H. influenzae is that the system finds > 97% of all genes. GLIMMER uses interpolated Markov models (IMMs) as a framework for capturing dependencies between nearby nucleotides in a DNA sequence. An IMM-based method makes predictions based on a variable context; i.e., a variable-length oligomer in a DNA sequence. The context used by GLIMMER changes depending on the local composition of the sequence. As a result, GLIMMER is more flexible and more powerful than fixed-order Markov methods, which have previously been the primary content-based technique for finding genes in microbial DNA.",
                "authors": [
                    {
                        "name": "Deicher A.L."
                    },
                    {
                        "name": "Kasif S."
                    },
                    {
                        "name": "Salzberg S.L."
                    },
                    {
                        "name": "White O."
                    }
                ],
                "citationCount": 776,
                "date": "1998-01-15T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Microbial gene identification using interpolated Markov models"
            },
            "pmcid": "PMC147303",
            "pmid": "9421513"
        },
        {
            "doi": "10.1093/nar/27.23.4636",
            "metadata": {
                "abstract": "The GLIMMER system for microbial gene identification finds ~ 97-98% of all genes in a genome when compared with published annotation. This paper reports on two new results: (i) significant technical improvements to GLIMMER that improve its accuracy still further, and (ii) a comprehensive evaluation that demonstrates that the accuracy of the system is likely to be higher than previously recognized. A significant proportion of the genes missed by the system appear to be hypothetical proteins whose existence is only supported by the predictions of other programs. When the analysis is restricted to genes that have significant homology to genes in other organisms, GLIMMER misses < 1% of known genes.",
                "authors": [
                    {
                        "name": "Delcher A.L."
                    },
                    {
                        "name": "Harmon D."
                    },
                    {
                        "name": "Kasif S."
                    },
                    {
                        "name": "Salzberg S.L."
                    },
                    {
                        "name": "White O."
                    }
                ],
                "citationCount": 1948,
                "date": "1999-12-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Improved microbial gene identification with GLIMMER"
            },
            "pmcid": "PMC148753",
            "pmid": "10556321"
        }
    ],
    "toolType": [
        "Suite",
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ],
    "validated": 1
}
