{
    "additionDate": "2018-08-17T18:35:12Z",
    "biotoolsCURIE": "biotools:dgca",
    "biotoolsID": "dgca",
    "credit": [
        {
            "email": "amckenz@gmail.com",
            "name": "Andrew McKenzie",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Performs differential correlation analysis on input matrices, with multiple conditions specified by a design matrix. Contains functions to filter, process, save, visualize, and interpret differential correlations of identifier-pairs across the entire identifier space, or with respect to a particular set of identifiers (e.g., one).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/DGCA/DGCA.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/DGCA/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-25T14:28:59.428419Z",
    "license": "GPL-3.0",
    "name": "DGCA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12918-016-0349-1",
            "metadata": {
                "abstract": "Background: Dissecting the regulatory relationships between genes is a critical step towards building accurate predictive models of biological systems. A powerful approach towards this end is to systematically study the differences in correlation between gene pairs in more than one distinct condition. Results: In this study we develop an R package, DGCA (for Differential Gene Correlation Analysis), which offers a suite of tools for computing and analyzing differential correlations between gene pairs across multiple conditions. To minimize parametric assumptions, DGCA computes empirical p-values via permutation testing. To understand differential correlations at a systems level, DGCA performs higher-order analyses such as measuring the average difference in correlation and multiscale clustering analysis of differential correlation networks. Through a simulation study, we show that the straightforward z-score based method that DGCA employs significantly outperforms the existing alternative methods for calculating differential correlation. Application of DGCA to the TCGA RNA-seq data in breast cancer not only identifies key changes in the regulatory relationships between TP53 and PTEN and their target genes in the presence of inactivating mutations, but also reveals an immune-related differential correlation module that is specific to triple negative breast cancer (TNBC). Conclusions: DGCA is an R package for systematically assessing the difference in gene-gene regulatory relationships under different conditions. This user-friendly, effective, and comprehensive software tool will greatly facilitate the application of differential correlation analysis in many biological studies and thus will help identification of novel signaling pathways, biomarkers, and targets in complex biological systems and diseases.",
                "authors": [
                    {
                        "name": "Katsyv I."
                    },
                    {
                        "name": "McKenzie A.T."
                    },
                    {
                        "name": "Song W.-M."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Zhang B."
                    }
                ],
                "citationCount": 155,
                "date": "2016-11-15T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "DGCA: A comprehensive R package for Differential Gene Correlation Analysis"
            },
            "pmcid": "PMC5111277",
            "pmid": "27846853"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
