{
    "accessibility": "Open access",
    "additionDate": "2024-05-18T14:51:38.985638Z",
    "biotoolsCURIE": "biotools:evoranker",
    "biotoolsID": "evoranker",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yuval.tabach@mail.huji.ac.il",
            "name": "Yuval Tabach",
            "orcidid": "https://orcid.org/0000-0001-9521-3217",
            "typeEntity": "Person"
        },
        {
            "name": "Christina Canavati",
            "typeEntity": "Person"
        }
    ],
    "description": "EvORanker is an interactive web tool for prioritizing candidate genes using coevolution and STRING.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://ccanavati.shinyapps.io/EvORanker/",
    "lastUpdate": "2024-11-24T13:57:25.412355Z",
    "name": "EvORanker",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s13073-023-01276-2",
            "metadata": {
                "abstract": "Background: Next-generation sequencing (NGS) has significantly transformed the landscape of identifying disease-causing genes associated with genetic disorders. However, a substantial portion of sequenced patients remains undiagnosed. This may be attributed not only to the challenges posed by harder-to-detect variants, such as non-coding and structural variations but also to the existence of variants in genes not previously associated with the patient’s clinical phenotype. This study introduces EvORanker, an algorithm that integrates unbiased data from 1,028 eukaryotic genomes to link mutated genes to clinical phenotypes. Methods: EvORanker utilizes clinical data, multi-scale phylogenetic profiling, and other omics data to prioritize disease-associated genes. It was evaluated on solved exomes and simulated genomes, compared with existing methods, and applied to 6260 knockout genes with mouse phenotypes lacking human associations. Additionally, EvORanker was made accessible as a user-friendly web tool. Results: In the analyzed exomic cohort, EvORanker accurately identified the “true” disease gene as the top candidate in 69% of cases and within the top 5 candidates in 95% of cases, consistent with results from the simulated dataset. Notably, EvORanker outperformed existing methods, particularly for poorly annotated genes. In the case of the 6260 knockout genes with mouse phenotypes, EvORanker linked 41% of these genes to observed human disease phenotypes. Furthermore, in two unsolved cases, EvORanker successfully identified DLGAP2 and LPCAT3 as disease candidates for previously uncharacterized genetic syndromes. Conclusions: We highlight clade-based phylogenetic profiling as a powerful systematic approach for prioritizing potential disease genes. Our study showcases the efficacy of EvORanker in associating poorly annotated genes to disease phenotypes observed in patients. The EvORanker server is freely available at https://ccanavati.shinyapps.io/EvORanker/ .",
                "authors": [
                    {
                        "name": "Allan I.A."
                    },
                    {
                        "name": "Avraham K.B."
                    },
                    {
                        "name": "Bloch I."
                    },
                    {
                        "name": "Canavati C."
                    },
                    {
                        "name": "Kamal L."
                    },
                    {
                        "name": "Kanaan M."
                    },
                    {
                        "name": "Kassem H."
                    },
                    {
                        "name": "Kawas M."
                    },
                    {
                        "name": "Levy-Lahad E."
                    },
                    {
                        "name": "Rabie G."
                    },
                    {
                        "name": "Renbaum P."
                    },
                    {
                        "name": "Sharon E."
                    },
                    {
                        "name": "Sherill-Rofe D."
                    },
                    {
                        "name": "Tabach Y."
                    },
                    {
                        "name": "Terespolsky B."
                    },
                    {
                        "name": "Zahdeh F."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Using multi-scale genomics to associate poorly annotated genes with rare diseases"
            },
            "pmcid": "PMC10765705",
            "pmid": "38178268"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}
