{
    "accessibility": "Open access",
    "additionDate": "2019-06-21T13:57:29Z",
    "biotoolsCURIE": "biotools:DupGen_finder",
    "biotoolsID": "DupGen_finder",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "qiaoxin@njau.edu.cn",
            "name": "Xin Qiao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for identification of different modes of duplicated gene pairs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/qiao-xin/DupGen_finder/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/qiao-xin/DupGen_finder",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/qiao-xin/DupGen_finder/issues"
        }
    ],
    "maturity": "Mature",
    "name": "DupGen_finder",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s13059-019-1650-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The sharp increase of plant genome and transcriptome data provide valuable resources to investigate evolutionary consequences of gene duplication in a range of taxa, and unravel common principles underlying duplicate gene retention. Results: We survey 141 sequenced plant genomes to elucidate consequences of gene and genome duplication, processes central to the evolution of biodiversity. We develop a pipeline named DupGen-finder to identify different modes of gene duplication in plants. Genes derived from whole-genome, tandem, proximal, transposed, or dispersed duplication differ in abundance, selection pressure, expression divergence, and gene conversion rate among genomes. The number of WGD-derived duplicate genes decreases exponentially with increasing age of duplication events - transposed duplication- and dispersed duplication-derived genes declined in parallel. In contrast, the frequency of tandem and proximal duplications showed no significant decrease over time, providing a continuous supply of variants available for adaptation to continuously changing environments. Moreover, tandem and proximal duplicates experienced stronger selective pressure than genes formed by other modes and evolved toward biased functional roles involved in plant self-defense. The rate of gene conversion among WGD-derived gene pairs declined over time, peaking shortly after polyploidization. To provide a platform for accessing duplicated gene pairs in different plants, we constructed the Plant Duplicate Gene Database. Conclusions: We identify a comprehensive landscape of different modes of gene duplication across the plant kingdom by comparing 141 genomes, which provides a solid foundation for further investigation of the dynamic evolution of duplicate genes.",
                "authors": [
                    {
                        "name": "Qiao X."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Yin H."
                    },
                    {
                        "name": "Qi K."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Paterson A.H."
                    }
                ],
                "citationCount": 35,
                "date": "2019-02-21T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Gene duplication and evolution in recurring polyploidization-diploidization cycles in plants"
            },
            "pmcid": "PMC6383267",
            "pmid": "30791939",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        }
    ]
}