{
    "additionDate": "2017-03-25T16:29:50Z",
    "biotoolsCURIE": "biotools:biome",
    "biotoolsID": "biome",
    "credit": [
        {
            "email": "mile.sikic@fer.hr",
            "name": "BioMe Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Biologically Relevant Metals (BioMe) is a web based platform for calculation of various statistical properties of metal binding sites including distribution of coordinate geometry and other descriptive statistics for a metal ion. The underlying database contains for each metal ion: PDB code, structure determination method, types of metal binding chains and names and coordinates of bound ligands, among other details.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Protein-metal contact calculation",
                    "uri": "http://edamontology.org/operation_1834"
                },
                {
                    "term": "Metal-bound cysteine detection",
                    "uri": "http://edamontology.org/operation_1831"
                }
            ]
        }
    ],
    "homepage": "http://metals.zesoi.fer.hr",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "name": "BioMe",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In this article, we introduce BioMe (biologically relevant metals), a web-based platform for calculation of various statistical properties of metal-binding sites. Users can obtain the following statistical properties: presence of selected ligands in metal coordination sphere, distribution of coordination numbers, percentage of metal ions coordinated by the combination of selected ligands, distribution of monodentate and bidentate metal-carboxyl, bindings for ASP and GLU, percentage of particular binuclear metal centers, distribution of coordination geometry, descriptive statistics for a metal ion-donor distance and percentage of the selected metal ions coordinated by each of the selected ligands. Statistics is presented in numerical and graphical forms. The underlying database contains information about all contacts within the range of 3Å from a metal ion found in the asymmetric crystal unit. The stored information for each metal ion includes Protein Data Bank code, structure determination method, types of metal-binding chains [protein, ribonucleic acid (RNA), deoxyribonucleic acid (DNA), water and other] and names of the bounded ligands (amino acid residue, RNA nucleotide, DNA nucleotide, water and other) and the coordination number, the coordination geometry and, if applicable, another metal(s). BioMe is on a regular weekly update schedule. It is accessible at http://metals.zesoi.fer.hr. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Tus A."
                    },
                    {
                        "name": "Rakipovic A."
                    },
                    {
                        "name": "Peretin G."
                    },
                    {
                        "name": "Tomic S."
                    },
                    {
                        "name": "Sikic M."
                    }
                ],
                "citationCount": 18,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BioMe: Biologically relevant metals"
            },
            "pmid": "22693222"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}