{
    "additionDate": "2017-08-03T19:03:08Z",
    "biotoolsCURIE": "biotools:targetprofiler",
    "biotoolsID": "targetprofiler",
    "credit": [
        {
            "email": "poirazi@dendrites.gr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/site/cbgiliopoulos/"
        }
    ],
    "description": "A novel miRNA target prediction tool that utilizes a probabilistic learning algorithm in the form of a hidden Markov model trained on experimentally verified miRNA targets.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mirna.imbb.forth.gr/Targetprofiler.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://mirna.imbb.forth.gr/Targetprofiler.html",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/targetprofiler-mirna-target-prediction-tool.html"
        }
    ],
    "name": "TargetProfiler",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Computational methods for miRNA target prediction vary in the algorithm used; and while one can state opinions about the strengths or weaknesses of each particular algorithm, the fact of the matter is that they fall substantially short of capturing the full detail of physical, temporal and spatial requirements of miRNA:target-mRNA interactions. Here, we introduce a novel miRNA target prediction tool called Targetprofiler that utilizes a probabilistic learning algorithm in the form of a hidden Markov model trained on experimentally verified miRNA targets. Using a large scale protein downregulation data set we validate our method and compare its performance to existing tools. We find that Targetprofiler exhibits greater correlation between computational predictions and protein downregulation and predicts experimentally verified miRNA targets more accurately than three other tools. Concurrently, we use primer extension to identify the mature sequence of a novel miRNA gene recently identified within a cancer associated genomic region and use Targetprofiler to predict its potential targets. Experimental verification of the ability of this small RNA molecule to regulate the expression of CC ND2, a gene with documented oncogenic activity, confirms its functional role as a miRNA. These findings highlight the competitive advantage of our tool and its efficacy in extracting biologically significant results. © 2012 Landes Bioscience.",
                "authors": [
                    {
                        "name": "Oulas A."
                    },
                    {
                        "name": "Karathanasis N."
                    },
                    {
                        "name": "Louloupi A."
                    },
                    {
                        "name": "Iliopoulos I."
                    },
                    {
                        "name": "Kalantidis K."
                    },
                    {
                        "name": "Poirazi P."
                    }
                ],
                "citationCount": 16,
                "date": "2012-01-01T00:00:00Z",
                "journal": "RNA Biology",
                "title": "A new microRNA target prediction tool identifies a novel interaction of a putative miRNA with CCND2"
            },
            "pmid": "22954617"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}