{"credit":[{"email":"chuangma2006@gmail.com","name":"Chuang Ma","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.cmbb.arizona.edu/"}],"documentation":[{"url":"https://cran.r-project.org/web/packages/mlDNA/mlDNA.pdf"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"},{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mldna-1-1-machine-learning-based-differential-network-analysis-of-transcriptome-data.html"}],"publication":[{"abstract":"Machine learning (ML) is an intelligent data mining technique that builds a prediction model based on the learning of prior knowledge to recognize patterns in large-scale data sets. We present an ML-based methodology for transcriptome analysis via comparison of gene coexpression networks, implemented as an R package called machine learning-based differential network analysis (mlDNA) and apply this method to reanalyze a set of abiotic stress expression data in Arabidopsis thaliana. The mlDNA first used a ML-based filtering process to remove nonexpressed, constitutively expressed, or non-stressresponsive \"noninformative\" genes prior to network construction, through learning the patterns of 32 expression characteristics of known stress-related genes. The retained \"informative\" genes were subsequently analyzed by ML-based network comparison to predict candidate stress-related genes showing expression and network differences between control and stress networks, based on 33 network topological characteristics. Comparative evaluation of the network-centric and gene-centric analytic methods showed that mlDNA substantially outperformed traditional statistical testing-based differential expression analysis at identifying stress-related genes, with markedly improved prediction accuracy. To experimentally validate the mlDNA predictions, we selected 89 candidates out of the 1784 predicted salt stress-related genes with available SALK T-DNA mutagenesis lines for phenotypic screening and identified two previously unreported genes, mutants of which showed salt-sensitive phenotypes. © 2014 American Society of Plant Biologists. All rights reserved.","authors":["Ma C.","Xin M.","Feldmann K.A.","Wang X."],"cit_count":36,"journal":"Plant Cell","pmid":"24520154","title":"Machine learning-based differential network analysis: A study of stress-responsive transcriptomes in Arabidopsis","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:mldna","biotoolsID":"mldna","description":"R package  for machine learning (ML)-based differential network analysis of transcriptimic data.","homepage":"http://www.cmbb.arizona.edu/mlDNA/","name":"mlDNA"}}