{
    "additionDate": "2017-08-20T15:49:10Z",
    "biotoolsCURIE": "biotools:finestructure",
    "biotoolsID": "finestructure",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "dan.lawson@bristol.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "fineSTRUCTURE is an algorithm for identifying population structure using dense sequencing data. By using the output of ChromoPainter as a (nearly) sufficient summary statistic, it is able to perform model-based Bayesian clustering on large datasets, including full resequencing data, and can handle up to 1000s of individuals. Full assignment uncertainty is given.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://paintmychromosomes.com/"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics",
            "nicolo.cultrera"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://paintmychromosomes.com/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-17T21:19:19Z",
    "license": "Other",
    "name": "fineSTRUCTURE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_018170"
        }
    ],
    "owner": "nicolo.cultrera",
    "publication": [
        {
            "doi": "10.1371/journal.pgen.1002453",
            "metadata": {
                "abstract": "The advent of genome-wide dense variation data provides an opportunity to investigate ancestry in unprecedented detail, but presents new statistical challenges. We propose a novel inference framework that aims to efficiently capture information on population structure provided by patterns of haplotype similarity. Each individual in a sample is considered in turn as a recipient, whose chromosomes are reconstructed using chunks of DNA donated by the other individuals. Results of this \"chromosome painting\" can be summarized as a \"coancestry matrix,\" which directly reveals key information about ancestral relationships among individuals. If markers are viewed as independent, we show that this matrix almost completely captures the information used by both standard Principal Components Analysis (PCA) and model-based approaches such as STRUCTURE in a unified manner. Furthermore, when markers are in linkage disequilibrium, the matrix combines information across successive markers to increase the ability to discern fine-scale population structure using PCA. In parallel, we have developed an efficient model-based approach to identify discrete populations using this matrix, which offers advantages over PCA in terms of interpretability and over existing clustering algorithms in terms of speed, number of separable populations, and sensitivity to subtle population structure. We analyse Human Genome Diversity Panel data for 938 individuals and 641,000 markers, and we identify 226 populations reflecting differences on continental, regional, local, and family scales. We present multiple lines of evidence that, while many methods capture similar information among strongly differentiated groups, more subtle population structure in human populations is consistently present at a much finer level than currently available geographic labels and is only captured by the haplotype-based approach. The software used for this article, ChromoPainter and fineSTRUCTURE, is available from http://www.paintmychromosomes.com/. © 2012 Lawson et al.",
                "authors": [
                    {
                        "name": "Falush D."
                    },
                    {
                        "name": "Hellenthal G."
                    },
                    {
                        "name": "Lawson D.J."
                    },
                    {
                        "name": "Myers S."
                    }
                ],
                "citationCount": 471,
                "date": "2012-01-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Inference of population structure using dense haplotype data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
