{
    "additionDate": "2024-12-23T12:44:47.964606Z",
    "biotoolsCURIE": "biotools:gibi230_radiomic_features_extraction",
    "biotoolsID": "gibi230_radiomic_features_extraction",
    "collectionID": [
        "EUCAIM"
    ],
    "description": "Implemented by GIBI230, this tool is a Docker-based software designed for extracting radiomic features from 3D medical images in NIfTI format using the PyRadiomics library (if DICOM images, the DICOM to NIFTI converter must be run before using this tool). It streamlines the radiomics calculation process by generating a structured CSV file containing all extracted variables from medical images.\nThe dockerized software enables users to configure parameters like filters, bin width, resampling spacing, and normalization settings can be specified. The output radiomic variables provide quantitative information for further analysis in medical imaging research and machine learning applications. \nSpecially important the parameter selection of the band width. For robust and reproducible results, a bin width of 5 is commonly recommended, but it should be adjusted based on image resolution, modality, and noise levels.",
    "editPermission": {
        "type": "group"
    },
    "homepage": "https://www.acim.lafe.san.gva.es/acim/?page_id=675&lang=es",
    "language": [
        "Python"
    ],
    "lastUpdate": "2025-06-05T11:07:12.219171Z",
    "name": "Radiomic features extraction (EUCAIM-SW-054_T-02-01-003)",
    "owner": "pedromiguel_martinez_HULAFE",
    "publication": [
        {
            "doi": "10.1148/ryai.230208",
            "metadata": {
                "abstract": "Purpose: To evaluate the reproducibility of radiomics features extracted from T2-weighted MR images in patients with neuroblastoma. Materials and Methods: A retrospective study included 419 patients (mean age, 29 months ± 34 [SD]; 220 male, 199 female) with neu-roblastic tumors diagnosed between 2002 and 2023, within the scope of the PRedictive In-silico Multiscale Analytics to support cancer personalized diaGnosis and prognosis, Empowered by imaging biomarkers (ie, PRIMAGE) project, involving 746 T2/T2*-weighted MRI sequences at diagnosis and/or after initial chemotherapy. Images underwent processing steps (denoising, inhomogeneity bias field cor-rection, normalization, and resampling). Tumors were automatically segmented, and 107 shape, first-order, and second-order radiomics features were extracted, considered as the reference standard. Subsequently, the previous image processing settings were modified, and volumetric masks were applied. New radiomics features were extracted and compared with the reference standard. Reproducibility was assessed using the concordance correlation coefficient (CCC); intrasubject repeatability was measured using the coefficient of variation (CoV). Results: When normalization was omitted, only 5% of the radiomics features demonstrated high reproducibility. Statistical analysis revealed significant changes in the normalization and resampling processes (P < .001). Inhomogeneities removal had the least impact on radiomics (83% of parameters remained stable). Shape features remained stable after mask modifications, with a CCC greater than 0.90. Mask modifications were the most favorable changes for achieving high CCC values, with a radiomics features stability of 70%. Only 7% of second-order radiomics features showed an excellent CoV of less than 0.10. Conclusion: Modifications in the T2-weighted MRI preparation process in patients with neuroblastoma resulted in changes in radiomics features, with normalization identified as the most influential factor for reproducibility. Inhomogeneities removal had the least impact on radiomics features.",
                "authors": [
                    {
                        "name": "Alberich L.C."
                    },
                    {
                        "name": "Alberich-Bayarri A."
                    },
                    {
                        "name": "Canete A."
                    },
                    {
                        "name": "Fernandez-Paton M."
                    },
                    {
                        "name": "Hero B."
                    },
                    {
                        "name": "Ladenstein R."
                    },
                    {
                        "name": "Marti-Bonmati L."
                    },
                    {
                        "name": "Maya A.G."
                    },
                    {
                        "name": "Nebot C.S."
                    },
                    {
                        "name": "Neri E."
                    },
                    {
                        "name": "Pastor A.J."
                    },
                    {
                        "name": "Potschger U."
                    },
                    {
                        "name": "Sierra J.M.C."
                    },
                    {
                        "name": "Taschner-Mandl S."
                    },
                    {
                        "name": "Veiga-Canuto D."
                    },
                    {
                        "name": "de las Heras B.M."
                    }
                ],
                "citationCount": 1,
                "date": "2024-07-01T00:00:00Z",
                "journal": "Radiology: Artificial Intelligence",
                "title": "Reproducibility Analysis of Radiomic Features on T2-weighted MR Images after Processing and Segmentation Alterations in Neuroblastoma Tumors"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "version": [
        "1.0.0"
    ]
}
