
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Identification of dispersed or interspersed repeats, most of which are derived from transposons, retrotransposons or retrovirus-like elements, is an important step in genome annotation. Software tools that compare genomic sequences with precompiled repeat reference libraries using sensitive similarity-based methods provide reliable means of finding the positions of fragments homologous to known repeats. However, their output is often incomplete and fragmented owing to the mutations (nucleotide substitutions, deletions or insertions) that can result in considerable divergence from the reference sequence. Merging these fragments to identify the whole region that represents an ancient copy of a mobile element is challenging, particularly if the element is large and suffered multiple deletions or insertions. Here we report PLOTREP, a tool designed to post-process results obtained by sequence similarity search and merge fragments belonging to the same copy of a repeat. The software allows rapid visual inspection of the results using a dot-plot like graphical output. The web implementation of PLOTREP is available at http://bioinformatics.abc.hu/PLOTREP/. © The Author 2006. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Toth G.",
                "Deak G.",
                "Barta E.",
                "Kiss G.B."
            ],
            "cit_count": 13,
            "journal": "Nucleic Acids Research",
            "pmid": "16845104",
            "title": "PLOTREP: A web tool for defragmentation and visual analysis of dispersed genomic repeats",
            "year": "2006-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:plotrep",
        "biotoolsID": "plotrep",
        "description": "Tool for the visual analysis of dispersed genomic repeats. The tool is designed to merge fragments belonging to the same copy of a repeat and allows for the inspection of the results using a dot-plot like graphical output.",
        "homepage": "http://repeats.abc.hu/cgi-bin/plotrep.pl",
        "name": "PlotRep"
    }
}