{
    "accessibility": "Open access",
    "additionDate": "2021-12-06T16:32:48.012171Z",
    "biotoolsCURIE": "biotools:ivs-caffe",
    "biotoolsID": "ivs-caffe",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chia-Chi Tsai",
            "orcidid": "https://orcid.org/0000-0002-2318-6376"
        },
        {
            "name": "Jiun-In Guo",
            "orcidid": "https://orcid.org/0000-0003-0402-2621"
        }
    ],
    "description": "IVS Caffe is a deep learning framework made with expression, speed, and modularity in mind.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/apple35932003/IVS-Caffe",
    "language": [
        "C++",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-12-06T16:32:48.014692Z",
    "license": "MIT",
    "name": "IVS-Caffe",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TNNLS.2021.3072145",
            "metadata": {
                "abstract": "IEEEThis article proposes a hardware-oriented neural network development tool, called Intelligent Vision System Lab (IVS)-Caffe. IVS-Caffe can simulate the hardware behavior of convolution neural network inference calculation. It can quantize weights, input, and output features of convolutional neural network (CNN) and simulate the behavior of multipliers and accumulators calculation to achieve the bit-accurate result. Furthermore, it can test the accuracy of the chosen CNN hardware accelerator. Besides, this article proposes an algorithm to solve the deviation of gradient backpropagation in the bit-accurate quantized multipliers and accumulators. This allows the training of a bit-accurate model and further increases the accuracy of the CNN model at user-designed bit width. The proposed tool takes Faster region based CNN (R-CNN) + Matthew D. Zeiler and Rob Fergus (ZF)-Net, Single Shot MultiBox Detector (SSD) + VGG, SSD + MobileNet, and Tiny you only look once (YOLO) v2 as the experimental models. These models include both one-stage object detection and two-stage object detection models, and base networks include the convolution layer, the fully connected layer, and the modern advanced layers, such as the inception module and depthwise separable convolution. In these experiments, direct quantization of layer-I/O fixed-point models to bit-accurate models will have a 2&#x0025; mean average precision (mAP) drop of accuracy in the constraint that all layers' accumulators and multipliers are quantized to less or equal to 14 and 12 bit, respectively. After retraining of these quantized models with the proposed IVS-Caffe, we can achieve less than 1&#x0025; mAP drop in accuracy in the constraint that all layers' accumulators and multipliers are quantized to less or equal to 14 and 11 bit, respectively. With the proposed IVS-Caffe, we can analyze the accuracy of the target model when it is running at hardware accelerators with different bit widths, which is beneficial to fine-tune the target model or customize the hardware accelerators with lower power consumption. Code is available at https://github.com/apple35932003/IVS-Caffe.",
                "authors": [
                    {
                        "name": "Tsai C."
                    },
                    {
                        "name": "Guo J."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "IVS-Caffe--Hardware-Oriented Neural Network Model Development"
            },
            "pmid": "34310321"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}