{"credit":[{"email":"c.welsh2@newcastle.ac.uk","name":"Ciaran Welsh","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://pycotools.readthedocs.io/en/copasiversion21/"}],"function":[{"operation":[{"term":"Service invocation","uri":"http://edamontology.org/operation_3763"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Simulation experiment","uri":"http://edamontology.org/topic_3524"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"publication":[{"abstract":"© The Author(s) 2018. Published by Oxford University Press. Motivation: COPASI is an open source software package for constructing, simulating and analyzing dynamic models of biochemical networks. COPASI is primarily intended to be used with a graphical user interface but often it is desirable to be able to access COPASI features programmatically, with a high level interface. Results: PyCoTools is a Python package aimed at providing a high level interface to COPASI tasks with an emphasis on model calibration. PyCoTools enables the construction of COPASI models and the execution of a subset of COPASI tasks including time courses, parameter scans and parameter estimations. Additional ‘composite’ tasks which use COPASI tasks as building blocks are available for increasing parameter estimation throughput, performing identifiability analysis and performing model selection. PyCoTools supports exploratory data analysis on parameter estimation data to assist with troubleshooting model calibrations. We demonstrate PyCoTools by posing a model selection problem designed to show case PyCoTools within a realistic scenario. The aim of the model selection problem is to test the feasibility of three alternative hypotheses in explaining experimental data derived from neonatal dermal fibroblasts in response to TGF-b over time. PyCoTools is used to critically analyze the parameter estimations and propose strategies for model improvement.","authors":["Welsh C.M.","Fullard N.","Proctor C.J.","Martinez-Guimera A.","Isfort R.J.","Bascom C.C.","Tasseff R.","Przyborski S.A.","Shanley D.P."],"cit_count":0,"doi":"10.1093/bioinformatics/bty409","journal":"Bioinformatics","title":"PyCoTools: A python toolbox for COPASI","year":"2018-01-01"}],"summary":{"biotoolsCURIE":"biotools:pycotools","biotoolsID":"pycotools","description":"Python package aimed at providing a high level interface to COPASI tasks with an emphasis on model calibration.","homepage":"https://github.com/CiaranWelsh/pycotools","name":"PyCoTools"}}