{
    "additionDate": "2021-01-18T09:28:08Z",
    "biotoolsCURIE": "biotools:ncri",
    "biotoolsID": "ncri",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lw2247@yeah.net",
            "name": "Lihong Wang",
            "typeEntity": "Person"
        },
        {
            "email": "weijiang@nuaa.edu.cn",
            "name": "Wei Jiang",
            "orcidid": "https://orcid.org/0000-0003-1591-4721",
            "typeEntity": "Person"
        }
    ],
    "description": "A manually curated database for experimentally validated non-coding RNAs in inflammation.\n\nNon-coding RNAs in Inflammation (ncRI) provides a manually curated database for experimentally validated non-coding RNAs in inflammatary disease. Recently, inflammation is considered to be central to the onset, progression, and outcome of infectious and noninfectious diseases, especially believed as a hallmark of cancer. In addition, the inflammatory agents, such as cytokine and chemokines, can regulate the behavior of the immune system and involve in the immunotherapy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "http://www.jianglab.cn/ncRI/",
    "lastUpdate": "2021-03-08T09:50:58Z",
    "name": "ncRI",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-06794-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Inflammation has been considered to be central to the onset, progression, and outcome of infectious diseases, especially as one of the hallmarks of cancer. Non-coding RNAs (ncRNAs), such as miRNAs and lncRNAs, have emerged as vital regulators in control of immune and inflammatory processes, and also play important roles in the inflammatory disease and immunotherapy. Results: In this study, we presented a database ncRI, which documented experimentally verified ncRNAs in inflammatory diseases, from published articles. Each entry contained the detailed information about ncRNA name, inflammatory diseases, mechanism, experimental techniques (e.g., microarray, RNA-seq, qRT-PCR), experimental samples (cell line and/or tissue), expression patterns of ncRNA (up-regulated or down-regulated), reference information (PubMed ID, year of publication, title of paper) and so on. Collectively, ncRI recorded 11,166 entries that include 1976 miRNAs, 1377 lncRNAs and 107 other ncRNAs across 3 species (human, mouse, and rat) from more than 2000 articles. All these data are free for users to search, browse and download. Conclusion: In summary, the presented database ncRI provides a relatively comprehensive credible repository about ncRNAs and their roles in inflammatory diseases, and will be helpful for research on immunotherapy. The ncRI is now freely available to all users at http://www.jianglab.cn/ncRI/.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zhou S."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Meng Q."
                    },
                    {
                        "name": "Ma X."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Jiang W."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "NcRI: A manually curated database for experimentally validated non-coding RNAs in inflammation"
            },
            "pmcid": "PMC7268337",
            "pmid": "32487016"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}