{
    "additionDate": "2018-06-30T18:54:46Z",
    "biotoolsCURIE": "biotools:dhga",
    "biotoolsID": "dhga",
    "credit": [
        {
            "email": "samarendra4849@gmail.com",
            "name": "Samarendra Das",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identification of hub genes in a gene co-expression network from gene expression data. The differential network analysis for two contrasting conditions leads to the identification of various types of hubs like Housekeeping, Unique to stress (Disease) and Unique to control (Normal) hub genes.",
    "documentation": [
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/dhga/dhga.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/dhga/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "dhga",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0169605",
            "metadata": {
                "abstract": "© 2017 Das et al.This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, andreproduction in any medium, provided the original author and source are credited. Selection of informative genes is an important problem in gene expression studies. The small sample size and the large number of genes in gene expression data make the selection process complex. Further, the selected informative genes may act as a vital input for gene co-expression network analysis. Moreover, the identification of hub genes and module interactions in gene co-expression networks is yet to be fully explored. This paper presents a statistically sound gene selection technique based on support vector machine algorithm for selecting informative genes from high dimensional gene expression data. Also, an attempt has been made to develop a statistical approach for identification of hub genes in the gene co-expression network. Besides, a differential hub gene analysis approach has also been developed to group the identified hub genes into various groups based on their gene connectivity in a case vs. control study. Based on this proposed approach, an R package, i.e., dhga (https://cran.r-project.org/web/packages/dhga) has been developed. The comparative performance of the proposed gene selection technique as well as hub gene identification approach was evaluated on three different crop microarray datasets. The proposed gene selection technique outperformed most of the existing techniques for selecting robust set of informative genes. Based on the proposed hub gene identification approach, a few number of hub genes were identified as compared to the existing approach, which is in accordance with the principle of scale free property of real networks. In this study, some key genes along with their Arabidopsis orthologs has been reported, which can be used for Aluminum toxic stress response engineering in soybean. The functional analysis of various selected key genes revealed the underlying molecular mechanisms of Aluminum toxic stress response in soybean.",
                "authors": [
                    {
                        "name": "Das S."
                    },
                    {
                        "name": "Meher P.K."
                    },
                    {
                        "name": "Rai A."
                    },
                    {
                        "name": "Bhar L.M."
                    },
                    {
                        "name": "Mandal B.N."
                    }
                ],
                "citationCount": 3,
                "date": "2017-01-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Statistical approaches for gene selection, hub gene identification and module interaction in gene co-expression network analysis: An application to aluminum stress in soybean (Glycine max L.)"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}