{
    "additionDate": "2021-01-18T10:58:59Z",
    "biotoolsCURIE": "biotools:ceeder-evidence",
    "biotoolsID": "ceeder-evidence",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Ko Konno",
            "typeEntity": "Person"
        }
    ],
    "description": "CEEDER is an open access evidence service to help evidence consumers find reliable evidence reviews and syntheses to inform their decision making. The CEEDER project team collates all forms of evidence reviews and syntheses relevant to environmental management, as they are published or otherwise become available globally. The CEEDER database lists available (commercially published and ‘grey’) syntheses of primary research (e.g. critical reviews, meta-analyses, systematic reviews, rapid reviews) conducted to assess evidence on a specific question of environmental policy or management relevance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                }
            ]
        }
    ],
    "homepage": "https://environmentalevidence.shinyapps.io/CEEDER/",
    "lastUpdate": "2021-02-10T12:19:45Z",
    "name": "CEEDER evidence database",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.ENVSCI.2020.08.021",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdEvidence-informed decision-making aims to deliver effective actions informed by the best available evidence. Given the large quantity of primary literature, and time constraints faced by policy-makers and practitioners, well-conducted evidence reviews can provide a valuable resource to support decision-making. However, previous research suggests that some evidence reviews may not be sufficiently reliable to inform decisions in the environmental sector due to low standards of conduct and reporting. While some evidence reviews are of high reliability, there is currently no way for policy-makers and practitioners to quickly and easily find them among the many lower reliability ones. Alongside this lack of transparency, there is little incentive or support for review authors, editors and peer-reviewers to improve reliability. To address these issues, we introduce a new online, freely available and first-of-its-kind evidence service: the Collaboration for Environmental Evidence Database of Evidence Reviews (CEEDER: www.environmentalevidence.org/ceeder). CEEDER aims to transform communication of evidence review reliability to researchers, policy-makers and practitioners through independent assessment of key aspects of the conduct, reporting and data limitations of available evidence reviews claiming to assess environmental impacts or the effectiveness of interventions relevant to policy and practice. At the same time, CEEDER will provide support to improve the standards of future evidence reviews and support evidence translation and knowledge mobilisation to help inform environmental decision-making.",
                "authors": [
                    {
                        "name": "Konno K."
                    },
                    {
                        "name": "Cheng S.H."
                    },
                    {
                        "name": "Eales J."
                    },
                    {
                        "name": "Frampton G."
                    },
                    {
                        "name": "Kohl C."
                    },
                    {
                        "name": "Livoreil B."
                    },
                    {
                        "name": "Macura B."
                    },
                    {
                        "name": "O'Leary B.C."
                    },
                    {
                        "name": "Randall N.P."
                    },
                    {
                        "name": "Taylor J.J."
                    },
                    {
                        "name": "Woodcock P."
                    },
                    {
                        "name": "Pullin A.S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Environmental Science and Policy",
                "title": "The CEEDER database of evidence reviews: An open-access evidence service for researchers and decision-makers"
            },
            "pmcid": "PMC7474817",
            "pmid": "32922207"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}