
{
    "credit": [
        {
            "email": "leena.choi@vanderbilt.edu",
            "name": "Leena Choi",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/PheWAS/PheWAS"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Phenomics",
                "uri": "http://edamontology.org/topic_3298"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018.Motivation: Phenome-wide association studies (PheWAS) have been used to discover many genotype-phenotype relationships and have the potential to identify therapeutic and adverse drug outcomes using longitudinal data within electronic health records (EHRs). However, the statistical methods for PheWAS applied to longitudinal EHR medication data have not been established. Results: In this study, we developed methods to address two challenges faced with reuse of HER for this purpose: confounding by indication, and low exposure and event rates. We used Monte Carlo simulation to assess propensity score (PS) methods, focusing on two of the most commonly used methods, PS matching and PS adjustment, to address confounding by indication. We also compared two logistic regression approaches (the default of Wald versus Firth's penalized maximum likelihood, PML) to address complete separation due to sparse data with low exposure and event rates. PS adjustment resulted in greater power than PS matching, while controlling Type I error at 0.05. The PML method provided reasonable P-values, even in cases with complete separation, with well controlled Type I error rates. Using PS adjustment and the PML method, we identify novel latent drug effects in pediatric patients exposed to two common antibiotic drugs, ampicillin and gentamicin.",
            "authors": [
                "Choi L.",
                "Carroll R.J.",
                "Beck C.",
                "Mosley J.D.",
                "Roden D.M.",
                "Denny J.C.",
                "Van Driest S.L."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/bty306",
            "journal": "Bioinformatics",
            "title": "Evaluating statistical approaches to leverage large clinical datasets for uncovering therapeutic and adverse medication effects",
            "year": "2018-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phewas_clinical",
        "biotoolsID": "phewas_clinical",
        "description": "Evaluating statistical approaches to leverage large clinical datasets for uncovering therapeutic and adverse medication effects.",
        "homepage": "https://github.com/PheWAS/PheWAS",
        "name": "PheWAS"
    }
}