{
    "accessibility": "Open access",
    "additionDate": "2021-11-08T13:26:49.904067Z",
    "biotoolsCURIE": "biotools:gleaner",
    "biotoolsID": "gleaner",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cczhao@tongji.edu.cn",
            "name": "Chengchen Zhao",
            "orcidid": "https://orcid.org/0000-0002-8454-6347",
            "typeEntity": "Person"
        },
        {
            "email": "gfliu0806@tongji.edu.cn",
            "name": "Guifen Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "GLEANER is a web server for GermLine cycle Expression ANalysis and Epigenetics Roadmap visualization. GLEANER provides a comprehensive collection of the transcriptome, DNA methylome, chromatin accessibility, and H3K4me3, H3K27me3, and H3K9me3 histone modification characteristics in human and mouse germline cycles.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://compbio-zhanglab.org/GLEANER",
    "lastUpdate": "2021-11-08T13:26:49.918490Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://compbio-zhanglab.org/GLEANER/data.html"
        }
    ],
    "name": "GLEANER",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04217-1",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Germline cells are important carriers of genetic and epigenetic information transmitted across generations in mammals. During the mammalian germline cell development cycle (i.e., the germline cycle), cell potency changes cyclically, accompanied by dynamic transcriptional changes and epigenetic reprogramming. Recently, to understand these dynamic and regulatory mechanisms, multiomic analyses, including transcriptomic and epigenomic analyses of DNA methylation, chromatin accessibility and histone modifications of germline cells, have been performed for different stages in human and mouse germline cycles. However, the long time span of the germline cycle and material scarcity of germline cells have largely limited the understanding of these dynamic characteristic changes. A tool that integrates the existing multiomics data and visualizes the overall continuous dynamic trends in the germline cycle can partially overcome such limitations. Results: Here, we present GLEANER, a web server for GermLine cycle Expression ANalysis and Epigenetics Roadmap visualization. GLEANER provides a comprehensive collection of the transcriptome, DNA methylome, chromatin accessibility, and H3K4me3, H3K27me3, and H3K9me3 histone modification characteristics in human and mouse germline cycles. For each input gene, GLEANER shows the integrative analysis results of its transcriptional and epigenetic features, the genes with correlated transcriptional changes, and the overall continuous dynamic trends in the germline cycle. We further used two case studies to demonstrate the detailed functionality of GLEANER and highlighted that it can provide valuable clues to the epigenetic regulation mechanisms in the genetic and epigenetic information transmitted during the germline cycle. Conclusions: To the best of our knowledge, GLEANER is the first web server dedicated to the analysis and visualization of multiomics data related to the mammalian germline cycle. GLEANER is freely available at http://compbio-zhanglab.org/GLEANER.",
                "authors": [
                    {
                        "name": "Hua Y."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Zeng S."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GLEANER: a web server for GermLine cycle Expression ANalysis and Epigenetic Roadmap visualization"
            },
            "pmcid": "PMC8165803",
            "pmid": "34058973"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
