{
    "accessibility": "Open access",
    "additionDate": "2021-11-27T18:46:25.750303Z",
    "biotoolsCURIE": "biotools:dyconnmap",
    "biotoolsID": "dyconnmap",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "avraam.marimpis@maastrichtuniversity.nl",
            "name": "Avraam D. Marimpis",
            "orcidid": "https://orcid.org/0000-0003-1551-9940",
            "typeEntity": "Person"
        }
    ],
    "description": "A neuroimaging module for dynamic connectome mapping.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/makism/dyconnmap",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-27T18:46:25.752927Z",
    "license": "BSD-3-Clause",
    "name": "Dyconnmap",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/HBM.25589",
            "metadata": {
                "abstract": "© 2021 The Authors. Human Brain Mapping published by Wiley Periodicals LLC.Despite recent progress in the analysis of neuroimaging data sets, our comprehension of the main mechanisms and principles which govern human brain cognition and function remains incomplete. Network neuroscience makes substantial efforts to manipulate these challenges and provide real answers. For the last decade, researchers have been modelling brain structure and function via a graph or network that comprises brain regions that are either anatomically connected via tracts or functionally via a more extensive repertoire of functional associations. Network neuroscience is a relatively new multidisciplinary scientific avenue of the study of complex systems by pursuing novel ways to analyze, map, store and model the essential elements and their interactions in complex neurobiological systems, particularly the human brain, the most complex system in nature. Due to a rapid expansion of neuroimaging data sets' size and complexity, it is essential to propose and adopt new empirical tools to track dynamic patterns between neurons and brain areas and create comprehensive maps. In recent years, there is a rapid growth of scientific interest in moving functional neuroimaging analysis beyond simplified group or time-averaged approaches and sophisticated algorithms that can capture the time-varying properties of functional connectivity. We describe algorithms and network metrics that can capture the dynamic evolution of functional connectivity under this perspective. We adopt the word ‘chronnectome’ (integration of the Greek word ‘Chronos’, which means time, and connectome) to describe this specific branch of network neuroscience that explores how mutually informed brain activity correlates across time and brain space in a functional way. We also describe how good temporal mining of temporally evolved dynamic functional networks could give rise to the detection of specific brain states over which our brain evolved. This characteristic supports our complex human mind. The temporal evolution of these brain states and well-known network metrics could give rise to new analytic trends. Functional brain networks could also increase the multi-faced nature of the dynamic networks revealing complementary information. Finally, we describe a python module (https://github.com/makism/dyconnmap) which accompanies this article and contains a collection of dynamic complex network analytics and measures and demonstrates its great promise for the study of a healthy subject's repeated fMRI scans.",
                "authors": [
                    {
                        "name": "Dimitriadis S.I."
                    },
                    {
                        "name": "Goebel R."
                    },
                    {
                        "name": "Marimpis A.D."
                    }
                ],
                "date": "2021-10-15T00:00:00Z",
                "journal": "Human Brain Mapping",
                "title": "Dyconnmap: Dynamic connectome mapping—A neuroimaging python module"
            },
            "pmcid": "PMC8449119",
            "pmid": "34250674"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}
