{
    "additionDate": "2020-01-14T09:44:04Z",
    "biotoolsCURIE": "biotools:UCSR",
    "biotoolsID": "UCSR",
    "confidence_flag": "low",
    "description": "Developing the Global Health Cost Consortium Unit Cost Study Repository for HIV and TB.\n\nConsistently defined, accurate, and easily accessible cost data are a valuable resource to inform efficiency analyses, budget preparation, and sustainability planning in global health. The Global Health Cost Consortium (GHCC) designed the Unit Cost Study Repository (UCSR) to be a resource for standardised HIV and TB intervention cost data displayed by key characteristics such as intervention type, country, and target population.\n\n||| HOMEPAGE BROKEN!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Health', 'GHCC', 'UCSR GHCC', 'Developing Global Health Cost Consortium Unit Cost Study Repository HIV TB'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://ghcosting.org/pages/data/ucsr/",
    "lastUpdate": "2020-01-14T09:44:04Z",
    "name": "UCSR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.2989/16085906.2019.1680398",
            "metadata": {
                "abstract": "© 2019, © 2019 The Author(s). Co-published by NISC Pty (Ltd) and Informa UK Limited, trading as Taylor & Francis Group.Consistently defined, accurate, and easily accessible cost data are a valuable resource to inform efficiency analyses, budget preparation, and sustainability planning in global health. The Global Health Cost Consortium (GHCC) designed the Unit Cost Study Repository (UCSR) to be a resource for standardised HIV and TB intervention cost data displayed by key characteristics such as intervention type, country, and target population. To develop the UCSR, the GHCC defined a typology of interventions for each disease; aligned interventions according to the standardised principles, methods, and cost and activity categories from the GHCC Reference Case for Estimating the Costs of Global Health Services and Interventions; completed a systematic literature review; conducted extensive data extraction; performed quality assurance; grappled with complex methodological issues such as the proper approach to the inflation and conversion of costs; developed and implemented a study quality rating system; and designed a web-based user interface that flexibly displays large amounts of data in a user-friendly way. Key lessons learned from the extraction process include the importance of assessing the multiple uses of extracted data; the critical role of standardising definitions (particularly units of measurement); using appropriate classifications of interventions and components of costs; the efficiency derived from programming data checks; and the necessity of extraction quality monitoring by senior analysts. For the web interface, lessons were: understanding the target audiences, including consulting them regarding critical characteristics; designing the display of data in “levels”; and incorporating alert and unique trait descriptions to further clarify differences in the data.",
                "authors": [
                    {
                        "name": "DeCormier Plosky W."
                    },
                    {
                        "name": "Bollinger L.A."
                    },
                    {
                        "name": "Alexander L."
                    },
                    {
                        "name": "Cameron D.B."
                    },
                    {
                        "name": "Carroll L.N."
                    },
                    {
                        "name": "Cunnama L."
                    },
                    {
                        "name": "Gomez G.B."
                    },
                    {
                        "name": "Levin C."
                    },
                    {
                        "name": "Marseille E."
                    },
                    {
                        "name": "Mustafa Diab M."
                    },
                    {
                        "name": "Siapka M."
                    },
                    {
                        "name": "Sinanovic E."
                    },
                    {
                        "name": "Vassall A."
                    },
                    {
                        "name": "Kahn J.G."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-06T00:00:00Z",
                "journal": "African Journal of AIDS Research",
                "title": "Developing the Global Health Cost Consortium Unit Cost Study Repository for HIV and TB: methodology and lessons learned"
            },
            "pmid": "31779571"
        }
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Tropical medicine",
            "uri": "http://edamontology.org/topic_3575"
        }
    ]
}