{
    "accessibility": "Open access",
    "additionDate": "2023-12-01T14:46:19.339588Z",
    "biotoolsCURIE": "biotools:mutbless",
    "biotoolsID": "mutbless",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gromiha@iitm.ac.in",
            "name": "M. Michael Gromiha"
        }
    ],
    "description": "A tool to identify disease-prone sites in cancer using deep learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                },
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "https://web.iitm.ac.in/bioinfo2/MutBLESS/index.html",
    "lastUpdate": "2024-11-24T14:29:37.047674Z",
    "name": "MutBLESS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.bbadis.2023.166721",
            "metadata": {
                "abstract": "Understanding the molecular basis and impact of mutations at different stages of cancer are long-standing challenges in cancer biology. Identification of driver mutations from experiments is expensive and time intensive. In the present study, we collected the data for experimentally known driver mutations in 22 different cancer types and classified them into six categories: breast cancer (BRCA), acute myeloid leukaemia (LAML), endometrial carcinoma (EC), stomach cancer (STAD), skin cancer (SKCM), and other cancer types which contains 5747 disease prone and 5514 neutral sites in 516 proteins. The analysis of amino acid distribution along mutant sites revealed that the motifs AAA and LR are preferred in disease-prone sites whereas QPP and QF are dominant in neutral sites. Further, we developed a method using deep neural networks to predict disease-prone sites with amino acid sequence-based features such as physicochemical properties, secondary structure, tri-peptide motifs and conservation scores. We obtained an average AUC of 0.97 in five cancer types BRCA, LAML, EC, STAD and SKCM in a test dataset and 0.72 in all other cancer types together. Our method showed excellent performance for identifying cancer-specific mutations with an average sensitivity, specificity, and accuracy of 96.56 %, 97.39 %, and 97.64 %, respectively. We developed a web server for identifying cancer-prone sites, and it is available at https://web.iitm.ac.in/bioinfo2/MutBLESS/index.html. We suggest that our method can serve as an effective method to identify disease-prone sites and assist to develop therapeutic strategies.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Pandey M."
                    }
                ],
                "citationCount": 3,
                "date": "2023-08-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - Molecular Basis of Disease",
                "title": "MutBLESS: A tool to identify disease-prone sites in cancer using deep learning"
            },
            "pmid": "37105446"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
