{
    "additionDate": "2017-02-14T09:34:28Z",
    "biotoolsCURIE": "biotools:ic50-to-ki",
    "biotoolsID": "ic50-to-ki",
    "credit": [
        {
            "email": "botdb@mail.nih.gov",
            "name": "BotDB team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web-based tool for estimating Ki values from experimentally determined IC50 values for inhibitors of enzymes and of binding reactions between macromolecules and ligands.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "http://botdb.abcc.ncifcrf.gov/toxin/kiConverter.jsp",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:43Z",
    "name": "IC50-to-Ki",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "A new web-server tool estimates Ki values from experimentally determined IC50 values for inhibitors of enzymes and of binding reactions between macromolecules (e.g. proteins, polynucleic acids) and ligands. This converter was developed to enable end users to help gauge the quality of the underlying assumptions used in these calculations which depend on the type of mechanism of inhibitor action and the concentrations of the interacting molecular species. Additional calculations are performed for nonclassical, tightly bound inhibitors of enzyme-substrate or of macromolecule-ligand systems in which free, rather than total concentrations of the reacting species are required. Required user-defined input values include the total enzyme (or another target molecule) and substrate (or ligand) concentrations, the Km of the enzyme-substrate (or the Kd of the target-ligand) reaction, and the IC50 value. Assumptions and caveats for these calculations are discussed along with examples taken from the literature. The host database for this converter contains kinetic constants and other data for inhibitors of the proteolytic clostridial neurotoxins (http://botdb.abcc.ncifcrf.gov/toxin/ kiConverter.jsp).",
                "authors": [
                    {
                        "name": "Cer R.Z."
                    },
                    {
                        "name": "Mudunuri U."
                    },
                    {
                        "name": "Stephens R."
                    },
                    {
                        "name": "Lebeda F.J."
                    }
                ],
                "citationCount": 220,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "IC50-to-Ki: A web-based tool for converting IC50 to Ki values for inhibitors of enzyme activity and ligand binding"
            },
            "pmid": "19395593"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1
}