{
    "additionDate": "2022-09-30T10:07:31.426182Z",
    "biotoolsCURIE": "biotools:cppsite1",
    "biotoolsID": "cppsite1",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/cppsite1/index.php"
        }
    ],
    "description": "CPPsite is a database of experimentally validated Cell Penetrating Peptides (10-30 amino acids).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/cppsite1/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/cppsite1/index.php",
    "lastUpdate": "2022-09-30T10:08:06.650368Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/cppsite1/index.php"
        }
    ],
    "name": "CPPsite1",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1093/database/bas015",
            "metadata": {
                "abstract": "Delivering drug molecules into the cell is one of the major challenges in the process of drug development. In past, cell penetrating peptides have been successfully used for delivering a wide variety of therapeutic molecules into various types of cells for the treatment of multiple diseases. These peptides have unique ability to gain access to the interior of almost any type of cell. Due to the huge therapeutic applications of CPPs, we have built a comprehensive database 'CPPsite', of cell penetrating peptides, where information is compiled from the literature and patents. CPPsite is a manually curated database of experimentally validated 843 CPPs. Each entry provides information of a peptide that includes ID, PubMed ID, peptide name, peptide sequence, chirality, origin, nature of peptide, sub-cellular localization, uptake efficiency, uptake mechanism, hydrophobicity, amino acid frequency and composition, etc. A wide range of user-friendly tools have been incorporated in this database like searching, browsing, analyzing, mapping tools. In addition, we have derived various types of information from these peptide sequences that include secondary/tertiary structure, amino acid composition and physicochemical properties of peptides. This database will be very useful for developing models for predicting effective cell penetrating peptides. © The Author(s) 2012.",
                "authors": [
                    {
                        "name": "Chaudhary K."
                    },
                    {
                        "name": "Gautam A."
                    },
                    {
                        "name": "Kapoor P."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Singh H."
                    },
                    {
                        "name": "Tyagi A."
                    }
                ],
                "citationCount": 138,
                "date": "2012-07-25T00:00:00Z",
                "journal": "Database",
                "title": "CPPsite: A curated database of cell penetrating peptides"
            },
            "pmcid": "PMC3296953",
            "pmid": "22403286"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
