{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-29T08:04:20Z",
    "biotoolsCURIE": "biotools:TaF",
    "biotoolsID": "TaF",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Theragen Etex Bio Institute",
            "typeEntity": "Institute",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.theragenetex.com/"
        }
    ],
    "description": "Web platform for taxonomic profile-based fungal gene prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "http://taf.genome-report.com/",
    "language": [
        "Shell",
        "PHP",
        "SQL",
        "Python"
    ],
    "lastUpdate": "2019-05-29T08:08:08Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "TaF",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1007/s13258-018-0766-1",
            "metadata": {
                "abstract": "© 2018, The Genetics Society of Korea and Springer Nature B.V.Introduction: The accurate prediction and annotation of gene structures from the genome sequence of an organism enable genome-wide functional analyses to obtain insight into the biological properties of an organism. Objectives: We recently developed a highly accurate filamentous fungal gene prediction pipeline and web platform called TaF. TaF is a homology-based gene predictor employing large-scale taxonomic profiling to search for close relatives in genome queries. Methods: TaF pipeline consists of four processing steps; (1) taxonomic profiling to search for close relatives to query, (2) generation of hints for determining exon–intron boundaries from orthologous protein sequence data of the profiled species, (3) gene prediction by combination of ab inito and evidence-based prediction methods, and (4) homology search for gene models. Results: TaF generates extrinsic evidence that suggests possible exon–intron boundaries based on orthologous protein sequence data, thus reducing false-positive predictions of gene structure based on distantly related orthologs data. In particular, the gene prediction method using taxonomic profiling shows very high accuracy, including high sensitivity and specificity for gene models, suggesting a new approach for homology-based gene prediction from newly sequenced or uncharacterized fungal genomes, with the potential to improve the quality of gene prediction. Conclusion: TaF will be a useful tool for fungal genome-wide analyses, including the identification of targeted genes associated with a trait, transcriptome profiling, comparative genomics, and evolutionary analysis.",
                "authors": [
                    {
                        "name": "Park S.-G."
                    },
                    {
                        "name": "Ryu D.S."
                    },
                    {
                        "name": "Lee H."
                    },
                    {
                        "name": "Ryu H."
                    },
                    {
                        "name": "Ahn Y.J."
                    },
                    {
                        "name": "Yoo S."
                    },
                    {
                        "name": "Ko J."
                    },
                    {
                        "name": "Hong C.P."
                    }
                ],
                "date": "2019-03-01T00:00:00Z",
                "journal": "Genes and Genomics",
                "title": "TaF: a web platform for taxonomic profile-based fungal gene prediction"
            },
            "pmid": "30456524",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}