{
    "additionDate": "2017-01-17T15:02:33Z",
    "biotoolsCURIE": "biotools:plw",
    "biotoolsID": "plw",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "magnus.astrand@astrazeneca.com",
            "name": "Magnus Astrand",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Probe level Locally moderated Weighted median-t and Locally Moderated Weighted-t.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/plw.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/plw_1.34.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/plw.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-24T22:37:00Z",
    "license": "GPL-2.0",
    "name": "plw",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-156",
            "metadata": {
                "abstract": "Background: When analyzing microarray data a primary objective is often to find differentially expressed genes. With empirical Bayes and penalized t-tests the sample variances are adjusted towards a global estimate, producing more stable results compared to ordinary t-tests. However, for Affymetrix type data a clear dependency between variability and intensity-level generally exists, even for logged intensities, most clearly for data at the probe level but also for probe-set summarizes such as the MAS5 expression index. As a consequence, adjustment towards a global estimate results in an intensity-level dependent false positive rate. Results: We propose two new methods for finding differentially expressed genes, Probe level Locally moderated Weighted median-t (PLW) and Locally Moderated Weighted-t (LMW). Both methods use an empirical Bayes model taking the dependency between variability and intensity-level into account. A global covariance matrix is also used allowing for differing variances between arrays as well as array-to-array correlations. PLW is specially designed for Affymetrix type arrays (or other multiple-probe arrays). Instead of making inference on probe-set summaries, comparisons are made separately for each perfect-match probe and are then summarized into one score for the probe-set. Conclusion: The proposed methods are compared to 14 existing methods using five spike-in data sets. For RMA and GCRMA processed data, PLW has the most accurate ranking of regulated genes in four out of the five data sets, and LMW consistently performs better than all examined moderated t-tests when used on RMA, GCRMA, and MAS5 expression indexes. © 2008 Åstrand et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Astrand M."
                    },
                    {
                        "name": "Mostad P."
                    },
                    {
                        "name": "Rudemo M."
                    }
                ],
                "citationCount": 7,
                "date": "2008-03-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Empirical Bayes models for multiple probe type microarrays at the probe level"
            },
            "pmcid": "PMC2358895",
            "pmid": "18366694",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.34.0"
    ]
}
