{
    "additionDate": "2018-07-03T15:42:16Z",
    "biotoolsCURIE": "biotools:deepefflux",
    "biotoolsID": "deepefflux",
    "credit": [
        {
            "email": "yien@saturn.yzu.edu.tw",
            "name": "Yu-Yen Ou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "2D convolutional neural network model for identifying families of efflux proteins in transporters.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://140.138.155.216/deepefflux/information"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://140.138.155.216/deepefflux/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "DeepEfflux",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty302",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved.Motivation: Efflux protein plays a key role in pumping xenobiotics out of the cells. The prediction of efflux family proteins involved in transport process of compounds is crucial for understanding family structures, functions and energy dependencies. Many methods have been proposed to classify efflux pump transporters without considerations of any pump specific of efflux protein families. In other words, efflux proteins protect cells from extrusion of foreign chemicals. Moreover, almost all efflux protein families have the same structure based on the analysis of significant motifs. The motif sequences consisting of the same amount of residues will have high degrees of residue similarity and thus will affect the classification process. Consequently, it is challenging but vital to recognize the structures and determine energy dependencies of efflux protein families. In order to efficiently identify efflux protein families with considering about pump specific, we developed a 2 D convolutional neural network (2 D CNN) model called DeepEfflux. DeepEfflux tried to capture the motifs of sequences around hidden target residues to use as hidden features of families. In addition, the 2 D CNN model uses a position-specific scoring matrix (PSSM) as an input. Three different datasets, each for one family of efflux protein, was fed into DeepEfflux, and then a 5-fold cross validation approach was used to evaluate the training performance. Results: The model evaluation results show that DeepEfflux outperforms traditional machine learning algorithms. Furthermore, the accuracy of 96.02%, 94.89% and 90.34% for classes A, B and C, respectively, in the independent test results show that our model can perform well and can be used as a reliable tool for identifying families of efflux proteins in transporters.",
                "authors": [
                    {
                        "name": "Wellem Taju S."
                    },
                    {
                        "name": "Nguyen T.-T.-D."
                    },
                    {
                        "name": "Le N.-Q.-K."
                    },
                    {
                        "name": "Irawan Kusuma R.M."
                    },
                    {
                        "name": "Ou Y.-Y."
                    }
                ],
                "citationCount": 16,
                "date": "2018-09-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepEfflux: A 2D convolutional neural network model for identifying families of efflux proteins in transporters"
            }
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}