{
    "additionDate": "2021-01-18T08:00:03Z",
    "biotoolsCURIE": "biotools:cling",
    "biotoolsID": "cling",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bioinfo_wang@126.com",
            "name": "Junwei Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Jian Huang",
            "typeEntity": "Person"
        },
        {
            "email": "ningsw@ems.hrbmu.edu.cn",
            "name": "Shangwei Ning",
            "typeEntity": "Person"
        }
    ],
    "description": "Candidate Cancer-Related lncRNA Prioritization via Integrating Multiple Biological Networks.\n\nIdentification and characterization of lncRNAs in cancer with a view to their application in improving diagnosis and therapy remains a major challenge that requires new and innovative approaches. We have developed an integrative framework termed \"CLING\", aimed to prioritize candidate cancer-related lncRNAs based on their associations with known cancer lncRNAs. CLING focuses on joint optimization and prioritization of all candidates for each cancer type by integrating lncRNA topological properties and multiple lncRNA-centric networks. Validation analyses revealed that CLING is more effective than prioritization based on a single lncRNA network. Reliable AUC (Area Under Curve) scores were obtained across 10 cancer types, ranging from 0.85 to 0.94. Several novel lncRNAs predicted in the top 10 candidates for various cancer types have been confirmed by recent biological experiments",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://bio-bigdata.hrbmu.edu.cn/cling/",
    "lastUpdate": "2021-02-12T15:34:00Z",
    "name": "CLING",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00138",
            "metadata": {
                "abstract": "© Copyright © 2020 Zhang, Gao, Wang, Zhi, Zhang, Guo, Yue, Li, Zhou, Wang, Shen, Wang, Huang and Ning.Identification and characterization of lncRNAs in cancer with a view to their application in improving diagnosis and therapy remains a major challenge that requires new and innovative approaches. We have developed an integrative framework termed “CLING”, aimed to prioritize candidate cancer-related lncRNAs based on their associations with known cancer lncRNAs. CLING focuses on joint optimization and prioritization of all candidates for each cancer type by integrating lncRNA topological properties and multiple lncRNA-centric networks. Validation analyses revealed that CLING is more effective than prioritization based on a single lncRNA network. Reliable AUC (Area Under Curve) scores were obtained across 10 cancer types, ranging from 0.85 to 0.94. Several novel lncRNAs predicted in the top 10 candidates for various cancer types have been confirmed by recent biological experiments. Furthermore, using a case study on liver hepatocellular carcinoma as an example, CLING facilitated the successful identification of novel cancer lncRNAs overlooked by differential expression analyses (DEA). This time- and cost-effective computational model may provide a valuable complement to experimental studies and assist in future investigations on lncRNA involvement in the pathogenesis of cancers. We have developed a web-based server for users to rapidly implement CLING and visualize data, which is freely accessible at http://bio-bigdata.hrbmu.edu.cn/cling/. CLING has been successfully applied to predict a few potential lncRNAs from thousands of candidates for many cancer types.",
                "authors": [
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Zhi H."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Guo M."
                    },
                    {
                        "name": "Yue M."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Zhou D."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Shen W."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Ning S."
                    }
                ],
                "date": "2020-03-10T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "CLING: Candidate Cancer-Related lncRNA Prioritization via Integrating Multiple Biological Networks"
            },
            "pmcid": "PMC7077056",
            "pmid": "32211391"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}