{
    "additionDate": "2017-01-17T14:57:10Z",
    "biotoolsCURIE": "biotools:synergyfinder",
    "biotoolsID": "synergyfinder",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "jing.tang@helsinki.fi",
            "name": "Jing Tang",
            "note": "Assistant professor in statistics, Faculty of Medicine, University of Helsinki",
            "orcidid": "https://orcid.org/0000-0001-7480-7710",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://scholar.google.com/citations?user=6sNdZq8AAAAJ&hl=en"
        }
    ],
    "description": "Efficient implementations for all the popular synergy scoring models for drug combinations, including HSA, Loewe, Bliss and ZIP and visualization of the synergy scores as either a two-dimensional or a three-dimensional interaction surface over the dose matrix. R package available at https://bioconductor.org/packages/release/bioc/html/synergyfinder.html. The web server is available at http://www.synergyfinder.org.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/synergyfinder.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/synergyfinder_1.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "authors": [
            "jtang920"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://www.synergyfinder.org",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-18T12:15:19Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "note": "NET­WORK PHARMACOLOGY FOR PRE­CI­SION MEDICINE, FACULTY OF MEDICINE, UNIVERSITY OF HELSINKI",
            "type": [
                "Helpdesk"
            ],
            "url": "https://www.helsinki.fi/en/researchgroups/network-pharmacology-for-precision-medicine"
        },
        {
            "note": "Twitter site",
            "type": [
                "Social media"
            ],
            "url": "https://twitter.com/SynergyFinder"
        }
    ],
    "name": "SynergyFinder",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "jtang920",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx162",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Summary: Rational design of drug combinations has become a promising strategy to tackle the drug sensitivity and resistance problem in cancer treatment. To systematically evaluate the preclinical significance of pairwise drug combinations, functional screening assays that probe combination effects in a dose-response matrix assay are commonly used. To facilitate the analysis of such drug combination experiments, we implemented a web application that uses key functions of Rpackage SynergyFinder, and provides not only the flexibility of using multiple synergy scoring models, but also a user-friendly interface for visualizing the drug combination landscapes in an interactive manner.",
                "authors": [
                    {
                        "name": "Ianevski A."
                    },
                    {
                        "name": "He L."
                    },
                    {
                        "name": "Aittokallio T."
                    },
                    {
                        "name": "Tang J."
                    }
                ],
                "citationCount": 138,
                "date": "2017-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SynergyFinder: A web application for analyzing drug combination dose-response matrix data"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/978-1-4939-7493-1_17",
            "metadata": {
                "abstract": "© 2018, Springer Science+Business Media LLC.Gene products or pathways that are aberrantly activated in cancer but not in normal tissue hold great promises for being effective and safe anticancer therapeutic targets. Many targeted drugs have entered clinical trials but so far showed limited efficacy mostly due to variability in treatment responses and often rapidly emerging resistance. Toward more effective treatment options, we will need multi-targeted drugs or drug combinations, which selectively inhibit the viability and growth of cancer cells and block distinct escape mechanisms for the cells to become resistant. Functional profiling of drug combinations requires careful experimental design and robust data analysis approaches. At the Institute for Molecular Medicine Finland (FIMM), we have developed an experimental-computational pipeline for high-throughput screening of drug combination effects in cancer cells. The integration of automated screening techniques with advanced synergy scoring tools allows for efficient and reliable detection of synergistic drug interactions within a specific window of concentrations, hence accelerating the identification of potential drug combinations for further confirmatory studies.",
                "authors": [
                    {
                        "name": "He L."
                    },
                    {
                        "name": "Kulesskiy E."
                    },
                    {
                        "name": "Saarela J."
                    },
                    {
                        "name": "Turunen L."
                    },
                    {
                        "name": "Wennerberg K."
                    },
                    {
                        "name": "Aittokallio T."
                    },
                    {
                        "name": "Tang J."
                    }
                ],
                "citationCount": 37,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Methods for high-throughput drug combination screening and synergy scoring"
            }
        }
    ],
    "relation": [
        {
            "biotoolsID": "drugcomb",
            "type": "usedBy"
        }
    ],
    "toolType": [
        "Web application",
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}