{
    "additionDate": "2021-01-18T09:34:33Z",
    "biotoolsCURIE": "biotools:plant-msubp",
    "biotoolsID": "plant-msubp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rkaundal@usu.edu",
            "name": "Rakesh Kaundal",
            "typeEntity": "Person"
        }
    ],
    "description": "Plant-mSubP is a computational framework for the prediction of single- and multi-target protein subcellular localization using integrated machine-learning approaches.\n\nThe subcellular localization of proteins is very important for characterizing its function in a cell. Accurate prediction of the subcellular locations in computational paradigm has been an active area of interest. Most of the work has been focused on single localization prediction. Only few studies have discussed the multi-target localization, but have not achieved good accuracy so far; in plant sciences, very limited work has been done. Here we report the development of a novel tool Plant-mSubP, which is based on integrated machine learning approaches to efficiently predict the subcellular localizations in plant proteomes. The proposed approach predicts with high accuracy 11 single localizations and three dual locations of plant cell",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.usu.edu/Plant-mSubP/",
    "lastUpdate": "2021-01-24T07:35:59Z",
    "name": "Plant-mSubP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/AOBPLA/PLZ068",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of the Annals of Botany Company. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited. 1The subcellular localization of proteins is very important for characterizing its function in a cell. Accurate prediction of the subcellular locations in computational paradigm has been an active area of interest. Most of the work has been focused on single localization prediction. Only few studies have discussed the multi-target localization, but have not achieved good accuracy so far; in plant sciences, very limited work has been done. Here we report the development of a novel tool Plant-mSubP, which is based on integrated machine learning approaches to efficiently predict the subcellular localizations in plant proteomes. The proposed approach predicts with high accuracy 11 single localizations and three dual locations of plant cell. Several hybrid features based on composition and physicochemical properties of a protein such as amino acid composition, pseudo amino acid composition, auto-correlation descriptors, quasi-sequence-order descriptors and hybrid features are used to represent the protein. The performance of the proposed method has been assessed through a training set as well as an independent test set. Using the hybrid feature of the pseudo amino acid composition, N-Center-C terminal amino acid composition and the dipeptide composition (PseAAC-NCC-DIPEP), an overall accuracy of 81.97 %, 84.75 % and 87.88 % is achieved on the training data set of proteins containing the single-label, single- and dual-label combined, and dual-label proteins, respectively. When tested on the independent data, an accuracy of 64.36 %, 64.84 % and 81.08 % is achieved on the single-label, single- and dual-label, and dual-label proteins, respectively. The prediction models have been implemented on a web server available at http://bioinfo.usu.edu/Plant-mSubP/. The results indicate that the proposed approach is comparable to the existing methods in single localization prediction and outperforms all other existing tools when compared for dual-label proteins. The prediction tool will be a useful resource for better annotation of various plant proteomes.",
                "authors": [
                    {
                        "name": "Sahu S.S."
                    },
                    {
                        "name": "Loaiza C.D."
                    },
                    {
                        "name": "Kaundal R."
                    }
                ],
                "citationCount": 6,
                "date": "2021-01-01T00:00:00Z",
                "journal": "AoB PLANTS",
                "title": "Plant-mSubP: A computational framework for the prediction of single- And multi-target protein subcellular localization using integrated machine-learning approaches"
            },
            "pmcid": "PMC7274489",
            "pmid": "32528639"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}