{
    "additionDate": "2021-01-18T10:19:22Z",
    "biotoolsCURIE": "biotools:immunoglobe",
    "biotoolsID": "immunoglobe",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "paragm@stanford.edu",
            "name": "Parag Mallick",
            "orcidid": "https://orcid.org/0000-0002-0505-2032",
            "typeEntity": "Person"
        }
    ],
    "description": "Enabling systems immunology with a manually curated intercellular immune interaction network.\n\nImmunoGlobe is a map of the immune network that describes how different parts of the immune system work together to drive immune responses. By structuring our knowledge of immune interactions into a directed graph, ImmunoGlobe makes it easy to explore the relationships between components of the immune system.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                }
            ]
        }
    ],
    "homepage": "http://www.immunoglobe.org",
    "lastUpdate": "2021-02-04T07:26:49.448917Z",
    "name": "ImmunoGlobe",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03702-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: While technological advances have made it possible to profile the immune system at high resolution, translating high-throughput data into knowledge of immune mechanisms has been challenged by the complexity of the interactions underlying immune processes. Tools to explore the immune network are critical for better understanding the multi-layered processes that underlie immune function and dysfunction, but require a standardized network map of immune interactions. To facilitate this we have developed ImmunoGlobe, a manually curated intercellular immune interaction network extracted from Janeway's Immunobiology textbook. Results: ImmunoGlobe is the first graphical representation of the immune interactome, and is comprised of 253 immune system components and 1112 unique immune interactions with detailed functional and characteristic annotations. Analysis of this network shows that it recapitulates known features of the human immune system and can be used uncover novel multi-step immune pathways, examine species-specific differences in immune processes, and predict the response of immune cells to stimuli. ImmunoGlobe is publicly available through a user-friendly interface at www.immunoglobe.org and can be downloaded as a computable graph and network table. Conclusion: While the fields of proteomics and genomics have long benefited from network analysis tools, no such tool yet exists for immunology. ImmunoGlobe provides a ground truth immune interaction network upon which such tools can be built. These tools will allow us to predict the outcome of complex immune interactions, providing mechanistic insight that allows us to precisely modulate immune responses in health and disease.",
                "authors": [
                    {
                        "name": "Atallah M.B."
                    },
                    {
                        "name": "Tandon V."
                    },
                    {
                        "name": "Hiam K.J."
                    },
                    {
                        "name": "Boyce H."
                    },
                    {
                        "name": "Hori M."
                    },
                    {
                        "name": "Atallah W."
                    },
                    {
                        "name": "Spitzer M.H."
                    },
                    {
                        "name": "Engleman E."
                    },
                    {
                        "name": "Mallick P."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ImmunoGlobe: Enabling systems immunology with a manually curated intercellular immune interaction network"
            },
            "pmcid": "PMC7430879",
            "pmid": "32778050"
        }
    ],
    "toolType": [
        "Database portal",
        "Web service"
    ],
    "topic": [
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}