{
    "additionDate": "2020-01-14T19:42:16Z",
    "biotoolsCURIE": "biotools:ACTman",
    "biotoolsID": "ACTman",
    "confidence_flag": "tool",
    "description": "Automated preprocessing and analysis of actigraphy data.\n\nOBJECTIVES:To introduce a novel software-library called Actigraphy Manager (ACTman) which automates labor-intensive actigraphy data preprocessing and analyses steps while improving transparency, reproducibility, and scalability over software suites traditionally used in actigraphy research practice. DESIGN:Descriptive. METHODS:Use cases are described for performing a common actigraphy task in ACTman and alternative actigraphy software. Important inefficiencies in actigraphy workflow are identified and their consequences are described. We explain how these hinder the feasibility of conducting studies with large groups of athletes and or longer data collection periods. Thereafter, the information flow through the ACTman software is described and we explain how it alleviates aforementioned inefficiencies.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/compsy/ACTman",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-14T14:54:50Z",
    "name": "ACTman",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JSAMS.2019.11.009",
            "metadata": {
                "abstract": "© 2019 Sports Medicine AustraliaObjectives: To introduce a novel software-library called Actigraphy Manager (ACTman) which automates labor-intensive actigraphy data preprocessing and analyses steps while improving transparency, reproducibility, and scalability over software suites traditionally used in actigraphy research practice. Design: Descriptive. Methods: Use cases are described for performing a common actigraphy task in ACTman and alternative actigraphy software. Important inefficiencies in actigraphy workflow are identified and their consequences are described. We explain how these hinder the feasibility of conducting studies with large groups of athletes and/or longer data collection periods. Thereafter, the information flow through the ACTman software is described and we explain how it alleviates aforementioned inefficiencies. Furthermore, transparency, reproducibility, and scalability issues of commonly used actigraphy software packages are discussed and compared with the ACTman package. Results: It is shown that from an end-user perspective ACTman offers a compact workflow as it automates many preprocessing and analysis steps that otherwise have to be performed manually. When considering transparency, reproducibility, and scalability the design of the ACTman software is found to outperform proprietary and open-source actigraphy software suites. As such, ACTman alleviates important bottlenecks within actigraphy research practice. Conclusions: ACTman facilitates the current transition towards larger datasets containing data of multiple athletes by automating labor-intensive preprocessing and analyses steps within actigraphy research. Furthermore, ACTman offers many features which enhance user-convenience and analysis customization, such as moving window functionality and period selection options. ACTman is open-source and thus fully verifiable, in contrast with many proprietary software packages which remain a black box for researchers.",
                "authors": [
                    {
                        "name": "Kunkels Y.K."
                    },
                    {
                        "name": "Knapen S.E."
                    },
                    {
                        "name": "Zuidersma M."
                    },
                    {
                        "name": "Wichers M."
                    },
                    {
                        "name": "Riese H."
                    },
                    {
                        "name": "Emerencia A.C."
                    }
                ],
                "citationCount": 3,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Journal of Science and Medicine in Sport",
                "title": "ACTman: Automated preprocessing and analysis of actigraphy data"
            },
            "pmid": "31813761"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}