{
    "additionDate": "2021-03-19T09:04:30Z",
    "biotoolsCURIE": "biotools:omega-m",
    "biotoolsID": "omega-m",
    "confidence_flag": "tool",
    "description": "open-source emission tomography software.\n\nOpen-source MATLAB/GNU Octave Emission Tomography Software.\n\nThe purpose of OMEGA is twofold. First it is designed to allow easy, fast and efficient reconstruction of any positron emission tomography (PET) data, including simulated GATE data. Secondly, it is intended for easy algorithmic development as it allows easy matrix-free implementation of the forward (A * x) and backward (A' * y) projections.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://github.com/villekf/OMEGA",
    "language": [
        "MATLAB",
        "C++",
        "C"
    ],
    "lastUpdate": "2021-04-11T11:57:18Z",
    "license": "GPL-3.0",
    "name": "OMEGA-m",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1088/1361-6560/ABE65F",
            "metadata": {
                "abstract": "© 2021 Institute of Physics and Engineering in Medicine.In this paper we present OMEGA, an open-source software, for efficient and fast image reconstruction in positron emission tomography (PET). OMEGA uses the scripting language of MATLAB and GNU Octave allowing reconstruction of PET data with a MATLAB or GNU Octave interface. The goal of OMEGA is to allow easy and fast reconstruction of any PET data, and to provide a computationally efficient, easy-access platform for development of new PET algorithms with built-in forward and backward projection operations available to the user as a MATLAB/Octave class. OMEGA also includes direct support for GATE simulated data, facilitating easy evaluation of the new algorithms using Monte Carlo simulated PET data. OMEGA supports parallel computing by utilizing OpenMP for CPU implementations and OpenCL for GPU allowing any hardware to be used. OMEGA includes built-in function for the computation of normalization correction and allows several other corrections to be applied such as attenuation, randoms or scatter. OMEGA includes several different maximum-likelihood and maximum a posteriori (MAP) algorithms with several different priors. The user can also input their own priors to the built-in MAP functions. The image reconstruction in OMEGA can be computed either by using an explicitly computed system matrix or with a matrix-free formalism, where the latter can be accelerated with OpenCL. We provide an overview on the software and present some examples utilizing the different features of the software.",
                "authors": [
                    {
                        "name": "Wettenhovi V.-V."
                    },
                    {
                        "name": "Vauhkonen M."
                    },
                    {
                        "name": "Kolehmainen V."
                    }
                ],
                "date": "2021-03-21T00:00:00Z",
                "journal": "Physics in Medicine and Biology",
                "title": "OMEGA - Open-source emission tomography software"
            },
            "pmid": "33588401"
        }
    ],
    "toolType": [
        "Library",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}