{
    "additionDate": "2017-08-03T18:56:53Z",
    "biotoolsCURIE": "biotools:pyrad",
    "biotoolsID": "pyrad",
    "credit": [
        {
            "email": "deren.eaton@yale.edu",
            "name": "Deren Eaton",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://dereneaton.com/"
        }
    ],
    "description": "Pipeline to assemble de novo RADseq loci with the aim of optimizing coverage across phylogenetic datasets.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://nbviewer.jupyter.org/gist/dereneaton/af9548ea0e94bff99aa0/pyRAD_v.3.0.ipynb"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://dereneaton.com/software/pyrad/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pyrad-2-12-assembly-of-de-novo-radseq-loci-for-phylogenetic-analyses.html"
        }
    ],
    "name": "PyRAD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Restriction-site-associated genomic markers are a powerful tool for investigating evolutionary questions at the population level, but are limited in their utility at deeper phylogenetic scales where fewer orthologous loci are typically recovered across disparate taxa. While this limitation stems in part from mutations to restriction recognition sites that disrupt data generation, an additional source of data loss comes from the failure to identify homology during bioinformatic analyses. Clustering methods that allow for lower similarity thresholds and the inclusion of indel variation will perform better at assembling RADseq loci at the phylogenetic scale. Results: PyRAD is a pipeline to assemble de novo RADseq loci with the aim of optimizing coverage across phylogenetic datasets. It uses a wrapper around an alignment-clustering algorithm, which allows for indel variation within and between samples, as well as for incomplete overlap among reads (e.g. paired-end). Here I compare PyRAD with the program Stacks in their performance analyzing a simulated RADseq dataset that includes indel variation. Indels disrupt clustering of homologous loci in Stacks but not in PyRAD, such that the latter recovers more shared loci across disparate taxa. I show through reanalysis of an empirical RADseq dataset that indels are a common feature of such data, even at shallow phylogenetic scales. PyRAD uses parallel processing as well as an optional hierarchical clustering method, which allows it to rapidly assemble phylogenetic datasets with hundreds of sampled individuals. © The Author 2014.",
                "authors": [
                    {
                        "name": "Eaton D.A.R."
                    }
                ],
                "citationCount": 231,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PyRAD: Assembly of de novo RADseq loci for phylogenetic analyses"
            },
            "pmid": "24603985"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}