{
    "additionDate": "2017-08-03T18:59:14Z",
    "biotoolsCURIE": "biotools:scct",
    "biotoolsID": "scct",
    "credit": [
        {
            "email": "wavefancy@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/wavefancy/scct"
        }
    ],
    "description": "Computational software developed to detect recent positive selection using deep sequencing data. It’s robust to various demographic events and also robust to the variations of mutation rates and recombination rates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/wavefancy/scct"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wavefancy/scct",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/scct-dectect-recent-positive-selection-by-conditional-coalescent-tree.html"
        }
    ],
    "name": "SCCT",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 The Author.Studies of natural selection, followed by functional validation, are shedding light on understanding of genetic mechanisms underlying human evolution and adaptation. Classic methods for detecting selection, such as the integrated haplotype score (iHS) and Fay and Wu's H statistic, are useful for candidate gene searching underlying positive selection. These methods, however, have limited capability to localize causal variants in selection target regions. In this study, we developed a novel method based on conditional coalescent tree to detect recent positive selection by counting unbalanced mutations on coalescent gene genealogies. Extensive simulation studies revealed that our method is more robust than many other approaches against biases due to various demographic effects, including population bottleneck, expansion, or stratification, while not sacrificing its power. Furthermore, our method demonstrated its superiority in localizing causal variants from massive linked genetic variants. The rate of successful localization was about 20-40% higher than that of other state-of-the-art methods on simulated data sets. On empirical data, validated functional causal variants of four well-known positive selected genes were all successfully localized by our method, such as ADH1B, MCM6, APOL1, and HBB. Finally, the computational efficiency of this new method was much higher than that of iHS implementations, that is, 24-66 times faster than the REHH package, and more than 10,000 times faster than the original iHS implementation. These magnitudes make our method suitable for applying on large sequencing data sets. Software can be downloaded from https://github.com/wavefancy/scct.",
                "authors": [
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Jin L."
                    },
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Xu H."
                    }
                ],
                "citationCount": 10,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Detecting recent positive selection with high accuracy and reliability by conditional coalescent tree"
            },
            "pmid": "25135945"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
