{
    "additionDate": "2018-05-18T14:19:41Z",
    "biotoolsCURIE": "biotools:nearender",
    "biotoolsID": "nearender",
    "credit": [
        {
            "email": "ashwinipriya.jeggari@ki.se",
            "name": "Ashwini Jeggari",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Performs network enrichment analysis against functional gene sets. Benchmarks networks. Renders raw gene profile matrices of dimensionality \"N genes x N samples\" into the space of gene set (typically pathway) enrichment scores of dimensionality \"N pathways x N samples\".",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/NEArender/NEArender.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/NEArender/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "NEArender",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-017-1534-Y",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: The statistical evaluation of pathway enrichment, i.e. of gene profiles' confluence to the pathway level, allows exploring molecular landscapes using functionally annotated gene sets. However, pathway scores can also be used as predictive features in machine learning. That requires, firstly, increasing statistical power and biological relevance via a network enrichment analysis (NEA) and, secondly, a fast and convenient procedure for rendering the original data into a space of pathway scores. However, previous implementations of NEA involved multiple runs of network randomization and were therefore slow. Results: Here, we present a new R package NEArender which can transform raw 'omics' features of experimental or clinical samples into matrices describing the same samples with many fewer NEA-based pathway scores. This is done via a parametric estimation of the null binomial distribution and is thus much faster and less biased than randomization procedures. Further, we compare estimates from these two alternative procedures and demonstrate that the summarization of individual genes to pathways increases the statistical power compared to both the default differential expression analysis on individual genes and the state-of-the-art gene set enrichment analysis. The package also contains functions for preparing input, modeling null distributions, and evaluating alternative versions of the global network. Conclusions: Beyond the state-of-the-art exploration of molecular data through pathway enrichment, score matrices produced by NEArender can be used in larger bioinformatics pipelines as input for phenotype modeling, predicting disease outcomes etc. This approach is often more sensitive and robust than using the original data. The package NEArender is complementary to the online NEA tool EviNet ( https://www.evinet.org ) and, unlike of the latter, enables high performance of computations off-line. The R package NEArender version 1.4 is available at CRAN repositoryhttps://cran.r-project.org/web/packages/NEArender/",
                "authors": [
                    {
                        "name": "Jeggari A."
                    },
                    {
                        "name": "Alexeyenko A."
                    }
                ],
                "citationCount": 9,
                "date": "2017-03-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NEArender: An R package for functional interpretation of 'omics' data via network enrichment analysis"
            },
            "pmcid": "PMC5374688",
            "pmid": "28361684"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}