{
    "additionDate": "2021-01-18T10:12:11Z",
    "biotoolsCURIE": "biotools:vessmorphovis",
    "biotoolsID": "vessmorphovis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "felix.schuermann@epfl.ch",
            "name": "Felix Schürmann",
            "typeEntity": "Person"
        },
        {
            "email": "marwan.abdellah@epfl.ch",
            "name": "Marwan Abdellah",
            "typeEntity": "Person"
        }
    ],
    "description": "Interactive visualization and analysis of morphological skeletons of brain vasculature networks with VessMorphoVis.\n\nVessMorphoVis is an integrated suite of toolboxes for interactive visualization and analysis of vast brain vascular networks represented by morphological graphs segmented originally from imaging or microscopy stacks.\n\nInteractive visualization, analysis and automated repair of large-scale vasculature morphology skeletons (up to millions of samples).\n\nSketching and building three-dimensional representations of the vascular morphology skeletons using various methods for visual analytics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BlueBrain/VessMorphoVis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-04T07:45:16Z",
    "license": "GPL-3.0",
    "name": "VessMorphoVis",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA461",
            "metadata": {
                "abstract": "© The Author(s) 2020.Motivation: Accurate morphological models of brain vasculature are key to modeling and simulating cerebral blood flow in realistic vascular networks. This in silico approach is fundamental to revealing the principles of neurovascular coupling. Validating those vascular morphologies entails performing certain visual analysis tasks that cannot be accomplished with generic visualization frameworks. This limitation has a substantial impact on the accuracy of the vascular models employed in the simulation. Results: We present VessMorphoVis, an integrated suite of toolboxes for interactive visualization and analysis of vast brain vascular networks represented by morphological graphs segmented originally from imaging or microscopy stacks. Our workflow leverages the outstanding potentials of Blender, aiming to establish an integrated, extensible and domain-specific framework capable of interactive visualization, analysis, repair, high-fidelity meshing and high-quality rendering of vascular morphologies. Based on the initial feedback of the users, we anticipate that our framework will be an essential component in vascular modeling and simulation in the future, filling a gap that is at present largely unfulfilled. Availability and implementation: VessMorphoVis is freely available under the GNU public license on Github at https://github.com/BlueBrain/VessMorphoVis. The morphology analysis, visualization, meshing and rendering modules are implemented as an add-on for Blender 2.8 based on its Python API (application programming interface). The add-on functionality is made available to users through an intuitive graphical user interface, as well as through exhaustive configuration files calling the API via a feature-rich command line interface running Blender in background mode.",
                "authors": [
                    {
                        "name": "Abdellah M."
                    },
                    {
                        "name": "Coggan J.S."
                    },
                    {
                        "name": "Coste B."
                    },
                    {
                        "name": "Courcol J.-D."
                    },
                    {
                        "name": "Dagar S."
                    },
                    {
                        "name": "Guerrero N.R."
                    },
                    {
                        "name": "Keller D."
                    },
                    {
                        "name": "Lapere S."
                    },
                    {
                        "name": "Markram H."
                    },
                    {
                        "name": "Schurmann F."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Interactive visualization and analysis of morphological skeletons of brain vasculature networks with VessMorphoVis"
            },
            "pmcid": "PMC7355309",
            "pmid": "32657395"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
