{
    "additionDate": "2021-01-18T11:54:47Z",
    "biotoolsCURIE": "biotools:godoc",
    "biotoolsID": "godoc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "whliao@gmail.com",
            "name": "Wen-Hung Liao",
            "typeEntity": "Person"
        },
        {
            "email": "chang.jiaming@gmail.com",
            "name": "Jia-Ming Chang",
            "orcidid": "https://orcid.org/0000-0002-6711-1739",
            "typeEntity": "Person"
        }
    ],
    "description": "High-throughput protein function prediction using novel k-nearest-neighbor and voting algorithms.\n\nGODoc: A High-Throughput Protein Function Prediction using the Novel k-nearest-neighbor and Voting algorithms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                }
            ]
        }
    ],
    "homepage": "https://github.com/changlabtw/GODoc",
    "language": [
        "Python",
        "MATLAB",
        "Shell",
        "Groovy",
        "R"
    ],
    "lastUpdate": "2021-01-25T08:55:07Z",
    "name": "GODoc",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03556-9",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Biological data has grown explosively with the advance of next-generation sequencing. However, annotating protein function with wet lab experiments is time-consuming. Fortunately, computational function prediction can help wet labs formulate biological hypotheses and prioritize experiments. Gene Ontology (GO) is a framework for unifying the representation of protein function in a hierarchical tree composed of GO terms. Results: We propose GODoc, a general protein GO prediction framework based on sequence information which combines feature engineering, feature reduction, and a novel ​k​-nearest-neighbor algorithm to resolve the multiple GO prediction problem. Comprehensive evaluation on CAFA2 shows that GODoc performs better than two baseline models. In the CAFA3 competition (68 teams), GODoc ranks 10th in Cellular Component Ontology. Regarding the species-specific task, the proposed method ranks 10th and 8th in the eukaryotic Cellular Component Ontology and the prokaryotic Molecular Function Ontology, respectively. In the term-centric task, GODoc performs third and is tied for first for the biofilm formation of Pseudomonas aeruginosa and the long-term memory of Drosophila melanogaster, respectively. Conclusions: We have developed a novel and effective strategy to incorporate a training procedure into the k-nearest neighbor algorithm (instance-based learning) which is capable of solving the Gene Ontology multiple-label prediction problem, which is especially notable given the thousands of Gene Ontology terms.",
                "authors": [
                    {
                        "name": "Liu Y.-W."
                    },
                    {
                        "name": "Hsu T.-W."
                    },
                    {
                        "name": "Chang C.-Y."
                    },
                    {
                        "name": "Liao W.-H."
                    },
                    {
                        "name": "Chang J.-M."
                    }
                ],
                "date": "2020-11-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GODoc: high-throughput protein function prediction using novel k-nearest-neighbor and voting algorithms"
            },
            "pmcid": "PMC7672824",
            "pmid": "33203348"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}