{
    "additionDate": "2018-08-22T10:37:32Z",
    "biotoolsCURIE": "biotools:dockstore",
    "biotoolsID": "dockstore",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/ga4gh/dockstore/pulls"
        }
    ],
    "description": "Brings together Docker images with standardized, machine-readable ways of describing and running the tools contained within.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://docs.dockstore.org"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://dockstore.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ga4gh/dockstore"
        }
    ],
    "name": "Dockstore",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.10137.1",
            "metadata": {
                "abstract": "© 2017 O'Connor BD et al.As genomic datasets continue to grow, the feasibility of downloading data to a local organization and running analysis on a traditional compute environment is becoming increasingly problematic. Current large-scale projects, such as the ICGC PanCancer Analysis of Whole Genomes (PCAWG), the Data Platform for the U.S. Precision Medicine Initiative, and the NIH Big Data to Knowledge Center for Translational Genomics, are using cloud-based infrastructure to both host and perform analysis across large data sets. In PCAWG, over 5,800 whole human genomes were aligned and variant called across 14 cloud and HPC environments; the processed data was then made available on the cloud for further analysis and sharing. If run locally, an operation at this scale would have monopolized a typical academic data centre for many months, and would have presented major challenges for data storage and distribution. However, this scale is increasingly typical for genomics projects and necessitates a rethink of how analytical tools are packaged and moved to the data. For PCAWG, we embraced the use of highly portable Docker images for encapsulating and sharing complex alignment and variant calling workflows across highly variable environments. While successful, this endeavor revealed a limitation in Docker containers, namely the lack of a standardized way to describe and execute the tools encapsulated inside the container. As a result, we created the Dockstore ( https://dockstore.org), a project that brings together Docker images with standardized, machine-readable ways of describing and running the tools contained within. This service greatly improves the sharing and reuse of genomics tools and promotes interoperability with similar projects through emerging web service standards developed by the Global Alliance for Genomics and Health (GA4GH).",
                "authors": [
                    {
                        "name": "Chung V."
                    },
                    {
                        "name": "Duncan A.G."
                    },
                    {
                        "name": "Ferretti V."
                    },
                    {
                        "name": "Liu X.K."
                    },
                    {
                        "name": "O'Connor B.D."
                    },
                    {
                        "name": "Paten B."
                    },
                    {
                        "name": "Patricia J."
                    },
                    {
                        "name": "Stein L."
                    },
                    {
                        "name": "Yuen D."
                    }
                ],
                "citationCount": 31,
                "date": "2017-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "The Dockstore: Enabling modular, community-focused sharing of Docker-based genomics tools and workflows"
            },
            "pmcid": "PMC5333608",
            "pmid": "28344774",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}
