{
    "additionDate": "2019-11-14T19:29:42Z",
    "biotoolsCURIE": "biotools:VisFeature",
    "biotoolsID": "VisFeature",
    "confidence_flag": "tool",
    "description": "a stand-alone program for visualizing and analyzing statistical features of biological sequences | For Microsoft Windows platform, just download the VisFeature-win32-x64.zip package from https://github.com/wangjun1996/VisFeature/releases. Unpack it to your favorite location and then open VisFeature.exe | We have tested these codes on Windows10-64bit platform and Ubuntu 16.04.5 LTS platform. There is no guarantee that these codes can be compiled and executed on other platforms without modifications",
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/wangjun1996/VisFeature/releases"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangjun1996/VisFeature",
    "language": [
        "JavaScript",
        "R",
        "C++"
    ],
    "lastUpdate": "2021-01-02T16:07:57Z",
    "license": "GPL-3.0",
    "name": "VisFeature",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ689",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Many efforts have been made in developing bioinformatics algorithms to predict functional attributes of genes and proteins from their primary sequences. One challenge in this process is to intuitively analyze and to understand the statistical features that have been selected by heuristic or iterative methods. In this paper, we developed VisFeature, which aims to be a helpful software tool that allows the users to intuitively visualize and analyze statistical features of all types of biological sequence, including DNA, RNA and proteins. VisFeature also integrates sequence data retrieval, multiple sequence alignments and statistical feature generation functions.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Du P.-F."
                    },
                    {
                        "name": "Xue X.-Y."
                    },
                    {
                        "name": "Li G.-P."
                    },
                    {
                        "name": "Zhou Y.-K."
                    },
                    {
                        "name": "Zhao W."
                    },
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Chen W."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "VisFeature: A stand-alone program for visualizing and analyzing statistical features of biological sequences"
            },
            "pmid": "31504195"
        }
    ],
    "validated": 1
}