{
    "additionDate": "2019-11-14T18:35:40Z",
    "biotoolsCURIE": "biotools:MBBS",
    "biotoolsID": "MBBS",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'UAMC Dhaka Bangladesh', 'Perceptions medical students regarding community-based teaching experiences', 'rural', 'rural health' | Perceptions of medical students regarding community-based teaching experiences | Bangladesh Medical & Dental Council | We help to protect patients and improve medical education and practice in the Bangladesh by setting standards for students and doctors. We support them in achieving and exceeding those standards, and take action when they are not met | WELCOME TO OFFICIAL WEBSITE OF BANGLADESH MEDICAL & DENTAL COUNCIL | 25/10/2019 - @notice Result of Registration Qualifying Exam (MBBS & BDS) of October, 2019 have been published",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://bmdc.org.bd/mbbs-curriculumupdate-2012/",
    "lastUpdate": "2019-11-14T18:35:40Z",
    "name": "MBBS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.22605/RRH4614",
            "metadata": {
                "abstract": "© James Cook University.Introduction: Community orientation in medical education, which prepares medical students to become more effective practitioners, is now a global movement. Many medical schools around the world have adopted the concept as the main curricular framework in order to align learning programs with the needs of the community and the learner. Despite many changes over the past few decades, many improvements are still needed in medical education in Bangladesh. This study investigated medical students' perceptions of the community-based learning experiences incorporated into the Bachelor of Medicine, Bachelor of Surgery (MBBS) degree at Uttara Adhunik Medical College, Dhaka (UAMC), Bangladesh. Methods: A total of 135 students from three undergraduate year levels of the MBBS degree at UAMC, Dhaka, Bangladesh, undertook study tours (community-based teaching, CBT) as a part of a community medicine course and visited a medical college, two rural health centres and a meteorology centre in the Cox's Bazar district, 400 km from Dhaka city. A questionnaire was used to assess the perceptions of students regarding the administration, organisation and learning experiences of the study tours. Students were required to write reports, present their findings and answer questions in their examinations related to the study tours and CBT. Results: The majority of the students agreed or strongly agreed that the tour was a worthwhile (93%) and enjoyable (95%) learning experience that helped them to understand rural health issues (91%). More than half of the students reported that the study tours increased their awareness about common rural health problems (54%) and provided a wider exposure to medicine (61%). Only 41% of students reported that the study tour increased their interest in undertake training in a rural area. A substantial number of students also expressed their concerns about the planning, length, resources, finance and organisation of the study tours. Conclusions: Overall, the study tours had a positive effect, enhancing students' awareness and understanding of common rural health problems. As study tours failed to increase the motivation of the students (approximately 60%) to work in rural areas, CBT in the medical curriculum should be reviewed and implemented using effective and evidence-based models to promote interest among medical students to work in rural and underserved or unserved areas.",
                "authors": [
                    {
                        "name": "Ahmed S.M.M."
                    },
                    {
                        "name": "Hasan M.N."
                    },
                    {
                        "name": "Kabir R."
                    },
                    {
                        "name": "Yasir Arafat S.M."
                    },
                    {
                        "name": "Rahman S."
                    },
                    {
                        "name": "Haque M."
                    },
                    {
                        "name": "Majumder M.A.A."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Rural and Remote Health",
                "title": "Perceptions of medical students regarding community-based teaching experiences: An observation from Bangladesh"
            },
            "pmid": "31400766"
        }
    ],
    "topic": [
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ]
}