{
    "additionDate": "2019-11-14T18:44:20Z",
    "biotoolsCURIE": "biotools:Rangatiratanga_Maori_self-determination_Whanau_Ora",
    "biotoolsID": "Rangatiratanga_Maori_self-determination_Whanau_Ora",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "jenny.ombler@otago.ac.nz",
            "name": "Jenny Ombler",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > HOMEPAGE MISSING! | > CORRECT NAME OF TOOL COULD ALSO BE 'Rangatiratanga Maori self-determination Whanau', 'Tino Rangatiratanga Maori self-determination Whanau', 'Maori homelessness', 'Maori self-determination Whanau Ora' | A principles framework for taking action on Māori/Indigenous Homelessness in Aotearoa/New Zealand | Objective:The objective of this research was to develop a principles framework to guide action on Māori Indigenous homelessness in Aotearoa incorporating Rangatiratanga (Māori self-determination), Whānau Ora (Government policy that places Māori families at the center of funding, policy and services) and Housing First",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31367669",
    "lastUpdate": "2019-11-14T18:44:20Z",
    "name": "Rangatiratanga Maori self-determination Whanau Ora",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.SSMPH.2019.100450",
            "metadata": {
                "abstract": "© 2019Objective: The objective of this research was to develop a principles framework to guide action on Māori/Indigenous homelessness in Aotearoa incorporating Rangatiratanga (Māori self-determination), Whānau Ora (Government policy that places Māori families at the center of funding, policy and services) and Housing First. Method: Three pathways were identified as creating opportunities for action on Māori homelessness: Te Tiriti o Waitangi/Treaty of Waitangi is the Māori self-determination pathway; Whānau Ora, a government-sponsored policy supports whānau/family as the pathway for Māori wellbeing and disparities reduction; and Housing First, an international pathway with local application for homelessness that is being implemented in parts of Aotearoa. The potential opportunities of the three pathways shaped interviews with authoritative Māori about Māori principles (derived from the three pathways) for addressing Māori homelessness. Twenty interviews were conducted with Māori experts using Kaupapa Māori research processes, eliciting advice about addressing Māori homelessness. A principles framework called Whare Ōranga was developed to synthesise these views. Results: Addressing Māori homelessness must be anchored in rights-based and culturally aligned practice empowered by Māori worldviews, principles and processes. Te Tiriti o Waitangi, which endorses Māori tribal self-determination and authority, and Whānau Ora as a government obligation to reduce inequities in Māori homelessness, are the foundations for such action. Colonisation and historical trauma are root causes of Māori homelessness. Strong rights-based frameworks are needed to enact decolonisation and guide policy. These frameworks exist in Tino Rangatiratanga/Māori self-determination and Whānau Ora. Conclusion: Whare Ōranga: An Indigenous Housing Interventions Principles Framework was developed in Aotearoa/New Zealand to end Māori homelessness. Future research is needed on the practical application of this framework in ending Māori homelessness. Moreover, the use value of the Whare Ōranga Framework as a workable approach to ending homelessness in other indigenous populations is yet to be considered.",
                "authors": [
                    {
                        "name": "Lawson-Te Aho K."
                    },
                    {
                        "name": "Fariu-Ariki P."
                    },
                    {
                        "name": "Ombler J."
                    },
                    {
                        "name": "Aspinall C."
                    },
                    {
                        "name": "Howden-Chapman P."
                    },
                    {
                        "name": "Pierse N."
                    }
                ],
                "citationCount": 1,
                "date": "2019-08-01T00:00:00Z",
                "journal": "SSM - Population Health",
                "title": "A principles framework for taking action on Māori/Indigenous Homelessness in Aotearoa/New Zealand"
            },
            "pmcid": "PMC6646741",
            "pmid": "31367669"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}