{
    "additionDate": "2021-01-18T07:45:06Z",
    "biotoolsCURIE": "biotools:neuropath2path",
    "biotoolsID": "neuropath2path",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Tamal Batabyal",
            "typeEntity": "Person"
        }
    ],
    "description": "Classification and elastic morphing between neuronal arbors using path-wise similarity.\n\n\"NeuroPath2Path: Classification and elastic morphing between neuronal arbors using path-wise similarity\" - Tamal Batabyal, Barry Condron, Scott T. Acton.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/50-Cent/NeuroPath2Path.git",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-08T13:48:45Z",
    "license": "GPL-3.0",
    "name": "NeuroPath2Path",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S12021-019-09450-X",
            "metadata": {
                "abstract": "© 2020, Springer Science+Business Media, LLC, part of Springer Nature.Neuron shape and connectivity affect function. Modern imaging methods have proven successful at extracting morphological information. One potential path to achieve analysis of this morphology is through graph theory. Encoding by graphs enables the use of high throughput informatic methods to extract and infer brain function. However, the application of graph-theoretic methods to neuronal morphology comes with certain challenges in term of complex subgraph matching and the difficulty in computing intermediate shapes in between two imaged temporal samples. Here we report a novel, efficacious graph-theoretic method that rises to the challenges. The morphology of a neuron, which consists of its overall size, global shape, local branch patterns, and cell-specific biophysical properties, can vary significantly with the cell’s identity, location, as well as developmental and physiological state. Various algorithms have been developed to customize shape based statistical and graph related features for quantitative analysis of neuromorphology, followed by the classification of neuron cell types using the features. Unlike the classical feature extraction based methods from imaged or 3D reconstructed neurons, we propose a model based on the rooted path decomposition from the soma to the dendrites of a neuron and extract morphological features from each constituent path. We hypothesize that measuring the distance between two neurons can be realized by minimizing the cost of continuously morphing the set of all rooted paths of one neuron to another. To validate this claim, we first establish the correspondence of paths between two neurons using a modified Munkres algorithm. Next, an elastic deformation framework that employs the square root velocity function is established to perform the continuous morphing, which, as an added benefit, provides an effective visualization tool. We experimentally show the efficacy of NeuroPath2Path, NeuroP2P, over the state of the art.",
                "authors": [
                    {
                        "name": "Acton S.T."
                    },
                    {
                        "name": "Batabyal T."
                    },
                    {
                        "name": "Condron B."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "NeuroPath2Path: Classification and elastic morphing between neuronal arbors using path-wise similarity"
            },
            "pmid": "32107735"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
