{
    "additionDate": "2017-08-03T19:02:14Z",
    "biotoolsCURIE": "biotools:suitemsa",
    "biotoolsID": "suitemsa",
    "credit": [
        {
            "email": "anderson@cse.unl.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfolab.unl.edu/~canderson/About_Me.html"
        }
    ],
    "description": "A java-based application that provides unique MSA viewers. Users can directly compare multiple MSAs and evaluate where the MSAs agree (are consistent) or disagree (are inconsistent).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfolab.unl.edu/~canderson/SuiteMSA/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://bioinfolab.unl.edu/~canderson/SuiteMSA/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/suitemsa-1-3-22b-visual-tools-comparison-analysis-multiple-sequence-alignments.html"
        }
    ],
    "name": "SuiteMSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Multiple sequence alignment (MSA) plays a central role in nearly all bioinformatics and molecular evolutionary applications. MSA reconstruction is thus one of the most heavily scrutinized bioinformatics fields. Evaluating the quality of MSA reconstruction is often hindered by the lack of good reference MSAs. The use of sequence evolution simulation can provide such reference MSAs. Furthermore, none of the MSA viewing/editing programs currently available allows the user to make direct comparisons between two or more MSAs. Considering the importance of MSA quality in a wide range of research, it is desirable if MSA assessment can be performed more easily.Results: We have developed SuiteMSA, a java-based application that provides unique MSA viewers. Users can directly compare multiple MSAs and evaluate where the MSAs agree (are consistent) or disagree (are inconsistent). Several alignment statistics are provided to assist such comparisons. SuiteMSA also includes a graphical phylogeny editor/viewer as well as a graphical user interface for a sequence evolution simulator that can be used to construct reference MSAs.Conclusions: SuiteMSA provides researchers easy access to a sequence evolution simulator, reference alignments generated by the simulator, and a series of tools to evaluate the performance of the MSA reconstruction programs. It will help us improve the quality of MSAs, often the most important first steps of bioinformatics and other biological research. © 2011 Anderson et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Anderson C.L."
                    },
                    {
                        "name": "Moriyama E.N."
                    },
                    {
                        "name": "Strope C.L."
                    }
                ],
                "citationCount": 15,
                "date": "2011-05-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SuiteMSA: Visual tools for multiple sequence alignment comparison and molecular sequence simulation"
            },
            "pmid": "21600033"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
