{
    "additionDate": "2021-11-19T20:12:15.664252Z",
    "biotoolsCURIE": "biotools:bigan",
    "biotoolsID": "bigan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "li.xiaokun@163.com",
            "name": "Xiaokun Li",
            "orcidid": "https://orcid.org/0000-0002-6645-6890",
            "typeEntity": "Person"
        }
    ],
    "description": "BiGAN-lncRNA-disease-associations-prediction based on bidirectional generative adversarial network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TomasYang001/BiGAN-lncRNA-disease-associations-prediction.git",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-19T20:12:15.667112Z",
    "license": "Apache-2.0",
    "name": "BiGAN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04273-7",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: An increasing number of studies have shown that lncRNAs are crucial for the control of hormones and the regulation of various physiological processes in the human body, and deletion mutations in RNA are related to many human diseases. LncRNA- disease association prediction is very useful for understanding pathogenesis, diagnosis, and prevention of diseases, and is helpful for labelling relevant biological information. Results: In this manuscript, we propose a computational model named bidirectional generative adversarial network (BiGAN), which consists of an encoder, a generator, and a discriminator to predict new lncRNA-disease associations. We construct features between lncRNA and disease pairs by utilizing the disease semantic similarity, lncRNA sequence similarity, and Gaussian interaction profile kernel similarities of lncRNAs and diseases. The BiGAN maps the latent features of similarity features to predict unverified association between lncRNAs and diseases. The computational results have proved that the BiGAN performs significantly better than other state-of-the-art approaches in cross-validation. We employed the proposed model to predict candidate lncRNAs for renal cancer and colon cancer. The results are promising. Case studies show that almost 70% of lncRNAs in the top 10 prediction lists are verified by recent biological research. Conclusion: The experimental results indicated that our proposed model had an accurate predictive ability for the association of lncRNA-disease pairs.",
                "authors": [
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Yang Q."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BiGAN: LncRNA-disease association prediction based on bidirectional generative adversarial network"
            },
            "pmcid": "PMC8247109",
            "pmid": "34193046"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
