{
    "name": "ArachnoServer", 
    "description": "ArachnoServer is a manually curated database providing information on the sequence, structure and biological activity of protein toxins from spider venoms. Key features of ArachnoServer include a molecular target ontology designed specifically for venom toxins, current and historic taxonomic information and a powerful advanced search interface.", 
    "homepage": "http://www.arachnoserver.org", 
    "biotoolsID": "arachnoserver", 
    "biotoolsCURIE": "biotools:arachnoserver", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0346", 
                    "term": "Sequence similarity search"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0245", 
                    "term": "Protein structural motif recognition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_3092", 
                    "term": "Protein feature detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Database portal"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0154", 
            "term": "Small molecules"
        }, 
        {
            "uri": "http://edamontology.org/topic_3500", 
            "term": "Zoology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_0089", 
            "term": "Ontology and terminology"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.arachnoserver.org/docs/ArachnoServerUserManual.pdf", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21036864", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "ArachnoServer 2.0, an updated online resource for spider toxin sequences and structures", 
                "abstract": "ArachnoServer (www.arachnoserver.org) is a manually curated database providing information on the sequence, structure and biological activity of protein toxins from spider venoms. These proteins are of interest to a wide range of biologists due to their diverse applications in medicine, neuroscience, pharmacology, drug discovery and agriculture. ArachnoServer currently manages 1078 protein sequences, 759 nucleic acid sequences and 56 protein structures. Key features of ArachnoServer include a molecular target ontology designed specifically for venom toxins, current and historic taxonomic information and a powerful advanced search interface. The following significant improvements have been implemented in version 2.0: (i) the average and monoisotopic molecular masses of both the reduced and oxidized form of each mature toxin are provided; (ii) the advanced search feature now enables searches on the basis of toxin mass, external database accession numbers and publication date in ArachnoServer; (iii) toxins can now be browsed on the basis of their phyletic specificity; (iv) rapid BLAST searches based on the mature toxin sequence can be performed directly from the toxin card; (v) private silos can be requested from research groups engaged in venoms-based research, enabling them to easily manage and securely store data during the process of toxin discovery; and (vi) a detailed user manual is now available. © The Author(s) 2010.", 
                "date": "2011-01-01T00:00:00Z", 
                "citationCount": 114, 
                "authors": [
                    {
                        "name": "Herzig V."
                    }, 
                    {
                        "name": "Wood D.L.A."
                    }, 
                    {
                        "name": "Newell F."
                    }, 
                    {
                        "name": "Chaumeil P.-A."
                    }, 
                    {
                        "name": "Kaas Q."
                    }, 
                    {
                        "name": "Binford G.J."
                    }, 
                    {
                        "name": "Nicholson G.M."
                    }, 
                    {
                        "name": "Gorse D."
                    }, 
                    {
                        "name": "King G.F."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "19674480", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "ArachnoServer: A database of protein toxins from spiders", 
                "abstract": "Background: Venomous animals incapacitate their prey using complex venoms that can contain hundreds of unique protein toxins. The realisation that many of these toxins may have pharmaceutical and insecticidal potential due to their remarkable potency and selectivity against target receptors has led to an explosion in the number of new toxins being discovered and characterised. From an evolutionary perspective, spiders are the most successful venomous animals and they maintain by far the largest pool of toxic peptides. However, at present, there are no databases dedicated to spider toxins and hence it is difficult to realise their full potential as drugs, insecticides, and pharmacological probes. Description: We have developed ArachnoServer, amanually curated database that provides detailed information about proteinaceous toxins from spiders. Key features of ArachnoServer include a new molecular target ontology designed especially for venom toxins, the most up-to-date taxonomic information available, and a powerful advanced search interface. Toxin information can be browsed through dynamic trees, and each toxin has a dedicated page summarising all available information about its sequence, structure, and biological activity. ArachnoServer currently manages 567 protein sequences, 334 nucleic acid sequences, and 51 protein structures. Conclusion: ArachnoServer provides a single source of high-quality information about proteinaceous spider toxins that will be an invaluable resource for pharmacologists, neuroscientists, toxinologists, medicinal chemists, ion channel scientists, clinicians, and structural biologists. ArachnoServer is available online at http://www.arachnoserver.org. © 2009 Wood et al; licensee BioMed Central Ltd.", 
                "date": "2009-08-13T00:00:00Z", 
                "citationCount": 49, 
                "authors": [
                    {
                        "name": "Wood D.L.A."
                    }, 
                    {
                        "name": "Miljenovic T."
                    }, 
                    {
                        "name": "Cai S."
                    }, 
                    {
                        "name": "Raven R.J."
                    }, 
                    {
                        "name": "Kaas Q."
                    }, 
                    {
                        "name": "Escoubas P."
                    }, 
                    {
                        "name": "Herzig V."
                    }, 
                    {
                        "name": "Wilson D."
                    }, 
                    {
                        "name": "King G.F."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": "ArachnoServer Support", 
            "email": "support@arachnoserver.org", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-03-27T12:32:28Z", 
    "lastUpdate": "2018-12-10T12:58:54Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}