{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:58:15Z",
    "biotoolsCURIE": "biotools:lre-analysis-rtpcr",
    "biotoolsID": "lre-analysis-rtpcr",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Diane",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/2783478-diane"
        }
    ],
    "description": "LRE analysis (Rutledge R.G. BMC Biotech 2008) on raw data from a real time PCR machine",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/submissions/35174/versions/1/screenshot.png"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Virtual PCR",
                    "uri": "http://edamontology.org/operation_0307"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/35174-lre-analysis-of-real-time-pcr-data",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T20:23:33.355389Z",
    "name": "LRE analysis of Real Time PCR data",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/1471-2105-9-326",
            "metadata": {
                "abstract": "Background: Real-time PCR analysis is a sensitive DNA quantification technique that has recently gained considerable attention in biotechnology, microbiology and molecular diagnostics. Although, the cycle-threshold (Ct) method is the present \"gold standard\", it is far from being a standard assay. Uniform reaction efficiency among samples is the most important assumption of this method. Nevertheless, some authors have reported that it may not be correct and a slight PCR efficiency decrease of about 4% could result in an error of up to 400% using the Ct method. This reaction efficiency decrease may be caused by inhibiting agents used during nucleic acid extraction or copurified from the biological sample. We propose a new method (Cy0) that does not require the assumption of equal reaction efficiency between unknowns and standard curve. Results: The Cy0 method is based on the fit of Richards' equation to real-time PCR data by nonlinear regression in order to obtain the best fit estimators of reaction parameters. Subsequently, these parameters were used to calculate the Cy0 value that minimizes the dependence of its value on PCR kinetic. The Ct, second derivative (Cp), sigmoidal curve fitting method (SCF) and Cy0 methods were compared using two criteria: precision and accuracy. Our results demonstrated that, in optimal amplification conditions, these four methods are equally precise and accurate. However, when PCR efficiency was slightly decreased, diluting amplification mix quantity or adding a biological inhibitor such as IgG, the SCF, Ct and Cp methods were markedly impaired while the Cy0 method gave significantly more accurate and precise results. Conclusion: Our results demonstrate that Cy0 represents a significant improvement over the standard methods for obtaining a reliable and precise nucleic acid quantification even in sub-optimal amplification conditions overcoming the underestimation caused by the presence of some PCR inhibitors. © 2008 Guescini et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Guescini M."
                    },
                    {
                        "name": "Rocchi M.B.L."
                    },
                    {
                        "name": "Sisti D."
                    },
                    {
                        "name": "Stocchi L."
                    },
                    {
                        "name": "Stocchi V."
                    }
                ],
                "citationCount": 142,
                "date": "2008-07-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A new real-time PCR method to overcome significant quantitative inaccuracy due to slight amplification inhibition"
            },
            "pmcid": "PMC2533027",
            "pmid": "18667053",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        }
    ],
    "version": [
        "1.0.0.0"
    ]
}
