{
    "additionDate": "2023-01-25T14:18:37.861096Z",
    "biotoolsCURIE": "biotools:autoscore_ordinal",
    "biotoolsID": "autoscore_ordinal",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liu.nan@duke-nus.edu.sg",
            "name": "Nan Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "AutoScore-Ordinal is a novel machine learning framework to automate the development of interpretable clinical scoring models for ordinal outcomes, which expands the original AutoScore framework for binary outcomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nliulab/AutoScore-Ordinal",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:09:46.442081Z",
    "license": "Not licensed",
    "name": "AutoScore-Ordinal",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/s12874-022-01770-y",
            "metadata": {
                "abstract": "Background: Risk prediction models are useful tools in clinical decision-making which help with risk stratification and resource allocations and may lead to a better health care for patients. AutoScore is a machine learning–based automatic clinical score generator for binary outcomes. This study aims to expand the AutoScore framework to provide a tool for interpretable risk prediction for ordinal outcomes. Methods: The AutoScore-Ordinal framework is generated using the same 6 modules of the original AutoScore algorithm including variable ranking, variable transformation, score derivation (from proportional odds models), model selection, score fine-tuning, and model evaluation. To illustrate the AutoScore-Ordinal performance, the method was conducted on electronic health records data from the emergency department at Singapore General Hospital over 2008 to 2017. The model was trained on 70% of the data, validated on 10% and tested on the remaining 20%. Results: This study included 445,989 inpatient cases, where the distribution of the ordinal outcome was 80.7% alive without 30-day readmission, 12.5% alive with 30-day readmission, and 6.8% died inpatient or by day 30 post discharge. Two point-based risk prediction models were developed using two sets of 8 predictor variables identified by the flexible variable selection procedure. The two models indicated reasonably good performance measured by mean area under the receiver operating characteristic curve (0.758 and 0.793) and generalized c-index (0.737 and 0.760), which were comparable to alternative models. Conclusion: AutoScore-Ordinal provides an automated and easy-to-use framework for development and validation of risk prediction models for ordinal outcomes, which can systematically identify potential predictors from high-dimensional data.",
                "authors": [
                    {
                        "name": "Chakraborty B."
                    },
                    {
                        "name": "Liu N."
                    },
                    {
                        "name": "Ning Y."
                    },
                    {
                        "name": "Ong M.E.H."
                    },
                    {
                        "name": "Saffari S.E."
                    },
                    {
                        "name": "Vaughan R."
                    },
                    {
                        "name": "Volovici V."
                    },
                    {
                        "name": "Xie F."
                    }
                ],
                "citationCount": 3,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "AutoScore-Ordinal: an interpretable machine learning framework for generating scoring models for ordinal outcomes"
            },
            "pmcid": "PMC9636613",
            "pmid": "36333672"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
