{"collectionID": [], "accessibility": [], "topic": [{"term": "ChIP-seq", "uri": "http://edamontology.org/topic_3169"}], "owner": "seqwiki_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "22784574", "type": null, "pmcid": null, "metadata": {"title": "Pinpointing transcription factor binding sites from ChIP-seq data with SeqSite", "abstract": "Background: Chromatin immunoprecipitation combined with the next-generation DNA sequencing technologies (ChIP-seq) becomes a key approach for detecting genome-wide sets of genomic sites bound by proteins, such as transcription factors (TFs). Several methods and open-source tools have been developed to analyze ChIP-seq data. However, most of them are designed for detecting TF binding regions instead of accurately locating transcription factor binding sites (TFBSs). It is still challenging to pinpoint TFBSs directly from ChIP-seq data, especially in regions with closely spaced binding events.Results: With the aim to pinpoint TFBSs at a high resolution, we propose a novel method named SeqSite, implementing a two-step strategy: detecting tag-enriched regions first and pinpointing binding sites in the detected regions. The second step is done by modeling the tag density profile, locating TFBSs on each strand with a least-squares model fitting strategy, and merging the detections from the two strands. Experiments on simulation data show that SeqSite can locate most of the binding sites more than 40-bp from each other. Applications on three human TF ChIP-seq datasets demonstrate the advantage of SeqSite for its higher resolution in pinpointing binding sites compared with existing methods.Conclusions: We have developed a computational tool named SeqSite, which can pinpoint both closely spaced and isolated binding sites, and consequently improves the resolution of TFBS detection from ChIP-seq data. © 2011 Wang and Zhang; licensee BioMed Central Ltd.", "citationCount": 4, "authors": [{"name": "Wang X."}, {"name": "Zhang X."}], "date": "2011-12-14T00:00:00Z", "journal": "BMC Systems Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Xuegong Zhang (Corresponding)", "url": "http://bioinfo.au.tsinghua.edu.cn/member/xzhang/XZhang_English.htm", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "zhangxg@tsinghua.edu.cn"}, {"typeRole": ["Primary contact"], "name": "Xi Wang (Software details/bugs)", "url": "http://bioinfo.au.tsinghua.edu.cn/member/xwang/", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "wang-xi05@mails.thu.edu.cn"}], "biotoolsCURIE": "biotools:seqsite", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://bioinfo.au.tsinghua.edu.cn/software/seqsite/", "function": [{"note": null, "input": [], "operation": [{"term": "Peak calling", "uri": "http://edamontology.org/operation_3222"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:43Z", "otherID": [], "description": "SeqSite is an efficient and easy-to-use software tool implementing a novel method for identifying and pinpointing transcription factor binding sites. It first detects transcription factor binding regions by clustering tags and statistical hypothesis testing, and locates every binding site in detected binding regions by modeling the tag profiles. It can pinpoint closely spaced adjacent binding sites from ChIP-seq data. This software is coded in C/C++, and supports major computer platforms.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["C++", "C"], "link": [], "biotoolsID": "seqsite", "additionDate": "2017-01-13T13:16:21Z", "name": "SeqSite", "license": "GPL-3.0", "documentation": [], "maturity": "Mature", "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}