{
    "accessibility": "Open access",
    "additionDate": "2022-10-02T20:48:03.398826Z",
    "biotoolsCURIE": "biotools:j-space",
    "biotoolsID": "j-space",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fabrizio.angaroni@unimib.it",
            "name": "Fabrizio Angaroni",
            "orcidid": "https://orcid.org/0000-0002-3375-6686",
            "typeEntity": "Person"
        },
        {
            "name": "Alberto d’Onofrio"
        },
        {
            "name": "Alex Graudenzi"
        },
        {
            "name": "Marco Antoniotti"
        }
    ],
    "description": "A Julia package for the simulation of spatial models of cancer evolution and of sequencing experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Phylogenetic analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BIMIB-DISCo/J-Space.jl",
    "language": [
        "Julia"
    ],
    "lastUpdate": "2022-10-02T20:48:03.401518Z",
    "license": "Other",
    "name": "J-SPACE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04779-8",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: The combined effects of biological variability and measurement-related errors on cancer sequencing data remain largely unexplored. However, the spatio-temporal simulation of multi-cellular systems provides a powerful instrument to address this issue. In particular, efficient algorithmic frameworks are needed to overcome the harsh trade-off between scalability and expressivity, so to allow one to simulate both realistic cancer evolution scenarios and the related sequencing experiments, which can then be used to benchmark downstream bioinformatics methods. Result: We introduce a Julia package for SPAtial Cancer Evolution (J-SPACE), which allows one to model and simulate a broad set of experimental scenarios, phenomenological rules and sequencing settings.Specifically, J-SPACE simulates the spatial dynamics of cells as a continuous-time multi-type birth-death stochastic process on a arbitrary graph, employing different rules of interaction and an optimised Gillespie algorithm. The evolutionary dynamics of genomic alterations (single-nucleotide variants and indels) is simulated either under the Infinite Sites Assumption or several different substitution models, including one based on mutational signatures. After mimicking the spatial sampling of tumour cells, J-SPACE returns the related phylogenetic model, and allows one to generate synthetic reads from several Next-Generation Sequencing (NGS) platforms, via the ART read simulator. The results are finally returned in standard FASTA, FASTQ, SAM, ALN and Newick file formats. Conclusion: J-SPACE is designed to efficiently simulate the heterogeneous behaviour of a large number of cancer cells and produces a rich set of outputs. Our framework is useful to investigate the emergent spatial dynamics of cancer subpopulations, as well as to assess the impact of incomplete sampling and of experiment-specific errors. Importantly, the output of J-SPACE is designed to allow the performance assessment of downstream bioinformatics pipelines processing NGS data. J-SPACE is freely available at: https://github.com/BIMIB-DISCo/J-Space.jl.",
                "authors": [
                    {
                        "name": "Angaroni F."
                    },
                    {
                        "name": "Antoniotti M."
                    },
                    {
                        "name": "Ascolani G."
                    },
                    {
                        "name": "Graudenzi A."
                    },
                    {
                        "name": "Guidi A."
                    },
                    {
                        "name": "d'Onofrio A."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "J-SPACE: a Julia package for the simulation of spatial models of cancer evolution and of sequencing experiments"
            },
            "pmcid": "PMC9270769",
            "pmid": "35804300"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
