{
    "additionDate": "2021-01-18T07:10:33Z",
    "biotoolsCURIE": "biotools:resistance_sniffer",
    "biotoolsID": "resistance_sniffer",
    "confidence_flag": "tool",
    "description": "An online tool for prediction of drug resistance patterns of Mycobacterium tuberculosis isolates using next generation sequencing data.\n\nResistance Sniffer: Prediction of Drug Resistance by Sequence Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "http://resistance-sniffer.bi.up.ac.za/",
    "lastUpdate": "2021-02-06T13:37:57Z",
    "name": "Resistance Sniffer",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.IJMM.2020.151399",
            "metadata": {
                "abstract": "© 2020 The AuthorsThe effective control of multidrug resistant tuberculosis (MDR-TB) relies upon the timely diagnosis and correct treatment of all tuberculosis cases. Whole genome sequencing (WGS) has great potential as a method for the rapid diagnosis of drug resistant Mycobacterium tuberculosis (Mtb) isolates. This method overcomes most of the problems that are associated with current phenotypic drug susceptibility testing. However, the application of WGS in the clinical setting has been deterred by data complexities and skill requirements for implementing the technologies as well as clinical interpretation of the next generation sequencing (NGS) data. The proposed diagnostic application was drawn upon recent discoveries of patterns of Mtb clade-specific genetic polymorphisms associated with antibiotic resistance. A catalogue of genetic determinants of resistance to thirteen anti-TB drugs for each phylogenetic clade was created. A computational algorithm for the identification of states of diagnostic polymorphisms was implemented as an online software tool, Resistance Sniffer (http://resistance-sniffer.bi.up.ac.za/), and as a stand-alone software tool to predict drug resistance in Mtb isolates using complete or partial genome datasets in different file formats including raw Illumina fastq read files. The program was validated on sequenced Mtb isolates with data on antibiotic resistance trials available from GMTV database and from the TB Platform of South African Medical Research Council (SAMRC), Pretoria. The program proved to be suitable for probabilistic prediction of drug resistance profiles of individual strains and large sequence data sets.",
                "authors": [
                    {
                        "name": "Muzondiwa D."
                    },
                    {
                        "name": "Mutshembele A."
                    },
                    {
                        "name": "Pierneef R.E."
                    },
                    {
                        "name": "Reva O.N."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-01T00:00:00Z",
                "journal": "International Journal of Medical Microbiology",
                "title": "Resistance Sniffer: An online tool for prediction of drug resistance patterns of Mycobacterium tuberculosis isolates using next generation sequencing data"
            },
            "pmid": "31980371"
        }
    ],
    "topic": [
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ]
}