{
    "additionDate": "2022-06-28T09:49:59.703206Z",
    "biotoolsCURIE": "biotools:mdadp",
    "biotoolsID": "mdadp",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Lei Wang"
        },
        {
            "name": "Quan Zou"
        }
    ],
    "description": "A webserver integrating database and prediction tools for microbe-disease associations.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://mdadp.leelab2997.cn",
    "lastUpdate": "2024-11-24T15:59:36.450466Z",
    "license": "Not licensed",
    "name": "MDADP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/jbhi.2022.3156166",
            "metadata": {
                "abstract": "More and more evidence has demonstrated that microbiota play important roles in the life processes of the human body. In recent years, various computational methods have been proposed for identifying potentially disease-associated microbes to save costs in traditional biological experiments. However, prediction performances of these methods are generally limited by outdated and incomplete datasets. And moreover, until now, there are limited studies that can provide visual predictive tools for inferring possible microbe-disease associations (MDAs) as well. Hence, in this manuscript, a novel webserver called MDADP will be proposed to identify latent MDAs, in which, a new MDA database together with interactive prediction tools for MDAs studies will be designed simultaneously. Especially, in the newly constructed MDA database, 2019 known MDAs between 58 diseases and 703 microbes have been manually collected first. And then, through adopting the average ranking method and the co-confidence method respectively, eight representative computational models have been integrated together to identify potential disease-related microbes. As a result, MDADP can provide not only interactive features for users to access and capture MDAs entities, but alsoeffective tools for users to identify candidate microbes for different diseases. To our knowledge, MDADP is the first online platform that incorporates a new MDA database with comprehensive MDA prediction tools. Therefore, we believe that it will be a valuable source of information for researches in microbiology and disease-related fields. MDADP can be accessed at http://mdadp.leelab2997.cn.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Pei T."
                    },
                    {
                        "name": "Tan Y."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 6,
                "date": "2022-07-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "MDADP: A Webserver Integrating Database and Prediction Tools for Microbe-Disease Associations"
            },
            "pmid": "35254998"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
