{"credit":[{"email":"xushua@picb.ac.cn","name":"Shuhua Xu","typeEntity":"Person","typeRoles":["Primary contact"]}],"download":[{"type":"Source code","url":"http://www.picb.ac.cn/PGG/resource_download.php?id=37&file=PGG_Web_Soft/MultiWaveInfer-2.0.tar.gz"}],"function":[{"operation":[{"term":"Haplotype mapping","uri":"http://edamontology.org/operation_0487"},{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"},{"term":"Ancestral reconstruction","uri":"http://edamontology.org/operation_3745"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","maturity":"Mature","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"},{"term":"Evolutionary biology","uri":"http://edamontology.org/topic_3299"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"}]},"publication":[{"abstract":"© 2018, European Society of Human Genetics. Our goal in developing the MultiWaver software series was to be able to infer population admixture history under various complex scenarios. The earlier version of MultiWaver considered only discrete admixture models. Here, we report a newly developed version, MultiWaver 2.0, that implements a more flexible framework and is capable of inferring multiple-wave admixture histories under both discrete and continuous admixture models. MultiWaver 2.0 can automatically select an optimal admixture model based on the length distribution of ancestral tracks of chromosomes, and the program can estimate the corresponding parameters under the selected model. Specifically, for discrete admixture models, we used a likelihood ratio test (LRT) to determine the optimal discrete model and an expectation–maximization algorithm to estimate the parameters. In addition, according to the principles of the Bayesian Information Criterion (BIC), we compared the optimal discrete model with several continuous admixture models. In MultiWaver 2.0, we also applied a bootstrapping technique to provide levels of support for the chosen model and the confidence interval (CI) of the estimations of admixture time. Simulation studies validated the reliability and effectiveness of our method. Finally, the program performed well when applied to real datasets of typical admixed populations, such as African Americans, Uyghurs, and Hazaras.","authors":["Ni X.","Yuan K.","Liu C.","Feng Q.","Tian L.","Ma Z.","Xu S."],"cit_count":0,"doi":"10.1038/s41431-018-0259-3","journal":"European Journal of Human Genetics","pmid":"30206356","title":"MultiWaver 2.0: modeling discrete and continuous gene flow to reconstruct complex population admixtures","type":"Primary","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:MultiWaver","biotoolsID":"MultiWaver","description":"Models discrete and continuous gene flow to reconstruct complex population admixtures.","homepage":"http://www.picb.ac.cn/PGG/resource.php","name":"MultiWaver","version":["2.0"]}}