{
    "additionDate": "2018-07-07T21:18:49Z",
    "biotoolsCURIE": "biotools:miic",
    "biotoolsID": "miic",
    "credit": [
        {
            "email": "nadir.sella@curie.fr",
            "name": "Nadir Sella",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Learn a large class of causal or non-causal graphical models from purely observational data, while including the effects of unobserved latent variables, commonly found in many datasets. Starting from a complete graph, the method iteratively removes dispensable edges, by uncovering significant information contributions from indirect paths, and assesses edge-specific confidences from randomization of available data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/miic/miic.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/miic/index.html",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-11-25T14:32:07.583255Z",
    "name": "MIIC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005662",
            "metadata": {
                "abstract": "Learning causal networks from large-scale genomic data remains challenging in absence of time series or controlled perturbation experiments. We report an information- theoretic method which learns a large class of causal or non-causal graphical models from purely observational data, while including the effects of unobserved latent variables, commonly found in many genomic datasets. Starting from a complete graph, the method iteratively removes dispensable edges, by uncovering significant information contributions from indirect paths, and assesses edge-specific confidences from randomization of available data. The remaining edges are then oriented based on the signature of causality in observational data. The approach and associated algorithm, miic, outperform earlier methods on a broad range of benchmark networks. Causal network reconstructions are presented at different biological size and time scales, from gene regulation in single cells to whole genome duplication in tumor development as well as long term evolution of vertebrates. Miic is publicly available at https://github.com/miicTeam/MIIC.",
                "authors": [
                    {
                        "name": "Affeldt S."
                    },
                    {
                        "name": "Isambert H."
                    },
                    {
                        "name": "Sella N."
                    },
                    {
                        "name": "Singh P.P."
                    },
                    {
                        "name": "Verny L."
                    }
                ],
                "citationCount": 34,
                "date": "2017-10-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Learning causal networks with latent variables from multivariate information in genomic data"
            },
            "pmcid": "PMC5685645",
            "pmid": "28968390",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
