{
    "accessibility": "Open access",
    "additionDate": "2022-06-07T06:38:59.447219Z",
    "biotoolsCURIE": "biotools:deepcapkcr",
    "biotoolsID": "deepcapkcr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jhabindra Khanal"
        },
        {
            "name": "Kil To Chong"
        }
    ],
    "description": "Accurate identification and investigation of protein lysine crotonylation sites based on capsule network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Jhabindra-bioinfo/DeepCap-Kcr",
    "lastUpdate": "2022-06-07T06:38:59.449773Z",
    "name": "DeepCap-Kcr",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB492",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved.Lysine crotonylation (Kcr) is a posttranslational modification widely detected in histone and nonhistone proteins. It plays a vital role in human disease progression and various cellular processes, including cell cycle, cell organization, chromatin remodeling and a key mechanism to increase proteomic diversity. Thus, accurate information on such sites is beneficial for both drug development and basic research. Existing computational methods can be improved to more effectively identify Kcr sites in proteins. In this study, we proposed a deep learning model, DeepCap-Kcr, a capsule network (CapsNet) based on a convolutional neural network (CNN) and long short-term memory (LSTM) for robust prediction of Kcr sites on histone and nonhistone proteins (mammals). The proposed model outperformed the existing CNN architecture Deep-Kcr and other well-established tools in most cases and provided promising outcomes for practical use; in particular, the proposed model characterized the internal hierarchical representation as well as the important features from multiple levels of abstraction automatically learned from a small number of samples. The trained model was well generalized in other species (papaya). Moreover, we showed the features and properties generated by the internal capsule layer that can explore the internal data distribution related to biological significance (as a motif detector). The source code and data are freely available at https://github.com/Jhabindra-bioinfo/DeepCap-Kcr.",
                "authors": [
                    {
                        "name": "Chong K.T."
                    },
                    {
                        "name": "Khanal J."
                    },
                    {
                        "name": "Tayara H."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 1,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "DeepCap-Kcr: accurate identification and investigation of protein lysine crotonylation sites based on capsule network"
            },
            "pmid": "34882222"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ]
}
