{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:19:21Z",
    "biotoolsCURIE": "biotools:PS-Plant",
    "biotoolsID": "PS-Plant",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "alistair.mccormick@ed.ac.uk",
            "name": "Alistair J McCormick",
            "orcidid": "https://orcid.org/0000-0002-7255-872X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Photometric stereo-based 3D imaging system using computer vision and deep learning for tracking plant growth.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "https://www.youtube.com/watch?v=7q6ZnJvhx6I"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/g2-bernotas/PS-Plant-Framework/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/g2-bernotas/PS-Plant-Framework",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-18T13:09:31Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/g2-bernotas/PS-Plant-Framework/issues"
        }
    ],
    "maturity": "Mature",
    "name": "PS-Plant",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_017032"
        }
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ056",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.Background: Tracking and predicting the growth performance of plants in different environments is critical for predicting the impact of global climate change. Automated approaches for image capture and analysis have allowed for substantial increases in the throughput of quantitative growth trait measurements compared with manual assessments. Recent work has focused on adopting computer vision and machine learning approaches to improve the accuracy of automated plant phenotyping. Here we present PS-Plant, a low-cost and portable 3D plant phenotyping platform based on an imaging technique novel to plant phenotyping called photometric stereo (PS). Results: We calibrated PS-Plant to track the model plant Arabidopsis thaliana throughout the day-night (diel) cycle and investigated growth architecture under a variety of conditions to illustrate the dramatic effect of the environment on plant phenotype. We developed bespoke computer vision algorithms and assessed available deep neural network architectures to automate the segmentation of rosettes and individual leaves, and extract basic and more advanced traits from PS-derived data, including the tracking of 3D plant growth and diel leaf hyponastic movement. Furthermore, we have produced the first PS training data set, which includes 221 manually annotated Arabidopsis rosettes that were used for training and data analysis (1,768 images in total). A full protocol is provided, including all software components and an additional test data set. Conclusions: PS-Plant is a powerful new phenotyping tool for plant research that provides robust data at high temporal and spatial resolutions. The system is well-suited for small- and large-scale research and will help to accelerate bridging of the phenotype-to-genotype gap.",
                "authors": [
                    {
                        "name": "Bernotas G."
                    },
                    {
                        "name": "Hales I.J."
                    },
                    {
                        "name": "Halliday K.J."
                    },
                    {
                        "name": "Hansen M.F."
                    },
                    {
                        "name": "McCormick A.J."
                    },
                    {
                        "name": "Scorza L.C.T."
                    },
                    {
                        "name": "Smith L.N."
                    },
                    {
                        "name": "Smith M.L."
                    }
                ],
                "citationCount": 14,
                "date": "2019-05-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "A photometric stereo-based 3D imaging system using computer vision and deep learning for tracking plant growth"
            },
            "pmcid": "PMC6534809",
            "pmid": "31127811",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
