
{
    "credit": [
    ],
    "labels": {
        "topic": [
            {
                "term": "Psychiatry",
                "uri": "http://edamontology.org/topic_3419"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 American Psychological Association.A consequence of a growing incarceration rate is that an increasing number of children face having an incarcerated household member, a known contributor to diverse lifelong behavioral health risks such as substance use and mental health impairment. Few studies have explored how household incarceration uniquely contributes to these subsequent behavioral health concerns, nor mediational contributors to these associations, within a theoretical framework. Using state Behavioral Risk Factor Surveillance System survey data (n = 14,001), this study tests pathways of household incarceration and Adverse Childhood Experiences (ACEs) to mental health impairment and substance use in adulthood. Within a life course stress process perspective, this study uses structural equation modeling to examine mediational pathways through adulthood incarceration and indicators of adulthood adversity, low income, and supportive resources. In line with stress process theorizing, results indicate significant direct and indirect paths of ACEs through nearly all theorized mediators, and indirect pathways of household incarceration, through incarceration and low income, to adulthood mental health impairment and substance use. Implications of these findings address preventive and interventive leverage points to mitigate long-term consequences of household incarceration and other childhood adversities.",
            "authors": [
                "Fleming C.M.",
                "Nurius P.S."
            ],
            "cit_count": 0,
            "doi": "10.1037/ORT0000436",
            "journal": "American Journal of Orthopsychiatry",
            "pmid": "31829646",
            "title": "Incarceration and Adversity Histories: Modeling Life Course Pathways Affecting Behavioral Health",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:incarceration",
        "biotoolsID": "incarceration",
        "description": "Modeling life course pathways affecting behavioral health.\n\nA consequence of a growing incarceration rate is that an increasing number of children face having an incarcerated household member, a known contributor to diverse lifelong behavioral health risks such as substance use and mental health impairment. Few studies have explored how household incarceration uniquely contributes to these subsequent behavioral health concerns, nor mediational contributors to these associations, within a theoretical framework. Using state Behavioral Risk Factor Surveillance System survey data (n = 14,001), this study tests pathways of household incarceration and Adverse Childhood Experiences (ACEs) to mental health impairment and substance use in adulthood.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'household incarceration'",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31829646",
        "name": "incarceration"
    }
}