{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:05:05Z",
    "biotoolsCURIE": "biotools:CISI",
    "biotoolsID": "CISI",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hj@uestc.edu.cn",
            "name": "Jian Huang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Tool for Predicting Cross-interaction or Self-interaction of Monoclonal Antibodies Using Sequences.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://i.uestc.edu.cn/eli/help.html"
        }
    ],
    "download": [
        {
            "type": "Biological data",
            "url": "http://i.uestc.edu.cn/eli/downloads/CISI.xlsx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://i.uestc.edu.cn/eli/cgi-bin/cisi.pl",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "CISI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1007/S12539-019-00330-1",
            "metadata": {
                "abstract": "© 2019, International Association of Scientists in the Interdisciplinary Areas.Monoclonal antibodies (mAbs) are one of the robust classes of therapeutic proteins. Their stability, specificity, and high solubility allow the successful development and commercialization of antibody-based drugs. Though with these characteristics, mAbs projects are often suspended due to self- or cross-interaction of monoclonal antibodies. This is one of the main reasons which causes the development of mAbs into drugs taking forever and expensive. CISI is short for cross-interaction or self-interaction of mAbs. It can be quantified by several assays. The assays such as poly-specificity reagent and cross-interaction chromatography can measure cross-interaction of mAbs. Self-interaction can be assayed through clone self-interaction by biolayer interferometry and affinity-capture self-interaction nanoparticle spectroscopy. To save time and money, we developed a model called CISI which can predict cross-interaction or self-interaction based on tripeptide composition. It showed 88.20% accuracy, 90.22% sensitivity, 86.05% specificity, 0.78 Mathew correlation coefficient, and 0.96 area under the receiver operating characteristic (ROC) curve (AUC) in the leave-one-out cross-validation. CISI is freely available at http://i.uestc.edu.cn/eli/cgi-bin/cisi.pl.",
                "authors": [
                    {
                        "name": "Dzisoo A.M."
                    },
                    {
                        "name": "He B."
                    },
                    {
                        "name": "Karikari R."
                    },
                    {
                        "name": "Agoalikum E."
                    },
                    {
                        "name": "Huang J."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences: Computational Life Sciences",
                "title": "CISI: A Tool for Predicting Cross-interaction or Self-interaction of Monoclonal Antibodies Using Sequences"
            },
            "pmid": "31119495",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}