{
    "additionDate": "2018-07-24T15:07:52Z",
    "biotoolsCURIE": "biotools:ribocat",
    "biotoolsID": "ribocat",
    "credit": [
        {
            "email": "willc.tools@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Capillary electrophoresis data analysis tool for nucleic acid probing.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://research.cbc.osu.edu/musier-forsyth.1/wp-content/uploads/2016/10/UserManual_v06.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure analysis",
                    "uri": "http://edamontology.org/operation_2439"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5238798/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "RiboCAT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1261/rna.058404.116",
            "metadata": {
                "abstract": "© 2017 Cantara et al.Chemical and enzymatic probing of RNA secondary structure and RNA/protein interactions provides the basis for understanding the functions of structured RNAs. However, the ability to rapidly perform such experiments using capillary electrophoresis has been hampered by relatively labor-intensive data analysis software. While these computationally robust programs have been shown to calculate residue-specific reactivities to a high degree of accuracy, they often require time-consuming manual intervention and lack the ability to be easily modified by users. To alleviate these issues, RiboCAT (Ribonucleic acid capillary-electrophoresis analysis tool) was developed as a user-friendly, Microsoft Excel-based tool that reduces the need for manual intervention, thereby significantly shortening the time required for data analysis. Features of this tool include (i) the use of an Excel platform, (ii) a method of intercapillary signal alignment using internal size standards, (iii) a peak-sharpening algorithm to more accurately identify peaks, and (iv) an open architecture allowing for simple user intervention. Furthermore, a complementary tool, RiboDOG (RiboCAT data output generator) was designed to facilitate the comparison of multiple data sets, highlighting potential inconsistencies and inaccuracies that may have occurred during analysis. Using these new tools, the secondary structure of the HIV-1 5′ untranslated region (5′UTR) was determined using selective 2′-hydroxyl acylation analyzed by primer extension (SHAPE), matching the results of previous work.",
                "authors": [
                    {
                        "name": "Cantara W.A."
                    },
                    {
                        "name": "Hatterschide J."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Musier-Forsyth K."
                    }
                ],
                "citationCount": 9,
                "date": "2017-02-01T00:00:00Z",
                "journal": "RNA",
                "title": "RiboCAT: A new capillary electrophoresis data analysis tool for nucleic acid probing"
            },
            "pmcid": "PMC5238798",
            "pmid": "27821510"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3557"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}