{
    "additionDate": "2019-11-14T18:08:42Z",
    "biotoolsCURIE": "biotools:Crossmapper",
    "biotoolsID": "Crossmapper",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "grant.hovhannisyan@gmail.com",
            "name": "Hrant Hovhannisyan",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "ah.hafez@gmail.com",
            "name": "Ahmed Hafez",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "estimating cross-mapping rates and optimizing experimental design in multi-species sequencing studies | General descripiton of Crossmapper | Crossmapper is an automated bioinformatics pipeline for asessing the rate of read crossmapping when two or more organisms are sequenced as one sample. The software can be used for planning such kind of experimental setups as dual- or multiple RNA-seq (mainly for host-pathogen, symbiont and cohabitant interaction studies), metagenomics studies, sequencing and analysis of hybrid species, allele-specific expression studies, and can be extended for the use in large sequencing facilities for resource optimization",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Gabaldonlab/crossmapper/wiki"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/Gabaldonlab/crossmapper",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T08:53:13Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Gabaldonlab/crossmapper/issues"
        }
    ],
    "name": "Crossmapper",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ626",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Numerous sequencing studies, including transcriptomics of host-pathogen systems, sequencing of hybrid genomes, xenografts, mixed species systems, metagenomics and meta-transcriptomics, involve samples containing genetic material from divergent organisms. A crucial step in these studies is identifying from which organism each sequencing read originated, and the experimental design should be directed to minimize biases caused by cross-mapping of reads to incorrect source genomes. Additionally, pooling of sufficiently different genetic material into a single sequencing library could significantly reduce experimental costs but requires careful planning and assessment of the impact of cross-mapping. Having these applications in mind we designed Crossmapper, the first to our knowledge tool able to assess cross-mapping prior to sequencing, therefore allowing optimization of experimental design. Results: Using any combination of reference genomes, Crossmapper performs read simulation and back-mapping of those reads to the pool of references, quantifies and reports the cross-mapping rates for each organism. Crossmapper performs these analyses with numerous user-specified parameters, including, among others, read length, read layout, coverage, mapping parameters, genomic or transcriptomic data. Additionally, it outputs the results in highly interactive and publication-ready reports. This allows the user to perform multiple comparisons at once and choose the experimental setup minimizing cross-mapping rates. Moreover, Crossmapper can be used for resource optimization in sequencing facilities by pooling different samples into one sequencing library.",
                "authors": [
                    {
                        "name": "Hovhannisyan H."
                    },
                    {
                        "name": "Hafez A."
                    },
                    {
                        "name": "Llorens C."
                    },
                    {
                        "name": "Gabaldon T."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CROSSMAPPER: Estimating cross-mapping rates and optimizing experimental design in multi-species sequencing studies"
            },
            "pmcid": "PMC7049214",
            "pmid": "31392323"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}