{
    "additionDate": "2017-08-03T18:59:29Z",
    "biotoolsCURIE": "biotools:sfdr",
    "biotoolsID": "sfdr",
    "credit": [
        {
            "email": "sun@utstat.toronto.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://fisher.utstat.toronto.edu/sun"
        },
        {
            "email": "yoo@mshri.on.ca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A program to compute FDR q-values of genome-wide SNP association analysis within each stratum. Especialy the SFDR program is taylored to directly use genome-wide linkage scan results to assign strata. Weighted FDR q-values can be also computed as an alternative to SFDR.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://fisher.utstat.toronto.edu/sun/Software/SFDR/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "http://fisher.utstat.toronto.edu/sun/Software/SFDR/index.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/sfdr-stratified-false-discovery-rate-control.html"
        }
    ],
    "name": "SFDR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The multiplicity problem has become increasingly important in genetic studies as the capacity for high-throughput genotyping has increased. The control of False Discovery Rate (FDR) (Benjamini and Hochberg. [1995] J. R. Stat. Soc. Ser. B 57:289-300) has been adopted to address the problems of false positive control and low power inherent in high-volume genome-wide linkage and association studies. In many genetic studies, there is often a natural stratification of the m hypotheses to be tested. Given the FDR framework and the presence of such stratification, we investigate the performance of a stratified false discovery control approach (i.e. control or estimate FDR separately for each stratum) and compare it to the aggregated method (i.e. consider all hypotheses in a single stratum). Under the fixed rejection region framework (i.e. reject all hypotheses with unadjusted p-values less than a pre-specified level and then estimate FDR), we demonstrate that the aggregated FDR is a weighted average of the stratum-specific FDRs. Under the fixed FDR framework (i.e. reject as many hypotheses as possible and meanwhile control FDR at a pre-specified level), we specify a condition necessary for the expected total number of true positives under the stratified FDR method to be equal to or greater than that obtained from the aggregated FDR method. Application to a recent Genome-Wide Association (GWA) study by Maraganore et al. ([2005] Am. J. Hum. Genet. 77:685-693) illustrates the potential advantages of control or estimation of FDR by stratum. Our analyses also show that controlling FDR at a low rate, e.g. 5% or 10%, may not be feasible for some GWA studies. © 2006 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Sun L."
                    },
                    {
                        "name": "Craiu R.V."
                    },
                    {
                        "name": "Paterson A.D."
                    },
                    {
                        "name": "Bull S.B."
                    }
                ],
                "citationCount": 99,
                "date": "2006-09-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Stratified false discovery control for large-scale hypothesis testing with application to genome-wide association studies"
            },
            "pmid": "16800000"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}