{
    "accessibility": "Open access",
    "additionDate": "2019-05-11T06:09:25Z",
    "biotoolsCURIE": "biotools:RDFIO",
    "biotoolsID": "RDFIO",
    "cost": "Free of charge",
    "credit": [
        {
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/rdfio/RDFIO/issues"
        }
    ],
    "description": "Extends the RDF import and export functionality in Semantic MediaWiki (SMW) to enable using SMW as a collaborative platform for editing semantic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/rdfio/RDFIO"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://www.mediawiki.org/wiki/Extension:RDFIO"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://pharmb.io/project/rdfio/",
    "language": [
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "maturity": "Mature",
    "name": "RDFIO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s13326-017-0136-y",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Biological sciences are characterised not only by an increasing amount but also the extreme complexity of its data. This stresses the need for efficient ways of integrating these data in a coherent description of biological systems. In many cases, biological data needs organization before integration. This is not seldom a collaborative effort, and it is thus important that tools for data integration support a collaborative way of working. Wiki systems with support for structured semantic data authoring, such as Semantic MediaWiki, provide a powerful solution for collaborative editing of data combined with machine-readability, so that data can be handled in an automated fashion in any downstream analyses. Semantic MediaWiki lacks a built-in data import function though, which hinders efficient round-tripping of data between interoperable Semantic Web formats such as RDF and the internal wiki format. Results: To solve this deficiency, the RDFIO suite of tools is presented, which supports importing of RDF data into Semantic MediaWiki, with metadata needed to export it again in the same RDF format, or ontology. Additionally, the new functionality enables mash-ups of automated data imports combined with manually created data presentations. The application of the suite of tools is demonstrated by importing drug discovery related data about rare diseases from Orphanet and acid dissociation constants from Wikidata. The RDFIO suite of tools is freely available for download via pharmb.io/project/rdfio. Conclusions: Through a set of biomedical demonstrators, it is demonstrated how the new functionality enables a number of usage scenarios where the interoperability of SMW and the wider Semantic Web is leveraged for biomedical data sets, to create an easy to use and flexible platform for exploring and working with biomedical data.",
                "authors": [
                    {
                        "name": "Lampa S."
                    },
                    {
                        "name": "Willighagen E."
                    },
                    {
                        "name": "Kohonen P."
                    },
                    {
                        "name": "King A."
                    },
                    {
                        "name": "Vrandecic D."
                    },
                    {
                        "name": "Grafstrom R."
                    },
                    {
                        "name": "Spjuth O."
                    }
                ],
                "date": "2017-09-04T00:00:00Z",
                "journal": "Journal of Biomedical Semantics",
                "title": "RDFIO: Extending Semantic MediaWiki for interoperable biomedical data management"
            },
            "pmcid": "PMC5584330",
            "pmid": "28870259",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "SPARQL endpoint"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ]
}