{
    "additionDate": "2021-01-18T11:16:27Z",
    "biotoolsCURIE": "biotools:kitsune",
    "biotoolsID": "kitsune",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "INookaew@uams.edu",
            "name": "Intawat Nookaew",
            "typeEntity": "Person"
        }
    ],
    "description": "A Tool for Identifying Empirically Optimal K-mer Length for Alignment-Free Phylogenomic Analysis.\n\nKITSUNE: K-mer-length Iterative Selection for UNbiased Ecophylogenomics.\n\nKITSUNE is a toolkit for evaluation of the length of k-mer in a given genome dataset for alignment-free phylogenimic analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Base-calling",
                    "uri": "http://edamontology.org/operation_3185"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/natapol/kitsune",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-12T10:35:50Z",
    "license": "GPL-3.0",
    "name": "KITSUNE",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.556413",
            "metadata": {
                "abstract": "© Copyright © 2020 Pornputtapong, Acheampong, Patumcharoenpol, Jenjaroenpun, Wongsurawat, Jun, Yongkiettrakul, Chokesajjawatee and Nookaew.Genomic DNA is the best “unique identifier” for organisms. Alignment-free phylogenomic analysis, simple, fast, and efficient method to compare genome sequences, relies on looking at the distribution of small DNA sequence of a particular length, referred to as k-mer. The k-mer approach has been explored as a basis for sequence analysis applications, including assembly, phylogenetic tree inference, and classification. Although this approach is not novel, selecting the appropriate k-mer length to obtain the optimal resolution is rather arbitrary. However, it is a very important parameter for achieving the appropriate resolution for genome/sequence distances to infer biologically meaningful phylogenetic relationships. Thus, there is a need for a systematic approach to identify the appropriate k-mer from whole-genome sequences. We present K-mer–length Iterative Selection for UNbiased Ecophylogenomics (KITSUNE), a tool for assessing the empirically optimal k-mer length of any given set of genomes of interest for phylogenomic analysis via a three-step approach based on (1) cumulative relative entropy (CRE), (2) average number of common features (ACF), and (3) observed common features (OCF). Using KITSUNE, we demonstrated the feasibility and reliability of these measurements to obtain empirically optimal k-mer lengths of 11, 17, and ∼34 from large genome datasets of viruses, bacteria, and fungi, respectively. Moreover, we demonstrated a feature of KITSUNE for accurate species identification for the two de novo assembled bacterial genomes derived from error-prone long-reads sequences, and for a published yeast genome. In addition, KITSUNE was used to identify the shortest species-specific k-mer accurately identifying viruses. KITSUNE is freely available at https://github.com/natapol/kitsune.",
                "authors": [
                    {
                        "name": "Acheampong D.A."
                    },
                    {
                        "name": "Chokesajjawatee N."
                    },
                    {
                        "name": "Jenjaroenpun P."
                    },
                    {
                        "name": "Jun S.-R."
                    },
                    {
                        "name": "Nookaew I."
                    },
                    {
                        "name": "Patumcharoenpol P."
                    },
                    {
                        "name": "Pornputtapong N."
                    },
                    {
                        "name": "Wongsurawat T."
                    },
                    {
                        "name": "Yongkiettrakul S."
                    }
                ],
                "date": "2020-09-23T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "KITSUNE: A Tool for Identifying Empirically Optimal K-mer Length for Alignment-Free Phylogenomic Analysis"
            },
            "pmcid": "PMC7538862",
            "pmid": "33072720"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
