{
    "additionDate": "2020-01-09T18:05:29Z",
    "biotoolsCURIE": "biotools:RMLNet",
    "biotoolsID": "RMLNet",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "hcwang@bjtu.edu.cn",
            "name": "Hongchao Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Reliable Wireless Network for a Multiarea TDOA-Based Localization System.\n\nUltrawideband (UWB) wireless communication is a promising spread-spectrum technology for accurate localization among devices characterized by a low transmission power, a high rate and immunity to multipath propagation. The accurately of the clock synchronization algorithm and the time-difference-of-arrival (TDOA) localization algorithm provide precise position information of mobile nodes with centimeter-level accuracy for the UWB localization system. However, the reliability of target node localization for multi-area localization remains a subject of research. Especially for dynamic and harsh indoor environments, an effective scheme among competing target nodes for localization due to the scarcity of radio resources remains a challenge.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31658686",
    "lastUpdate": "2020-01-09T18:05:29Z",
    "name": "RMLNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19204374",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Ultrawideband (UWB) wireless communication is a promising spread-spectrum technology for accurate localization among devices characterized by a low transmission power, a high rate and immunity to multipath propagation. The accurately of the clock synchronization algorithm and the time-difference-of-arrival (TDOA) localization algorithm provide precise position information of mobile nodes with centimeter-level accuracy for the UWB localization system. However, the reliability of target node localization for multi-area localization remains a subject of research. Especially for dynamic and harsh indoor environments, an effective scheme among competing target nodes for localization due to the scarcity of radio resources remains a challenge. In this paper, we present RMLNet, an approach focus on the medium access control (MAC) layer, which guarantees general localization application reliability on multi-area localization. Specifically, the design requires specific and optimized solutions for managing and coordinating multiple anchor nodes. In addition, an approach for target area determination is proposed, which can approximately determine the region of the target node by the received signal strength indication (RSSI), to support RMLNet. Furthermore, we implement the system to estimate the localization of the target node and evaluate its performance in practice. Experiments and simulations show that RMLNet can achieve localization application reliability multi-area localization with a better localization performance of competing target nodes.",
                "authors": [
                    {
                        "name": "Xue Y."
                    },
                    {
                        "name": "Su W."
                    },
                    {
                        "name": "Yang D."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "RMLnet—a reliable wireless network for a multiarea TDOA-based localization system"
            },
            "pmcid": "PMC6832378",
            "pmid": "31658686"
        }
    ]
}