
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "Natural language processing",
                "uri": "http://edamontology.org/topic_0218"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Elsevier Inc.Background: Transcription factors (TFs) are proteins that are fundamental to transcription and regulation of gene expression. Each TF may regulate multiple genes and each gene may be regulated by multiple TFs. TFs can act as either activator or repressor of gene expression. This complex network of interactions between TFs and genes underlies many developmental and biological processes and is implicated in several human diseases such as cancer. Hence deciphering the network of TF-gene interactions with information on mode of regulation (activation vs. repression) is an important step toward understanding the regulatory pathways that underlie complex traits. There are many experimental, computational, and manually curated databases of TF-gene interactions. In particular, high-throughput ChIP-Seq datasets provide a large-scale map or transcriptional regulatory interactions. However, these interactions are not annotated with information on context and mode of regulation. Such information is crucial to gain a global picture of gene regulatory mechanisms and can aid in developing machine learning models for applications such as biomarker discovery, prediction of response to therapy, and precision medicine. Methods: In this work, we introduce a text-mining system to annotate ChIP-Seq derived interaction with such meta data through mining PubMed articles. We evaluate the performance of our system using gold standard small scale manually curated databases. Results: Our results show that the method is able to accurately extract mode of regulation with F-score 0.77 on TRRUST curated interaction and F-score 0.96 on intersection of TRUSST and ChIP-network. We provide a HTTP REST API for our code to facilitate usage. Availibility: Source code and datasets are available for download on GitHub: https://github.com/samanfrm/modex.",
            "authors": [
                "Farahmand S.",
                "Riley T.",
                "Zarringhalam K."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.JBI.2019.103353",
            "journal": "Journal of Biomedical Informatics",
            "pmid": "31857203",
            "title": "ModEx: A text mining system for extracting mode of regulation of transcription factor-gene regulatory interaction",
            "year": "2020-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ModEx",
        "biotoolsID": "ModEx",
        "description": "A text mining system for extracting mode of regulation of transcription factor-gene regulatory interaction.\n\nDeciphering the network of TF-target interactions with information on mode of regulation (activation vs. repression) is an important step toward understanding the regulatory pathways that underlie complex traits. There are many experimental, computational, and manually curated databases of TF-gene interactions. In particular, high-throughput ChIP-seq datasets provide a large-scale map or transcriptional regulatory interactions.\n\nModEx can be installed using the GitHub repository. All of the dependencies will be installed via setup.py script.\n\nSaman Farahmand, Todd Riley, Kourosh Zarringhalam, \"ModEx: A text mining system for extracting mode of regulation of Transcription Factor-gene regulatory interaction\", BioRxiv, 2019",
        "homepage": "https://github.com/samanfrm/modex",
        "name": "ModEx"
    }
}