{
    "additionDate": "2019-11-14T17:59:23Z",
    "biotoolsCURIE": "biotools:BactMAP",
    "biotoolsID": "BactMAP",
    "confidence_flag": "tool",
    "description": "an R package for integrating, analyzing and visualizing bacterial microscopy data | Abstract High-throughput analyses of single-cell microscopy data is a critical tool within the field of bacterial cell biology. Several programs have been developed to specifically segment bacterial cells from phase-contrast images. Together with spot and object detection algorithms, these programs offer powerful approaches to quantify observations from microscopy data, ranging from cell-to-cell genealogy to localization and movement of proteins. Most segmentation programs contain specific post-processing and plotting options, but these options vary between programs and possibilities to optimize or alter the outputs are often limited. Therefore, we developed BactMAP ( Bac terial t oolbox for M icroscopy A nalysis & P lotting), a software package that allows researchers to transform cell segmentation and spot detection data generated by different programs automatically into various plots",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://veeninglab.com/bactmap",
    "lastUpdate": "2020-12-03T07:13:25Z",
    "name": "BactMAP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/mmi.14417",
            "metadata": {
                "abstract": "© 2019 The Authors. Molecular Microbiology published by John Wiley & Sons LtdHigh-throughput analyses of single-cell microscopy data are a critical tool within the field of bacterial cell biology. Several programs have been developed to specifically segment bacterial cells from phase-contrast images. Together with spot and object detection algorithms, these programs offer powerful approaches to quantify observations from microscopy data, ranging from cell-to-cell genealogy to localization and movement of proteins. Most segmentation programs contain specific post-processing and plotting options, but these options vary between programs and possibilities to optimize or alter the outputs are often limited. Therefore, we developed BactMAP (Bacterial toolbox for Microscopy Analysis & Plotting), a command-line based R package that allows researchers to transform cell segmentation and spot detection data generated by different programs into various plots. Furthermore, BactMAP makes it possible to perform custom analyses and change the layout of the output. Because BactMAP works independently of segmentation and detection programs, inputs from different sources can be compared within the same analysis pipeline. BactMAP complies with standard practice in R which enables the use of advanced statistical analysis tools, and its graphic output is compatible with ggplot2, enabling adjustable plot graphics in every operating system. User feedback will be used to create a fully automated Graphical User Interface version of BactMAP in the future. Using BactMAP, we visualize key cell cycle parameters in Bacillus subtilis and Staphylococcus aureus, and demonstrate that the DNA replication forks in Streptococcus pneumoniae dissociate and associate before splitting of the cell, after the Z-ring is formed at the new quarter positions. BactMAP is available from https://veeninglab.com/bactmap.",
                "authors": [
                    {
                        "name": "Kjos M."
                    },
                    {
                        "name": "Veening J.-W."
                    },
                    {
                        "name": "van Raaphorst R."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Molecular Microbiology",
                "title": "BactMAP: An R package for integrating, analyzing and visualizing bacterial microscopy data"
            }
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
