{
    "additionDate": "2021-01-18T11:22:41Z",
    "biotoolsCURIE": "biotools:zinc20",
    "biotoolsID": "zinc20",
    "confidence_flag": "tool",
    "description": "Free Ultralarge-Scale Chemical Database for Ligand Discovery.\n\nZINC is a free database of commercially-available compounds for virtual screening. ZINC contains over 230 million purchasable compounds in ready-to-dock, 3D formats. ZINC also contains over 750 million purchasable compounds you can search for analogs in under a minute.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://zinc20.docking.org",
    "lastUpdate": "2021-03-20T13:08:13Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://zinc15.docking.org"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://wiki.docking.org/index.php/ZINC20"
        }
    ],
    "name": "ZINC20",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C00675",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Identifying and purchasing new small molecules to test in biological assays are enabling for ligand discovery, but as purchasable chemical space continues to grow into the tens of billions based on inexpensive make-on-demand compounds, simply searching this space becomes a major challenge. We have therefore developed ZINC20, a new version of ZINC with two major new features: billions of new molecules and new methods to search them. As a fully enumerated database, ZINC can be searched precisely using explicit atomic-level graph-based methods, such as SmallWorld for similarity and Arthor for pattern and substructure search, as well as 3D methods such as docking. Analysis of the new make-on-demand compound sets by these and related tools reveals startling features. For instance, over 97% of the core Bemis-Murcko scaffolds in make-on-demand libraries are unavailable from \"in-stock\"collections. Correspondingly, the number of new Bemis-Murcko scaffolds is rising almost as a linear fraction of the elaborated molecules. Thus, an 88-fold increase in the number of molecules in the make-on-demand versus the in-stock sets is built upon a 16-fold increase in the number of Bemis-Murcko scaffolds. The make-on-demand library is also more structurally diverse than physical libraries, with a massive increase in disc- and sphere-like shaped molecules. The new system is freely available at zinc20.docking.org.",
                "authors": [
                    {
                        "name": "Irwin J.J."
                    },
                    {
                        "name": "Tang K.G."
                    },
                    {
                        "name": "Young J."
                    },
                    {
                        "name": "Dandarchuluun C."
                    },
                    {
                        "name": "Wong B.R."
                    },
                    {
                        "name": "Khurelbaatar M."
                    },
                    {
                        "name": "Moroz Y.S."
                    },
                    {
                        "name": "Mayfield J."
                    },
                    {
                        "name": "Sayle R.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-28T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "ZINC20 - A Free Ultralarge-Scale Chemical Database for Ligand Discovery"
            },
            "pmid": "33118813"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ]
}