{
    "additionDate": "2021-03-19T08:49:20Z",
    "biotoolsCURIE": "biotools:pksensi",
    "biotoolsID": "pksensi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wchiu@cvm.tamu.edu",
            "name": "Weihsueh A. Chiu",
            "typeEntity": "Person"
        }
    ],
    "description": "pksensi is an R package that implements the global sensitivity analysis workflow to investigate the parameter uncertainty and sensitivity in physiologically based kinetic (PK) models, especially the physiologically based pharmacokinetic toxicokinetic model with multivariate outputs. An R package to apply global sensitivity analysis in physiologically based kinetic modeling.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/pksensi/pksensi.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://nanhung.rbind.io/pksensi/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-21T10:52:18Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/pksensi/index.html"
        }
    ],
    "name": "pksensi",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.SOFTX.2020.100609",
            "metadata": {
                "abstract": "© 2020 The AuthorsSensitivity analysis (SA) is an essential tool for modelers to understand the influence of model parameters on model outputs. It is also increasingly used in developing and assessing physiologically based kinetic (PBK) models. For instance, several studies have applied global SA to reduce the computational burden in the Bayesian Markov chain Monte Carlo-based calibration process PBK models. Although several SA algorithms and software packages are available, no comprehensive software package exists that allows users to seamlessly solve differential equations in a PBK model, conduct and visualize SA results, and discriminate between the non-influential model parameters that can be fixed and those that need calibration. Therefore, we developed an R package, named pksensi, to make global SA more accessible in PBK modeling. This package can investigate both uncertainty and sensitivity in PBK models, including those with multivariate model outputs. It also includes functions to check the convergence of the global SA results. Overall, pksensi improves the user experience of performing global SA and can create robust and reproducible results for decision making in PBK model calibration.",
                "authors": [
                    {
                        "name": "Hsieh N.-H."
                    },
                    {
                        "name": "Reisfeld B."
                    },
                    {
                        "name": "Chiu W.A."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "SoftwareX",
                "title": "pksensi: An R package to apply global sensitivity analysis in physiologically based kinetic modeling"
            },
            "pmcid": "PMC7790364",
            "pmid": "33426260"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}