{
    "additionDate": "2020-01-14T19:59:30Z",
    "biotoolsCURIE": "biotools:benmap",
    "biotoolsID": "benmap",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "baker.kirk@epa.gov",
            "name": "Kirk R. Baker",
            "typeEntity": "Person"
        },
        {
            "name": "Christine Davis",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "BenMAP is an open-source computer program that calculates the number and economic value of air pollution-related deaths and illnesses. The software incorporates a database that includes many of the concentration-response relationships, population files, and health and economic data needed to quantify these impacts.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.epa.gov/benmap/benmap-downloads"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.epa.gov/benmap",
    "lastUpdate": "2021-01-07T19:25:56Z",
    "name": "BenMAP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.DIB.2019.104886",
            "metadata": {
                "abstract": "© 2019Policy analysts and researchers often use models to translate expected emissions changes from pollution control policies to estimates of air pollution changes and resulting changes in health impacts. These models can include both photochemical Eulerian grid models or reduced complexity models; these latter models make simplifying assumptions about the emissions-to-air quality relationship as a means of reducing the computational time needed to simulate air quality. This manuscript presents a new database of photochemical- and reduced complexity-modelled changes in annual average particulate matter with aerodynamic diameter less than 2.5 μm and associated health effects and economic values for five case studies representing different emissions control scenarios. The research community is developing an increasing number of reduced complexity models as lower-cost and more expeditious alternatives to full form Eulerian photochemical grid models such as the Comprehensive Air-Quality Model with eXtensions (CAMx) and the Community Multiscale Air Quality (CMAQ) model. A comprehensive evaluation of reduced complexity models can demonstrate the extent to which these tools capture complex chemical and physical processes when representing emission control options. Systematically comparing reduced complexity model predictions to benchmarks from photochemical grid models requires a consistent set of input parameters across all systems. Developing such inputs is resource intensive and consequently the data that we have developed and shared (https://github.com/epa-kpc/RFMEVAL) provide a valuable resource for others to evaluate reduced complexity models. The dataset includes inputs and outputs representing 5 emission control scenarios, including sector-based regulatory policy scenarios focused on on-road mobile sources and electrical generating units (EGUs) as well as hypothetical across-the-board reductions to emissions from cement kilns, refineries, and pulp and paper facilities. Model inputs, outputs, and run control files are provided for the Air Pollution Emission Experiments and Policy Analysis (APEEP) version 2 and 3, Intervention Model for Air Pollution (InMAP), Estimating Air pollution Social Impact Using Regression (EASIUR), and EPA's source apportionment benefit-per-ton reduced complexity models. For comparison, photochemical grid model annual average PM2.5 output is provided for each emission scenario. Further, inputs are also provided for the Environmental Benefits and Mapping Community Edition (BenMAP-CE) tool to generate county level health benefits and monetized health damages along with output files for benchmarking and intercomparison. Monetized health impacts are also provided from EASIUR and APEEP which can provide these outside the BenMAP-CE framework. The database will allow researchers to more easily compare reduced complexity model predictions against photochemical grid model predictions.",
                "authors": [
                    {
                        "name": "Baker K.R."
                    },
                    {
                        "name": "Amend M."
                    },
                    {
                        "name": "Penn S."
                    },
                    {
                        "name": "Bankert J."
                    },
                    {
                        "name": "Simon H."
                    },
                    {
                        "name": "Chan E."
                    },
                    {
                        "name": "Fann N."
                    },
                    {
                        "name": "Zawacki M."
                    },
                    {
                        "name": "Davidson K."
                    },
                    {
                        "name": "Roman H."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Data in Brief",
                "title": "A database for evaluating the InMAP, APEEP, and EASIUR reduced complexity air-quality modeling tools"
            },
            "pmcid": "PMC6911961",
            "pmid": "31872009"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ],
    "validated": 1
}