{
    "additionDate": "2020-01-09T18:01:06Z",
    "biotoolsCURIE": "biotools:tangle",
    "biotoolsID": "tangle",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "samuele.fiorini@dibris.unige.it",
            "name": "Samuele Fiorini",
            "orcidid": "https://orcid.org/0000-0001-9162-5767",
            "typeEntity": "Person"
        }
    ],
    "description": "TANGLE is a timespan-guided neural attention mechanism that can be used to integrate sequences of Medicare services and the time span between them to provide interpretable patients representations, which can be further used for some target prediction task.\n\nPredictive capabilities of TANGLE are demonstrated here with an application on the 10% publicly available sample of deidentified, individual level, linked Medicare Benefits Schedule (MBS) and Pharmaceutical Benefits Scheme (PBS) electronic databases of Australia. Starting from sequences of MBS-items and timespans, TANGLE can predict which diabetic patient, currently on metformin only, is likely to be prescribed with a different type of diabetes controlling drug in the near future.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/samuelefiorini/tangle",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-02-25T09:18:51.693268Z",
    "name": "Tangle",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0211844",
            "metadata": {
                "abstract": "© 2019 Fiorini et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Introduction The first line of treatment for people with Diabetes mellitus is metformin. However, over the course of the disease metformin may fail to achieve appropriate glycemic control, and a second-line therapy may become necessary. In this paper we introduce Tangle, a time span-guided neural attention model that can accurately and timely predict the upcoming need for a second-line diabetes therapy from administrative data in the Australian adult population. The method is suitable for designing automatic therapy review recommendations for patients and their providers without the need to collect clinical measures. Data We analyzed seven years of de-identified records (2008-2014) of the 10% publicly available linked sample of Medicare Benefits Schedule (MBS) and Pharmaceutical Benefits Scheme (PBS) electronic databases of Australia. Methods By design, Tangle inherits the representational power of pre-trained word embedding, such as GloVe, to encode sequences of claims with the related MBS codes. Moreover, the proposed attention mechanism natively exploits the information hidden in the time span between two successive claims (measured in number of days). We compared the proposed method against state-of-the-art sequence classification methods. Results Tangle outperforms state-of-the-art recurrent neural networks, including attention-based models. In particular, when the proposed time span-guided attention strategy is coupled with pre-trained embedding methods, the model performance reaches an Area Under the ROC Curve of 90%, an improvement of almost 10 percentage points over an attentionless recurrent architecture. Implementation Tangle is implemented in Python using Keras and it is hosted on GitHub at https://github. com/samuelefiorini/tangle.",
                "authors": [
                    {
                        "name": "Barla A."
                    },
                    {
                        "name": "Fiorini S."
                    },
                    {
                        "name": "Girosi F."
                    },
                    {
                        "name": "Hajati F."
                    }
                ],
                "citationCount": 4,
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Predicting diabetes second-line therapy initiation in the Australian population via time span-guided neural attention network"
            },
            "pmcid": "PMC6799900",
            "pmid": "31626666"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
