{
    "additionDate": "2022-07-20T05:27:11.659762Z",
    "biotoolsCURIE": "biotools:covid-opt-ainet",
    "biotoolsID": "covid-opt-ainet",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "summrina@gmail.com",
            "name": "Summrina Kanwal",
            "typeEntity": "Person"
        }
    ],
    "description": "A clinical decision support system for COVID-19 detection.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/faizakhan1925/COVID-opt-aiNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-20T05:29:17.155562Z",
    "license": "Not licensed",
    "name": "COVID-opt-aiNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/IMA.22695",
            "metadata": {
                "abstract": "© 2022 Wiley Periodicals LLC.Coronavirus disease (COVID-19) has had a major and sometimes lethal effect on global public health. COVID-19 detection is a difficult task that necessitates the use of intelligent diagnosis algorithms. Numerous studies have suggested the use of artificial intelligence (AI) and machine learning (ML) techniques to detect COVID-19 infection in patients through chest X-ray image analysis. The use of medical imaging with different modalities for COVID-19 detection has become an important means of containing the spread of this disease. However, medical images are not sufficiently adequate for routine clinical use; there is, therefore, an increasing need for AI to be applied to improve the diagnostic performance of medical image analysis. Regrettably, due to the evolving nature of the COVID-19 global epidemic, the systematic collection of a large data set for deep neural network (DNN)/ML training is problematic. Inspired by these studies, and to aid in the medical diagnosis and control of this contagious disease, we suggest a novel approach that ensembles the feature selection capability of the optimized artificial immune networks (opt-aiNet) algorithm with deep learning (DL) and ML techniques for better prediction of the disease. In this article, we experimented with a DNN, a convolutional neural network (CNN), bidirectional long-short-term memory, a support vector machine (SVM), and logistic regression for the effective detection of COVID-19 in patients. We illustrate the effectiveness of this proposed technique by using COVID-19 image datasets with a variety of modalities. An empirical study using the COVID-19 image dataset demonstrates that the proposed hybrid approaches, named COVID-opt-aiNet, improve classification accuracy by up to 98%–99% for SVM, 96%–97% for DNN, and 70.85%–71% for CNN, to name a few examples. Furthermore, statistical analysis ensures the validity of our proposed algorithms. The source code can be downloaded from Github: https://github.com/faizakhan1925/COVID-opt-aiNet.",
                "authors": [
                    {
                        "name": "Alamri S."
                    },
                    {
                        "name": "Dashtipur K."
                    },
                    {
                        "name": "Gogate M."
                    },
                    {
                        "name": "Kanwal S."
                    },
                    {
                        "name": "Khan F."
                    }
                ],
                "citationCount": 1,
                "date": "2022-03-01T00:00:00Z",
                "journal": "International Journal of Imaging Systems and Technology",
                "title": "COVID-opt-aiNet: A clinical decision support system for COVID-19 detection"
            },
            "pmcid": "PMC9015255",
            "pmid": "35465215"
        }
    ],
    "toolType": [
        "Workbench",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
