{
    "additionDate": "2019-11-14T18:39:55Z",
    "biotoolsCURIE": "biotools:C3",
    "biotoolsID": "C3",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "56485747@qq.com",
            "name": "Xiang-Yun Ye",
            "typeEntity": "Person"
        },
        {
            "email": "qushencn@tongji.edu.cn",
            "name": "Shen Qu",
            "typeEntity": "Person"
        },
        {
            "email": "Jenny.Wei@astrazeneca.com",
            "name": "Jia Wei",
            "typeEntity": "Person"
        },
        {
            "email": "qiliu@tongji.edu.cn",
            "name": "Qi Liu",
            "typeEntity": "Person"
        }
    ],
    "description": "Consensus Cancer Driver Gene Caller | Next-generation sequencing has allowed identification of millions of somatic mutations in human cancer cells. A key challenge in interpreting cancer genomes is to distinguish drivers of cancer development among available genetic mutations. To address this issue, we present the first web-based application, consensus cancer driver gene caller (C3), to identify the consensus driver genes using six different complementary strategies, i.e., frequency-based, machine learning-based, functional bias-based, clustering-based, statistics model-based, and network-based strategies. This application allows users to specify customized operations when calling driver genes, and provides solid statistical evaluations and interpretable visualizations on the integration results",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://drivergene.rwebox.com/c3/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-09T16:30:00Z",
    "name": "Consensus Cancer driver gene Caller (C3)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.GPB.2018.10.004",
            "metadata": {
                "abstract": "© 2019 The AuthorsNext-generation sequencing has allowed identification of millions of somatic mutations in human cancer cells. A key challenge in interpreting cancer genomes is to distinguish drivers of cancer development among available genetic mutations. To address this issue, we present the first web-based application, consensus cancer driver gene caller (C3), to identify the consensus driver genes using six different complementary strategies, i.e., frequency-based, machine learning-based, functional bias-based, clustering-based, statistics model-based, and network-based strategies. This application allows users to specify customized operations when calling driver genes, and provides solid statistical evaluations and interpretable visualizations on the integration results. C3 is implemented in Python and is freely available for public use at http://drivergene.rwebox.com/c3.",
                "authors": [
                    {
                        "name": "Zhu C.-Y."
                    },
                    {
                        "name": "Zhou C."
                    },
                    {
                        "name": "Chen Y.-Q."
                    },
                    {
                        "name": "Shen A.-Z."
                    },
                    {
                        "name": "Guo Z.-M."
                    },
                    {
                        "name": "Yang Z.-Y."
                    },
                    {
                        "name": "Ye X.-Y."
                    },
                    {
                        "name": "Qu S."
                    },
                    {
                        "name": "Wei J."
                    },
                    {
                        "name": "Liu Q."
                    }
                ],
                "citationCount": 1,
                "date": "2019-06-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "C3: Consensus Cancer Driver Gene Caller"
            },
            "pmcid": "PMC6818389",
            "pmid": "31465854"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}