
{
    "credit": [
        {
            "email": "CB-Admin@dundee.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.compbio.dundee.ac.uk/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.compbio.dundee.ac.uk/downloads/stamp/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/stamp-4-4-structural-alignment-multiple-proteins.html"
        }
    ],
    "publication": [
        {
            "abstract": "An algorithm is presented for the accurate and rapid generation of multiple protein sequence alignments from tertiary structure comparisons. A preliminary multiple sequence alignment is performed using sequence information, which then determines an initial superposition of the structures. A structure comparison algorithm is applied to all pairs of proteins in the superimposed set and a similarity tree calculated. Multiple sequence alignments are then generated by following the tree from the branches to the root. At each branchpoint of the tree, a structure‐based sequence alignment and coordinate transformations are output, with the multiple alignment of all structures output at the root The algorithm encoded in STAMP (Structural Alignment of Multiple Proteins) is shown to give alignments in good agreement with published structural accounts within the dehydrogenase fold domains, globins, and serine proteinases. In order to reduce the need for visual verification, two similarity indices are introduced to determine the quality of each generated structural alignment. Sc quantifies the global structural similarity between pairs or groups of proteins, whereas Pij′ provides a normalized measure of the confidence in the alignment of each residue. STAMP alignments have the quality of each alignment characterized by Sc and Pij′ values and thus provide a reproducible resource for studies of residue conservation within structural motifs. © 1992 Wiley‐Liss, Inc. Copyright © 1992 Wiley‐Liss, Inc.",
            "authors": [
                "Russell R.B.",
                "Barton G.J."
            ],
            "cit_count": 522,
            "journal": "Proteins: Structure, Function, and Bioinformatics",
            "pmid": "1409577",
            "title": "Multiple protein sequence alignment from tertiary structure comparison: Assignment of global and residue confidence levels",
            "year": "1992-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:stamp-3d",
        "biotoolsID": "stamp-3d",
        "description": "A package for the alignment of protein sequences based on three-dimensional (3D) structure. It provides not only multiple alignments and the corresponding `best-fit’ superimpositions, but also a systematic and reproducible method for assessing the quality of such alignments.",
        "homepage": "http://www.compbio.dundee.ac.uk/software.html#3Dstructure",
        "name": "STAMP"
    }
}