{"credit":[],"function":[{"operation":[{"term":"RNA binding site prediction","uri":"http://edamontology.org/operation_3902"}]}],"labels":{"topic":[{"term":"Machine learning","uri":"http://edamontology.org/topic_3474"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"}]},"publication":[{"abstract":"© 2019 Elsevier Inc.RNA binding proteins (RBPs) determine RNA process from synthesis to decay, which play a key role in RNA transport, translation and degradation. Therefore, exploring RBPs’ function from the amino acid sequence using computational methods has become one of the momentous topics in genome annotation. However, there still have some challenges: (1) shallow feature: Although the sequence determines structure is self-evident, it is difficult to analyze the essential features from simple sequence. (2) Poorly understand: feature-based prediction methods mainly emphasize feature extraction, while in-depth understanding of protein mysteries limits the application of feature engineering. (3) Feature fusion: multi-feature fusion is often used, but the features are not well integrated. In view of these challenges, we propose a novel ensemble convolutional neural network (econvRBP) to predict RBPs. In order to capture the local and global features of RNA binding proteins simultaneously, first of all, One Hot and Conjoint Triad encoding methods are used to transform amino acid sequence into local and global features, respectively. After that the local and global features are combined for further high-level feature extraction using convolutional neural networks. Some experiments are constructed to evaluate our method with 10-fold cross validation and the results show that it has achieved the best performance among all the predictors so far. We correctly predicted 99% of 2875 RBPs and 99% of 6782 non-RBPs with accuracy of 0.99. In addition, the datasets provided by RBPPred are also used to validate our models with an accuracy of 0.87. These results indicate that the econvRBP is the most excellent method at present, and will provide reliable guidance for the detection of RBPs. econvRBP is available at http://47.100.203.218:3389/home.html/.","authors":["Zhao Y.","Du X."],"cit_count":0,"doi":"10.1016/J.YMETH.2019.09.008","journal":"Methods","pmid":"31513916","title":"econvRBP: Improved ensemble convolutional neural networks for RNA binding protein prediction directly from sequence","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:econvRBP","biotoolsID":"econvRBP","description":"> HOMEPAGE MISSING! | Improved ensemble convolutional neural networks for RNA binding protein prediction directly from sequence | RNA binding proteins (RBPs) determine RNA process from synthesis to decay, which play a key role in RNA transport, translation and degradation. Therefore, exploring RBPs' function from the amino acid sequence using computational methods has become one of the momentous topics in genome annotation. However, there still have some challenges: (1) shallow feature: Although the sequence determines structure is self-evident, it is difficult to analyze the essential features from simple sequence. (2) Poorly understand: feature-based prediction methods mainly emphasize feature extraction, while in-depth understanding of protein mysteries limits the application of feature engineering. (3) Feature fusion: multi-feature fusion is often used, but the features are not well integrated","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31513916","name":"econvRBP"}}