{
    "additionDate": "2018-04-22T10:24:59Z",
    "biotoolsCURIE": "biotools:skylign",
    "biotoolsID": "skylign",
    "credit": [
        {
            "email": "skylign-help@ebi.ac.uk",
            "name": "Skylign Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Create informative, interactive logos representing sequence alignments and profile hidden Markov models.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "http://skylign.org/help#api_docs"
        },
        {
            "type": [
                "General"
            ],
            "url": "http://skylign.org/help"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://skylign.org/logo/example"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "http://skylign.org/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-11T19:06:31Z",
    "name": "Skylign",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-7",
            "metadata": {
                "abstract": "Background: Logos are commonly used in molecular biology to provide a compact graphical representation of the conservation pattern of a set of sequences. They render the information contained in sequence alignments or profile hidden Markov models by drawing a stack of letters for each position, where the height of the stack corresponds to the conservation at that position, and the height of each letter within a stack depends on the frequency of that letter at that position.Results: We present a new tool and web server, called Skylign, which provides a unified framework for creating logos for both sequence alignments and profile hidden Markov models. In addition to static image files, Skylign creates a novel interactive logo plot for inclusion in web pages. These interactive logos enable scrolling, zooming, and inspection of underlying values. Skylign can avoid sampling bias in sequence alignments by down-weighting redundant sequences and by combining observed counts with informed priors. It also simplifies the representation of gap parameters, and can optionally scale letter heights based on alternate calculations of the conservation of a position.Conclusion: Skylign is available as a website, a scriptable web service with a RESTful interface, and as a software package for download. Skylign's interactive logos are easily incorporated into a web page with just a few lines of HTML markup. Skylign may be found at http://skylign.org. © 2014 Wheeler et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Clements J."
                    },
                    {
                        "name": "Finn R.D."
                    },
                    {
                        "name": "Wheeler T.J."
                    }
                ],
                "citationCount": 155,
                "date": "2014-01-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Skylign: A tool for creating informative, interactive logos representing sequence alignments and profile hidden Markov models"
            },
            "pmcid": "PMC3893531",
            "pmid": "24410852",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
