{
    "accessibility": "Open access",
    "additionDate": "2022-06-28T18:11:51.501104Z",
    "biotoolsCURIE": "biotools:metro",
    "biotoolsID": "metro",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xzhousph@umich.edu",
            "name": "Xiang Zhou",
            "typeEntity": "Person"
        }
    ],
    "description": "METRO is a new computational method that leverages expression data collected from multiple genetic ancestries to enhance Transcriptome-wide association studies (TWAS).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhengli09/METRO",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2022-06-28T18:11:51.503699Z",
    "license": "Not licensed",
    "name": "METRO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.AJHG.2022.03.003",
            "metadata": {
                "abstract": "© 2022 American Society of Human GeneticsIntegrative analysis of genome-wide association studies (GWASs) and gene expression studies in the form of a transcriptome-wide association study (TWAS) has the potential to better elucidate the molecular mechanisms underlying disease etiology. Here we present a method, METRO, that can leverage gene expression data collected from multiple genetic ancestries to enhance TWASs. METRO incorporates expression prediction models constructed in different genetic ancestries through a likelihood-based inference framework, producing calibrated p values with substantially improved TWAS power. We illustrate the benefits of METRO in both simulations and applications to seven complex traits and diseases obtained from four GWASs. These GWASs include two of primarily European ancestry (n = 188,577 and 339,226) and two of primarily African ancestry (n = 42,752 and 23,827). In the real data applications, we leverage gene expression data measured on 1,032 African Americans and 801 European Americans from the Genetic Epidemiology Network of Arteriopathy (GENOA) study to identify a substantially larger number of gene-trait associations as compared to existing TWAS approaches. The benefits of METRO are most prominent in applications to GWASs of African ancestry where the sample size is much smaller than GWASs of European ancestry and where a more powerful TWAS method is crucial. Among the identified associations are high-density lipoprotein-associated genes including PLTP and PPARG that are critical for maintaining lipid homeostasis and the type II diabetes-associated gene MAPT that supports microtubule-associated protein tau as a key component underlying impaired insulin secretion.",
                "authors": [
                    {
                        "name": "Kardia S.L.R."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Mosley T.H."
                    },
                    {
                        "name": "Shang L."
                    },
                    {
                        "name": "Smith J.A."
                    },
                    {
                        "name": "Zhao W."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2022-05-05T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "METRO: Multi-ancestry transcriptome-wide association studies for powerful gene-trait association detection"
            },
            "pmcid": "PMC9118130",
            "pmid": "35334221"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
