
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.kanehisa.jp/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.kegg.jp/kegg/document/help_kegg_search.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "maturity": "Emerging",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Databases",
                "uri": "http://edamontology.org/topic_3489"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/kegdraw-0-1-11-beta-draw-compound-glycan-structures.html"
        }
    ],
    "publication": [
        {
            "abstract": "Bioinformatics approaches to carbohydrate research have recently begun using large amounts of protein and carbohydrate data. In this field called glycome informatics, the foremost necessity is a comprehensive resource for genome-scale bioinformatics analysis of glycan data. Although the accumulation of experimental data may be useful as a reference of biological and biochemical information on carbohydrates, this is insufficient for bioinformatics analysis. Thus, we have developed a glycome informatics resource (http://www.genome.jp/kegg/ glycan/) in KEGG (Kyoto Encyclopedia of Genes and Genomes), an integrated knowledge base of protein networks, genomic information, and chemical information. This review describes three noteworthy features: (1) GLYCAN, a database of carbohydrate structures; (2) glycan-related pathways; and (3) Composite Structure Map (CSM), a map illustrating all possible variations of carbohydrate structures within organisms. GLYCAN includes two useful tools: an intuitive drawing tool called KegDraw, and an efficient glycan search and alignment tool called KEGG Carbohydrate Matcher (KCaM). KEGG's glycan biosynthesis and metabolism pathways, integrating carbohydrate structures, proteins, and reactions, are also a pivotal resource. CSM is constructed as a bridge between carbohydrate functions and structures. CSM is able to display, for example, expression data of glycosyltransferases in a compact manner. In all the KEGG resources, various objects including KEGG pathways, chemical compounds, as well as carbohydrate structures are commonly represented as graphs, which are widely studied and utilized in the computer science field. © 2006 Oxford University Press.",
            "authors": [
                "Hashimoto K.",
                "Goto S.",
                "Kawano S.",
                "Aoki-Kinoshita K.F.",
                "Ueda N.",
                "Hamajima M.",
                "Kawasaki T.",
                "Kanehisa M."
            ],
            "cit_count": 205,
            "doi": "10.1093/glycob/cwj010",
            "journal": "Glycobiology",
            "title": "KEGG as a glycome informatics resource",
            "type": "Primary",
            "year": "2006-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:kegdraw",
        "biotoolsID": "kegdraw",
        "description": "KegDraw is a java application for drawing compound and glycan structures with capabilities to search against the KEGG databases.",
        "homepage": "http://www.kegg.jp/kegg/download/kegtools.html",
        "name": "KegDraw 0.1.14 beta"
    }
}