{
    "additionDate": "2018-07-12T11:40:08Z",
    "biotoolsCURIE": "biotools:noreva",
    "biotoolsID": "noreva",
    "credit": [
        {
            "email": "libcell@cqu.edu.cn",
            "name": "Dr. Bo Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "NORmalization and EVAluation of MS-based metabolomics data. Enables performance evaluation of various normalization methods from multiple perspectives. In particular, it integrates 5 well-established criteria, each with a distinct underlying theory, to ensure a more comprehensive evaluation than any single criterion. Moreover, it provides various available and popular normalization methods, with a unique feature of allowing quality control based correction sequentially followed by data normalization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://server.idrb.cqu.edu.cn/noreva/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-11T17:10:34Z",
    "name": "NOREVA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gkx449",
            "metadata": {
                "abstract": "© 2017 The Author(s).Diverse forms of unwanted signal variations in mass spectrometry-based metabolomics data adversely affect the accuracies of metabolic profiling. A variety of normalization methods have been developed for addressing this problem. However, their performances vary greatly and depend heavily on the nature of the studied data. Moreover, given the complexity of the actual data, it is not feasible to assess the performance of methods by single criterion. We therefore developed NOREVA to enable performance evaluation of various normalization methods from multiple perspectives. NOREVA integrated five wellestablished criteria (each with a distinct underlying theory) to ensure more comprehensive evaluation than any single criterion. It provided the most complete set of the available normalization methods, with unique features of removing overall unwanted variations based on quality control metabolites and allowing quality control samples based correction sequentially followed by data normalization. The originality of NOREVA and the reliability of its algorithms were extensively validated by case studies on five benchmark datasets. In sum, NOREVA is distinguished for its capability of identifying the well performed normalization method by taking multiple criteria into consideration and can be an indispensable complement to other available tools.",
                "authors": [
                    {
                        "name": "Li B."
                    },
                    {
                        "name": "Tang J."
                    },
                    {
                        "name": "Yang Q."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Cui X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Xue W."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Zhu F."
                    }
                ],
                "citationCount": 129,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NOREVA: Normalization and evaluation of MS-based metabolomics data"
            },
            "pmcid": "PMC5570188",
            "pmid": "28525573"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1
}