{"credit":[{"email":"sekmi@chem.uw.edu.pl","name":"Sebastian Kmiecik","typeEntity":"Person","typeRoles":[]}],"function":[{"operation":[{"term":"Binding site prediction","uri":"http://edamontology.org/operation_2575"},{"term":"Protein-ligand docking","uri":"http://edamontology.org/operation_0482"},{"term":"Side chain modelling","uri":"http://edamontology.org/operation_0480"},{"term":"Peptide identification","uri":"http://edamontology.org/operation_3631"},{"term":"Protein-protein docking","uri":"http://edamontology.org/operation_3899"}]}],"labels":{"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Protein interaction experiment","uri":"http://edamontology.org/topic_3557"},{"term":"Proteomics","uri":"http://edamontology.org/topic_0121"},{"term":"Drug discovery","uri":"http://edamontology.org/topic_3336"}]},"link":[{"type":"REPOSITORY","url":"http://bitbucket.org/lcbio/cabsdock"}],"publication":[{"abstract":"© 2019 John Wiley & Sons LtdObjective: Plasmodium knowlesi, the fifth human malaria parasite, has caused mortality in humans. We aimed to identify P. knowlesi novel binding peptides through a random linear dodecapeptide phage display targeting the 19-kDa fragment of Merozoite Surface Protein-1 protein. Methods: rPkMSP-119 protein was heterologously expressed using Expresso® Solubility and Expression Screening System and competent E. cloni® 10G cells according to protocol. Three rounds of biopanning were performed on purified rPkMSP-119 to identify binding peptides towards rPkMSP-119 using Ph.D.™-12 random phage display library. Binding sites of the identified peptides to PkMSP-119 were in silico predicted using the CABS-dock web server. Results: Four phage peptide variants that bound to PkMSP-119 were identified after three rounds of biopanning, namely Pkd1, Pkd2, Pkd3 and Pkd4. The sequences of both Pkd1 and Pkd2 consist of a large number of histidine residues. Pkd1 showed positive binding signal with 6.1× vs. BSA control. Docking results showed that Pkd1 and Pkd2 were ideal binding peptides for PkMSP-119. Conclusion: We identified two novel binding peptides of PkMSP-119, Pkd1 (HFPFHHHKLRAH) and Pkd2 (HPMHMLHKRQHG), through phage display. They provide a valuable starting point for the development of novel therapeutics.","authors":["Goh X.T.","Chua K.H.","Kee B.P.","Lim Y.A.L."],"cit_count":0,"doi":"10.1111/TMI.13348","journal":"Tropical Medicine and International Health","pmid":"31733137","title":"Identification of Plasmodium knowlesi Merozoite Surface Protein-119 (PkMSP-119) novel binding peptides from a phage display library","year":"2019-01-01"},{"doi":"10.1002/PRO.3771","pmcid":"PMC6933849","pmid":"31682301"}],"summary":{"biotoolsCURIE":"biotools:CABS-dock","biotoolsID":"CABS-dock","description":"Identification of Plasmodium knowlesi Merozoite Surface Protein-119 (PkMSP-119 ) novel binding peptides from a phage display library.\n\nFlexible docking of peptides to proteins using CABS-dock.\n\nserver for protein-peptide docking.\n\nCABS-dock treats peptide backbone as fully flexible, while the flexibility of receptor proteins is limited to near-native backbone fluctuations.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'PkMSP-119 Pkd1 HFPFHHHKLRAH Pkd2', 'PkMSP-119 Pkd1 HFPFHHHKLRAH Pkd2 HPMHMLHKRQHG', 'peptides PkMSP-119 Pkd1 HFPFHHHKLRAH Pkd2', 'PkMSP-119 Pkd1 HFPFHHHKLRAH'","homepage":"http://biocomp.chem.uw.edu.pl/CABSdock","name":"CABS-dock"}}