{
    "additionDate": "2018-08-23T08:17:10Z",
    "biotoolsCURIE": "biotools:seek",
    "biotoolsID": "seek",
    "collectionID": [
        "de.NBI"
    ],
    "credit": [
        {
            "name": "Contact list",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.seek4science.org/contact.html"
        }
    ],
    "description": "Web-based cataloguing and commons platform, for sharing heterogeneous scientific research datasets, models or simulations, processes and research outcomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.seek4science.org/about.html"
        }
    ],
    "editPermission": {
        "authors": [
            "ulrike.wittig@h-its.org"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Germany",
        "UK"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://www.seek4science.org/",
    "language": [
        "Ruby",
        "Java"
    ],
    "lastUpdate": "2021-05-15T13:26:09.034359Z",
    "license": "BSD-2-Clause",
    "name": "SEEK",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_002651"
        }
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12918-015-0174-y",
            "metadata": {
                "abstract": "© 2015 Wolstencroft et al.Background: Systems biology research typically involves the integration and analysis of heterogeneous data types in order to model and predict biological processes. Researchers therefore require tools and resources to facilitate the sharing and integration of data, and for linking of data to systems biology models. There are a large number of public repositories for storing biological data of a particular type, for example transcriptomics or proteomics, and there are several model repositories. However, this silo-type storage of data and models is not conducive to systems biology investigations. Interdependencies between multiple omics datasets and between datasets and models are essential. Researchers require an environment that will allow the management and sharing of heterogeneous data and models in the context of the experiments which created them. Results: The SEEK is a suite of tools to support the management, sharing and exploration of data and models in systems biology. The SEEK platform provides an access-controlled, web-based environment for scientists to share and exchange data and models for day-to-day collaboration and for public dissemination. A plug-in architecture allows the linking of experiments, their protocols, data, models and results in a configurable system that is available 'off the shelf'. Tools to run model simulations, plot experimental data and assist with data annotation and standardisation combine to produce a collection of resources that support analysis as well as sharing. Underlying semantic web resources additionally extract and serve SEEK metadata in RDF (Resource Description Format). SEEK RDF enables rich semantic queries, both within SEEK and between related resources in the web of Linked Open Data. Conclusion: The SEEK platform has been adopted by many systems biology consortia across Europe. It is a data management environment that has a low barrier of uptake and provides rich resources for collaboration. This paper provides an update on the functions and features of the SEEK software, and describes the use of the SEEK in the SysMO consortium (Systems biology for Micro-organisms), and the VLN (virtual Liver Network), two large systems biology initiatives with different research aims and different scientific communities.",
                "authors": [
                    {
                        "name": "Wolstencroft K."
                    },
                    {
                        "name": "Owen S."
                    },
                    {
                        "name": "Krebs O."
                    },
                    {
                        "name": "Nguyen Q."
                    },
                    {
                        "name": "Stanford N.J."
                    },
                    {
                        "name": "Golebiewski M."
                    },
                    {
                        "name": "Weidemann A."
                    },
                    {
                        "name": "Bittkowski M."
                    },
                    {
                        "name": "An L."
                    },
                    {
                        "name": "Shockley D."
                    },
                    {
                        "name": "Snoep J.L."
                    },
                    {
                        "name": "Mueller W."
                    },
                    {
                        "name": "Goble C."
                    }
                ],
                "citationCount": 41,
                "date": "2015-07-11T00:00:00Z",
                "journal": "BMC Systems Biology",
                "title": "SEEK: A systems biology data and model management platform"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}