
{
    "credit": [
    ],
    "labels": {
        "topic": [
            {
                "term": "Surgery",
                "uri": "http://edamontology.org/topic_3421"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            },
            {
                "term": "Dermatology",
                "uri": "http://edamontology.org/topic_3404"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 S. Karger AG, Basel.Introduction: Lentigo maligna (LM) is a subtype of melanoma in situ that usually occurs in sun-damaged skin and is characterised by an atypical proliferation of melanocytes within the basal epidermis. If left untreated, LM can develop into invasive melanoma, termed lentigo maligna melanoma, which shares the same prognosis as other types of invasive melanoma. The incidence rates of LM are steadily increasing worldwide, in parallel with increases in the incidence rates of invasive melanoma, and establishing appropriate guidelines for the management of LM is therefore of great importance. Methods: A multidisciplinary working party established by Cancer Council Australia has recently produced up-to-date, evidence-based clinical practice guidelines for the management of melanoma and LM. Following selection of the most relevant clinical questions, a comprehensive literature search for relevant studies was conducted, followed by systematic review of these studies. Data were summarised and the evidence was assessed, leading to the development of recommendations. After public consultation and approval by the full guidelines working party, these recommendations were published on the Cancer Council Australia wiki platform (https://wiki.cancer.org.au/australia/Clinical-question:Effective-interventions-to-improve-outcomes-in-lentigo-maligna%3F). Main Recommendations: Surgical removal of LM remains the standard treatment, with 5- to 10-mm clinical margins when possible. While yet to be fully validated, the use of peri-operative reflectance confocal microscopy to assess margins should be considered where available. There is a lack of high-quality evidence to infer the most effective non-surgical treatment. When surgical removal of LM is not possible or refused, radiotherapy is recommended. When both surgery and radiotherapy are not appropriate or refused, topical imiquimod is the recommended treatment. Cryotherapy and laser therapy are not recommended for the treatment of LM.",
            "authors": [
                "Robinson M.",
                "Primiero C.",
                "Guitera P.",
                "Hong A.",
                "Scolyer R.A.",
                "Stretch J.R.",
                "Strutton G.",
                "Thompson J.F.",
                "Peter Soyer H."
            ],
            "cit_count": 0,
            "doi": "10.1159/000502470",
            "journal": "Dermatology",
            "pmid": "31639788",
            "title": "Evidence-Based Clinical Practice Guidelines for the Management of Patients with Lentigo Maligna",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lentigo_maligna",
        "biotoolsID": "lentigo_maligna",
        "description": "Evidence-Based Clinical Practice Guidelines for the Management of Patients with Lentigo Maligna.\n\nWhat are the most effective treatment/management interventions to improve outcomes in patients with lentigo maligna?.\n\nComplete surgical removal of lentigo maligna lesion with 5-10mm margins is the preferred management, when possible.\n\nSoyer, P, Meghna Kakani, Associate Professor Pascale Guitera FACD PhD, Clinical Professor Angela Hong, Scolyer, R, Stretch, J, Strutton, G, Cancer Council Australia Melanoma Guidelines Working Party.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'maligna', 'lentigo', 'Clinical question:Effective interventions improve outcomes lentigo maligna3F', 'lentigo maligna melanoma'",
        "homepage": "https://wiki.cancer.org.au/australia/Clinical_question:Effective_interventions_to_improve_outcomes_in_lentigo_maligna%3F",
        "name": "lentigo maligna"
    }
}