{
    "additionDate": "2019-11-14T18:26:43Z",
    "biotoolsCURIE": "biotools:MTMR-Net",
    "biotoolsID": "MTMR-Net",
    "confidence_flag": "tool",
    "description": "Multi-Task Deep Model with Margin Ranking Loss for Lung Nodule Analysis | Code for 《Multi-Task Deep Learning with Margin Ranking Loss for Lung Nodule Analysis》 | This is the pytorch implementation for 《MTMR-Net: Multi-Task Deep Learning with Margin Ranking Loss for Lung Nodule Analysis》 | Code for 《Multi-Task Deep Learning with Margin Ranking Loss for Lung Nodule Analysis》 Project",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CaptainWilliam/MTMR-NET",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T10:43:46Z",
    "name": "MTMR-Net",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TMI.2019.2934577",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.Lung cancer is the leading cause of cancer deaths worldwide and early diagnosis of lung nodule is of great importance for therapeutic treatment and saving lives. Automated lung nodule analysis requires both accurate lung nodule benign-malignant classification and attribute score regression. However, this is quite challenging due to the considerable difficulty of lung nodule heterogeneity modeling and the limited discrimination capability on ambiguous cases. To solve these challenges, we propose a Multi-Task deep model with Margin Ranking loss (referred as MTMR-Net) for automated lung nodule analysis. Compared to existing methods which consider these two tasks separately, the relatedness between lung nodule classification and attribute score regression is explicitly explored in a cause-and-effect manner within our multi-task deep model, which can contribute to the performance gains of both tasks. The results of different tasks can be yielded simultaneously for assisting the radiologists in diagnosis interpretation. Furthermore, a Siamese network with a margin ranking loss is elaborately designed to enhance the discrimination capability on ambiguous nodule cases. To further explore the internal relationship between two tasks and validate the effectiveness of the proposed model, we use the recursive feature elimination method to iteratively rank the most malignancy-related features. We validate the efficacy of our method MTMR-Net on the public benchmark LIDC-IDRI dataset. Extensive experiments show that the diagnosis results with internal relationship explicitly explored in our model has met some similar patterns in clinical usage and also demonstrate that our approach can achieve competitive classification performance and more accurate scoring on attributes over the state-of-the-arts. Codes are publicly available at: https://github.com/CaptainWilliam/MTMR-NET.",
                "authors": [
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Dou Q."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Qin J."
                    },
                    {
                        "name": "Heng P.-A."
                    }
                ],
                "citationCount": 17,
                "date": "2020-03-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Multi-Task Deep Model with Margin Ranking Loss for Lung Nodule Analysis"
            },
            "pmid": "31403410"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "validated": 1
}