{
    "additionDate": "2019-11-14T18:12:10Z",
    "biotoolsCURIE": "biotools:FINET",
    "biotoolsID": "FINET",
    "confidence_flag": "tool",
    "description": "FINET is a software to infer any network. Implemented by Julia with algorithms of stability selection and elastic-net, plus parameter optimization, finet can infer a network fast and accurately from a big data. Additionally, finet is user-friendly, only one single command line to complete all computational processes. Developed under Linux, but finet should work in any OS system. Installing and using finet becomes simple by using following instructions",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                }
            ]
        }
    ],
    "homepage": "https://github.com/anyouwang/finet",
    "language": [
        "Julia"
    ],
    "lastUpdate": "2020-12-28T20:17:37Z",
    "name": "FINET",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/733683"
        },
        {
            "doi": "10.1186/s13104-020-05371-0",
            "metadata": {
                "abstract": "© 2020, The Author(s).Objectives: Numerous software has been developed to infer the gene regulatory network, a long-standing key topic in biology and computational biology. Yet the slowness and inaccuracy inherited in current software hamper their applications to the increasing massive data. Here, we develop a software, FINET (Fast Inferring NETwork), to infer a network with high accuracy and rapidity from big data. Results: The high accuracy results from integrating algorithms with stability-selection, elastic-net, and parameter optimization. Tested by a known biological network, FINET infers interactions with over 94% precision. The high speed comes from partnering parallel computations implemented with Julia, a new compiled language that runs much faster than existing languages used in the current software, such as R, Python, and MATLAB. Regardless of FINET’s implementations with Julia, users with no background in the language or computer science can easily operate it, with only a user-friendly single command line. In addition, FINET can infer other networks such as chemical networks and social networks. Overall, FINET provides a confident way to efficiently and accurately infer any type of network for any scale of data.",
                "authors": [
                    {
                        "name": "Wang A."
                    },
                    {
                        "name": "Hai R."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "FINET: Fast Inferring NETwork"
            },
            "pmcid": "PMC7653809",
            "pmid": "33172489"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 1
}