{
    "accessibility": "Open access",
    "additionDate": "2022-03-13T12:12:10.184916Z",
    "biotoolsCURIE": "biotools:sstdp",
    "biotoolsID": "sstdp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ljiang_cs@sjtu.edu.cn",
            "name": "Li Jiang",
            "typeEntity": "Person"
        },
        {
            "name": "Fangxin Liu"
        },
        {
            "name": "Tao Yang"
        },
        {
            "name": "Wenbo Zhao"
        },
        {
            "name": "Yongbiao Chen"
        },
        {
            "name": "Zongwu Wang"
        }
    ],
    "description": "Supervised Spike Timing Dependent Plasticity for Efficient Spiking Neural Network Training.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MXHX7199/SNN-SSTDP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-13T12:12:10.187574Z",
    "license": "Not licensed",
    "name": "SSTDP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FNINS.2021.756876",
            "metadata": {
                "abstract": "© Copyright © 2021 Liu, Zhao, Chen, Wang, Yang and Jiang.Spiking Neural Networks (SNNs) are a pathway that could potentially empower low-power event-driven neuromorphic hardware due to their spatio-temporal information processing capability and high biological plausibility. Although SNNs are currently more efficient than artificial neural networks (ANNs), they are not as accurate as ANNs. Error backpropagation is the most common method for directly training neural networks, promoting the prosperity of ANNs in various deep learning fields. However, since the signals transmitted in the SNN are non-differentiable discrete binary spike events, the activation function in the form of spikes presents difficulties for the gradient-based optimization algorithms to be directly applied in SNNs, leading to a performance gap (i.e., accuracy and latency) between SNNs and ANNs. This paper introduces a new learning algorithm, called SSTDP, which bridges the gap between backpropagation (BP)-based learning and spike-time-dependent plasticity (STDP)-based learning to train SNNs efficiently. The scheme incorporates the global optimization process from BP and the efficient weight update derived from STDP. It not only avoids the non-differentiable derivation in the BP process but also utilizes the local feature extraction property of STDP. Consequently, our method can lower the possibility of vanishing spikes in BP training and reduce the number of time steps to reduce network latency. In SSTDP, we employ temporal-based coding and use Integrate-and-Fire (IF) neuron as the neuron model to provide considerable computational benefits. Our experiments show the effectiveness of the proposed SSTDP learning algorithm on the SNN by achieving the best classification accuracy 99.3% on the Caltech 101 dataset, 98.1% on the MNIST dataset, and 91.3% on the CIFAR-10 dataset compared to other SNNs trained with other learning methods. It also surpasses the best inference accuracy of the directly trained SNN with 25~32× less inference latency. Moreover, we analyze event-based computations to demonstrate the efficacy of the SNN for inference operation in the spiking domain, and SSTDP methods can achieve 1.3~37.7× fewer addition operations per inference. The code is available at: https://github.com/MXHX7199/SNN-SSTDP.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Jiang L."
                    },
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Yang T."
                    },
                    {
                        "name": "Zhao W."
                    }
                ],
                "date": "2021-11-04T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "SSTDP: Supervised Spike Timing Dependent Plasticity for Efficient Spiking Neural Network Training"
            },
            "pmcid": "PMC8603828",
            "pmid": "34803591"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
