{
    "additionDate": "2021-01-20T10:52:35Z",
    "biotoolsCURIE": "biotools:seizr",
    "biotoolsID": "seizr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "diane-slusarski@uiowa.edu",
            "name": "Diane C. Slusarski",
            "typeEntity": "Person"
        }
    ],
    "description": "High-throughput behavioral assay to investigate seizure sensitivity in zebrafish implicates ZFHX3 in epilepsy.\n\nStudying Epilepsy In Zebrafish using R.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://tyson-fuller.shinyapps.io/SEIZR_Tracking_App/",
    "lastUpdate": "2021-05-20T06:01:28Z",
    "name": "SEIZR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1080/01677063.2018.1445247",
            "metadata": {
                "abstract": "© 2018 Informa UK Limited, trading as Taylor & Francis Group.Epilepsy, which affects ∼1% of the population, is caused by abnormal synchronous neural activity in the central nervous system (CNS). While there is a significant genetic contribution to epilepsy, the underlying causes for the majority of genetic cases remain unknown. The NIH Undiagnosed Diseases Project (UDP) utilized exome sequencing to identify genetic variants in patients affected by various conditions with undefined etiology, including epilepsy. Confirming the functional relevance of the candidate genes identified by exome sequencing in a timely manner is crucial to translating exome data into clinically useful information. To this end, we developed a high throughput version of a seizure-sensitivity assay in zebrafish (Danio rerio) to rapidly evaluate candidate genes found by exome sequencing. We developed open access software, Studying Epilepsy In Zebrafish using R (SEIZR), to efficiently analyze the data. SEIZR was validated by disrupting function of a known epilepsy gene, prickle 1. Next, using SEIZR, we analyzed a candidate gene from the UDP screen (Zinc Finger Homeobox 3, ZFHX3), and showed that reduced ZFHX3 function in zebrafish results in a significant hyperactive response to the convulsant drug pentylenetetrazol (PTZ). We find that ZFHX3 shows strong expression in the CNS during neurogenesis including in the pallium, thalamus, tegmentum, reticular formation, and medulla oblongata–all regions which have roles in motor control and coordination. Our findings in the zebrafish confirm human ZFHX3 is a strong candidate for further neurological studies. We offer SEIZR to other researchers as a tool to rapidly and efficiently analyze large behavioral data sets.",
                "authors": [
                    {
                        "name": "Fuller T.D."
                    },
                    {
                        "name": "Westfall T.A."
                    },
                    {
                        "name": "Das T."
                    },
                    {
                        "name": "Dawson D.V."
                    },
                    {
                        "name": "Slusarski D.C."
                    }
                ],
                "citationCount": 3,
                "date": "2018-04-03T00:00:00Z",
                "journal": "Journal of Neurogenetics",
                "title": "High-throughput behavioral assay to investigate seizure sensitivity in zebrafish implicates ZFHX3 in epilepsy"
            },
            "pmcid": "PMC6122958",
            "pmid": "29718741"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}