
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://metasystems.riken.jp/"
        }
    ],
    "documentation": [
        {
            "url": "http://metabin.riken.jp/tutorial"
        },
        {
            "type": "GENERAL",
            "url": "http://metabin.riken.jp/index"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/metabin-comprehensive-taxonomic-assignments-of-metagenomic-sequences.html"
        }
    ],
    "publication": [
        {
            "abstract": "Taxonomic assignment of sequence reads is a challenging task in metagenomic data analysis, for which the present methods mainly use either composition- or homology-based approaches. Though the homology-based methods are more sensitive and accurate, they suffer primarily due to the time needed to generate the Blast alignments. We developed the MetaBin program and web server for better homology-based taxonomic assignments using an ORF-based approach. By implementing Blat as the faster alignment method in place of Blastx, the analysis time has been reduced by severalfold. It is benchmarked using both simulated and real metagenomic datasets, and can be used for both single and paired-end sequence reads of varying lengths (≥45 bp). To our knowledge, MetaBin is the only available program that can be used for the taxonomic binning of short reads (<100 bp) with high accuracy and high sensitivity using a homology-based approach. The MetaBin web server can be used to carry out the taxonomic analysis, by either submitting reads or Blastx output. It provides several options including construction of taxonomic trees, creation of a composition chart, functional analysis using COGs, and comparative analysis of multiple metagenomic datasets. MetaBin web server and a standalone version for high-throughput analysis are available freely at http://metabin.riken.jp/. © 2012 Sharma et al.",
            "authors": [
                "Sharma V.K.",
                "Kumar N.",
                "Prakash T.",
                "Taylor T.D."
            ],
            "cit_count": 19,
            "journal": "PLoS ONE",
            "pmid": "22496776",
            "title": "Fast and accurate taxonomic assignments of metagenomic sequences using metabin",
            "year": "2012-04-04"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metabin",
        "biotoolsID": "metabin",
        "description": "Program for accurate, fast and highly sensitive taxonomic assignments of metagenomic sequences",
        "homepage": "http://metabin.riken.jp/application",
        "name": "MetaBin"
    }
}