{
    "additionDate": "2017-01-17T15:02:09Z",
    "biotoolsCURIE": "biotools:eegc",
    "biotoolsID": "eegc",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "zhouxiaoyuan@picb.ac.cn",
            "name": "Xiaoyuan Zhou",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package evaluates cellular engineering processes for direct differentiation of stem cells or conversion (transdifferentiation) of somatic cells to primary cells based on high throughput gene expression data screened either by DNA microarray or RNA sequencing. It performs DE analysis for each pair-wise sample comparison to identify and evaluate the transcriptional differences.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/eegc.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/eegc_1.0.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/eegc.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-2.0",
    "name": "eegc",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx205",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press. Motivation: Cells derived by cellular engineering, i.e. differentiation of induced pluripotent stem cells and direct lineage reprogramming, carry a tremendous potential for medical applications and in particular for regenerative therapies. These approaches consist in the definition of lineage-specific experimental protocols that, by manipulation of a limited number of biological cues-niche mimicking factors, (in)activation of transcription factors, to name a few-enforce the final expression of cell-specific (marker) molecules. To date, given the intricate complexity of biological pathways, these approaches still present imperfect reprogramming fidelity, with uncertain consequences on the functional properties of the resulting cells. Results: We propose a novel tool eegc to evaluate cellular engineering processes, in a systemic rather than marker-based fashion, by integrating transcriptome profiling and functional analysis. Our method clusters genes into categories representing different states of (trans)differentiation and further performs functional and gene regulatory network analyses for each of the categories of the engineered cells, thus offering practical indications on the potential lack of the reprogramming protocol. Availability and Implementation: eegc R package is released under the GNU General Public License within the Bioconductor project, freely available at https://bioconductor.org/packages/eegc/. Contact: christine.nardini.rsrc@gmail.com or hongkang.k.mei@gsk.com. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Meng G."
                    },
                    {
                        "name": "Nardini C."
                    },
                    {
                        "name": "Mei H."
                    }
                ],
                "citationCount": 1,
                "date": "2017-08-15T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Systemic evaluation of cellular reprogramming processes exploiting a novel R-tool: eegc"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.0"
    ]
}