{
    "additionDate": "2020-01-14T19:48:47Z",
    "biotoolsCURIE": "biotools:HTRgene",
    "biotoolsID": "HTRgene",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jungw@konkuk.ac.kr",
            "name": "Woosuk Jung",
            "typeEntity": "Person"
        },
        {
            "email": "sunkim.bioinfo@snu.ac.kr",
            "name": "Sun Kim",
            "typeEntity": "Person"
        }
    ],
    "description": "A computational method to perform the integrated analysis of multiple heterogeneous time-series data.\n\nThis program was designed for integrating analysis of multiple heterogeneous time-series gene expression data to identify response genes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                }
            ]
        }
    ],
    "homepage": "http://biohealth.snu.ac.kr/software/HTRgene",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-11T07:42:40Z",
    "name": "HTRgene",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3072-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Integrated analysis that uses multiple sample gene expression data measured under the same stress can detect stress response genes more accurately than analysis of individual sample data. However, the integrated analysis is challenging since experimental conditions (strength of stress and the number of time points) are heterogeneous across multiple samples. Results: HTRgene is a computational method to perform the integrated analysis of multiple heterogeneous time-series data measured under the same stress condition. The goal of HTRgene is to identify \"response order preserving DEGs\" that are defined as genes not only which are differentially expressed but also whose response order is preserved across multiple samples. The utility of HTRgene was demonstrated using 28 and 24 time-series sample gene expression data measured under cold and heat stress in Arabidopsis. HTRgene analysis successfully reproduced known biological mechanisms of cold and heat stress in Arabidopsis. Also, HTRgene showed higher accuracy in detecting the documented stress response genes than existing tools. Conclusions: HTRgene, a method to find the ordering of response time of genes that are commonly observed among multiple time-series samples, successfully integrated multiple heterogeneous time-series gene expression datasets. It can be applied to many research problems related to the integration of time series data analysis.",
                "authors": [
                    {
                        "name": "Ahn H."
                    },
                    {
                        "name": "Chae H."
                    },
                    {
                        "name": "Jung I."
                    },
                    {
                        "name": "Jung W."
                    },
                    {
                        "name": "Kang D."
                    },
                    {
                        "name": "Kim S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HTRgene: A computational method to perform the integrated analysis of multiple heterogeneous time-series data: Case analysis of cold and heat stress response signaling genes in Arabidopsis"
            },
            "pmcid": "PMC6886170",
            "pmid": "31787073"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
