{
    "additionDate": "2017-08-03T18:45:26Z",
    "biotoolsCURIE": "biotools:genome_projector",
    "biotoolsID": "genome_projector",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.g-language.org/GenomeProjector/members.html"
        }
    ],
    "description": "Searchable database browser with zoomable user interface using Google Map API. Genome Projector currently contains 4 views: Genome map, Plasmid map, Pathway map, and DNA walk.",
    "documentation": [
        {
            "type": "General",
            "url": "http://www.g-language.org/GenomeProjector/wiki/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "http://www.g-language.org/GenomeProjector/",
    "language": [
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/genome-projector-zoomable-user-interface-molecular-biology.html"
        }
    ],
    "name": "Genome Projector",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "BACKGROUND: Molecular biology data exist on diverse scales, from the level of molecules to -omics. At the same time, the data at each scale can be categorised into multiple layers, such as the genome, transcriptome, proteome, metabolome, and biochemical pathways. Due to the highly multi-layer and multi-dimensional nature of biological information, software interfaces for database browsing should provide an intuitive interface that allows for rapid migration across different views and scales. The Zoomable User Interface (ZUI) and tabbed browsing have proven successful for this purpose in other areas, especially to navigate the vast information in the World Wide Web. RESULTS: This paper presents Genome Projector, a Web-based gateway for genomics information with a zoomable user interface using Google Maps API, equipped with four seamlessly accessible and searchable views: a circular genome map, a traditional genome map, a biochemical pathways map, and a DNA walk map. The Web application for 320 bacterial genomes is available at http://www.g-language.org/GenomeProjector/. All data and software including the source code, documentations, and development API are freely available under the GNU General Public License. Zoomable maps can be easily created from any image file using the development API, and an online data mapping service for Genome Projector is also available at our Web site. CONCLUSION: Genome Projector is an intuitive Web application for browsing genomics information, implemented with a zoomable user interface and tabbed browsing utilising Google Maps API and Asynchronous JavaScript and XML (AJAX) technology.",
                "authors": [
                    {
                        "name": "Arakawa K."
                    },
                    {
                        "name": "Tamaki S."
                    },
                    {
                        "name": "Kono N."
                    },
                    {
                        "name": "Kido N."
                    },
                    {
                        "name": "Ikegami K."
                    },
                    {
                        "name": "Ogawa R."
                    },
                    {
                        "name": "Tomita M."
                    }
                ],
                "citationCount": 30,
                "date": "2009-01-01T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "Genome Projector: zoomable genome map with multiple views."
            },
            "pmid": "19166610"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}