{
    "additionDate": "2020-01-14T20:08:47Z",
    "biotoolsCURIE": "biotools:microbiomebpr",
    "biotoolsID": "microbiomebpr",
    "confidence_flag": "tool",
    "description": "Current challenges and best-practice protocols for microbiome analysis.\n\nCurrent Challenges and Best Practice Protocols for Microbiome Analysis using Amplicon and Metagenomic Sequencing.\n\nThis review paper (https://doi.org/10.1093/bib/bbz155) aims to provide a comprehensive workflow to perform amplicon and shotgun metagenomics analysis. There are two workflows provided. First workflow for amplicon, using the standard mothur and dada2, and along with it some standard visualization are provided for the processed data. Second workflow for metagenomics, using a variety of tools openly available which have been stitched together to form a usable pipeline.\n\nBoth the workflows are controlled by bash scripts: amplicon_analysis.sh and metagenomics_analysis.sh.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly visualisation",
                    "uri": "http://edamontology.org/operation_3184"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/grimmlab/MicrobiomeBestPracticeReview",
    "language": [
        "Shell",
        "R"
    ],
    "lastUpdate": "2021-01-14T08:13:36Z",
    "license": "MIT",
    "name": "MicrobiomeBPR",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBZ155",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Analyzing the microbiome of diverse species and environments using next-generation sequencing techniques has significantly enhanced our understanding on metabolic, physiological and ecological roles of environmental microorganisms. However, the analysis of the microbiome is affected by experimental conditions (e.g. sequencing errors and genomic repeats) and computationally intensive and cumbersome downstream analysis (e.g. quality control, assembly, binning and statistical analyses). Moreover, the introduction of new sequencing technologies and protocols led to a flood of new methodologies, which also have an immediate effect on the results of the analyses. The aim of this work is to review the most important workflows for 16S rRNA sequencing and shotgun and long-read metagenomics, as well as to provide best-practice protocols on experimental design, sample processing, sequencing, assembly, binning, annotation and visualization. To simplify and standardize the computational analysis, we provide a set of best-practice workflows for 16S rRNA and metagenomic sequencing data (available at https://github.com/grimmlab/MicrobiomeBestPracticeReview).",
                "authors": [
                    {
                        "name": "Bharti R."
                    },
                    {
                        "name": "Grimm D.G."
                    }
                ],
                "citationCount": 23,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Current challenges and best-practice protocols for microbiome analysis"
            },
            "pmid": "31848574"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}