{
    "additionDate": "2021-01-18T09:08:43Z",
    "biotoolsCURIE": "biotools:msf",
    "biotoolsID": "msf",
    "confidence_flag": "tool",
    "description": "Modulated Scanning Fluorimetry Can Quickly Assess Thermal Protein Unfolding Reversibility in Microvolume Samples.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein globularity prediction",
                    "uri": "http://edamontology.org/operation_0408"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Protein quantification",
                    "uri": "http://edamontology.org/operation_3630"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CoriolisPharmaResearch/MSFAnalyser",
    "language": [
        "C#"
    ],
    "lastUpdate": "2021-03-01T09:54:34Z",
    "name": "MSF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.MOLPHARMACEUT.0C00330",
            "metadata": {
                "abstract": "Copyright © 2020 American Chemical Society.Determining the temperature at which the thermal unfolding of a protein starts becoming irreversible is relevant for many areas of protein research. Until now, published methods cannot determine, within a reasonable time frame and with moderate sample consumption, the exposure temperature that starts causing irreversible protein unfolding. We present modulated scanning fluorimetry (MSF) and share a software (MSF Analyzer), which can be used to derive nonreversibility curves of thermal protein unfolding from a series of incremental temperature cycles performed on only 10 μL samples, consuming as low as a few micrograms of protein. Further processing of the data can yield the onset temperature that starts causing nonreversible protein unfolding. The MSF method is based on the hardware of the already existing nanoDSF technology and can be applied to dozens of samples simultaneously. Here, we use MSF to study how solution pH affects the reversibility of thermal protein unfolding of several model proteins to show that the nonreversibility onset temperature (Tnr) is a unique biophysical parameter, providing orthogonal information from thermal protein denaturation data and insights into the validity of thermal unfolding analysis in the context of equilibrium thermodynamics. We also show that MSF can be used to study enzyme stability after exposure to high temperatures. Besides, we demonstrate that protein thermal unfolding and nonreversibility can be affected in different ways upon modifications like PEG-ylation or labeling with fluorescent dyes. Finally, we show that MSF can be used to study the effect of various protein interactions on thermal protein unfolding reversibility. With the diverse examples in this work, we reveal how MSF can provide orthogonal information from thermal denaturation experiments that can bring benefits to various areas of protein research. The MSF Analyzer software is available at https://github.com/CoriolisPharmaResearch/MSFAnalyser.",
                "authors": [
                    {
                        "name": "Svilenov H.L."
                    },
                    {
                        "name": "Menzen T."
                    },
                    {
                        "name": "Richter K."
                    },
                    {
                        "name": "Winter G."
                    }
                ],
                "date": "2020-07-06T00:00:00Z",
                "journal": "Molecular Pharmaceutics",
                "title": "Modulated Scanning Fluorimetry Can Quickly Assess Thermal Protein Unfolding Reversibility in Microvolume Samples"
            },
            "pmid": "32401526"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}