{
    "additionDate": "2021-01-18T09:58:16Z",
    "biotoolsCURIE": "biotools:qaffp",
    "biotoolsID": "qaffp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "icortes@ebi.ac.uk",
            "name": "Isidro Cortés-Ciriano",
            "orcidid": "https://orcid.org/0000-0002-2036-494X",
            "typeEntity": "Person"
        }
    ],
    "description": "QSAR-derived Affinity Fingerprints (part 2): modeling performance for cytotoxicity prediction.\n\nTo generate the results in our paper run run_QAFFP.py as indicated in the file launch_all.sh. All the data sets used in the publications are in the folder: sdf_files.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "https://github.com/isidroc/QAFFP_regression",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-01-31T11:26:46Z",
    "name": "QAFFP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S13321-020-00444-5",
            "metadata": {
                "abstract": "© 2020 The Author(s).Affinity fingerprints report the activity of small molecules across a set of assays, and thus permit to gather information about the bioactivities of structurally dissimilar compounds, where models based on chemical structure alone are often limited, and model complex biological endpoints, such as human toxicity and in vitro cancer cell line sensitivity. Here, we propose to model in vitro compound activity using computationally predicted bioactivity profiles as compound descriptors. To this aim, we apply and validate a framework for the calculation of QSAR-derived affinity fingerprints (QAFFP) using a set of 1360 QSAR models generated using Ki, Kd, IC50 and EC50 data from ChEMBL database. QAFFP thus represent a method to encode and relate compounds on the basis of their similarity in bioactivity space. To benchmark the predictive power of QAFFP we assembled IC50 data from ChEMBL database for 18 diverse cancer cell lines widely used in preclinical drug discovery, and 25 diverse protein target data sets. This study complements part 1 where the performance of QAFFP in similarity searching, scaffold hopping, and bioactivity classification is evaluated. Despite being inherently noisy, we show that using QAFFP as descriptors leads to errors in prediction on the test set in the ~ 0.65-0.95 pIC50 units range, which are comparable to the estimated uncertainty of bioactivity data in ChEMBL (0.76-1.00 pIC50 units). We find that the predictive power of QAFFP is slightly worse than that of Morgan2 fingerprints and 1D and 2D physicochemical descriptors, with an effect size in the 0.02-0.08 pIC50 units range. Including QSAR models with low predictive power in the generation of QAFFP does not lead to improved predictive power. Given that the QSAR models we used to compute the QAFFP were selected on the basis of data availability alone, we anticipate better modeling results for QAFFP generated using more diverse and biologically meaningful targets. Data sets and Python code are publicly available at https://github.com/isidroc/QAFFP_regression.",
                "authors": [
                    {
                        "name": "Cortes-Ciriano I."
                    },
                    {
                        "name": "Skuta C."
                    },
                    {
                        "name": "Bender A."
                    },
                    {
                        "name": "Svozil D."
                    }
                ],
                "citationCount": 5,
                "date": "2020-06-05T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "QSAR-derived affinity fingerprints (part 2): Modeling performance for potency prediction"
            },
            "pmcid": "PMC7339533"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}