{"credit":[{"name":"D. Rahat","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://github.com/dolevrahat"}],"documentation":[{"type":"GENERAL","url":"https://github.com/dolevrahat/CladePP/blob/master/README.md"}],"function":[{"operation":[{"term":"Enrichment analysis","uri":"http://edamontology.org/operation_3501"},{"term":"Expression profile pathway mapping","uri":"http://edamontology.org/operation_0533"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","language":["R"],"maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"link":[{"type":"ISSUE_TRACKER","url":"https://github.com/dolevrahat/CladePP/issues"}],"publication":[{"abstract":"© 2019 Sherill-Rofe et al. The homologous recombination repair (HRR) pathway repairs DNA double-strand breaks in an error-free manner. Mutations in HRR genes can result in increased mutation rate and genomic rearrangements, and are associated with numerous genetic disorders and cancer. Despite intensive research, the HRR pathway is not yet fully mapped. Phylogenetic profiling analysis, which detects functional linkage between genes using coevolution, is a powerful approach to identify factors in many pathways. Nevertheless, phylogenetic profiling has limited predictive power when analyzing pathways with complex evolutionary dynamics such as the HRR. To map novel HRR genes systematically, we developed clade phylogenetic profiling (CladePP). CladePP detects local coevolution across hundreds of genomes and points to the evolutionary scale (e.g., mammals, vertebrates, animals, plants) at which coevolution occurred. We found that multiscale coevolution analysis is significantly more biologically relevant and sensitive to detect gene function. By using CladePP, we identified dozens of unrecognized genes that coevolved with the HRR pathway, either globally across all eukaryotes or locally in different clades. We validated eight genes in functional biological assays to have a role in DNA repair at both the cellular and organismal levels. These genes are expected to play a role in the HRR pathway and might lead to a better understanding of missing heredity in HRR-associated cancers (e.g., heredity breast and ovarian cancer). Our platform presents an innovative approach to predict gene function, identify novel factors related to different diseases and pathways, and characterize gene evolution.","authors":["Sherill-Rofe D.","Rahat D.","Findlay S.","Mellul A.","Guberman I.","Braun M.","Bloch I.","Lalezari A.","Samiei A.","Sadreyev R.","Goldberg M.","Orthwein A.","Zick A.","Tabach Y."],"cit_count":0,"doi":"10.1101/gr.241414.118","journal":"Genome Research","pmid":"30718334","title":"Mapping global and local coevolution across 600 species to identify novel homologous recombination repair genes","type":"Primary","year":"2019-03-01"}],"summary":{"biotoolsCURIE":"biotools:CladePP","biotoolsID":"CladePP","description":"Clade Phylogenetic Profiling (CladePP) detects local coevolution across hundreds of genomes and points to the evolutionary scale (e.g. mammals, vertebrates, animals, plants) at which coevolution occurred.","homepage":"https://github.com/dolevrahat/CladePP","name":"CladePP"}}