{
    "additionDate": "2021-01-18T10:07:50Z",
    "biotoolsCURIE": "biotools:polygene",
    "biotoolsID": "polygene",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "baoguoli@nwu.edu.cn",
            "name": "Baoguo LI",
            "typeEntity": "Person"
        }
    ],
    "description": "A generalized framework for AMOVA with multiple hierarchies and ploidies.\n\nThis software uses the genotypic frequencies under double-reduction to estimate the allele frequencies from allelic phenotypes for polyploids. The software performs a variety of population genetic analyses including genetic diversity analysis, phenotypic or genotypic distribution, linkage disequilibrium and genetic differentiation tests, genetic distance, principal coordinate and hierarchical clustering analyses, individual inbreeding coefficient, individual heterozygosity index and pairwise relatedness estimations, population assignment, parentage analysis, AMOVA and Bayesian clustering.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://github.com/huangkang1987/polygene",
    "lastUpdate": "2021-01-24T14:56:22Z",
    "license": "GPL-3.0",
    "name": "polygene",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1111/1749-4877.12460",
            "metadata": {
                "abstract": "© 2020 International Society of Zoological Sciences, Institute of Zoology/Chinese Academy of Sciences and John Wiley & Sons Australia, Ltd.The analysis of molecular variance (AMOVA) is a widely used statistical method in population genetics and molecular ecology. The classic framework of AMOVA only supports haploid and diploid data, in which the number of hierarchies ranges from two to four. In practice, natural populations can be classified into more hierarchies, and polyploidy is frequently observed in extant species. The ploidy level may even vary within the same species, and/or within the same individual. We generalized the framework of AMOVA such that it can be used for any number of hierarchies and any level of ploidy. Based on this framework, we present four methods to account for data that are multilocus genotypic and allelic phenotypic (with unknown allele dosage). We use simulated datasets and an empirical dataset to evaluate the performance of our framework. We make freely available our methods in a new software package, polygene, which is freely available at https://github.com/huangkang1987/polygene.",
                "authors": [
                    {
                        "name": "Baoguo L.I."
                    },
                    {
                        "name": "Dunn D.W."
                    },
                    {
                        "name": "Huang K."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Zhang P."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Integrative Zoology",
                "title": "A generalized framework for AMOVA with multiple hierarchies and ploidies"
            },
            "pmid": "32648364"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
