{
    "additionDate": "2021-01-18T09:00:42Z",
    "biotoolsCURIE": "biotools:ibioprovis",
    "biotoolsID": "ibioprovis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vatalay@metu.edu.tr",
            "name": "Volkan Atalay",
            "typeEntity": "Person"
        }
    ],
    "description": "interactive visualization and analysis of compound bioactivity space.\n\niBioProVis has its own in house bioactivity dataset curated from ChEMBL (v25) having 15,506,670 data points (i.e., bioactivity measurements). Several filtering and pre-processing steps were applied in order to generate a reliable compound-target dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://ibpv.kansil.org/",
    "lastUpdate": "2021-02-01T09:26:28Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://ibpv.kansil.org/dataset"
        }
    ],
    "name": "iBioProVis",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA496",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.SUMMARY: iBioProVis is an interactive tool for visual analysis of the compound bioactivity space in the context of target proteins, drugs and drug candidate compounds. iBioProVis tool takes target protein identifiers and, optionally, compound SMILES as input, and uses the state-of-the-art non-linear dimensionality reduction method t-Distributed Stochastic Neighbor Embedding (t-SNE) to plot the distribution of compounds embedded in a 2D map, based on the similarity of structural properties of compounds and in the context of compounds' cognate targets. Similar compounds, which are embedded to proximate points on the 2D map, may bind the same or similar target proteins. Thus, iBioProVis can be used to easily observe the structural distribution of one or two target proteins' known ligands on the 2D compound space, and to infer new binders to the same protein, or to infer new potential target(s) for a compound of interest, based on this distribution. Principal component analysis (PCA) projection of the input compounds is also provided, Hence the user can interactively observe the same compound or a group of selected compounds which is projected by both PCA and embedded by t-SNE. iBioProVis also provides detailed information about drugs and drug candidate compounds through cross-references to widely used and well-known databases, in the form of linked table views. Two use-case studies were demonstrated, one being on angiotensin-converting enzyme 2 (ACE2) protein which is Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) Spike protein receptor. ACE2 binding compounds and seven antiviral drugs were closely embedded in which two of them have been under clinical trial for Coronavirus disease 19 (COVID-19). AVAILABILITY AND IMPLEMENTATION: iBioProVis and its carefully filtered dataset are available at https://ibpv.kansil.org/ for public use. CONTACT: vatalay@metu.edu.tr. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Acar A."
                    },
                    {
                        "name": "Atalay V."
                    },
                    {
                        "name": "Cetin-Atalay R."
                    },
                    {
                        "name": "Dogan T."
                    },
                    {
                        "name": "Donmez A."
                    },
                    {
                        "name": "Rifaioglu A.S."
                    }
                ],
                "date": "2020-08-15T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "iBioProVis: interactive visualization and analysis of compound bioactivity space"
            },
            "pmcid": "PMC7454317",
            "pmid": "32407491"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
