{
    "accessibility": "Open access",
    "additionDate": "2022-03-21T17:55:02.560756Z",
    "biotoolsCURIE": "biotools:ptmcode",
    "biotoolsID": "ptmcode",
    "collectionID": [
        "IMPaCT-Data"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pablo.minguez@quironsalud.es",
            "name": "Bioinformatics Unit IIS-FJD",
            "orcidid": "https://orcid.org/0000-0003-4099-9421",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.translationalbioinformaticslab.es/"
        }
    ],
    "description": "PTMCode is a resource of known and predicted functional associations between protein post-translational modifications (PTMs) within and between interacting proteins. It currently contains 316,546 modified sites from 69 different PTM types which are also propagated through ortholgs between 19 different eukaryotic species. A total of 1.6 million sites and 17 million functional associations more than 100,000 proteins can currently be explored.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://ptmcode.embl.de/help.cgi"
        }
    ],
    "editPermission": {
        "authors": [
            "gonumo",
            "pminguez"
        ],
        "type": "group"
    },
    "homepage": "https://ptmcode.embl.de/",
    "lastUpdate": "2022-03-22T15:57:01.479425Z",
    "license": "CC-BY-NC-SA-3.0",
    "maturity": "Mature",
    "name": "PTMCode",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "iiancu",
    "publication": [
        {
            "doi": "10.1093/nar/gks1230",
            "metadata": {
                "abstract": "Post-translational modifications (PTMs) are involved in the regulation and structural stabilization of eukaryotic proteins. The combination of individual PTM states is a key to modulate cellular functions as became evident in a few well-studied proteins. This combinatorial setting, dubbed the PTM code, has been proposed to be extended to whole prote-omes in eukaryotes. Although we are still far from deciphering such a complex language, thousands of protein PTM sites are being mapped by high-throughput technologies, thus providing sufficient data for comparative analysis. PTMcode (http://ptmcode.embl.de) aims to compile known and predicted PTM associations to provide a framework that would enable hypothesis-driven experimental or computational analysis of various scales. In its first release, PTMcode provides PTM functional associations of 13 different PTM types within proteins in 8 eukaryotes. They are based on five evidence channels: a literature survey, residue co-evolution, structural proximity, PTMs at the same residue and location within PTM highly enriched protein regions (hotspots). PTMcode is presented as a protein-based searchable database with an interactive web interface providing the context of the co-regulation of nearly 75000 residues in >10 000 proteins. © The Author(s) 2012.",
                "authors": [
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Minguez P."
                    },
                    {
                        "name": "Parca L."
                    }
                ],
                "citationCount": 101,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PTMcode: A database of known and predicted functional associations between post-translational modifications in proteins"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}
