{
    "additionDate": "2019-11-14T17:59:42Z",
    "biotoolsCURIE": "biotools:DIpartite",
    "biotoolsID": "DIpartite",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "hiroki.takahashi@chiba-u.jp",
            "name": "Hiroki Takahashi",
            "orcidid": "https://orcid.org/0000-0001-5627-1035",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool for detecting bipartite motifs by considering base interdependencies | A DNA sequence motif finding program | DIpartite is a tool for detecting bipartite motif based on dinucleotide weight matrix | DIpartite predicts transcription factor binding sites (TFBSs) based on PWM or DWM. Bipartite motif is defined as two conserved blocks separated by variable gaps",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Mohammad-Vahed/DIpartite",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-11-14T17:59:42Z",
    "license": "GPL-3.0",
    "name": "DIpartite",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0220207",
            "metadata": {
                "abstract": "© 2019 Vahed et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.It is extremely important to identify transcription factor binding sites (TFBSs). Some TFBSs are proposed to be bipartite motifs known as two-block motifs separated by gap sequences with variable lengths. While position weight matrix (PWM) is commonly used for the representation and prediction of TFBSs, dinucleotide weight matrix (DWM) enables expression of the interdependencies of neighboring bases. By incorporating DWM into the detection of bipartite motifs, we have developed a novel tool for ab initio motif detection, DIpartite (bipar-tite motif detection tool based on dinucleotide weight matrix) using a Gibbs sampling strategy and the minimization of Shannon’s entropy. DIpartite predicts the bipartite motifs by considering the interdependencies of neighboring positions, that is, DWM. We compared DIpartite with other available alternatives by using test datasets, namely, of CRP in E. coli, sigma factors in B. subtilis, and promoter sequences in humans. We have developed DIpartite for the detection of TFBSs, particularly bipartite motifs. DIpartite enables ab initio prediction of conserved motifs based on not only PWM, but also DWM. We evaluated the performance of DIpartite by comparing it with freely available tools, such as MEME, BioProspector, BiPad, and AMD. Taken the obtained findings together, DIpartite performs equivalently to or better than these other tools, especially for detecting bipartite motifs with variable gaps. DIpartite requires users to specify the motif lengths, gap length, and PWM or DWM. DIpartite is available for use at https://github.com/Mohammad-Vahed/DIpartite.",
                "authors": [
                    {
                        "name": "Vahed M."
                    },
                    {
                        "name": "Ishihara J.-I."
                    },
                    {
                        "name": "Takahashi H."
                    }
                ],
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Dipartite: A tool for detecting bipartite motifs by considering base interdependencies"
            },
            "pmcid": "PMC6716629",
            "pmid": "31469855"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ]
}