{
    "additionDate": "2019-11-14T20:08:52Z",
    "biotoolsCURIE": "biotools:signature_matrix",
    "biotoolsID": "signature_matrix",
    "confidence_flag": "tool",
    "description": "Tissue-specific deconvolution of immune cell composition by integrating bulk and single-cell transcriptomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "3D-1D scoring matrix generation",
                    "uri": "http://edamontology.org/operation_2239"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Sequence distance matrix generation",
                    "uri": "http://edamontology.org/operation_0289"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wuaipinglab/ImmuCC/tree/master/tissue_immucc/SignatureMatrix",
    "lastUpdate": "2022-02-07T11:15:49.724619Z",
    "name": "signature matrix",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ672",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Many methods have been developed to estimate immune cell composition from tissue transcriptomes. One common characteristic of these methods is that they are trained using a set of general immune cell transcriptomes that ignores tissue specificities. However, as immune cells are localized in different tissues, they may have distinct expression profiles. Hence, calculations that use general signature matrices may hinder the deconvolution accuracy. Results: This study used single cell RNA-sequencing (scRNA-Seq) data from different mouse tissues instead of general signature expression values to generate tissue-specific signature gene matrices that are used as the input of the deconvolution model. First, the transcriptome of immune cells in each tissue was extracted from scRNA-Seq data and used to construct the entire expression matrix of tissue immune cells. Then, after comparing different gene selection strategies, the expressions of 162 seq-ImmuCC derived signature genes in tissue immune cell scRNA-Seq data were regarded as the tissue specific signature matrices. Finally, a modest improvement in performance was observed in multiple tissues that refer to a traditional general signature matrix in the deconvolution model. With the fast accumulation of scRNA-Seq data, the introduction of these data into an estimation of immune cell compositions for different tissues will open a new window for avoiding tissue bias for immune cell expression.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Ji C."
                    },
                    {
                        "name": "Liu W."
                    },
                    {
                        "name": "Qin F.X.-F."
                    },
                    {
                        "name": "Shen Q."
                    },
                    {
                        "name": "Wu A."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Tissue-specific deconvolution of immune cell composition by integrating bulk and single-cell transcriptomes"
            },
            "pmid": "31504185"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
