
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic code prediction",
                    "uri": "http://edamontology.org/operation_0489"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Animals",
                "uri": "http://edamontology.org/topic_3500"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Sequence composition, complexity and repeats",
                "uri": "http://edamontology.org/topic_0157"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Although the majority of the organisms use the same genetic code to translate DNA, several variants have been described in a wide range of organisms, both in nuclear and organellar systems, many of them corresponding to metazoan mitochondria. These variants are usually found by comparative sequence analyses, either conducted manually or with the computer. Basically, when a particular codon in a query-species is linked to positions for which a specific amino acid is consistently found in other species, then that particular codon is expected to translate as that specific amino acid. Importantly, and despite the simplicity of this approach, there are no available tools to help predicting the genetic code of an organism. We present here GenDecoder, a web server for the characterization and prediction of mitochondrial genetic codes in animals. The analysis of automatic predictions for 681 metazoans aimed us to study some properties of the comparative method, in particular, the relationship among sequence conservation, taxonomic sampling and reliability of assignments. Overall, the method is highly precise (99%), although highly divergent organisms such as platyhelminths are more problematic. The GenDecoder web server is freely available from http://darwin.uvigo.es/software/gendecoder.html. © The Author 2006. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Abascal F.",
                "Zardoya R.",
                "Posada D."
            ],
            "cit_count": 23,
            "journal": "Nucleic Acids Research",
            "pmid": "16845034",
            "title": "GenDecoder: Genetic code prediction for metazoan mitochondria",
            "year": "2006-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gendecoder",
        "biotoolsID": "gendecoder",
        "description": "Prediction server for animal mitochondrial genetic codes. It provides information about codon-usage, amino acid composition, GC content and a final genetic code prediction for a mitochondrial genome sequence.",
        "homepage": "http://darwin.uvigo.es/software/gendecoder.html",
        "name": "GenDecoder"
    }
}