{
    "additionDate": "2018-07-13T15:14:11Z",
    "biotoolsCURIE": "biotools:xsult",
    "biotoolsID": "xsult",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://mordred.bioc.cam.ac.uk/xsult/about"
        }
    ],
    "description": "Enhanced version of the protein alignment annotation program JoY,formats a submitted multiple-sequence alignment using three-dimensional (3D) structural information in order to assist in the comparative analysis of protein evolution and in the optimization of alignments for comparative modelling and construct design. It annotates each amino acid residue with residue depth, chain and ligand interactions, inter-residue contacts, sequence entropy, root mean square deviation and secondary structure and disorder prediction.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mordred.bioc.cam.ac.uk/xsult/help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein threading",
                    "uri": "http://edamontology.org/operation_0302"
                }
            ]
        }
    ],
    "homepage": "http://structure.bioc.cam.ac.uk/xsult/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "XSuLT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/NAR/GKX421",
            "metadata": {
                "abstract": "©The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research.The web server XSuLT, an enhanced version of the protein alignment annotation program JoY, formats a submitted multiple-sequence alignment using three-dimensional (3D) structural information in order to assist in the comparative analysis of protein evolution and in the optimization of alignments for comparative modelling and construct design. In addition to the features analysed by JoY, which include secondary structure, solvent accessibility and sidechain hydrogen bonds, XSuLT annotates each amino acid residue with residue depth, chain and ligand interactions, inter-residue contacts, sequence entropy, root mean square deviation and secondary structure and disorder prediction. It is also now integrated with built-in 3D visualization which interacts with the formatted alignment to facilitate inspection and understanding. Results can be downloaded as stand-alone HTML for the formatted alignment and as XML with the underlying annotation data. XSuLT is freely available at http://structure.bioc.cam.ac.uk/xsult/.",
                "authors": [
                    {
                        "name": "Blundell T.L."
                    },
                    {
                        "name": "Ochoa-Montano B."
                    }
                ],
                "citationCount": 1,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "XSuLT: A web server for structural annotation and representation of sequence-structure alignments"
            },
            "pmcid": "PMC5793734",
            "pmid": "28510698"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1
}
