
{
    "credit": [
        {
            "email": "ikavakiotis@gmail.com",
            "name": "Ioannis Kavakiotis",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mlkd.csd.auth.gr/bio/tres/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://mlkd.csd.auth.gr/bio/tres/userguide.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 The American Genetic Association.The advent of high-throughput genomic technologies is enabling analyses on thousands or even millions of single-nucleotide polymorphisms (SNPs). At the same time, the selection of a minimum number of SNPs with the maximum information content is becoming increasingly problematic. Available locus ranking programs have been accused of providing upwardly biased results (concerning the predicted accuracy of the chosen set of markers for population assignment), cannot handle high-dimensional datasets, and some of them are computationally intensive. The toolbox for ranking and evaluation of SNPs (TRES) is a collection of algorithms built in a user-friendly and computationally efficient software that can manipulate and analyze datasets even in the order of millions of genotypes in a matter of seconds. It offers a variety of established methods for evaluating and ranking SNPs on user defined groups of populations and produces a set of predefined number of top ranked loci. Moreover, dataset manipulation algorithms enable users to convert datasets in different file formats, split the initial datasets into train and test sets, and finally create datasets containing only selected SNPs occurring from the SNP selection analysis for later on evaluation in dedicated software such as GENECLASS. This application can aid biologists to select loci with maximum power for optimization of cost-effective panels with applications related to e.g. species identification, wildlife management, and forensic problems. TRES is available for all operating systems at http://mlkd.csd.auth.gr/bio/tres.",
            "authors": [
                "Kavakiotis I.",
                "Triantafyllidis A.",
                "Ntelidou D.",
                "Alexandri P.",
                "Megens H.-J.",
                "Crooijmans R.P.M.A.",
                "Groenen M.A.M.",
                "Tsoumakas G.",
                "Vlahavas I."
            ],
            "cit_count": 9,
            "journal": "Journal of Heredity",
            "pmid": "26137847",
            "title": "TRES: Identification of Discriminatory and Informative SNPs from Population Genomic Data",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tres",
        "biotoolsID": "tres",
        "description": "Toolbox for Ranking and Evaluation of SNPs (Population Genomic Data).",
        "homepage": "http://mlkd.csd.auth.gr/bio/tres/",
        "name": "TRES"
    }
}