{
    "accessibility": "Open access",
    "additionDate": "2023-04-24T13:50:30.808691Z",
    "biotoolsCURIE": "biotools:wasco",
    "biotoolsID": "wasco",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "juan.cortes@laas.fr",
            "name": "Juan Cortés",
            "typeEntity": "Person"
        },
        {
            "name": "Amin Sagar"
        },
        {
            "name": "Javier González-Delgado"
        },
        {
            "name": "Pierre Neuvial"
        }
    ],
    "description": "A Wasserstein-based statistical tool to compare conformational ensembles of intrinsically disordered proteins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure prediction (coils)",
                    "uri": "http://edamontology.org/operation_0470"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.laas.fr/moma/WASCO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-04-24T13:50:30.812092Z",
    "license": "MIT",
    "name": "WASCO",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.jmb.2023.168053",
            "metadata": {
                "abstract": "The structural investigation of intrinsically disordered proteins (IDPs) requires ensemble models describing the diversity of the conformational states of the molecule. Due to their probabilistic nature, there is a need for new paradigms that understand and treat IDPs from a purely statistical point of view, considering their conformational ensembles as well-defined probability distributions. In this work, we define a conformational ensemble as an ordered set of probability distributions and provide a suitable metric to detect differences between two given ensembles at the residue level, both locally and globally. The underlying geometry of the conformational space is properly integrated, one ensemble being characterized by a set of probability distributions supported on the three-dimensional Euclidean space (for global-scale comparisons) and on the two-dimensional flat torus (for local-scale comparisons). The inherent uncertainty of the data is also taken into account to provide finer estimations of the differences between ensembles. Additionally, an overall distance between ensembles is defined from the differences at the residue level. We illustrate the potential of the approach with several examples of applications for the comparison of conformational ensembles: (i) produced from molecular dynamics (MD) simulations using different force fields, and (ii) before and after refinement with experimental data. We also show the usefulness of the method to assess the convergence of MD simulations, and discuss other potential applications such as in machine-learning-based approaches. The numerical tool has been implemented in Python through easy-to-use Jupyter Notebooks available at https://gitlab.laas.fr/moma/WASCO.",
                "authors": [
                    {
                        "name": "Bernado P."
                    },
                    {
                        "name": "Cortes J."
                    },
                    {
                        "name": "Gonzalez-Delgado J."
                    },
                    {
                        "name": "Lindorff-Larsen K."
                    },
                    {
                        "name": "Neuvial P."
                    },
                    {
                        "name": "Sagar A."
                    },
                    {
                        "name": "Zanon C."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "WASCO: A Wasserstein-based Statistical Tool to Compare Conformational Ensembles of Intrinsically Disordered Proteins"
            },
            "pmid": "36934808"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
