{
    "accessibility": "Open access",
    "additionDate": "2022-10-05T21:21:40.884959Z",
    "biotoolsCURIE": "biotools:umierrorcorrect",
    "biotoolsID": "umierrorcorrect",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Gustav Johansson"
        },
        {
            "name": "Anders Ståhlberg",
            "orcidid": "https://orcid.org/0000-0003-4243-0191"
        },
        {
            "name": "Stefan Filges",
            "orcidid": "https://orcid.org/0000-0002-5994-6699"
        },
        {
            "name": "Tobias Österlund",
            "orcidid": "https://orcid.org/0000-0002-7870-8645"
        }
    ],
    "description": "Software for Consensus Read Generation, Error Correction, and Visualization Using Unique Molecular Identifiers.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/stahlberggroup/umierrorcorrect/wiki/Tutorial"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tobbeost/umierrorcorrect",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:30:12.527339Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/umierrorcorrect/"
        }
    ],
    "name": "UMIErrorCorrect",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/clinchem/hvac136",
            "metadata": {
                "abstract": "Background: Targeted sequencing using unique molecular identifiers (UMIs) enables detection of rare variant alleles in challenging applications, such as cell-free DNA analysis from liquid biopsies. Standard bioinformatics pipelines for data processing and variant calling are not adapted for deep-sequencing data containing UMIs, are inflexible, and require multistep workflows or dedicated computing resources. Methods: We developed a bioinformatics pipeline using Python and an R package for data analysis and visualization. To validate our pipeline, we analyzed cell-free DNA reference material with known mutant allele frequencies (0%, 0.125%, 0.25%, and 1%) and public data sets. Results: We developed UMIErrorCorrect, a bioinformatics pipeline for analyzing sequencing data containing UMIs. UMIErrorCorrect only requires fastq files as inputs and performs alignment, UMI clustering, error correction, and variant calling. We also provide UMIAnalyzer, a graphical user interface, for data mining, visualization, variant interpretation, and report generation. UMIAnalyzer allows the user to adjust analysis parameters and study their effect on variant calling. We demonstrated the flexibility of UMIErrorCorrect by analyzing data from 4 different targeted sequencing protocols. We also show its ability to detect different mutant allele frequencies in standardized cell-free DNA reference material. UMIErrorCorrect outperformed existing pipelines for targeted UMI sequencing data in terms of variant detection sensitivity. Conclusions: UMIErrorCorrect and UMIAnalyzer are comprehensive and customizable bioinformatics tools that can be applied to any type of library preparation protocol and enrichment chemistry using UMIs. Access to simple, generic, and open-source bioinformatics tools will facilitate the implementation of UMI-based sequencing approaches in basic research and clinical applications.",
                "authors": [
                    {
                        "name": "Filges S."
                    },
                    {
                        "name": "Johansson G."
                    },
                    {
                        "name": "Osterlund T."
                    },
                    {
                        "name": "Stahlberg A."
                    }
                ],
                "citationCount": 8,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Clinical Chemistry",
                "title": "UMIErrorCorrect and UMIAnalyzer: Software for Consensus Read Generation, Error Correction, and Visualization Using Unique Molecular Identifiers"
            },
            "pmid": "36031761"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
