{
    "additionDate": "2023-03-30T08:51:19.974315Z",
    "biotoolsCURIE": "biotools:ribodetector",
    "biotoolsID": "ribodetector",
    "description": "RiboDetector is a software developed to accurately yet rapidly detect and remove rRNA sequences from metagenomeic, metatranscriptomic, and ncRNA sequencing data. It was developed based on LSTMs and optimized for both GPU and CPU.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence comparison",
                    "uri": "http://edamontology.org/operation_2451"
                },
                {
                    "term": "Sequence contamination filtering",
                    "uri": "http://edamontology.org/operation_3187"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hzi-bifo/RiboDetector",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-30T08:51:30.832521Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hzi-bifo/RiboDetector"
        }
    ],
    "name": "RiboDetector",
    "owner": "alexcorm",
    "publication": [
        {
            "doi": "10.1093/nar/gkac112",
            "metadata": {
                "abstract": "Advances in transcriptomic and translatomic techniques enable in-depth studies of RNA activity profiles and RNA-based regulatory mechanisms. Ribosomal RNA (rRNA) sequences are highly abundant among cellular RNA, but if the target sequences do not include polyadenylation, these cannot be easily removed in library preparation, requiring their post-hoc removal with computational techniques to accelerate and improve downstream analyses. Here, we describe RiboDetector, a novel software based on a Bi-directional Long Short-Term Memory (BiLSTM) neural network, which rapidly and accurately identifies rRNA reads from transcriptomic, metagenomic, metatranscriptomic, noncoding RNA, and ribosome profiling sequence data. Compared with state-of-the-art approaches, RiboDetector produced at least six times fewer misclassifications on the benchmark datasets. Importantly, the few false positives of RiboDetector were not enriched in certain Gene Ontology (GO) terms, suggesting a low bias for downstream functional profiling. RiboDetector also demonstrated a remarkable generalizability for detecting novel rRNA sequences that are divergent from the training data with sequence identities of <90%. On a personal computer, RiboDetector processed 40M reads in less than 6 min, which was ∼50 times faster in GPU mode and ∼15 times in CPU mode than other methods. RiboDetector is available under a GPL v3.0 license at https://github.com/hzi-bifo/RiboDetector.",
                "authors": [
                    {
                        "name": "Deng Z.-L."
                    },
                    {
                        "name": "McHardy A.C."
                    },
                    {
                        "name": "Mreches R."
                    },
                    {
                        "name": "Munch P.C."
                    }
                ],
                "date": "2022-06-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Rapid and accurate identification of ribosomal RNA sequences via deep learning"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}
