
{
    "credit": [
        {
            "email": "galgonek@iocb.cas.cz",
            "name": "Jakub Galgonek",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bioinfo.uochb.cas.cz/sachem/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java",
            "C++",
            "SQL",
            "C"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Cheminformatics",
                "uri": "http://edamontology.org/topic_2258"
            },
            {
                "term": "Compound libraries and screening",
                "uri": "http://edamontology.org/topic_3343"
            },
            {
                "term": "Drug development",
                "uri": "http://edamontology.org/topic_3373"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018, The Author(s).Background: Structure search is one of the valuable capabilities of small-molecule databases. Fingerprint-based screening methods are usually employed to enhance the search performance by reducing the number of calls to the verification procedure. In substructure search, fingerprints are designed to capture important structural aspects of the molecule to aid the decision about whether the molecule contains a given substructure. Currently available cartridges typically provide acceptable search performance for processing user queries, but do not scale satisfactorily with dataset size. Results: We present Sachem, a new open-source chemical cartridge that implements two substructure search methods: The first is a performance-oriented reimplementation of substructure indexing based on the OrChem fingerprint, and the second is a novel method that employs newly designed fingerprints stored in inverted indices. We assessed the performance of both methods on small, medium, and large datasets containing 1, 10, and 94 million compounds, respectively. Comparison of Sachem with other freely available cartridges revealed improvements in overall performance, scaling potential and screen-out efficiency. Conclusions: The Sachem cartridge allows efficient substructure searches in databases of all sizes. The sublinear performance scaling of the second method and the ability to efficiently query large amounts of pre-extracted information may together open the door to new applications for substructure searches.",
            "authors": [
                "Kratochvil M.",
                "Vondrasek J.",
                "Galgonek J."
            ],
            "cit_count": 0,
            "doi": "10.1186/s13321-018-0282-y",
            "journal": "Journal of Cheminformatics",
            "title": "Sachem: a chemical cartridge for high-performance substructure search",
            "year": "2018-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sachem",
        "biotoolsID": "sachem",
        "description": "High-performance cartridge suitable for storing small molecules and searching them using substructure search.",
        "homepage": "http://bioinfo.uochb.cas.cz/sachem/",
        "name": "Sachem"
    }
}