{
    "additionDate": "2021-10-04T12:56:09.901303Z",
    "biotoolsCURIE": "biotools:m6add",
    "biotoolsID": "m6add",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangtyo@hit.edu.cn",
            "name": "Yan Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "m6ADD is a database containing manually collected experimentally confirmed m6A (N6-methyladenosine)-disease data and data obtained from high-throughput disease m6A modification profiles, aimed at exploring the association between m6A modified gene disorders and diseases",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://m6add.edbc.org/",
    "lastUpdate": "2021-10-04T12:57:09.921333Z",
    "name": "M6ADD",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1080/15476286.2021.1913302",
            "metadata": {
                "abstract": "© 2021 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group.N6-methyladenosine (m6A) modification is an important regulatory factor affecting diseases, including multiple cancers and it is a developing direction for targeted disease therapy. Here, we present the M6ADD (m6A-diseases database) database, a public data resource containing manually curated data on potential m6A-disease associations for which some experimental evidence is available; the related high-throughput sequencing data are also provided and analysed by using different computational methods. To give researchers a tool to query the m6A modification data, the M6ADD was designed as a web-based comprehensive resource focusing on the collection, storage and online analysis of m6A modifications, aimed at exploring the associations between m6A modification and gene disorders and diseases. The M6ADD includes 222 experimentally confirmed m6A-disease associations, involving 59 diseases from a review of more than 2000 published papers. The M6ADD also includes 409,229 m6A-disease associations obtained by computational and statistical methods from 30 high-throughput sequencing datasets. In addition, we provide data on 5239 potential m6A regulatory proteins related to 24 cancers based on network analysis prediction methods. In addition, we have developed a tool to explore the function of m6A-modified genes through the protein–protein interaction networks. The M6ADD can be accessed at http://m6add.edbc.org/.",
                "authors": [
                    {
                        "name": "Bi F."
                    },
                    {
                        "name": "Gu Y."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Xing J."
                    },
                    {
                        "name": "Zeng J."
                    },
                    {
                        "name": "Zhang M."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhou D."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "RNA Biology",
                "title": "M6ADD: a comprehensive database of m6A modifications in diseases"
            },
            "pmid": "33906563",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
