{
    "additionDate": "2021-01-18T07:30:03Z",
    "biotoolsCURIE": "biotools:sctssr",
    "biotoolsID": "sctssr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangxf@mail.ccnu.edu.cn",
            "name": "Xiao-Fei Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "gene expression recovery for single-cell RNA sequencing using two-side sparse self-representation.\n\nREADME file for R package supporting the paper \"scTSSR: gene expression recovery for single-cell RNA sequencing using two-side sparse self-representation\".\n\nThe scTSSR package has the following R-package dependencies: SAVER, keras, tensorflow. The dependent packages will be automatically installed along with scTSSR. You can use the following commands to install scTSSR from GitHub.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Zhangxf-ccnu/scTSSR",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-13T16:46:28Z",
    "license": "GPL-3.0",
    "name": "scTSSR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA108",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Single-cell RNA sequencing (scRNA-seq) methods make it possible to reveal gene expression patterns at single-cell resolution. Due to technical defects, dropout events in scRNA-seq will add noise to the gene-cell expression matrix and hinder downstream analysis. Therefore, it is important for recovering the true gene expression levels before carrying out downstream analysis. Results: In this article, we develop an imputation method, called scTSSR, to recover gene expression for scRNA-seq. Unlike most existing methods that impute dropout events by borrowing information across only genes or cells, scTSSR simultaneously leverages information from both similar genes and similar cells using a two-side sparse self-representation model. We demonstrate that scTSSR can effectively capture the Gini coefficients of genes and gene-to-gene correlations observed in single-molecule RNA fluorescence in situ hybridization (smRNA FISH). Downsampling experiments indicate that scTSSR performs better than existing methods in recovering the true gene expression levels. We also show that scTSSR has a competitive performance in differential expression analysis, cell clustering and cell trajectory inference.",
                "authors": [
                    {
                        "name": "Jin K."
                    },
                    {
                        "name": "Ou-Yang L."
                    },
                    {
                        "name": "Zhao X.-M."
                    },
                    {
                        "name": "Yan H."
                    },
                    {
                        "name": "Zhang X.-F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ScTSSR: Gene expression recovery for single-cell RNA sequencing using two-side sparse self-representation"
            },
            "pmid": "32073600"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ]
}