{
    "additionDate": "2020-01-09T18:03:14Z",
    "biotoolsCURIE": "biotools:TYMS_rs2853741_MTHFR_rs3737964_MTHFR",
    "biotoolsID": "TYMS_rs2853741_MTHFR_rs3737964_MTHFR",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "drmafei@126.com",
            "name": "Fei Ma",
            "typeEntity": "Person"
        },
        {
            "email": "xubinghe@medmail.com.cn",
            "name": "Binghe Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "Polymorphisms of MTHFR and TYMS predict capecitabine-induced hand-foot syndrome in patients with metastatic breast cancer.\n\nBACKGROUND:Breast cancer is a global problem, and a large number of new cases are diagnosed every year. Capecitabine is effective in patients with metastatic breast cancer (MBC). Hand-foot syndrome (HFS) is a common adverse effect of capecitabine. In this study, we investigated the association between single nucleotide polymorphisms (SNPs) in genes involved in capecitabine metabolism pathways and capecitabine-induced HFS in Chinese patients with MBC to identify some predictive genetic biomarkers. METHODS:We selected 3 genes involved in capecitabine metabolism and screened genetic variants in these target genes.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'rs2853741 MTHFR rs3737964 MTHFR rs4846048', 'TYMS rs2606241 TYMS rs2853741 MTHFR', 'rs2606241 TYMS rs2853741 MTHFR rs3737964', 'MTHFR rs3737964 MTHFR rs4846048'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31601265",
    "lastUpdate": "2020-01-09T18:03:14Z",
    "name": "TYMS rs2853741 MTHFR rs3737964 MTHFR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S40880-019-0399-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Breast cancer is a global problem, and a large number of new cases are diagnosed every year. Capecitabine is effective in patients with metastatic breast cancer (MBC). Hand-foot syndrome (HFS) is a common adverse effect of capecitabine. In this study, we investigated the association between single nucleotide polymorphisms (SNPs) in genes involved in capecitabine metabolism pathways and capecitabine-induced HFS in Chinese patients with MBC to identify some predictive genetic biomarkers. Methods: We selected 3 genes involved in capecitabine metabolism and screened genetic variants in these target genes. We genotyped a total of 22 SNPs in the thymidylate synthase gene (TYMS), the methylene tetrahydrofolate reductase gene (MTHFR), and the ribonucleotide reductase M1 gene (RRM1) in 342 MBC patients treated with capecitabine-based chemotherapy. The genotype distributions of each SNP in patients with and without HFS were assessed using Pearson's χ2 test, and the relationship between HFS and genotypes of SNPs was determined using logistic regression analysis. The association between SNPs and their corresponding gene expression was analyzed using the Blood expression quantitative trait loci (eQTL) browser online tools. Results: We found 4 positive sites for HFS in the TYMS and MTHFR genes: TYMS rs2606241 (P = 0.022), TYMS rs2853741 (P = 0.019), MTHFR rs3737964 (P = 0.029), and MTHFR rs4846048 (P = 0.030). Logistic regression analyses showed that the genotype AG of MTHFR rs3737964 [odds ratio (OR) = 0.54, 95% confidence interval (CI) 0.31-0.97, P = 0.038] and MTHFR rs4846048 (OR = 0.54, 95% CI 0.30-0.98, P = 0.042) were protective factors of HFS, whereas the genotype CT of TYMS rs2853741 (OR = 2.25, 95% CI 1.31-3.87, P = 0.012) increased the risk of HFS. The association between the genotype GT of TYMS rs2606241 (OR = 1.27, 95% CI 0.73-2.23, P = 0.012) and HFS was uncertain. Further eQTL analyses confirmed that the alleles of rs3737964 and rs4846048 affected the gene expression levels of MTHFR in cis. Conclusions: We have identified four potentially useful pharmacogenetic markers, TYMS rs2606241, TYMS rs2853741, MTHFR rs3737964, and MTHFR rs4846048 to predict capecitabine-induced HFS in MBC patients.",
                "authors": [
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Yue J."
                    },
                    {
                        "name": "Guan X."
                    },
                    {
                        "name": "Yuan P."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Luo Y."
                    },
                    {
                        "name": "Fan Y."
                    },
                    {
                        "name": "Cai R."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Ma F."
                    },
                    {
                        "name": "Xu B."
                    }
                ],
                "date": "2019-10-11T00:00:00Z",
                "journal": "Cancer Communications",
                "title": "Polymorphisms of MTHFR and TYMS predict capecitabine-induced hand-foot syndrome in patients with metastatic breast cancer"
            },
            "pmcid": "PMC6787984",
            "pmid": "31601265"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}