{
    "additionDate": "2020-01-14T09:37:29Z",
    "biotoolsCURIE": "biotools:miRTarBas",
    "biotoolsID": "miRTarBas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tototang6@hotmail.com",
            "name": "Lirui Tang",
            "orcidid": "https://orcid.org/0000-0002-9863-3732",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of key genes and long non-coding RNA associated ceRNA networks in hepatocellular carcinoma.\n\nthe experimentally validated microRNA-target interactions database.\n\nAs a database, miRTarBase has accumulated more than three hundred and sixty thousand miRNA-target interactions (MTIs), which are collected by manually surveying pertinent literature after NLP of the text systematically to filter research articles related to functional studies of miRNAs. Generally, the collected MTIs are validated experimentally by reporter assay, western blot, microarray and next-generation sequencing experiments. While containing the largest amount of validated MTIs, the miRTarBase provides the most updated collection by comparing with other similar, previously developed databases.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://mirtarbase.mbc.nctu.edu.tw",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-29T09:11:32Z",
    "name": "miRTarBas",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.8021",
            "metadata": {
                "abstract": "Copyright 2019 Liu et al.Background: Hepatocellular carcinoma (HCC) is one of the leading causes of cancer-related deaths worldwide. Although multiple efforts have been made to understand the development of HCC, morbidity, and mortality rates remain high. In this study, we aimed to discover the mRNAs and long non-coding RNAs (lncRNAs) that contribute to the progression of HCC. We constructed a lncRNA-related competitive endogenous RNA (ceRNA) network to elucidate the molecular regulatory mechanism underlying HCC. Methods: A microarray dataset (GSE54238) containing information about both mRNAs and lncRNAs was downloaded from the Gene Expression Omnibus database. Differentially expressed genes (DEGs) and lncRNAs (DElncRNAs) in tumor tissues and non-cancerous tissues were identified using the limma package of the R software. The miRNAs that are targeted by DElncRNAs were predicted using miRcode, while the target mRNAs of miRNAs were retrieved from miRDB, miRTarBas, and TargetScan. Functional annotation and pathway enrichment of DEGs were performed using the EnrichNet website. We constructed a protein–protein interaction (PPI) network of DEGs using STRING, and identified the hub genes using Cytoscape. Survival analysis of the hub genes and DElncRNAs was performed using the gene expression profiling interactive analysis database. The expression of molecules with prognostic values was validated on the UALCAN database. The hepatic expression of hub genes was examined using the Human Protein Atlas. The hub genes and DElncRNAs with prognostic values as well as the predictive miRNAs were selected to construct the ceRNA networks. Results: We found that 10 hub genes (KPNA2, MCM7, CKS2, KIF23, HMGB2, ZWINT, E2F1, MCM4, H2AFX, and EZH2) and four lncRNAs (FAM182B, SNHG6, SNHG1, and SNHG3) with prognostic values were overexpressed in the hepatic tumor samples. We also constructed a network containing 10 lncRNA–miRNA–mRNA pathways, which might be responsible for regulating the biological mechanisms underlying HCC. Conclusion: We found that the 10 significantly overexpressed hub genes and four lncRNAs were negatively correlated with the prognosis of HCC. Further, we suggest that lncRNA SNHG1 and the SNHG3-related ceRNAs can be potential research targets for exploring the molecular mechanisms of HCC.",
                "authors": [
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Tang L."
                    }
                ],
                "citationCount": 8,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Identification of key genes and long non-coding RNA associated ceRNA networks in hepatocellular carcinoma"
            },
            "pmcid": "PMC6827457",
            "pmid": "31695969"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}