{
    "accessibility": "Open access",
    "additionDate": "2022-05-16T20:32:30.253076Z",
    "biotoolsCURIE": "biotools:swdpwr",
    "biotoolsID": "swdpwr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fan.f.li@yale.edu",
            "name": "Fan Li",
            "orcidid": "https://orcid.org/0000-0001-6183-1893",
            "typeEntity": "Person"
        },
        {
            "name": "Donna Spiegelman",
            "orcidid": "https://orcid.org/0000-0003-4006-4650"
        },
        {
            "name": "Jiachen Chen",
            "orcidid": "https://orcid.org/0000-0002-1941-2326"
        },
        {
            "name": "Xin Zhou",
            "orcidid": "https://orcid.org/0000-0003-2238-2890"
        }
    ],
    "description": "A SAS macro and an R package for power calculations in stepped wedge cluster randomized trials.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/swdpwr/swdpwr.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://jiachenchen322.shinyapps.io/swdpwr_shinyapp/",
    "language": [
        "R",
        "SAS"
    ],
    "lastUpdate": "2022-05-16T20:32:30.257241Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/swdpwr/index.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jiachenchen322/swdpwr"
        }
    ],
    "name": "swdpwr",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CMPB.2021.106522",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Background and objective:The stepped wedge cluster randomized trial is a study design increasingly used in a wide variety of settings, including public health intervention evaluations, clinical and health service research. Previous studies presenting power calculation methods for stepped wedge designs have focused on continuous outcomes and relied on normal approximations for binary outcomes. These approximations for binary outcomes may or may not be accurate, depending on whether or not the normal approximation to the binomial distribution is reasonable. Although not always accurate, such approximation methods have been widely used for binary outcomes. To improve the approximations for binary outcomes, two new methods for stepped wedge designs (SWDs) of binary outcomes have recently been published. However, these new methods have not been implemented in publicly available software. The objective of this paper is to present power calculation software for SWDs in various settings for both continuous and binary outcomes. Methods: We have developed a SAS macro %swdpwr, an R package swdpwr and a Shiny app for power calculations in SWDs. Different scenarios including cross-sectional and cohort designs, binary and continuous outcomes, marginal and conditional models, three link functions, with and without time effects under exchangeable, nested exchangeable and block exchangeable correlation structures are accommodated in this software. Unequal numbers of clusters per sequence are also allowed. Power calculations for a closed cohort employ a block exchangeable within-cluster correlation structure that accounts for three intracluster (intraclass) correlations: the within-period, between-period, and within-individual correlations. Cross-sectional cohorts allow for nested exchangeable or exchangeable correlation structures defined by the within-period and the between-period intracluster correlations only. Our software assumes a complete design and equal cluster-period sizes. While the methods accommodate correlation structures of constant within-period intracluster correlation coefficient (ICC) as well as a different within- and between-period ICC, it does not allow the between-period ICC to decay. Results: swdpwr provides an efficient tool to support investigators in the design and analysis of stepped wedge cluster randomized trials. swdpwr addresses the implementation gap between newly proposed methodology and their application to obtain more accurate power calculations in SWDs. Conclusions: In an effort to make computationally efficient (and non-simulation-based) power methods under both the cross-sectional and closed-cohort designs for continuous and binary outcomes more accessible, we have developed this user-friendly software. swdpwr is implemented under two platforms: SAS and R, satisfying the needs of investigators from various backgrounds. Additionally, the Shiny app enables users who are not able to use SAS or R to implement these methods online straightforwardly.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Spiegelman D."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "swdpwr: A SAS macro and an R package for power calculations in stepped wedge cluster randomized trials"
            },
            "pmcid": "PMC8665077",
            "pmid": "34818620"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
