{
    "additionDate": "2021-01-18T12:36:46Z",
    "biotoolsCURIE": "biotools:emtome",
    "biotoolsID": "emtome",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mwendt@purdue.edu",
            "name": "Michael K. Wendt",
            "typeEntity": "Person"
        }
    ],
    "description": "a resource for pan-cancer analysis of epithelial-mesenchymal transition genes and signatures.\n\nresource for metastatic research.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.emtome.org",
    "lastUpdate": "2021-03-07T10:43:07Z",
    "name": "EMTome",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1158/1535-7163.MCT-16-0136",
            "metadata": {
                "abstract": "©2016 AACR.Therapeutic targeting of late-stage breast cancer is limited by an inadequate understanding of how tumor cell signaling evolves during metastatic progression and by the currently available small molecule inhibitors capable of targeting these processes. Herein, we demonstrate that both β3 integrin and fibroblast growth factor receptor-1 (FGFR1) are part of an epithelial-mesenchymal transition (EMT) program that is required to facilitate metastatic outgrowth in response to fibroblast growth factor-2 (FGF2). Mechanistically, β3 integrin physically disrupts an interaction between FGFR1 and E-cadherin, leading to a dramatic redistribution of FGFR1 subcellular localization, enhanced FGF2 signaling and increased three-dimensional (3D) outgrowth of metastatic breast cancer cells. This ability of β3 integrin to drive FGFR signaling requires the enzymatic activity of focal adhesion kinase (FAK). Consistent with these mechanistic data, we demonstrate that FGFR, β3 integrin, and FAK constitute a molecular signature capable of predicting decreased survival of patients with the basal-like subtype of breast cancer. Importantly, covalent targeting of a conserved cysteine in the P-loop of FGFR1-4 with our newly developed small molecule, FIIN-4, more effectively blocks 3D metastatic outgrowth as compared with currently available FGFR inhibitors. In vivo application of FIIN-4 potently inhibited the growth of metastatic, patient-derived breast cancer xenografts and murine-derived metastases growing within the pulmonary microenvironment. Overall, the current studies demonstrate that FGFR1 works in concert with other EMT effector molecules to drive aberrant downstream signaling, and that these events can be effectively targeted using our novel therapeutics for the treatment of the most aggressive forms of breast cancer.",
                "authors": [
                    {
                        "name": "Brown W.S."
                    },
                    {
                        "name": "Gray N.S."
                    },
                    {
                        "name": "Smith A."
                    },
                    {
                        "name": "Tan L."
                    },
                    {
                        "name": "Wendt M.K."
                    }
                ],
                "citationCount": 37,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Molecular Cancer Therapeutics",
                "title": "Covalent targeting of fibroblast growth factor receptor inhibits metastatic breast cancer"
            },
            "pmcid": "PMC5010989",
            "pmid": "33299129"
        }
    ],
    "topic": [
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
