{
    "accessibility": "Open access",
    "additionDate": "2022-01-03T07:43:44.017144Z",
    "biotoolsCURIE": "biotools:y-lineagetracker",
    "biotoolsID": "y-lineagetracker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xushua@picb.ac.cn",
            "name": "Shuhua Xu",
            "orcidid": "https://orcid.org/0000-0002-1975-1002",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Y-LineageTracker is a high-throughput analysis framework for Y-chromosomal next-generation sequencing data. Y-LineageTracker provides a framework to fully analyze human Y-chromosome sequencing data. Y-LineageTracker supports most of analyses of Y-chromosome sequencing data and facilitates subsequent studies of NRY haplogroups and Y-STRs. In brief, analyses of NRY haplogroup include haplogroup classification, clustering, phylogeny construction and estimating divergence time of haplogroups, and analyses of Y-STR include Y-STR genotyping, statistical analysis, network analysis and estimating TMRCA of Y-STR haplotypes.",
    "download": [
        {
            "type": "Source code",
            "url": "https://www.picb.ac.cn/PGG/resource_download.php?id=40&file=PGG_Web_Soft/Y-LineageTracker.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://www.picb.ac.cn/PGG/resource.php",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-03T07:43:44.019838Z",
    "name": "Y-LineageTracker",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04057-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Y-chromosome DNA (Y-DNA) has been used for tracing paternal lineages and offers a clear path from an individual to a known, or likely, direct paternal ancestor. The advance of next-generation sequencing (NGS) technologies increasingly improves the resolution of the non-recombining region of the Y-chromosome (NRY). However, a lack of suitable computer tools prevents the use of NGS data from the Y-DNA studies. Results: We developed Y-LineageTracker, a high-throughput analysis framework that not only utilizes state-of-the-art methodologies to automatically determine NRY haplogroups and identify microsatellite variants of Y-chromosome on a fine scale, but also optimizes comprehensive Y-DNA analysis methods for NGS data. Notably, Y-LineageTracker integrates the NRY haplogroup and Y-STR analysis modules with recognized strategies to robustly suggest an interpretation for paternal genetics and evolution. NRY haplogroup module mainly covers haplogroup classification, clustering analysis, phylogeny construction, and divergence time estimation of NRY haplogroups, and Y-STR module mainly includes Y-STR genotyping, statistical calculation, network analysis, and estimation of time to the most recent common ancestor (TMRCA) based on Y-STR haplotypes. Performance comparison indicated that Y-LineageTracker outperformed existing Y-DNA analysis tools for the high performance and satisfactory visualization effect. Conclusions: Y-LineageTracker is an open-source and user-friendly command-line tool that provide multiple functions to efficiently analyze Y-DNA from NGS data at both Y-SNP and Y-STR level. Additionally, Y-LineageTracker supports various formats of input data and produces high-quality figures suitable for publication. Y-LineageTracker is coded with Python3 and supports Windows, Linux, and macOS platforms, and can be installed manually or via the Python Package Index (PyPI). The source code, examples, and manual of Y-LineageTracker are freely available at https://www.picb.ac.cn/PGG/resource.php or CodeOcean (https://codeocean.com/capsule/7424381/tree).",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Lu Y."
                    },
                    {
                        "name": "Lu D."
                    },
                    {
                        "name": "Xu S."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Y-LineageTracker: a high-throughput analysis framework for Y-chromosomal next-generation sequencing data"
            },
            "pmcid": "PMC7941695",
            "pmid": "33750289",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ]
}