{
    "additionDate": "2021-01-18T09:49:45Z",
    "biotoolsCURIE": "biotools:albatradis",
    "biotoolsID": "albatradis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sarah.bastkowski@quadram.ac.uk",
            "name": "Sarah Bastkowski",
            "orcidid": "https://orcid.org/0000-0001-9002-1822",
            "typeEntity": "Person"
        }
    ],
    "description": "AlbaTraDIS is a software application for performing rapid large-scale comparative analysis of TraDIS experiments whilst also predicting the impact of inserts on nearby genes. It allows for experiements with multiple conditions to be easily analysed using statistical methods developed in the Bio-TraDIS toolkit.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "DNA transcription",
                    "uri": "http://edamontology.org/operation_0372"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Transposon prediction",
                    "uri": "http://edamontology.org/operation_0427"
                }
            ]
        }
    ],
    "homepage": "https://github.com/quadram-institute-bioscience/albatradis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-21T16:27:04Z",
    "license": "GPL-3.0",
    "name": "AlbaTraDIS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007980",
            "metadata": {
                "abstract": "© 2020 Page et al.Bacteria need to survive in a wide range of environments. Currently, there is an incomplete understanding of the genetic basis for mechanisms underpinning survival in stressful conditions, such as the presence of anti-microbials. Transposon directed insertion-site sequencing (TraDIS) is a powerful tool to identify genes and networks which are involved in survival and fitness under a given condition by simultaneously assaying the fitness of millions of mutants, thereby relating genotype to phenotype and contributing to an understanding of bacterial cell biology. A recent refinement of this approach allows the roles of essential genes in conditional stress survival to be inferred by altering their expression. These advancements combined with the rapidly falling costs of sequencing now allows comparisons between multiple experiments to identify commonalities in stress responses to different conditions. This capacity however poses a new challenge for analysis of multiple data sets in conjunction. To address this analysis need, we have developed 'AlbaTraDIS'; a software application for rapid large-scale comparative analysis of TraDIS experiments that predicts the impact of transposon insertions on nearby genes. AlbaTraDIS can identify genes which are up or down regulated, or inactivated, between multiple conditions, producing a filtered list of genes for further experimental validation as well as several accompanying data visualisations. We demonstrate the utility of our new approach by applying it to identify genes used by Escherichia coli to survive in a wide range of different concentrations of the biocide Triclosan. AlbaTraDIS identified all well characterised Triclosan resistance genes, including the primary target, fabI. A number of new loci were also implicated in Triclosan resistance and the predicted phenotypes for a selection of these were validated experimentally with results being consistent with predictions. AlbaTraDIS provides a simple and rapid method to analyse multiple transposon mutagenesis data sets allowing this technology to be used at large scale. To our knowledge this is the only tool currently available that can perform these tasks. AlbaTraDIS is written in Python 3 and is available under the open source licence GNU GPL 3 from https://github.com/quadram-institute-bioscience/albatradis. Copyright:",
                "authors": [
                    {
                        "name": "Bastkowski S."
                    },
                    {
                        "name": "Charles I.G."
                    },
                    {
                        "name": "Le Viet T."
                    },
                    {
                        "name": "Page A.J."
                    },
                    {
                        "name": "Savva G.M."
                    },
                    {
                        "name": "Turner A.K."
                    },
                    {
                        "name": "Webber M.A."
                    },
                    {
                        "name": "Yasir M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "AlbaTraDIS: Comparative analysis of large datasets from parallel transposon mutagenesis experiments"
            },
            "pmcid": "PMC7390408",
            "pmid": "32678849"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        }
    ],
    "validated": 1
}
