{
    "additionDate": "2018-06-20T15:54:02Z",
    "biotoolsCURIE": "biotools:ipromoter-2l",
    "biotoolsID": "ipromoter-2l",
    "credit": [
        {
            "email": "bliu@hit.edu.cn",
            "name": "Bin Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Two-layer predictor for identifying promoters and their types by multi-window-based PseKNC.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.hitsz.edu.cn/iPromoter-2L/readme/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.hitsz.edu.cn/iPromoter-2L/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "iPromoter-2L",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx579",
            "metadata": {
                "abstract": "© 2017 The Author.Motivation: Being responsible for initiating transaction of a particular gene in genome, promoter is a short region of DNA. Promoters have various types with different functions. Owing to their importance in biological process, it is highly desired to develop computational tools for timely identifying promoters and their types. Such a challenge has become particularly critical and urgent in facing the avalanche of DNA sequences discovered in the postgenomic age. Although some prediction methods were developed, they can only be used to discriminate a specific type of promoters from non-promoters. None of them has the ability to identify the types of promoters. This is due to the facts that different types of promoters may share quite similar consensus sequence pattern, and that the promoters of same type may have considerably different consensus sequences. Results: To overcome such difficulty, using the multi-window-based PseKNC (pseudo K-tuple nucleotide composition) approach to incorporate the short-, middle-, and long-range sequence information, we have developed a two-layer seamless predictor named as 'iPromoter-2 L'. The first layer serves to identify a query DNA sequence as a promoter or non-promoter, and the second layer to predict which of the following six types the identified promoter belongs to: σ24, σ28, σ32, σ38, σ54 and σ70.",
                "authors": [
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Huang D.-S."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Yang F."
                    }
                ],
                "citationCount": 189,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IPromoter-2L: A two-layer predictor for identifying promoters and their types by multi-window-based PseKNC"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
