{
    "additionDate": "2021-01-18T07:35:45Z",
    "biotoolsCURIE": "biotools:mimicknet",
    "biotoolsID": "mimicknet",
    "confidence_flag": "tool",
    "description": "MimickNet, Mimicking Clinical Image Post- Processing Under Black-Box Constraints.\n\nThe above is a cineloop of cardiac data with conventional delay-and-sum beamforming and ReFoCUS beamforming. We apply clinical-grade post-processing, MimickNet post-processing, and show the unscaled difference between the two.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ouwen/MimickNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T08:00:10Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ouwen/mimicknet"
        }
    ],
    "name": "MimickNet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TMI.2020.2970867",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.Image post-processing is used in clinical-grade ultrasound scanners to improve image quality (e.g., reduce speckle noise and enhance contrast). These post-processing techniques vary across manufacturers and are generally kept proprietary, which presents a challenge for researchers looking to match current clinical-grade workflows. We introduce a deep learning framework, MimickNet, that transforms conventional delay-and-summed (DAS) beams into the approximate Dynamic Tissue Contrast Enhanced (DTCE™) post-processed images found on Siemens clinical-grade scanners. Training MimickNet only requires post-processed image samples from a scanner of interest without the need for explicit pairing to DAS data. This flexibility allows MimickNet to hypothetically approximate any manufacturer's post-processing without access to the pre-processed data. MimickNet post-processing achieves a 0.940 ± 0.018 structural similarity index measurement (SSIM) compared to clinical-grade post-processing on a 400 cine-loop test set, 0.937 ± 0.025 SSIM on a prospectively acquired dataset, and 0.928 ± 0.003 SSIM on an out-of-distribution cardiac cine-loop after gain adjustment. To our knowledge, this is the first work to establish deep learning models that closely approximate ultrasound post-processing found in current medical practice. MimickNet serves as a clinical post-processing baseline for future works in ultrasound image formation to compare against. Additionally, it can be used as a pretrained model for fine-tuning towards different post-processing techniques. To this end, we have made the MimickNet software, phantom data, and permitted in vivo data open-source at https://github.com/ouwen/MimickNet.",
                "authors": [
                    {
                        "name": "Huang O."
                    },
                    {
                        "name": "Long W."
                    },
                    {
                        "name": "Bottenus N."
                    },
                    {
                        "name": "Lerendegui M."
                    },
                    {
                        "name": "Trahey G.E."
                    },
                    {
                        "name": "Farsiu S."
                    },
                    {
                        "name": "Palmeri M.L."
                    }
                ],
                "citationCount": 8,
                "date": "2020-06-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "MimickNet, Mimicking Clinical Image Post- Processing under Black-Box Constraints"
            },
            "pmcid": "PMC7286793",
            "pmid": "32012003"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}