{
    "accessibility": "Open access",
    "additionDate": "2022-07-26T21:31:21.958044Z",
    "biotoolsCURIE": "biotools:mvib",
    "biotoolsID": "mvib",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "filippo.grazioli@neclab.eu",
            "name": "Filippo Grazioli",
            "orcidid": "https://orcid.org/0000-0001-8888-133X",
            "typeEntity": "Person"
        },
        {
            "name": "Giampaolo Pileggi"
        },
        {
            "name": "Andrea Meiser",
            "orcidid": "https://orcid.org/0000-0002-9666-8456"
        },
        {
            "name": "Andreas Henschel",
            "orcidid": "https://orcid.org/0000-0003-1386-5372"
        }
    ],
    "description": "Microbiome-based disease prediction with multimodal variational information bottlenecks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nec-research/microbiome-mvib",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-26T21:31:21.960481Z",
    "license": "MIT",
    "name": "MVIB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1010050",
            "metadata": {
                "abstract": "Copyright: © 2022 Grazioli et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Scientific research is shedding light on the interaction of the gut microbiome with the human host and on its role in human health. Existing machine learning methods have shown great potential in discriminating healthy from diseased microbiome states. Most of them leverage shotgun metagenomic sequencing to extract gut microbial species-relative abundances or strain-level markers. Each of these gut microbial profiling modalities showed diagnostic potential when tested separately; however, no existing approach combines them in a single predictive framework. Here, we propose the Multimodal Variational Information Bottleneck (MVIB), a novel deep learning model capable of learning a joint representation of multiple heterogeneous data modalities. MVIB achieves competitive classification performance while being faster than existing methods. Additionally, MVIB offers interpretable results. Our model adopts an information theoretic interpretation of deep neural networks and computes a joint stochastic encoding of different input data modalities. We use MVIB to predict whether human hosts are affected by a certain disease by jointly analysing gut microbial species-relative abundances and strain-level markers. MVIB is evaluated on human gut metagenomic samples from 11 publicly available disease cohorts covering 6 different diseases. We achieve high performance (0.80 < ROC AUC < 0.95) on 5 cohorts and at least medium performance on the remaining ones. We adopt a saliency technique to interpret the output of MVIB and identify the most relevant microbial species and strain-level markers to the model’s predictions. We also perform cross-study generalisation experiments, where we train and test MVIB on different cohorts of the same disease, and overall we achieve comparable results to the baseline approach, i.e. the Random Forest. Further, we evaluate our model by adding metabolomic data derived from mass spectrometry as a third input modality. Our method is scalable with respect to input data modalities and has an average training time of < 1.4 seconds. The source code and the datasets used in this work are publicly available.",
                "authors": [
                    {
                        "name": "Alqassem I."
                    },
                    {
                        "name": "Grazioli F."
                    },
                    {
                        "name": "Henschel A."
                    },
                    {
                        "name": "Meiser A."
                    },
                    {
                        "name": "Pileggi G."
                    },
                    {
                        "name": "Siarheyeu R."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Microbiome-based disease prediction with multimodal variational information bottlenecks"
            },
            "pmcid": "PMC9022840",
            "pmid": "35404958"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
