
{
    "credit": [
        {
            "email": "smooney@buckinstitute.org",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.mutdb.org/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                },
                {
                    "term": "Structure database search",
                    "uri": "http://edamontology.org/operation_0339"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Gene structure",
                "uri": "http://edamontology.org/topic_0114"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Non-synonymous single nucleotide polymorphisms (SNPs) and mutations have been associated with human phenotypes and disease. As more and more SNPs are mapped to phenotypes, understanding how these variations affect the function and expression of genes and gene products becomes an important endeavor. We have developed a set of tools to aid in the understanding of how amino acid substitutions affect protein structures. To do this, we have annotated SNPs in dbSNP and amino acid substitutions in Swiss-Prot with protein structural information, if available. We then developed a novel web interface to this data that allows for visualization of the location of these substitutions. We have also developed a web service interface to the dataset and developed interactive plugins for UCSF's Chimera structural modeling tool and PyMOL that integrate our annotations with these sophisticated structural visualization and modeling tools. The web services portal and plugins can be downloaded from http://www.lifescienceweb.org/ and the web interface is at http://www.mutdb.org/. © 2005 Oxford University Press.",
            "authors": [
                "Dantzer J.",
                "Moad C.",
                "Heiland R.",
                "Mooney S."
            ],
            "cit_count": 36,
            "journal": "Nucleic Acids Research",
            "pmid": "15980479",
            "title": "MutDB services: Interactive structural analysis of mutation data",
            "year": "2005-07-01"
        },
        {
            "abstract": "Summary: We have developed a resource, MutDB ((http://mutdb.org/), to aid in determining which single nucleotide polymorphisms (SNPs) are likely to alter the function of their associated protein product. MutDB contains protein structure annotations and comparative genomic annotations for 8000 disease-associated mutations and SNPs found in the UCSC Annotated Genome and the human RefSeq gene set. MutDB provides interactive mutation maps at the gene and protein levels, and allows for ranking of their predicted functional consequences based on conservation in multiple sequence alignments.",
            "authors": [
                "Mooney S.D.",
                "Altman R.B."
            ],
            "cit_count": 34,
            "journal": "Bioinformatics",
            "pmid": "14512363",
            "title": "MutDB: Annotating human variation with functionally relevant data",
            "year": "2003-09-22"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mutdb",
        "biotoolsID": "mutdb",
        "description": "Database that associates protein structural information with mutations and polymorphisms in gene sequences. The data is derived from dbSNP and Swiss-Prot, and can be browsed by gene name or searched by keyword or by various identifiers.",
        "homepage": "http://www.mutdb.org/",
        "name": "MutDB"
    }
}