{
    "additionDate": "2016-03-03T13:46:09Z",
    "biotoolsCURIE": "biotools:repetita",
    "biotoolsID": "repetita",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "place@holder.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Protein solenoid repeat detection from sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://protein.bio.unipd.it/services"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://protein.bio.unipd.it/services",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "Repetita",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp232",
            "metadata": {
                "abstract": "Motivation: Proteins with solenoid repeats evolve more quickly than non-repetitive ones and their periodicity may be rapidly hidden at sequence level, while still evident in structure. In order to identify these repeats, we propose here a novel method based on a metric characterizing amino-acid properties (polarity, secondary structure, molecular volume, codon diversity, electric charge) using five previously derived numerical functions. Results: The five spectra of the candidate sequences coding for structural repeats, obtained by Discrete Fourier Transform (DFT), show common features allowing determination of repeat periodicity with excellent results. Moreover it is possible to introduce a phase space parameterized by two quantities related to the Fourier spectra which allow for a clear distinction between a non-homologous set of globular proteins and proteins with solenoid repeats. The DFT method is shown to be competitive with other state of the art methods in the detection of solenoid structures, while improving its performance especially in the identification of periodicities, since it is able to recognize the actual repeat length in most cases. Moreover it highlights the relevance of local structural propensities in determining solenoid repeats. © 2009 The Author(s).",
                "authors": [
                    {
                        "name": "Marsella L."
                    },
                    {
                        "name": "Sirocco F."
                    },
                    {
                        "name": "Trovato A."
                    },
                    {
                        "name": "Seno F."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 46,
                "date": "2009-06-09T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "REPETITA: Detection and discrimination of the periodicity of protein solenoid repeats by discrete Fourier transform"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}