{"credit":[{"email":"mizrachi@ncbi.nlm.nih.gov","name":"Ilene Karsch-Mizrachi","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://www.ncbi.nlm.nih.gov/books/NBK54016/"}],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Data retrieval","uri":"http://edamontology.org/operation_2422"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}]}],"labels":{"language":["SQL"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Sample collections","uri":"http://edamontology.org/topic_3277"},{"term":"Database management","uri":"http://edamontology.org/topic_3489"},{"term":"Model organisms","uri":"http://edamontology.org/topic_0621"},{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"Transcriptomics","uri":"http://edamontology.org/topic_3308"}]},"publication":[{"abstract":"As the volume and complexity of data sets archived at NCBI grow rapidly, so does the need to gather and organize the associated metadata. Although metadata has been collected for some archival databases, previously, there was no centralized approach at NCBI for collecting this information and using it across databases. The BioProject database was recently established to facilitate organization and classification of project data submitted to NCBI, EBI and DDBJ databases. It captures descriptive information about research projects that result in high volume submissions to archival databases, ties together related data across multiple archives and serves as a central portal by which to inform users of data availability. Concomitantly, the BioSample database is being developed to capture descriptive information about the biological samples investigated in projects. BioProject and BioSample records link to corresponding data stored in archival repositories. Submissions are supported by a web-based Submission Portal that guides users through a series of forms for input of rich metadata describing their projects and samples. Together, these databases offer improved ways for users to query, locate, integrate and interpret the masses of data held in NCBI's archival repositories. The BioProject and BioSample databases are available at http://www.ncbi.nlm.nih.gov/bioproject and http://www .ncbi.nlm.nih.gov/biosample, respectively.","authors":["Barrett T.","Clark K.","Gevorgyan R.","Gorelenkov V.","Gribov E.","Karsch-Mizrachi I.","Kimelman M.","Pruitt K.D.","Resenchuk S.","Tatusova T.","Yaschenko E.","Ostell J."],"cit_count":107,"journal":"Nucleic Acids Research","pmid":"22139929","title":"BioProject and BioSample databases at NCBI: Facilitating capture and organization of metadata","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:bioproject","biotoolsID":"bioproject","description":"Collection of biological data related to a single initiative, originating from a single organization or from a consortium. A record provides users a single place to find links to the diverse data types generated for that project.","homepage":"http://www.ncbi.nlm.nih.gov/bioproject","name":"BioProject"}}