{
    "accessibility": "Open access",
    "additionDate": "2023-09-04T17:05:03.841688Z",
    "biotoolsCURIE": "biotools:iatmecell",
    "biotoolsID": "iatmecell",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "description": "Identification of abnormal tumor microenvironment cells to predict the clinical outcomes in cancer based on cell-cell crosstalk network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hanjunwei-lab/iATMEcell",
    "language": [
        "R"
    ],
    "lastUpdate": "2023-09-04T17:05:03.844445Z",
    "name": "iATMEcell",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAD074",
            "metadata": {
                "abstract": "Interactions between Tumor microenvironment (TME) cells shape the unique growth environment, sustaining tumor growth and causing the immune escape of tumor cells. Nonetheless, no studies have reported a systematic analysis of cellular interactions in the identification of cancer-related TME cells. Here, we proposed a novel network-based computational method, named as iATMEcell, to identify the abnormal TME cells associated with the biological outcome of interest based on a cell窶田ell crosstalk network. In the method, iATMEcell first manually collected TME cell types from multiple published studies and obtained their corresponding gene signatures. Then, a weighted cell窶田ell crosstalk network was constructed in the context of a specific cancer bulk tissue transcriptome data, where the weight between cells reflects both their biological function similarity and the transcriptional dysregulated activities of gene signatures shared by them. Finally, it used a network propagation algorithm to identify significantly dysregulated TME cells. Using the cancer genome atlas (TCGA) Bladder Urothelial Carcinoma training set and two independent validation sets, we illustrated that iATMEcell could identify significant abnormal cells associated with patient survival and immunotherapy response. iATMEcell was further applied to a pan-cancer analysis, which revealed that four common abnormal immune cells play important roles in the patient prognosis across multiple cancer types. Collectively, we demonstrated that iATMEcell could identify potentially abnormal TME cells based on a cell窶田ell crosstalk network, which provided a new insight into understanding the effect of TME cells in cancer. iATMEcell is developed as an R package, which is freely available on GitHub (https://github.com/hanjunwei-lab/iATMEcell).",
                "authors": [
                    {
                        "name": "Cheng L."
                    },
                    {
                        "name": "Ge Q."
                    },
                    {
                        "name": "Han J."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Qiu J."
                    },
                    {
                        "name": "Sheng Y."
                    },
                    {
                        "name": "Wu J."
                    }
                ],
                "date": "2023-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "iATMEcell: identification of abnormal tumor microenvironment cells to predict the clinical outcomes in cancer based on cell窶田ell crosstalk network"
            },
            "pmid": "36864591"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
