{
    "additionDate": "2021-01-18T08:31:03Z",
    "biotoolsCURIE": "biotools:mptherm",
    "biotoolsID": "mptherm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gromiha@iitm.ac.in",
            "name": "M Michael Gromiha",
            "typeEntity": "Person"
        }
    ],
    "description": "Database for membrane protein thermodynamics for understanding folding and stability.\n\nMPTherm is a thermodynamic database of membrane proteins and their mutants, contains the thermodynamic data of membrane proteins collected from literature and ProThermDB database. Currently, we have data for around 7,000 mutations in more than 300 membrane proteins with several sequence-, structure-based features and membrane topology information. In addition, for each data we provide the exact location of data in the literature and these data cross linked with UniProt and PDB databases.",
    "documentation": [
        {
            "type": [
                "FAQ"
            ],
            "url": "https://www.iitm.ac.in/bioinfo/mptherm/faqs.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "http://www.iitm.ac.in/bioinfo/mptherm/",
    "language": [
        "JavaScript",
        "PHP",
        "SQL"
    ],
    "lastUpdate": "2021-03-01T09:26:32Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.iitm.ac.in/bioinfo/mptherm/stats.php"
        }
    ],
    "name": "MPTherm",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA064",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.The functions of membrane proteins (MPs) are attributed to their structure and stability. Factors influencing the stability of MPs differ from globular proteins due to the presence of membrane spanning regions. Thermodynamic data of MPs aid to understand the relationship among their structure, stability and function. Although a wealth of experimental data on thermodynamics of MPs are reported in the literature, there is no database available explicitly for MPs. In this work, we have developed a database for MP thermodynamics, MPTherm, which contains more than 7000 thermodynamic data from about 320 MPs. Each entry contains protein sequence and structural information, membrane topology, experimental conditions, thermodynamic parameters such as melting temperature, free energy, enthalpy etc. and literature information. MPTherm assists users to retrieve the data by using different search and display options. We have also provided the sequence and structure visualization as well as cross-links to UniProt and PDB databases. MPTherm database is freely available at http://www.iitm.ac.in/bioinfo/mptherm/. It is implemented in HTML, PHP, MySQL and JavaScript, and supports the latest versions of major browsers, such as Firefox, Chrome and Opera. MPTherm would serve as an effective resource for understanding the stability of MPs, development of prediction tools and identifying drug targets for diseases associated with MPs.",
                "authors": [
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Kulandaisamy A."
                    },
                    {
                        "name": "Sakthivel R."
                    }
                ],
                "citationCount": 1,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "MPTherm: Database for membrane protein thermodynamics for understanding folding and stability"
            },
            "pmid": "32337573"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}
