{
    "additionDate": "2024-01-23T11:55:01.541357Z",
    "biotoolsCURIE": "biotools:magmet",
    "biotoolsID": "magmet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dwishart@ualberta.ca",
            "name": "David S. Wishart",
            "orcidid": "https://orcid.org/0000-0002-3207-2434"
        }
    ],
    "description": "A fully automated web server for targeted nuclear magnetic resonance metabolomics of plasma and serum.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://magmet.ca",
    "lastUpdate": "2024-11-24T14:20:14.641779Z",
    "name": "MagMet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/mrc.5371",
            "metadata": {
                "abstract": "Nuclear magnetic resonance (NMR) spectral analysis of biofluids can be a time-consuming process, requiring the expertise of a trained operator. With NMR becoming increasingly popular in the field of metabolomics, there is a growing need to change this paradigm and to automate the process. Here we introduce MagMet, an online web server, that automates the processing and quantification of 1D 1H NMR spectra from biofluids—specifically, human serum/plasma metabolites, including those associated with inborn errors of metabolism (IEM). MagMet uses a highly efficient data processing procedure that performs automatic Fourier Transformation, phase correction, baseline optimization, chemical shift referencing, water signal removal, and peak picking/peak alignment. MagMet then uses the peak positions, linewidth information, and J-couplings from its own specially prepared standard metabolite reference spectral NMR library of 85 serum/plasma compounds to identify and quantify compounds from experimentally acquired NMR spectra of serum/plasma. MagMet employs linewidth adjustment for more consistent quantification of metabolites from higher field instruments and incorporates a highly efficient data processing procedure for more rapid and accurate detection and quantification of metabolites. This optimized algorithm allows the MagMet webserver to quickly detect and quantify 58 serum/plasma metabolites in 2.6 min per spectrum (when processing a dataset of 50–100 spectra). MagMet's performance was also assessed using spectra collected from defined mixtures (simulating other biofluids), with >100 previously measured plasma spectra, and from spiked serum/plasma samples simulating known IEMs. In all cases, MagMet performed with precision and accuracy matching the performance of human spectral profiling experts. MagMet is available at http://magmet.ca.",
                "authors": [
                    {
                        "name": "Assempour N."
                    },
                    {
                        "name": "Berjanskii M."
                    },
                    {
                        "name": "Cayuela A.S."
                    },
                    {
                        "name": "Dong Y."
                    },
                    {
                        "name": "Fresno R.V."
                    },
                    {
                        "name": "Gautam V."
                    },
                    {
                        "name": "Johnson M."
                    },
                    {
                        "name": "Lee B.L."
                    },
                    {
                        "name": "Lipfert M."
                    },
                    {
                        "name": "Mandal R."
                    },
                    {
                        "name": "Oler E."
                    },
                    {
                        "name": "Peters H."
                    },
                    {
                        "name": "Rout M."
                    },
                    {
                        "name": "Sajed T."
                    },
                    {
                        "name": "Shahin H."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 6,
                "date": "2023-12-01T00:00:00Z",
                "journal": "Magnetic Resonance in Chemistry",
                "title": "MagMet: A fully automated web server for targeted nuclear magnetic resonance metabolomics of plasma and serum"
            },
            "pmid": "37265034"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
