
{
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "lennart.martens@ugent.be",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence accession (protein)",
                        "uri": "http://edamontology.org/data_1096"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Proteolytic digest",
                        "uri": "http://edamontology.org/data_1238"
                    }
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BIG N2N",
            "Proteomics",
            "VIB",
            "Compomics",
            "UGent"
        ],
        "toolType": [
            "Workbench"
        ],
        "topic": [
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            }
        ]
    },
    "publication": [
        {
            "abstract": "We here present The Online Protein Processing Resource (TOPPR; http://iomics.ugent.be/toppr/), an online database that contains thousands of published proteolytically processed sites in human and mouse proteins. These cleavage events were identified with COmbinded FRActional DIagonal Chromatography proteomics technologies, and the resulting database is provided with full data provenance. Indeed, TOPPR provides an interactive visual display of the actual fragmentation mass spectrum that led to each identification of a reported processed site, complete with fragment ion annotations and search engine scores. Apart from warehousing and disseminating these data in an intuitive manner, TOPPR also provides an online analysis platform, including methods to analyze protease specificity and substrate-centric analyses. Concretely, TOPPR supports three ways to retrieve data: (i) the retrieval of all substrates for one or more cellular stimuli or assays; (ii) a substrate search by UniProtKB/Swiss-Prot accession number, entry name or description; and (iii) a motif search that retrieves substrates matching a user-defined protease specificity profile. The analysis of the substrates is supported through the presence of a variety of annotations, including predicted secondary structure, known domains and experimentally obtained 3D structure where available. Across substrates, substrate orthologs and conserved sequence stretches can also be shown, with iceLogo visualization provided for the latter. © The Author(s) 2012.",
            "authors": [
                "Colaert N.",
                "Maddelein D.",
                "Impens F.",
                "Van Damme P.",
                "Plasman K.",
                "Helsens K.",
                "Hulstaert N.",
                "Vandekerckhove J.",
                "Gevaert K.",
                "Martens L."
            ],
            "cit_count": 11,
            "doi": "10.1093/nar/gks998",
            "journal": "Nucleic Acids Research",
            "title": "The Online Protein Processing Resource (TOPPR): A database and analysis platform for protein processing events",
            "type": "Primary",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:toppr",
        "biotoolsID": "toppr",
        "description": "Online Protein Processing Resource",
        "homepage": "http://iomics.ugent.be/toppr/home.html",
        "name": "TOPPR",
        "version": [
            "1"
        ]
    }
}