{
    "additionDate": "2020-01-14T09:29:39Z",
    "biotoolsCURIE": "biotools:NPDS",
    "biotoolsID": "NPDS",
    "confidence_flag": "medium",
    "description": "2018 Annual Report of the American Association of Poison Control Centers' National Poison Data System (NPDS).\n\nIntroduction: This is the 36th Annual Report of the American Association of Poison Control Centers' (AAPCC) National Poison Data System (NPDS). As of 1 January, 2018, 55 of the nation's poison centers (PCs) uploaded case data automatically to NPDS. The upload interval was 7.72 [6.90, 12.0] (median [25%, 75%]) minutes, creating a near real-time national exposure and information database and surveillance system. Methods: We analyzed the case data tabulating specific indices from NPDS. The methodology was similar to that of previous years. Where changes were introduced, the differences are identified. Cases with medical outcomes of death were evaluated by a team of medical and clinical toxicologist reviewers using an ordinal scale of 1-6 to assess the Relative Contribution to Fatality (RCF) of the exposure.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'AAPCC'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31752545",
    "lastUpdate": "2020-01-14T09:29:39Z",
    "name": "NPDS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1080/15563650.2019.1677022",
            "metadata": {
                "abstract": "© 2019, © 2019 American Association of Poison Control Centers.Introduction: This is the 36th Annual Report of the American Association of Poison Control Centers’ (AAPCC) National Poison Data System (NPDS). As of 1 January, 2018, 55 of the nation’s poison centers (PCs) uploaded case data automatically to NPDS. The upload interval was 7.72 [6.90, 12.0] (median [25%, 75%]) minutes, creating a near real-time national exposure and information database and surveillance system. Methods: We analyzed the case data tabulating specific indices from NPDS. The methodology was similar to that of previous years. Where changes were introduced, the differences are identified. Cases with medical outcomes of death were evaluated by a team of medical and clinical toxicologist reviewers using an ordinal scale of 1-6 to assess the Relative Contribution to Fatality (RCF) of the exposure. Results: In 2018, 2,530,238 closed encounters were logged by NPDS: 2,099,751 human exposures, 57,017 animal exposures, 368,025 information requests, 5,346 human confirmed nonexposures, and 99 animal confirmed nonexposures. United States PCs also made 2,621,242 follow-up calls in 2018. Total encounters showed a 2.96% decline from 2017, while health care facility (HCF) human exposure cases remained nearly steady with a slight decrease of 0.261%. All information requests decreased by 15.5%, medication identification (Drug ID) requests decreased by 30.2%, and human exposure cases decreased by 0.729%. Human exposures with less serious outcomes have decreased 2.33% per year since 2008, while those with more serious outcomes (moderate, major or death) have increased 4.45% per year since 2000. Consistent with the previous year, the top 5 substance classes most frequently involved in all human exposures were analgesics (10.8%), household cleaning substances (7.28%), cosmetics/personal care products (6.53%), sedatives/hypnotics/antipsychotics (5.53%), and antidepressants (5.22%). For cases with more serious outcomes, sedative/hypnotics/antipsychotics exposures were the class that increased most rapidly, by 1,828 cases/year (9.21%/year) over the past 18 years. Over just the past 10 years (for cases with the most serious outcomes) antidepressant exposures increased most rapidly, by 1,887 cases/year (7.02%/year). The top 5 most common exposures in children age 5 years or less were cosmetics/personal care products (12.1%), household cleaning substances (10.7%), analgesics (9.04%), foreign bodies/toys/miscellaneous (6.87%), and topical preparations (4.69%). Drug identification requests comprised 18.2% of all information requests. NPDS documented 3,111 human exposures resulting in death; 2,582 (83.0%) of these were judged as related (RCF of 1-Undoubtedly responsible, 2-Probably responsible, or 3-Contributory). Conclusions: These data support the continued value of PC expertise and need for specialized medical toxicology information to manage more serious exposures. Unintentional and intentional exposures continue to be a significant cause of morbidity and mortality in the US. The near real-time status of NPDS represents a national public health resource to collect and monitor US exposure cases and information requests. The continuing mission of NPDS is to provide a nationwide infrastructure for surveillance for all types of exposures (e.g., foreign body, infectious, venomous, chemical agent, or commercial product), and the identification and tracking of significant public health events. NPDS is a model system for the near real-time surveillance of national and global public health.",
                "authors": [
                    {
                        "name": "Gummin D.D."
                    },
                    {
                        "name": "Mowry J.B."
                    },
                    {
                        "name": "Spyker D.A."
                    },
                    {
                        "name": "Brooks D.E."
                    },
                    {
                        "name": "Beuhler M.C."
                    },
                    {
                        "name": "Rivers L.J."
                    },
                    {
                        "name": "Hashem H.A."
                    },
                    {
                        "name": "Ryan M.L."
                    }
                ],
                "date": "2019-12-02T00:00:00Z",
                "journal": "Clinical Toxicology",
                "title": "2018 Annual Report of the American Association of Poison Control Centers’ National Poison Data System (NPDS): 36th Annual Report"
            },
            "pmid": "31752545"
        }
    ],
    "topic": [
        {
            "term": "Medical toxicology",
            "uri": "http://edamontology.org/topic_3415"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}