{
    "additionDate": "2020-01-14T19:54:03Z",
    "biotoolsCURIE": "biotools:MIMIC-CXR",
    "biotoolsID": "MIMIC-CXR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aewj@mit.edu",
            "name": "Alistair E. W. Johnson",
            "orcidid": "https://orcid.org/0000-0002-8735-3014",
            "typeEntity": "Person"
        }
    ],
    "description": "De-identified publicly available database of chest radiographs with free-text reports.\n\nIf you use the MIMIC-CXR Database in your work, please cite the following publication:.\n\nMIMIC-CXR: A large publicly available database of labeled chest radiographs. Johnson AEW, Pollard TJ, Berkowitz S, Greenbaum NR, Lungren MP, Deng C-Y, Mark RG, Horng S. arXiv.. Available from: https://arxiv.org",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://mimic-cxr.mit.edu",
    "lastUpdate": "2020-12-28T10:47:45Z",
    "name": "MIMIC-CXR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41597-019-0322-0",
            "metadata": {
                "abstract": "© 2019, The Author(s).Chest radiography is an extremely powerful imaging modality, allowing for a detailed inspection of a patient’s chest, but requires specialized training for proper interpretation. With the advent of high performance general purpose computer vision algorithms, the accurate automated analysis of chest radiographs is becoming increasingly of interest to researchers. Here we describe MIMIC-CXR, a large dataset of 227,835 imaging studies for 65,379 patients presenting to the Beth Israel Deaconess Medical Center Emergency Department between 2011–2016. Each imaging study can contain one or more images, usually a frontal view and a lateral view. A total of 377,110 images are available in the dataset. Studies are made available with a semi-structured free-text radiology report that describes the radiological findings of the images, written by a practicing radiologist contemporaneously during routine clinical care. All images and reports have been de-identified to protect patient privacy. The dataset is made freely available to facilitate and encourage a wide range of research in computer vision, natural language processing, and clinical data mining.",
                "authors": [
                    {
                        "name": "Johnson A.E.W."
                    },
                    {
                        "name": "Pollard T.J."
                    },
                    {
                        "name": "Berkowitz S.J."
                    },
                    {
                        "name": "Greenbaum N.R."
                    },
                    {
                        "name": "Lungren M.P."
                    },
                    {
                        "name": "Deng C.-Y."
                    },
                    {
                        "name": "Mark R.G."
                    },
                    {
                        "name": "Horng S."
                    }
                ],
                "citationCount": 31,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Data",
                "title": "MIMIC-CXR, a de-identified publicly available database of chest radiographs with free-text reports"
            },
            "pmcid": "PMC6908718",
            "pmid": "31831740"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1
}