
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "license": "MIT",
        "topic": [
            {
                "term": "Natural language processing",
                "uri": "http://edamontology.org/topic_0218"
            },
            {
                "term": "Ontology and terminology",
                "uri": "http://edamontology.org/topic_0089"
            },
            {
                "term": "Chemistry",
                "uri": "http://edamontology.org/topic_3314"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/materialsintelligence/matscholar"
        }
    ],
    "publication": [
        {
            "abstract": "Copyright © 2019 American Chemical Society.The number of published materials science articles has increased manyfold over the past few decades. Now, a major bottleneck in the materials discovery pipeline arises in connecting new results with the previously established literature. A potential solution to this problem is to map the unstructured raw text of published articles onto structured database entries that allow for programmatic querying. To this end, we apply text mining with named entity recognition (NER) for large-scale information extraction from the published materials science literature. The NER model is trained to extract summary-level information from materials science documents, including inorganic material mentions, sample descriptors, phase labels, material properties and applications, as well as any synthesis and characterization methods used. Our classifier achieves an accuracy (f1) of 87%, and is applied to information extraction from 3.27 million materials science abstracts. We extract more than 80 million materials-science-related named entities, and the content of each abstract is represented as a database entry in a structured format. We demonstrate that simple database queries can be used to answer complex \"meta-questions\" of the published literature that would have previously required laborious, manual literature searches to answer. All of our data and functionality has been made freely available on our Github (https://github.com/materialsintelligence/matscholar) and website (http://matscholar.com), and we expect these results to accelerate the pace of future materials science discovery.",
            "authors": [
                "Weston L.",
                "Tshitoyan V.",
                "Dagdelen J.",
                "Kononova O.",
                "Trewartha A.",
                "Persson K.A.",
                "Ceder G.",
                "Jain A."
            ],
            "cit_count": 1,
            "doi": "10.1021/ACS.JCIM.9B00470",
            "journal": "Journal of Chemical Information and Modeling",
            "pmid": "31361962",
            "title": "Named Entity Recognition and Normalization Applied to Large-Scale Information Extraction from the Materials Science Literature",
            "year": "2019-09-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:matscholar",
        "biotoolsID": "matscholar",
        "description": "Named Entity Recognition and Normalization Applied to Large-Scale Information Extraction from the Materials Science Literature | Public API for the Materials Scholar database | matscholar (Materials Scholar) is a Python library for materials-focused natural language processing (NLP). It is maintained by a team of researchers at UC Berkeley and Lawrence Berkeley National Laboratory as part of a project funded by the Toyota Research Institute",
        "homepage": "http://matscholar.com",
        "name": "matscholar"
    }
}