{
    "additionDate": "2017-01-13T13:14:26Z",
    "biotoolsCURIE": "biotools:ebcall",
    "biotoolsID": "ebcall",
    "credit": [
        {
            "email": "friend1ws@gmail.com",
            "name": "EBCall Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "EBCall is a software package for somatic mutation detection (including InDels). EBCall uses not only paired tumor/normal sequence data of a target sample, but also multiple non-paired normal reference samples for evaluating distribution of sequencing errors, which leads to an accurate mutaiton detection even in case of low sequencing depths and low allele frequencies.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/friend1ws/EBCall/blob/master/readMe.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "homepage": "https://github.com/friend1ws/EBCall",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2021-04-17T19:54:39Z",
    "name": "EBCall",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006791"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt126",
            "metadata": {
                "abstract": "Recent advances in high-throughput sequencing technologies have enabled a comprehensive dissection of the cancer genome clarifying a large number of somatic mutations in a wide variety of cancer types. A number of methods have been proposed for mutation calling based on a large amount of sequencing data, which is accomplished in most cases by statistically evaluating the difference in the observed allele frequencies of possible single nucleotide variants between tumours and paired normal samples. However, an accurate detection of mutations remains a challenge under low sequencing depths or tumour contents. To overcome this problem, we propose a novel method, Empirical Bayesian mutation Calling (https://github.com/friend1ws/EBCall), for detecting somatic mutations. Unlike previous methods, the proposed method discriminates somatic mutations from sequencing errors based on an empirical Bayesian framework, where the model parameters are estimated using sequencing data from multiple non-paired normal samples. Using 13 whole-exome sequencing data with 87.5-206.3 mean sequencing depths, we demonstrate that our method not only outperforms several existing methods in the calling of mutations with moderate allele frequencies but also enables accurate calling of mutations with low allele frequencies (10%) harboured within a minor tumour subpopulation, thus allowing for the deciphering of fine substructures within a tumour specimen. © 2013 The Author(s).",
                "authors": [
                    {
                        "name": "Shiraishi Y."
                    },
                    {
                        "name": "Sato Y."
                    },
                    {
                        "name": "Chiba K."
                    },
                    {
                        "name": "Okuno Y."
                    },
                    {
                        "name": "Nagata Y."
                    },
                    {
                        "name": "Yoshida K."
                    },
                    {
                        "name": "Shiba N."
                    },
                    {
                        "name": "Hayashi Y."
                    },
                    {
                        "name": "Kume H."
                    },
                    {
                        "name": "Homma Y."
                    },
                    {
                        "name": "Sanada M."
                    },
                    {
                        "name": "Ogawa S."
                    },
                    {
                        "name": "Miyano S."
                    }
                ],
                "citationCount": 103,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "An empirical Bayesian framework for somatic mutation detection from cancer genome sequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}