{"credit":[{"email":"sberri@illumina.com","name":"Stefano Berri","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/CNAnorm.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/CNAnorm_1.20.0.tar.gz"}],"function":[{"operation":[{"term":"Copy number estimation","uri":"http://edamontology.org/operation_3233"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"Oncology","uri":"http://edamontology.org/topic_2640"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"link":[{"type":"MIRROR","url":"http://www.r-project.org"}],"publication":[{"abstract":"Motivation: Comparison of read depths from next-generation sequencing between cancer and normal cells makes the estimation of copy number alteration (CNA) possible, even at very low coverage. However, estimating CNA from patients' tumour samples poses considerable challenges due to infiltration with normal cells and aneuploid cancer genomes. Here we provide a method that corrects contamination with normal cells and adjusts for genomes of different sizes so that the actual copy number of each region can be estimated. Results: The procedure consists of several steps. First, we identify the multi-modality of the distribution of smoothed ratios. Then we use the estimates of the mean (modes) to identify underlying ploidy and the contamination level, and finally we perform the correction. The results indicate that the method works properly to estimate genomic regions with gains and losses in a range of simulated data as well as in two datasets from lung cancer patients. It also proves a powerful tool when analysing publicly available data from two cell lines (HCC1143 and COLO829). © The Author 2011. Published by Oxford University Press. All rights reserved.","authors":["Gusnanto A.","Wood H.M.","Pawitan Y.","Rabbitts P.","Berri S."],"cit_count":89,"doi":"10.1093/bioinformatics/btr593","journal":"Bioinformatics","pmid":"22039209","title":"Correcting for cancer genome size and tumour cell content enables better estimation of copy number alterations from next-generation sequence data","type":"Primary","year":"2012-01-01"}],"summary":{"biotoolsCURIE":"biotools:cnanorm","biotoolsID":"cnanorm","description":"Performs ratio, GC content correction and normalization of data obtained using low coverage (one read every 100-10,000 bp) high troughput sequencing. It performs a \"discrete\" normalization looking for the ploidy of the genome. It will also provide tumour content if at least two ploidy states can be found.","homepage":"http://bioconductor.org/packages/release/bioc/html/CNAnorm.html","name":"CNAnorm","version":["1.20.0"]}}