{
    "additionDate": "2017-12-18T00:11:16Z",
    "biotoolsCURIE": "biotools:prodepth",
    "biotoolsID": "prodepth",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sunflower.kuicr.kyoto-u.ac.jp/"
        }
    ],
    "description": "Prodepth is an online prediction web server for the accurate prediction of residue depth from protein sequences only. It can be used to accurately identify the burial depth status of amino acid residues in a protein.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sunflower.kuicr.kyoto-u.ac.jp/~sjn/Prodepth/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://sunflower.kuicr.kyoto-u.ac.jp/~sjn/Prodepth/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/prodepth-predict-residue-depth-protein-sequences.html"
        }
    ],
    "name": "Prodepth",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0007072",
            "metadata": {
                "abstract": "Residue depth (RD) is a solvent exposure measure that complements the information provided by conventional accessible surface area (ASA) and describes to what extent a residue is buried in the protein structure space. Previous studies have established that RD is correlated with several protein properties, such as protein stability, residue conservation and amino acid types. Accurate prediction of RD has many potentially important applications in the field of structural bioinformatics, for example, facilitating the identification of functionally important residues, or residues in the folding nucleus, or enzyme active sites from sequence information. In this work, we introduce an efficient approach that uses support vector regression to quantify the relationship between RD and protein sequence. We systematically investigated eight different sequence encoding schemes including both local and global sequence characteristics and examined their respective prediction performances. For the objective evaluation of our approach, we used 5-fold cross-validation to assess the prediction accuracies and showed that the overall best performance could be achieved with a correlation coefficient (CC) of 0.71 between the observed and predicted RD values and a root mean square error (RMSE) of 1.74, after incorporating the relevant multiple sequence features. The results suggest that residue depth could be reliably predicted solely from protein primary sequences: local sequence environments are the major determinants, while global sequence features could influence the prediction performance marginally. We highlight two examples as a comparison in order to illustrate the applicability of this approach. We also discuss the potential implications of this new structural parameter in the field of protein structure prediction and homology modeling. This method might prove to be a powerful tool for sequence analysis. © 2009 Song et al.",
                "authors": [
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Tan H."
                    },
                    {
                        "name": "Mahmood K."
                    },
                    {
                        "name": "Law R.H.P."
                    },
                    {
                        "name": "Buckle A.M."
                    },
                    {
                        "name": "Webb G.I."
                    },
                    {
                        "name": "Akutsu T."
                    },
                    {
                        "name": "Whisstock J.C."
                    }
                ],
                "citationCount": 35,
                "date": "2009-09-17T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Prodepth: Predict residue depth by support vector regression approach from protein sequences only"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequences",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}