{
    "accessibility": "Open access",
    "additionDate": "2022-08-01T11:41:48.304880Z",
    "biotoolsCURIE": "biotools:dualgcn",
    "biotoolsID": "dualgcn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhangxg@tsinghua.edu.cn",
            "name": "Xuegong Zhang",
            "orcidid": "https://orcid.org/0000-0002-9684-5643",
            "typeEntity": "Person"
        },
        {
            "name": "Qiao Liu"
        },
        {
            "name": "Tianxing Ma"
        }
    ],
    "description": "A dual graph convolutional network model to predict cancer drug response. It takes chemical structure information of a drug and gene features of a cancer sample as inputs and outputs IC50.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/horsedayday/DualGCN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-08-01T11:41:48.308170Z",
    "license": "MIT",
    "name": "DualGCN",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04664-4",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Drug resistance is a critical obstacle in cancer therapy. Discovering cancer drug response is important to improve anti-cancer drug treatment and guide anti-cancer drug design. Abundant genomic and drug response resources of cancer cell lines provide unprecedented opportunities for such study. However, cancer cell lines cannot fully reflect heterogeneous tumor microenvironments. Transferring knowledge studied from in vitro cell lines to single-cell and clinical data will be a promising direction to better understand drug resistance. Most current studies include single nucleotide variants (SNV) as features and focus on improving predictive ability of cancer drug response on cell lines. However, obtaining accurate SNVs from clinical tumor samples and single-cell data is not reliable. This makes it difficult to generalize such SNV-based models to clinical tumor data or single-cell level studies in the future. Results: We present a new method, DualGCN, a unified Dual Graph Convolutional Network model to predict cancer drug response. DualGCN encodes both chemical structures of drugs and omics data of biological samples using graph convolutional networks. Then the two embeddings are fed into a multilayer perceptron to predict drug response. DualGCN incorporates prior knowledge on cancer-related genes and protein–protein interactions, and outperforms most state-of-the-art methods while avoiding using large-scale SNV data. Conclusions: The proposed method outperforms most state-of-the-art methods in predicting cancer drug response without the use of large-scale SNV data. These favorable results indicate its potential to be extended to clinical and single-cell tumor samples and advancements in precision medicine.",
                "authors": [
                    {
                        "name": "Jiang R."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Ma T."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Zhou M."
                    }
                ],
                "date": "2022-04-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DualGCN: a dual graph convolutional network model to predict cancer drug response"
            },
            "pmcid": "PMC9011932",
            "pmid": "35428192"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
