{"credit":[{"email":"andrewds@usc.edu","name":"Andrew Smith","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://smithlabresearch.org/"}],"documentation":[{"type":"GENERAL","url":"https://github.com/smithlabcode/Amordad"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"},{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Metagenomics","uri":"http://edamontology.org/topic_3174"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/amordad-1-0-database-engine-for-comparing-metagenomic-data.html"}],"publication":[{"abstract":"© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: Several technical challenges in metagenomic data analysis, including assembling metagenomic sequence data or identifying operational taxonomic units, are both significant and well known. These forms of analysis are increasingly cited as conceptually flawed, given the extreme variation within traditionally defined species and rampant horizontal gene transfer. Furthermore, computational requirements of such analysis have hindered content-based organization of metagenomic data at large scale. Results: In this article, we introduce the Amordad database engine for alignment-free, content-based indexing of metagenomic datasets. Amordad places the metagenome comparison problem in a geometric context, and uses an indexing strategy that combines random hashing with a regular nearest neighbor graph. This framework allows refinement of the database over time by continual application of random hash functions, with the effect of each hash function encoded in the nearest neighbor graph. This eliminates the need to explicitly maintain the hash functions in order for query efficiency to benefit from the accumulated randomness. Results on real and simulated data show that Amordad can support logarithmic query time for identifying similar metagenomes even as the database size reaches into the millions.","authors":["Behnam E.","Smith A.D."],"cit_count":5,"journal":"Bioinformatics","pmid":"24974201","title":"The Amordad database engine for metagenomics","year":"2014-10-13"}],"summary":{"biotoolsCURIE":"biotools:amordad","biotoolsID":"amordad","description":"Database engine for comparing metagenomic data at massive scale. It first obtains the sequence signature of metagenomes and organizes them as points in high dimensional space.","homepage":"http://smithlabresearch.org/software/amordad/","name":"Amordad"}}