{
    "additionDate": "2024-06-12T11:42:47.081643Z",
    "biotoolsCURIE": "biotools:crisprcleanr_webapp",
    "biotoolsID": "crisprcleanr_webapp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "francesco.iorio@fht.org",
            "name": "Francesco Iorio",
            "typeEntity": "Person"
        }
    ],
    "description": "an interactive web application for processing genome-wide pooled CRISPR-Cas9 viability screens.\n\nSummary A limitation of pooled CRISPR-Cas9 viability screens is the high false-positive rate in detecting essential genes arising from copy number-amplified (CNA) regions of the genome. To solve this issue, we developed CRISPRcleanR a computational method implemented as R python package and in a dockerized version. CRISPRcleanR detects and corrects biased responses to CRISPR-Cas9 targeting in an unsupervised fashion, accurately reducing false-positive signals, while maintaining sensitivity in identifying relevant genetic dependencies. Here, we present CRISPRcleanR WebApp , a web-based application enabling access to CRISPRcleanR through an intuitive graphical web-interface",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://crisprcleanr-webapp.fht.org/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-06-12T11:42:47.084108Z",
    "name": "CRISPRcleanR WebApp",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.crmeth.2022.100373",
            "metadata": {
                "abstract": "A limitation of pooled CRISPR-Cas9 screens is the high false-positive rate in detecting essential genes arising from copy-number-amplified genomics regions. To solve this issue, we previously developed CRISPRcleanR: a computational method implemented as R/python package and in a dockerized version. CRISPRcleanR detects and corrects biased responses to CRISPR-Cas9 targeting in an unsupervised fashion, accurately reducing false-positive signals while maintaining sensitivity in identifying relevant genetic dependencies. Here, we present CRISPRcleanRWebApp, a web application enabling access to CRISPRcleanR through an intuitive interface. CRISPRcleanRWebApp removes the complexity of R/python language user interactions; provides user-friendly access to a complete analytical pipeline, not requiring any data pre-processing and generating gene-level summaries of essentiality with associated statistical scores; and offers a range of interactively explorable plots while supporting a more comprehensive range of CRISPR guide RNAs’ libraries than the original package. CRISPRcleanRWebApp is available at https://crisprcleanr-webapp.fht.org/.",
                "authors": [
                    {
                        "name": "Anderson D.S."
                    },
                    {
                        "name": "Cremaschi P."
                    },
                    {
                        "name": "De Lucia R.R."
                    },
                    {
                        "name": "Fernandez C."
                    },
                    {
                        "name": "Iorio F."
                    },
                    {
                        "name": "Karakoc E."
                    },
                    {
                        "name": "Kluczynski K.H."
                    },
                    {
                        "name": "Mauri L."
                    },
                    {
                        "name": "Perron U."
                    },
                    {
                        "name": "Vinceti A."
                    }
                ],
                "citationCount": 2,
                "date": "2023-01-23T00:00:00Z",
                "journal": "Cell Reports Methods",
                "title": "An interactive web application for processing, correcting, and visualizing genome-wide pooled CRISPR-Cas9 screens"
            },
            "pmcid": "PMC9939378",
            "pmid": "36814834"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
