
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.mousebook.org/contact-us"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://www.mousebook.org/about/faq"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Format detection",
                    "uri": "http://edamontology.org/operation_3357"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Ontology and terminology",
                "uri": "http://edamontology.org/topic_0089"
            },
            {
                "term": "Zoology",
                "uri": "http://edamontology.org/topic_3500"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The MouseBook (http://www.mousebook.org) databases and web portal provide access to information about mutant mouse lines held as live or cryopreserved stocks at MRC Harwell. The MouseBook portal integrates curated information from the MRC Harwell stock resource, and other Harwell databases, with information from external data resources to provide value-added information above and beyond what is available through other routes such as International Mouse Stain Resource (IMSR). MouseBook can be searched either using an intuitive Google style free text search or using the Mammalian Phenotype (MP) ontology tree structure. Text searches can be on gene, allele, strain identifier (e.g. MGI ID) or phenotype term and are assisted by automatic recognition of term types and autocompletion of gene and allele names covered by the database. Results are returned in a tabbed format providing categorized results identified from each of the catalogs in MouseBook. Individual result lines from each catalog include information on gene, allele, chromosomal location and phenotype, and provide a simple click-through link to further information as well as ordering the strain. The infrastructure underlying MouseBook has been designed to be extensible, allowing additional data sources to be added and enabling other sites to make their data directly available through MouseBook. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Blake A.",
                "Pickford K.",
                "Greenaway S.",
                "Thomas S.",
                "Pickard A.",
                "Williamson C.M.",
                "Adams N.C.",
                "Walling A.",
                "Beck T.",
                "Fray M.",
                "Peters J.",
                "Weaver T.",
                "Brown S.D.M.",
                "Hancock J.M.",
                "Mallon A.-M."
            ],
            "cit_count": 12,
            "journal": "Nucleic Acids Research",
            "pmid": "19854936",
            "title": "MouseBook: An integrated portal of mouse resources",
            "year": "2009-10-23"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mousebook",
        "biotoolsID": "mousebook",
        "description": "The database and web portal provide access to information about mutant mouse lines held as live or cryopreserved stocks at MRC Harwell. It portal integrates curated information from the MRC Harwell stock resource, and other Harwell databases, with information from external data resources to provide value-added information.",
        "homepage": "http://www.mousebook.org/",
        "name": "Mousebook"
    }
}