{"credit":[{"email":"david.tamborero@upf.edu","name":"David Tamborero","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://bitbucket.org/bbglab/oncodriveclust/src/b1afee49a7571aa576026049fe9de4bdb7f00cad/README.md?at=master&fileviewer=file-view-default"}],"function":[{"operation":[{"term":"Enrichment analysis","uri":"http://edamontology.org/operation_3501"}]},{"operation":[{"term":"Protein modelling (mutation)","uri":"http://edamontology.org/operation_0331"}]},{"operation":[{"term":"Clustering","uri":"http://edamontology.org/operation_3432"}]}],"labels":{"language":["Python"],"toolType":["Library","Script"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Oncology","uri":"http://edamontology.org/topic_2640"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"}]},"link":[{"type":"REPOSITORY","url":"https://bitbucket.org/bbglab/oncodriveclust"}],"publication":[{"abstract":"Motivation: Gain-of-function mutations often cluster in specific protein regions, a signal that those mutations provide an adaptive advantage to cancer cells and consequently are positively selected during clonal evolution of tumours. We sought to determine the overall extent of this feature in cancer and the possibility to use this feature to identify drivers.Results: We have developed OncodriveCLUST, a method to identify genes with a significant bias towards mutation clustering within the protein sequence. This method constructs the background model by assessing coding-silent mutations, which are assumed not to be under positive selection and thus may reflect the baseline tendency of somatic mutations to be clustered. OncodriveCLUST analysis of the Catalogue of Somatic Mutations in Cancer retrieved a list of genes enriched by the Cancer Gene Census, prioritizing those with dominant phenotypes but also highlighting some recessive cancer genes, which showed wider but still delimited mutation clusters. Assessment of datasets from The Cancer Genome Atlas demonstrated that OncodriveCLUST selected cancer genes that were nevertheless missed by methods based on frequency and functional impact criteria. This stressed the benefit of combining approaches based on complementary principles to identify driver mutations. We propose OncodriveCLUST as an effective tool for that purpose. © The Author 2013.","authors":["Tamborero D.","Gonzalez-Perez A.","Lopez-Bigas N."],"cit_count":118,"doi":"10.1093/bioinformatics/btt395","journal":"Bioinformatics","pmid":"23884480","title":"OncodriveCLUST: Exploiting the positional clustering of somatic mutations to identify cancer genes","year":"2013-09-15"}],"summary":{"biotoolsCURIE":"biotools:oncodriveclust","biotoolsID":"oncodriveclust","description":"identify genes whose mutations are biased towards a large spatial clustering. This method is designed to exploit the feature that mutations in cancer genes, especially oncogenes, often cluster in particular positions of the protein.","homepage":"http://bg.upf.edu/group/projects/oncodrive-clust.php","name":"OncodriveCLUST"}}