{
    "accessibility": "Open access",
    "additionDate": "2024-02-05T15:19:47.599052Z",
    "biotoolsCURIE": "biotools:aqcalc",
    "biotoolsID": "aqcalc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "suvobrata.chakravarty@sdstate.edu",
            "name": "Suvobrata Chakravarty",
            "orcidid": "https://orcid.org/0000-0002-0044-3931",
            "typeEntity": "Person"
        },
        {
            "name": "Logan A Smith",
            "typeEntity": "Person"
        },
        {
            "name": "Maral Afshinpour",
            "typeEntity": "Person"
        }
    ],
    "description": "A web server that identifies weak molecular interactions in protein structures.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "PDB insertion code",
                        "uri": "http://edamontology.org/data_1856"
                    }
                }
            ],
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Salt bridge calculation",
                    "uri": "http://edamontology.org/operation_1839"
                }
            ]
        }
    ],
    "homepage": "https://aqcalcbiocomputing.com/",
    "lastUpdate": "2024-02-05T15:19:47.601696Z",
    "name": "AQcalc",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PRO.4762",
            "metadata": {
                "abstract": "Weak molecular interactions play an important role in protein structure and function. Computational tools that identify weak molecular interactions are, therefore, valuable for the study of proteins. Here, we present AQcalc, a web server (https://aqcalcbiocomputing.com/) that can be used to identify anion–quadrupole (AQ) interactions, which are weak interactions involving aromatic residue (Trp, Tyr, and Phe) ring edges and anions (Asp, Glu, and phosphate ion) both within proteins and at their interfaces (protein–protein, protein-nucleic acids, and protein–lipid bilayer). AQcalc identifies AQ interactions as well as clusters involving AQ, cation–π, and salt bridges, among others. Utilizing AQcalc we analyzed weak interactions in protein models, even in the absence of experimental structures, to understand the contributions of weak interactions to deleterious structural changes, including those associated with oncogenic and germline disease variants. We identified several deleterious variants with disrupted AQ interactions (comparable in frequency to cation–π disruptions). Amyloid fibrils utilize AQ to bury anions at frequencies that far exceed those observed for globular proteins. AQ interactions were detected three and five times more frequently than the hydrogen-bonded AQ (HBAQ) in fibril structures and protein–lipid bilayer interfaces, respectively. By contrast, AQ and HBAQ interactions were detected with similar frequencies in globular proteins. Collectively, these findings suggest AQcalc will be effective in facilitating fine structural analysis. As other web utilities designed to identify protein residue interaction networks do not report AQ interactions, wide use of AQcalc will enrich our understanding of residue interaction networks and facilitate hypothesis testing by identifying and experimentally characterizing these comparably weak but important interactions.",
                "authors": [
                    {
                        "name": "Afshinpour M."
                    },
                    {
                        "name": "Chakravarty S."
                    },
                    {
                        "name": "Smith L.A."
                    }
                ],
                "date": "2023-10-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "AQcalc: A web server that identifies weak molecular interactions in protein structures"
            },
            "pmcid": "PMC10503417",
            "pmid": "37596782"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
