{
    "additionDate": "2015-07-28T08:59:07Z",
    "biotoolsCURIE": "biotools:antar",
    "biotoolsID": "antar",
    "credit": [
        {
            "name": "binf.ku.dk",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "jeanwen@binf.ku.dk",
            "name": "Jiayu Wen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "krogh@binf.ku.dk",
            "name": "Anders Krogh",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Predict miRNA targets for human and mouse using the two predictive models: a model trained from microarry studies following transfection, and a model trained from PAR-CLIP datasets.",
    "documentation": [
        {
            "type": "General",
            "url": "http://servers.binf.ku.dk/antar/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://servers.binf.ku.dk/antar/index.php",
    "lastUpdate": "2019-09-04T08:37:32Z",
    "name": "Antar",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1261/rna.2387911",
            "metadata": {
                "abstract": "Microarray expression analyses following miRNA transfection/inhibition and, more recently, Argonaute cross-linked immunoprecipitation (CLIP)-seq assays have been used to detect miRNA target sites. CLIP and expression approaches measure differing stages of miRNA functioning-initial binding of the miRNP complex and subsequent message repression. We use nonparametric predictive models to characterize a large number of known target and flanking features, utilizing miRNA transfection, HITSCLIP, and PAR-CLIP data. In particular, we utilize the precise spatial information provided by CLIP-seq to analyze the predictive effect of target flanking features. We observe distinct target determinants between expression-based and CLIP-based data. Target flanking features such as flanking region conservation are an important AGO-binding determinant-we hypothesize that CLIP experiments have a preference for strongly bound miRNP-target interactions involving adjacent RNA-binding proteins that increase the strength of cross-linking. In contrast, seed-related features are major determinants in expression-based studies, but less so for CLIP-seq studies, and increased miRNA concentrations typical of transfection studies contribute to this difference. While there is a good overlap between miRNA targets detected by miRNA transfection and CLIP-seq, the detection of CLIP-seq targets is largely independent of the level of subsequent mRNA degradation. Also, models built using CLIP-seq data show strong predictive power between independent CLIP-seq data sets, but are not strongly predictive for expression change. Similarly, models built from expression data are not strongly predictive for CLIP-seq data sets, supporting the finding that the determinants of miRNA binding and mRNA degradation differ. Predictive models and results are available at http://servers.binf.ku.dk/antar/. Copyright © 2011 RNA Society.",
                "authors": [
                    {
                        "name": "Wen J."
                    },
                    {
                        "name": "Parker B.J."
                    },
                    {
                        "name": "Jacobsen A."
                    },
                    {
                        "name": "Krogh A."
                    }
                ],
                "citationCount": 47,
                "date": "2011-05-01T00:00:00Z",
                "journal": "RNA",
                "title": "MicroRNA transfection and AGO-bound CLIP-seq data sets reveal distinct determinants of miRNA action"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}