{
    "additionDate": "2018-10-31T18:18:47Z",
    "biotoolsCURIE": "biotools:trom",
    "biotoolsID": "trom",
    "credit": [
        {
            "email": "jli@stat.ucla.edu",
            "name": "Jingyi Jessica Li",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TROM (Transcriptome Overlap Measure) is an R package for comparing transcriptomes within or between different species, and provide a different perspective, in contrast to traditional correlation analyses, about capturing transcriptomic similarity.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.stat.ucla.edu/~jingyi.li/packages/TROM/TROM-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "http://www.stat.ucla.edu/~jingyi.li/software-and-data/trom.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/TROM/index.html"
        }
    ],
    "name": "TROM",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1007/s12561-016-9163-y",
            "metadata": {
                "abstract": "© 2016, International Chinese Statistical Association.Comparative transcriptomics has gained increasing popularity in genomic research thanks to the development of high-throughput technologies including microarray and next-generation RNA sequencing that have generated numerous transcriptomic data. An important question is to understand the conservation and divergence of biological processes in different species. We propose a testing-based method TROM (Transcriptome Overlap Measure) for comparing transcriptomes within or between different species, and provide a different perspective, in contrast to traditional correlation analyses, about capturing transcriptomic similarity. Specifically, the TROM method focuses on identifying associated genes that capture molecular characteristics of biological samples, and subsequently comparing the biological samples by testing the overlap of their associated genes. We use simulation and real data studies to demonstrate that TROM is more powerful in identifying similar transcriptomes and more robust to stochastic gene expression noise than Pearson and Spearman correlations. We apply TROM to compare the developmental stages of six Drosophila species, C. elegans, S. purpuratus, D. rerio and mouse liver, and find interesting correspondence patterns that imply conserved gene expression programs in the development of these species. The TROM method is available as an R package on CRAN (https://cran.r-project.org/package=TROM) with manuals and source codes available at http://www.stat.ucla.edu/~jingyi.li/software-and-data/trom.html.",
                "authors": [
                    {
                        "name": "Li W.V."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Li J.J."
                    }
                ],
                "citationCount": 3,
                "date": "2017-06-01T00:00:00Z",
                "journal": "Statistics in Biosciences",
                "title": "TROM: A Testing-Based Method for Finding Transcriptomic Similarity of Biological Samples"
            },
            "pmcid": "PMC5542419",
            "pmid": "28781712",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.3"
    ]
}