{"credit":[{"email":"sylvain@bigre.ulb.ac.be","name":"Sylvain Brohée","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"TRAINING_MATERIAL","url":"http://rsat.sb-roscoff.fr/tutorials/neat_tutorial/neat_tutorial.html"}],"function":[{"operation":[{"term":"Protein interaction network analysis","uri":"http://edamontology.org/operation_0276"},{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"},{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"},{"term":"Gene expression correlation analysis","uri":"http://edamontology.org/operation_3463"},{"term":"Weighted correlation network analysis","uri":"http://edamontology.org/operation_3766"}]}],"labels":{"accessibility":["Open access"],"cost":"Free of charge","license":"Apache-2.0","maturity":"Mature","operatingSystem":["Linux","Mac"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"}]},"publication":[{"abstract":"The network analysis tools (NeAT) (http://rsat.ulb.ac.be/neat/) provide a user-friendly web access to a collection of modular tools for the analysis of networks (graphs) and clusters (e.g. microarray clusters, functional classes, etc.). A first set of tools supports basic operations on graphs (comparison between two graphs, neighborhood of a set of input nodes, path finding and graph randomization). Another set of programs makes the connection between networks and clusters (graph-based clustering, cliques discovery and mapping of clusters onto a network). The toolbox also includes programs for detecting significant intersections between clusters/classes (e.g. clusters of co-expression versus functional classes of genes). NeAT are designed to cope with large datasets and provide a flexible toolbox for analyzing biological networks stored in various databases (protein interactions, regulation and metabolism) or obtained from high-throughput experiments (two-hybrid, mass-spectrometry and microarrays). The web interface interconnects the programs in predefined analysis flows, enabling to address a series of questions about networks of interest. Each tool can also be used separately by entering custom data for a specific analysis. NeAT can also be used as web services (SOAP/WSDL interface), in order to design programmatic workflows and integrate them with other available resources.","authors":["Brohee S.","Faust K.","Lima-Mendez G.","Sand O.","Janky R.","Vanderstocken G.","Deville Y.","van Helden J."],"cit_count":63,"journal":"Nucleic acids research","pmid":"18524799","title":"NeAT: a toolbox for the analysis of biological networks, clusters, classes and pathways.","year":"2008-01-01"}],"summary":{"biotoolsCURIE":"biotools:neat","biotoolsID":"neat","description":"Suite of tools for the analysis of biological networks, clusters, classes and pathways. Tools are available as web services for integration into programmatic work flows.","homepage":"http://rsat.sb-roscoff.fr/index_neat.html","name":"NeAT"}}