{
    "additionDate": "2020-01-14T19:50:37Z",
    "biotoolsCURIE": "biotools:deltascope",
    "biotoolsID": "deltascope",
    "confidence_flag": "tool",
    "description": "A new method to quantify 3D biological structures and identify differences in zebrafish forebrain development.\n\nResearch in the life sciences has traditionally relied on the analysis of clear morphological phenotypes, which are often revealed using increasingly powerful microscopy techniques analyzed as maximum intensity projections (MIPs). However, as biology turns towards the analysis of more subtle phenotypes, MIPs and qualitative approaches are failing to adequately describe these phenotypes. To address these limitations and quantitatively analyze the three-dimensional (3D) spatial relationships of biological structures, we developed the computational method and program called ΔSCOPE (Changes in Spatial Cylindrical Coordinate Orientation using PCA Examination).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/msschwartz21/deltascope",
    "lastUpdate": "2020-12-17T09:59:35Z",
    "name": "SCOPE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.YDBIO.2019.11.014",
            "metadata": {
                "abstract": "© 2020 The AuthorsResearch in the life sciences has traditionally relied on the analysis of clear morphological phenotypes, which are often revealed using increasingly powerful microscopy techniques analyzed as maximum intensity projections (MIPs). However, as biology turns towards the analysis of more subtle phenotypes, MIPs and qualitative approaches are failing to adequately describe these phenotypes. To address these limitations and quantitatively analyze the three-dimensional (3D) spatial relationships of biological structures, we developed the computational method and program called ΔSCOPE (Changes in Spatial Cylindrical Coordinate Orientation using PCA Examination). Our approach uses the fluorescent signal distribution within a 3D data set and reorients the fluorescent signal to a relative biological reference structure. This approach enables quantification and statistical analysis of spatial relationships and signal density in 3D multichannel signals that are positioned around a well-defined structure contained in a reference channel. We validated the application of ΔSCOPE by analyzing normal axon and glial cell guidance in the zebrafish forebrain and by quantifying the commissural phenotypes associated with abnormal Slit guidance cue expression in the forebrain. Despite commissural phenotypes which display disruptions to the reference structure, ΔSCOPE was able to detect subtle, previously uncharacterized changes in zebrafish forebrain midline crossing axons and glia. This method has been developed as a user-friendly, open source program. We propose that ΔSCOPE is an innovative approach to advancing the state of image quantification in the field of high resolution microscopy, and that the techniques presented here are of broad applications to the life science field.",
                "authors": [
                    {
                        "name": "Schwartz M.S."
                    },
                    {
                        "name": "Schnabl J."
                    },
                    {
                        "name": "Litz M.P.H."
                    },
                    {
                        "name": "Baumer B.S."
                    },
                    {
                        "name": "Barresi M."
                    }
                ],
                "date": "2020-04-15T00:00:00Z",
                "journal": "Developmental Biology",
                "title": "ΔSCOPE: A new method to quantify 3D biological structures and identify differences in zebrafish forebrain development"
            },
            "pmid": "31877274"
        }
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}