{
    "additionDate": "2021-01-18T09:20:21Z",
    "biotoolsCURIE": "biotools:deepcda",
    "biotoolsID": "deepcda",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "amasoudin@ut.ac.ir",
            "name": "Ali Masoudi-Nejad",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepCDA is a tool for Deep Cross-Domain Compound-Protein Affinity Prediction through LSTM and Convolutional Neural Network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LBBSoft/DeepCDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T15:35:32Z",
    "name": "DeepCDA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA544",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: An essential part of drug discovery is the accurate prediction of the binding affinity of new compound-protein pairs. Most of the standard computational methods assume that compounds or proteins of the test data are observed during the training phase. However, in real-world situations, the test and training data are sampled from different domains with different distributions. To cope with this challenge, we propose a deep learning-based approach that consists of three steps. In the first step, the training encoder network learns a novel representation of compounds and proteins. To this end, we combine convolutional layers and long-short-term memory layers so that the occurrence patterns of local substructures through a protein and a compound sequence are learned. Also, to encode the interaction strength of the protein and compound substructures, we propose a two-sided attention mechanism. In the second phase, to deal with the different distributions of the training and test domains, a feature encoder network is learned for the test domain by utilizing an adversarial domain adaptation approach. In the third phase, the learned test encoder network is applied to new compound-protein pairs to predict their binding affinity. Results: To evaluate the proposed approach, we applied it to KIBA, Davis and BindingDB datasets. The results show that the proposed method learns a more reliable model for the test domain in more challenging situations.",
                "authors": [
                    {
                        "name": "Abbasi K."
                    },
                    {
                        "name": "Razzaghi P."
                    },
                    {
                        "name": "Poso A."
                    },
                    {
                        "name": "Amanlou M."
                    },
                    {
                        "name": "Ghasemi J.B."
                    },
                    {
                        "name": "Masoudi-Nejad A."
                    }
                ],
                "citationCount": 5,
                "date": "2020-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepCDA: Deep cross-domain compound-protein affinity prediction through LSTM and convolutional neural networks"
            },
            "pmid": "32462178"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}