{
    "additionDate": "2017-08-03T18:52:35Z",
    "biotoolsCURIE": "biotools:nurd",
    "biotoolsID": "nurd",
    "credit": [
        {
            "email": "zhangxg@tsinghua.edu.cn",
            "name": "Xuegong Zhan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.au.tsinghua.edu.cn/"
        }
    ],
    "description": "Efficient and reliable tool for estimating the isoform expression level. Given the reads mapping result and gene annotation file, it will output the expression estimation result.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.au.tsinghua.edu.cn/software/NURD/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.au.tsinghua.edu.cn/software/NURD/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:27:59.781665Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/nurd-1-0-8-inference-isoform-expression.html"
        }
    ],
    "name": "NURD",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_010988"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-220",
            "metadata": {
                "abstract": "Background: RNA-Seq technology has been used widely in transcriptome study, and one of the most important applications is to estimate the expression level of genes and their alternative splicing isoforms. There have been several algorithms published to estimate the expression based on different models. Recently Wu et al. published a method that can accurately estimate isoform level expression by considering position-related sequencing biases using nonparametric models. The method has advantages in handling different read distributions, but there hasn't been an efficient program to implement this algorithm.Results: We developed an efficient implementation of the algorithm in the program NURD. It uses a binary interval search algorithm. The program can correct both the global tendency of sequencing bias in the data and local sequencing bias specific to each gene. The correction makes the isoform expression estimation more reliable under various read distributions. And the implementation is computationally efficient in both the memory cost and running time and can be readily scaled up for huge datasets.Conclusion: NURD is an efficient and reliable tool for estimating the isoform expression level. Given the reads mapping result and gene annotation file, NURD will output the expression estimation result. The package is freely available for academic use at http://bioinfo.au.tsinghua.edu.cn/software/NURD/. © 2013 Ma and Zhang; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ma X."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 10,
                "date": "2013-07-10T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NURD: An implementation of a new method to estimate isoform expression from non-uniform RNA-seq data"
            },
            "pmcid": "PMC3717102",
            "pmid": "23837734"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
