
{
    "credit": [
        {
            "email": "support@allelefrequencies.net",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Species frequency estimation",
                    "uri": "http://edamontology.org/operation_3221"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phylogenetic tree generation (from gene frequencies)",
                    "uri": "http://edamontology.org/operation_0542"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Immunoproteins, genes and antigens",
                "uri": "http://edamontology.org/topic_2830"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "Population genetics",
                "uri": "http://edamontology.org/topic_3056"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            },
            {
                "term": "Pharmacogenomics",
                "uri": "http://edamontology.org/topic_0208"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The allele frequency net database (http://www.allelefrequencies.net) is an online repository that contains information on the frequencies of immune genes and their corresponding alleles in different populations. The extensive variability observed in genes and alleles related to the immune system response and its significance in transplantation, disease association studies and diversity in populations led to the development of this electronic resource. At present, the system contains data from 1133 populations in 608 813 individuals on the frequency of genes from different polymorphic regions such as human leukocyte antigens, killer-cell immunoglobulin-like receptors, major histocompatibility complex Class I chainrelated genes and a number of cytokine gene polymorphisms. The project was designed to create a central source for the storage of frequency data and provide individuals with a set of bioinformatics tools to analyze the occurrence of these variants in worldwide populations. The resource has been used in a wide variety of contexts, including clinical applications (histocompatibility, immunology, epidemiology and pharmacogenetics) and population genetics. Demographic information, frequency data and searching tools can be freely accessed through the website. © The Author(s) 2010.",
            "authors": [
                "Gonzalez-Galarza F.F.",
                "Christmas S.",
                "Middleton D.",
                "Jones A.R."
            ],
            "cit_count": 498,
            "journal": "Nucleic Acids Research",
            "pmid": "21062830",
            "title": "Allele frequency net: A database and online repository for immune gene frequencies in worldwide populations",
            "year": "2011-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:allele_frequency_net",
        "biotoolsID": "allele_frequency_net",
        "description": "The allele frequency net database is an online repository that contains information on the frequencies of immune genes and their corresponding alleles in different populations. At present, the system contains data on the frequency of genes from different polymorphic regions such as human leukocyte antigens, killer-cell immunoglobulin-like receptors, major histocompatibility complex Class I chain-related genes and a number of cytokine gene polymorphisms.",
        "homepage": "http://www.allelefrequencies.net",
        "name": "Allele frequency net"
    }
}