
{
    "credit": [
        {
            "email": "chadi.saad@univ-lille1.fr",
            "name": "Chadi Saad",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/bonsai-team/DiNAMO/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://github.com/bonsai-team/DiNAMO/releases"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "DNA-Seq",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 The Author(s).Background: Discovering over-represented approximate motifs in DNA sequences is an essential part of bioinformatics. This topic has been studied extensively because of the increasing number of potential applications. However, it remains a difficult challenge, especially with the huge quantity of data generated by high throughput sequencing technologies. To overcome this problem, existing tools use greedy algorithms and probabilistic approaches to find motifs in reasonable time. Nevertheless these approaches lack sensitivity and have difficulties coping with rare and subtle motifs. Results: We developed DiNAMO (for DNA MOtif), a new software based on an exhaustive and efficient algorithm for IUPAC motif discovery. We evaluated DiNAMO on synthetic and real datasets with two different applications, namely ChIP-seq peaks and Systematic Sequencing Error analysis. DiNAMO proves to compare favorably with other existing methods and is robust to noise. Conclusions: We shown that DiNAMO software can serve as a tool to search for degenerate motifs in an exact manner using IUPAC models. DiNAMO can be used in scanning mode with sliding windows or in fixed position mode, which makes it suitable for numerous potential applications. Availability:https://github.com/bonsai-team/DiNAMO.",
            "authors": [
                "Saad C.",
                "Noe L.",
                "Richard H.",
                "Leclerc J.",
                "Buisine M.-P.",
                "Touzet H.",
                "Figeac M."
            ],
            "cit_count": 0,
            "doi": "10.1186/s12859-018-2215-1",
            "journal": "BMC Bioinformatics",
            "title": "DiNAMO: Highly sensitive DNA motif discovery in high-throughput sequencing data",
            "type": "Primary",
            "year": "2018-06-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dinamo",
        "biotoolsID": "dinamo",
        "description": "The DiNAMO software implements an exhaustive algorithm to detect over-represented IUPAC motifs in a set of DNA sequences.",
        "homepage": "https://github.com/bonsai-team/DiNAMO",
        "name": "DiNAMO"
    }
}