{
    "accessibility": "Open access",
    "additionDate": "2022-03-11T12:26:24.985821Z",
    "biotoolsCURIE": "biotools:tnbcis",
    "biotoolsID": "tnbcis",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Luz-Angela.Torres-de-la-Roche@Pius-Hospital.de",
            "name": "Luz Angela Torres-de la Roche",
            "typeEntity": "Person"
        },
        {
            "email": "wenjie.shi@uni-oldenburg.de",
            "name": "Wenjie Shi",
            "typeEntity": "Person"
        },
        {
            "name": "Maoli Wang"
        },
        {
            "name": "Rudy Leon De Wilde"
        },
        {
            "name": "Zihao Chen"
        }
    ],
    "description": "A Machine Learning Model to Predict the Triple Negative Breast Cancer Immune Subtype.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://immunotypes.shinyapps.io/TNBCIS/",
    "lastUpdate": "2022-03-11T12:26:24.988236Z",
    "name": "TNBCIS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2021.749459",
            "metadata": {
                "abstract": "© Copyright © 2021 Chen, Wang, De Wilde, Feng, Su, Torres-de la Roche and Shi.Background: Immune checkpoint blockade (ICB) has been approved for the treatment of triple-negative breast cancer (TNBC), since it significantly improved the progression-free survival (PFS). However, only about 10% of TNBC patients could achieve the complete response (CR) to ICB because of the low response rate and potential adverse reactions to ICB. Methods: Open datasets from The Cancer Genome Atlas (TCGA) and Gene Expression Omnibus (GEO) were downloaded to perform an unsupervised clustering analysis to identify the immune subtype according to the expression profiles. The prognosis, enriched pathways, and the ICB indicators were compared between immune subtypes. Afterward, samples from the Molecular Taxonomy of Breast Cancer International Consortium (METABRIC) dataset were used to validate the correlation of immune subtype with prognosis. Data from patients who received ICB were selected to validate the correlation of the immune subtype with ICB response. Machine learning models were used to build a visual web server to predict the immune subtype of TNBC patients requiring ICB. Results: A total of eight open datasets including 931 TNBC samples were used for the unsupervised clustering. Two novel immune subtypes (referred to as S1 and S2) were identified among TNBC patients. Compared with S2, S1 was associated with higher immune scores, higher levels of immune cells, and a better prognosis for immunotherapy. In the validation dataset, subtype 1 samples had a better prognosis than sub type 2 samples, no matter in overall survival (OS) (p = 0.00036) or relapse-free survival (RFS) (p = 0.0022). Bioinformatics analysis identified 11 hub genes (LCK, IL2RG, CD3G, STAT1, CD247, IL2RB, CD3D, IRF1, OAS2, IRF4, and IFNG) related to the immune subtype. A robust machine learning model based on random forest algorithm was established by 11 hub genes, and it performed reasonably well with area Under the Curve of the receiver operating characteristic (AUC) values = 0.76. An open and free web server based on the random forest model, named as triple-negative breast cancer immune subtype (TNBCIS), was developed and is available from https://immunotypes.shinyapps.io/TNBCIS/. Conclusion: TNBC open datasets allowed us to stratify samples into distinct immunotherapy response subgroups according to gene expression profiles. Based on two novel subtypes, candidates for ICB with a higher response rate and better prognosis could be selected by using the free visual online web server that we designed.",
                "authors": [
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "De Wilde R.L."
                    },
                    {
                        "name": "Feng R."
                    },
                    {
                        "name": "Shi W."
                    },
                    {
                        "name": "Su M."
                    },
                    {
                        "name": "Torres-de la Roche L.A."
                    },
                    {
                        "name": "Wang M."
                    }
                ],
                "date": "2021-09-17T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "A Machine Learning Model to Predict the Triple Negative Breast Cancer Immune Subtype"
            },
            "pmcid": "PMC8484710",
            "pmid": "34603338"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
