{
    "additionDate": "2017-08-03T18:49:55Z",
    "biotoolsCURIE": "biotools:moitf-em",
    "biotoolsID": "moitf-em",
    "credit": [
        {
            "email": "mitul@cs.stanford.edu",
            "name": "Mitul Saha",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ai.stanford.edu/~mitul/"
        }
    ],
    "description": "Automated computational tool for identifying regions or domains or motifs in cryoEM maps of large macromolecular assemblies (such as chaperonins, viruses, etc.).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://ai.stanford.edu/~mitul/motifEM/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure comparison",
                    "uri": "http://edamontology.org/operation_2483"
                }
            ]
        }
    ],
    "homepage": "http://ai.stanford.edu/~mitul/motifEM/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/moitf-em-automated-computational-tool-identifying-conserved-domains-cryoem-structures.html"
        }
    ],
    "name": "MOITF-EM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "We present a new, first-of-its-kind, fully automated computational tool MOTIF-EM for identifying regions or domains or motifs in cryoEM maps of large macromolecular assemblies (such as chaperonins, viruses, etc.) that remain conformationally conserved. As a byproduct, regions in structures that are not conserved are revealed: this can indicate local molecular flexibility related to biological activity. MOTIF-EM takes cryoEM volumetric maps as inputs. The technique used by MOTIF-EM to detect conserved sub-structures is inspired by a recent breakthrough in 2D object recognition. The technique works by constructing rotationally invariant, lowdimensional representations of local regions in the input cryoEM maps. Correspondences are established between the reduced representations (by comparing them using a simple metric) across the input maps. The correspondences are clustered using hash tables and graph theory is used to retrieve conserved structural domains or motifs. MOTIF-EM has been used to extract conserved domains occurring in large macromolecular assembly maps, including as those of viruses P22 and epsilon 15, Ribosome 70S, GroEL, that remain structurally conserved in different functional states. Our method can also been used to build atomic models for some maps. We also used MOTIF-EM to identify the conserved folds shared among dsDNA bacteriophages HK97, Epsilon 15, and ô29, though they have low-sequence similarity. Contact: mitul@cs.stanford.edu. Supplementary information: Supplementary data are available at Bioinformatics online. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Chiu W."
                    },
                    {
                        "name": "Levitt M."
                    },
                    {
                        "name": "Saha M."
                    }
                ],
                "citationCount": 9,
                "date": "2010-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MOTIF-EM: An automated computational tool for identifying conserved regions in CryoEM structures"
            },
            "pmid": "20529921"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
