{
    "additionDate": "2017-12-18T00:10:27Z",
    "biotoolsCURIE": "biotools:pps",
    "biotoolsID": "pps",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.biocuckoo.org/"
        },
        {
            "email": "s.cameron@abertay.ac.uk",
            "name": "Scott Cameron",
            "orcidid": "http://orcid.org/0000-0002-6600-1298",
            "typeEntity": "Person"
        }
    ],
    "description": "PPS (PTMs Peptide Scanner) is a novel software to reveal known or highly potential PTM sites in eukaryotic proteins.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pps.biocuckoo.org/faq.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://pps.biocuckoo.org/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-16T13:33:35Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pps-1-0-ptms-peptide-scanner.html"
        }
    ],
    "name": "PPS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-5-79",
            "metadata": {
                "abstract": "Background: Post-translational phosphorylation is one of the most common protein modifications. Phosphoserine, threonine and tyrosine residues play critical roles in the regulation of many cellular processes. The fast growing number of research reports on protein phosphorylation points to a general need for an accurate database dedicated to phosphorylation to provide easily retrievable information on phosphoproteins. Description: Phospho.ELM http://phospho.elm.eu.org is a new resource containing experimentally verified phosphorylation sites manually curated from the literature and is developed as part of the ELM (Eukaryotic Linear Motif) resource. Phospho.ELM constitutes the largest searchable collection of phosphorylation sites available to the research community. The Phospho.ELM entries store information about substrate proteins with the exact positions of residues known to be phosphorylated by cellular kinases. Additional annotation includes literature references, subcellular compartment, tissue distribution, and information about the signaling pathways involved as well as links to the molecular interaction database MINT. Phospho.ELM version 2.0 contains 1703 phosphorylation site instances for 556 phosphorylated proteins. Conclusion: Phospho.ELM will be a valuable tool both for molecular biologists working on protein phosphorylation sites and for bioinformaticians developing computational predictions on the specificity of phosphorylation reactions. © 2004 Diella et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Diella F."
                    },
                    {
                        "name": "Cameron S."
                    },
                    {
                        "name": "Gemund C."
                    },
                    {
                        "name": "Linding R."
                    },
                    {
                        "name": "Via A."
                    },
                    {
                        "name": "Kuster B."
                    },
                    {
                        "name": "Sicheritz-Ponten T."
                    },
                    {
                        "name": "Blom N."
                    },
                    {
                        "name": "Gibson T.J."
                    }
                ],
                "citationCount": 282,
                "date": "2004-06-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Phospho.ELM: A database of experimentally verified phosphorylation sites in eukaryotic proteins"
            },
            "pmcid": "PMC449700",
            "pmid": "15212693",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Phospho.ELM is a manually curated database of eukaryotic phosphorylation sites. The resource includes data collected from published literature as well as high-throughput data sets. The current release of Phospho.ELM (version 7.0, July 2007) contains 4078 phospho-protein sequences covering 12 025 phospho-serine, 2362 phospho-threonine and 2083 phospho-tyrosine sites. The entries provide information about the phosphorylated proteins and the exact position of known phosphorylated instances, the kinases responsible for the modification (where known) and links to bibliographic references. The database entries have hyperlinks to easily access further information from UniProt, PubMed, SMART, ELM, MSD as well as links to the protein interaction databases MINT and STRING. A new BLAST search tool, complementary to retrieval by keyword and UniProt accession number, allows users to submit a protein query (by sequence or UniProt accession) to search against the curated data set of phosphorylated peptides. Phospho.ELM is available on line at: http://phospho.elm.eu.org. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Diella F."
                    },
                    {
                        "name": "Gould C.M."
                    },
                    {
                        "name": "Chica C."
                    },
                    {
                        "name": "Via A."
                    },
                    {
                        "name": "Gibson T.J."
                    }
                ],
                "citationCount": 191,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Phospho.ELM: A database of phosphorylation sites - Update 2008"
            },
            "pmid": "17962309"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}