{
    "accessibility": "Open access",
    "additionDate": "2019-05-25T20:29:51Z",
    "biotoolsCURIE": "biotools:SMoLR",
    "biotoolsID": "SMoLR",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "m.w.paul@erasmusmc.nl",
            "name": "Maarten Paul",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for visualization and analysis of single-molecule localization microscopy data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Single particle analysis",
                    "uri": "http://edamontology.org/operation_3457"
                }
            ]
        }
    ],
    "homepage": "https://github.com/maartenpaul/SMoLR",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "LGPL-3.0",
    "maturity": "Mature",
    "name": "SMoLR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2578-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Single-molecule localization microscopy is a super-resolution microscopy technique that allows for nanoscale determination of the localization and organization of proteins in biological samples. For biological interpretation of the data it is essential to extract quantitative information from the super-resolution data sets. Due to the complexity and size of these data sets flexible and user-friendly software is required. Results: We developed SMoLR (Single Molecule Localization in R): a flexible framework that enables exploration and analysis of single-molecule localization data within the R programming environment. SMoLR is a package aimed at extracting, visualizing and analyzing quantitative information from localization data obtained by single-molecule microscopy. SMoLR is a platform not only to visualize nanoscale subcellular structures but additionally provides means to obtain statistical information about the distribution and localization of molecules within them. This can be done for individual images or SMoLR can be used to analyze a large set of super-resolution images at once. Additionally, we describe a method using SMoLR for image feature-based particle averaging, resulting in identification of common features among nanoscale structures. Conclusions: Embedded in the extensive R programming environment, SMoLR allows scientists to study the nanoscale organization of biomolecules in cells by extracting and visualizing quantitative information and hence provides insight in a wide-variety of different biological processes at the single-molecule level.",
                "authors": [
                    {
                        "name": "Baarends W.M."
                    },
                    {
                        "name": "Houtsmuller A.B."
                    },
                    {
                        "name": "Lin Z."
                    },
                    {
                        "name": "Paul M.W."
                    },
                    {
                        "name": "Slotman J.A."
                    },
                    {
                        "name": "de Gruiter H.M."
                    },
                    {
                        "name": "van Cappellen W.A."
                    }
                ],
                "citationCount": 4,
                "date": "2019-01-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SMoLR: Visualization and analysis of single-molecule localization microscopy data in R"
            },
            "pmcid": "PMC6334411",
            "pmid": "30646838",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
