
{
    "credit": [
        {
            "email": "info@gchelpdesk.ualberta.ca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.wishartlab.com/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://shifty.wishartlab.com/help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/shiftcor-1-0-compares-identifies-corrects-re-referencs-protein-chemical-shifts.html"
        }
    ],
    "publication": [
        {
            "abstract": "RefDB is a secondary database of reference-corrected protein chemical shifts derived from the BioMagResBank (BMRB). The database was assembled by using a recently developed program (SHIFTX) to predict protein 1H, 13C and 15N chemical shifts from X-ray or NMR coordinate data of previously assigned proteins. The predicted shifts were then compared with the corresponding observed shifts and a variety of statistical evaluations performed. In this way, potential mis-assignments, typographical errors and chemical referencing errors could be identified and, in many cases, corrected. This approach allows for an unbiased, instrument-independent solution to the problem of retrospectively re-referencing published protein chemical shifts. Results from this study indicate that nearly 25% of BMRB entries with 13C protein assignments and 27% of BMRB entries with 15N protein assignments required significant chemical shift reference readjustments. Additionally, nearly 40% of protein entries deposited in the BioMagResBank appear to have at least one assignment error. From this study it evident that protein NMR spectroscopists are increasingly adhering to recommended IUPAC 13C and 15N chemical shift referencing conventions, however, approximately 20% of newly deposited protein entries in the BMRB are still being incorrectly referenced. This is cause for some concern. However, the utilization of RefDB and its companion programs may help mitigate this ongoing problem. RefDB is updated weekly and the database, along with its associated software, is freely available at http://redpoll.pharmacy.ualberta.ca and the BMRB website.",
            "authors": [
                "Zhang H.",
                "Neal S.",
                "Wishart D.S."
            ],
            "cit_count": 326,
            "journal": "Journal of Biomolecular NMR",
            "pmid": "12652131",
            "title": "RefDB: A database of uniformly referenced protein chemical shifts",
            "year": "2003-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:shiftcor",
        "biotoolsID": "shiftcor",
        "description": "The tool compares, identifies, corrects and re-referencs 1H, 13C and 15N backbone chemical shifts of peptides and proteins by comparing the observed chemical shifts with the predicted chemical shifts derived from the 3D structure (PDB corrdinates) of the protein(s)of interest.",
        "homepage": "http://shifty.wishartlab.com/",
        "name": "Shiftcor"
    }
}