{
    "additionDate": "2017-08-03T19:04:55Z",
    "biotoolsCURIE": "biotools:arraylasso",
    "biotoolsID": "arraylasso",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/adam-sam-brown"
        }
    ],
    "description": "This tool implements a set of five open-source R functions that allow the user to acquire data from public sources such as GEO, train a set of Lasso models on that data, and directly map one microarray platform to another. It significantly predicts expression levels with higher fidelity than technical replicates of the same RNA pool, demonstrating its utility in the integration of data sets from different platforms.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/adam-sam-brown/aRrayLasso"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/adam-sam-brown/aRrayLasso",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/arraylasso-network-based-approach-to-microarray-interconversion.html"
        }
    ],
    "name": "aRrayLasso",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved.Robust conversion between microarray platforms is needed to leverage the wide variety of microarray expression studies that have been conducted to date. Currently available conversion methods rely on manufacturer annotations, which are often incomplete, or on direct alignment of probes from different platforms, which often fail to yield acceptable genewise correlation. Here, we describe aRrayLasso, which uses the Lasso-penalized generalized linear model to model the relationships between individual probes in different probe sets. We have implemented aRrayLasso in a set of five open-source R functions that allow the user to acquire data from public sources such as Gene Expression Omnibus, train a set of Lasso models on that data and directly map one microarray platform to another. aRrayLasso significantly predicts expression levels with similar fidelity to technical replicates of the same RNA pool, demonstrating its utility in the integration of datasets from different platforms.",
                "authors": [
                    {
                        "name": "Brown A.S."
                    },
                    {
                        "name": "Patel C.J."
                    }
                ],
                "date": "2015-06-18T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ARrayLasso: A network-based approach to microarray interconversion"
            },
            "pmid": "26283699"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ],
    "validated": 1
}