{
    "additionDate": "2021-01-18T09:10:46Z",
    "biotoolsCURIE": "biotools:ggroups",
    "biotoolsID": "ggroups",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mohammad.nilforooshan@lic.co.nz",
            "name": "Mohammad Ali Nilforooshan",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package for pedigree and genetic groups data.\n\nCalculates additive and dominance genetic relationship matrices and their inverses, in matrix and tabular-sparse formats. It includes functions for checking and processing pedigree, as well as functions to calculate the matrix of genetic group contributions (Q), and adding those contributions to the genetic merit of animals (Quaas (1988) <doi:10.3168/jds.S0022-0302(88)79691-5>).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-23T09:44:17Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/package=ggroups"
        }
    ],
    "name": "ggroups",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S41065-020-00124-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: R is a multi-platform statistical software and an object oriented programming language. The package archive network for R provides CRAN repository that features over 15,000 free open source packages, at the time of writing this article (https://cran.r-project.org/web/packages, accessed in October 2019). The package ggroups is introduced in this article. The purpose of this package is providing functions for checking and processing the pedigree, calculation of the additive genetic relationship matrix and its inverse, which are used to study the population structure and predicting the genetic merit of animals. Calculation of the dominance relationship matrix and its inverse are also covered. A concept in animal breeding is genetic groups, which is about the inequality of the average genetic merits for groups of unknown parents. The package provides functions for the calculation of the matrix of genetic group contributions (Q). Calculating Q is computationally demanding, and depending on the size of the pedigree and the number of genetic groups, it might not be feasible using personal computers. Therefore, a computationally optimised function and its parallel processing alternative are provided in the package. Results: Using sample data, outputs from different functions of the package were presented to illustrate a real experience of working with the package. Conclusions: The presented R package is a free and open source tool mainly for quantitative geneticists and ecologists, who deal with pedigree data. It provides numerous functions for handling pedigree data, and calculating various pedigree-based matrices. Some of the functions are computationally optimised for large-scale data.",
                "authors": [
                    {
                        "name": "Nilforooshan M.A."
                    },
                    {
                        "name": "Saavedra-Jimenez L.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-04T00:00:00Z",
                "journal": "Hereditas",
                "title": "Ggroups: An R package for pedigree and genetic groups data"
            },
            "pmcid": "PMC7199380",
            "pmid": "32366304"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}