
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Paediatrics",
                "uri": "http://edamontology.org/topic_3418"
            },
            {
                "term": "Medical informatics",
                "uri": "http://edamontology.org/topic_3063"
            },
            {
                "term": "Allergy, clinical immunology and immunotherapeutics",
                "uri": "http://edamontology.org/topic_3400"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© James Cook University.Introduction: This article describes the implementation of a novel technology tool to capture demographic distribution and clinical presentation of patients in rural vision centers using the eyeSmart electronic medical record (EMR) app in a three-tier eyecare network in India. Methods: A two-year retrospective review of all patients who presented to the rural vision centers of LV Prasad Eye Institute (LVPEI) eyecare network was performed from September 2016 to August 2018 using an in-house developed eyeSmart EMR app. Results: A total of 501 771 patients were captured on the eyeSmart EMR app across the LVPEI network. The ratio of males (n=273 985, 54.60%) and females (n=227 786, 45.40%) presenting to the rural vision centers was 1.2:1. The most prevalent ocular disorder was refractive errors (n=273 720, 44.32%). Conclusions: This study details the demographic distribution and prevalence of ocular disorders in a large cohort of Indian patients and demonstrates the potential for real-time analytics through the use of EMR systems. This provides rigorous evidence for the community and eyecare providers that the use of a web application/tablet app (eyeSmart) aids in providing better eyecare services in rural areas. It helps in creating government policies and improves the treatment strategies for various preventable ocular disorders in India.",
            "authors": [
                "Kammari P.",
                "Ambadker M.C.",
                "Loomba A.",
                "Deepthi N.",
                "Shravani M.",
                "Vadapalli R.",
                "Maduri S.",
                "Bhaskey S.S.R.",
                "Taneja M.",
                "Das A.V."
            ],
            "cit_count": 0,
            "doi": "10.22605/RRH5255",
            "journal": "Rural and Remote Health",
            "pmid": "31476276",
            "title": "A novel technology tool to capture the clinical information of patients across rural vision centers in a three-tier eye care network in India using the eyeSmart EMR App",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:eyeSmart",
        "biotoolsID": "eyeSmart",
        "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'eyeSmart EMR', 'EMR' | A novel technology tool to capture the clinical information of patients across rural vision centers in a three-tier eye care network in India using the eyeSmart EMR App | Access to Power BI reports requires Internet Connectivity",
        "homepage": "http://www.lvpei.org/aeye/eyesmartapp.html",
        "name": "eyeSmart"
    }
}