{
    "accessibility": [],
    "additionDate": "2017-12-18T00:13:20Z",
    "biotoolsCURIE": "biotools:surpresi",
    "biotoolsID": "surpresi",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pmbm.ippt.gov.pl/web/Marek_Kocha%C5%84czyk"
        }
    ],
    "description": "Method for finding binding sites in proteins based on the probabilitic analysis of global radial distributions of atoms.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://pmbm.ippt.gov.pl/services/surpresi/cgi-bin/prediction.py",
    "homepage_status": 0,
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/surpresi-201108-protein-active-site-prediction-based-central-distances-amino-acids.html"
        }
    ],
    "maturity": null,
    "name": "SurpResi",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1472-6807-11-34",
            "metadata": {
                "abstract": "Background: Well-performing automated protein function recognition approaches usually comprise several complementary techniques. Beside constructing better consensus, their predictive power can be improved by either adding or refining independent modules that explore orthogonal features of proteins. In this work, we demonstrated how the exploration of global atomic distributions can be used to indicate functionally important residues. Results: Using a set of carefully selected globular proteins, we parametrized continuous probability density functions describing preferred central distances of individual protein atoms. Relative preferred burials were estimated using mixture models of radial density functions dependent on the amino acid composition of a protein under consideration. The unexpectedness of extraordinary locations of atoms was evaluated in the information-theoretic manner and used directly for the identification of key amino acids. In the validation study, we tested capabilities of a tool built upon our approach, called SurpResi, by searching for binding sites interacting with ligands. The tool indicated multiple candidate sites achieving success rates comparable to several geometric methods. We also showed that the unexpectedness is a property of regions involved in protein-protein interactions, and thus can be used for the ranking of protein docking predictions. The computational approach implemented in this work is freely available via a Web interface at http://www.bioinformatics.org/surpresi. Conclusions: Probabilistic analysis of atomic central distances in globular proteins is capable of capturing distinct orientational preferences of amino acids as resulting from different sizes, charges and hydrophobic characters of their side chains. When idealized spatial preferences can be inferred from the sole amino acid composition of a protein, residues located in hydrophobically unfavorable environments can be easily detected. Such residues turn out to be often directly involved in binding ligands or interfacing with other proteins. © 2011 Kochaczyk; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Kochanczyk M."
                    }
                ],
                "citationCount": 6,
                "date": "2011-09-21T00:00:00Z",
                "journal": "BMC Structural Biology",
                "title": "Prediction of functionally important residues in globular proteins from unusual central distances of amino acids"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Amino acids",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1,
    "version": [
        "201108"
    ]
}