{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T12:41:08.555606Z",
    "biotoolsCURIE": "biotools:cytopipeline",
    "biotoolsID": "cytopipeline",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "laurent.gatto@uclouvain.be",
            "name": "Laurent Gatto",
            "typeEntity": "Person"
        },
        {
            "name": "Philippe Hauchamps",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package suite for building and visualizing automated pre-processing pipelines for flow cytometry data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UCLouvain-CBIO/2023-CytoPipeline-code",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T13:54:44.358906Z",
    "license": "Proprietary",
    "name": "CytoPipeline",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s12859-024-05691-z",
            "metadata": {
                "abstract": "Background: With the increase of the dimensionality in flow cytometry data over the past years, there is a growing need to replace or complement traditional manual analysis (i.e. iterative 2D gating) with automated data analysis pipelines. A crucial part of these pipelines consists of pre-processing and applying quality control filtering to the raw data, in order to use high quality events in the downstream analyses. This part can in turn be split into a number of elementary steps: signal compensation or unmixing, scale transformation, debris, doublets and dead cells removal, batch effect correction, etc. However, assembling and assessing the pre-processing part can be challenging for a number of reasons. First, each of the involved elementary steps can be implemented using various methods and R packages. Second, the order of the steps can have an impact on the downstream analysis results. Finally, each method typically comes with its specific, non standardized diagnostic and visualizations, making objective comparison difficult for the end user. Results: Here, we present CytoPipeline and CytoPipelineGUI, two R packages to build, compare and assess pre-processing pipelines for flow cytometry data. To exemplify these new tools, we present the steps involved in designing a pre-processing pipeline on a real life dataset and demonstrate different visual assessment use cases. We also set up a benchmarking comparing two pre-processing pipelines differing by their quality control methods, and show how the package visualization utilities can provide crucial user insight into the obtained benchmark metrics. Conclusion: CytoPipeline and CytoPipelineGUI are two Bioconductor R packages that help building, visualizing and assessing pre-processing pipelines for flow cytometry data. They increase productivity during pipeline development and testing, and complement benchmarking tools, by providing user intuitive insight into benchmarking results.",
                "authors": [
                    {
                        "name": "Bayat B."
                    },
                    {
                        "name": "Delandre S."
                    },
                    {
                        "name": "Gatto L."
                    },
                    {
                        "name": "Hamrouni M."
                    },
                    {
                        "name": "Hauchamps P."
                    },
                    {
                        "name": "Lin D."
                    },
                    {
                        "name": "Temmerman S."
                    },
                    {
                        "name": "Toussaint M."
                    }
                ],
                "citationCount": 1,
                "date": "2024-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CytoPipeline and CytoPipelineGUI: a Bioconductor R package suite for building and visualizing automated pre-processing pipelines for flow cytometry data"
            },
            "pmcid": "PMC10877884",
            "pmid": "38378440"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
