{
    "additionDate": "2017-02-14T09:34:42Z",
    "biotoolsCURIE": "biotools:3dlogo",
    "biotoolsID": "3dlogo",
    "collectionID": [
        "Proteomics"
    ],
    "description": "3dLOGO is a server for the identification and analysis of conserved protein three-dimensional (3D) substructures.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                },
                {
                    "term": "Protein structural motif recognition",
                    "uri": "http://edamontology.org/operation_0245"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://3dlogo.uniroma2.it/3dLOGO/home.html",
    "lastUpdate": "2019-03-26T08:09:59Z",
    "name": "3dLOGO",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "3dLOGO is a web server for the identification and analysis of conserved protein 3D substructures. Given a set of residues in a PDB (Protein Data Bank) chain, the server detects the matching substructure(s) in a set of user-provided protein structures, generates a multiple structure alignment centered on the input substructures and highlights other residues whose structural conservation becomes evident after the defined superposition. Conserved residues are proposed to the user for highlighting functional areas, deriving refined structural motifs or building sequence patterns. Residue structural conservation can be visualized through an expressly designed Java application, 3dProLogo, which is a 3D implementation of a sequence logo. The 3dLOGO server, with related documentation, is available at http://3dlogo.uniroma2.it/. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Via A."
                    },
                    {
                        "name": "Peluso D."
                    },
                    {
                        "name": "Gherardini P.F."
                    },
                    {
                        "name": "De Rinaldis E."
                    },
                    {
                        "name": "Colombo T."
                    },
                    {
                        "name": "Ausiello G."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    }
                ],
                "citationCount": 6,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "3dLOGO: A web server for the identification, analysis and use of conserved protein substructures"
            },
            "pmid": "17488847"
        },
        {
            "metadata": {
                "abstract": "We report a procedure for the description and comparison of protein surfaces, which is based on a three-dimensional (3D) transposition of the profile method for sensitive protein homology sequence searches. Although the principle of the method can be applied to detect similarities to a single protein surface, the possibility of extending this approach to protein families displaying common structural and/or functional properties, makes it a more powerful tool. In analogy to profiles derived from the multiple alignment of protein sequences, we derive a 3D surface profile from a protein structure or from a multiple structure alignment of several proteins. The 3D profile is used to screen the protein structure database, searching for similar protein surfaces. The application of the procedure to SH2 and SH3 binding pockets and to the nucleotide binding pocket associated with the p-loop structural motif is described. The SH2 and SH3 3D profiles can identify all the SH2 and SH3 binding regions present in the test dataset; the p-loop 3D profile is able to recognize all the p-loop-containing proteins present in the test dataset. Analysis of the p-loop 3D profile allowed the identification of a positive charge whose position is conserved in space but not in sequence. The best ranking non-p-loop-containing protein is an ADP-forming succinyl coenzyme A synthetase, whose nucleotide-binding region has not yet been identified.",
                "authors": [
                    {
                        "name": "De Rinaldis M."
                    },
                    {
                        "name": "Ausiello G."
                    },
                    {
                        "name": "Cesareni G."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    }
                ],
                "citationCount": 41,
                "date": "1998-12-11T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Three-dimensional profiles: A new tool to identify protein surface similarities"
            },
            "pmid": "9837739"
        },
        {
            "metadata": {
                "abstract": "Background. A large number of PROSITE patterns select false positives and/or miss known true positives. It is possible that - at least in some cases - the weak specificity and/or sensitivity of a pattern is due to the fact that one, or maybe more, functional and/or structural key residues are not represented in the pattern. Multiple sequence alignments are commonly used to build functional sequence patterns. If residues structurally conserved in proteins sharing a function cannot be aligned in a multiple sequence alignment, they are likely to be missed in a standard pattern construction procedure. Results. Here we present a new procedure aimed at improving the sensitivity and/ or specificity of poorly-performing patterns. The procedure can be summarised as follows: 1. residues structurally conserved in different proteins, that are true positives for a pattern, are identified by means of a computational technique and by visual inspection. 2. the sequence positions of the structurally conserved residues falling outside the pattern are used to build extended sequence patterns. 3. the extended patterns are optimised on the SWISS-PROT database for their sensitivity and specificity. The method was applied to eight PROSITE patterns. Whenever structurally conserved residues are found in the surface region close to the pattern (seven out of eight cases), the addition of information inferred from structural analysis is shown to improve pattern selectivity and in some cases selectivity and sensitivity as well. In some of the cases considered the procedure allowed the identification of functionally interesting residues, whose biological role is also discussed. Conclusion. Our method can be applied to any type of functional motif or pattern (not only PROSITE ones) which is not able to select all and only the true positive hits and for which at least two true positive structures are available. The computational technique for the identification of structurally conserved residues is already available on request and will be soon accessible on our web server. The procedure is intended for the use of pattern database curators and of scientists interested in a specific protein family for which no specific or selective patterns are yet available. © 2004 Via and Helmer-Citterich, licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Via A."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    }
                ],
                "citationCount": 7,
                "date": "2004-04-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A structural study for the optimisation of functional motifs encoded in protein sequences"
            },
            "pmid": "15119965"
        },
        {
            "metadata": {
                "abstract": "Background: The identification of local similarities between two protein structures can provide clues of a common function. Many different methods exist for searching for similar subsets of residues in proteins of known structure. However, the lack of functional and structural information on single residues, together with the low level of integration of this information in comparison methods, is a limitation that prevents these methods from being fully exploited in high-throughput analyses. Results: Here we describe Query3d, a program that is both a structural DBMS (Database Management System) and a local comparison method. The method conserves a copy of all the residues of the Protein Data Bank annotated with a variety of functional and structural information. New annotations can be easily added from a variety of methods and known databases. The algorithm makes it possible to create complex queries based on the residues' function and then to compare only subsets of the selected residues. Functional information is also essential to speed up the comparison and the analysis of the results. Conclusion: With Query3d, users can easily obtain statistics on how many and which residues share certain properties in all proteins of known structure. At the same time, the method also finds their structural neighbours in the whole PDB. Programs and data can be accessed through the PdbFun web interface.",
                "authors": [
                    {
                        "name": "Ausiello G."
                    },
                    {
                        "name": "Via A."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    }
                ],
                "citationCount": 48,
                "date": "2005-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Query3d: A new method for high-throughput analysis of functional residues in protien structures"
            },
            "pmid": "16351754"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}