
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Medicine",
                "uri": "http://edamontology.org/topic_3303"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Wiley Periodicals, Inc.Background and Objectives: Optical properties characterize light propagation in turbid media, such as tissue. Recovery of optical properties is of great importance in a wide variety of biomedical applications, including both therapeutic treatments and diagnosis. Most of the available methodologies are well established, however, these are not optimized for real-time measurements. Study Design/Materials and Methods: Optical properties are recovered using the Inverse Adding Doubling program from reflectance measurements measured with an integrating sphere and light in the visible range. A user-friendly interface was programmed in Visual Studio and the libraries of a particular spectrophotometer were used. To achieve real-time measurements, a parallel computing routine was implemented, splitting the whole spectra in threads to be computed independently. Several tests using living tissue and inorganic materials were carried out to validate the proposed algorithm. Results: Recovery of absorption/scattering coefficient spectrum in the visible range with high precision in a couple of seconds was achieved, demonstrating its capabilities for real-time monitoring in biomedical applications. The absorption coefficient spectrum shows the expected characteristics according to the different melanin and blood concentration of various volunteers, also showing the expected changes during a thermoregulation process. Conclusions: A real-time monitoring of optical properties algorithm was developed, including parallel computing and a user-friendly interface. The proposed algorithm would be of help in biomedical applications, where real-time monitoring optical properties is required. Lasers Surg. Med. © 2019 Wiley Periodicals, Inc.",
            "authors": [
                "Quistian-Vazquez B.",
                "Morales-Cruzado B.",
                "Sarmiento-Gomez E.",
                "Perez-Gutierrez F.G."
            ],
            "cit_count": 0,
            "doi": "10.1002/LSM.23164",
            "journal": "Lasers in Surgery and Medicine",
            "pmid": "31571262",
            "title": "Retrieval of Absorption or Scattering Coefficient Spectrum (RASCS) Program: A Tool to Monitor Optical Properties in Real Time",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:RASCS",
        "biotoolsID": "RASCS",
        "description": "Retrieval of Absorption or Scattering Coefficient Spectrum (RASCS) Program.\n\nBACKGROUND AND OBJECTIVES:Optical properties characterize light propagation in turbid media, such as tissue. Recovery of optical properties is of great importance in a wide variety of biomedical applications, including both therapeutic treatments and diagnosis. Most of the available methodologies are well established, however, these are not optimized for real-time measurements. STUDY DESIGN MATERIALS AND METHODS:Optical properties are recovered using the Inverse Adding Doubling program from reflectance measurements measured with an integrating sphere and light in the visible range. A user-friendly interface was programmed in Visual Studio and the libraries of a particular spectrophotometer were used.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Retrieval Absorption Scattering Coefficient Spectrum Program', 'optical', 'OBJECTIVES:Optical', 'METHODS:Optical'",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31571262",
        "name": "RASCS"
    }
}