{
    "additionDate": "2021-01-18T09:50:06Z",
    "biotoolsCURIE": "biotools:corazon",
    "biotoolsID": "corazon",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vinicius.maracaja@uchile.cl",
            "name": "Vinicius Maracaja-Coutinho",
            "typeEntity": "Person"
        },
        {
            "email": "miguel@icb.ufmg.br",
            "name": "J. Miguel Ortega",
            "typeEntity": "Person"
        },
        {
            "email": "gaudenciothais@gmail.com",
            "name": "Thaís G. do Rêgo",
            "typeEntity": "Person"
        }
    ],
    "description": "CORAZON( CORrelations Analyses Zipper ONline) is a bioinformatic tool that uses artificial intelligence to cluster genes according to their expression in tissues and also a tool to normalize databases. It is a web server for data normalization and unsupervised clustering based on expression profiles. This tool is composed of 3 unsupervised machine learning algorithms: Mean Shift, K-Means and Hierarchical. Unsupervised learning is the machine learning task of inferring a function to describe the hidden structure from unlabeled data. The inductor analyzes the examples provided and tries to determine if some of them can be grouped in any way, forming clusters.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://corazon.integrativebioinformatics.me/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "http://corazon.integrativebioinformatics.me",
    "lastUpdate": "2021-02-17T15:17:57Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/integrativebioinformatics/corazon"
        }
    ],
    "name": "CORAZON",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13104-020-05171-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Objective: Data normalization and clustering are mandatory steps in gene expression and downstream analyses, respectively. However, user-friendly implementations of these methodologies are available exclusively under expensive licensing agreements, or in stand-alone scripts developed, reflecting on a great obstacle for users with less computational skills. Results: We developed an online tool called CORAZON (Correlations Analyses Zipper Online), which implements three unsupervised learning methods to cluster gene expression datasets in a friendly environment. It allows the usage of eight gene expression normalization/transformation methodologies and the attribute's influence. The normalizations requiring the gene length only could be performed to RNA-seq, meanwhile the others can be used with microarray and/or NanoString data. Clustering methodologies performances were evaluated through five models with accuracies between 92 and 100%. We applied our tool to obtain functional insights of non-coding RNAs (ncRNAs) based on Gene Ontology enrichment of clusters in a dataset generated by the ENCODE project. The clusters where the majority of transcripts are coding genes were enriched in Cellular, Metabolic, Transports, and Systems Development categories. Meanwhile, the ncRNAs were enriched in the Detection of Stimulus, Sensory Perception, Immunological System, and Digestion categories. CORAZON source-code is freely available at https://gitlab.com/integrativebioinformatics/corazon and the web-server can be accessed at http://corazon.integrativebioinformatics.me.",
                "authors": [
                    {
                        "name": "Ramos T.A.R."
                    },
                    {
                        "name": "Maracaja-Coutinho V."
                    },
                    {
                        "name": "Ortega J.M."
                    },
                    {
                        "name": "Do Rego T.G."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-14T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "CORAZON: A web server for data normalization and unsupervised clustering based on expression profiles"
            },
            "pmcid": "PMC7359491",
            "pmid": "32665017"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}