{"credit":[{"email":"shaham@rockefeller.edu","name":"Galign Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Variant calling","uri":"http://edamontology.org/operation_3227"}]}],"labels":{"language":["C++","Perl"],"license":"GPL-3.0","operatingSystem":["Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"publication":[{"abstract":"Background: Highly parallel sequencing technologies have become important tools in the analysis of sequence polymorphisms on a genomic scale. However, the development of customized software to analyze data produced by these methods has lagged behind. Methods/Principal Findings: Here I describe a tool, 'galign', designed to identify polymorphisms between sequence reads obtained using Illumina/ Solexa technology and a reference genome. The 'galign' alignment tool does not use Smith-Waterman matrices for sequence comparisons. Instead, a simple algorithm comparing parsed sequence reads to parsed reference genome sequences is used. 'galign' output is geared towards immediate user application, displaying polymorphism locations, nucleotide changes, and relevant predicted amino-acid changes for ease of information processing. To do so, 'galign' requires several accessory files easily derived from an annotated reference genome. Direct sequencing as well as in silico studies demonstrate that 'galign' provides lesion predictions comparable in accuracy to available prediction programs, accompanied by greater processing speed and more user-friendly output. We demonstrate the use of 'galign' to identify mutations leading to phenotypic consequences in C. elegans. Conclusion/Significance: Our studies suggest that 'galign' is a useful tool for polymorphism discovery, and is of immediate utility for sequence mining in C. elegans. © 2009 Shai Shaham.","authors":["Shaham S."],"cit_count":5,"journal":"PLoS ONE","pmid":"19779626","title":"galign: A tool for rapid genome polymorphism discovery","year":"2009-09-25"}],"summary":{"biotoolsCURIE":"biotools:galign","biotoolsID":"galign","description":"Identifies polymorphisms between sequence reads obtained using Illumina/Solexa technology and a reference genome","homepage":"http://shahamlab.rockefeller.edu/galign/galign.htm","name":"Galign"}}