
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://alglab1.cs.ucr.edu/OFRG/PRISEcontactfaq.php"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://alglab1.cs.ucr.edu/OFRG/PRISE.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/prise-designing-sequence-selective-pcr-primers.html"
        }
    ],
    "publication": [
        {
            "abstract": "This report presents PRImer Selector (PRISE), a new software package that implements several features that improve and streamline the design of sequence-selective PCR primers. The PRISE design process involves two main steps. In the first step, target and non-target DNA sequences are identified. In the second step, primers are designed to amplify target (but not non-target) sequences. One important feature of PRISE is that it automates the task of placing primer-template mismatches at the 3' end of the primers - a property that is crucial for sequence selectivity. Once a list of candidate primers has been produced, sorting tools in PRISE speed up the selection process by allowing a user to sort the primers by properties such as amplicon length, GC content and sequence selectivity. PRISE can be used to design primers with a range of specificities, targeting individual sequences as well as diverse assemblages of genes. PRISE also allows user-defined primers to be analyzed, enabling their properties to be examined in relation to target and non-target sequences. The utility of PRISE was demonstrated by using it to design sequence-selective PCR primers for an rRNA gene from the fungus Pochonia chlamydosporia. © 2007 Elsevier B.V. All rights reserved.",
            "authors": [
                "Fu Q.",
                "Ruegger P.",
                "Bent E.",
                "Chrobak M.",
                "Borneman J."
            ],
            "cit_count": 23,
            "journal": "Journal of Microbiological Methods",
            "pmid": "18221808",
            "title": "PRISE (PRImer SElector): Software for designing sequence-selective PCR primers",
            "year": "2008-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:prise",
        "biotoolsID": "prise",
        "description": "Interactive software package for PCR primer design. PRISE enables the design of sequence-specific / sequence-selective PCR primers. One important feature of PRISE is that it automates the task of placing primer-template mismatches at the 3′ end of the primers – a property that is crucial for sequence selectivity / specificity.",
        "homepage": "http://alglab1.cs.ucr.edu/OFRG/PRISE.php",
        "name": "PRISE"
    }
}