{
    "additionDate": "2021-01-18T10:36:05Z",
    "biotoolsCURIE": "biotools:geomine",
    "biotoolsID": "geomine",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rarey@zbh.uni-hamburg.de",
            "name": "Matthias Rarey",
            "typeEntity": "Person"
        }
    ],
    "description": "Interactive Pattern Mining of Protein-Ligand Interfaces in the Protein Data Bank.\n\nProteinsPlus structure-based modeling support server. This server is a common web portal for all tools related to structure-based modeling created by the AMD group (Prof. M. Rarey) at ZBH, Hamburg, including DoGSite Scorer, EDIA, PPI, PoseView, SIENA and ProToss.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://proteins.plus",
    "lastUpdate": "2021-01-23T09:32:20Z",
    "name": "GeoMine",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA693",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.SUMMARY: The searching of user-defined 3D queries in molecular interfaces is a computationally challenging problem that is not satisfactorily solved so far. Most of the few existing tools focused on that purpose are desktop based and not openly available. Besides that, they show a lack of query versatility, search efficiency and user-friendliness. We address this issue with GeoMine, a publicly available web application that provides textual, numerical and geometrical search functionality for protein-ligand binding sites derived from structural data contained in the Protein Data Bank (PDB). The query generation is supported by a 3D representation of a start structure that provides interactively selectable elements like atoms, bonds and interactions. GeoMine gives full control over geometric variability in the query while performing a deterministic, precise search. Reasonably selective queries are processed on the entire set of protein-ligand complexes in the PDB within a few minutes. GeoMine offers an interactive and iterative search process of successive result analyses and query adaptations. From the numerous potential applications, we picked two from the field of side-effect analyze showcasing the usefulness of GeoMine. AVAILABILITY AND IMPLEMENTATION: GeoMine is part of the ProteinsPlus web application suite and freely available at https://proteins.plus. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Diedrich K."
                    },
                    {
                        "name": "Graef J."
                    },
                    {
                        "name": "Rarey M."
                    },
                    {
                        "name": "Schoning-Stierand K."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-20T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "GeoMine: interactive pattern mining of protein-ligand interfaces in the Protein Data Bank"
            },
            "pmid": "32735322"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
