{
    "additionDate": "2021-01-18T09:09:29Z",
    "biotoolsCURIE": "biotools:ts",
    "biotoolsID": "ts",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xuexia.wang@unt.edu",
            "name": "Xuexia Wang",
            "orcidid": "https://orcid.org/0000-0002-0613-2608",
            "typeEntity": "Person"
        }
    ],
    "description": "TS is a powerful truncated test to detect novel disease associated genes using publicly available gWAS summary data.\n\nTest based on Truncated Statistic.\n\ntpc is the pre-compiled executable binary for Linux.\n\ntpc -h to get the more help information.\n\ntpc -p 1000 -i toy_samples.txt -t traitmatrix.txt -n 1 -o p_values.txt.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Jianjun-CN/c-code-for-TS",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-03-05T17:13:56Z",
    "name": "TS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3511-0",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: In the last decade, a large number of common variants underlying complex diseases have been identified through genome-wide association studies (GWASs). Summary data of the GWASs are freely and publicly available. The summary data is usually obtained through single marker analysis. Gene-based analysis offers a useful alternative and complement to single marker analysis. Results from gene level association tests can be more readily integrated with downstream functional and pathogenic investigations. Most existing gene-based methods fall into two categories: burden tests and quadratic tests. Burden tests are usually powerful when the directions of effects of causal variants are the same. However, they may suffer loss of statistical power when different directions of effects exist at the causal variants. The power of quadratic tests is not affected by the directions of effects but could be less powerful due to issues such as the large number of degree of freedoms. These drawbacks of existing gene based methods motivated us to develop a new powerful method to identify disease associated genes using existing GWAS summary data. Methods and Results: In this paper, we propose a new truncated statistic method (TS) by utilizing a truncated method to find the genes that have a true contribution to the genetic association. Extensive simulation studies demonstrate that our proposed test outperforms other comparable tests. We applied TS and other comparable methods to the schizophrenia GWAS data and type 2 diabetes (T2D) GWAS meta-analysis summary data. TS identified more disease associated genes than comparable methods. Many of the significant genes identified by TS may have important mechanisms relevant to the associated traits. TS is implemented in C program TS, which is freely and publicly available online. Conclusions: The proposed truncated statistic outperforms existing methods. It can be employed to detect novel traits associated genes using GWAS summary data.",
                "authors": [
                    {
                        "name": "Gonzales S."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "date": "2020-05-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TS: A powerful truncated test to detect novel disease associated genes using publicly available gWAS summary data"
            },
            "pmcid": "PMC7199321",
            "pmid": "32366212"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
