{
    "additionDate": "2019-11-14T18:07:36Z",
    "biotoolsCURIE": "biotools:MLMDA",
    "biotoolsID": "MLMDA",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "zhengkai951211@gmail.com",
            "name": "Kai Zheng",
            "typeEntity": "Person"
        },
        {
            "email": "zhuhongyou@ms.xjb.ac.cn",
            "name": "Zhu-Hong You",
            "typeEntity": "Person"
        },
        {
            "email": "leiwang@ms.xjb.ac.cn",
            "name": "Lei Wang",
            "orcidid": "https://orcid.org/0000-0003-0184-307X",
            "typeEntity": "Person"
        }
    ],
    "description": "> HOMEPAGE MISSING! | a machine learning approach to predict and validate MicroRNA-disease associations by integrating of heterogenous information sources | BACKGROUND:Emerging evidences show that microRNA (miRNA) plays an important role in many human complex diseases. However, considering the inherent time-consuming and expensive of traditional in vitro experiments, more and more attention has been paid to the development of efficient and feasible computational methods to predict the potential associations between miRNA and disease. METHODS:In this work, we present a machine learning-based model called MLMDA for predicting the association of miRNAs and diseases. More specifically, we first use the k-mer sparse matrix to extract miRNA sequence information, and combine it with miRNA functional similarity, disease semantic similarity and Gaussian interaction profile kernel similarity information",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31395072",
    "lastUpdate": "2019-11-14T18:07:36Z",
    "name": "MLMDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12967-019-2009-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Emerging evidences show that microRNA (miRNA) plays an important role in many human complex diseases. However, considering the inherent time-consuming and expensive of traditional in vitro experiments, more and more attention has been paid to the development of efficient and feasible computational methods to predict the potential associations between miRNA and disease. Methods: In this work, we present a machine learning-based model called MLMDA for predicting the association of miRNAs and diseases. More specifically, we first use the k-mer sparse matrix to extract miRNA sequence information, and combine it with miRNA functional similarity, disease semantic similarity and Gaussian interaction profile kernel similarity information. Then, more representative features are extracted from them through deep auto-encoder neural network (AE). Finally, the random forest classifier is used to effectively predict potential miRNA-disease associations. Results: The experimental results show that the MLMDA model achieves promising performance under fivefold cross validations with AUC values of 0.9172, which is higher than the methods using different classifiers or different feature combination methods mentioned in this paper. In addition, to further evaluate the prediction performance of MLMDA model, case studies are carried out with three Human complex diseases including Lymphoma, Lung Neoplasm, and Esophageal Neoplasms. As a result, 39, 37 and 36 out of the top 40 predicted miRNAs are confirmed by other miRNA-disease association databases. Conclusions: These prominent experimental results suggest that the MLMDA model could serve as a useful tool guiding the future experimental validation for those promising miRNA biomarker candidates. The source code and datasets explored in this work are available at http://220.171.34.3:81/.",
                "authors": [
                    {
                        "name": "Zheng K."
                    },
                    {
                        "name": "You Z.-H."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Li L.-P."
                    },
                    {
                        "name": "Li Z.-W."
                    }
                ],
                "citationCount": 8,
                "date": "2019-08-08T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "MLMDA: A machine learning approach to predict and validate MicroRNA-disease associations by integrating of heterogenous information sources"
            },
            "pmcid": "PMC6688360",
            "pmid": "31395072"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}