
{
    "credit": [
        {
            "email": "tom_griffiths@brown.edu",
            "name": "Tom Griffiths",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://miso.readthedocs.io/en/fastmiso/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python",
            "C"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Through alternative splicing, most human genes express multiple isoforms that often differ in function. To infer isoform regulation from high-throughput sequencing of cDNA fragments (RNA-seq), we developed the mixture-of-isoforms (MISO) model, a statistical model that estimates expression of alternatively spliced exons and isoforms and assesses confidence in these estimates. Incorporation of mRNA fragment length distribution in paired-end RNA-seq greatly improved estimation of alternative-splicing levels. MISO also detects differentially regulated exons or isoforms. Application of MISO implicated the RNA splicing factor hnRNP H1 in the regulation of alternative cleavage and polyadenylation, a role that was supported by UV cross-linking- immunoprecipitation sequencing (CLIP-seq) analysis in human cells. Our results provide a probabilistic framework for RNA-seq analysis, give functional insights into pre-mRNA processing and yield guidelines for the optimal design of RNA-seq experiments for studies of gene and isoform expression. © 2010 Nature America, Inc. All rights reserved.",
            "authors": [
                "Katz Y.",
                "Wang E.T.",
                "Airoldi E.M.",
                "Burge C.B."
            ],
            "cit_count": 588,
            "journal": "Nature Methods",
            "pmid": "21057496",
            "title": "Analysis and design of RNA sequencing experiments for identifying isoform regulation",
            "year": "2010-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:miso",
        "biotoolsID": "miso",
        "description": "An alternative to Cufflinks, MISO (Mixture-of-Isoforms) is a probabilistic framework that quantitates the expression level of alternatively spliced genes.",
        "homepage": "http://genes.mit.edu/burgelab/miso/docs/#releases",
        "name": "MISO"
    }
}