{
    "additionDate": "2020-01-09T17:58:23Z",
    "biotoolsCURIE": "biotools:binnednp",
    "biotoolsID": "binnednp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andujar@ias.csic.es",
            "name": "José Luis González‐Andújar",
            "orcidid": "https://orcid.org/0000-0003-2356-4098",
            "typeEntity": "Person"
        }
    ],
    "description": "Analysis of interval-grouped data in weed science.\n\nNonparametric Estimation for Interval-Grouped Data.\n\nKernel density and distribution estimation for interval-grouped data (Reyes, Francisco-Fernandez and Cao 2016, 2017) <doi:10.1080/10485252.2016.1163348>, <doi:10.1007/s11749-017-0523-9>, (Gonzalez-Andujar, Francisco-Fernandez, Cao, Reyes, Urbano, Forcella and Bastida 2016) <doi:10.1111/wre.12216> and nonparametric estimation of seedling emergence indices (Cao, Francisco-Fernandez, Anand, Bastida and Gonzalez-Andujar 2011) <doi:10.1017/S002185961100030X>",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=binnednp",
    "lastUpdate": "2020-12-05T14:47:32.592257Z",
    "license": "GPL-3.0",
    "name": "binnednp",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/ECE3.5448",
            "metadata": {
                "abstract": "© 2019 The Authors. Ecology and Evolution published by John Wiley & Sons Ltd.Weed scientists are usually interested in the study of the distribution and density functions of the random variable that relates weed emergence with environmental indices like the hydrothermal time (HTT). However, in many situations, experimental data are presented in a grouped way and, therefore, the standard nonparametric kernel estimators cannot be computed. Kernel estimators for the density and distribution functions for interval-grouped data, as well as bootstrap confidence bands for these functions, have been proposed and implemented in the binnednp package. Analysis with different treatments can also be performed using a bootstrap approach and a Cramér-von Mises type distance. Several bandwidth selection procedures were also implemented. This package also allows to estimate different emergence indices that measure the shape of the data distribution. The values of these indices are useful for the selection of the soil depth at which HTT should be measured which, in turn, would maximize the predictive power of the proposed methods. This paper presents the functions of the package and provides an example using an emergence data set of Avena sterilis (wild oat). The binnednp package provides investigators with a unique set of tools allowing the weed science research community to analyze interval-grouped data.",
                "authors": [
                    {
                        "name": "Barreiro-Ures D."
                    },
                    {
                        "name": "Francisco-Fernandez M."
                    },
                    {
                        "name": "Cao R."
                    },
                    {
                        "name": "Fraguela B.B."
                    },
                    {
                        "name": "Doallo R."
                    },
                    {
                        "name": "Gonzalez-Andujar J.L."
                    },
                    {
                        "name": "Reyes M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Ecology and Evolution",
                "title": "Analysis of interval-grouped data in weed science: The binnednp Rcpp package"
            },
            "pmcid": "PMC6802074",
            "pmid": "31641444"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ]
}