{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:04:39Z",
    "biotoolsCURIE": "biotools:PrankWeb",
    "biotoolsID": "PrankWeb",
    "collectionID": [
        "ELIXIR-CZ"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hoksza@ksi.mff.cuni.cz",
            "name": "David Hoksza",
            "orcidid": "https://orcid.org/0000-0003-4679-0557",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web application for protein-ligand binding sites analysis and visualization | This repositary contains PrankWeb web application.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://prankweb.cz/help"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/cusbg/p2rank-framework/issues"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-CZ",
            "mar_nov"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Czech Republic"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                }
            ]
        }
    ],
    "homepage": "https://prankweb.cz/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-05-25T07:53:34Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cusbg/p2rank-framework/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cusbg/p2rank-framework"
        }
    ],
    "maturity": "Mature",
    "name": "PrankWeb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "davidhokszamff",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ424",
            "metadata": {
                "abstract": "© 2019 The Author(s).PrankWeb is an online resource providing an interface to P2Rank, a state-of-the-art method for ligand binding site prediction. P2Rank is a template-free machine learning method based on the prediction of local chemical neighborhood ligandability centered on points placed on a solvent-accessible protein surface. Points with a high ligandability score are then clustered to form the resulting ligand binding sites. In addition, PrankWeb provides a web interface enabling users to easily carry out the prediction and visually inspect the predicted binding sites via an integrated sequence-structure view. Moreover, PrankWeb can determine sequence conservation for the input molecule and use this in both the prediction and result visualization steps. Alongside its online visualization options, PrankWeb also offers the possibility of exporting the results as a PyMOL script for offline visualization. The web frontend communicates with the server side via a REST API. In high-throughput scenarios, therefore, users can utilize the server API directly, bypassing the need for a web-based frontend or installation of the P2Rank application. PrankWeb is available at http://prankweb.cz/, while the web application source code and the P2Rank method can be accessed at https://github.com/jendelel/PrankWebApp and https://github.com/rdk/p2rank, respectively.",
                "authors": [
                    {
                        "name": "Hoksza D."
                    },
                    {
                        "name": "Jendele L."
                    },
                    {
                        "name": "Krivak R."
                    },
                    {
                        "name": "Novotny M."
                    },
                    {
                        "name": "Skoda P."
                    }
                ],
                "citationCount": 37,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PrankWeb: a web server for ligand binding site prediction and visualization"
            },
            "pmcid": "PMC6602436",
            "pmid": "31114880",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/s13321-018-0285-8",
            "metadata": {
                "abstract": "© 2018, The Author(s).Background: Ligand binding site prediction from protein structure has many applications related to elucidation of protein function and structure based drug discovery. It often represents only one step of many in complex computational drug design efforts. Although many methods have been published to date, only few of them are suitable for use in automated pipelines or for processing large datasets. These use cases require stability and speed, which disqualifies many of the recently introduced tools that are either template based or available only as web servers. Results: We present P2Rank, a stand-alone template-free tool for prediction of ligand binding sites based on machine learning. It is based on prediction of ligandability of local chemical neighbourhoods that are centered on points placed on the solvent accessible surface of a protein. We show that P2Rank outperforms several existing tools, which include two widely used stand-alone tools (Fpocket, SiteHound), a comprehensive consensus based tool (MetaPocket 2.0), and a recent deep learning based method (DeepSite). P2Rank belongs to the fastest available tools (requires under 1 s for prediction on one protein), with additional advantage of multi-threaded implementation. Conclusions: P2Rank is a new open source software package for ligand binding site prediction from protein structure. It is available as a user-friendly stand-alone command line program and a Java library. P2Rank has a lightweight installation and does not depend on other bioinformatics tools or large structural or sequence databases. Thanks to its speed and ability to make fully automated predictions, it is particularly well suited for processing large datasets or as a component of scalable structural bioinformatics pipelines.",
                "authors": [
                    {
                        "name": "Hoksza D."
                    },
                    {
                        "name": "Krivak R."
                    }
                ],
                "citationCount": 26,
                "date": "2018-12-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "P2Rank: machine learning based tool for rapid and accurate prediction of ligand binding sites from protein structure"
            },
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}
