{
    "additionDate": "2019-11-14T20:11:35Z",
    "biotoolsCURIE": "biotools:find",
    "biotoolsID": "find",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "furlong@embl.de",
            "name": "Eileen E. M. Furlong",
            "typeEntity": "Person"
        },
        {
            "email": "ogt@cs.princeton.edu",
            "name": "Olga G. Troyanskaya",
            "typeEntity": "Person"
        }
    ],
    "description": "Accurate genome-wide predictions of spatio-temporal gene expression during embryonic development | Fly tissue-developmental stage expression predictions | FIND (Fly in silico nanodissection) is a webserver for exploring the Drosophila embryonic development tissue-developmental stage-specific gene expression predictions. The predictions can be queried by genes (Genes Query or Genes Bulk Query) or by tissue-stages (Tissues query). The Similar Genes Query tool allows finding genes with similar spatiotemporal expression patterns. The Tissue Finder Query tool allows finding relevant tissues from ranked gene lists such as differential expression",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://find.princeton.edu/predictions/download/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ]
        }
    ],
    "homepage": "http://find.princeton.edu",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T20:12:07Z",
    "name": "FIND",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PGEN.1008382",
            "metadata": {
                "abstract": "© 2019 Zhou et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Comprehensive information on the timing and location of gene expression is fundamental to our understanding of embryonic development and tissue formation. While high-throughput in situ hybridization projects provide invaluable information about developmental gene expression patterns for model organisms like Drosophila, the output of these experiments is primarily qualitative, and a high proportion of protein coding genes and most non-coding genes lack any annotation. Accurate data-centric predictions of spatio-temporal gene expression will therefore complement current in situ hybridization efforts. Here, we applied a machine learning approach by training models on all public gene expression and chromatin data, even from whole-organism experiments, to provide genome-wide, quantitative spatiotemporal predictions for all genes. We developed structured in silico nano-dissection, a computational approach that predicts gene expression in >200 tissue-developmental stages. The algorithm integrates expression signals from a compendium of 6,378 genome-wide expression and chromatin profiling experiments in a cell lineage-aware fashion. We systematically evaluated our performance via cross-validation and experimentally confirmed 22 new predictions for four different embryonic tissues. The model also predicts complex, multi-tissue expression and developmental regulation with high accuracy. We further show the potential of applying these genome-wide predictions to extract tissue specificity signals from non-tissue-dissected experiments, and to prioritize tissues and stages for disease modeling. This resource, together with the exploratory tools are freely available at our webserver http://find.princeton.edu, which provides a valuable tool for a range of applications, from predicting spatio-temporal expression patterns to recognizing tissue signatures from differential gene expression profiles.",
                "authors": [
                    {
                        "name": "Zhou J."
                    },
                    {
                        "name": "Schor I.E."
                    },
                    {
                        "name": "Yao V."
                    },
                    {
                        "name": "Theesfeld C.L."
                    },
                    {
                        "name": "Marco-Ferreres R."
                    },
                    {
                        "name": "Tadych A."
                    },
                    {
                        "name": "Furlong E.E.M."
                    },
                    {
                        "name": "Troyanskaya O.G."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "Accurate genome-wide predictions of spatiotemporal gene expression during embryonic development"
            },
            "pmcid": "PMC6779412",
            "pmid": "31553718"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}