{
    "accessibility": "Open access",
    "additionDate": "2018-08-02T10:05:27Z",
    "biotoolsCURIE": "biotools:pepbindpred",
    "biotoolsID": "pepbindpred",
    "credit": [
        {
            "name": "Prof. Dr. Denis C. Shields",
            "typeEntity": "Person",
            "typeRole": [
                "Support"
            ]
        },
        {
            "email": "waqasnayab@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PepBindPred is for users interested in identifying peptide binding regions within a protein sequence, which may bind to a know protein structure. PepBindPred was trained on a set of non-redundant protein sequences containing known peptide binding regions sourced from the ELM database.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioware.ucd.ie/~compass/biowareweb/Server_pages/pepbindpred.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        },
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "http://bioware.ucd.ie/~compass/biowareweb/Server_pages/pepbindpred.php",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bioware.ucd.ie/~compass/biowareweb/Server_pages/pepbindpred.php"
        }
    ],
    "maturity": "Mature",
    "name": "PepBindPred",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "WaqasuddinKhan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0072838",
            "metadata": {
                "abstract": "Disordered regions of proteins often bind to structured domains, mediating interactions within and between proteins. However, it is difficult to identify a priori the short disordered regions involved in binding. We set out to determine if docking such peptide regions to peptide binding domains would assist in these predictions.We assembled a redundancy reduced dataset of SLiM (Short Linear Motif) containing proteins from the ELM database. We selected 84 sequences which had an associated PDB structures showing the SLiM bound to a protein receptor, where the SLiM was found within a 50 residue region of the protein sequence which was predicted to be disordered. First, we investigated the Vina docking scores of overlapping tripeptides from the 50 residue SLiM containing disordered regions of the protein sequence to the corresponding PDB domain. We found only weak discrimination of docking scores between peptides involved in binding and adjacent non-binding peptides in this context (AUC 0.58).Next, we trained a bidirectional recurrent neural network (BRNN) using as input the protein sequence, predicted secondary structure, Vina docking score and predicted disorder score. The results were very promising (AUC 0.72) showing that multiple sources of information can be combined to produce results which are clearly superior to any single source.We conclude that the Vina docking score alone has only modest power to define the location of a peptide within a larger protein region known to contain it. However, combining this information with other knowledge (using machine learning methods) clearly improves the identification of peptide binding regions within a protein sequence. This approach combining docking with machine learning is primarily a predictor of binding to peptide-binding sites, and is not intended as a predictor of specificity of binding to particular receptors. © 2013 Khan et al.",
                "authors": [
                    {
                        "name": "Khan W."
                    },
                    {
                        "name": "Duffy F."
                    },
                    {
                        "name": "Pollastri G."
                    },
                    {
                        "name": "Shields D.C."
                    },
                    {
                        "name": "Mooney C."
                    }
                ],
                "citationCount": 21,
                "date": "2013-09-03T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Predicting Binding within Disordered Protein Regions to Structurally Characterised Peptide-Binding Domains"
            },
            "pmcid": "PMC3760854",
            "pmid": "24019881",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}