{"credit":[{"email":"D.Schomburg@tu-bs.de","name":"Prof. Dr. Dietmar Schomburg","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://cupsat.tu-bs.de/help.jsp"}],"function":[{"operation":[{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"},{"term":"Protein modelling (mutation)","uri":"http://edamontology.org/operation_0331"},{"term":"Protein secondary structure prediction","uri":"http://edamontology.org/operation_0267"},{"term":"Protein secondary structure analysis","uri":"http://edamontology.org/operation_2416"},{"term":"Protein structure analysis","uri":"http://edamontology.org/operation_2406"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein folding, stability and design","uri":"http://edamontology.org/topic_0130"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"publication":[{"abstract":"CUPSAT (Cologne University Protein Stability Analysis Tool) is a web tool to analyse and predict protein stability changes upon point mutations (single amino acid mutations). This program uses structural environment specific atom potentials and torsion angle potentials to predict ΔΔG, the difference in free energy of unfolding between wild-type and mutant proteins. It requires the protein structure in Protein Data Bank format and the location of the residue to be mutated. The output consists information about mutation site, its structural features (solvent accessibility, secondary structure and torsion angles), and comprehensive information about changes in protein stability for 19 possible substitutions of a specific amino acid mutation. Additionally, it also analyses the ability of the mutated amino acids to adapt the observed torsion angles. Results were tested on 1538 mutations from thermal denaturation and 1603 mutations from chemical denaturation experiments. Several validation tests (split-sample, jack-knife and k-fold) were carried out to ensure the reliability, accuracy and transferability of the prediction method that gives >80% prediction accuracy for most of these validation tests. Thus, the program serves as a valuable tool for the analysis of protein design and stability. The tool is accessible from the link http://cupsat.uni-koeln.de. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Parthiban V.","Gromiha M.M.","Schomburg D."],"cit_count":258,"journal":"Nucleic Acids Research","pmid":"16845001","title":"CUPSAT: Prediction of protein stability upon point mutations","year":"2006-07-01"}],"summary":{"biotoolsCURIE":"biotools:cupsat","biotoolsID":"cupsat","description":"Cologne University Protein Stability Analysis Tool (CUPSAT) is a tool to analyse and predict protein stability changes upon point mutations (single amino acid mutations) for known protein structures.","homepage":"http://cupsat.tu-bs.de/","name":"CUPSAT"}}