{"credit":[{"name":"ELIXIR-ITA-PADOVA","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"silvio.tosatto@unipd.it","name":"Silvio C.E. Tosatto","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://protein.bio.unipd.it/"}],"documentation":[{"type":"GENERAL","url":"http://protein.bio.unipd.it/frst/help.html"}],"function":[{"operation":[{"term":"Protein structure comparison","uri":"http://edamontology.org/operation_2487"}]}],"labels":{"license":"Other","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"}]},"publication":[{"abstract":"Scoring functions are widely used in the final step of model selection in protein structure prediction. This is of interest both for comparative modeling targets, where it is important to select the best model among a set of many good, \"correct\" ones, as well as for other (fold recognition or novel fold) targets, where the set may contain many incorrect models. A novel combination of four knowledge-based potentials recognizing different features of native protein structures is introduced and tested. The pairwise, solvation, hydrogen bond, and torsion angle potentials contain largely orthogonal information. Of these, the torsion angle potential is found to show the strongest correlation with model quality. Combining these features with a linear weighting function, it was possible to construct a robust energy function capable of discriminating native-like structures on several benchmarking sets. In a recent blind test (CAFASP-4 MQAP), the scoring function ranked consistently well and was able to reliably distinguish the correct template from an ensemble of high quality decoys in 52 of 70 cases (33 of 34 for comparative modeling). An executable version of the Victor/FRST function for Linux PCs is available for download from the URL http://protein.cribi.unipd.it/frst/. © Mary Ann Liebert, Inc.","authors":["Tosatto S.C.E."],"cit_count":91,"doi":"10.1089/cmb.2005.12.1316","journal":"Journal of Computational Biology","pmid":"16379537","title":"The Victor/FRST function for model quality estimation","type":"Primary","year":"2005-12-01"}],"summary":{"biotoolsCURIE":"biotools:frst","biotoolsID":"frst","description":"Serves to validate the energy of a protein structure. The server computes both an overall and a per-residue energy profile of a protein structure.","homepage":"http://protein.bio.unipd.it/frst","name":"FRST","version":["1.2"]}}