{
    "additionDate": "2017-01-17T15:03:41Z",
    "biotoolsCURIE": "biotools:gsva",
    "biotoolsID": "gsva",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "justin.guinney@sagebase.org",
            "name": "Justin Guinney",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Non-parametric, unsupervised method for estimating variation of gene set enrichment through the samples of an expression data set. It performs a change in coordinate systems, transforming the data from a gene by sample matrix to a gene-set by sample matrix, thereby allowing the evaluation of pathway enrichment for each sample. This new matrix of enrichment scores facilitates applying standard analytical methods like functional enrichment, survival analysis, etc., in a pathway-centric manner.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/GSVA.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GSVA_1.22.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/GSVA.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-09T16:23:37Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "http://www.sagebase.org"
        }
    ],
    "name": "GSVA",
    "operatingSystem": [
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-7",
            "metadata": {
                "abstract": "Background: Gene set enrichment (GSE) analysis is a popular framework for condensing information from gene expression profiles into a pathway or signature summary. The strengths of this approach over single gene analysis include noise and dimension reduction, as well as greater biological interpretability. As molecular profiling experiments move beyond simple case-control studies, robust and flexible GSE methodologies are needed that can model pathway activity within highly heterogeneous data sets. Results: To address this challenge, we introduce Gene Set Variation Analysis (GSVA), a GSE method that estimates variation of pathway activity over a sample population in an unsupervised manner. We demonstrate the robustness of GSVA in a comparison with current state of the art sample-wise enrichment methods. Further, we provide examples of its utility in differential pathway activity and survival analysis. Lastly, we show how GSVA works analogously with data from both microarray and RNA-seq experiments. Conclusions: GSVA provides increased power to detect subtle pathway activity changes over a sample population in comparison to corresponding methods. While GSE methods are generally regarded as end points of a bioinformatic analysis, GSVA constitutes a starting point to build pathway-centric models of biology. Moreover, GSVA contributes to the current need of GSE methods for RNA-seq data. GSVA is an open source software package for R which forms part of the Bioconductor project and can be downloaded at http://www.bioconductor.org. © 2013 Hänzelmann et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hanzelmann S."
                    },
                    {
                        "name": "Castelo R."
                    },
                    {
                        "name": "Guinney J."
                    }
                ],
                "citationCount": 1572,
                "date": "2013-01-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GSVA: Gene set variation analysis for microarray and RNA-Seq data"
            },
            "pmcid": "PMC3618321",
            "pmid": "23323831",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular genetics",
            "uri": "http://edamontology.org/topic_3321"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1,
    "version": [
        "1.22.0"
    ]
}