{
    "additionDate": "2015-08-25T06:57:48Z",
    "biotoolsCURIE": "biotools:multi_experiment_matrix",
    "biotoolsID": "multi_experiment_matrix",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "ELIXIR-EE",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "biit.support@ut.ee",
            "name": "Priit Adler",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web based tool for performing co-expression queries over large collections of gene expression experiments. It provides access to several hundreds of publicly available gene expression datasets of different tissues, diseases and conditions, arranged by the species and microarray platform types. The main user input is the name or ID of a query gene (various syononyms are accepted) and the choice of the collection of microarray experiments to be used in the co-expression query.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://biit.cs.ut.ee/mem/#intro"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Identifier (hybrid)",
                        "uri": "http://edamontology.org/data_2109"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Heat map",
                        "uri": "http://edamontology.org/data_1636"
                    }
                },
                {
                    "data": {
                        "term": "Processed microarray data",
                        "uri": "http://edamontology.org/data_3111"
                    }
                }
            ]
        }
    ],
    "homepage": "http://biit.cs.ut.ee/mem",
    "language": [
        "C++",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "maturity": "Mature",
    "name": "Multi Experiment Matrix",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1186/gb-2009-10-12-r139",
            "metadata": {
                "abstract": "We present a web resource MEM (Multi-Experiment Matrix) for gene expression similarity searches across many datasets. MEM features large collections of microarray datasets and utilizes rank aggregation to merge information from different datasets into a single global ordering with simultaneous statistical significance estimation. Unique features of MEM include automatic detection, characterization and visualization of datasets that includes the strongest coexpression patterns. MEM is freely available at http://biit.cs.ut.ee/mem/. © 2009 Adler et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Adler P."
                    },
                    {
                        "name": "Kolde R."
                    },
                    {
                        "name": "Kull M."
                    },
                    {
                        "name": "Tkachenko A."
                    },
                    {
                        "name": "Peterson H."
                    },
                    {
                        "name": "Reimand J."
                    },
                    {
                        "name": "Vilo J."
                    }
                ],
                "citationCount": 109,
                "date": "2009-12-04T00:00:00Z",
                "journal": "Genome Biology",
                "title": "Mining for coexpression across hundreds of datasets using novel rank aggregation and visualization methods"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/btr709",
            "metadata": {
                "abstract": "Motivation: The continued progress in developing technological platforms, availability of many published experimental datasets, as well as different statistical methods to analyze those data have allowed approaching the same research question using various methods simultaneously. To get the best out of all these alternatives, we need to integrate their results in an unbiased manner. Prioritized gene lists are a common result presentation method in genomic data analysis applications. Thus, the rank aggregation methods can become a useful and general solution for the integration task. Results: Standard rank aggregation methods are often ill-suited for biological settings where the gene lists are inherently noisy. As a remedy, we propose a novel robust rank aggregation (RRA) method. Our method detects genes that are ranked consistently better than expected under null hypothesis of uncorrelated inputs and assigns a significance score for each gene. The underlying probabilistic model makes the algorithm parameter free and robust to outliers, noise and errors. Significance scores also provide a rigorous way to keep only the statistically relevant genes in the final list. These properties make our approach robust and compelling for many settings. © The Author(s) 2012. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Kolde R."
                    },
                    {
                        "name": "Laur S."
                    },
                    {
                        "name": "Adler P."
                    },
                    {
                        "name": "Vilo J."
                    }
                ],
                "citationCount": 315,
                "date": "2012-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Robust rank aggregation for gene list integration and meta-analysis"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Data integration and warehousing",
            "uri": "http://edamontology.org/topic_3366"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}