{
    "accessibility": "Open access",
    "additionDate": "2024-05-19T15:37:53.989981Z",
    "biotoolsCURIE": "biotools:scqa",
    "biotoolsID": "scqa",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gjli@sdu.edu.cn",
            "name": "Guojun Li",
            "typeEntity": "Person"
        },
        {
            "name": "Di Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A dual-perspective cell type identification model for single cell transcriptome data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LD-Lyndee/scQA",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2024-05-19T15:37:53.992690Z",
    "name": "scQA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2023.12.021",
            "metadata": {
                "abstract": "Single-cell RNA sequencing technologies have been pivotal in advancing the development of algorithms for clustering heterogeneous cell populations. Existing methods for utilizing scRNA-seq data to identify cell types tend to neglect the beneficial impact of dropout events and perform clustering focusing solely on quantitative perspective. Here, we introduce a novel method named scQA, notable for its ability to concurrently identify cell types and cell type-specific key genes from both qualitative and quantitative perspectives. In contrast to other methods, scQA not only identifies cell types but also extracts key genes associated with these cell types, enabling bidirectional clustering for scRNA-seq data. Through an iterative process, our approach aims to minimize the number of landmarks to approximately a dozen while maximizing the inclusion of quasi-trend-preserved genes with dropouts both qualitatively and quantitatively. It then clusters cells by employing an ingenious label propagation strategy, obviating the requirement for a predetermined number of cell types. Validated on 20 publicly available scRNA-seq datasets, scQA consistently outperforms other salient tools. Furthermore, we confirm the effectiveness and potential biological significance of the identified key genes through both external and internal validation. In conclusion, scQA emerges as a valuable tool for investigating cell heterogeneity due to its distinctive fusion of qualitative and quantitative facets, along with bidirectional clustering capabilities. Furthermore, it can be seamlessly integrated into border scRNA-seq analyses. The source codes are publicly available at https://github.com/LD-Lyndee/scQA.",
                "authors": [
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Mei Q."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "scQA: A dual-perspective cell type identification model for single cell transcriptome data"
            },
            "pmcid": "PMC10791572",
            "pmid": "38235363"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
