{
    "additionDate": "2021-10-11T06:08:02.252310Z",
    "biotoolsCURIE": "biotools:modflex",
    "biotoolsID": "modflex",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "adam.godzik@medsch.ucr.edu",
            "name": "Adam Godzik",
            "orcidid": "https://orcid.org/0000-0002-2425-852X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The ModFlex server provides an interface with multiple options and tools, which make it possible to explore structural diversity in the available modeling templates and make an optimal choice. The server uses information from the previously developed PDBFlex database which is focused on structural flexibility and conformational diversity of proteins. The PDBFlex database contains structures that were extracted from the PDB and clustered based on sequence identity, such that each cluster represents an individual protein. The structures in each cluster were further grouped into subclusters based on structural similarity, such that each subcluster represents a distinct conformation of the protein. Thus, each cluster represents a protein, while each subcluster represents a specific conformation of that protein.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "https://modflex.org/",
    "lastUpdate": "2021-10-11T06:08:02.255006Z",
    "name": "ModFlex",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2021.166828",
            "metadata": {
                "abstract": "© 2021There is a wide, and continuously widening, gap between the number of proteins known only by their amino acid sequence versus those structurally characterized by direct experiment. To close this gap, we mostly rely on homology-based inference and modeling to reason about the structures of the uncharacterized proteins by using structures of homologous proteins as templates. With the rapidly growing size of the Protein Data Bank, there are often multiple choices of templates, including multiple sets of coordinates from the same protein. The substantial conformational differences observed between different experimental structures of the same protein often reflect function related structural flexibility. Thus, depending on the questions being asked, using distant homologs, or coordinate sets with lower resolution but solved in the appropriate functional form, as templates may be more informative. The ModFlex server (https://modflex.org/) addresses this seldom mentioned gap in the standard homology modeling approach by providing the user with an interface with multiple options and tools to select the most relevant template and explore the range of structural diversity in the available templates. ModFlex is closely integrated with a range of other programs and servers developed in our group for the analysis and visualization of protein structural flexibility and divergence.",
                "authors": [
                    {
                        "name": "Godzik A."
                    },
                    {
                        "name": "Iyer M."
                    },
                    {
                        "name": "Jaroszewski L."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Sedova M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-05-28T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "ModFlex: Towards Function Focused Protein Modeling"
            },
            "pmid": "33972023",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
