{
    "name": "DeviaTE", 
    "description": "Assembly-free analysis and visualization of mobile genetic element composition.", 
    "homepage": "https://github.com/W-L/deviaTE", 
    "biotoolsID": "DeviaTE", 
    "biotoolsCURIE": "biotools:DeviaTE", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3219", 
                    "term": "Read pre-processing"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0427", 
                    "term": "Transposon prediction"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0798", 
            "term": "Mobile genetic elements"
        }, 
        {
            "uri": "http://edamontology.org/topic_2885", 
            "term": "DNA polymorphism"
        }, 
        {
            "uri": "http://edamontology.org/topic_0749", 
            "term": "Transcription factors and regulatory sites"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "R", 
        "Perl", 
        "Python"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "https://github.com/W-L/deviaTE/issues", 
            "type": "Issue tracker", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/W-L/deviaTE/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1111/1755-0998.13030", 
            "pmid": "31056858", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "DeviaTE: Assembly-free analysis and visualization of mobile genetic element composition", 
                "abstract": "© 2019 The Authors. Molecular Ecology Resources Published by John Wiley & Sons LtdTransposable elements (TEs) are selfish DNA sequences that multiply within host genomes. They are present in most species investigated so far at varying degrees of abundance and sequence diversity. The TE composition may not only vary between but also within species and could have important biological implications. Variation in prevalence among populations may for example indicate a recent TE invasion, whereas sequence variation could indicate the presence of hyperactive or inactive forms. Gaining unbiased estimates of TE composition is thus vital for understanding the evolutionary dynamics of transposons. To this end, we developed DeviaTE, a tool to analyse and visualize TE abundance using Illumina or Sanger sequencing reads. Our tool requires sequencing reads of one or more samples (tissue, individual or population) and consensus sequences of TEs. It generates a table and a visual representation of TE composition. This allows for an intuitive assessment of coverage, sequence divergence, segregating SNPs and indels, as well as the presence of internal and terminal deletions. By contrasting the coverage between TEs and single copy genes, DeviaTE derives unbiased estimates of TE abundance. We show that naive approaches, which do not consider regions spanned by internal deletions, may substantially underestimate TE abundance. Using published data we demonstrate that DeviaTE can be used to study the TE composition within samples, identify clinal variation in TEs, compare TE diversity among species, and monitor TE invasions. Finally we present careful validations with publicly available and simulated data. DeviaTE is implemented in Python and distributed under the GPLv3 (https://github.com/W-L/deviaTE).", 
                "date": "2019-09-01T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Weilguny L."
                    }, 
                    {
                        "name": "Kofler R."
                    }
                ], 
                "journal": "Molecular Ecology Resources"
            }
        }
    ], 
    "credit": [], 
    "owner": "hans", 
    "additionDate": "2019-08-09T13:05:48Z", 
    "lastUpdate": "2019-10-31T11:52:11Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}