{
    "additionDate": "2017-02-14T09:36:46Z",
    "biotoolsCURIE": "biotools:rjprimers",
    "biotoolsID": "rjprimers",
    "credit": [
        {
            "email": "frank.you@agr.gc.ca",
            "name": "Dr. Frank M. You",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "RJPrimers is a web-based server that allows for accurate identification of unique repeat junctions using BLASTN against annotated repeat databases and a repeat junction finding algorithm. It also computes repeat junction-based primer design using Primer3 and BatchPrimer3.",
    "documentation": [
        {
            "type": "General",
            "url": "https://probes.pw.usda.gov/RJPrimers/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://probes.pw.usda.gov/RJPrimers/",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "RJPrimers",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Transposable elements (TE) exist in the genomes of nearly all eukaryotes. TE mobilization through 'cut-and-paste' or 'copy-and-paste' mechanisms causes their insertions into other repetitive sequences, gene loci and other DNA. An insertion of a TE commonly creates a unique TE junction in the genome. TE junctions are also randomly distributed along chromosomes and therefore useful for genome-wide marker development. Several TE-based marker systems have been developed and applied to genetic diversity assays, and to genetic and physical mapping. A software tool 'RJPrimers' reported here allows for accurate identification of unique repeat junctions using BLASTN against annotated repeat databases and a repeat junction finding algorithm, and then for fully automated high-throughput repeat junction-based primer design using Primer3 and BatchPrimer3. The software was tested using the rice genome and genomic sequences of Aegilops tauschii. Over 90% of repeat junction primers designed by RJPrimers were unique. At least one RJM marker per 10 Kb sequence of A. tauschii was expected with an estimate of over 0.45 million such markers in a genome of 4.02 Gb, providing an almost unlimited source of molecular markers for mapping large and complex genomes. A web-based server and a command line-based pipeline for RJPrimers are both available at http://wheat.pw.usda.gov/demos/RJPrimers/. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "You F.M."
                    },
                    {
                        "name": "Wanjugi H."
                    },
                    {
                        "name": "Huo N."
                    },
                    {
                        "name": "Lazo G.R."
                    },
                    {
                        "name": "Luo M.-C."
                    },
                    {
                        "name": "Anderson O.D."
                    },
                    {
                        "name": "Dvorak J."
                    },
                    {
                        "name": "Gu Y.Q."
                    }
                ],
                "citationCount": 21,
                "date": "2010-05-22T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RJPrimers: Unique transposable element insertion junction discovery and PCR primer design for marker development"
            },
            "pmid": "20497996"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        }
    ],
    "validated": 1
}