
{
    "credit": [
        {
            "email": "chengji@missouri.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://sysbio.rnet.missouri.edu/FRAGSION/MANUAL"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/fragsion-protein-fragment-library-generation.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2016. Motivation: Speed, accuracy and robustness of building protein fragment library have important implications in de novo protein structure prediction since fragment-based methods are one of the most successful approaches in template-free modeling (FM). Majority of the existing fragment detection methods rely on database-driven search strategies to identify candidate fragments, which are inherently time-consuming and often hinder the possibility to locate longer fragments due to the limited sizes of databases. Also, it is difficult to alleviate the effect of noisy sequencebased predicted features such as secondary structures on the quality of fragment. Results: Here, we present FRAGSION, a database-free method to efficiently generate protein fragment library by sampling from an Input-Output Hidden Markov Model. FRAGSION offers some unique features compared to existing approaches in that it (i) is lightning-fast, consuming only few seconds of CPU time to generate fragment library for a protein of typical length (300 residues); (ii) can generate dynamic-size fragments of any length (even for the whole protein sequence) and (iii) offers ways to handle noise in predicted secondary structure during fragment sampling. On a FM dataset from the most recent Critical Assessment of Structure Prediction, we demonstrate that FGRAGSION provides advantages over the state-of-the-art fragment picking protocol of ROSETTA suite by speeding up computation by several orders of magnitude while achieving comparable performance in fragment quality.",
            "authors": [
                "Bhattacharya D.",
                "Adhikari B.",
                "Li J.",
                "Cheng J."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "27153697",
            "title": "FRAGSION: Ultra-fast protein fragment library generation by IOHMM sampling",
            "year": "2016-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:fragsion",
        "biotoolsID": "fragsion",
        "description": "Database-free method to efficiently generate protein fragment library by sampling from an Input-Output Hidden Markov Model.",
        "homepage": "http://sysbio.rnet.missouri.edu/FRAGSION/",
        "name": "FRAGSION"
    }
}