{
    "additionDate": "2016-03-03T13:45:25Z",
    "biotoolsCURIE": "biotools:neemo",
    "biotoolsID": "neemo",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://protein.bio.unipd.it"
        }
    ],
    "description": "Tool for the evaluation of stability changes in proteins caused by amino-acid (AA) mutations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://protein.bio.unipd.it/neemo/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://protein.bio.unipd.it/neemo/",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "NeEMO",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1186/1471-2164-15-S4-S7",
            "metadata": {
                "abstract": "© 2014 Manuel et al.Background: The rapid growth of un-annotated missense variants poses challenges requiring novel strategies for their interpretation. From the thermodynamic point of view, amino acid changes can lead to a change in the internal energy of a protein and induce structural rearrangements. This is of great relevance for the study of diseases and protein design, justifying the development of prediction methods for variant-induced stability changes. Results: Here we propose NeEMO, a tool for the evaluation of stability changes using an effective representation of proteins based on residue interaction networks (RINs). RINs are used to extract useful features describing interactions of the mutant amino acid with its structural environment. Benchmarking shows NeEMO to be very effective, allowing reliable predictions in different parts of the protein such as β-strands and buried residues. Validation on a previously published independent dataset shows that NeEMO has a Pearson correlation coefficient of 0.77 and a standard error of 1 Kcal/mol, outperforming nine recent methods. The NeEMO web server can be freely accessed from URL: http://protein.bio.unipd.it/neemo/. Conclusions: NeEMO offers an innovative and reliable tool for the annotation of amino acid changes. A key contribution are RINs, which can be used for modeling proteins and their interactions effectively. Interestingly, the approach is very general, and can motivate the development of a new family of RIN-based protein structure analyzers. NeEMO may suggest innovative strategies for bioinformatics tools beyond protein stability prediction.",
                "authors": [
                    {
                        "name": "Giollo M."
                    },
                    {
                        "name": "Martin A.J.M."
                    },
                    {
                        "name": "Walsh I."
                    },
                    {
                        "name": "Ferrari C."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 60,
                "date": "2014-01-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "NeEMO: A method using residue interaction networks to improve prediction of protein stability upon mutation"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}