{
    "additionDate": "2021-01-18T12:00:39Z",
    "biotoolsCURIE": "biotools:cidacs-rl",
    "biotoolsID": "cidacs-rl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gcgbarbosa@gmail.com",
            "name": "George C. G. Barbosa",
            "orcidid": "https://orcid.org/0000-0003-3036-9899",
            "typeEntity": "Person"
        }
    ],
    "description": "CIDACS-RL is a indexing search and scoring-based record linkage system for huge datasets with high accuracy and scalability.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "homepage": "https://github.com/gcgbarbosa/cidacs-rl-v1",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-11T13:55:01Z",
    "license": "MIT",
    "name": "CIDACS-RL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12911-020-01285-W",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Record linkage is the process of identifying and combining records about the same individual from two or more different datasets. While there are many open source and commercial data linkage tools, the volume and complexity of currently available datasets for linkage pose a huge challenge; hence, designing an efficient linkage tool with reasonable accuracy and scalability is required. Methods: We developed CIDACS-RL (Centre for Data and Knowledge Integration for Health – Record Linkage), a novel iterative deterministic record linkage algorithm based on a combination of indexing search and scoring algorithms (provided by Apache Lucene). We described how the algorithm works and compared its performance with four open source linkage tools (AtyImo, Febrl, FRIL and RecLink) in terms of sensitivity and positive predictive value using gold standard dataset. We also evaluated its accuracy and scalability using a case-study and its scalability and execution time using a simulated cohort in serial (single core) and multi-core (eight core) computation settings. Results: Overall, CIDACS-RL algorithm had a superior performance: positive predictive value (99.93% versus AtyImo 99.30%, RecLink 99.5%, Febrl 98.86%, and FRIL 96.17%) and sensitivity (99.87% versus AtyImo 98.91%, RecLink 73.75%, Febrl 90.58%, and FRIL 74.66%). In the case study, using a ROC curve to choose the most appropriate cut-off value (0.896), the obtained metrics were: sensitivity = 92.5% (95% CI 92.07–92.99), specificity = 93.5% (95% CI 93.08–93.8) and area under the curve (AUC) = 97% (95% CI 96.97–97.35). The multi-core computation was about four times faster (150 seconds) than the serial setting (550 seconds) when using a dataset of 20 million records. Conclusion: CIDACS-RL algorithm is an innovative linkage tool for huge datasets, with higher accuracy, improved scalability, and substantially shorter execution time compared to other existing linkage tools. In addition, CIDACS-RL can be deployed on standard computers without the need for high-speed processors and distributed infrastructures.",
                "authors": [
                    {
                        "name": "Barbosa G.C.G."
                    },
                    {
                        "name": "Ali M.S."
                    },
                    {
                        "name": "Araujo B."
                    },
                    {
                        "name": "Reis S."
                    },
                    {
                        "name": "Sena S."
                    },
                    {
                        "name": "Ichihara M.Y.T."
                    },
                    {
                        "name": "Pescarini J."
                    },
                    {
                        "name": "Fiaccone R.L."
                    },
                    {
                        "name": "Amorim L.D."
                    },
                    {
                        "name": "Pita R."
                    },
                    {
                        "name": "Barreto M.E."
                    },
                    {
                        "name": "Smeeth L."
                    },
                    {
                        "name": "Barreto M.L."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "CIDACS-RL: a novel indexing search and scoring-based record linkage system for huge datasets with high accuracy and scalability"
            },
            "pmcid": "PMC7654019",
            "pmid": "33167998"
        }
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        }
    ]
}