{
    "additionDate": "2020-01-09T18:16:07Z",
    "biotoolsCURIE": "biotools:ikap_cells",
    "biotoolsID": "ikap_cells",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mehdi.pirooznia@nih.gov",
            "name": "Mehdi Pirooznia",
            "orcidid": "https://orcid.org/0000-0002-4210-6458",
            "typeEntity": "Person"
        }
    ],
    "description": "IKAP - Identifying K mAjor cell Population groups in single-cell RNA-seq analysis.\n\nIKAP – Identifying K mAjor cell Population groups in single-cell RNA-seq analysis.\n\nNote: IKAP will, by default, regress out the percentage of mitochondrial gene counts and total UMI counts and scale the expression matrix using Seurat ScaleData function. These two values should be save in Seurat metadata with column names 'percent.mito' and 'nUMI' respectively. If you want to regress out different confounding variables or use different column names, please save these variables in Seurat metadata and set 'confounders' (an IKAP parameter) as their column names in the Seurat metadata data frame.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NHLBI-BCB/IKAP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-04-16T06:26:59Z",
    "name": "IKAP_cells",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_017417"
        }
    ],
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ121",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Background: In single-cell RNA-sequencing analysis, clustering cells into groups and differentiating cell groups by differentially expressed (DE) genes are 2 separate steps for investigating cell identity. However, the ability to differentiate between cell groups could be affected by clustering. This interdependency often creates a bottleneck in the analysis pipeline, requiring researchers to repeat these 2 steps multiple times by setting different clustering parameters to identify a set of cell groups that are more differentiated and biologically relevant. Findings: To accelerate this process, we have developed IKAP-An algorithm to identify major cell groups and improve differentiating cell groups by systematically tuning parameters for clustering. We demonstrate that, with default parameters, IKAP successfully identifies major cell types such as T cells, B cells, natural killer cells, and monocytes in 2 peripheral blood mononuclear cell datasets and recovers major cell types in a previously published mouse cortex dataset. These major cell groups identified by IKAP present more distinguishing DE genes compared with cell groups generated by different combinations of clustering parameters. We further show that cell subtypes can be identified by recursively applying IKAP within identified major cell types, thereby delineating cell identities in a multi-layered ontology. Conclusions: By tuning the clustering parameters to identify major cell groups, IKAP greatly improves the automation of single-cell RNA-sequencing analysis to produce distinguishing DE genes and refine cell ontology using single-cell RNA-sequencing data.",
                "authors": [
                    {
                        "name": "Chen Y.-C."
                    },
                    {
                        "name": "Pirooznia M."
                    },
                    {
                        "name": "Seifuddin F."
                    },
                    {
                        "name": "Singh K."
                    },
                    {
                        "name": "Sun C."
                    },
                    {
                        "name": "Suresh A."
                    },
                    {
                        "name": "Underbayev C."
                    },
                    {
                        "name": "Wiestner A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "IKAP-Identifying K mAjor cell Population groups in single-cell RNA-sequencing analysis"
            },
            "pmcid": "PMC6771546",
            "pmid": "31574155"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
