{"credit":[{"name":"ELIXIR-ITA-SAPIENZA","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"support@modorama.org","name":"Jan Kosinski","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://modorama.org/"}],"function":[{"input":[{"data":{"term":"Protein sequence","uri":"http://edamontology.org/data_2976"},"format":[{"term":"FASTA","uri":"http://edamontology.org/format_1929"}]},{"data":{"term":"Protein structure","uri":"http://edamontology.org/data_1460"},"format":[{"term":"PDB","uri":"http://edamontology.org/format_1476"}]},{"data":{"term":"Sequence-structure alignment","uri":"http://edamontology.org/data_0893"}}],"note":"MODexplorer: Explores sequence, structure and function relationships in protein families and selects templates and perform homology modeling; MODalign: displays, evaluates and edits alignments for comparative (homology) modeling","operation":[{"term":"Protein modelling","uri":"http://edamontology.org/operation_0477"},{"term":"Sequence alignment refinement","uri":"http://edamontology.org/operation_2089"},{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"publication":[{"abstract":"Summary: MODexplorer is an integrated tool aimed at exploring the sequence, structural and functional diversity in protein families useful in homology modeling and in analyzing protein families in general. It takes as input either the sequence or the structure of a protein and provides alignments with its homologs along with a variety of structural and functional annotations through an interactive interface. The annotations include sequence conservation, similarity scores, ligand-, DNA- and RNA-binding sites, secondary structure, disorder, crystallographic structure resolution and quality scores of models implied by the alignments to the homologs of known structure. MODexplorer can be used to analyze sequence and structural conservation among the structures of similar proteins, to find structures of homologs solved in different conformational state or with different ligands and to transfer functional annotations. Furthermore, if the structure of the query is not known, MODexplorer can be used to select the modeling templates taking all this information into account and to build a comparative model. © The Author 2013. Published by Oxford University Press.","authors":["Kosinski J.","Barbato A.","Tramontano A."],"cit_count":12,"doi":"10.1093/bioinformatics/btt062","journal":"Bioinformatics","title":"MODexplorer: An integrated tool for exploring protein sequence, structure and function relationships","type":"Primary","year":"2013-04-01"},{"abstract":"MODalign is an interactive web-based tool aimed at helping protein structure modelers to inspect and manually modify the alignment between the sequences of a target protein and of its template(s). It interactively computes, displays and, upon modification of the target-template alignment, updates the multiple sequence alignments of the two protein families, their conservation score, secondary structure and solvent accessibility values, and local quality scores of the implied three-dimensional model(s). Although it has been designed to simplify the target-template alignment step in modeling, it is suitable for all cases where a sequence alignment needs to be inspected in the context of other biological information. © The Author(s) 2012. Published by Oxford University Press.","authors":["Barbato A.","Benkert P.","Schwede T.","Tramontano A.","Kosinski J."],"cit_count":10,"doi":"10.1093/bioinformatics/bts070","journal":"Bioinformatics","title":"Improving your target-template alignment with MODalign","type":"Other","year":"2012-04-01"}],"summary":{"biotoolsCURIE":"biotools:modorama","biotoolsID":"modorama","description":"At MODORAMA two applications can be run: MODexplorer, an integrated tool for exploring protein sequence, structure and function relationships, and MODalign, a rich alignment editor to improve target-template alignments","homepage":"http://modorama.org","name":"MODORAMA","version":["1.0"]}}