{
    "additionDate": "2017-02-10T14:14:53Z",
    "biotoolsCURIE": "biotools:tfbscluster",
    "biotoolsID": "tfbscluster",
    "credit": [
        {
            "email": "cimr-hscl-mail@lists.cam.ac.uk",
            "name": "TFBScluster Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TFBScluster is a web tool designed to identify clusters of transcription factor binding sites (TFBSs) conserved in mammalian and mouse genomes. By entering a specified range of TFBS, you can retrieve a list of SWISS-PROT characterized genes to which the clusters are localized.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://hscl.cimr.cam.ac.uk/TFBScluster_genome_35_filters_instruct.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://hscl.cimr.cam.ac.uk/TFBScluster_genome_portal.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "TFBScluster",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Identification of transcriptional regulatory elements represents a critical step in our ability to reconstruct transcriptional regulatory networks from gene expression profiling datasets. To facilitate computational identification of candidate gene regulatory elements from whole genome sequences, we have developed the TFBScluster web server that integrates several tools for the genome-wide identification and subsequent characterization of transcription factor binding site clusters that are conserved in multiple mammalian species. Either the human or mouse genomes can be used as the reference sequence with direct links from the search results to the ENSEMBL and UCSC genome browsers. Moreover, TFBScluster provides seamless integration of transcription factor binding site searches with genome annotation and gene expression profiling data, to allow prioritising computational predictions for subsequent experimental validation. TFBScluster is publicly available at http://hscl.cimr.cam.ac.uk/TFBScluster_genome_portal.html. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Donaldson I.J."
                    },
                    {
                        "name": "Gottgens B."
                    }
                ],
                "citationCount": 7,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TFBScluster web server for the identification of mammalian composite regulatory elements"
            },
            "pmid": "16845063"
        },
        {
            "metadata": {
                "abstract": "Summary: One major challenge of the post-sequencing era of the human genome project will be the functional annotation of the non-coding portion of the genome, in particular gene regulatory sequences. We have developed a new web-based tool, TFBScluster, which performs genome-wide identification of transcription factor binding site clusters that are conserved in multiple mammalian genomes. Clusters representing candidate gene regulatory elements can be filtered further, based on the presence or absence of additional user-defined DNA sequence motifs or by constraining the orientation or order of binding sites. Comprehensive results files, returned by email, are designed to facilitate experimental validation of computationally identified candidate gene regulatory sequences. TFBScluster, therefore, has the potential to contribute to deciphering transcriptional networks that regulate a wide range of mammalian developmental processes. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Chapman M."
                    },
                    {
                        "name": "Donaldson I.J."
                    },
                    {
                        "name": "Gottgens B."
                    }
                ],
                "citationCount": 23,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "TFBScluster: A resource for the characterization of transcriptional regulatory networks"
            },
            "pmid": "15855248"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
