{
    "accessibility": "Open access",
    "additionDate": "2022-11-03T20:11:12.756754Z",
    "biotoolsCURIE": "biotools:psp-gnm",
    "biotoolsID": "psp-gnm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Sambit Kumar Mishra",
            "orcidid": "https://orcid.org/0000-0001-8319-0599"
        }
    ],
    "description": "Predicting Protein Stability Changes upon Point Mutations with a Gaussian Network Model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sambitmishra0628/PSP-GNM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:23:37.729912Z",
    "license": "MIT",
    "name": "PSP-GNM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3390/ijms231810711",
            "metadata": {
                "abstract": "Understanding the effects of missense mutations on protein stability is a widely acknowledged significant biological problem. Genomic missense mutations may alter one or more amino acids, leading to increased or decreased stability of the encoded proteins. In this study, we describe a novel approach—Protein Stability Prediction with a Gaussian Network Model (PSP-GNM)—to measure the unfolding Gibbs free energy change (ΔΔG) and evaluate the effects of single amino acid substitutions on protein stability. Specifically, PSP-GNM employs a coarse-grained Gaussian Network Model (GNM) that has interactions between amino acids weighted by the Miyazawa–Jernigan statistical potential. We used PSP-GNM to simulate partial unfolding of the wildtype and mutant protein structures, and then used the difference in the energies and entropies of the unfolded wildtype and mutant proteins to calculate ΔΔG. The extent of the agreement between the ΔΔG calculated by PSP-GNM and the experimental ΔΔG was evaluated on three benchmark datasets: 350 forward mutations (S350 dataset), 669 forward and reverse mutations (S669 dataset) and 611 forward and reverse mutations (S611 dataset). We observed a Pearson correlation coefficient as high as 0.61, which is comparable to many of the existing state-of-the-art methods. The agreement with experimental ΔΔG further increased when we considered only those measurements made close to 25 °C and neutral pH, suggesting dependence on experimental conditions. We also assessed for the antisymmetry (ΔΔGreverse = −ΔΔGforward) between the forward and reverse mutations on the Ssym+ dataset, which has 352 forward and reverse mutations. While most available methods do not display significant antisymmetry, PSP-GNM demonstrated near-perfect antisymmetry, with a Pearson correlation of −0.97. PSP-GNM is written in Python and can be downloaded as a stand-alone code.",
                "authors": [
                    {
                        "name": "Mishra S.K."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "PSP-GNM: Predicting Protein Stability Changes upon Point Mutations with a Gaussian Network Model"
            },
            "pmcid": "PMC9505940",
            "pmid": "36142614"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
