{
    "additionDate": "2020-01-09T17:56:30Z",
    "biotoolsCURIE": "biotools:australian_cancer_atlas",
    "biotoolsID": "australian_cancer_atlas",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "PeterBaade@cancerqld.org.au",
            "name": "Peter D. Baade",
            "orcidid": "https://orcid.org/0000-0001-8576-8868",
            "typeEntity": "Person"
        }
    ],
    "description": "spatial modelling, visualisation, and reporting of estimates.\n\nAn interactive, online atlas designed to show how the burden of cancer varies across small geographical areas for the whole country, using the latest available data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://atlas.cancer.org.au",
    "lastUpdate": "2020-12-22T06:29:51Z",
    "name": "Australian Cancer Atlas",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12942-019-0185-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: It is well known that the burden caused by cancer can vary geographically, which may relate to differences in health, economics or lifestyle. However, to date, there was no comprehensive picture of how the cancer burden, measured by cancer incidence and survival, varied by small geographical area across Australia. Methods: The Atlas consists of 2148 Statistical Areas level 2 across Australia defined by the Australian Statistical Geography Standard which provide the best compromise between small population and small area. Cancer burden was estimated for males, females, and persons separately, with 50 unique sex-specific (males, females, all persons) cancer types analysed. Incidence and relative survival were modelled with Bayesian spatial models using the Leroux prior which was carefully selected to provide adequate spatial smoothing while reflecting genuine geographic variation. Markov Chain Monte Carlo estimation was used because it facilitates quantifying the uncertainty of the posterior estimates numerically and visually. Results: The results of the statistical model and visualisation development were published through the release of the Australian Cancer Atlas (https://atlas.cancer.org.au) in September, 2018. The Australian Cancer Atlas provides the first freely available, digital, interactive picture of cancer incidence and survival at the small geographical level across Australia with a focus on incorporating uncertainty, while also providing the tools necessary for accurate estimation and appropriate interpretation and decision making. Conclusions: The success of the Atlas will be measured by how widely it is used by key stakeholders to guide research and inform decision making. It is hoped that the Atlas and the methodology behind it motivates new research opportunities that lead to improvements in our understanding of the geographical patterns of cancer burden, possible causes or risk factors, and the reasons for differences in variation between cancer types, both within Australia and globally. Future versions of the Atlas are planned to include new data sources to include indicators such as cancer screening and treatment, and extensions to the statistical methods to incorporate changes in geographical patterns over time.",
                "authors": [
                    {
                        "name": "Duncan E.W."
                    },
                    {
                        "name": "Cramb S.M."
                    },
                    {
                        "name": "Aitken J.F."
                    },
                    {
                        "name": "Mengersen K.L."
                    },
                    {
                        "name": "Baade P.D."
                    }
                ],
                "citationCount": 7,
                "date": "2019-10-01T00:00:00Z",
                "journal": "International Journal of Health Geographics",
                "title": "Development of the Australian Cancer Atlas: Spatial modelling, visualisation, and reporting of estimates"
            },
            "pmcid": "PMC6771109",
            "pmid": "31570101"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}