{
    "accessibility": "Open access",
    "additionDate": "2022-04-28T14:49:50.414684Z",
    "biotoolsCURIE": "biotools:tiedie",
    "biotoolsID": "tiedie",
    "collectionID": [
        "PerMedCoE"
    ],
    "cost": "Free of charge",
    "description": "Application of TieDIE to The Cancer Genome Atlas and a breast cancer cell line dataset identified key signaling pathways, with examples impinging on MYC activity. Interlinking genes are predicted to correspond to essential components of cancer signaling and may provide a mechanistic explanation of tumor character and suggest subtype-specific drug targets.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/epaull/TieDIE",
    "language": [
        "MATLAB",
        "Python",
        "R"
    ],
    "lastUpdate": "2022-08-01T15:57:34.248161Z",
    "license": "GPL-3.0",
    "name": "TieDie",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "tntiniak",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt471",
            "metadata": {
                "abstract": "Motivation: Identifying the cellular wiring that connects genomic perturbations to transcriptional changes in cancer is essential to gain a mechanistic understanding of disease initiation, progression and ultimately to predict drug response. We have developed a method called Tied Diffusion Through Interacting Events (TieDIE) that uses a network diffusion approach to connect genomic perturbations to gene expression changes characteristic of cancer subtypes. The method computes a subnetwork of protein-protein interactions, predicted transcription factor-to-target connections and curated interactions from literature that connects genomic and transcriptomic perturbations. Results: Application of TieDIE to The Cancer Genome Atlas and a breast cancer cell line dataset identified key signaling pathways, with examples impinging on MYC activity. Interlinking genes are predicted to correspond to essential components of cancer signaling and may provide a mechanistic explanation of tumor character and suggest subtype-specific drug targets. Availability: Software is available from the Stuart lab's wiki: https://sysbiowiki.soe.ucsc.edu/tiedie. © 2013 The Author 2013.",
                "authors": [
                    {
                        "name": "Carlin D.E."
                    },
                    {
                        "name": "Haussler D."
                    },
                    {
                        "name": "Niepel M."
                    },
                    {
                        "name": "Paull E.O."
                    },
                    {
                        "name": "Sorger P.K."
                    },
                    {
                        "name": "Stuart J.M."
                    }
                ],
                "citationCount": 118,
                "date": "2013-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Discovering causal pathways linking genomic events to transcriptional states using Tied Diffusion Through Interacting Events (TieDIE)"
            }
        }
    ]
}
