{
    "additionDate": "2017-01-17T15:01:33Z",
    "biotoolsCURIE": "biotools:opencyto",
    "biotoolsID": "opencyto",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "wjiang2@fhcrc.org",
            "name": "Mike Jiang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package is designed to facilitate the automated gating methods in sequential way to mimic the manual gating strategy.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/openCyto.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/openCyto_1.12.1.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/openCyto.html",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2019-01-10T15:27:16Z",
    "license": "Artistic-2.0",
    "name": "openCyto",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1003806",
            "metadata": {
                "abstract": "© 2014 Finak et al.Flow cytometry is used increasingly in clinical research for cancer, immunology and vaccines. Technological advances in cytometry instrumentation are increasing the size and dimensionality of data sets, posing a challenge for traditional data management and analysis. Automated analysis methods, despite a general consensus of their importance to the future of the field, have been slow to gain widespread adoption. Here we present OpenCyto, a new BioConductor infrastructure and data analysis framework designed to lower the barrier of entry to automated flow data analysis algorithms by addressing key areas that we believe have held back wider adoption of automated approaches. OpenCyto supports end-to-end data analysis that is robust and reproducible while generating results that are easy to interpret. We have improved the existing, widely used core BioConductor flow cytometry infrastructure by allowing analysis to scale in a memory efficient manner to the large flow data sets that arise in clinical trials, and integrating domain-specific knowledge as part of the pipeline through the hierarchical relationships among cell populations. Pipelines are defined through a text-based csv file, limiting the need to write data-specific code, and are data agnostic to simplify repetitive analysis for core facilities. We demonstrate how to analyze two large cytometry data sets: an intracellular cytokine staining (ICS) data set from a published HIV vaccine trial focused on detecting rare, antigen-specific T-cell populations, where we identify a new subset of CD8 T-cells with a vaccine-regimen specific response that could not be identified through manual analysis, and a CyTOF T-cell phenotyping data set where a large staining panel and many cell populations are a challenge for traditional analysis. The substantial improvements to the core BioConductor flow cytometry packages give OpenCyto the potential for wide adoption. It can rapidly leverage new developments in computational cytometry and facilitate reproducible analysis in a unified environment.",
                "authors": [
                    {
                        "name": "Davis M.M."
                    },
                    {
                        "name": "De Rosa S.C."
                    },
                    {
                        "name": "Finak G."
                    },
                    {
                        "name": "Frelinger J."
                    },
                    {
                        "name": "Gottardo R."
                    },
                    {
                        "name": "Jiang W."
                    },
                    {
                        "name": "Kalams S.A."
                    },
                    {
                        "name": "Newell E.W."
                    },
                    {
                        "name": "Ramey J."
                    }
                ],
                "citationCount": 98,
                "date": "2014-08-28T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "OpenCyto: An Open Source Infrastructure for Scalable, Robust, Reproducible, and Automated, End-to-End Flow Cytometry Data Analysis"
            },
            "pmcid": "PMC4148203",
            "pmid": "25167361",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ],
    "validated": 1,
    "version": [
        "1.12.1"
    ]
}
