{
    "additionDate": "2021-03-19T09:11:51Z",
    "biotoolsCURIE": "biotools:openmandible",
    "biotoolsID": "openmandible",
    "confidence_flag": "tool",
    "description": "An open-source framework for highly realistic numerical modelling of lower mandible physiology.\n\nComputer simulations enhanced the development of many medical devices and have been extensively used in studying human jaw physiology.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ArsoVukicevic/OpenMandible",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2021-03-26T12:47:43Z",
    "name": "OpenMandible",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.DENTAL.2021.01.009",
            "metadata": {
                "abstract": "© 2021 The Academy of Dental MaterialsObjective: Computer modeling of lower mandible physiology remains challenging because prescribing realistic material characteristics and boundary conditions from medical scans requires advanced equipment and skill sets. The objective of this study is to provide a framework that could reduce simplifications made and inconsistency (in terms of geometry, materials, and boundary conditions) among further studies on the topic. Methods: The OpenMandible framework offers: 1) the first publicly available multiscale model of the mandible developed by combining cone beam computerized tomography (CBCT) and μCT imaging modalities, and 2) a C++ software tool for the generation of simulation-ready models (tet4 and hex8 elements). In addition to the application of conventional (Neumann and Dirichlet) boundary conditions, OpenMandible introduces a novel geodesic wave propagation - based approach for incorporating orthotropic micromechanical characteristics of cortical bone, and a unique algorithm for modeling muscles as uniformly directed vectors. The base intact model includes the mandible (spongy and compact bone), 14 teeth (comprising dentin, enamel, periodontal ligament, and pulp), simplified temporomandibular joints, and masticatory muscles (masseter, temporalis, medial, and lateral pterygoid). Results: The complete source code, executables, showcases, and sample data are freely available on the public repository: https://github.com/ArsoVukicevic/OpenMandible. It has been demonstrated that by slightly editing the baseline model, one can study different “virtual” treatments or diseases, including tooth restoration, placement of implants, mandible bone degradation, and others. Significance: OpenMandible eases the community to undertake a broad range of studies on the topic, while increasing their consistency and reproducibility. At the same time, the needs for dedicated equipment and skills for developing realistic simulation models are significantly reduced.",
                "authors": [
                    {
                        "name": "Vukicevic A.M."
                    },
                    {
                        "name": "Zelic K."
                    },
                    {
                        "name": "Milasinovic D."
                    },
                    {
                        "name": "Sarrami-Foroushani A."
                    },
                    {
                        "name": "Jovicic G."
                    },
                    {
                        "name": "Milovanovic P."
                    },
                    {
                        "name": "Djuric M."
                    },
                    {
                        "name": "Filipovic N."
                    },
                    {
                        "name": "Frangi A.F."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-01T00:00:00Z",
                "journal": "Dental Materials",
                "title": "OpenMandible: An open-source framework for highly realistic numerical modelling of lower mandible physiology"
            },
            "pmid": "33602549"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Dentistry",
            "uri": "http://edamontology.org/topic_3405"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}