
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.helmholtz-muenchen.de/en/ige/index.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://www.helmholtz-muenchen.de/fileadmin/GENEPI/downloads/COPYRIGHT.ghi-1.3"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Disease",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Linkage",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/genehunter-imprinting-1-3-genehunter-modscore-3-0-genehunter-twolocus-1-3-modification-genehunter.html"
        }
    ],
    "publication": [
        {
            "abstract": "We present two extensions to linkage analysis for genetically complex traits. The first extension allows investigators to perform parametric (LOD- score) analysis of traits caused by imprinted genes - that is, of traits showing a parent-of-origin effect. By specification of two heterozygote penetrance parameters, paternal and maternal origin of the mutation can be treated differently in terms of probability of expression of the trait. Therefore, a single-disease-locus-imprinting model includes four penetrances instead of only three. In the second extension, parametric and nonparametric linkage analysis with two trait loci is formulated for a multimarker setting, optionally taking imprinting into account. We have implemented both methods into the program GENEHUNTER. The new tools, GENEHUNTER-IMPRINTING and GENEHUNTER-TWOLOCUS, were applied to human family data for sensitization to mite allergens. The data set comprises pedigrees from England, Germany, Italy, and Portugal. With single-disease-locus-imprinting MOD-score analysis, we find several regions that show at least suggestive evidence for linkage. Most prominently, a maximum LOD score of 4.76 is obtained near D8S511, for the English population, when a model that implies complete maternal imprinting is used. Parametric two-trait-locus analysis yields a maximum LOD score of 6.09 for the German population, occurring exactly at D4S430 and D18S452. The heterogeneity model specified for analysis alludes to complete maternal imprinting at both disease loci. Altogether, our results suggest that the two novel formulations of linkage analysis provide valuable tools for genetic mapping of multifactorial traits.",
            "authors": [
                "Strauch K.",
                "Fimmers R.",
                "Kurz T.",
                "Deichmann K.A.",
                "Wienker T.F.",
                "Baur M.P."
            ],
            "cit_count": 146,
            "doi": "10.1086/302911",
            "journal": "American Journal of Human Genetics",
            "title": "Parametric and nonparametric multipoint linkage analysis with imprinting and two-locus-trait models: Application to mite sensitization",
            "type": "Primary",
            "year": "2000-01-01"
        },
        {
            "abstract": "The asymptotic distribution of [MOD] scores under the null hypothesis of no linkage is only known for affected sib pairs and other types of affected relative pairs. We have extended the GENEHUNTER-MODSCORE program to allow for simulations under the null hypothesis of no linkage to determine the empirical significance of MOD-score results in general situations. We performed simulations with families of different size (one million replicates of 500 families per simulation setting) to thoroughly investigate the impact of the pedigree size on the null distribution of multipoint MOD scores. It is shown that the distribution is dependent on the size and structure of the pedigrees under study. By performing simulations in the context of MOD-score analysis, our new tool efficiently explores the linkage data in a comprehensive way and also provides a valid method to inferentially test for linkage. © 2007 Wiley-Liss, Inc.",
            "authors": [
                "Mattheisen M.",
                "Dietter J.",
                "Knapp M.",
                "Baur M.P.",
                "Strauch K."
            ],
            "cit_count": 12,
            "doi": "10.1002/gepi.20264",
            "journal": "Genetic Epidemiology",
            "title": "Inferential testing for linkage with GENEHUNTER-MODSCORE: The impact of the pedigree structure on the null distribution of multipoint MOD scores",
            "type": "Primary",
            "year": "2008-01-01"
        },
        {
            "abstract": "We have optimized and parallelized the GENEHUNTER-TWOLOCUS program that allows to perform linkage analysis with two trait loci in the multimarker context. The optimization of the serial program, before parallelization, results in a speedup of a factor of more than 10. The parallelization affects the two-locus-score calculation, which is predominant in terms of computation time. We obtain perfect speedup, that is, the computation time decreases exactly by a factor of the number of processors. In addition, two-locus LOD and NPL scores are now calculated for varying genetic positions of both disease loci, not just one locus varied and the position of the other, disease locus fixed, as before. This results in easily interpretable 3-D plots. We have reanalyzed a pedigree with hypercholesterolemia using our new version of GENEHUNTER-TWOLOCUS. Whereas originally, two individuals had to be discarded due to excessive computation-time demands, the entire 17-bit pedigree could now be analyzed as a whole. We obtain a two-trait-locus LOD score of 5.49 under a multiplicative model, compared to LOD scores of 3.08 and 2.87 under a heterogeneity and additive model, respectively. This further increases evidence for linkage to both 1p36.1-p35 and 13822-q32 regions, and corroborates the hypothesis that the two genes act in a multiplicative way on LDL cholesterol level. Furthermore, we compare the computation times for two-trait-locus analysis needed by the programs GENEHUNTER-TWOLOCUS, TLINKAGE, and SUPERLINK. Altogether, our algorithmic improvements of GENEHUNTER-TWOLOCUS allow researchers to analyze complex diseases under realistic two-trait-locus models with pedigrees of reasonable size and using many markers. © 2004 Nature Publishing Group. All rights reserved.",
            "authors": [
                "Dietter J.",
                "Spiegel A.",
                "an Mey D.",
                "Pflug H.-J.",
                "Al-Kateb H.",
                "Hoffman K.",
                "Wienker T.F.",
                "Strauch K."
            ],
            "cit_count": 14,
            "doi": "10.1038/sj.ejhg.5201196",
            "journal": "European Journal of Human Genetics",
            "title": "Efficient two-trait-locus linkage analysis through program optimization and parallelization: Application to hypercholesterolemia",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:genehunter-imprinting",
        "biotoolsID": "genehunter-imprinting",
        "description": "It is a modification of the GENEHUNTER software package . It allows for a parametric multi-marker linkage analysis of dichotomous traits caused by imprinted genes. By specification of two heterozygote penetrance parameters, paternal and maternal origin of the disease allele can be treated differently in terms of probability of expression of the trait. Therefore, a disease model which accounts for imprinting includes four penetrances instead of only three.",
        "homepage": "http://www.helmholtz-muenchen.de/en/ige/service/software-download/genehunter-imprinting/index.html#c63682",
        "name": "GENEHUNTER-IMPRINTING",
        "version": [
            "2.1r3"
        ]
    }
}