{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2024-05-14T13:22:19.061854Z",
    "biotoolsCURIE": "biotools:srt-server",
    "biotoolsID": "srt-server",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xzhousph@umich.edu",
            "name": "Xiang Zhou",
            "orcidid": "https://orcid.org/0000-0002-4331-7599",
            "typeEntity": "Person"
        },
        {
            "email": "yangsheng@njmu.edu.cn",
            "name": "Sheng Yang",
            "orcidid": "https://orcid.org/0000-0003-3657-8771",
            "typeEntity": "Person"
        }
    ],
    "description": "SRT-Server performs the analysis of spatial resolved transcriptomics (SRT) data. It includes quality control (QC), spatially variable gene detection (SVG), deconvolution (DECON and DECON_PY), cell typing (CT), spatial domain detection (SDD), differential gene expression analysis (DEG), gene set enrichment analysis (GSEA), cell-cell communication identification (CCC) and pseudo-time trajectory inference (TRAJ).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://spatialtranscriptomicsanalysis.com/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:00:56.347645Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/biostat0903/SRT-Server"
        }
    ],
    "name": "SRT-Server",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s13073-024-01288-6",
            "metadata": {
                "abstract": "Background: Spatial resolved transcriptomics (SRT) encompasses a rapidly developing set of technologies that enable the measurement of gene expression in tissue while retaining spatial localization information. SRT technologies and the enabled SRT studies have provided unprecedent insights into the structural and functional underpinnings of complex tissues. As SRT technologies have advanced and an increasing number of SRT studies have emerged, numerous sophisticated statistical and computational methods have been developed to facilitate the analysis and interpretation of SRT data. However, despite the growing popularity of SRT studies and the widespread availability of SRT analysis methods, analysis of large-scale and complex SRT datasets remains challenging and not easily accessible to researchers with limited statistical and computational backgrounds. Results: Here, we present SRT-Server, the first webserver designed to carry out comprehensive SRT analyses for a wide variety of SRT technologies while requiring minimal prior computational knowledge. Implemented with cutting-edge web development technologies, SRT-Server is user-friendly and features multiple analytic modules that can perform a range of SRT analyses. With a flowchart-style interface, these different analytic modules on the SRT-Server can be dragged into the main panel and connected to each other to create custom analytic pipelines. SRT-Server then automatically executes the desired analyses, generates corresponding figures, and outputs results—all without requiring prior programming knowledge. We demonstrate the advantages of SRT-Server through three case studies utilizing SRT data collected from two common platforms, highlighting its versatility and values to researchers with varying analytic expertise. Conclusions: Overall, SRT-Server presents a user-friendly, efficient, effective, secure, and expandable solution for SRT data analysis, opening new doors for researchers in the field. SRT-Server is freely available at https://spatialtranscriptomicsanalysis.com/ .",
                "authors": [
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Zhou X."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "SRT-Server: powering the analysis of spatial transcriptomic data"
            },
            "pmcid": "PMC10811909",
            "pmid": "38279156"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
