{
    "additionDate": "2021-11-01T12:58:32.605095Z",
    "biotoolsCURIE": "biotools:pepformer",
    "biotoolsID": "pepformer",
    "confidence_flag": "tool",
    "description": "PepFormer is a end-to-end Siamese network coupled with a hybrid architecture of a Transformer and gated recurrent units that is able to predict the peptide detectability based on peptide sequences only.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WLYLab/PepFormer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-01T12:58:32.607454Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/WLYLab/PepFormer/issues"
        }
    ],
    "name": "PepFormer",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.1C00354",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.The detectability of peptides is fundamentally important in shotgun proteomics experiments. At present, there are many computational methods to predict the detectability of peptides based on sequential composition or physicochemical properties, but they all have various shortcomings. Here, we present PepFormer, a novel end-to-end Siamese network coupled with a hybrid architecture of a Transformer and gated recurrent units that is able to predict the peptide detectability based on peptide sequences only. Specially, we, for the first time, use contrastive learning and construct a new loss function for model training, greatly improving the generalization ability of our predictive model. Comparative results demonstrate that our model performs significantly better than state-of-the-art methods on benchmark data sets in two species (Homo sapiens and Mus musculus). To make the model more interpretable, we further investigate the embedded representations of peptide sequences automatically learnt from our model, and the visualization results indicate that our model can efficiently capture high-latent discriminative information, improving the predictive performance. In addition, our model shows a strong ability of cross-species transfer learning and adaptability, demonstrating that it has great potential in robust prediction of peptides detectability on different species. The source code of our proposed method can be found via https://github.com/WLYLab/PepFormer.",
                "authors": [
                    {
                        "name": "Cheng H."
                    },
                    {
                        "name": "Rao B."
                    },
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Cui L."
                    },
                    {
                        "name": "Xiao G."
                    },
                    {
                        "name": "Su R."
                    },
                    {
                        "name": "Wei L."
                    }
                ],
                "citationCount": 1,
                "date": "2021-04-27T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "PepFormer: End-to-End Transformer-Based Siamese Network to Predict and Enhance Peptide Detectability Based on Sequence only"
            },
            "pmid": "33843206"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}