{
    "additionDate": "2017-02-14T09:36:38Z",
    "biotoolsCURIE": "biotools:reds",
    "biotoolsID": "reds",
    "credit": [
        {
            "name": "Assistance",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://upjv.q4md-forcefieldtools.org/REDS/help-log.php"
        }
    ],
    "description": "Server designed to build force field libraries for new molecules and molecular fragments. One can derive molecular electrostatic potential-based atomic charges embedded in force field libraries for use in force field development, charge validation and molecular dynamics simulations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://upjv.q4md-forcefieldtools.org/REDS/popup/help.php"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://upjv.q4md-forcefieldtools.org/Tutorial/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics simulation",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "homepage": "http://q4md-forcefieldtools.org/REDS/",
    "language": [
        "PHP",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "R.E.D.",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "R.E.D. Server is a unique, open web service, designed to derive non-polarizable RESP and ESP charges and to build force field libraries for new molecules/molecular fragments. It provides to computational biologists the means to derive rigorously molecular electrostatic potential-based charges embedded in force field libraries that are ready to be used in force field development, charge validation and molecular dynamics simulations. R.E.D. Server interfaces quantum mechanics programs, the RESP program and the latest version of the R.E.D. tools. A two step approach has been developed. The first one consists of preparing P2N file(s) to rigorously define key elements such as atom names, topology and chemical equivalencing needed when building a force field library. Then, P2N files are used to derive RESP or ESP charges embedded in force field libraries in the Tripos mol2 format. In complex cases an entire set of force field libraries or force field topology database is generated. Other features developed in R.E.D. Server include help services, a demonstration, tutorials, frequently asked questions, Jmol-based tools useful to construct PDB input files and parse R.E.D. Server outputs as well as a graphical queuing system allowing any user to check the status of R.E.D. Server jobs. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Vanquelef E."
                    },
                    {
                        "name": "Simon S."
                    },
                    {
                        "name": "Marquant G."
                    },
                    {
                        "name": "Garcia E."
                    },
                    {
                        "name": "Klimerak G."
                    },
                    {
                        "name": "Delepine J.C."
                    },
                    {
                        "name": "Cieplak P."
                    },
                    {
                        "name": "Dupradeau F.-Y."
                    }
                ],
                "citationCount": 464,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "R.E.D. Server: A web service for deriving RESP and ESP charges and building force field libraries for new molecules and molecular fragments"
            },
            "pmid": "21609950"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1
}