{
    "additionDate": "2022-06-24T14:08:26.526927Z",
    "biotoolsCURIE": "biotools:cnv-etlai",
    "biotoolsID": "cnv-etlai",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sdo@mgh.harvard.edu",
            "name": "Synho Do"
        },
        {
            "name": "Jongmun Choi"
        }
    ],
    "description": "A scalable artificial intelligence platform that automatically finds copy number variations (CNVs) in journal articles and transforms them into a database.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number variation detection",
                    "uri": "http://edamontology.org/operation_3961"
                }
            ]
        }
    ],
    "homepage": "https://lmic.mgh.harvard.edu/CNV-ETLAI",
    "lastUpdate": "2022-06-24T14:08:26.529430Z",
    "name": "CNV-ETLAI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2022.105332",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdBackground: Although copy number variations (CNVs) are infrequent, each anomaly is unique, and multiple CNVs can appear simultaneously. Growing evidence suggests that CNVs contribute to a wide range of diseases. When CNVs are detected, assessment of their clinical significance requires a thorough literature review. This process can be extremely time-consuming and may delay disease diagnosis. Therefore, we have developed CNV Extraction, Transformation, and Loading Artificial Intelligence (CNV-ETLAI), an innovative tool that allows experts to classify and interpret CNVs accurately and efficiently. Methods: We combined text, table, and image processing algorithms to develop an artificial intelligence platform that automatically extracts, transforms, and organizes CNV information into a database. To validate CNV-ETLAI, we compared its performance to ground truth datasets labeled by a human expert. In addition, we analyzed the CNV data, which was collected using CNV-ETLAI via a crowdsourcing approach. Results: In comparison to a human expert, CNV-ETLAI improved CNV detection accuracy by 4% and performed the analysis 60 times faster. This performance can improve even further with upscaling of the CNV-ETLAI database as usage increases. 5,800 CNVs from 2,313 journal articles were collected. Total CNV frequency for the whole chromosome was highest for chromosome X, whereas CNV frequency per 1 Mb of genomic length was highest for chromosome 22. Conclusions: We have developed, tested, and shared CNV-ETLAI for research and clinical purposes (https://lmic.mgh.harvard.edu/CNV-ETLAI). Use of CNV-ETLAI is expected to ease and accelerate diagnostic classification and interpretation of CNVs.",
                "authors": [
                    {
                        "name": "Choi J."
                    },
                    {
                        "name": "Chua M."
                    },
                    {
                        "name": "Do S."
                    },
                    {
                        "name": "Jeon S."
                    },
                    {
                        "name": "Kim D."
                    }
                ],
                "date": "2022-05-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "A scalable artificial intelligence platform that automatically finds copy number variations (CNVs) in journal articles and transforms them into a database: CNV extraction, transformation, and loading AI (CNV-ETLAI)"
            },
            "pmid": "35240378"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ]
}
