
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Protein subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein domain recognition",
                    "uri": "http://edamontology.org/operation_0246"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Function analysis",
                "uri": "http://edamontology.org/topic_1775"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: There is a scarcity of efficient computational methods for predicting protein subcellular localization in eukaryotes. Currently available methods are inadequate for genome-scale predictions with several limitations. Here, we present a new prediction method, pTARGET that can predict proteins targeted to nine different subcellular locations in the eukaryotic animal species. Results: The nine subcellular locations predicted by pTARGET include cytoplasm, endoplasmic reticulum, extracellular/secretory, golgi, lysosomes, mitochondria, nucleus, plasma membrane and peroxisomes. Predictions are based on the location-specific protein functional domains and the amino acid compositional differences across different subcellular locations. Overall, this method can predict 68-87% of the true positives at accuracy rates of 96-99%. Comparison of the prediction performance against PSORT showed that pTARGET prediction rates are higher by 11-60% in 6 of the 8 locations tested. Besides, the pTARGET method is robust enough for genome-scale prediction of protein subcellular localizations since, it does not rely on the presence of signal or target peptides. © The Author 2005. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Guda C.",
                "Subramaniam S."
            ],
            "cit_count": 91,
            "journal": "Bioinformatics",
            "pmid": "16144808",
            "title": "TARGET: A new method for predicting protein subcellular localization in eukaryotes",
            "year": "2005-11-01"
        },
        {
            "abstract": "The pTARGET web server enables prediction of nine distinct protein subcellular localizations in eukaryotic non-plant species. Predictions are made using a new algorithm [C. Guda and S. Subramaniam (2005) pTARGET [corrected] a new method for predicting protein subcellular localization in eukaryotes. Bioinformatics, 21, 3963-3969], which is primarily based on the occurrence patterns of location-specific protein functional domains in different subcellular locations. We have implemented a relational database, PreCalcDB, to store pre-computed prediction results for all eukaryotic non-plant protein sequences in the public domain that includes about 770 000 entries. Queries can be made by entering protein sequences or by uploading a file containing up to 5000 protein sequences in FASTA format. Prediction results for queries with matching entries in the PreCalcDB will be retrieved instantly; while for the missing ones new predictions will be computed and sent by email. Pre-computed predictions can also be downloaded for complete proteomes of Saccharomyces cerevisiae, Caenorhabditis elegans, Drosophila, Mus musculus and Homo sapiens. The server, its documentation and the data are accessible from http://bioinformatics.albany.edu/ ~ptarget. © The Author 2006. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Guda C."
            ],
            "cit_count": 46,
            "journal": "Nucleic Acids Research",
            "pmid": "16844995",
            "title": "pTARGET: A web server for predicting protein subcellular localization",
            "year": "2006-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ptarget",
        "biotoolsID": "ptarget",
        "description": "This tool predicts the subcellular localization of eukaryotic proteins based on the occurrence patterns of location-specific protein functional domains and the amino acid compositional differences in proteins from nine distinct subcellular locations.",
        "homepage": "http://bioinformatics.albany.edu/~ptarget",
        "name": "pTARGET"
    }
}