{
    "accessibility": "Restricted access",
    "additionDate": "2017-09-26T08:01:18Z",
    "biotoolsCURIE": "biotools:umd",
    "biotoolsID": "umd",
    "collectionID": [
        "RD-connect",
        "Rare Disease",
        "ELIXIR-FR"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "christophe.beroud@inserm.fr",
            "name": "Christophe Béroud",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://rd-connect.eu/contacts/christophe-beroud/"
        },
        {
            "email": "david.salgado@univ-amu.fr",
            "name": "David Salgado"
        }
    ],
    "description": "Universal Mutation Database (UMD) is a database for mutations. UMD-predictor is a tool that enables functional annotation of variants to find the relevant ones.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.umd.be/UMD_Manual.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "lmatalonga",
            "dsalgado"
        ],
        "type": "group"
    },
    "elixirNode": [
        "France"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.umd.be/",
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "UMD",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "dsalgado",
    "publication": [
        {
            "metadata": {
                "abstract": "The human genome is thought to contain about 80,000 genes and presently only 3,000 are known to be implicated in genetic diseases. In the near future, the entire sequence of the human genome will be available and the development of new methods for point mutation detection will lead to a huge increase in the identification of genes and their mutations associated with genetic diseases as well as cancers, which is growing in frequency in industrial states. The collection of these mutations will be critical for researchers and clinicians to establish genotype/phenotype correlations. Other fields such as molecular epidemiology will also be developed using these new data. Consequently, the future lies not in simple repositories of locus-specific mutations but in dynamic databases linked to various computerized tools for their analysis and that can be directly queried on- line. To meet this goal, we devised a generic software called UMD (Universal Mutation Database). It was developed as a generic software to create locus- specific databases (LSDBs) with the 4(th) Dimension® package from ACI. This software includes an optimized structure to assist and secure data entry and to allow the input of various clinical data. Thanks to the flexible structure of the UMD software, it has been successfully adapted to nine genes either involved in cancer (APC, P53, RB1, MEN1, SUR1, VHL, and WT1) or in genetic diseases (FBN1 and LDLR). Four new LSDBs are under construction (VLCAD, MCAD, KIR6, and COL4AS). Finally, the data can be transferred to core databases.",
                "authors": [
                    {
                        "name": "Beroud C."
                    },
                    {
                        "name": "Collod-Beroud G."
                    },
                    {
                        "name": "Boileau C."
                    },
                    {
                        "name": "Soussi T."
                    },
                    {
                        "name": "Junien C."
                    }
                ],
                "citationCount": 142,
                "date": "2000-01-19T00:00:00Z",
                "journal": "Human Mutation",
                "title": "UMD (Universal Mutation Database): A generic software to build and analyze locus-specific databases"
            },
            "pmid": "10612827"
        },
        {
            "metadata": {
                "abstract": "With the completion of the Human Genome Project, our vision of human genetic diseases has changed. The cloning of new disease-causing genes can now be performed in silico, and thousands of mutations are being identified in diagnostic and research laboratories yearly. Knowledge about these mutations and their association with clinical and biological data is essential for clinicians, geneticists, and researchers. To collect and analyze these data, we developed a generic software called Universal Mutation Databases (UMD ) to create locus-specific databases. Here we report the new release (September 2004) of this freely available tool (www.umd.be), which allows the creation of LSDBs for virtually any gene and includes a large set of new analysis tools. We have implemented new features to integrate noncoding sequences, clinical data, pictures, monoclonal antibodies, and polymorphic markers (SNPs). Today the UMD retains all specifically designed tools to analyze mutations at the molecular level, as well as new sets of routines to search for genotype-phenotype correlations. We also created specific tools for infrequent mutations such as gross deletions and duplications, and deep intronic mutations. A large set of dedicated tools are now available for intronic mutations, including methods to calculate the consensus values (CVs) of potential splice sites and to search for exonic splicing enhancer (ESE) motifs. In addition, we have created specific routines to help researchers design new therapeutic strategies, such as exon skipping, aminoglycoside read-through of stop codons, or monoclonal antibody selection and epitope scanning for gene therapy. © 2005 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Beroud C."
                    },
                    {
                        "name": "Hamroun D."
                    },
                    {
                        "name": "Collod-Beroud G."
                    },
                    {
                        "name": "Boileau C."
                    },
                    {
                        "name": "Soussi T."
                    },
                    {
                        "name": "Claustres M."
                    }
                ],
                "citationCount": 86,
                "date": "2005-09-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "UMD (Universal Mutation Database): 2005 Update"
            },
            "pmid": "16086365"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}