{
    "accessibility": "Open access",
    "additionDate": "2016-02-11T12:02:14Z",
    "biotoolsCURIE": "biotools:eggnog",
    "biotoolsID": "eggnog",
    "collectionID": [
        "de.NBI"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "European Molecular Biology Laboratory (EMBL)",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.embl.de/"
        },
        {
            "name": "HD-HuB",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ],
            "url": "https://www.hd-hub.de/"
        },
        {
            "email": "zeller@embl.de",
            "name": "Georg Zeller",
            "orcidid": "https://orcid.org/0000-0003-1429-7485",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "eggNOG is a database of nested orthologous gene groups (NOGs) inferred using unsupervised clustering applied to >5,000 complete genomes followed by comprehensive characterization and analysis of the resulting gene families. eggNOG provides orthologous group assignments at 379 different taxonomic levels as well as multiple sequence alignments, maximum-likelihood trees and broad functional annotations for each group accessible via a web interface or through bulk download.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://eggnogdb.embl.de/#/app/methods"
        }
    ],
    "download": [
        {
            "note": "EggNOG raw data",
            "type": "Biological data",
            "url": "http://eggnogdb.embl.de/#/app/downloads"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                },
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence set (protein)",
                        "uri": "http://edamontology.org/data_1233"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence alignment (protein)",
                        "uri": "http://edamontology.org/data_1384"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Hidden Markov model",
                        "uri": "http://edamontology.org/data_1364"
                    },
                    "format": [
                        {
                            "term": "MEME background Markov model",
                            "uri": "http://edamontology.org/format_1369"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://eggnogdb.embl.de/#/app/home",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-10-07T22:54:52.087476Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "eggNOG",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hdhub",
    "publication": [
        {
            "doi": "10.1093/nar/gkv1248",
            "metadata": {
                "abstract": "© The Author(s) 2015.EggNOG is a public resource that provides Orthologous Groups (OGs) of proteins at different taxonomic levels, each with integrated and summarized functional annotations. Developments since the latest public release include changes to the algorithm for creating OGs across taxonomic levels, making nested groups hierarchically consistent. This allows for a better propagation of functional terms across nested OGs and led to the novel annotation of 95 890 previously uncharacterized OGs, increasing overall annotation coverage from 67% to 72%. The functional annotations of OGs have been expanded to also provide Gene Ontology terms, KEGG pathways and SMART/Pfam domains for each group. Moreover, eggNOG now provides pairwise orthology relationships within OGs based on analysis of phylogenetic trees. We have also incorporated a framework for quickly mapping novel sequences to OGs based on precomputed HMM profiles. Finally, eggNOG version 4.5 incorporates a novel data set spanning 2605 viral OGs, covering 5228 proteins from 352 viral proteomes.All data are accessible for bulk downloading, as a web-service, and through a completely redesigned web interface. The new access points provide faster searches and a number of new browsing and visualization capabilities, facilitating the needs of both experts and less experienced users. eggNOG v4.5 is available at http://eggnog.embl.de.",
                "authors": [
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Szklarczyk D."
                    },
                    {
                        "name": "Forslund K."
                    },
                    {
                        "name": "Cook H."
                    },
                    {
                        "name": "Heller D."
                    },
                    {
                        "name": "Walter M.C."
                    },
                    {
                        "name": "Rattei T."
                    },
                    {
                        "name": "Mende D.R."
                    },
                    {
                        "name": "Sunagawa S."
                    },
                    {
                        "name": "Kuhn M."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Von Mering C."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 762,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EGGNOG 4.5: A hierarchical orthology framework with improved functional annotations for eukaryotic, prokaryotic and viral sequences"
            },
            "pmcid": "PMC4702882",
            "pmid": "26582926"
        },
        {
            "metadata": {
                "abstract": "The identification of orthologous genes forms the basis for most comparative genomics studies. Existing approaches either lack functional annotation of the identified orthologous groups, hampering the interpretation of subsequent results, or are manually annotated and thus lag behind the rapid sequencing of new genomes. Here we present the eggNOG database ('evolutionary genealogy of genes: Non-supervised Orthologous Groups'), which contains orthologous groups constructed from Smith-Waterman alignments through identification of reciprocal best matches and triangular linkage clustering. Applying this procedure to 312 bacterial, 26 archaeal and 35 eukaryotic genomes yielded 43 582 course-grained orthologous groups of which 9724 are extended versions of those from the original COG/KOG database. We also constructed more fine-grained groups for selected subsets of organisms, such as the 19 914 mammalian orthologous groups. We automatically annotated our non-supervised orthologous groups with functional descriptions, which were derived by identifying common denominators for the genes based on their individual textual descriptions, annotated functional categories, and predicted protein domains. The orthologous groups in eggNOG contain 1 241 751 genes and provide at least a broad functional description for 77% of them. Users can query the resource for individual genes via a web interface or download the complete0 set of orthologous groups at http://eggnog.embl.de. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Julien P."
                    },
                    {
                        "name": "Kuhn M."
                    },
                    {
                        "name": "von Mering C."
                    },
                    {
                        "name": "Muller J."
                    },
                    {
                        "name": "Doerks T."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 230,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "eggNOG: Automated construction and annotation of orthologous groups of genes"
            },
            "pmid": "17942413"
        },
        {
            "metadata": {
                "abstract": "With the increasing availability of various 'omics data, high-quality orthology assignment is crucial for evolutionary and functional genomics studies. We here present the fourth version of the eggNOG database (available at http://eggnog.embl.de) that derives nonsupervised orthologous groups (NOGs) from complete genomes, and then applies a comprehensive characterization and analysis pipeline to the resulting gene families. Compared with the previous version, we have more than tripled the underlying species set to cover 3686 organisms, keeping track with genome project completions while prioritizing the inclusion of high-quality genomes to minimize error propagation from incomplete proteome sets. Major technological advances include (i) a robust and scalable procedure for the identification and inclusion of high-quality genomes, (ii) provision of orthologous groups for 107 different taxonomic levels compared with 41 in eggNOGv3, (iii) identification and annotation of particularly closely related orthologous groups, facilitating analysis of related gene families, (iv) improvements of the clustering and functional annotation approach, (v) adoption of a revised tree building procedure based on the multiple alignments generated during the process and (vi) implementation of quality control procedures throughout the entire pipeline. As in previous versions, eggNOGv4 provides multiple sequence alignments and maximum-likelihood trees, as well as broad functional annotation. Users can access the complete database of orthologous groups via a web interface, as well as through bulk download. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Powell S."
                    },
                    {
                        "name": "Forslund K."
                    },
                    {
                        "name": "Szklarczyk D."
                    },
                    {
                        "name": "Trachana K."
                    },
                    {
                        "name": "Roth A."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Gabaldon T."
                    },
                    {
                        "name": "Rattei T."
                    },
                    {
                        "name": "Creevey C."
                    },
                    {
                        "name": "Kuhn M."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Von Mering C."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 292,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EggNOG v4.0: Nested orthology inference across 3686 organisms"
            },
            "pmid": "24297252"
        },
        {
            "metadata": {
                "abstract": "Orthologous relationships form the basis of most comparative genomic and metagenomic studies and are essential for proper phylogenetic and functional analyses. The third version of the eggNOG database (http://eggnog.embl.de) contains nonsupervised orthologous groups constructed from 1133 organisms, doubling the number of genes with orthology assignment compared to eggNOG v2. The new release is the result of a number of improvements and expansions: (i) the underlying homology searches are now based on the SIMAP database; (ii) the orthologous groups have been extended to 41 levels of selected taxonomic ranges enabling much more fine-grained orthology assignments; and (iii) the newly designed web page is considerably faster with more functionality. In total, eggNOG v3 contains 721 801 orthologous groups, encompassing a total of 4 396 591 genes. Additionally, we updated 4873 and 4850 original COGs and KOGs, respectively, to include all 1133 organisms. At the universal level, covering all three domains of life, 101 208 orthologous groups are available, while the others are applicable at 40 more limited taxonomic ranges. Each group is amended by multiple sequence alignments and maximum-likelihood trees and broad functional descriptions are provided for 450 904 orthologous groups (62.5%). © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Powell S."
                    },
                    {
                        "name": "Szklarczyk D."
                    },
                    {
                        "name": "Trachana K."
                    },
                    {
                        "name": "Roth A."
                    },
                    {
                        "name": "Kuhn M."
                    },
                    {
                        "name": "Muller J."
                    },
                    {
                        "name": "Arnold R."
                    },
                    {
                        "name": "Rattei T."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Doerks T."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Von Mering C."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 323,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "eggNOG v3.0: Orthologous groups covering 1133 organisms at 41 different taxonomic ranges"
            },
            "pmid": "22096231"
        },
        {
            "metadata": {
                "abstract": "The identification of orthologous relationships forms the basis for most comparative genomics studies. Here, we present the second version of the eggNOG database, which contains orthologous groups (OGs) constructed through identification of reciprocal best BLAST matches and triangular linkage clustering. We applied this procedure to 630 complete genomes (529 bacteria, 46 archaea and 55 eukaryotes), which is a 2-fold increase relative to the previous version. The pipeline yielded 224 847 OGs, including 9724 extended versions of the original COG and KOG. We computed OGs for different levels of the tree of life; in addition to the species groups included in our first release (i.e. fungi, metazoa, insects, vertebrates and mammals), we have now constructed OGs for archaea, fishes, rodents and primates. We automatically annotate the non-supervised orthologous groups (NOGs) with functional descriptions, protein domains, and functional categories as defined initially for the COG/KOG database. In-depth analysis is facilitated by precomputed high-quality multiple sequence alignments and maximum-likelihood trees for each of the available OGs. Altogether, eggNOG covers 2 242 035 proteins (built from 2 590 259 proteins) and provides a broad functional description for at least 1 966 709 (88%) of them. Users can access the complete set of orthologous groups via a web interface at: http://eggnog.embl.de. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Muller J."
                    },
                    {
                        "name": "Szklarczyk D."
                    },
                    {
                        "name": "Julien P."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Roth A."
                    },
                    {
                        "name": "Kuhn M."
                    },
                    {
                        "name": "Powell S."
                    },
                    {
                        "name": "Von Mering C."
                    },
                    {
                        "name": "Doerks T."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 160,
                "date": "2009-11-07T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "eggNOG v2.0: Extending the evolutionary genealogy of genes with enhanced non-supervised orthologous groups, species and functional annotations"
            },
            "pmid": "19900971"
        },
        {
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.eggNOG is a public database of orthology relationships, gene evolutionary histories and functional annotations. Here, we present version 5.0, featuring a major update of the underlying genome sets, which have been expanded to 4445 representative bacteria and 168 archaea derived from 25 038 genomes, as well as 477 eukaryotic organisms and 2502 viral proteomes that were selected for diversity and filtered by genome quality. In total, 4.4M orthologous groups (OGs) distributed across 379 taxonomic levels were computed together with their associated sequence alignments, phylogenies, HMM models and functional descriptors. Precomputed evolutionary analysis provides fine-grained resolution of duplication/speciation events within each OG. Our benchmarks show that, despite doubling the amount of genomes, the quality of orthology assignments and functional annotations (80% coverage) has persisted without significant changes across this update. Finally, we improved eggNOG online services for fast functional annotation and orthology prediction of custom genomics or metagenomics datasets. All precomputed data are publicly available for downloading or via API queries at http://eggnog.embl.de.",
                "authors": [
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Szklarczyk D."
                    },
                    {
                        "name": "Heller D."
                    },
                    {
                        "name": "Hernandez-Plaza A."
                    },
                    {
                        "name": "Forslund S.K."
                    },
                    {
                        "name": "Cook H."
                    },
                    {
                        "name": "Mende D.R."
                    },
                    {
                        "name": "Letunic I."
                    },
                    {
                        "name": "Rattei T."
                    },
                    {
                        "name": "Jensen L.J."
                    },
                    {
                        "name": "Von Mering C."
                    },
                    {
                        "name": "Bork P."
                    }
                ],
                "citationCount": 88,
                "date": "2019-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "EggNOG 5.0: A hierarchical, functionally and phylogenetically annotated orthology resource based on 5090 organisms and 2502 viruses"
            },
            "pmid": "30418610",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "5.0"
    ]
}