
{
    "credit": [
        {
            "email": "ligia.mateiu@covaci.org",
            "name": "Ligia M. Mateiu MD PhD",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.cmt.ua.ac.be/lcovaci/lucian/ligia/"
        }
    ],
    "documentation": [
        {
            "url": "http://www.cmt.ua.ac.be/lcovaci/lucian/ligia/bypassr/docs/Manual.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "DNA substitution modelling",
                    "uri": "http://edamontology.org/operation_0550"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/bypassr-1-0-bayesian-phylogenetic-analysis-site-specific-rate.html"
        }
    ],
    "publication": [
        {
            "abstract": "A new method is developed for calculating sequence substitution probabilities using Markov chain Monte Carlo (MCMC) methods. The basic strategy is to use uniformization to transform the original continuous time Markov process into a Poisson substitution process and a discrete Markov chain of state transitions. An efficient MCMC algorithm for evaluating substitution probabilities by this approach using a continuous gamma distribution to model site-specific rates is outlined. The method is applied to the problem of inferring branch lengths and site-specific rates from nucleotide sequences under a general time-reversible (GTR) model and a computer program BYPASSR is developed. Simulations are used to examine the performance of the new program relative to an existing program BASEML that uses a discrete approximation for the gamma distributed prior on site-specific rates. It is found that BASEML and BYPASSR are in close agreement when inferring branch lengths, regardless of the number of rate categories used, but that BASEML tends to underestimate high site-specific substitution rates, and to overestimate intermediate rates, when fewer than 50 rate categories are used. Rate estimates obtained using BASEML agree more closely with those of BYPASSR as the number of rate categories increases. Analyses of the posterior distributions of site-specific rates from BYPASSR suggest that a large number of taxa are needed to obtain precise estimates of site-specific rates, especially when rates are very high or very low. The method is applied to analyze 45 sequences of the alpha 2B adrenergic receptor gene (A2AB) from a sample of eutherian taxa. In general, the pattern expected for regions under negative selection is observed with third codon positions having the highest inferred rates, followed by first codon positions and with second codon positions having the lowest inferred rates. Several sites show exceptionally high substitution rates at second codon positions that may represent the effects of positive selection. Copyright © Society of Systematic Biologists.",
            "authors": [
                "Mateiu L.",
                "Rannala B."
            ],
            "cit_count": 24,
            "journal": "Systematic Biology",
            "pmid": "16551582",
            "title": "Inferring complex DNA substitution processes on phylogenies using uniformization and data augmentation",
            "year": "2006-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bypassr",
        "biotoolsID": "bypassr",
        "description": "Implementation of a new method for inferring branch lengths and site-specific substitution rates from nucleotide sequences. It makes use of the Bayesian Markov Chain Monte Carlo method and of the uniformization (randomization) technique to calculate sequence substitution probabilities in complicated DNA substitution models such as general time reversible model (GTR).",
        "homepage": "http://www.cmt.ua.ac.be/lcovaci/lucian/ligia/bypassr.html",
        "name": "BYPASSR"
    }
}