{
    "additionDate": "2017-08-20T15:16:36Z",
    "biotoolsCURIE": "biotools:biobambam",
    "biotoolsID": "biobambam",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mpi-cbg.de/research-groups/current-groups/gene-myers/group-members/german-tischler/"
        }
    ],
    "description": "Tools for early stage NGS alignment file processing including fast sorting and duplicate marking.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/gt1/biobambam2"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://www.sanger.ac.uk/science/tools/biobambam",
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-09-04T08:37:56Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gt1/biobambam2"
        }
    ],
    "name": "Biobambam2",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1186/1751-0473-9-13",
            "metadata": {
                "abstract": "Background: Sequence alignment data is often ordered by coordinate (id of the reference sequence plus position on the sequence where the fragment was mapped) when stored in BAM files, as this simplifies the extraction of variants between the mapped data and the reference or of variants within the mapped data. In this order paired reads are usually separated in the file, which complicates some other applications like duplicate marking or conversion to the FastQ format which require to access the full information of the pairs.Results: In this paper we introduce biobambam, a set of tools based on the efficient collation of alignments in BAM files by read name. The employed collation algorithm avoids time and space consuming sorting of alignments by read name where this is possible without using more than a specified amount of main memory. Using this algorithm tasks like duplicate marking in BAM files and conversion of BAM files to the FastQ format can be performed very efficiently with limited resources. We also make the collation algorithm available in the form of an API for other projects. This API is part of the libmaus package.Conclusions: In comparison with previous approaches to problems involving the collation of alignments by read name like the BAM to FastQ or duplication marking utilities our approach can often perform an equivalent task more efficiently in terms of the required main memory and run-time. Our BAM to FastQ conversion is faster than all widely known alternatives including Picard and bamUtil. Our duplicate marking is about as fast as the closest competitor bamUtil for small data sets and faster than all known alternatives on large and complex data sets. © 2014 Tischler and Leonard; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Tischler G."
                    },
                    {
                        "name": "Leonard S."
                    }
                ],
                "citationCount": 52,
                "date": "2014-06-20T00:00:00Z",
                "journal": "Source Code for Biology and Medicine",
                "title": "Biobambam: Tools for read pair collation based algorithms on BAM files"
            },
            "pmcid": "PMC4075596",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}