{
    "additionDate": "2018-07-28T08:23:32Z",
    "biotoolsCURIE": "biotools:lincrna_predict",
    "biotoolsID": "lincrna_predict",
    "credit": [
        {
            "email": "nyu@brockport.edu",
            "name": "Ning Yu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Deep learning method for lincRNA detection using auto-encoder algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ningyu12/lincRNA_predict/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "lincRNA  predict",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1922-3",
            "metadata": {
                "abstract": "BACKGROUND: RNA sequencing technique (RNA-seq) enables scientists to develop novel data-driven methods for discovering more unidentified lincRNAs. Meantime, knowledge-based technologies are experiencing a potential revolution ignited by the new deep learning methods. By scanning the newly found data set from RNA-seq, scientists have found that: (1) the expression of lincRNAs appears to be regulated, that is, the relevance exists along the DNA sequences; (2) lincRNAs contain some conversed patterns/motifs tethered together by non-conserved regions. The two evidences give the reasoning for adopting knowledge-based deep learning methods in lincRNA detection. Similar to coding region transcription, non-coding regions are split at transcriptional sites. However, regulatory RNAs rather than message RNAs are generated. That is, the transcribed RNAs participate the biological process as regulatory units instead of generating proteins. Identifying these transcriptional regions from non-coding regions is the first step towards lincRNA recognition.RESULTS: The auto-encoder method achieves 100% and 92.4% prediction accuracy on transcription sites over the putative data sets. The experimental results also show the excellent performance of predictive deep neural network on the lincRNA data sets compared with support vector machine and traditional neural network. In addition, it is validated through the newly discovered lincRNA data set and one unreported transcription site is found by feeding the whole annotated sequences through the deep learning machine, which indicates that deep learning method has the extensive ability for lincRNA prediction.CONCLUSIONS: The transcriptional sequences of lincRNAs are collected from the annotated human DNA genome data. Subsequently, a two-layer deep neural network is developed for the lincRNA detection, which adopts the auto-encoder algorithm and utilizes different encoding schemes to obtain the best performance over intergenic DNA sequence data. Driven by those newly annotated lincRNA data, deep learning methods based on auto-encoder algorithm can exert their capability in knowledge learning in order to capture the useful features and the information correlation along DNA genome sequences for lincRNA detection. As our knowledge, this is the first application to adopt the deep learning techniques for identifying lincRNA transcription sequences.",
                "authors": [
                    {
                        "name": "Yu N."
                    },
                    {
                        "name": "Yu Z."
                    },
                    {
                        "name": "Pan Y."
                    }
                ],
                "citationCount": 16,
                "date": "2017-12-06T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "A deep learning method for lincRNA detection using auto-encoder algorithm"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}