{
    "accessibility": "Open access",
    "additionDate": "2022-10-05T22:27:51.392854Z",
    "biotoolsCURIE": "biotools:specdb",
    "biotoolsID": "specdb",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Arwin Lashawn Anak Kendary"
        },
        {
            "name": "Ethan Li"
        },
        {
            "name": "Gaetano T. Montelione"
        },
        {
            "name": "Ian Korf"
        }
    ],
    "description": "A relational database for archiving biomolecular NMR spectral data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.rpi.edu/RPIBioinformatics/SpecDB",
    "language": [
        "Python",
        "SQL"
    ],
    "lastUpdate": "2022-10-05T22:27:51.395692Z",
    "license": "GPL-3.0",
    "name": "SpecDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JMR.2022.107268",
            "metadata": {
                "abstract": "© 2022 The AuthorsNMR is a valuable experimental tool in the structural biologist's toolkit to elucidate the structures, functions, and motions of biomolecules. The progress of machine learning, particularly in structural biology, reveals the critical importance of large, diverse, and reliable datasets in developing new methods and understanding in structural biology and science more broadly. Biomolecular NMR research groups produce large amounts of data, and there is renewed interest in organizing these data to train new, sophisticated machine learning architectures and to improve biomolecular NMR analysis pipelines. The foundational data type in NMR is the free-induction decay (FID). There are opportunities to build sophisticated machine learning methods to tackle long-standing problems in NMR data processing, resonance assignment, dynamics analysis, and structure determination using NMR FIDs. Our goal in this study is to provide a lightweight, broadly available tool for archiving FID data as it is generated at the spectrometer, and grow a new resource of FID data and associated metadata. This study presents a relational schema for storing and organizing the metadata items that describe an NMR sample and FID data, which we call Spectral Database (SpecDB). SpecDB is implemented in SQLite and includes a Python software library providing a command-line application to create, organize, query, backup, share, and maintain the database. This set of software tools and database schema allow users to store, organize, share, and learn from NMR time domain data. SpecDB is freely available under an open source license at https://github.rpi.edu/RPIBioinformatics/SpecDB.",
                "authors": [
                    {
                        "name": "Fraga K.J."
                    },
                    {
                        "name": "Huang Y.J."
                    },
                    {
                        "name": "Korf I."
                    },
                    {
                        "name": "Lashawn Anak Kendary A."
                    },
                    {
                        "name": "Li E."
                    },
                    {
                        "name": "Montelione G.T."
                    },
                    {
                        "name": "Ramelot T.A."
                    },
                    {
                        "name": "Swapna G.V.T."
                    }
                ],
                "date": "2022-09-01T00:00:00Z",
                "journal": "Journal of Magnetic Resonance",
                "title": "SpecDB: A relational database for archiving biomolecular NMR spectral data"
            },
            "pmid": "35930941"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}
