{
    "additionDate": "2021-01-18T07:57:13Z",
    "biotoolsCURIE": "biotools:imrm",
    "biotoolsID": "imrm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "greatchen@ncst.edu.cn",
            "name": "Wei Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "A platform for simultaneously identifying multiple kinds of RNA modifications.\n\niMRM is able to simultaneously identify m6A, m5C, m1A, ψ and A-to-I modifications in Homo sapiens, Mus musculus and Saccharomyces cerevisiae.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "http://www.bioml.cn/XG_iRNA/home",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-04T07:54:30Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/liukeweiaway/iMRM"
        }
    ],
    "name": "iMRM",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA155",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: RNA modifications play critical roles in a series of cellular and developmental processes. Knowledge about the distributions of RNA modifications in the transcriptomes will provide clues to revealing their functions. Since experimental methods are time consuming and laborious for detecting RNA modifications, computational methods have been proposed for this aim in the past five years. However, there are some drawbacks for both experimental and computational methods in simultaneously identifying modifications occurred on different nucleotides. Results: To address such a challenge, in this article, we developed a new predictor called iMRM, which is able to simultaneously identify m6A, m5C, m1A, ψ and A-to-I modifications in Homo sapiens, Mus musculus and Saccharomyces cerevisiae. In iMRM, the feature selection technique was used to pick out the optimal features. The results from both 10-fold cross-validation and jackknife test demonstrated that the performance of iMRM is superior to existing methods for identifying RNA modifications. Contact: greatchen@ncst.edu.cn",
                "authors": [
                    {
                        "name": "Liu K."
                    },
                    {
                        "name": "Chen W."
                    }
                ],
                "citationCount": 42,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IMRM: A platform for simultaneously identifying multiple kinds of RNA modifications"
            },
            "pmid": "32134472"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ]
}