{
    "additionDate": "2017-08-03T18:35:55Z",
    "biotoolsCURIE": "biotools:arct",
    "biotoolsID": "arct",
    "credit": [
        {
            "email": "aging@liv.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://jp.senescence.info/"
        }
    ],
    "description": "Toolkit of Perl modules aimed at bioinformatics, genomics, and gerontology, partly based on the BioPerl package, which aim is to allow the comparative genomics of aging. It is a collection of data-mining tools, algorithms, parsers, wrappers, spiders and web applications, etc.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genomics.senescence.info/software/perl.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://genomics.senescence.info/software/perl.html",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/arct-0-9-comparative-genomics-aging.html"
        }
    ],
    "name": "ARCT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Aging is a complex, challenging phenomenon that requires multiple, interdisciplinary approaches to unravel its puzzles. To assist basic research on aging, we developed the Human Ageing Genomic Resources (HAGR). This work provides an overview of the databases and tools in HAGR and describes how the gerontology research community can employ them. Several recent changes and improvements to HAGR are also presented. The two centrepieces in HAGR are GenAge and AnAge. GenAge is a gene database featuring genes associated with aging and longevity in model organisms, a curated database of genes potentially associated with human aging, and a list of genes tested for their association with human longevity. A myriad of biological data and information is included for hundreds of genes, making GenAge a reference for research that reflects our current understanding of the genetic basis of aging. GenAge can also serve as a platform for the systems biology of aging, and tools for the visualization of protein-protein interactions are also included. AnAge is a database of aging in animals, featuring over 4000 species, primarily assembled as a resource for comparative and evolutionary studies of aging. Longevity records, developmental and reproductive traits, taxonomic information, basic metabolic characteristics, and key observations related to aging are included in AnAge. Software is also available to aid researchers in the form of Perl modules to automate numerous tasks and as an SPSS script to analyse demographic mortality data. The HAGR are available online at http://genomics.senescence.info. © Journal compilation © 2009 Blackwell Publishing Ltd/ Anatomical Society of Great Britain and Ireland.",
                "authors": [
                    {
                        "name": "Budovsky A."
                    },
                    {
                        "name": "Church G.M."
                    },
                    {
                        "name": "Costa J."
                    },
                    {
                        "name": "Fraifeld V."
                    },
                    {
                        "name": "Lehmann G."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "de Magalhaes J.P."
                    }
                ],
                "citationCount": 137,
                "date": "2009-02-04T00:00:00Z",
                "journal": "Aging Cell",
                "title": "The Human Ageing Genomic Resources: Online databases and tools for biogerontologists"
            },
            "pmid": "18986374"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}
