{
    "additionDate": "2024-06-20T15:23:46.935418Z",
    "biotoolsCURIE": "biotools:ptxqc",
    "biotoolsID": "ptxqc",
    "description": "PTXQC is a quality control pipeline for proteomics results generated by MaxQuant.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cbielow/PTXQC",
    "lastUpdate": "2024-11-24T13:51:32.642072Z",
    "name": "PTXQC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "n.m.palmblad@lumc.nl",
    "publication": [
        {
            "doi": "10.1021/acs.jproteome.5b00780",
            "metadata": {
                "abstract": "Mass spectrometry-based proteomics coupled to liquid chromatography has matured into an automatized, high-throughput technology, producing data on the scale of multiple gigabytes per instrument per day. Consequently, an automated quality control (QC) and quality analysis (QA) capable of detecting measurement bias, verifying consistency, and avoiding propagation of error is paramount for instrument operators and scientists in charge of downstream analysis. We have developed an R-based QC pipeline called Proteomics Quality Control (PTXQC) for bottom-up LC-MS data generated by the MaxQuant1 software pipeline. PTXQC creates a QC report containing a comprehensive and powerful set of QC metrics, augmented with automated scoring functions. The automated scores are collated to create an overview heatmap at the beginning of the report, giving valuable guidance also to nonspecialists. Our software supports a wide range of experimental designs, including stable isotope labeling by amino acids in cell culture (SILAC), tandem mass tags (TMT), and label-free data. Furthermore, we introduce new metrics to score MaxQuant's Match-between-runs (MBR) functionality by which peptide identifications can be transferred across Raw files based on accurate retention time and m/z. Last but not least, PTXQC is easy to install and use and represents the first QC software capable of processing MaxQuant result tables. PTXQC is freely available at https://github.com/cbielow/PTXQC.",
                "authors": [
                    {
                        "name": "Bielow C."
                    },
                    {
                        "name": "Kempa S."
                    },
                    {
                        "name": "Mastrobuoni G."
                    }
                ],
                "citationCount": 126,
                "date": "2016-03-04T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Proteomics Quality Control: Quality Control Software for MaxQuant Results"
            },
            "pmid": "26653327",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "version": [
        "1.1.1"
    ]
}
