{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://sunflower.kuicr.kyoto-u.ac.jp/"}],"documentation":[{"type":"GENERAL","url":"http://sunflower.kuicr.kyoto-u.ac.jp/~sjn/hse/help.html"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Sequences","uri":"http://edamontology.org/topic_0080"},{"term":"Protein structure","uri":"http://edamontology.org/topic_2814"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/hsepred-prediction-half-sphere-exposure-protein-sequences.html"}],"publication":[{"abstract":"Motivation: Half-sphere exposure (HSE) is a newly developed two-dimensional solvent exposure measure. By conceptually separating an amino acid's sphere in a protein structure into two half spheres which represent its distinct spatial neighborhoods in the upward and downward directions, the HSE-up and HSE-down measures show superior performance compared with other measures such as accessible surface area, residue depth and contact number. However, currently there is no existing method for the prediction of HSE measures from sequence data. Results: In thisarticle, we propose a novel approach to predict the HSE measures and infer residue contact numbers using the predicted HSE values, based on a well-prepared non-homologous protein structure dataset. In particular, we employ support vector regression (SVR) to quantify the relationship between HSE measures and protein sequences and evaluate its prediction performance. We extensively explore five sequence-encoding schemes to examine their effects on the prediction performance. Our method could achieve the correlation coefficients of 0.72 and 0.68 between the predicted and observed HSE-up and HSE-down measures, respectively. Moreover, contact number can be accurately predicted by the summation of the predicted HSE-up and HSE-down values, which has further enlarged the application of this method. The successful application of SVR approach in this study suggests that it should be more useful in quantifying the protein sequence-structure relationship and predicting the structural property profiles from protein sequences. © The Author 2008. Published by Oxford University Press. All rights reserved.","authors":["Song J.","Tan H.","Takemoto K.","Akutsu T."],"cit_count":43,"doi":"10.1093/bioinformatics/btn222","journal":"Bioinformatics","title":"HSEpred: Predict half-sphere exposure from protein sequences","type":"Primary","year":"2008-07-01"}],"summary":{"biotoolsCURIE":"biotools:hsepred","biotoolsID":"hsepred","description":"HSEpred is a web server to predict the HSE(Half-Sphere Exposure) measures and infer residue contact numbers using the predicted HSE values, based on a well-prepared non-homologous protein structure dataset.","homepage":"http://sunflower.kuicr.kyoto-u.ac.jp/~sjn/hse/","name":"HSEpred"}}