{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T16:56:41Z",
    "biotoolsCURIE": "biotools:HiPFSTA",
    "biotoolsID": "HiPFSTA",
    "cost": "Free of charge",
    "description": "Gradient-based, GPU-accelerated, high-precision contour-segmentation algorithm with application to cell membrane fluctuation spectroscopy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/michaelmell/HiPFSTA/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "https://github.com/michaelmell/hipfsta",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/michaelmell/hipfsta/issues"
        }
    ],
    "maturity": "Mature",
    "name": "HiPFSTA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0207376",
            "metadata": {
                "abstract": "© 2018 Mell, Monroy. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.We present a novel intensity-gradient based algorithm specifically designed for nanometer-segmentation of cell membrane contours obtained with high-resolution optical microscopy combined with high-velocity digital imaging. The algorithm relies on the image oversampling performance and computational power of graphical processing units (GPUs). Both, synthetic and experimental data are used to quantify the sub-pixel precision of the algorithm, whose analytic performance results comparatively higher than in previous methods. Results from the synthetic data indicate that the spatial precision of the presented algorithm is only limited by the signal-to-noise ratio (SNR) of the contour image. We emphasize on the application of the new algorithm to membrane fluctuations (flickering) in eukaryotic cells, bacteria and giant vesicle models. The method shows promising applicability in several fields of cellular biology and medical imaging for nanometer-precise boundary-determination and mechanical fingerprinting of cellular membranes in optical microscopy images. Our implementation of this high-precision flicker spectroscopy contour tracking algorithm (HiPFSTA) is provided as open-source at www.github.com/michaelmell/hipfsta.",
                "authors": [
                    {
                        "name": "Mell M."
                    },
                    {
                        "name": "Monroy F."
                    }
                ],
                "date": "2018-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A gradient-based, GPU-accelerated, high-precision contour-segmentation algorithm with application to cell membrane fluctuation spectroscopy"
            },
            "pmcid": "PMC6283589",
            "pmid": "30521560",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Light microscopy",
            "uri": "http://edamontology.org/topic_3385"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "validated": 1
}
