{"credit":[{"email":"mschulz@mmci.uni-saarland.de","name":"Marcel H Schulz","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/SchulzLab/ORNA"}],"function":[{"operation":[{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"publication":[{"abstract":"© The Author(s) 2018. Motivation: De Bruijn graphs are a common assembly data structure for sequencing datasets. But with the advances in sequencing technologies, assembling high coverage datasets has become a computational challenge. Read normalization, which removes redundancy in datasets, is widely applied to reduce resource requirements. Current normalization algorithms, though efficient, provide no guarantee to preserve important k-mers that form connections between regions in the graph. Results: Here, normalization is phrased as a set multi-cover problem on reads and a heuristic algorithm, Optimized Read Normalization Algorithm (ORNA), is proposed. ORNA normalizes to the minimum number of reads required to retain all k-mers and their relative k-mer abundances from the original dataset. Hence, all connections from the original graph are preserved. ORNA was tested on various RNA-seq datasets with different coverage values. It was compared to the current normalization algorithms and was found to be performing better. Normalizing error corrected data allows for more accurate assemblies compared to the normalized uncorrected dataset. Further, an application is proposed in which multiple datasets are combined and normalized to predict novel transcripts that would have been missed otherwise. Finally, ORNA is a general purpose normalization algorithm that is fast and significantly reduces datasets with loss of assembly quality in between [1, 30]% depending on reduction stringency.","authors":["Durai D.A.","Schulz M.H."],"cit_count":0,"doi":"10.1093/bioinformatics/bty307","journal":"Bioinformatics","title":"In silico read normalization using set multi-cover optimization","year":"2018-10-01"}],"summary":{"biotoolsCURIE":"biotools:orna","biotoolsID":"orna","description":"In silico read normalization using set multi-cover optimization.","homepage":"https://github.com/SchulzLab/ORNA","name":"ORNA"}}