{
    "additionDate": "2016-01-28T19:40:59Z",
    "biotoolsCURIE": "biotools:consurf",
    "biotoolsID": "consurf",
    "credit": [
        {
            "name": "Guy Yachdav, Gershon Celniker",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "mytum.de",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "assistant@rostlab.org",
            "name": "Rostlab",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://rostlab.org"
        }
    ],
    "description": "Tool used for estimation of the evolutionary conservation of amino/nucleic acid positions in a protein/DNA/RNA molecule based on the phylogenetic relations between homologous sequences.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/Rostlab/ConSurf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Estimation of the evolutionary conservation",
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Rostlab/ConSurf",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/Rostlab/ConSurf"
        }
    ],
    "name": "ConSurf",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ga79roh@mytum.de",
    "publication": [
        {
            "doi": "10.1093/molbev/msh194",
            "metadata": {
                "abstract": "The degree to which an amino acid site is free to vary is strongly dependent on its structural and functional importance. An amino acid that plays an essential role is unlikely to change over evolutionary time. Hence, the evolutionary rate at an amino acid site is indicative of how conserved this site is and, in turn, allows evaluation of its importance in maintaining the structure/function of the protein. When using probabilistic methods for site-specific rate inference, few alternatives are possible. In this study we use simulations to compare the maximum-likelihood and Bayesian paradigms. We study the dependence of inference accuracy on such parameters as number of sequences, branch lengths, the shape of the rate distribution, and sequence length. We also study the possibility of simultaneously estimating branch lengths and site-specific rates. Our results show that a Bayesian approach is superior to maximum-likelihood under a wide range of conditions, indicating that the prior that is incorporated into the Bayesian computation significantly improves performance. We show that when branch lengths are unknown, it is better first to estimate branch lengths and then to estimate site-specific rates. This procedure was found to be superior to estimating both the branch lengths and site-specific rates simultaneously. Finally, we illustrate the difference between maximum-likelihood and Bayesian methods when analyzing site-conservation for the apoptosis regulator protein Bcl-X L.",
                "authors": [
                    {
                        "name": "Mayrose I."
                    },
                    {
                        "name": "Graur D."
                    },
                    {
                        "name": "Ben-Tal N."
                    },
                    {
                        "name": "Pupko T."
                    }
                ],
                "citationCount": 248,
                "date": "2004-09-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Comparison of site-specific rate-inference methods for protein sequences: Empirical Bayesian methods are superior"
            },
            "type": "Review"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1,
    "version": [
        "1.0.6"
    ]
}