{
    "additionDate": "2019-11-14T19:27:08Z",
    "biotoolsCURIE": "biotools:MaizeDIG",
    "biotoolsID": "MaizeDIG",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "carson.andorf@ars.usda.gov",
            "name": "Carson M. Andorf",
            "typeEntity": "Person"
        }
    ],
    "description": "Maize Database of Images and Genomes | MaizeDIG - Maize Database of Images and Genomes. This tool allows users to tag phenotypes in images and link them to specific genes | MaizeDIG the Maize Database of Images and Genomes, a genotypic-phenotypic database, for maize based on BioDIG | There are some prerequisites to set up MaizeDIG system such as installation of Django framework, Database system, Python and related libraries, and other dependencies | The Maize Genetics Executive Committee is reaching out to the global maize genetics, genomics, and breeding research communities to encourage researchers to become a maize cooperator (What is a maize cooperator?) Regions currently underrepresented within the maize cooperators are Africa, Asia, Europe, and Latin America",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "http://www.maizegdb.org",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-04-19T07:47:58Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://maizedig.maizegdb.org/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Maize-Genetics-and-Genomics-Database/maizedig"
        }
    ],
    "name": "MaizeDIG",
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006600"
        }
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2019.01050",
            "metadata": {
                "abstract": "© Copyright © 2019 Cho, Portwood, Gardiner, Harper, Lawrence-Dill, Friedberg and Andorf.Background: An organism can be described by its observable features (phenotypes) and the genes and genomic information (genotypes) that cause these phenotypes. For many decades, researchers have tried to find relationships between genotypes and phenotypes, and great strides have been made. However, improved methods and tools for discovering and visualizing these phenotypic relationships are still needed. The maize genetics and genomics database (MaizeGDB, www.maizegdb.org) provides an array of useful resources for diverse data types including thousands of images related to mutant phenotypes in Zea mays ssp. mays (maize). To integrate mutant phenotype images with genomics information, we implemented and enhanced the web-based software package BioDIG (Biological Database of Images and Genomes). Findings: We developed a genotype-phenotype database for maize called MaizeDIG. MaizeDIG has several enhancements over the original BioDIG package. MaizeDIG, which supports multiple reference genome assemblies, is seamlessly integrated with genome browsers to accommodate custom tracks showing tagged mutant phenotypes images in their genomic context and allows for custom tagging of images to highlight the phenotype. This is accomplished through an updated interface allowing users to create image-to-gene links and is accessible via the image search tool. Conclusions: We have created a user-friendly and extensible web-based resource called MaizeDIG. MaizeDIG is preloaded with 2,396 images that are available on genome browsers for 10 different maize reference genomes. Approximately 90 images of classically defined maize genes have been manually annotated. MaizeDIG is available at http://maizedig.maizegdb.org/. The code is free and open source and can be found at https://github.com/Maize-Genetics-and-Genomics-Database/maizedig.",
                "authors": [
                    {
                        "name": "Cho K.T."
                    },
                    {
                        "name": "Portwood J.L."
                    },
                    {
                        "name": "Gardiner J.M."
                    },
                    {
                        "name": "Harper L.C."
                    },
                    {
                        "name": "Lawrence-Dill C.J."
                    },
                    {
                        "name": "Friedberg I."
                    },
                    {
                        "name": "Andorf C.M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-08-28T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "MaizeDIG: Maize Database of Images and Genomes"
            },
            "pmcid": "PMC6724615",
            "pmid": "31555312"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}