{
    "additionDate": "2021-01-18T08:10:56Z",
    "biotoolsCURIE": "biotools:drpl",
    "biotoolsID": "drpl",
    "confidence_flag": "tool",
    "description": "Deep Regression Pair Learning (DRPL) is a deep network is proposed for multi-focus image fusion",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sasky1/DPRL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-03T19:25:16Z",
    "name": "DRPL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TIP.2020.2976190",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.In this paper, a novel deep network is proposed for multi-focus image fusion, named Deep Regression Pair Learning (DRPL). In contrast to existing deep fusion methods which divide the input image into small patches and apply a classifier to judge whether the patch is in focus or not, DRPL directly converts the whole image into a binary mask without any patch operation, subsequently tackling the difficulty of the blur level estimation around the focused/defocused boundary. Simultaneously, a pair learning strategy, which takes a pair of complementary source images as inputs and generates two corresponding binary masks, is introduced into the model, greatly imposing the complementary constraint on each pair and making a large contribution to the performance improvement. Furthermore, as the edge or gradient does exist in the focus part while there is no similar property for the defocus part, we also embed a gradient loss to ensure the generated image to be all-in-focus. Then the structural similarity index (SSIM) is utilized to make a trade-off between the reference and fused images. Experimental results conducted on the synthetic and real-world datasets substantiate the effectiveness and superiority of DRPL compared with other state-of-the-art approaches. The source code can be found in https://github.com/sasky1/DPRL.",
                "authors": [
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Lu G."
                    },
                    {
                        "name": "Wu F."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Zhang D."
                    }
                ],
                "citationCount": 20,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "DRPL: Deep Regression Pair Learning for Multi-Focus Image Fusion"
            },
            "pmid": "32142440"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}
