{
    "additionDate": "2018-07-06T12:47:05Z",
    "biotoolsCURIE": "biotools:oritfinder",
    "biotoolsID": "oritfinder",
    "credit": [
        {
            "email": "hyou@sjtu.edu.cn",
            "name": "Hong-Yu OU",
            "orcidid": "https://orcid.org/0000-0001-9439-1660",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Rapid identification of the origin of transfer site (oriT) of a conjugative plasmid or chromosome-borne integrative and conjugative element. With a combination of similarity searches for the oriTDB-archived oriT nucleotide sequences and the co-localization of the flanking relaxase homologous genes, the oriTfinder can predict the oriT region with high accuracy in the DNA sequence of a bacterial plasmid or chromosome in minutes.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://202.120.12.134/oriTfinder/tutorial.html"
        }
    ],
    "download": [
        {
            "note": "Only runs on Linux",
            "type": "Downloads page",
            "url": "https://bioinfo-mml.sjtu.edu.cn/oriTfinder/download.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo-mml.sjtu.edu.cn/oriTfinder",
    "language": [
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2020-06-24T08:31:37Z",
    "name": "oriTfinder",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gky352",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.oriTfinder is a web server that facilitates the rapid identification of the origin of transfer site (oriT) of a conjugative plasmid or chromosome-borne integrative and conjugative element. The utilized back-end database oriTDB was built upon more than one thousand known oriT regions of bacterial mobile genetic elements (MGEs) as well as the known MGE-encoding relaxases and type IV coupling proteins (T4CP). With a combination of similarity searches for the oriTDB-archived oriT nucleotide sequences and the co-localization of the flanking relaxase homologous genes, the oriTfinder can predict the oriT region with high accuracy in the DNA sequence of a bacterial plasmid or chromosome in minutes. The server also detects the other transfer-related modules, including the potential relaxase gene, T4CP gene and the type IV secretion system gene cluster, and the putative genes coding for virulence factors and acquired antibiotic resistance determinants. oriTfinder may contribute to meeting the increasing demands of re-annotations for bacterial conjugative, mobilizable or non-transferable elements and aid in the rapid risk accession of disease-relevant trait dissemination in pathogenic bacteria of interest. oriTfinder is freely available to all users without any login requirement at http://bioinfo-mml.sjtu.edu.cn/oriTfinder.",
                "authors": [
                    {
                        "name": "Deng Z."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Ou H.-Y."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Tai C."
                    },
                    {
                        "name": "Xie Y."
                    }
                ],
                "citationCount": 57,
                "date": "2018-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "OriTfinder: A web-based tool for the identification of origin of transfers in DNA sequences of bacterial mobile genetic elements"
            },
            "pmid": "29733379",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}
