{
    "additionDate": "2023-01-27T14:34:54.539532Z",
    "biotoolsCURIE": "biotools:clustmmra",
    "biotoolsID": "clustmmra",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Loredana.Martignetti@curie.fr",
            "typeEntity": "Person"
        }
    ],
    "description": "A scalable version of the clustMMRA pipeline for the identification of genomically co-clustered microRNAs driving cancer subtypes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sysbio-curie/clustMMRA_v2",
    "language": [
        "Perl",
        "R",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T15:08:17.572694Z",
    "license": "Not licensed",
    "name": "clustMMRA",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/978-3-031-08356-3_10",
            "metadata": {
                "abstract": "In recent cancer genomics programs, large-scale profiling of microRNAs has been routinely used in order to better understand the role of microRNAs in gene regulation and disease. To support the analysis of such amount of data, scalability of bioinformatics pipelines is increasingly important to handle larger datasets. Here, we describe a scalable implementation of the clustered miRNA Master Regulator Analysis (clustMMRA) pipeline, developed to search for genomic clusters of microRNAs potentially driving cancer molecular subtyping. Genomically clustered microRNAs can be simultaneously expressed to work in a combined manner and jointly regulate cell phenotypes. However, the majority of computational approaches for the identification of microRNA master regulators are typically designed to detect the regulatory effect of a single microRNA. We have applied the clustMMRA pipeline to multiple pediatric tumor datasets, up to a hundred samples in size, demonstrating very satisfying performances of the software on large datasets. Results have highlighted genomic clusters of microRNAs potentially involved in several subgroups of the different pediatric cancers or specifically involved in the phenotype of a subgroup. In particular, we confirmed the cluster of microRNAs at the 14q32 locus to be involved in multiple pediatric cancers, showing its specific downregulation in tumor subgroups with aggressive phenotype.",
                "authors": [
                    {
                        "name": "Ayrault O."
                    },
                    {
                        "name": "Cancila G."
                    },
                    {
                        "name": "Hernandez C."
                    },
                    {
                        "name": "Martignetti L."
                    },
                    {
                        "name": "Zinovyev A."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Advances in Experimental Medicine and Biology",
                "title": "ClustMMRA v2: A Scalable Computational Pipeline for the Identification of MicroRNA Clusters Acting Cooperatively on Tumor Molecular Subgroups"
            },
            "pmid": "36352218"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
