
{
    "credit": [
        {
            "name": "ExPASy helpdesk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.expasy.org/support"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://web.expasy.org/aacompsim/aacsim-doc.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Proteomics"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Proteomics",
                "uri": "http://edamontology.org/topic_0121"
            },
            {
                "term": "Function analysis",
                "uri": "http://edamontology.org/topic_1775"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Separation and identification of proteins by two-dimensional (2-D) electrophoresis can be used for protein-based gene expression analysis. In this report single protein spots, from polyvinylidene difluoride blots of micropreparative E. coli 2-D gels, were rapidly and economically identified by matching their amino acid composition, estimated pI and molecular weight against all E. coli entries in the SWISS-PROT database. Thirty proteins from an E. coli 2-D map were analyzed and identities assigned. Three of the proteins were unknown. By protein sequencing analysis, 20 of the 27 proteins were correctly identified. Importantly, correct identifications showed unambiguous “correct” score patterns. While incorrect protein identifications also showed distinctive score patterns, indicating that protein must be identified by other means. These techniques allow large-scale screening of the protein complement of simple organisms, or tissues in normal and disease states. The computer program described here is accessible via the World Wide Web at URL address (http://expasy.hcuge.ch/). © 1996 Nature Publishing Group.",
            "authors": [
                "Wilkins M.R.",
                "Pasquali C.",
                "Appel R.D.",
                "Ou K.",
                "Golaz O.",
                "Sanchez J.-C.",
                "Yan J.X.",
                "Gooley A.A.",
                "Hughes G.",
                "Humphery-Smith I.",
                "Williams K.L.",
                "Hochstrasser D.F."
            ],
            "cit_count": 644,
            "journal": "Bio/Technology",
            "pmid": "9636313",
            "title": "From proteins to proteomes: Large scale protein identification by two-dimensional electrophoresis and amino acid analysis",
            "type": "Primary",
            "year": "1996-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:aacompsim",
        "biotoolsID": "aacompsim",
        "description": "Compare amino acid composition of a UniProtKB entry with some or all other UniProtKB entries. Several constellations are available, corresponding to various amino acid analysis techniques.",
        "homepage": "https://web.expasy.org/aacompsim/",
        "name": "AACompSim"
    }
}