{
    "additionDate": "2021-01-18T11:17:05Z",
    "biotoolsCURIE": "biotools:pub2tools2020__herbipad",
    "biotoolsID": "pub2tools2020__herbipad",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gefei_hao@foxmail.com",
            "name": "Ge‐Fei Hao",
            "typeEntity": "Person"
        }
    ],
    "description": "A free web platform to comprehensively analyze constitutive property and herbicide-likeness to estimate chemical bioavailability.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "In vitro selection",
                    "uri": "http://edamontology.org/operation_3795"
                }
            ]
        }
    ],
    "homepage": "http://agroda.gzu.edu.cn:9999/ccb/database/HerbiPAD/",
    "lastUpdate": "2021-01-30T11:27:26Z",
    "name": "HerbiPAD",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1002/PS.6140",
            "metadata": {
                "abstract": "© 2020 Society of Chemical IndustryBACKGROUND: Herbicides, as efficient weed control measures, play a crucial role in ensuring food security. The emergence of herbicide-resistant weeds has negatively affected food security and promoted the demand for new and improved herbicides. The balance between bioavailability and the potency of a compound is one of the most pressing challenges in the development of novel ideal herbicides. Herbicide-likeness analysis is crucial for the evaluation of this balance and thus may help to address this issue. Many herbicide-likeness analysis methods have been developed to screen potential novel lead compounds. However, there remains a lack of user-friendly and integrated tools to comprehensively evaluate herbicide-likeness. RESULTS: Herbicide-likeness of compounds was assessed through integrated analysis incorporating the physicochemical properties of commercial herbicides, a qualitative rule, and three quantitative scoring functions developed for evaluating herbicide-likeness. HerbiPAD (http://agroda.gzu.edu.cn:9999/ccb/database/HerbiPAD/) is a free web platform integrated with the collected database and scoring model. This platform contains 542 approved herbicides and > 29 000 physicochemical descriptors. The accuracy of HerbiPAD in distinguishing known herbicides from nonherbicides was 84.2%. In the case study, HerbiPAD evaluated 60 new compounds from seven different herbicide targets, and the accuracy of predicting better bioavailability was 83.3%. CONCLUSIONS: HerbiPAD was designed to quickly and efficiently evaluate herbicide-likeness by integrating qualitative and quantitative analyses. The simple and effective interpretation of the analysis interface may help noncomputational experts understand herbicide-likeness. © 2020 Society of Chemical Industry.",
                "authors": [
                    {
                        "name": "Huang J.-J."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Ouyang Y."
                    },
                    {
                        "name": "Huang Y.-Q."
                    },
                    {
                        "name": "Jia C.-Y."
                    },
                    {
                        "name": "Zhong H."
                    },
                    {
                        "name": "Hao G.-F."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Pest Management Science",
                "title": "HerbiPAD: a free web platform to comprehensively analyze constitutive property and herbicide-likeness to estimate chemical bioavailability"
            },
            "pmid": "33063413"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ]
}