{
    "additionDate": "2017-08-03T18:51:41Z",
    "biotoolsCURIE": "biotools:mosdi",
    "biotoolsID": "mosdi",
    "credit": [
        {
            "email": "marschal@mpi-inf.mpg.de",
            "name": "Tobias Marschall",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.zbi.uni-saarland.de/en/junior-groups/algorithms-computational-genomics.html"
        }
    ],
    "description": "Contains a lot of sequence analysis algorithms, including methods for motif statistics, exact motif discovery, analysis of pattern matching algorithms, etc.",
    "documentation": [
        {
            "type": "General",
            "url": "https://bitbucket.org/tobiasmarschall/mosdi/src"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/tobiasmarschall/mosdi",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mosdi-1-3-sequence-analysis-toolkit-bioinformatics.html"
        }
    ],
    "name": "MoSDi",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "We present a comprehensive review on probabilistic arithmetic automata (PAAs), a general model to describe chains of operations whose operands depend on chance, along with two algorithms to numerically compute the distribution of the results of such probabilistic calculations. PAAs provide a unifying framework to approach many problems arising in computational biology and elsewhere. We present five different applications, namely 1) pattern matching statistics on random texts, including the computation of the distribution of occurrence counts, waiting times, and clump sizes under hidden Markov background models; 2) exact analysis of window-based pattern matching algorithms; 3) sensitivity of filtration seeds used to detect candidate sequence alignments; 4) length and mass statistics of peptide fragments resulting from enzymatic cleavage reactions; and 5) read length statistics of 454 and IonTorrent sequencing reads. The diversity of these applications indicates the flexibility and unifying character of the presented framework. While the construction of a PAA depends on the particular application, we single out a frequently applicable construction method: We introduce deterministic arithmetic automata (DAAs) to model deterministic calculations on sequences, and demonstrate how to construct a PAA from a given DAA and a finite-memory random text model. This procedure is used for all five discussed applications and greatly simplifies the construction of PAAs. Implementations are available as part of the MoSDi package. Its application programming interface facilitates the rapid development of new applications based on the PAA framework. © 2013 IEEE.",
                "authors": [
                    {
                        "name": "Marschall T."
                    },
                    {
                        "name": "Herms I."
                    },
                    {
                        "name": "Kaltenbach H.-M."
                    },
                    {
                        "name": "Rahmann S."
                    }
                ],
                "citationCount": 8,
                "date": "2012-12-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Probabilistic arithmetic automata and their applications"
            },
            "pmid": "22868683"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}