{
    "additionDate": "2021-01-18T10:10:03Z",
    "biotoolsCURIE": "biotools:hpg-dhunter",
    "biotoolsID": "hpg-dhunter",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Juan M. Orduña",
            "orcidid": "https://orcid.org/0000-0002-2932-0214",
            "typeEntity": "Person"
        }
    ],
    "description": "An ultrafast, friendly tool for DMR detection and visualization.\n\nIf you want to use this tool just now, there is an executable file for Linux x86_64 systems. This compressed file is available at releases page. But, previously, CUDA and Nvidia drivers must be installed in your system. For that, you can go to System requirements section.\n\nHPG-Dhunter is an interactive tool for detecting Differentially Methylathed Regions (DMRs) and visualizing DNA methylation signals. It is based on building a methylation signal from the information yielded by HPG-HMapper, and using a NVidia GPU and the CUDA programming model to compute the Discrete Wavelet Transform (DWT) of this methylation signal. The transformation of the signals in turn allows the comparison of different signals at low resolution levels, easily identifying DMRs with a low workload, when compared to other strategies. HPG-Dhunter is part of the HPG-MSuite.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DMR identification",
                    "uri": "http://edamontology.org/operation_3809"
                },
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/grev-uv/hpg-dhunter",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-01-30T12:09:05Z",
    "license": "LGPL-3.0",
    "name": "HPG-DHunter",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03634-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Software tools for analyzing DNA methylation do not provide graphical results which can be easily identified, but huge text files containing the alignment of the samples and their methylation status at a resolution of base pairs. There have been proposed different tools and methods for finding Differentially Methylated Regions (DMRs) among different samples, but the execution time required by these tools is large, and the visualization of their results is far from being interactive. Additionally, these methods show more accurate results when identifying simulated DM regions that are long and have small within-group variation, but they have low concordance when used with real datasets, probably due to the different approaches they use for DMR identification. Thus, a tool which automatically detects DMRs among different samples and interactively visualizes DMRs at different scales (from a bunch to ten of millions of DNA locations) can be the key for shortening the DNA methylation analysis process in many studies. Results: In this paper, we propose a software tool based on the wavelet transform. This mathematical tool allows the fast automatic DMR detection by simple comparison of different signals at different resolution levels. Also, it allows an interactive visualization of the DMRs found at different resolution levels. The tool is publicly available at https://grev-uv.github.io/, and it is part of a complete suite of tools which allow to carry out the complete process of DNA alignment and methylation analysis, creation of methylation maps of the whole genome, and the detection and visualization of DMRs between different samples. Conclusions: The validation of the developed software tool shows similar concordance with other well-known and extended tools when used with real and synthetic data. The batch mode of the tool is capable of automatically detecting the existing DMRs for half (twelve) of the human chromosomes between two sets of six samples (whose.csv files after the alignment and mapping procedures have an aggregated size of 108 Gigabytes) in around three hours and a half. When compared to other well-known tools, HPG-DHunter only requires around 15% of the execution time required by other tools for detecting the DMRs.",
                "authors": [
                    {
                        "name": "Fernandez L."
                    },
                    {
                        "name": "Perez M."
                    },
                    {
                        "name": "Olanda R."
                    },
                    {
                        "name": "Orduna J.M."
                    },
                    {
                        "name": "Marquez-Molins J."
                    }
                ],
                "date": "2020-07-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HPG-DHunter: An ultrafast, friendly tool for DMR detection and visualization"
            },
            "pmcid": "PMC7336418",
            "pmid": "32631226"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}