{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T11:02:40Z",
    "biotoolsCURIE": "biotools:indpensim",
    "biotoolsID": "indpensim",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Stephen Goldrick",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/6060347-stephen-goldrick"
        }
    ],
    "description": "A 1st principles mathematical model of a 100,000 Litre penicillin fermentation",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/mlc-downloads/downloads/ebeae5d7-32a4-4ebe-b8e7-d4d6599e41dd/30eaeb86-9d16-4fca-8196-06ad6a87b8ef/images/screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/49041-industrial-scale-penicillin-simulationv2",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T20:23:23.420158Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.industrialpenicillinsimulation.com"
        }
    ],
    "name": "IndPenSim",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.jbiotec.2014.10.029",
            "metadata": {
                "abstract": "This paper describes a simulation of an industrial-scale fed-batch fermentation that can be used as a benchmark in process systems analysis and control studies. The simulation was developed using a mechanistic model and validated using historical data collected from an industrial-scale penicillin fermentation process. Each batch was carried out in a 100,000. L bioreactor that used an industrial strain of Penicillium chrysogenum. The manipulated variables recorded during each batch were used as inputs to the simulator and the predicted outputs were then compared with the on-line and off-line measurements recorded in the real process. The simulator adapted a previously published structured model to describe the penicillin fermentation and extended it to include the main environmental effects of dissolved oxygen, viscosity, temperature, pH and dissolved carbon dioxide. In addition the effects of nitrogen and phenylacetic acid concentrations on the biomass and penicillin production rates were also included. The simulated model predictions of all the on-line and off-line process measurements, including the off-gas analysis, were in good agreement with the batch records. The simulator and industrial process data are available to download at www.industrialpenicillinsimulation.com and can be used to evaluate, study and improve on the current control strategy implemented on this facility.",
                "authors": [
                    {
                        "name": "Goldrick S."
                    },
                    {
                        "name": "Lennox B."
                    },
                    {
                        "name": "Lovett D."
                    },
                    {
                        "name": "Montague G."
                    },
                    {
                        "name": "Stefan A."
                    }
                ],
                "citationCount": 78,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Journal of Biotechnology",
                "title": "The development of an industrial-scale fed-batch fermentation simulation"
            },
            "pmid": "25449107",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1016/j.compchemeng.2019.05.037",
            "metadata": {
                "abstract": "This paper outlines real-world control challenges faced by modern-day biopharmaceutical facilities through the extension of a previously developed industrial-scale penicillin fermentation simulation (IndPenSim). The extensions include the addition of a simulated Raman spectroscopy device for the purpose of developing, evaluating and implementation of advanced and innovative control solutions applicable to biotechnology facilities. IndPenSim can be operated in fixed or operator controlled mode and generates all the available on-line, off-line and Raman spectra for each batch. The capabilities of IndPenSim were initially demonstrated through the implementation of a QbD methodology utilising the three stages of the PAT framework. Furthermore, IndPenSim evaluated a fault detection algorithm to detect process faults occurring on different batches recorded throughout a yearly campaign. The simulator and all data presented here are available to download at www.industrialpenicillinsimulation.com and acts as a benchmark for researchers to analyse, improve and optimise the current control strategy implemented on this facility. Additionally, a highly valuable data resource containing 100 batches with all available process and Raman spectroscopy measurements is freely available to download. This data is highly suitable for the development of big data analytics, machine learning (ML) or artificial intelligence (AI) algorithms applicable to the biopharmaceutical industry.",
                "authors": [
                    {
                        "name": "Duran-Villalobos C.A."
                    },
                    {
                        "name": "Farid S.S."
                    },
                    {
                        "name": "Goldrick S."
                    },
                    {
                        "name": "Jankauskas K."
                    },
                    {
                        "name": "Lennox B."
                    },
                    {
                        "name": "Lovett D."
                    }
                ],
                "citationCount": 34,
                "date": "2019-11-02T00:00:00Z",
                "journal": "Computers and Chemical Engineering",
                "title": "Modern day monitoring and control challenges outlined on an industrial-scale benchmark fermentation process"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        }
    ],
    "version": [
        "2.0.1.3"
    ]
}
