{
    "additionDate": "2017-08-03T19:00:17Z",
    "biotoolsCURIE": "biotools:somruler",
    "biotoolsID": "somruler",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/"
        }
    ],
    "description": "A novel TMH predictor with excellent interpretability while possessing high prediction accuracy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.csbio.sjtu.edu.cn/bioinf/SOMRuler/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://www.csbio.sjtu.edu.cn/bioinf/SOMRuler/",
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/somruler-a-novel-interpretable-transmembrane-helices-predictor.html"
        }
    ],
    "name": "SOMRuler",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Transmembrane helices (TMH) identification is one of the most important steps in membrane protein structure prediction. Existing TMH predictors tend to pursue accurate computational models without carefully considering the interpretability of these models and thus act as a black box. In this paper, a novel TMH predictor called SOMRuler with excellent interpretability while possessing high prediction accuracy is presented. The SOMRuler uses a self-organizing map (SOM) to learn helices distribution knowledge, which is encoded in the codebook vectors of the trained SOM, from the training samples. Human interpretable fuzzy rules are then extracted from the codebook vectors of the trained SOM. By extracting fuzzy rules from the learned knowledge rather than the original training samples, on the one hand, the computational burden of extracting fuzzy rules can be greatly reduced; on the other hand, the reliability of the extracted rules can also be enhanced since noise contained in the original samples can be smoothened by the learning procedure of SOM. The validity of the fuzzy rules extracted by SOMRuler is qualitatively and quantitatively analyzed. Experimental results on the benchmark dataset show that the SOMRuler outperforms most existing popular TMH predictors and is flexible to suite for a wide variety of problems in bioinformatics. The SOMRuler software is implemented by Java and Matlab and is available for academic use at: http://www.csbio.sjtu.edu.cn/bioinf/SOMRuler/. © 2011 IEEE.",
                "authors": [
                    {
                        "name": "Yu D."
                    },
                    {
                        "name": "Shen H."
                    },
                    {
                        "name": "Yang J."
                    }
                ],
                "citationCount": 15,
                "date": "2011-06-01T00:00:00Z",
                "journal": "IEEE Transactions on Nanobioscience",
                "title": "SOMRuler: A novel interpretable transmembrane helices predictor"
            },
            "pmid": "21742571"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}