{
    "additionDate": "2020-01-14T09:15:12Z",
    "biotoolsCURIE": "biotools:VarCover",
    "biotoolsID": "VarCover",
    "confidence_flag": "tool",
    "description": "Allele Min-Set Cover Software.\n\nTo facilitate reference-material selection for clinical genetic testing laboratories, we developed VarCover, open-source software hosted on GitHub, which accepts a file of variants (rsIDs or VCF) and returns an approximately minimal set of samples covering the targeted alleles. VarCover employs the SetCoverPy package, sample weights, and preselection of singleton-possessing samples to efficiently solve the min-set cover problem. As a test case, we attempted to find a minimal set of reference samples from the 1000 Genomes Project to cover 237 variants considered putatively pathogenic (of which 12 were classified as pathogenic or likely pathogenic) in the original 56 medically actionable genes recommended by the American College of Medical Genetics and Genomics (ACMG). The number of samples, number of alleles, and processing time were measured in subsets of the 237 target alleles.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/erscott/varcover",
    "lastUpdate": "2021-01-16T17:44:07Z",
    "name": "VarCover",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JMOLDX.2019.10.005",
            "metadata": {
                "abstract": "© 2020 American Society for Investigative Pathology and the Association for Molecular PathologyTo facilitate reference-material selection for clinical genetic testing laboratories, we developed VarCover, open-source software hosted on GitHub, which accepts a file of variants and returns an approximately minimum set (min-set) of samples covering the targeted alleles. VarCover employs the SetCoverPy package, sample weights, and preselection of singleton-possessing samples to efficiently solve the min-set cover problem. As a test case, we attempted to find a min-set of reference samples from the 1000 Genomes Project to cover 237 variants considered putatively pathogenic (of which 12 were classified as pathogenic or likely pathogenic) in the original 56 medically actionable genes recommended by the American College of Medical Genetics and Genomics (ACMG). The number of samples, number of alleles, and processing time were measured in subsets of the 237 target alleles. VarCover identified 140 reference-material samples from the 1000 Genomes Project covering the 237 alleles in the 56 ACMG-recommended genes. Sample weights derived from the minor allele frequency spectrum increased the number of alleles in the solution set. Preselection of samples that possessed singleton target alleles reduced computational processing time when the target set size exceeded 100 alleles. VarCover provides a simple programmatic interface for identifying an approximately min-set of reference samples, thereby reducing clinical laboratory effort and molecular genetic test–validation costs.",
                "authors": [
                    {
                        "name": "Bansal V."
                    },
                    {
                        "name": "Meacham C."
                    },
                    {
                        "name": "Scott E.R."
                    },
                    {
                        "name": "Scott S.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Journal of Molecular Diagnostics",
                "title": "VarCover: Allele Min-Set Cover Software"
            },
            "pmid": "31751680"
        }
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1
}
