{
    "additionDate": "2021-01-18T12:36:21Z",
    "biotoolsCURIE": "biotools:phonbank",
    "biotoolsID": "phonbank",
    "confidence_flag": "tool",
    "description": "Markedness and implicational relationships in phonological development.\n\nPhon is a software program that supports the building of textual and phonological data corpora. While it was originally created to support the study of child language development, Phon can be used ...\n\nPhonBank is the child phonology component of the TalkBank system. TalkBank is a system for sharing and studying conversational interactions. PhonBank is supported by grant RO1-HD051698 from NIH-NICHHD to Brian MacWhinney and Yvan Rose. PHON is designed and built by Yvan Rose and Greg Hedlund. Currently available materials include:.\n\nPhon is a software program that supports the building of textual and phonological data corpora.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://phonbank.talkbank.org",
    "lastUpdate": "2021-01-23T15:25:34Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.phon.ca"
        }
    ],
    "name": "PhonBank",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1080/17549507.2020.1842906",
            "metadata": {
                "abstract": "© 2020 The Speech Pathology Association of Australia Limited.Purpose: The complexity approach to speech disorders, based on the theoretical notion of phonological markedness, has been gaining interest over the last decade. In a nutshell, this approach suggests that the acquisition of phonologically marked units (e.g. complex onsets) implies the acquisition of less marked ones (e.g. singleton onsets). However, because the notion of markedness is, itself, subject to controversies, we need to constrain what types of implications can be generalised among language learners, within and across languages. Method: We report on longitudinal data from one phonologically-disordered and five typically-developing children documented across four different languages (English, French, German, Portuguese), using data from the PhonBank database (https://phonbank.talkbank.org). Using the Phon software program (https://www.phon.ca), we systematically analysed each longitudinal study for consonants in singleton onsets and codas as well as in onset clusters. Result: The implicational relationships supported by our study involve units of similar types (e.g. relations between different segmental categories), while relationships that involve different types of units or processes cannot be generalised across learners. Conclusion: A better understanding of implicational relationships makes the complexity approach more predictive of developmental patterns of phonology and related phonological disorders.",
                "authors": [
                    {
                        "name": "Watts E."
                    },
                    {
                        "name": "Rose Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "International Journal of Speech-Language Pathology",
                "title": "Markedness and implicational relationships in phonological development: A cross-linguistic investigation"
            },
            "pmid": "33342295"
        }
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}