{
    "accessibility": "Open access",
    "additionDate": "2019-05-25T15:29:30Z",
    "biotoolsCURIE": "biotools:OpenCASA",
    "biotoolsID": "OpenCASA",
    "cost": "Free of charge",
    "description": "Open-source and scalable computer-assisted sperm analysis (CASA) tool. Allows users to study three classical sperm quality parameters: motility, morphometry and membrane integrity (viability) and offers the possibility of analyzing the guided movement response of spermatozoa to different stimuli or different motile cells.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/calquezar/OpenCASA/blob/master/Users%20manual%20v1.0.pdf"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/calquezar/OpenCASA/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/calquezar/OpenCASA",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/calquezar/OpenCASA/issues"
        }
    ],
    "maturity": "Mature",
    "name": "OpenCASA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1006691",
            "metadata": {
                "abstract": "© 2019 Alquézar-Baeta et al.In the field of assisted reproductive techniques (ART), computer-assisted sperm analysis (CASA) systems have proved their utility and potential for assessing sperm quality, improving the prediction of the fertility potential of a seminal dose. Although most laboratories and scientific centers use commercial systems, in the recent years certain free and open-source alternatives have emerged that can reduce the costs that research groups have to face. However, these open-source alternatives cannot analyze sperm kinetic responses to different stimuli, such as chemotaxis, thermotaxis or rheotaxis. In addition, the programs released to date have not usually been designed to encourage the scalability and the continuity of software development. We have developed an open-source CASA software, called OpenCASA, which allows users to study three classical sperm quality parameters: motility, morphometry and membrane integrity (viability) and offers the possibility of analyzing the guided movement response of spermatozoa to different stimuli (useful for chemotaxis, thermotaxis or rheotaxis studies) or different motile cells such as bacteria, using a single software. This software has been released in a Version Control System at Github. This platform will allow researchers not only to download the software but also to be involved in and contribute to further developments. Additionally, a Google group has been created to allow the research community to interact and discuss OpenCASA. For validation of the OpenCASA software, we analysed different simulated sperm populations (for chemotaxis module) and evaluated 36 ejaculates obtained from 12 fertile rams using other sperm analysis systems (for motility, membrane integrity and morphology modules). The results were compared with those obtained by Open-CASA using the Pearson's correlation and Bland-Altman tests, obtaining a high level of correlation in all parameters and a good agreement between the different used methods and the OpenCASA. With this work, we propose an open-source project oriented to the development of a new software application for sperm quality analysis. This proposed software will use a minimally centralized infrastructure to allow the continued development of its modules by the research community.",
                "authors": [
                    {
                        "name": "Alquezar-Baeta C."
                    },
                    {
                        "name": "Gimeno-Martos S."
                    },
                    {
                        "name": "Miguel-Jimenez S."
                    },
                    {
                        "name": "Santolaria P."
                    },
                    {
                        "name": "Yaniz J."
                    },
                    {
                        "name": "Palacin I."
                    },
                    {
                        "name": "Casao A."
                    },
                    {
                        "name": "Cebrian-Perez J.A."
                    },
                    {
                        "name": "Muino-Blanco T."
                    },
                    {
                        "name": "Perez-Pe R."
                    }
                ],
                "citationCount": 7,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "OpenCASA: A new open-source and scalable tool for sperm quality analysis"
            },
            "pmcid": "PMC6355034",
            "pmid": "30657753",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}