{
    "additionDate": "2018-05-05T09:27:20Z",
    "biotoolsCURIE": "biotools:genepopedit",
    "biotoolsID": "genepopedit",
    "credit": [
        {
            "name": "Ryan Stanley",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/rystanley"
        }
    ],
    "description": "Simple and flexible tool for manipulating multilocus molecular data in R.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/rystanley/genepopedit"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rystanley/genepopedit",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "genepopedit",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1111/1755-0998.12569",
            "metadata": {
                "abstract": "© 2016 John Wiley & Sons Ltd Advances in genetic sequencing technologies and techniques have made large, genome-wide data sets comprised of hundreds or even thousands of individuals and loci the norm rather than the exception even for nonmodel organisms. While such data present new opportunities for evaluating population structure and demographic processes, the large size of these genomic data sets brings new computational challenges for researchers needing to parse, convert and manipulate data often into a variety of software-specific formats required of genomic analyses. We developed genepopedit as a flexible tool for the manipulation of multilocus molecular data sets. Functionality can be divided among diagnostic-, manipulation-, sampling-, simulation-, and transformation-based tools. Metadata from large genomic data sets can be efficiently extracted, without the need to view data in a text-editing program. genepopedit provides tools to manipulate loci, individual samples and populations included in genomic data sets, in addition to the ability to convert directly to a variety of software formats. Functions are compiled as an R package, which can integrate into existing analysis workflows. Importantly, genepopedit provides a simple yet robust code-based tool for repeatable genomic data manipulation, which has been proven to be stable for data sets in excess of 200 000 SNPs. The latest version of the package and associated documentation are available on Github (github.com/rystanley/genepopedit).",
                "authors": [
                    {
                        "name": "Stanley R.R.E."
                    },
                    {
                        "name": "Jeffery N.W."
                    },
                    {
                        "name": "Wringe B.F."
                    },
                    {
                        "name": "DiBacco C."
                    },
                    {
                        "name": "Bradbury I.R."
                    }
                ],
                "citationCount": 17,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "genepopedit: a simple and flexible tool for manipulating multilocus molecular data in R"
            },
            "pmid": "27434661"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}