{
    "accessibility": "Open access",
    "additionDate": "2018-07-29T11:54:35Z",
    "biotoolsCURIE": "biotools:fc_analysis",
    "biotoolsID": "fc_analysis",
    "credit": [
        {
            "email": "simone.dinarelli@ism.cnr.it",
            "name": "Simone Dinarelli",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This open source software package automatically analyses single force curves or entire force volume maps to yield the corresponding elasticity and deformability images. The principal characteristic of the package is a large adaptability to the various experimental setups and to different analysis methodologies.",
    "download": [
        {
            "type": "Software package",
            "url": "https://static-content.springer.com/esm/art%3A10.1186%2Fs12859-018-2265-4/MediaObjects/12859_2018_2265_MOESM1_ESM.exe"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://uk.mathworks.com/products/compiler/mcr",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "name": "FC_analysis",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2265-4",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: The collection and analysis of Atomic Force Microscopy force curves is a well-established procedure to obtain high-resolution information of non-topographic data from any kind of sample, including biological specimens. In particular, these analyses are commonly employed to study elasticity, stiffness or adhesion properties of the samples. Furthermore, the collection of several force curves over an extended area of the specimens allows reconstructing maps, called force volume maps, of the spatial distribution of the mechanical properties. Coupling these maps with the conventional high-resolution topographic reconstruction of the sample's surface, provides a deeper insight on the sample composition from the structural and nanomechanical point of view. Results: In this paper we present the open source software package FC_analysis that automatically analyses single force curves or entire force volume maps to yield the corresponding elasticity and deformability images. The principal characteristic of the FC_analysis is a large adaptability to the various experimental setups and to different analysis methodologies. For instance, the user can provide custom values for the detector sensitivity, scanner-z sensitivity, cantilever's elastic constant and map's acquisition modality and can choose between different analysis methodologies. Furthermore, the software allows the optimization of the fitting parameters and gives direct control on each step of the analysis procedure. Notably, to overcome a limitation common to many other analysis programs, FC_analysis can be applied to a rectangular portion of the image, allowing the analysis of inhomogeneous samples. Finally, the software allows reconstructing a Young's modulus map at different penetration depths, enabling the use of modern investigation tools such as the force tomography. Conclusions: The FC_analysis software aims to become a useful tool for the analysis of force curves maps collected using custom or commercial Atomic Force Microscopes, and is especially useful in those cases for which the producer doesn't release a dedicated software.",
                "authors": [
                    {
                        "name": "Dinarelli S."
                    },
                    {
                        "name": "Girasole M."
                    },
                    {
                        "name": "Longo G."
                    }
                ],
                "date": "2018-07-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "FC_analysis: A tool for investigating atomic force microscopy maps of force curves"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1
}