{
    "additionDate": "2015-01-22T11:40:37Z",
    "biotoolsCURIE": "biotools:abacus",
    "biotoolsID": "abacus",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "barbara.dicamillo@unipd.it",
            "name": "Barbara Di Camillo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~dicamill/"
        }
    ],
    "description": "Identify SNPs significantly associated with a disease within predefined sets of SNPs such as pathways or genomic regions. Applied to a whole SNP dataset, the tool gives as output a list of SNP-sets associated with the disease and, for each SNP-set, the list of significant SNPs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sysbiobig.dei.unipd.it/?q=Software#ABACUS"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "ABACUS is an R package for the identification of SNPs and pathways associated with a phenotype. ABACUS is robust to the concurrent presence of SNPs with protective and detrimental effects and of common and rare variants",
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://sysbiobig.dei.unipd.it/?q=Software#ABACUS",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-3.0",
    "name": "ABACUS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt697",
            "metadata": {
                "abstract": "Motivation: In the past years, both sequencing and microarray have been widely used to search for relations between genetic variations and predisposition to complex pathologies such as diabetes or neurological disorders. These studies, however, have been able to explain only a small fraction of disease heritability, possibly because complex pathologies cannot be referred to few dysfunctional genes, but are rather heterogeneous and multicausal, as a result of a combination of rare and common variants possibly impairing multiple regulatory pathways. Rare variants, though, are difficult to detect, especially when the effects of causal variants are in different directions, i.e. with protective and detrimental effects.Results: Here, we propose ABACUS, an Algorithm based on a BivAriate CUmulative Statistic to identify single nucleotide polymorphisms (SNPs) significantly associated with a disease within predefined sets of SNPs such as pathways or genomic regions. ABACUS is robust to the concurrent presence of SNPs with protective and detrimental effects and of common and rare variants; moreover, it is powerful even when few SNPs in the SNP-set are associated with the phenotype. We assessed ABACUS performance on simulated and real data and compared it with three state-of-the-art methods. When ABACUS was applied to type 1 and 2 diabetes data, besides observing a wide overlap with already known associations, we found a number of biologically sound pathways, which might shed light on diabetes mechanism and etiology. © 2013 The Author 2013.",
                "authors": [
                    {
                        "name": "Di Camillo B."
                    },
                    {
                        "name": "Sambo F."
                    },
                    {
                        "name": "Toffolo G."
                    },
                    {
                        "name": "Cobelli C."
                    }
                ],
                "citationCount": 4,
                "date": "2014-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ABACUS: An entropy-based cumulative bivariate statistic robust to rare variants and different direction of genotype effect"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}