{
    "additionDate": "2021-01-18T12:11:21Z",
    "biotoolsCURIE": "biotools:deepdili",
    "biotoolsID": "deepdili",
    "confidence_flag": "tool",
    "description": "DeepDILI is a tool for Deep Learning-Powered Drug-Induced Liver Injury Prediction Using Model-Level Representation",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/TingLi2016/DeepDILI",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T15:56:52Z",
    "name": "DeepDILI",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.CHEMRESTOX.0C00374",
            "metadata": {
                "abstract": "© 2020 American Chemical Society.Drug-induced liver injury (DILI) is the most frequently reported single cause of safety-related withdrawal of marketed drugs. It is essential to identify drugs with DILI potential at the early stages of drug development. In this study, we describe a deep learning-powered DILI (DeepDILI) prediction model created by combining model-level representation generated by conventional machine learning (ML) algorithms with a deep learning framework based on Mold2 descriptors. We conducted a comprehensive evaluation of the proposed DeepDILI model performance by posing several critical questions: (1) Could the DILI potential of newly approved drugs be predicted by accumulated knowledge of early approved ones? (2) is model-level representation more informative than molecule-based representation for DILI prediction? and (3) could improved model explainability be established? For question 1, we developed the DeepDILI model using drugs approved before 1997 to predict the DILI potential of those approved thereafter. As a result, the DeepDILI model outperformed the five conventional ML algorithms and two state-of-the-art ensemble methods with a Matthews correlation coefficient (MCC) value of 0.331. For question 2, we demonstrated that the DeepDILI model's performance was significantly improved (i.e., a MCC improvement of 25.86% in test set) compared with deep neural networks based on molecule-based representation. For question 3, we found 21 chemical descriptors that were enriched, suggesting a strong association with DILI outcome. Furthermore, we found that the DeepDILI model has more discrimination power to identify the DILI potential of drugs belonging to the World Health Organization therapeutic category of 'alimentary tract and metabolism'. Moreover, the DeepDILI model based on Mold2 descriptors outperformed the ones with Mol2vec and MACCS descriptors. Finally, the DeepDILI model was applied to the recent real-world problem of predicting any DILI concern for potential COVID-19 treatments from repositioning drug candidates. Altogether, this developed DeepDILI model could serve as a promising tool for screening for DILI risk of compounds in the preclinical setting, and the DeepDILI model is publicly available through https://github.com/TingLi2016/DeepDILI.",
                "authors": [
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Tong W."
                    },
                    {
                        "name": "Roberts R."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Thakkar S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-15T00:00:00Z",
                "journal": "Chemical Research in Toxicology",
                "title": "DeepDILI: Deep Learning-Powered Drug-Induced Liver Injury Prediction Using Model-Level Representation"
            },
            "pmid": "33356151"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}