{
    "additionDate": "2017-03-27T12:32:31Z",
    "biotoolsCURIE": "biotools:tcof-db",
    "biotoolsID": "tcof-db",
    "credit": [
        {
            "email": "sebastian.schmeier@kaust.edu.sa",
            "name": "Sebastian Schmeier",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "ulf.schaefer@kaust.edu.sa",
            "name": "Ulf Schaefer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "vladimir.bajic@kaust.edu.sa",
            "name": "Vladimir B. Bajic",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TcoF is a database that facilitates the exploration of proteins involved in the regulation of transcription in humans by binding to regulatory DNA regions (transcription factors) and proteins involved in the regulation of transcription in humans by interacting with transcription factors and not binding to regulatory DNA regions (transcription co-factors). Proteins can be searched by a variety of identifiers or predefined sets of proteins can be viewed.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.cbrc.kaust.edu.sa/tcof/Manual.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA transcription",
                    "uri": "http://edamontology.org/operation_0372"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://cbrc.kaust.edu.sa/tcof/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "TcoF-DB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The initiation and regulation of transcription in eukaryotes is complex and involves a large number of transcription factors (TFs), which are known to bind to the regulatory regions of eukaryotic DNA. Apart from TF-DNA binding, protein-protein interaction involving TFs is an essential component of the machinery facilitating transcriptional regulation. Proteins that interact with TFs in the context of transcription regulation but do not bind to the DNA themselves, we consider transcription co-factors (TcoFs). The influence of TcoFs on transcriptional regulation and initiation, although indirect, has been shown to be significant with the functionality of TFs strongly influenced by the presence of TcoFs. While the role of TFs and their interaction with regulatory DNA regions has been well-studied, the association between TFs and TcoFs has so far been given less attention. Here, we present a resource that is comprised of a collection of human TFs and the TcoFs with which they interact. Other proteins that have a proven interaction with a TF, but are not considered TcoFs are also included. Our database contains 157 high-confidence TcoFs and additionally 379 hypothetical TcoFs. These have been identified and classified according to the type of available evidence for their involvement in transcriptional regulation and their presence in the cell nucleus. We have divided TcoFs into four groups, one of which contains high-confidence TcoFs and three others contain TcoFs which are hypothetical to different extents. We have developed the Dragon Database for Human Transcription Co-Factors and Transcription Factor Interacting Proteins (TcoF-DB). A web-based interface for this resource can be freely accessed at http://cbrc.kaust.edu.sa/tcof/ and http://apps.sanbi.ac.za/tcof/. © The Author(s) 2010.",
                "authors": [
                    {
                        "name": "Bajic V.B."
                    },
                    {
                        "name": "Schaefer U."
                    },
                    {
                        "name": "Schmeier S."
                    }
                ],
                "citationCount": 43,
                "date": "2011-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "TcoF-DB: Dragon database for human transcription co-factors and transcription factor interacting proteins"
            },
            "pmid": "20965969"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
