{
    "additionDate": "2019-11-14T18:49:00Z",
    "biotoolsCURIE": "biotools:RT_networks",
    "biotoolsID": "RT_networks",
    "confidence_flag": "tool",
    "description": "> VERY_LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'RT', 'TRNs', 'TRNs RT', 'provocative' | Replication timing networks reveal a link between transcription regulatory circuits and replication timing control | Create community RT network For RT Networks visualization. It will return None, but creates txt file for the input for the SAFE algorithm | > pip install -r requirements.txt | Before running below do_something.py, please edit parameters in each file",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "trans-regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sebkim/RTNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-16T10:14:32.454832Z",
    "name": "RT networks",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/GR.247049.118",
            "metadata": {
                "abstract": "© 2019 Rivera-Mulia et al.DNA replication occurs in a defined temporal order known as the replication timing (RT) program and is regulated during development, coordinated with 3D genome organization and transcriptional activity. However, transcription and RT are not sufficiently coordinated to predict each other, suggesting an indirect relationship. Here, we exploit genome-wide RT profiles from 15 human cell types and intermediate differentiation stages derived from human embryonic stem cells to construct different types of RT regulatory networks. First, we constructed networks based on the coordinated RT changes during cell fate commitment to create highly complex RT networks composed of thousands of interactions that form specific functional subnetwork communities. We also constructed directional regulatory networks based on the order of RT changes within cell lineages, and identified master regulators of differentiation pathways. Finally, we explored relationships between RT networks and transcriptional regulatory networks (TRNs) by combining them into more complex circuitries of composite and bipartite networks. Results identified novel trans interactions linking transcription factors that are core to the regulatory circuitry of each cell type to RT changes occurring in those cell types. These core transcription factors were found to bind cooperatively to sites in the affected replication domains, providing provocative evidence that they constitute biologically significant directional interactions. Our findings suggest a regulatory link between the establishment of cell-type–specific TRNs and RT control during lineage specification.",
                "authors": [
                    {
                        "name": "Rivera-Mulia J.C."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Gabr H."
                    },
                    {
                        "name": "Chakraborty A."
                    },
                    {
                        "name": "Ay F."
                    },
                    {
                        "name": "Kahveci T."
                    },
                    {
                        "name": "Gilbert D.M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Replication timing networks reveal a link between transcription regulatory circuits and replication timing control"
            },
            "pmcid": "PMC6724675",
            "pmid": "31434679"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        }
    ]
}