{
    "additionDate": "2017-08-20T16:07:00Z",
    "biotoolsCURIE": "biotools:hisat2",
    "biotoolsID": "hisat2",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://sourceforge.net/projects/bowtie-bio/lists/bowtie-bio-announce"
        }
    ],
    "description": "Alignment program for mapping next-generation sequencing reads (both DNA and RNA) to a population of human genomes (as well as to a single reference genome).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://ccb.jhu.edu/software/hisat2/manual.shtml"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "https://ccb.jhu.edu/software/hisat2/index.shtml",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-09-04T08:38:10Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/infphilo/hisat2"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/infphilo/hisat2/issues"
        }
    ],
    "name": "HISAT2",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1038/nmeth.3317",
            "metadata": {
                "abstract": "HISAT (hierarchical indexing for spliced alignment of transcripts) is a highly efficient system for aligning reads from RNA sequencing experiments. HISAT uses an indexing scheme based on the Burrows-Wheeler transform and the Ferragina-Manzini (FM) index, employing two types of indexes for alignment: a whole-genome FM index to anchor each alignment and numerous local FM indexes for very rapid extensions of these alignments. HISAT's hierarchical index for the human genome contains 48,000 local FM indexes, each representing a genomic region of 1/464,000 bp. Tests on real and simulated data sets showed that HISAT is the fastest system currently available, with equal or better accuracy than any other method. Despite its large number of indexes, HISAT requires only 4.3 gigabytes of memory. HISAT supports genomes of any size, including those larger than 4 billion bases.",
                "authors": [
                    {
                        "name": "Kim D."
                    },
                    {
                        "name": "Langmead B."
                    },
                    {
                        "name": "Salzberg S.L."
                    }
                ],
                "citationCount": 5742,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "HISAT: A fast spliced aligner with low memory requirements"
            },
            "pmcid": "PMC4655817",
            "pmid": "25751142",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1038/nprot.2016.095",
            "metadata": {
                "abstract": "© 2016 Nature Publishing Group. All rights reserved.High-throughput sequencing of mRNA(RNA-seq) has become the standard method for measuring and comparing the levels of gene expression in a wide variety of species and conditions. RNA-seq experiments generate very large, complex data sets that demand fast, accurate and flexible software to reduce the raw read data to comprehensible results. HISAT(hierarchical indexing for spliced alignment of transcripts), StringTie and Ballgown are free, open-source software tools for comprehensive analysis of RNA-seq experiments. Together, they allow scientists to align reads to a genome, assemble transcripts including novel splice variants, compute the abundance of these transcripts in each sample and compare experiments to identify differentially expressed genes and transcripts. This protocol describes all the steps necessary to process a large set of raw sequencing reads and create lists of gene transcripts, expression levels, and differentially expressed genes and transcripts. The protocol's execution time depends on the computing resources, but it typically takes under 45 min of computer time. HISAT, StringTie and Ballgown are available from http://ccb.jhu.edu/software.shtml.",
                "authors": [
                    {
                        "name": "Pertea M."
                    },
                    {
                        "name": "Kim D."
                    },
                    {
                        "name": "Pertea G.M."
                    },
                    {
                        "name": "Leek J.T."
                    },
                    {
                        "name": "Salzberg S.L."
                    }
                ],
                "citationCount": 1578,
                "date": "2016-09-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Transcript-level expression analysis of RNA-seq experiments with HISAT, StringTie and Ballgown"
            },
            "pmcid": "PMC5032908",
            "pmid": "27560171",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1038/nmeth.4106",
            "metadata": {
                "abstract": "© 2017 Nature America, inc., part of springer Nature. All rights reserved.Alignment is the first step in most RNA-seq analysis pipelines, and the accuracy of downstream analyses depends heavily on it. Unlike most steps in the pipeline, alignment is particularly amenable to benchmarking with simulated data. We performed a comprehensive benchmarking of 14 common splice-aware aligners for base, read, and exon junction-level accuracy and compared default with optimized parameters. We found that performance varied by genome complexity, and accuracy and popularity were poorly correlated. The most widely cited tool underperforms for most metrics, particularly when using default settings.",
                "authors": [
                    {
                        "name": "Baruzzo G."
                    },
                    {
                        "name": "Hayer K.E."
                    },
                    {
                        "name": "Kim E.J."
                    },
                    {
                        "name": "DI Camillo B."
                    },
                    {
                        "name": "Fitzgerald G.A."
                    },
                    {
                        "name": "Grant G.R."
                    }
                ],
                "citationCount": 114,
                "date": "2017-02-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Simulation-based comprehensive benchmarking of RNA-seq aligners"
            },
            "pmcid": "PMC5792058",
            "pmid": "27941783",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}