{
    "additionDate": "2024-05-24T09:11:04.922285Z",
    "biotoolsCURIE": "biotools:lavaset",
    "biotoolsID": "lavaset",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mk218@imperial.ac.uk",
            "name": "Melpomeni Kasapi",
            "orcidid": "https://orcid.org/0000-0003-1854-1799"
        }
    ],
    "description": "An ensemble method for correlated datasets with spatial, spectral, and temporal dependencies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/melkasapi/LAVASET",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:56:20.649314Z",
    "name": "LAVASET",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btae101",
            "metadata": {
                "abstract": "Motivation: Random forests (RFs) can deal with a large number of variables, achieve reasonable prediction scores, and yield highly interpretable feature importance values. As such, RFs are appropriate models for feature selection and further dimension reduction. However, RFs are often not appropriate for correlated datasets due to their mode of selecting individual features for splitting. Addressing correlation relationships in high-dimensional datasets is imperative for reducing the number of variables that are assigned high importance, hence making the dimension reduction most efficient. Here, we propose the LAtent VAriable Stochastic Ensemble of Trees (LAVASET) method that derives latent variables based on the distance characteristics of each feature and aims to incorporate the correlation factor in the splitting step. Results: Without compromising on performance in the majority of examples, LAVASET outperforms RF by accurately determining feature importance across all correlated variables and ensuring proper distribution of importance values. LAVASET yields mostly non-inferior prediction accuracies to traditional RFs when tested in simulated and real 1D datasets, as well as more complex and high-dimensional 3D datatypes. Unlike traditional RFs, LAVASET is unaffected by single ‘important’ noisy features (false positives), as it considers the local neighbourhood. LAVASET, therefore, highlights neighbourhoods of features, reflecting real signals that collectively impact the model’s predictive ability.",
                "authors": [
                    {
                        "name": "Ebbels T.M.D."
                    },
                    {
                        "name": "Kasapi M."
                    },
                    {
                        "name": "O'Regan D.P."
                    },
                    {
                        "name": "Posma J.M."
                    },
                    {
                        "name": "Ware J.S."
                    },
                    {
                        "name": "Xu K."
                    }
                ],
                "citationCount": 1,
                "date": "2024-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LAVASET: Latent Variable Stochastic Ensemble of Trees. An ensemble method for correlated datasets with spatial, spectral, and temporal dependencies"
            },
            "pmcid": "PMC11212485",
            "pmid": "38383048"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
