{
    "additionDate": "2017-02-10T11:34:23Z",
    "biotoolsCURIE": "biotools:mitopred",
    "biotoolsID": "mitopred",
    "collectionID": [
        "Proteomics"
    ],
    "description": "Uses Pfam domains, pI values and amino acid composition to predict nuclear-encoded mitochondrial proteins. Predictions have been precomputed for a number of proteomes, as well as for all Eukaryotic sequences in Swiss-Prot and TrEMBL. Users may directly enter or upload a file with a list of protein sequences or Swiss-Prot/TrEMBL accession numbers.",
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Transmembrane protein prediction",
                    "uri": "http://edamontology.org/operation_0269"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.albany.edu/~mitopred/",
    "lastUpdate": "2019-09-23T06:55:41Z",
    "name": "MITOPRED",
    "owner": "Wadege",
    "publication": [
        {
            "metadata": {
                "abstract": "MITOPRED web server enables prediction of nucleus-encoded mitochondrial proteins in all eukaryotic species. Predictions are made using a new algorithm based primarily on Pfam domain occurrence patterns in mitochondrial and non-mitochondrial locations. Pre-calculated predictions are instantly accessible for proteomes of Saccharomyces cerevisiae, Caenorhabditis elegans, Drosophila, Homo sapiens, Mus musculus and Arabidopsis species as well as all the eukaryotic sequences in the Swiss-Prot and TrEMBL databases. Queries, at different confidence levels, can be made through four distinct options: (i) entering Swiss-Prot/TrEMBL accession numbers; (ii) uploading a local file with such accession numbers; (iii)entering protein sequences; (iv) uploading a local file containing protein sequences in FASTA format. Automated updates are scheduled for the pre-calculated prediction database so as to provide access to the most current data. The server, its documentation and the data are available from http://mitopred.sdsc.edu. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Fahy E."
                    },
                    {
                        "name": "Guda C."
                    },
                    {
                        "name": "Guda P."
                    },
                    {
                        "name": "Subramaniam S."
                    }
                ],
                "citationCount": 65,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MITOPRED: A web server for the prediction of mitochondrial proteins"
            },
            "pmid": "15215413"
        },
        {
            "metadata": {
                "abstract": "Motivation: Currently available methods for the prediction of subcellular location of mitochondrial proteins rely largely on the presence of mitochondrial targeting signals in the protein sequences. However, a large fraction of mitochondrial proteins lack such signals, making those tools ineffective for genome-scale prediction of mitochondria-targeted proteins. Here, we propose a method for genome-scale prediction of nucleus-encoded mitochondrial proteins. The new method, MITOPRED, is based on the Pfam domain occurrence patterns and the amino acid compositional differences between mitochondrial and non-mitochondrial proteins. Results: MITOPRED could predict mitochondrial proteins with 100% specificity at a 44% sensitivity rate and with 67% specificity at 99% sensitivity. Additionally, it was sufficiently robust to predict mitochondrial proteins across different eukaryotic species with similar accuracy. Based on Matthews correlation coefficient measure, the prediction performance of MITOPRED is clearly superior (0.73) to those of the two popular methods TargetP (0.51) and PSORT (0.53). Using this method, we predicted the nucleus-encoded mitochondrial proteins from six complete genomes (three invertebrate, two vertebrate and one plant species) and estimated the total number in each genome. In human, our method estimated the existence of 1362 mitochondrial proteins corresponding to 4.8% of the total proteome. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Fahy E."
                    },
                    {
                        "name": "Guda C."
                    },
                    {
                        "name": "Subramaniam S."
                    }
                ],
                "citationCount": 115,
                "date": "2004-07-22T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MITOPRED: A genome-scale method for prediction of nucleus-encoded mitchondrial proteins"
            },
            "pmid": "15037509"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence composition, complexity and repeats",
            "uri": "http://edamontology.org/topic_0157"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
