{
    "accessibility": "Open access",
    "additionDate": "2022-10-12T11:22:45.603931Z",
    "biotoolsCURIE": "biotools:pfeature",
    "biotoolsID": "pfeature",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Akshara Pande"
        },
        {
            "name": "Sumeet Patiyal"
        },
        {
            "name": "Vinod Kumar"
        },
        {
            "name": "Gajendra P.S. Raghava",
            "orcidid": "https://orcid.org/0000-0002-8902-2876"
        }
    ],
    "description": "Pfeature is a web server for computing wide range of protein and peptides features from their amino acid sequence. Following are main menus for computing features; i) Composition-based features, ii) Binary profile of sequences, iii) evolutionary information based features, iv) structural descriptors, v) pattern based descriptors, and vi) model building, for a group of protein/peptide sequences. Additionally, users will also be able to generate these features for sub-parts of protein/peptide sequences. Pfeature be helpful to annotate structure, function and therapeutic properties of proteins/peptides.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/pfeature/Pfeature_Manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://webs.iiitd.edu.in/raghava/pfeature/stand.php"
        },
        {
            "type": "Source code",
            "url": "https://github.com/raghavagps/pfeature"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://webs.iiitd.edu.in/raghava/pfeature/",
    "language": [
        "PHP",
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:50:07.152440Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Helpdesk"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/pfeature/Pfeature_Manual.pdf"
        }
    ],
    "maturity": "Mature",
    "name": "Pfeature",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1089/cmb.2022.0241",
            "metadata": {
                "abstract": "In the last three decades, a wide range of protein features have been discovered to annotate a protein. Numerous attempts have been made to integrate these features in a software package/platform so that the user may compute a wide range of features from a single source. To complement the existing methods, we developed a method, Pfeature, for computing a wide range of protein features. Pfeature allows to compute more than 200,000 features required for predicting the overall function of a protein, residue-level annotation of a protein, and function of chemically modified peptides. It has six major modules, namely, composition, binary profiles, evolutionary information, structural features, patterns, and model building. Composition module facilitates to compute most of the existing compositional features, plus novel features. The binary profile of amino acid sequences allows to compute the fraction of each type of residue as well as its position. The evolutionary information module allows to compute evolutionary information of a protein in the form of a position-specific scoring matrix profile generated using Position-Specific Iterative Basic Local Alignment Search Tool (PSI-BLAST); fit for annotation of a protein and its residues. A structural module was developed for computing of structural features/descriptors from a tertiary structure of a protein. These features are suitable to predict the therapeutic potential of a protein containing non-natural or chemically modified residues. The model-building module allows to implement various machine learning techniques for developing classification and regression models as well as feature selection. Pfeature also allows the generation of overlapping patterns and features from a protein. A user-friendly Pfeature is available as a web server python library and stand-alone package.",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Arora C."
                    },
                    {
                        "name": "Dhall A."
                    },
                    {
                        "name": "Jain S."
                    },
                    {
                        "name": "Kaur D."
                    },
                    {
                        "name": "Kaur H."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Kumar V."
                    },
                    {
                        "name": "Lathwal A."
                    },
                    {
                        "name": "Mishra G."
                    },
                    {
                        "name": "Pande A."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma N."
                    },
                    {
                        "name": "Usmani S.S."
                    }
                ],
                "citationCount": 24,
                "date": "2023-02-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "Pfeature: A Tool for Computing Wide Range of Protein Features and Building Prediction Models"
            },
            "pmid": "36251780"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}
