{
    "additionDate": "2017-08-03T19:00:11Z",
    "biotoolsCURIE": "biotools:snptrio",
    "biotoolsID": "snptrio",
    "credit": [
        {
            "email": "pevsner@kennedykrieger.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pevsnerlab.kennedykrieger.org/"
        }
    ],
    "description": "This tool offers an additional category of SNP information by visualizing and analyzing inheritance patterns in trios (mother, father, and child).",
    "documentation": [
        {
            "type": "General",
            "url": "http://pevsnerlab.kennedykrieger.org/php/?q=node/71"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://pevsnerlab.kennedykrieger.org/SNPtrio.htm",
    "language": [
        "R",
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/snptrio-snp-trio-visualization-tool.html"
        }
    ],
    "name": "SNPtrio",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "A variety of alterations occur in chromosomal DNA, many of which can be detected using high density single nucleotide polymorphism (SNP) microarrays. These include deletions and duplications (assessed by observing changes in copy number) and regions of homozygosity. The analysis of SNP data from trios can provide an additional category of information about the nature and origin of inheritance patterns, including uniparental disomy (UPD), loss of transmitted allele (LTA), and nonparental relationship. The main purpose of SNPtrio is to locate regions of uniparental inheritance (UPI) and Mendelian inconsistency (MI), identify the type (paternal vs. maternal, iso- vs. hetero-), and assess the associated statistical probability of occurrence by chance. SNPtrio's schema permits the identification of hemizygous or homozygous deletions as well as UPD. We validated the performance of SNPtrio on three platforms (Affymetrix 10 K and 100 K arrays and Illumina 550 K arrays) using SNP data obtained from DNA samples of patients known to have UPD and diagnosed with Prader-Willi syndrome, Angelman syndrome, Beckwith-Wiedemann syndrome, pseudohypoparathyroidism, and a complex chromosome 2 abnormality. We further validated SNPtrio using DNA from patients previously shown to have microdeletions that were verified by fluorescence in situ hybridization (FISH). SNPtrio successfully identified previously known UPD and deletion regions, and generated associated probability values. SNPtrio analysis of trisomy 21 (Down syndrome) cases and their parents permitted identification of the parent of origin of the extra chromosomal copy. © 2007 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Ting J.C."
                    },
                    {
                        "name": "Roberson E.D.O."
                    },
                    {
                        "name": "Miller N.D."
                    },
                    {
                        "name": "Lysholm-Bernacchi A."
                    },
                    {
                        "name": "Stephan D.A."
                    },
                    {
                        "name": "Capone G.T."
                    },
                    {
                        "name": "Ruczinski I."
                    },
                    {
                        "name": "Thomas G.H."
                    },
                    {
                        "name": "Pevsner J."
                    }
                ],
                "citationCount": 33,
                "date": "2007-12-01T00:00:00Z",
                "journal": "Human Mutation",
                "title": "Visualization of uniparental inheritance, mendelian inconsistencies, deletions, and parent of origin effects in single nucleotide polymorphism trio data with SNPtrio"
            },
            "pmid": "17661425"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}