
{
    "credit": [
        {
            "email": "yangzhanglab@umich.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://zhanglab.ccmb.med.umich.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://zhanglab.ccmb.med.umich.edu/SAXSTER/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/saxster-saxs-assisted-protein-fold-recognition.html"
        }
    ],
    "publication": [
        {
            "abstract": "Small-angle x-ray scattering (SAXS) is able to extract low-resolution protein shape information without requiring a specific crystal formation. However, it has found little use in atomic-level protein structure determination due to the uncertainty of residue-level structural assignment. We developed a new algorithm, SAXSTER, to couple the raw SAXS data with protein-fold- recognition algorithms and thus improve template-based protein-structure predictions. We designed nine different matching scoring functions of template and experimental SAXS profiles. The logarithm of the integrated correlation score showed the best template recognition ability and had the highest correlation with the true template modeling (TM)-score of the target structures. We tested the method in large-scale protein-fold-recognition experiments and achieved significant improvements in prioritizing the best template structures. When SAXSTER was applied to the proteins of asymmetric SAXS profile distributions, the average TM-score of the top-ranking templates increased by 18% after homologous templates were excluded, which corresponds to a p-value < 10 -9 in Student's t-test. These data demonstrate a promising use of SAXS data to facilitate computational protein structure modeling, which is expected to work most efficiently for proteins of irregular global shape and/or multiple-domain protein complexes. © 2011 Biophysical Society.",
            "authors": [
                "Dos Reis M.A.",
                "Aparicio R.",
                "Zhang Y."
            ],
            "cit_count": 20,
            "journal": "Biophysical Journal",
            "pmid": "22261066",
            "title": "Improving protein template recognition by using small-angle X-ray scattering profiles",
            "year": "2011-12-07"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:saxster",
        "biotoolsID": "saxster",
        "description": "A new algorithm to combine small-angle x-ray scattering data and threading for high-resolution protein structure determination.",
        "homepage": "http://zhanglab.ccmb.med.umich.edu/SAXSTER/",
        "name": "SAXSTER"
    }
}