{
    "additionDate": "2022-10-07T05:10:31.082907Z",
    "biotoolsCURIE": "biotools:hoppred",
    "biotoolsID": "hoppred",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/hoppred/index.php"
        }
    ],
    "description": "A webserver to predict peptide hormones",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/hoppred/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/hoppred/index.php",
    "lastUpdate": "2024-07-24T11:12:11.800783Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/hoppred/index.php"
        }
    ],
    "name": "hoppred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1002/pmic.202400004",
            "metadata": {
                "abstract": "Peptide hormones serve as genome-encoded signal transduction molecules that play essential roles in multicellular organisms, and their dysregulation can lead to various health problems. In this study, we propose a method for predicting hormonal peptides with high accuracy. The dataset used for training, testing, and evaluating our models consisted of 1174 hormonal and 1174 non-hormonal peptide sequences. Initially, we developed similarity-based methods utilizing BLAST and MERCI software. Although these similarity-based methods provided a high probability of correct prediction, they had limitations, such as no hits or prediction of limited sequences. To overcome these limitations, we further developed machine and deep learning-based models. Our logistic regression-based model achieved a maximum AUROC of 0.93 with an accuracy of 86% on an independent/validation dataset. To harness the power of similarity-based and machine learning-based models, we developed an ensemble method that achieved an AUROC of 0.96 with an accuracy of 89.79% and a Matthews correlation coefficient (MCC) of 0.8 on the validation set. To facilitate researchers in predicting and designing hormone peptides, we developed a web-based server called HOPPred. This server offers a unique feature that allows the identification of hormone-associated motifs within hormone peptides. The server can be accessed at: https://webs.iiitd.edu.in/raghava/hoppred/.",
                "authors": [
                    {
                        "name": "Arora A."
                    },
                    {
                        "name": "Kaur D."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Vigneshwar P."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Proteomics",
                "title": "Prediction of peptide hormones using an ensemble of machine learning and similarity-based methods"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
