{
    "additionDate": "2019-11-14T18:30:55Z",
    "biotoolsCURIE": "biotools:collBook",
    "biotoolsID": "collBook",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "calebadampowell@gmail.com",
            "name": "Caleb Powell",
            "orcidid": "https://orcid.org/0000-0002-0687-3481",
            "typeEntity": "Person"
        },
        {
            "name": "Jacob Motley",
            "typeEntity": "Person"
        }
    ],
    "description": "A born-digital field-to-database solution for collections-based research using collNotes and collBook | collBook: Refine biological field observations | Modernizing Field Collection Techniques | collBook, is the desktop counterpart for the mobile app collNotes. Combined they are a field-to-database solution designed for field biologists to gather and format “born digital” field notes into database ready formats. A mobile application, collNote is being developed for Android and iOS devices to gather Darwin Core formatted field notes. A desktop application, collBook is being developed for Linux, OS X, and Windows to refine those field notes into portal ready Darwin Core files and specimen labels. Field note refinements include: reverse geocoding localities, taxonomic alignments, and creation of customizable labels which can optionally include catalog number barcodes",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://github.com/CapPow/collBook#Installation"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CapPow/collBook",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-16T16:37:57Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/CapPow/collBook/issues"
        }
    ],
    "name": "collBook",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/APS3.11284",
            "metadata": {
                "abstract": "© 2019 Powell et al. Applications in Plant Sciences is published by Wiley Periodicals, Inc. on behalf of the Botanical Society of AmericaPremise: The digitization of natural history collections includes transcribing specimen label data into standardized formats. Born-digital specimen data initially gathered in digital formats do not need to be transcribed, enabling their efficient integration into digitized collections. Modernizing field collection methods for born-digital workflows requires the development of new tools and processes. Methods and Results: collNotes, a mobile application, was developed for Android and iOS to supplement traditional field journals. Designed for efficiency in the field, collNotes avoids redundant data entries and does not require cellular service. collBook, a companion desktop application, refines field notes into database-ready formats and produces specimen labels. Conclusions: collNotes and collBook can be used in combination as a field-to-database solution for gathering born-digital voucher specimen data for plants and fungi. Both programs are open source and use common file types simplifying either program's integration into existing workflows.",
                "authors": [
                    {
                        "name": "Powell C."
                    },
                    {
                        "name": "Motley J."
                    },
                    {
                        "name": "Qin H."
                    },
                    {
                        "name": "Shaw J."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Applications in Plant Sciences",
                "title": "A born-digital field-to-database solution for collections-based research using collNotes and collBook"
            },
            "pmcid": "PMC6711348",
            "pmid": "31467807"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}