{
    "accessibility": "Open access",
    "additionDate": "2017-08-03T18:51:07Z",
    "biotoolsCURIE": "biotools:metapathways",
    "biotoolsID": "metapathways",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shallam@mail.ubc.ca",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://hallam.microbiology.ubc.ca/"
        }
    ],
    "description": "MetaPathways is a meta’omic analysis pipeline for the annotation and analysis for environmental sequence information. MetaPathways include metagenomic or metatranscriptomic sequence data. The pipeline consists of four operational stages including: Quality Control, Feature Prediction, Functional Annotation, Pathway Inference.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://metapathways.readthedocs.io/en/dev/index.html"
        }
    ],
    "download": [
        {
            "type": "Container file",
            "url": "https://quay.io/repository/hallamlab/metapathways",
            "version": "3.5"
        },
        {
            "type": "Source code",
            "url": "https://bitbucket.org/BCB2/metapathways/src/dev/",
            "version": "3.5"
        },
        {
            "type": "Tool wrapper (Other)",
            "url": "https://anaconda.org/Hallamlab/metapathways",
            "version": "3.5"
        }
    ],
    "editPermission": {
        "authors": [
            "mclaughlinr2"
        ],
        "type": "group"
    },
    "function": [
        {
            "cmd": "metapathways run \\\n   -i $[input_metagenome.fa] \\\n   -d ${path/to/save/reference_databases} \\\n   -o ${path/to/output} \\\n   -t ${threads}",
            "input": [
                {
                    "data": {
                        "term": "DNA sequence",
                        "uri": "http://edamontology.org/data_3494"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "Use MetaPathways to annotate a metagenome.",
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Annotated text",
                        "uri": "http://edamontology.org/data_3779"
                    },
                    "format": [
                        {
                            "term": "DSV",
                            "uri": "http://edamontology.org/format_3751"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://metapathways.readthedocs.io/en/dev/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:47:09.737653Z",
    "license": "MPL-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://metapathways.readthedocs.io/en/dev/index.html"
        }
    ],
    "name": "MetaPathways",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv361",
            "metadata": {
                "abstract": "Next-generation sequencing is producing vast amounts of sequence information from natural and engineered ecosystems. Although this data deluge has an enormous potential to transform our lives, knowledge creation and translation need software applications that scale with increasing data processing and analysis requirements. Here, we present improvements to MetaPathways, an annotation and analysis pipeline for environmental sequence information that expedites this transformation. We specifically address pathway prediction hazards through integration of a weighted taxonomic distance and enable quantitative comparison of assembled annotations through a normalized read-mapping measure. Additionally, we improve LAST homology searches through BLAST-equivalent E-values and output formats that are natively compatible with prevailing software applications. Finally, an updated graphical user interface allows for keyword annotation query and projection onto user-defined functional gene hierarchies, including the Carbohydrate-Active Enzyme database.",
                "authors": [
                    {
                        "name": "Bhatia M.P."
                    },
                    {
                        "name": "Cheung H.K."
                    },
                    {
                        "name": "Hahn A.S."
                    },
                    {
                        "name": "Hallam S.J."
                    },
                    {
                        "name": "Hanson N.W."
                    },
                    {
                        "name": "Kim D."
                    },
                    {
                        "name": "Konwar K.M."
                    },
                    {
                        "name": "Morgan-Lang C."
                    },
                    {
                        "name": "Wu S.-J."
                    }
                ],
                "citationCount": 40,
                "date": "2015-03-25T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MetaPathways v2.5: Quantitative functional, taxonomic and usability improvements"
            },
            "pmcid": "PMC4595896",
            "pmid": "26076725",
            "version": "2.5"
        },
        {
            "doi": "10.1186/1471-2105-14-202",
            "metadata": {
                "abstract": "Background: A central challenge to understanding the ecological and biogeochemical roles of microorganisms in natural and human engineered ecosystems is the reconstruction of metabolic interaction networks from environmental sequence information. The dominant paradigm in metabolic reconstruction is to assign functional annotations using BLAST. Functional annotations are then projected onto symbolic representations of metabolism in the form of KEGG pathways or SEED subsystems.Results: Here we present MetaPathways, an open source pipeline for pathway inference that uses the PathoLogic algorithm to map functional annotations onto the MetaCyc collection of reactions and pathways, and construct environmental Pathway/Genome Databases (ePGDBs) compatible with the editing and navigation features of Pathway Tools. The pipeline accepts assembled or unassembled nucleotide sequences, performs quality assessment and control, predicts and annotates noncoding genes and open reading frames, and produces inputs to PathoLogic. In addition to constructing ePGDBs, MetaPathways uses MLTreeMap to build phylogenetic trees for selected taxonomic anchor and functional gene markers, converts General Feature Format (GFF) files into concatenated GenBank files for ePGDB construction based on third-party annotations, and generates useful file formats including Sequin files for direct GenBank submission and gene feature tables summarizing annotations, MLTreeMap trees, and ePGDB pathway coverage summaries for statistical comparisons.Conclusions: MetaPathways provides users with a modular annotation and analysis pipeline for predicting metabolic interaction networks from environmental sequence information using an alternative to KEGG pathways and SEED subsystems mapping. It is extensible to genomic and transcriptomic datasets from a wide range of sequencing platforms, and generates useful data products for microbial community structure and function analysis. The MetaPathways software package, installation instructions, and example data can be obtained from http://hallam.microbiology.ubc.ca/MetaPathways. © 2013 Konwar et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hallam S.J."
                    },
                    {
                        "name": "Hanson N.W."
                    },
                    {
                        "name": "Konwar K.M."
                    },
                    {
                        "name": "Page A.P."
                    }
                ],
                "citationCount": 82,
                "date": "2013-06-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MetaPathways: A modular pipeline for constructing pathway/genome databases from environmental sequence information"
            },
            "pmcid": "PMC3695837",
            "pmid": "23800136",
            "version": "1.0"
        },
        {
            "doi": "10.1101/2024.06.04.597460",
            "version": "1.0"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        }
    ],
    "validated": 1,
    "version": [
        "3.5"
    ]
}
