{
    "additionDate": "2021-05-27T09:04:45Z",
    "biotoolsCURIE": "biotools:quickmerge",
    "biotoolsID": "quickmerge",
    "credit": [
        {
            "name": "Mahul Chakraborty",
            "orcidid": "https://orcid.org/0000-0003-2414-9187",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://mahulchakraborty.wordpress.com/"
        }
    ],
    "description": "Quickmerge is a program that uses complementary information from genomes assembled with long reads in order to improve contiguity, and works with assemblies derived from both Pacific Biosciences or Oxford Nanopore. Quickmerge will even work with hybrid assemblies made by combining long reads and Illumina short reads.",
    "editPermission": {
        "authors": [
            "ELIXIR-CZ"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mahulchak/quickmerge",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2024-11-24T14:34:13.556019Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/mahulchak/quickmerge/issues"
        }
    ],
    "name": "quickmerge",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1534/g3.118.200162",
            "metadata": {
                "abstract": "Accurate and comprehensive characterization of genetic variation is essential for deciphering the genetic basis of diseases and other phenotypes. A vast amount of genetic variation stems from largescale sequence changes arising from the duplication, deletion, inversion, and translocation of sequences. In the past 10 years, high-throughput short reads have greatly expanded our ability to assay sequence variation due to single nucleotide polymorphisms. However, a recent de novo assembly of a second Drosophila melanogaster reference genome has revealed that short read genotyping methods miss hundreds of structural variants, including those affecting phenotypes. While genomes assembled using highcoverage long reads can achieve high levels of contiguity and completeness, concerns about cost, errors, and low yield have limited widespread adoption of such sequencing approaches. Here we resequenced the reference strain of D. melanogaster (ISO1) on a single Oxford Nanopore MinION flow cell run for 24 hr. Using only reads longer than 1 kb or with at least 30x coverage, we assembled a highly contiguous de novo genome. The addition of inexpensive paired reads and subsequent scaffolding using an optical map technology achieved an assembly with completeness and contiguity comparable to the D. melanogaster reference assembly. Comparison of our assembly to the reference assembly of ISO1 uncovered a number of structural variants (SVs), including novel LTR transposable element insertions and duplications affecting genes with developmental, behavioral, and metabolic functions. Collectively, these SVs provide a snapshot of the dynamics of genome evolution. Furthermore, our assembly and comparison to the D. melanogaster reference genome demonstrates that high-quality de novo assembly of reference genomes and comprehensive variant discovery using such assemblies are now possible by a single lab for under $1,000 (USD).",
                "authors": [
                    {
                        "name": "Chakraborty M."
                    },
                    {
                        "name": "Emerson J.J."
                    },
                    {
                        "name": "Hall K."
                    },
                    {
                        "name": "Kalsow S."
                    },
                    {
                        "name": "Miller D.E."
                    },
                    {
                        "name": "Perera A.G."
                    },
                    {
                        "name": "Scott Hawley R."
                    },
                    {
                        "name": "Solares E.A."
                    }
                ],
                "citationCount": 66,
                "date": "2018-10-01T00:00:00Z",
                "journal": "G3: Genes, Genomes, Genetics",
                "title": "Rapid low-cost assembly of the drosophila melanogaster reference genome using low-coverage, long-read sequencing"
            },
            "pmcid": "PMC6169397",
            "pmid": "30018084",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
