{
    "additionDate": "2022-06-28T09:46:01.126254Z",
    "biotoolsCURIE": "biotools:mccdti",
    "biotoolsID": "mccdti",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Tetsuya Sakurai"
        },
        {
            "name": "Yifan Shang",
            "orcidid": "https://orcid.org/0000-0002-5805-7347"
        }
    ],
    "description": "A framework MccDTI for DTIs prediction by integrating heterogeneous information of drug and target. MccDTI adopts multiview network embedding to integrate heterogeneous information.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ShangCS/MccDTI",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:59:37.764592Z",
    "license": "Not licensed",
    "name": "MccDTI",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bib/bbac059",
            "metadata": {
                "abstract": "Accurate prediction of drug-target interactions (DTIs) can reduce the cost and time of drug repositioning and drug discovery. Many current methods integrate information from multiple data sources of drug and target to improve DTIs prediction accuracy. However, these methods do not consider the complex relationship between different data sources. In this study, we propose a novel computational framework, called MccDTI, to predict the potential DTIs by multiview network embedding, which can integrate the heterogenous information of drug and target. MccDTI learns high-quality low-dimensional representations of drug and target by preserving the consistent and complementary information between multiview networks. Then MccDTI adopts matrix completion scheme for DTIs prediction based on drug and target representations. Experimental results on two datasets show that the prediction accuracy of MccDTI outperforms four state-of-the-art methods for DTIs prediction. Moreover, literature verification for DTIs prediction shows that MccDTI can predict the reliable potential DTIs. These results indicate that MccDTI can provide a powerful tool to predict new DTIs and accelerate drug discovery.",
                "authors": [
                    {
                        "name": "Futamura Y."
                    },
                    {
                        "name": "Sakurai T."
                    },
                    {
                        "name": "Shang Y."
                    },
                    {
                        "name": "Ye X."
                    },
                    {
                        "name": "Yu L."
                    }
                ],
                "citationCount": 7,
                "date": "2022-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Multiview network embedding for drug-target Interactions prediction by consistent and complementary information preserving"
            },
            "pmid": "35262678"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
