{
    "additionDate": "2020-01-09T18:29:03Z",
    "biotoolsCURIE": "biotools:tools-taggi",
    "biotoolsID": "tools-taggi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "travisg@uga.edu",
            "name": "Travis C. Glenn",
            "typeEntity": "Person"
        }
    ],
    "description": "universal amplicon sequencing on Illumina platforms (TaggiMatrix).\n\nThis is a very simple way to create locus-specific fusion primers that can be used in conjunction with iTru primers of Glenn et al. 2016 [https://www.biorxiv.org/content/early/2016/06/15/049114] to create dual or quadruple indexed amplicons ready for sequencing on Illumina instruments.\n\nYou need to have Google Chrome or Safari browser only.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://baddna.uga.edu/tools-taggi.html",
    "lastUpdate": "2020-12-28T16:36:20Z",
    "name": "tools-taggi",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7786",
            "metadata": {
                "abstract": "Copyright 2019 Glenn et al.Next-generation sequencing (NGS) of amplicons is used in a wide variety of contexts. In many cases, NGS amplicon sequencing remains overly expensive and inflexible, with library preparation strategies relying upon the fusion of locus-specific primers to full-length adapter sequences with a single identifying sequence or ligating adapters onto PCR products. In Adapterama I, we presented universal stubs and primers to produce thousands of unique index combinations and a modifiable system for incorporating them into Illumina libraries. Here, we describe multiple ways to use the Adapterama system and other approaches for amplicon sequencing on Illumina instruments. In the variant we use most frequently for large-scale projects, we fuse partial adapter sequences (TruSeq or Nextera) onto the 50 end of locus-specific PCR primers with variable-length tag sequences between the adapter and locus-specific sequences. These fusion primers can be used combinatorially to amplify samples within a 96-well plate (8 forward primers + 12 reverse primers yield 8×12 = 96 combinations), and the resulting amplicons can be pooled. The initial PCR products then serve as template for a second round of PCR with dual-indexed iTru or iNext primers (also used combinatorially) to make full-length libraries. The resulting quadruple-indexed amplicons have diversity at most base positions and can be pooled with any standard Illumina library for sequencing. The number of sequencing reads from the amplicon pools can be adjusted, facilitating deep sequencing when required or reducing sequencing costs per sample to an economically trivial amount when deep coverage is not needed. We demonstrate the utility and versatility of our approaches with results from six projects using different implementations of our protocols. Thus, we show that these methods facilitate amplicon library construction for Illumina instruments at reduced cost with increased flexibility. A simple web page to design fusion primers compatible with iTru primers is available at: http://baddna.uga.edu/tools-taggi.html. A fast and easy to use program to demultiplex amplicon pools with internal indexes is available at: https://github.com/lefeverde/Mr_Demuxy.",
                "authors": [
                    {
                        "name": "Glenn T.C."
                    },
                    {
                        "name": "Pierson T.W."
                    },
                    {
                        "name": "Bayona-Vasquez N.J."
                    },
                    {
                        "name": "Kieran T.J."
                    },
                    {
                        "name": "Hoffberg S.L."
                    },
                    {
                        "name": "Thomas J.C."
                    },
                    {
                        "name": "Lefever D.E."
                    },
                    {
                        "name": "Finger J.W."
                    },
                    {
                        "name": "Gao B."
                    },
                    {
                        "name": "Bian X."
                    },
                    {
                        "name": "Louha S."
                    },
                    {
                        "name": "Kolli R.T."
                    },
                    {
                        "name": "Bentley K.E."
                    },
                    {
                        "name": "Rushmore J."
                    },
                    {
                        "name": "Wong K."
                    },
                    {
                        "name": "Shaw T.I."
                    },
                    {
                        "name": "Rothrock M.J."
                    },
                    {
                        "name": "McKee A.M."
                    },
                    {
                        "name": "Guo T.L."
                    },
                    {
                        "name": "Mauricio R."
                    },
                    {
                        "name": "Molina M."
                    },
                    {
                        "name": "Cummings B.S."
                    },
                    {
                        "name": "Lash L.H."
                    },
                    {
                        "name": "Lu K."
                    },
                    {
                        "name": "Gilbert G.S."
                    },
                    {
                        "name": "Hubbell S.P."
                    },
                    {
                        "name": "Faircloth B.C."
                    }
                ],
                "citationCount": 9,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "Adapterama II: Universal amplicon sequencing on Illumina platforms (TaggiMatrix)"
            },
            "pmcid": "PMC6791344",
            "pmid": "31616589"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ],
    "validated": 1
}