{
    "additionDate": "2017-08-03T18:46:33Z",
    "biotoolsCURIE": "biotools:hobbes",
    "biotoolsID": "hobbes",
    "credit": [
        {
            "name": "Information Systems Group",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://hobbes.ics.uci.edu/people.shtml"
        }
    ],
    "description": "Software package for efficiently mapping DNA snippets (reads) against a reference DNA sequence. It can map short and long reads, and supports Hamming distance (only substitutions) and edit distance (substitutions/insertions/deletions). It accepts both single-end and paired-end reads for alignment, and can run on multiple CPU cores using multithreading.",
    "documentation": [
        {
            "type": "General",
            "url": "http://hobbes.ics.uci.edu/index.shtml"
        },
        {
            "type": "User manual",
            "url": "http://hobbes.ics.uci.edu/manual.shtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                }
            ]
        }
    ],
    "homepage": "http://hobbes.ics.uci.edu",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/hobbes-1-3-genome-sequence-mapping.html"
        }
    ],
    "name": "Hobbes",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Next-generation sequencing (NGS) enables rapid production of billions of bases at a relatively low cost. Mapping reads from next-generation sequencers to a given reference genome is an important first step in many sequencing applications. Popular read mappers, such as Bowtie and BWA, are optimized to return top one or a few candidate locations of each read. However, identifying all mapping locations of each read, instead of just one or a few, is also important in some sequencing applications such as ChIP-seq for discovering binding sites in repeat regions, and RNA-seq for transcript abundance estimation. Results: Here we present Hobbes2, a software package designed for fast and accurate alignment of NGS reads and specialized in identifying all mapping locations of each read. Hobbes2 efficiently identifies all mapping locations of reads using a novel technique that utilizes additional prefix q-grams to improve filtering. We extensively compare Hobbes2 with state-of-the-art read mappers, and show that Hobbes2 can be an order of magnitude faster than other read mappers while consuming less memory space and achieving similar accuracy. Conclusions: We propose Hobbes2 to improve the accuracy of read mapping, specialized in identifying all mapping locations of each read. Hobbes2 is implemented in C++, and the source code is freely available for download at http://hobbes.ics.uci.edu. © 2014 Kim et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Xie X."
                    }
                ],
                "citationCount": 10,
                "date": "2014-02-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Improving read mapping using additional prefix grams"
            },
            "pmid": "24499321"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}