
{
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "yohell@ifm.liu.se",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    }
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Medium-Chain Dehydrogenase/Reductase Engineering Database (MDRED, http://www.mdred.uni-stuttgart.de) has been established to serve as an analysis tool for a systematic investigation of sequence-structure-function relationships. It includes sequence and structure information of 2684 and 42 medium-chain dehydrogenases/reductases (MDRs), respectively. Although MDRs are very diverse in sequence, they have a conserved tertiary structure. MDRs are assigned to 199 homologous families and 29 superfamilies. For each family, annotated multiple sequence alignments are provided, and functionally relevant residues are annotated. Twenty-five superfamilies were classified as zinc-containing MDRs, four as non-zinc-containing MDRs. For the zinc-containing MDRs, three subclasses were identified by systematic analysis of a variable loop region, the quaternary structure determining loop (QSDL): the class of short, medium, and long QSDL, which include 11, 3, and 5 superfamilies, respectively. The length of the QSDL is predictive for tetramer (short QSDL) and dimer (long QSDL) formation. The class of medium QSDL includes both tetrameric and dimeric MDRs. The shape of the substrate-binding site is highly conserved in all zinc-containing MDRs with the exception of two variable regions, the substrate recognition sites (SRS): two residues located on the QSDL (SRS1) and, for the class of long QSDL, one residue located in the catalytic domain (SRS2). The MDRED is the first online-accessible resource of MDRs that integrates information on sequence, structure, and function. Annotation of functionally relevant residues assist the understanding of sequence-structure-function relationships. Thus, the MDRED serves as a valuable tool to identify potential hotspots for engineering properties such as substrate specificity. Copyright © 2008 The Protein Society.",
            "authors": [
                "Knoll M.",
                "Pleiss J."
            ],
            "cit_count": 17,
            "doi": "10.1110/ps.035428.108",
            "journal": "Protein Science",
            "title": "The Medium-Chain Dehydrogenase/Reductase Engineering Database: A systematic analysis of a diverse protein family to understand sequence-structure-function relationship",
            "type": "Primary",
            "year": "2008-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mdr",
        "biotoolsID": "mdr",
        "description": "Medium-chain dehydrogenases/reductases database.",
        "homepage": "http://www.bioinfo.ifm.liu.se/services/mdr/",
        "name": "MDR database"
    }
}