{
    "accessibility": "Open access",
    "additionDate": "2022-07-06T15:18:18.938409Z",
    "biotoolsCURIE": "biotools:mssort-dia-xmbd",
    "biotoolsID": "mssort-dia-xmbd",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jiahuai Han"
        },
        {
            "name": "Jianwei Shuai"
        },
        {
            "name": "Xiang Li"
        },
        {
            "name": "Yulin Li"
        }
    ],
    "description": "A deep learning classification tool of the peptide precursors quantified by OpenSWATH.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jianweishuai/MSSort-DIA-XMBD",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2022-07-06T15:18:18.941836Z",
    "license": "GPL-3.0",
    "name": "MSSort-DIA-XMBD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2022.104542",
            "metadata": {
                "abstract": "© 2022OpenSWATH is an analysis toolkit commonly used for data independent acquisition (DIA). Although the output of OpenSWATH is controlled at 1% false discovery rate (FDR), the output report still contains many peptide precursors with low similarity fragments. At the last step of OpenSWATH for peptide quantification, researchers usually need to manually check the similarity of the extracted ion chromatograms (XICs) of fragments to distinguish the high confidence and the low confidence peptide precursors. Here we developed an algorithm with a Graphic User Interface named MSSort-DIAXMBD, which combines the deep convolutional neural network (CNN) and the double-threshold segmentation process, to automatically recognize the high confidence precursors and low confidence precursors. To train the model of MSSort-DIAXMBD, we built a database contained about 50,000 manually classified peptide precursors acquired from different instrument platforms and different species. With the double-threshold segmentation strategy, MSSort-DIAXMBD can reduce the number of the low confidence peptides required for manual inspections to less than 10% and be used as the last step of OpenSWATH to visualize and classify the MS/MS data of peptide precursors. Significance: Although the output of OpenSWATH is controlled at 1% false discovery rate (FDR), the output report still contains many peptide precursors with low similarity fragments. At the last step of OpenSWATH for peptide quantification, researchers usually need to manually check the similarity of fragment XICs to distinguish the high confidence and the low confidence peptide precursors. However, manual inspection is inefficient. For instance, it takes about 50 h to sort even a small dataset of 1000 MS/MS spectra manually. In this paper we developed a software named MSSort-DIAXMBD to automatically recognize the high confidence precursors. We manually classify 50,000 peptide precursors as training set to train a convolutional neural network. After training finished, MSSort-DIAXMBD takes only a few minutes to automatically classify 20,000 peptide precursors, leaving a small portion of fuzzy ones for manual inspection. On the benchmarked dataset, MSSort-DIAXMBD can significantly improve the efficiency and accuracy of recognition of high confidence peptide precursors.",
                "authors": [
                    {
                        "name": "Guo H."
                    },
                    {
                        "name": "Han J."
                    },
                    {
                        "name": "He Q."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Shuai J."
                    },
                    {
                        "name": "Zhong C.-Q."
                    }
                ],
                "date": "2022-05-15T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "MSSort-DIAXMBD: A deep learning classification tool of the peptide precursors quantified by OpenSWATH"
            },
            "pmid": "35231660"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
