{
    "accessibility": "Restricted access",
    "additionDate": "2025-03-17T14:01:59.601345Z",
    "biotoolsCURIE": "biotools:exposome_maps",
    "biotoolsID": "exposome_maps",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "R.C.H.Vermeulen@uu.nl",
            "name": "Roel Vermeulen",
            "orcidid": "https://orcid.org/0000-0003-4082-8163",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "z.s.r.m.boudewijns@uu.nl",
            "name": "Zimbo Boudewijns",
            "orcidid": "https://orcid.org/0000-0002-9383-9571",
            "typeRole": [
                "Maintainer"
            ]
        },
        {
            "email": "l.q.roga@uu.nl",
            "name": "Lloyd Roga",
            "typeRole": [
                "Developer"
            ]
        }
    ],
    "description": "The Exposome Maps contain geospatially resolved data on environmental exposures (Exposome Surfaces), categorized into the following Exposome dimensions:\nBuilt Environment28 exposures related to:\n•\tGreen space\n•\tBlue space\n•\tGrey space\nFood Environment4 exposures related to:\n•\tFood landscape / healthy food index\nPhysico-Chemical Environment99 exposures related to:\n•\tAir pollution\n•\tBiodiversity\n•\tWeather conditions\n•\tLight intensity at night\n•\tNoise\n•\tPesticides\n•\tElectromagnetic fields\nSocial Environment70 exposures related to:\n•\tNeighbourhood socio-economic position\n•\tNeighbourhood Demographic surfaces and population characteristics\n•\tSocial capital\n•\tSecurity\n•\tMental health\n•\tProximity to facilities\n•\tEnergy use\n•\tLabour market",
    "documentation": [
        {
            "note": "Description of Environmental variables available through Exposome Maps",
            "type": [
                "User manual"
            ],
            "url": "https://surfdrive.surf.nl/files/index.php/s/uqUORDrd428H2F9"
        },
        {
            "note": "Exposome-NL data platform Data Access and Publication Policy",
            "type": [
                "Terms of use"
            ],
            "url": "https://surfdrive.surf.nl/files/index.php/s/fI0Gmuu5O1MJAI9"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://exposome.dataplatform.nl/#/home",
    "lastUpdate": "2025-03-19T14:50:02.027296Z",
    "license": "Other",
    "link": [
        {
            "note": "Project information page",
            "type": [
                "Other"
            ],
            "url": "https://expanseproject.eu/"
        }
    ],
    "maturity": "Mature",
    "name": "EXPOSOME maps",
    "owner": "Channel2291",
    "publication": [
        {
            "doi": "10.1097/EE9.0000000000000162",
            "metadata": {
                "abstract": "By 2030, more than 80% of Europe's population will live in an urban environment. The urban exposome, consisting of factors such as where we live and work, where and what we eat, our social network, and what chemical and physical hazards we are exposed to, provides important targets to improve population health. The EXPANSE (EXposome Powered tools for healthy living in urbAN SEttings) project will study the impact of the urban exposome on the major contributors to Europe's burden of disease: Cardio-Metabolic and Pulmonary Disease. EXPANSE will address one of the most pertinent questions for urban planners, policy makers, and European citizens: \"How to maximize one's health in a modern urban environment?\" EXPANSE will take the next step in exposome research by (1) bringing together exposome and health data of more than 55 million adult Europeans and OMICS information for more than 2 million Europeans; (2) perform personalized exposome assessment for 5,000 individuals in five urban regions; (3) applying ultra-high-resolution mass-spectrometry to screen for chemicals in 10,000 blood samples; (4) evaluating the evolution of the exposome and health through the life course; and (5) evaluating the impact of changes in the urban exposome on the burden of cardiometabolic and pulmonary disease. EXPANSE will translate its insights and innovations into research and dissemination tools that will be openly accessible via the EXPANSE toolbox. By applying innovative ethics-by-design throughout the project, the social and ethical acceptability of these tools will be safeguarded. EXPANSE is part of the European Human Exposome Network.",
                "authors": [
                    {
                        "name": "Chadeau-Hyam M."
                    },
                    {
                        "name": "De Hoogh K."
                    },
                    {
                        "name": "De Wit G.A."
                    },
                    {
                        "name": "Esko T."
                    },
                    {
                        "name": "Hoek G."
                    },
                    {
                        "name": "Jongsma K.R."
                    },
                    {
                        "name": "Katsouyanni K."
                    },
                    {
                        "name": "Melen E."
                    },
                    {
                        "name": "Peters A."
                    },
                    {
                        "name": "Probst-Hensch N."
                    },
                    {
                        "name": "Scalbert A."
                    },
                    {
                        "name": "Tonne C."
                    },
                    {
                        "name": "Vermeulen R."
                    },
                    {
                        "name": "Vlaanderen J."
                    }
                ],
                "citationCount": 36,
                "date": "2021-08-01T00:00:00Z",
                "journal": "Environmental Epidemiology",
                "title": "Developing the building blocks to elucidate the impact of the urban exposome on cardiometabolic-pulmonary disease: The EU EXPANSE project"
            }
        },
        {
            "doi": "10.1126/science.aay3164",
            "metadata": {
                "abstract": "Despite extensive evidence showing that exposure to specific chemicals can lead to disease, current research approaches and regulatory policies fail to address the chemical complexity of our world. To safeguard current and future generations from the increasing number of chemicals polluting our environment, a systematic and agnostic approach is needed. The “exposome” concept strives to capture the diversity and range of exposures to synthetic chemicals, dietary constituents, psychosocial stressors, and physical factors, as well as their corresponding biological responses. Technological advances such as high-resolution mass spectrometry and network science have allowed us to take the first steps toward a comprehensive assessment of the exposome. Given the increased recognition of the dominant role that nongenetic factors play in disease, an effort to characterize the exposome at a scale comparable to that of the human genome is warranted.",
                "authors": [
                    {
                        "name": "Barabasi A.-L."
                    },
                    {
                        "name": "Miller G.W."
                    },
                    {
                        "name": "Schymanski E.L."
                    },
                    {
                        "name": "Vermeulen R."
                    }
                ],
                "citationCount": 587,
                "date": "2020-01-24T00:00:00Z",
                "journal": "Science",
                "title": "The exposome and health: Where chemistry meets biology"
            }
        }
    ],
    "topic": [
        {
            "term": "Environmental sciences",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "FAIR data",
            "uri": "http://edamontology.org/topic_4012"
        }
    ]
}
