
{
    "credit": [
        {
            "email": "AlignMe@rzg.mpg.de",
            "name": "AlignMe Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.bioinfo.mpg.de/AlignMe"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Membrane and lipoproteins",
                "uri": "http://edamontology.org/topic_0820"
            },
            {
                "term": "Protein folds and structural domains",
                "uri": "http://edamontology.org/topic_0736"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            }
        ]
    },
    "publication": [
        {
            "pmcid": "PMC4086118"
        },
        {
            "pmcid": "PMC3587630"
        },
        {
            "abstract": "X-ray crystal structures have revealed that numerous secondary transporter proteins originally categorized into different sequence families share similar structures, namely, the LeuT fold. The core of this fold consists of two units of five transmembrane helices, whose conformations have been proposed to exchange to form the two alternate states required for transport. That these two units are related implies that LeuT-like transporters evolved from gene-duplication and fusion events. Thus, the origins of this structural repeat may be relevant to the evolution of transport function. However, the lack of significant sequence similarity requires sensitive sequence search methods for analyzing their evolution. To this end, we developed a software application called AlignMe, which can use various types of input information, such as residue hydrophobicity, to perform pairwise alignments of sequences and/or of hydropathy profiles of (membrane) proteins. We used AlignMe to analyze the evolutionary relationships between repeats of the LeuT fold. In addition, we identified proteins from the so-called DedA family that potentially share a common ancestor with these repeats. DedA domains have been implicated in, e.g., selenite uptake; they are found widely distributed across all kingdoms of life; two or more DedA domains are typically found per genome, and some may adopt dual topologies. These results suggest that DedA proteins existed in ancient organisms and may function as dimers, as required for a would-be ancestor of the LeuT fold. In conclusion, we provide novel insights into the evolution of this important structural motif and thus potentially into the alternating-access mechanism of transport itself. © 2010 American Chemical Society.",
            "authors": [
                "Khafizov K.",
                "Staritzbichler R.",
                "Stamm M.",
                "Forrest L.R."
            ],
            "cit_count": 66,
            "journal": "Biochemistry",
            "pmid": "21073167",
            "title": "A study of the evolution of inverted-topology repeats from LeuT-fold transporters using alignMe",
            "year": "2010-12-21"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:alignme",
        "biotoolsID": "alignme",
        "description": "AlignMe (for Alignment of Membrane Proteins) can be used to examine detailed similarity between homologous proteins even if there is no notable sequence similarity. The predefined gap/weight sets have been optimized for membrane proteins, and so should be particularly useful for these difficult cases.",
        "homepage": "http://www.bioinfo.mpg.de/AlignMe",
        "name": "AlignMe"
    }
}