{
    "additionDate": "2017-05-16T12:28:32Z",
    "biotoolsCURIE": "biotools:alignme",
    "biotoolsID": "alignme",
    "credit": [
        {
            "email": "AlignMe@rzg.mpg.de",
            "name": "AlignMe Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "AlignMe (for Alignment of Membrane Proteins) can be used to examine detailed similarity between homologous proteins even if there is no notable sequence similarity. The predefined gap/weight sets have been optimized for membrane proteins, and so should be particularly useful for these difficult cases.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.bioinfo.mpg.de/AlignMe"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinfo.mpg.de/AlignMe",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T20:58:15.036879Z",
    "name": "AlignMe",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gku291",
            "metadata": {
                "abstract": "We present a web server for pair-wise alignment of membrane protein sequences, using the program AlignMe. The server makes available two operational modes of AlignMe: (i) sequence to sequence alignment, taking two sequences in fasta format as input, combining information about each sequence from multiple sources and producing a pair-wise alignment (PW mode); and (ii) alignment of two multiple sequence alignments to create family-averaged hydropathy profile alignments (HP mode). For the PW sequence alignment mode, four different optimized parameter sets are provided, each suited to pairs of sequences with a specific similarity level. These settings utilize different types of inputs: (position-specific) substitution matrices, secondary structure predictions and transmembrane propensities from transmembrane predictions or hydrophobicity scales. In the second (HP) mode, each input multiple sequence alignment is converted into a hydrophobicity profile averaged over the provided set of sequence homologs; the two profiles are then aligned. The HP mode enables qualitative comparison of transmembrane topologies (and therefore potentially of 3D folds) of two membrane proteins, which can be useful if the proteins have low sequence similarity. In summary, the AlignMe web server provides user-friendly access to a set of tools for analysis and comparison of membrane protein sequences. Access is available at http://www.bioinfo.mpg.de/AlignMe © 2014 Published by Oxford University Press on behalf of Nucleic Acids Research 2014. This work is written by (a) US Government employee(s) and is in the public domain in the US.",
                "authors": [
                    {
                        "name": "Forrest L.R."
                    },
                    {
                        "name": "Khafizov K."
                    },
                    {
                        "name": "Stamm M."
                    },
                    {
                        "name": "Staritzbichler R."
                    }
                ],
                "citationCount": 69,
                "date": "2014-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AlignMe - A membrane protein sequence alignment web server"
            },
            "pmcid": "PMC4086118",
            "pmid": "24753425"
        },
        {
            "doi": "10.1371/journal.pone.0057731",
            "metadata": {
                "abstract": "Few sequence alignment methods have been designed specifically for integral membrane proteins, even though these important proteins have distinct evolutionary and structural properties that might affect their alignments. Existing approaches typically consider membrane-related information either by using membrane-specific substitution matrices or by assigning distinct penalties for gap creation in transmembrane and non-transmembrane regions. Here, we ask whether favoring matching of predicted transmembrane segments within a standard dynamic programming algorithm can improve the accuracy of pairwise membrane protein sequence alignments. We tested various strategies using a specifically designed program called AlignMe. An updated set of homologous membrane protein structures, called HOMEP2, was used as a reference for optimizing the gap penalties. The best of the membrane-protein optimized approaches were then tested on an independent reference set of membrane protein sequence alignments from the BAliBASE collection. When secondary structure (S) matching was combined with evolutionary information (using a position-specific substitution matrix (P)), in an approach we called AlignMePS, the resultant pairwise alignments were typically among the most accurate over a broad range of sequence similarities when compared to available methods. Matching transmembrane predictions (T), in addition to evolutionary information, and secondary-structure predictions, in an approach called AlignMePST, generally reduces the accuracy of the alignments of closely-related proteins in the BAliBASE set relative to AlignMePS, but may be useful in cases of extremely distantly related proteins for which sequence information is less informative. The open source AlignMe code is available at https://sourceforge.net/projects/alignme/, and at http://www.forrestlab.org, along with an online server and the HOMEP2 data set. © 2013 Stamm et al.",
                "authors": [
                    {
                        "name": "Forrest L.R."
                    },
                    {
                        "name": "Khafizov K."
                    },
                    {
                        "name": "Stamm M."
                    },
                    {
                        "name": "Staritzbichler R."
                    }
                ],
                "citationCount": 51,
                "date": "2013-03-04T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Alignment of Helical Membrane Protein Sequences Using AlignMe"
            },
            "pmcid": "PMC3587630",
            "pmid": "23469223"
        },
        {
            "doi": "10.1021/bi101256x",
            "metadata": {
                "abstract": "X-ray crystal structures have revealed that numerous secondary transporter proteins originally categorized into different sequence families share similar structures, namely, the LeuT fold. The core of this fold consists of two units of five transmembrane helices, whose conformations have been proposed to exchange to form the two alternate states required for transport. That these two units are related implies that LeuT-like transporters evolved from gene-duplication and fusion events. Thus, the origins of this structural repeat may be relevant to the evolution of transport function. However, the lack of significant sequence similarity requires sensitive sequence search methods for analyzing their evolution. To this end, we developed a software application called AlignMe, which can use various types of input information, such as residue hydrophobicity, to perform pairwise alignments of sequences and/or of hydropathy profiles of (membrane) proteins. We used AlignMe to analyze the evolutionary relationships between repeats of the LeuT fold. In addition, we identified proteins from the so-called DedA family that potentially share a common ancestor with these repeats. DedA domains have been implicated in, e.g., selenite uptake; they are found widely distributed across all kingdoms of life; two or more DedA domains are typically found per genome, and some may adopt dual topologies. These results suggest that DedA proteins existed in ancient organisms and may function as dimers, as required for a would-be ancestor of the LeuT fold. In conclusion, we provide novel insights into the evolution of this important structural motif and thus potentially into the alternating-access mechanism of transport itself. © 2010 American Chemical Society.",
                "authors": [
                    {
                        "name": "Forrest L.R."
                    },
                    {
                        "name": "Khafizov K."
                    },
                    {
                        "name": "Stamm M."
                    },
                    {
                        "name": "Staritzbichler R."
                    }
                ],
                "citationCount": 83,
                "date": "2010-12-21T00:00:00Z",
                "journal": "Biochemistry",
                "title": "A study of the evolution of inverted-topology repeats from LeuT-fold transporters using alignMe"
            },
            "pmid": "21073167"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
