{
    "additionDate": "2018-07-16T17:03:21Z",
    "biotoolsCURIE": "biotools:longo",
    "biotoolsID": "longo",
    "credit": [
        {
            "email": "ted.ahn@slu.edu",
            "name": "Tae-Hyuk Ahn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Gene Length-Dependent Expression Analysis Tool in Neuronal Cells.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/biohpc/longo"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biohpc/longo",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "LONGO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty243",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved.Motivation: Reprogramming somatic cells into neurons holds great promise to model neuronal development and disease. The efficiency and success rate of neuronal reprogramming, however, may vary between different conversion platforms and cell types, thereby necessitating an unbiased, systematic approach to estimate neuronal identity of converted cells. Recent studies have demonstrated that long genes (>100 kb from transcription start to end) are highly enriched in neurons, which provides an opportunity to identify neurons based on the expression of these long genes. Results: We have developed a versatile R package, LONGO, to analyze gene expression based on gene length. We propose a systematic analysis of long gene expression (LGE) with a metric termed the long gene quotient (LQ) that quantifies LGE in RNA-seq or microarray data to validate neuronal identity at the single-cell and population levels. This unique feature of neurons provides an opportunity to utilize measurements of LGE in transcriptome data to quickly and easily distinguish neurons from non-neuronal cells. By combining this conceptual advancement and statistical tool in a user-friendly and interactive software package, we intend to encourage and simplify further investigation into LGE, particularly as it applies to validating and improving neuronal differentiation and reprogramming methodologies.",
                "authors": [
                    {
                        "name": "Ahn T.-H."
                    },
                    {
                        "name": "Gabel H.W."
                    },
                    {
                        "name": "Gong H."
                    },
                    {
                        "name": "McCoy M.J."
                    },
                    {
                        "name": "Paul A.J."
                    },
                    {
                        "name": "Richner M."
                    },
                    {
                        "name": "Victor M.B."
                    },
                    {
                        "name": "Yoo A.S."
                    }
                ],
                "citationCount": 4,
                "date": "2018-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LONGO: An R package for interactive gene length dependent analysis for neuronal identity"
            },
            "pmcid": "PMC6022641",
            "pmid": "29950021"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
