{
    "additionDate": "2017-08-03T18:50:12Z",
    "biotoolsCURIE": "biotools:mspc",
    "biotoolsID": "mspc",
    "credit": [
        {
            "email": "vahid.jalili@polimi.it",
            "name": "Vahid Jalili",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genomic_computing/MSPC/index.html"
        }
    ],
    "description": "Given a set of peaks from (biological or technical) replicates, this tool combines the p-values of overlapping enriched regions: users can choose a threshold on the combined significance of overlapping peaks and set a minimum number of replicates where the overlapping peaks should be present.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/genomic_computing/MSPC/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.deib.polimi.it/genomic_computing/MSPC/",
    "language": [
        "C#"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mspc-using-combined-evidence-from-replicates-to-evaluate-chip-seq-peaks.html"
        }
    ],
    "name": "MSPC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2015. Published by Oxford University Press.Motivation: Chromatin Immunoprecipitation followed by sequencing (ChIP-seq) detects genome-wide DNA-protein interactions and chromatin modifications, returning enriched regions (ERs), usually associated with a significance score. Moderately significant interactions can correspond to true, weak interactions, or to false positives; replicates of a ChIP-seq experiment can provide co-localised evidence to decide between the two cases. We designed a general methodological framework to rigorously combine the evidence of ERs in ChIP-seq replicates, with the option to set a significance threshold on the repeated evidence and a minimum number of samples bearing this evidence. Results: We applied our method to Myc transcription factor ChIP-seq datasets in K562 cells available in the ENCODE project. Using replicates, we could extend up to 3 times the ER number with respect to single-sample analysis with equivalent significance threshold. We validated the 'rescued' ERs by checking for the overlap with open chromatin regions and for the enrichment of the motif that Myc binds with strongest affinity; we compared our results with alternative methods (IDR and jMOSAiCS), obtaining more validated peaks than the former and less peaks than latter, but with a better validation.",
                "authors": [
                    {
                        "name": "Jalili V."
                    },
                    {
                        "name": "Masseroli M."
                    },
                    {
                        "name": "Matteucci M."
                    },
                    {
                        "name": "Morelli M.J."
                    }
                ],
                "citationCount": 20,
                "date": "2015-02-06T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Using combined evidence from replicates to evaluate ChIP-seq peaks"
            },
            "pmid": "25957351"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
