
{
    "credit": [
        {
            "email": "mmtsbtoolset@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mmtsb.org/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/mmtsb/toolset"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Structural biology",
                "uri": "http://edamontology.org/topic_1317"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mmtsb-toolset-multiscale-modeling-tools-structural-biology.html"
        }
    ],
    "publication": [
        {
            "abstract": "We describe the Multiscale Modeling Tools for Structural Biology (MMTSB) Tool Set (http://mmtsb.scripps.edu/software/mmtsbToolSet.html), which is a novel set of utilities and programming libraries that provide new enhanced sampling and multiscale modeling techniques for the simulation of proteins and nucleic acids. The tool set interfaces with the existing molecular modeling packages CHARMM and Amber for classical all-atom simulations, and with MONSSTER for lattice-based low-resolution conformational sampling. In addition, it adds new functionality for the integration and translation between both levels of detail. The replica exchange method is implemented to allow enhanced sampling of both the all-atom and low-resolution models. The tool set aims at applications in structural biology that involve protein or nucleic acid structure prediction, refinement, and/or extended conformational sampling. With structure prediction applications in mind, the tool set also implements a facility that allows the control and application of modeling tasks on a large set of conformations in what we have termed ensemble computing. Ensemble computing encompasses loosely coupled, parallel computation on high-end parallel computers, clustered computational grids and desktop grid environments. This paper describes the design and implementation of the MMTSB Tool Set and illustrates its utility with three typical examples - scoring of a set of predicted protein conformations in order to identify the most native-like structures, ab initio folding of peptides in implicit solvent with the replica exchange method, and the prediction of a missing fragment in a larger protein structure. © 2004 Elsevier Inc. All rights reserved.",
            "authors": [
                "Feig M.",
                "Karanicolas J.",
                "Brooks III C.L."
            ],
            "cit_count": 596,
            "journal": "Journal of Molecular Graphics and Modelling",
            "pmid": "15099834",
            "title": "MMTSB Tool Set: Enhanced sampling and multiscale modeling methods for applications in structural biology",
            "year": "2004-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mmtsb_toolset",
        "biotoolsID": "mmtsb_toolset",
        "description": "Can be used for replica exchange calculations with sander. This package also facilitates other Amber tasks, such as dealing in a consistent way with an ensemble of conformations, massaging PDB files, and carrying out some common types of structural analysis.",
        "homepage": "http://blue11.bch.msu.edu/mmtsb/Main_Page",
        "name": "MMTSB toolset"
    }
}