{
    "additionDate": "2022-10-10T11:13:18.555078Z",
    "biotoolsCURIE": "biotools:prrdb2",
    "biotoolsID": "prrdb2",
    "credit": [
        {
            "name": "DR. Gajendra P. S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/prrdb2/index.html"
        }
    ],
    "description": "PRRDB2.0 is a comprehensive database of pattern recognition receptors and their ligands. This is an updated version of the database PRRDB.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/prrdb2/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/prrdb2/index.html",
    "lastUpdate": "2022-10-10T11:13:23.623466Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/prrdb2/index.html"
        }
    ],
    "name": "prrdb2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1093/database/baz076",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.PRRDB 2.0 is an updated version of PRRDB that maintains comprehensive information about pattern-recognition receptors (PRRs) and their ligands. The current version of the database has ~2700 entries, which are nearly five times of the previous version. It contains extensive information about 467 unique PRRs and 827 pathogens-associated molecular patterns (PAMPs), manually extracted from ~600 research articles. It possesses information about PRRs and PAMPs that has been extracted manually from research articles and public databases. Each entry provides comprehensive details about PRRs and PAMPs that includes their name, sequence, origin, source, type, etc. We have provided internal and external links to various databases/resources (like Swiss-Prot, PubChem) to obtain further information about PRRs and their ligands. This database also provides links to ~4500 experimentally determined structures in the protein data bank of various PRRs and their complexes. In addition, 110 PRRs with unknown structures have also been predicted, which are important in order to understand the structure-function relationship between receptors and their ligands. Numerous web-based tools have been integrated into PRRDB 2.0 to facilitate users to perform different tasks like (i) extensive searching of the database; (ii) browsing or categorization of data based on receptors, ligands, source, etc. and (iii) similarity search using BLAST and Smith-Waterman algorithm.",
                "authors": [
                    {
                        "name": "Kaur D."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma N."
                    },
                    {
                        "name": "Usmani S.S."
                    }
                ],
                "citationCount": 19,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "PRRDB 2.0: A comprehensive database of pattern-recognition receptors and their ligands"
            },
            "pmcid": "PMC6597477",
            "pmid": "31250014"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
