
{
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.jci-bioinfo.cn/pSumo/pSumo_readme.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein sites, features and motifs",
                "uri": "http://edamontology.org/topic_3510"
            },
            {
                "term": "Protein structure analysis",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2016.Motivation: Sumoylation is a post-translational modification (PTM) process, in which small ubiquitin-related modifier (SUMO) is attaching by covalent bonds to substrate protein. It is critical to many different biological processes such as replicating genome, expressing gene, localizing and stabilizing proteins; unfortunately, it is also involved with many major disorders including Alzheimer's and Parkinson's diseases. Therefore, for both basic research and drug development, it is important to identify the sumoylation sites in proteins. Results: To address such a problem, we developed a predictor called pSumo-CD by incorporating the sequence-coupled information into the general pseudo-amino acid composition (PseAAC) and introducing the covariance discriminant (CD) algorithm, in which a bias-adjustment term, which has the function to automatically adjust the errors caused by the bias due to the imbalance of training data, had been incorporated. Rigorous cross-validations indicated that the new predictor remarkably outperformed the existing state-of-the-art prediction method for the same purpose.",
            "authors": [
                "Jia J.",
                "Zhang L.",
                "Liu Z.",
                "Xiao X.",
                "Chou K.-C."
            ],
            "cit_count": 92,
            "doi": "10.1093/BIOINFORMATICS/BTW387",
            "journal": "Bioinformatics",
            "pmid": "27354696",
            "title": "pSumo-CD: Predicting sumoylation sites in proteins with covariance discriminant algorithm by incorporating sequence-coupled effects into general PseAAC",
            "year": "2016-10-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:psumo-cd",
        "biotoolsID": "psumo-cd",
        "description": "Predicting sumoylation sites in proteins with covariance discriminant algorithm by incorporating sequence-coupled effects into general PseAAC.",
        "homepage": "http://www.jci-bioinfo.cn/pSumo-CD",
        "name": "pSumo-CD"
    }
}