{
    "accessibility": "Open access",
    "additionDate": "2022-01-23T22:47:54.214418Z",
    "biotoolsCURIE": "biotools:swimmer",
    "biotoolsID": "swimmer",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "paci@diag.uniroma1.it",
            "name": "Paola Paci",
            "orcidid": "https://orcid.org/0000-0002-9393-2047"
        },
        {
            "name": "Giulia Fiscon",
            "orcidid": "https://orcid.org/0000-0002-3354-8203"
        }
    ],
    "description": "An open-source version of its predecessor SWIM (SWitchMiner) that is a network-based tool for mining key (switch) genes that are associated with intriguing patterns of molecular co-abundance and may play a crucial role in phenotypic transitions in various biological settings.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/sportingCode/SWIMmeR/tree/main/UserGuide"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/sportingCode/SWIMmeR",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-01-23T22:47:54.216876Z",
    "license": "AGPL-3.0",
    "name": "SWIMmeR",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB657",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.We present SWIMmeR, an open-source version of its predecessor SWIM (SWitchMiner) that is a network-based tool for mining key (switch) genes that are associated with intriguing patterns of molecular coabundance and may play a crucial role in phenotypic transitions in various biological settings. SWIM was originally written in MATLABVR , a proprietary programming language that requires the purchase of a license to install, manipulate, operate and run the software. Over the last years, SWIM has sparked a widespread interest within the scientific community thanks to the promising results obtained through its application in a broad range of phenotype-specific scenarios, spanning from complex diseases to grapevine berry maturation. This success has created the call for it to be distributed in a freely accessible, open-source, runtime environment, such as R, aimed at a general audience of non-expert users that cannot afford the leading proprietary solution. SWIMmeR is provided as a comprehensive collection of R functions and it also includes several additional features that make it less intensive in terms of computer time and more efficient in terms of usability and further implementation and extension.",
                "authors": [
                    {
                        "name": "Paci P."
                    },
                    {
                        "name": "Fiscon G."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SWIMmeR: An R-based software to unveiling crucial nodes in complex biological networks"
            },
            "pmid": "34524429"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}