{
    "additionDate": "2021-01-18T11:44:49Z",
    "biotoolsCURIE": "biotools:markerdb",
    "biotoolsID": "markerdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "david.wishart@ualberta.ca",
            "name": "David S Wishart",
            "typeEntity": "Person"
        }
    ],
    "description": "An online database of molecular biomarkers.\n\nMarkerDB is a freely available electronic database that attempts to consolidate information on all known clinical and a selected set of pre-clinical biomarkers into a single resource.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "https://markerdb.ca",
    "lastUpdate": "2024-11-24T20:42:35.300970Z",
    "name": "MarkerDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa1067",
            "metadata": {
                "abstract": "MarkerDB is a freely available electronic database that attempts to consolidate information on all known clinical and a selected set of pre-clinical molecular biomarkers into a single resource. The database includes four major types of molecular biomarkers (chemical, protein, DNA [genetic] and karyotypic) and four biomarker categories (diagnostic, predictive, prognostic and exposure). MarkerDB provides information such as: biomarker names and synonyms, associated conditions or pathologies, detailed disease descriptions, detailed biomarker descriptions, biomarker specificity, sensitivity and ROC curves, standard reference values (for protein and chemical markers), variants (for SNP or genetic markers), sequence information (for genetic and protein markers), molecular structures (for protein and chemical markers), tissue or biofluid sources (for protein and chemical markers), chromosomal location and structure (for genetic and karyotype markers), clinical approval status and relevant literature references. Users can browse the data by conditions, condition categories, biomarker types, biomarker categories or search by sequence similarity through the advanced search function. Currently, the database contains 142 protein biomarkers, 1089 chemical biomarkers, 154 karyotype biomarkers and 26 374 genetic markers. These are categorized into 25 560 diagnostic biomarkers, 102 prognostic biomarkers, 265 exposure biomarkers and 6746 predictive biomarkers or biomarker panels. Collectively, these markers can be used to detect, monitor or predict 670 specific human conditions which are grouped into 27 broad condition categories. MarkerDB is available at https://markerdb.ca.",
                "authors": [
                    {
                        "name": "Bartok B."
                    },
                    {
                        "name": "Berjanskii M."
                    },
                    {
                        "name": "Budinski Z."
                    },
                    {
                        "name": "Cao X."
                    },
                    {
                        "name": "Guo A."
                    },
                    {
                        "name": "Liang K.Y.H."
                    },
                    {
                        "name": "Oler E."
                    },
                    {
                        "name": "Wilson M."
                    },
                    {
                        "name": "Wishart D.S."
                    }
                ],
                "citationCount": 74,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MarkerDB: An online database of molecular biomarkers"
            },
            "pmcid": "PMC7778954",
            "pmid": "33245771"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
