{
    "accessibility": "Open access",
    "additionDate": "2022-03-16T08:59:30.132170Z",
    "biotoolsCURIE": "biotools:afterqc",
    "biotoolsID": "afterqc",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jia.gu@siat.ac.cn",
            "name": "Jia Gu"
        },
        {
            "name": "Mingyan Xu"
        },
        {
            "name": "Shifu Chen"
        },
        {
            "name": "Tanxiao Huang"
        },
        {
            "name": "Yanqing Zhou"
        },
        {
            "name": "Yue Han"
        }
    ],
    "description": "Automatic Filtering, Trimming, Error Removing and Quality Control for fastq data\nAfterQC can simply go through all fastq files in a folder and then output three folders: good, bad and QC folders, which contains good reads, bad reads and the QC results of each fastq file/pair.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/OpenGene/AfterQC/releases/tag/v0.9.7"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OpenGene/AfterQC",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2022-03-16T08:59:30.153546Z",
    "license": "MIT",
    "name": "afterqc",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1469-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Some applications, especially those clinical applications requiring high accuracy of sequencing data, usually have to face the troubles caused by unavoidable sequencing errors. Several tools have been proposed to profile the sequencing quality, but few of them can quantify or correct the sequencing errors. This unmet requirement motivated us to develop AfterQC, a tool with functions to profile sequencing errors and correct most of them, plus highly automated quality control and data filtering features. Different from most tools, AfterQC analyses the overlapping of paired sequences for pair-end sequencing data. Based on overlapping analysis, AfterQC can detect and cut adapters, and furthermore it gives a novel function to correct wrong bases in the overlapping regions. Another new feature is to detect and visualise sequencing bubbles, which can be commonly found on the flowcell lanes and may raise sequencing errors. Besides normal per cycle quality and base content plotting, AfterQC also provides features like polyX (a long sub-sequence of a same base X) filtering, automatic trimming and K-MER based strand bias profiling. Results: For each single or pair of FastQ files, AfterQC filters out bad reads, detects and eliminates sequencer's bubble effects, trims reads at front and tail, detects the sequencing errors and corrects part of them, and finally outputs clean data and generates HTML reports with interactive figures. AfterQC can run in batch mode with multiprocess support, it can run with a single FastQ file, a single pair of FastQ files (for pair-end sequencing), or a folder for all included FastQ files to be processed automatically. Based on overlapping analysis, AfterQC can estimate the sequencing error rate and profile the error transform distribution. The results of our error profiling tests show that the error distribution is highly platform dependent. Conclusion: Much more than just another new quality control (QC) tool, AfterQC is able to perform quality control, data filtering, error profiling and base correction automatically. Experimental results show that AfterQC can help to eliminate the sequencing errors for pair-end sequencing data to provide much cleaner outputs, and consequently help to reduce the false-positive variants, especially for the low-frequency somatic mutations. While providing rich configurable options, AfterQC can detect and set all the options automatically and require no argument in most cases.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Gu J."
                    },
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Xu M."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 131,
                "date": "2017-03-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "AfterQC: Automatic filtering, trimming, error removing and quality control for fastq data"
            },
            "pmcid": "PMC5374548",
            "pmid": "28361673"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ]
}
