{
    "accessibility": "Open access",
    "additionDate": "2018-05-22T09:40:21Z",
    "biotoolsCURIE": "biotools:metaphors",
    "biotoolsID": "metaphors",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "toni.gabaldon@bsc.es",
            "name": "Toni Gabaldón Estevan",
            "typeEntity": "Person",
            "url": "https://www.bsc.es/gabaldon-toni"
        }
    ],
    "description": "MetaPhOrs is a public repository of phylogeny-based orthologs and paralogs that were computed using phylogenetic trees available in twelve public repositories. Currently, over 117,131,162 of unique homologs are deposited in MetaPhOrs database. These predictions were retrieved from 8,246,911 Maximum Likelihood trees for 4,094 species. For each prediction, MetaPhOrs provides a Consistency Score and Evidence Level describing its goodness, together with number of trees and links to their source databases.",
    "download": [
        {
            "type": "Biological data",
            "url": "http://orthology.phylomedb.org/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "http://orthology.phylomedb.org/",
    "lastUpdate": "2020-07-24T12:49:18Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "MetaPhors",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Gabaldonlab",
    "publication": [
        {
            "doi": "10.1093/nar/gkq953",
            "metadata": {
                "abstract": "Reliable prediction of orthology is central to comparative genomics. Approaches based on phylogenetic analyses closely resemble the original definition of orthology and paralogy and are known to be highly accurate. However, the large computational cost associated to these analyses is a limiting factor that often prevents its use at genomic scales. Recently, several projects have addressed the reconstruction of large collections of high-quality phylogenetic trees from which orthology and paralogy relationships can be inferred. This provides us with the opportunity to infer the evolutionary relationships of genes from multiple, independent, phylogenetic trees. Using such strategy, we combine phylogenetic information derived from different databases, to predict orthology and paralogy relationships for 4.1 million proteins in 829 fully sequenced genomes. We show that the number of independent sources from which a prediction is made, as well as the level of consistency across predictions, can be used as reliable confidence scores. A webserver has been developed to easily access these data (http://orthology.phylomedb.org), which provides users with a global repository of phylogeny-based orthology and paralogy predictions. © 2010 The Author(s).",
                "authors": [
                    {
                        "name": "Pryszcz L.P."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Gabaldon T."
                    }
                ],
                "citationCount": 79,
                "date": "2011-03-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MetaPhOrs: Orthology and paralogy predictions from multiple phylogenetic evidence using a consistency-based confidence score"
            },
            "pmcid": "PMC3061081",
            "pmid": "21149260"
        },
        {
            "doi": "10.1093/nar/gkaa282",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Inferring homology relationships across genes in different species is a central task in comparative genomics. Therefore, a large number of resources and methods have been developed over the years. Some public databases include phylogenetic trees of homologous gene families which can be used to further differentiate homology relationships into orthology and paralogy. MetaPhOrs is a web server that integrates phylogenetic information from different sources to provide orthology and paralogy relationships based on a common phylogeny-based predictive algorithm and associated with a consistency-based confidence score. Here we describe the latest version of the web server which includes major new implementations and provides orthology and paralogy relationships derived from ∼8.2 million gene family trees-from 13 different source repositories across ∼4000 species with sequenced genomes. MetaPhOrs server is freely available, without registration, at http://orthology.phylomedb.org/.",
                "authors": [
                    {
                        "name": "Chorostecki U."
                    },
                    {
                        "name": "Molina M."
                    },
                    {
                        "name": "Pryszcz L.P."
                    },
                    {
                        "name": "Gabaldon T."
                    }
                ],
                "date": "2020-07-02T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "MetaPhOrs 2.0: integrative, phylogeny-based inference of orthology and paralogy across the tree of life"
            },
            "pmcid": "PMC7319458",
            "pmid": "32343307"
        }
    ],
    "relation": [
        {
            "biotoolsID": "phylomedb",
            "type": "uses"
        }
    ],
    "toolType": [
        "Database portal",
        "Web service"
    ],
    "topic": [
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1,
    "version": [
        "metaphors_201405",
        "metaphors_201901"
    ]
}