{
    "additionDate": "2021-01-18T10:21:46Z",
    "biotoolsCURIE": "biotools:fwavina",
    "biotoolsID": "fwavina",
    "confidence_flag": "tool",
    "description": "FWAVina is a optimization algorithm for protein-ligand docking based on the fireworks algorithm. FWAVina is a kind of molecular docking tool, which was developed based on the framework of AutoDock Vina.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eddyblue/FWAVina",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-03-11T13:16:36Z",
    "name": "FWAVina",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2020.107363",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdProtein-ligand docking is an essential process that has accelerated drug discovery. How to accurately and effectively optimize the predominant position and orientation of ligands in the binding pocket of a target protein is a major challenge. This paper proposed a novel ligand binding pose search method called FWAVina based on the fireworks algorithm, which combined the fireworks algorithm with the efficient Broyden-Fletcher-Goldfarb-Shannon local search method adopted in AutoDock Vina to address the pose search problem in docking. The FWA was used as a global optimizer to rapidly search promising poses, and the Broyden-Fletcher-Goldfarb-Shannon method was incorporated into FWAVina to perform an exact local search. FWAVina was developed and tested on the PDBbind and DUD-E datasets. The docking performance of FWAVina was compared with the original Vina program. The results showed that FWAVina achieves a remarkable execution time reduction of more than 50 % than Vina without compromising the prediction accuracies in the docking and virtual screening experiments. In addition, the increase in the number of ligand rotatable bonds has almost no effect on the efficiency of FWAVina. The higher accuracy, faster convergence and improved stability make the FWAVina method a better choice of docking tool for computer-aided drug design. The source code is available at https://github.com/eddyblue/FWAVina/.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Song Y."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Liu W."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "FWAVina: A novel optimization algorithm for protein-ligand docking based on the fireworks algorithm"
            },
            "pmid": "32861160"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        }
    ]
}