{
    "additionDate": "2021-01-18T10:11:11Z",
    "biotoolsCURIE": "biotools:hive_panel_explorer",
    "biotoolsID": "hive_panel_explorer",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shallam@mail.ubc.ca",
            "name": "Aria S Hahn",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive network visualization tool.\n\nUpdate: Interactive hive panels can be easily built using different data formats. A wiki tutorial will be up soon. Stay tuned!.\n\nWelcome to the Hive Panel Explorer wiki!.\n\nHive Panel Explorer is a Python script that takes a network and creates a static HTML page with interactive SVG graphics in D3. The visualization produced is a matrix of hive plots plotted using attributes of the nodes and edges (such as degree and centrality). The interactive features let users explore their network and discover patterns in their network. For more information on the design of the tool and on the kind of patterns it can reveal, check out Sarah Perez's Master Thesis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/hallamlab/HivePanelExplorer/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hallamlab/HivePanelExplorer",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T11:50:44Z",
    "name": "Hive_Panel_Explorer",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA683",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.MOTIVATION: Networks are used to relate topological structure to system dynamics and function, particularly in ecology systems biology. Network analysis is often guided or complemented by data-driven visualization. Hive one of many network visualizations, distinguish themselves as providing a general, consistent and coherent rule-based representation to motivate hypothesis development and testing. RESULTS: Here, we present HyPE, Hive Panel Explorer, a software application that creates a panel of interactive hive plots. HyPE enables network exploration based on user-driven layout rules and parameter combinations for simultaneous of multiple network views. We demonstrate HyPE's features by exploring a microbial co-occurrence network constructed from forest soil microbiomes. AVAILABILITY AND IMPLEMENTATION: HyPE is available under the GNU license: https://github.com/hallamlab/HivePanelExplorer. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Hahn A.S."
                    },
                    {
                        "name": "Hallam S.J."
                    },
                    {
                        "name": "Krzywinski M."
                    },
                    {
                        "name": "Perez S.E.I."
                    }
                ],
                "date": "2021-04-20T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Hive Panel Explorer: an interactive network visualization tool"
            },
            "pmid": "32717050"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
