{
    "additionDate": "2021-03-19T09:19:42Z",
    "biotoolsCURIE": "biotools:j-modl",
    "biotoolsID": "j-modl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hemantkumar-aggarwal@uiowa.edu",
            "name": "Hemant Kumar Aggarwal",
            "typeEntity": "Person"
        }
    ],
    "description": "Joint Model-Based Deep Learning for Optimized Sampling and Reconstruction.\n\nJoint model-based deep learning for parallel imaging.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hkaggarwal/J-MoDL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-05T09:01:22.849128Z",
    "name": "J-MoDL",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/JSTSP.2020.3004094",
            "metadata": {
                "abstract": "© 2007-2012 IEEE.Modern MRI schemes, which rely on compressed sensing or deep learning algorithms to recover MRI data from undersampled multichannel Fourier measurements, are widely used to reduce the scan time. The image quality of these approaches is heavily dependent on the sampling pattern. In this article, we introduce a continuous strategy to optimize the sampling pattern and the network parameters jointly. We use a multichannel forward model, consisting of a non-uniform Fourier transform with continuously defined sampling locations, to realize the data consistency block within a model-based deep learning image reconstruction scheme. This approach facilitates the joint and continuous optimization of the sampling pattern and the CNN parameters to improve image quality. We observe that the joint optimization of the sampling patterns and the reconstruction module significantly improves the performance of most deep learning reconstruction algorithms. The source code of the proposed joint learning framework is available at https://github.com/hkaggarwal/J-MoDL.",
                "authors": [
                    {
                        "name": "Aggarwal H.K."
                    },
                    {
                        "name": "Jacob M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "IEEE Journal on Selected Topics in Signal Processing",
                "title": "J-Modl: Joint model-based deep learning for optimized sampling and reconstruction"
            },
            "pmcid": "PMC7893809",
            "pmid": "33613806"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}