{
    "additionDate": "2021-01-18T10:30:00Z",
    "biotoolsCURIE": "biotools:deep-covid",
    "biotoolsID": "deep-covid",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rkafieh@amt.mui.ac.ir",
            "name": "Rahele Kafieh",
            "typeEntity": "Person"
        },
        {
            "email": "sminaee@snap.com",
            "name": "Shervin Minaee",
            "typeEntity": "Person"
        }
    ],
    "description": "Deep-COVID is a tool for predicting COVID-19 from chest X-ray images using deep transfer learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/shervinmin/DeepCovid",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-24T14:55:24Z",
    "name": "Deep-COVID",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2020.101794",
            "metadata": {
                "abstract": "© 2020The COVID-19 pandemic is causing a major outbreak in more than 150 countries around the world, having a severe impact on the health and life of many people globally. One of the crucial step in fighting COVID-19 is the ability to detect the infected patients early enough, and put them under special care. Detecting this disease from radiography and radiology images is perhaps one of the fastest ways to diagnose the patients. Some of the early studies showed specific abnormalities in the chest radiograms of patients infected with COVID-19. Inspired by earlier works, we study the application of deep learning models to detect COVID-19 patients from their chest radiography images. We first prepare a dataset of 5000 Chest X-rays from the publicly available datasets. Images exhibiting COVID-19 disease presence were identified by board-certified radiologist. Transfer learning on a subset of 2000 radiograms was used to train four popular convolutional neural networks, including ResNet18, ResNet50, SqueezeNet, and DenseNet-121, to identify COVID-19 disease in the analyzed chest X-ray images. We evaluated these models on the remaining 3000 images, and most of these networks achieved a sensitivity rate of 98% ( ± 3%), while having a specificity rate of around 90%. Besides sensitivity and specificity rates, we also present the receiver operating characteristic (ROC) curve, precision-recall curve, average prediction, and confusion matrix of each model. We also used a technique to generate heatmaps of lung regions potentially infected by COVID-19 and show that the generated heatmaps contain most of the infected areas annotated by our board certified radiologist. While the achieved performance is very encouraging, further analysis is required on a larger set of COVID-19 images, to have a more reliable estimation of accuracy rates. The dataset, model implementations (in PyTorch), and evaluations, are all made publicly available for research community at https://github.com/shervinmin/DeepCovid.git",
                "authors": [
                    {
                        "name": "Jamalipour Soufi G."
                    },
                    {
                        "name": "Kafieh R."
                    },
                    {
                        "name": "Minaee S."
                    },
                    {
                        "name": "Sonka M."
                    },
                    {
                        "name": "Yazdani S."
                    }
                ],
                "citationCount": 86,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "Deep-COVID: Predicting COVID-19 from chest X-ray images using deep transfer learning"
            },
            "pmcid": "PMC7372265",
            "pmid": "32781377"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
