{
    "additionDate": "2020-01-14T09:00:23Z",
    "biotoolsCURIE": "biotools:SLR_autogenerated",
    "biotoolsID": "SLR_autogenerated",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "luojunwei@hpu.edu.cn",
            "name": "Junwei Luo",
            "typeEntity": "Person"
        }
    ],
    "description": "a scaffolding algorithm based on long reads and contig classification.\n\nScaffolding using long reads obtained by the third generation sequencing technologies.\n\nSLR is a scaffolding tool based on long reads and contig classification.\n\nStep 6: SLR-unique-ambiguous -c <contigs.fa> -r <aligning.bam> -d <align-self.bam> -u <unique-contig-set.fa> -s <temp-scaffold-set.fa> -b <unique-contig.bam> -p <output_directory>.\n\n||| NAME EQUAL TO (PUB. DIFFERENT) bio.tools/slr",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/luojunwei/SLR",
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2020-01-14T09:00:23Z",
    "license": "GPL-3.0",
    "name": "SLR_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3114-9",
            "metadata": {
                "abstract": "BACKGROUND: Scaffolding is an important step in genome assembly that orders and orients the contigs produced by assemblers. However, repetitive regions in contigs usually prevent scaffolding from producing accurate results. How to solve the problem of repetitive regions has received a great deal of attention. In the past few years, long reads sequenced by third-generation sequencing technologies (Pacific Biosciences and Oxford Nanopore) have been demonstrated to be useful for sequencing repetitive regions in genomes. Although some stand-alone scaffolding algorithms based on long reads have been presented, scaffolding still requires a new strategy to take full advantage of the characteristics of long reads. RESULTS: Here, we present a new scaffolding algorithm based on long reads and contig classification (SLR). Through the alignment information of long reads and contigs, SLR classifies the contigs into unique contigs and ambiguous contigs for addressing the problem of repetitive regions. Next, SLR uses only unique contigs to produce draft scaffolds. Then, SLR inserts the ambiguous contigs into the draft scaffolds and produces the final scaffolds. We compare SLR to three popular scaffolding tools by using long read datasets sequenced with Pacific Biosciences and Oxford Nanopore technologies. The experimental results show that SLR can produce better results in terms of accuracy and completeness. The open-source code of SLR is available at https://github.com/luojunwei/SLR. CONCLUSION: In this paper, we describes SLR, which is designed to scaffold contigs using long reads. We conclude that SLR can improve the completeness of genome assembly.",
                "authors": [
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Lyu M."
                    },
                    {
                        "name": "Chen R."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Luo H."
                    },
                    {
                        "name": "Yan C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-30T00:00:00Z",
                "journal": "BMC bioinformatics",
                "title": "SLR: a scaffolding algorithm based on long reads and contig classification"
            },
            "pmcid": "PMC6820941",
            "pmid": "31666010"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ]
}