{
    "additionDate": "2024-04-18T12:51:11.920346Z",
    "biotoolsCURIE": "biotools:pooe",
    "biotoolsID": "pooe",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "shipingyang@cau.edu.cn",
            "name": "Shiping Yang",
            "orcidid": "https://orcid.org/0009-0002-0464-4279",
            "typeEntity": "Person"
        },
        {
            "email": "zidingzhang@cau.edu.cn",
            "name": "Ziding Zhang",
            "orcidid": "https://orcid.org/0000-0002-9296-571X",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting oomycete effectors based on a pre-trained large protein language model.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://zzdlab.com/pooe/index.php",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-04-18T12:51:11.923773Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/zzdlabzm/POOE"
        }
    ],
    "name": "POOE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.01004-23",
            "metadata": {
                "abstract": "Oomycetes are fungus-like eukaryotic microorganisms which can cause catastrophic diseases in many plants. Successful infection of oomycetes depends highly on their effector proteins that are secreted into plant cells to subvert plant immunity. Thus, systematic identification of effectors from the oomycete proteomes remains an initial but crucial step in understanding plant–pathogen relationships. However, the number of experimentally identified oomycete effectors is still limited. Currently, only a few bioinformatics predictors exist to detect potential effectors, and their prediction performance needs to be improved. Here, we used the sequence embeddings from a pre-trained large protein language model (ProtTrans) as input and developed a support vector machine-based method called POOE for predicting oomycete effectors. POOE could achieve a highly accurate performance with an area under the precision-recall curve of 0.804 (area under the receiver operating characteristic curve = 0.893, accuracy = 0.874, precision = 0.777, recall = 0.684, and specificity = 0.936) in the fivefold cross-validation, considerably outperforming various combinations of popular machine learning algorithms and other commonly used sequence encoding schemes. A similar prediction performance was also observed in the independent test. Compared with the existing oomycete effector prediction methods, POOE provided very competitive and promising performance, suggesting that ProtTrans effectively captures rich protein semantic information and dramatically improves the prediction task. We anticipate that POOE can accelerate the identification of oomycete effectors and provide new hints to systematically understand the functional roles of effectors in plant–pathogen interactions. The web server of POOE is freely accessible at http://zzdlab.com/pooe/index.php. The corresponding source codes and data sets are also available at https://github.com/zzdlabzm/POOE. IMPORTANCE In this work, we use the sequence representations from a pre-trained large protein language model (ProtTrans) as input and develop a Support Vector Machine-based method called POOE for predicting oomycete effectors. POOE could achieve a highly accurate performance in the independent test set, considerably outperforming existing oomycete effector prediction methods. We expect that this new bioinformatics tool will accelerate the identification of oomycete effectors and further guide the experimental efforts to interrogate the functional roles of effectors in plant-pathogen interaction.",
                "authors": [
                    {
                        "name": "Fu C."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Lei C."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Zhao M."
                    },
                    {
                        "name": "Zhou K."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "mSystems",
                "title": "POOE: predicting oomycete effectors based on a pre-trained large protein language model"
            },
            "pmcid": "PMC10804963",
            "pmid": "38078741"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
