{"credit":[{"email":"andreas.heger@anat.ox.ac.uk","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ekhidna.biocenter.helsinki.fi/"}],"documentation":[{"type":"GENERAL","url":"http://ekhidna.biocenter.helsinki.fi/downloads/maxflow"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/maxflow-0-1-1-alignment-protein-sequences-based-pairwise-consistency.html"}],"publication":[{"abstract":"Protein sequence alignments are more reliable the shorter the evolutionary distance. Here, we align distantly related proteins using many closely spaced intermediate sequences as stepping stones. Such transitive alignments can be generated between any two proteins in a connected set, whether they are direct or indirect sequence neighbors in the underlying library of pairwise alignments. We have implemented a greedy algorithm, MaxFlow, using a novel consistency score to estimate the relative likelihood of alternative paths of transitive alignment. In contrast to traditional profile models of amino acid preferences, MaxFlow models the probability that two positions are structurally equivalent and retains high information content across large distances in sequence space. Thus, MaxFlow is able to identify sparse and narrow active-site sequence signatures which are embedded in high-entropy sequence segments in the structure based multiple alignment of large diverse enzyme superfamilies. In a challenging benchmark based on the urease superfamily, MaxFlow yields better reliability and double coverage compared to available sequence alignment software. This promises to increase information returns from functional and structural genomics, where reliable sequence alignment is a bottleneck to transferring the functional or structural characterization of model proteins to entire protein superfamilies.","authors":["Heger A.","Lappe M.","Holm L."],"cit_count":17,"journal":"Journal of Computational Biology","pmid":"15700405","title":"Accurate detection of very sparse sequence motifs","year":"2004-11-23"}],"summary":{"biotoolsCURIE":"biotools:maxflow","biotoolsID":"maxflow","description":"A greedy algorithm, using a novel consistency score to estimate the relative likelihood of alternative paths of transitive alignment. In contrast to traditional profile models of amino acid preferences, MaxFlow models the probability that two positions are structurally equivalent and retains high information content across large distances in sequence space.","homepage":"http://ekhidna.biocenter.helsinki.fi/gtg/start","name":"Maxflow"}}