{
    "additionDate": "2021-01-18T10:48:41Z",
    "biotoolsCURIE": "biotools:r-chie",
    "biotoolsID": "r-chie",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "irmtraud.meyer@cantab.net",
            "name": "Irmtraud M Meyer",
            "orcidid": "https://orcid.org/0000-0002-4048-3479",
            "typeEntity": "Person"
        }
    ],
    "description": "a web server and R package for visualizing cis and trans RNA-RNA, RNA-DNA and DNA-DNA interactions.\n\nA web server and R package for plotting RNA secondary structures, trans RNA-RNA, RNA-DNA and DNA-DNA interactions and genomic interactions.\n\nR-chie allows you to make arc diagrams of RNA secondary structures, allowing for easy comparison and overlap of two structures, rank and display basepairs in colour and to also visualize corresponding multiple sequence alignments and co-variation information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA structure covariance model generation",
                    "uri": "http://edamontology.org/operation_3469"
                },
                {
                    "term": "Protein secondary structure prediction (helices)",
                    "uri": "http://edamontology.org/operation_0468"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "homepage": "http://www.e-rna.org/rchie/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-03T13:23:16Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.e-rna.org/r-chie"
        }
    ],
    "name": "R-chie",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA708",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Interactions between biological entities are key to understanding their potential functional roles. Three fields of research have recently made particular progress: The investigation of transRNA-RNA and RNA-DNA transcriptome interactions and of trans DNA-DNA genome interactions. We now have both experimental and computational methods for examining these interactions in vivo and on a transcriptome- A nd genome-wide scale, respectively. Often, key insights can be gained by visually inspecting figures that manage to combine different sources of evidence and quantitative information. We here present R-chie, a web server and R package for visualizing cis and transRNA-RNA, RNA-DNA and DNA-DNA interactions. For this, we have completely revised and significantly extended an earlier version of R-chie (1) which was initially introduced for visualizing RNA secondary structure features. The new R-chie offers a range of unique features for visualizing cis and transRNA-RNA, RNA-DNA and DNA-DNA interactions. Particularly note-worthy features include the ability to incorporate evolutionary information, e.g. multiple-sequence alignments, to compare two alternative sets of information and to incorporate detailed, quantitative information. R-chie is readily available via a web server as well as a corresponding R package called R4RNA which can be used to run the software locally.",
                "authors": [
                    {
                        "name": "Tsybulskyi V."
                    },
                    {
                        "name": "Mounir M."
                    },
                    {
                        "name": "Meyer I.M."
                    }
                ],
                "date": "2020-10-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "R-chie: A web server and R package for visualizing cis and trans RNA-RNA, RNA-DNA and DNA-DNA interactions"
            },
            "pmcid": "PMC7544209",
            "pmid": "32976561"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}