{
    "additionDate": "2017-03-27T08:35:14Z",
    "biotoolsCURIE": "biotools:genesigdb",
    "biotoolsID": "genesigdb",
    "credit": [
        {
            "email": "johnq@jimmy.harvard.edu",
            "name": "John Quackenbush",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://genesigdb.org/genesigdb/contact.jsp"
        }
    ],
    "description": "Manually curated database of gene expression signatures. It focuses on cancer, development, and stem cell gene signatures and was constructed from thousands of publications from which we manually transcribe gene signatures. Gene signatures are mapped to the genome to extract standardized lists of EnsEMBL gene identifiers. It provides the original gene signature, the standardized gene list and a fully traceable gene mapping history for each gene.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://genesigdb.org/genesigdb/documentation.jsp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "http://compbio.dfci.harvard.edu/genesigdb",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "GeneSigDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The primary objective of most gene expression studies is the identification of one or more gene signatures; lists of genes whose transcriptional levels are uniquely associated with a specific biological phenotype. Whilst thousands of experimentally derived gene signatures are published, their potential value to the community is limited by their computational inaccessibility. Gene signatures are embedded in published article figures, tables or in supplementary materials, and are frequently presented using non-standard gene or probeset nomenclature. We present GeneSigDB (http://compbio.dfci.harvard.edu/genesigdb) a manually curated database of gene expression signatures. GeneSigDB release 1.0 focuses on cancer and stem cells gene signatures and was constructed from more than 850 publications from which we manually transcribed 575 gene signatures. Most gene signatures (n = 560) were successfully mapped to the genome to extract standardized lists of EnsEMBL gene identifiers. GeneSigDB provides the original gene signature, the standardized gene list and a fully traceable gene mapping history for each gene from the original transcribed data table through to the standardized list of genes. The GeneSigDB web portal is easy to search, allows users to compare their own gene list to those in the database, and download gene signatures in most common gene identifier formats. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Culhane A.C."
                    },
                    {
                        "name": "Schwarzl T."
                    },
                    {
                        "name": "Sultana R."
                    },
                    {
                        "name": "Picard K.C."
                    },
                    {
                        "name": "Picard S.C."
                    },
                    {
                        "name": "Lu T.H."
                    },
                    {
                        "name": "Franklin K.R."
                    },
                    {
                        "name": "French S.J."
                    },
                    {
                        "name": "Papenhausen G."
                    },
                    {
                        "name": "Correll M."
                    },
                    {
                        "name": "Quackenbush J."
                    }
                ],
                "citationCount": 70,
                "date": "2009-11-24T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GeneSigDB-A curated database of gene expression signatures"
            },
            "pmid": "19934259"
        },
        {
            "metadata": {
                "abstract": "GeneSigDB (http://www.genesigdb.org or http://compbio.dfci.harvard.edu/ genesigdb/) is a database of gene signatures that have been extracted and manually curated from the published literature. It provides a standardized resource of published prognostic, diagnostic and other gene signatures of cancer and related disease to the community so they can compare the predictive power of gene signatures or use these in gene set enrichment analysis. Since GeneSigDB release 1.0, we have expanded from 575 to 3515 gene signatures, which were collected and transcribed from 1604 published articles largely focused on gene expression in cancer, stem cells, immune cells, development and lung disease. We have made substantial upgrades to the GeneSigDB website to improve accessibility and usability, including adding a tag cloud browse function, facetted navigation and a 'basket' feature to store genes or gene signatures of interest. Users can analyze GeneSigDB gene signatures, or upload their own gene list, to identify gene signatures with significant gene overlap and results can be viewed on a dynamic editable heatmap that can be downloaded as a publication quality image. All data in GeneSigDB can be downloaded in numerous formats including .gmt file format for gene set enrichment analysis or as a R/Bioconductor data file. GeneSigDB is available from http://www.genesigdb.org. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Culhane A.C."
                    },
                    {
                        "name": "Schroder M.S."
                    },
                    {
                        "name": "Sultana R."
                    },
                    {
                        "name": "Picard S.C."
                    },
                    {
                        "name": "Martinelli E.N."
                    },
                    {
                        "name": "Kelly C."
                    },
                    {
                        "name": "Haibe-Kains B."
                    },
                    {
                        "name": "Kapushesky M."
                    },
                    {
                        "name": "St Pierre A.-A."
                    },
                    {
                        "name": "Flahive W."
                    },
                    {
                        "name": "Picard K.C."
                    },
                    {
                        "name": "Gusenleitner D."
                    },
                    {
                        "name": "Papenhausen G."
                    },
                    {
                        "name": "O'Connor N."
                    },
                    {
                        "name": "Correll M."
                    },
                    {
                        "name": "Quackenbush J."
                    }
                ],
                "citationCount": 63,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GeneSigDB: A manually curated database and resource for analysis of gene expression signatures"
            },
            "pmid": "22110038"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}