{
    "additionDate": "2017-03-24T10:36:28Z",
    "biotoolsCURIE": "biotools:superquantnode",
    "biotoolsID": "superquantnode",
    "collectionID": [
        "Proteomics"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "vgor@bmb.sdu.dk",
            "name": "Vladimir Gorshkov",
            "orcidid": "http://orcid.org/0000-0003-0170-5785",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Thermo Proteome Discoverer 2.x processing nodes for mixture spectra deconvolution.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/caetera/SuperQuantNode"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://github.com/caetera/SuperQuantNode"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "note": "Deconvolution of fragmentation spectra of coisolated peptides (mixture spectra)",
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "https://github.com/caetera/SuperQuantNode",
    "language": [
        "C#"
    ],
    "lastUpdate": "2019-03-26T08:40:14Z",
    "license": "LGPL-3.0",
    "maturity": "Mature",
    "name": "SuperQuantNode",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "homer",
    "publication": [
        {
            "doi": "10.1021/acs.analchem.5b01166",
            "metadata": {
                "abstract": "© 2015 American Chemical Society.SuperQuant is a quantitative proteomics data processing approach that uses complementary fragment ions to identify multiple coisolated peptides in tandem mass spectra allowing for their quantification. This approach can be applied to any shotgun proteomics data set acquired with high mass accuracy for quantification at the MS<sup>1</sup> level. The SuperQuant approach was developed and implemented as a processing node within the Thermo Proteome Discoverer 2.x. The performance of the developed approach was tested using dimethyl-labeled HeLa lysate samples having a ratio between channels of 10(heavy):4(medium):1(light). Peptides were fragmented with collision-induced dissociation using isolation windows of 1, 2, and 4 Th while recording data both with high-resolution and low-resolution. The results obtained using SuperQuant were compared to those using the conventional ion trap-based approach (low mass accuracy MS<sup>2</sup> spectra), which is known to achieve high identification performance. Compared to the common high-resolution approach, the SuperQuant approach identifies up to 70% more peptide-spectrum matches (PSMs), 40% more peptides, and 20% more proteins at the 0.01 FDR level. It identifies more PSMs and peptides than the ion trap-based approach. Improvements in identifications resulted in up to 10% more PSMs, 15% more peptides, and 10% more proteins quantified on the same raw data. The developed approach does not affect the accuracy of the quantification and observed coefficients of variation between replicates of the same proteins were close to the values typical for other precursor ion-based quantification methods. The raw data is deposited to ProteomeXchange (PXD001907). The developed node is available for testing at https://github.com/caetera/SuperQuantNode.",
                "authors": [
                    {
                        "name": "Gorshkov V."
                    },
                    {
                        "name": "Kjeldsen F."
                    },
                    {
                        "name": "Verano-Braga T."
                    }
                ],
                "citationCount": 18,
                "date": "2015-06-16T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "SuperQuant: A Data Processing Approach to Increase Quantitative Proteome Coverage"
            },
            "pmid": "25978296",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}
