{
    "additionDate": "2020-01-14T09:25:11Z",
    "biotoolsCURIE": "biotools:BiWalkLDA",
    "biotoolsID": "BiWalkLDA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shang@nwpu.edu.cn",
            "name": "Xuequn Shang",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel algorithm based on bi-random walks to identify disease-related lncRNAs.\n\nEMAIL: jhu@nwpu.edu.cn, yiqun.gao@nwpu-bioinformatics.com.\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nBiWalkLDA.m: BiwalkLDA framework to predict potential lncRNA-disease association.\n\nnormFun.m: Laplacian normalization",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/screamer/BiwalkLDA",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-12-09T14:24:22Z",
    "license": "Other",
    "name": "BiWalkLDA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3128-3",
            "metadata": {
                "abstract": "© 2019 Hu et al.Backgrounds: There is evidence to suggest that lncRNAs are associated with distinct and diverse biological processes. The dysfunction or mutation of lncRNAs are implicated in a wide range of diseases. An accurate computational model can benefit the diagnosis of diseases and help us to gain a better understanding of the molecular mechanism. Although many related algorithms have been proposed, there is still much room to improve the accuracy of the algorithm. Results: We developed a novel algorithm, BiWalkLDA, to predict disease-related lncRNAs in three real datasets, which have 528 lncRNAs, 545 diseases and 1216 interactions in total. To compare performance with other algorithms, the leave-one-out validation test was performed for BiWalkLDA and three other existing algorithms, SIMCLDA, LDAP and LRLSLDA. Additional tests were carefully designed to analyze the parameter effects such as α, β, l and r, which could help user to select the best choice of these parameters in their own application. In a case study of prostate cancer, eight out of the top-ten disease-related lncRNAs reported by BiWalkLDA were previously confirmed in literatures. Conclusions: In this paper, we develop an algorithm, BiWalkLDA, to predict lncRNA-disease association by using bi-random walks. It constructs a lncRNA-disease network by integrating interaction profile and gene ontology information. Solving cold-start problem by using neighbors' interaction profile information. Then, bi-random walks was applied to three real biological datasets. Results show that our method outperforms other algorithms in predicting lncRNA-disease association in terms of both accuracy and specificity. Availability: https://github.com/screamer/BiwalkLDA",
                "authors": [
                    {
                        "name": "Hu J."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Zheng Y."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Shang X."
                    }
                ],
                "citationCount": 4,
                "date": "2019-11-25T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A novel algorithm based on bi-random walks to identify disease-related lncRNAs"
            },
            "pmcid": "PMC6876073",
            "pmid": "31760932"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}