{
    "additionDate": "2021-01-18T11:30:29Z",
    "biotoolsCURIE": "biotools:ramd",
    "biotoolsID": "ramd",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Daria B. Kokh",
            "typeEntity": "Person"
        },
        {
            "name": "Rebecca C. Wade",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficient random acceleration molecular dynamics simulation and interaction fingerprint analysis of ligand trajectories.\n\nRandom Acceleration Molecular Dynamics (RAMD).\n\nRandom Acceleration Molecular Dynamics (RAMD) is a method to carry out molecular dynamics simulations with an additional randomly oriented force applied to a molecule in the system.",
    "download": [
        {
            "type": "Downloads page",
            "url": "https://www.h-its.org/downloads/ramd/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HITS-MCM/GROMACS-ramd",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-03T14:01:08Z",
    "name": "RAMD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1063/5.0019088",
            "metadata": {
                "abstract": "© 2020 Author(s).The dissociation of ligands from proteins and other biomacromolecules occurs over a wide range of timescales. For most pharmaceutically relevant inhibitors, these timescales are far beyond those that are accessible by conventional molecular dynamics (MD) simulation. Consequently, to explore ligand egress mechanisms and compute dissociation rates, it is necessary to enhance the sampling of ligand unbinding. Random Acceleration MD (RAMD) is a simple method to enhance ligand egress from a macromolecular binding site, which enables the exploration of ligand egress routes without prior knowledge of the reaction coordinates. Furthermore, the τRAMD procedure can be used to compute the relative residence times of ligands. When combined with a machine-learning analysis of protein-ligand interaction fingerprints (IFPs), molecular features that affect ligand unbinding kinetics can be identified. Here, we describe the implementation of RAMD in GROMACS 2020, which provides significantly improved computational performance, with scaling to large molecular systems. For the automated analysis of RAMD results, we developed MD-IFP, a set of tools for the generation of IFPs along unbinding trajectories and for their use in the exploration of ligand dynamics. We demonstrate that the analysis of ligand dissociation trajectories by mapping them onto the IFP space enables the characterization of ligand dissociation routes and metastable states. The combined implementation of RAMD and MD-IFP provides a computationally efficient and freely available workflow that can be applied to hundreds of compounds in a reasonable computational time and will facilitate the use of τRAMD in drug design.",
                "authors": [
                    {
                        "name": "Kokh D.B."
                    },
                    {
                        "name": "Doser B."
                    },
                    {
                        "name": "Richter S."
                    },
                    {
                        "name": "Ormersbach F."
                    },
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Wade R.C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-28T00:00:00Z",
                "journal": "Journal of Chemical Physics",
                "title": "A workflow for exploring ligand dissociation from a macromolecule: Efficient random acceleration molecular dynamics simulation and interaction fingerprint analysis of ligand trajectories"
            },
            "pmid": "33003755"
        }
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        }
    ]
}