
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ttic.uchicago.edu/~jinbo/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://raptorx.uchicago.edu/about/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure prediction",
                    "uri": "http://edamontology.org/operation_0271"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Protein structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            },
            {
                "term": "Protein structure",
                "uri": "http://edamontology.org/topic_2814"
            },
            {
                "term": "Structure prediction",
                "uri": "http://edamontology.org/topic_0082"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/raptorx-protein-structure-prediction-server.html"
        }
    ],
    "publication": [
        {
            "abstract": "Compared with the protein 3-class secondary structure (SS) prediction, the 8-class prediction gains less attention and is also much more challenging, especially for proteins with few sequence homologs. This paper presents a new probabilistic method for 8-class SS prediction using conditional neural fields (CNFs), a recently invented probabilistic graphical model. This CNF method not only models the complex relationship between sequence features and SS, but also exploits the interdependency among SS types of adjacent residues. In addition to sequence profiles, our method also makes use of non-evolutionary information for SS prediction. Tested on the CB513 and RS126 data sets, our method achieves Q8 accuracy of 64.9 and 64.7%, respectively, which are much better than the SSpro8 web server (51.0 and 48.0%, respectively). Our method can also be used to predict other structure properties (e.g. solvent accessibility) of a protein or the SS of RNA. © 2011 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim.",
            "authors": [
                "Wang Z.",
                "Zhao F.",
                "Peng J.",
                "Xu J."
            ],
            "cit_count": 47,
            "doi": "10.1002/pmic.201100196",
            "journal": "Proteomics",
            "title": "Protein 8-class secondary structure prediction using conditional neural fields",
            "type": "Primary",
            "year": "2011-10-01"
        },
        {
            "abstract": "A key challenge of modern biology is to uncover the functional role of the protein entities that compose cellular proteomes. To this end, the availability of reliable three-dimensional atomic models of proteins is often crucial. This protocol presents a community-wide web-based method using RaptorX (http://raptorx.uchicago.edu/) for protein secondary structure prediction, template-based tertiary structure modeling, alignment quality assessment and sophisticated probabilistic alignment sampling. RaptorX distinguishes itself from other servers by the quality of the alignment between a target sequence and one or multiple distantly related template proteins (especially those with sparse sequence profiles) and by a novel nonlinear scoring function and a probabilistic-consistency algorithm. Consequently, RaptorX delivers high-quality structural models for many targets with only remote templates. At present, it takes RaptorX ∼35 min to finish processing a sequence of 200 amino acids. Since its official release in August 2011, RaptorX has processed ∼6,000 sequences submitted by ∼1,600 users from around the world. © 2012 Nature America, Inc. All rights reserved.",
            "authors": [
                "Kallberg M.",
                "Wang H.",
                "Wang S.",
                "Peng J.",
                "Wang Z.",
                "Lu H.",
                "Xu J."
            ],
            "cit_count": 519,
            "doi": "10.1038/nprot.2012.085",
            "journal": "Nature Protocols",
            "title": "Template-based protein structure modeling using the RaptorX web server",
            "type": "Primary",
            "year": "2012-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:raptorx",
        "biotoolsID": "raptorx",
        "description": "Prediction of 3D structures (secondary and tertiary structures as well as solvent accessibility and disordered regions) for protein sequences without close homologs in the Protein Data Bank (PDB).",
        "homepage": "http://raptorx.uchicago.edu/",
        "name": "RaptorX"
    }
}