{
    "additionDate": "2017-03-25T22:23:33Z",
    "biotoolsCURIE": "biotools:sbc_tools",
    "biotoolsID": "sbc_tools",
    "credit": [
        {
            "email": "oliver.frings@sbc.su.se",
            "name": "Oliver Frings",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Kalign is a fast and accurate multiple sequence alignment algorithm designed to align large numbers of protein sequences. Kalignvu is an xml based alignment viewer that allows users to resize alignments and choose different colour schemes. Mumsa is a tool for automatic assessment of alignment quality.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://msa.cgb.ki.se/cgi-bin/msa.cgi"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Sequence alignment validation",
                    "uri": "http://edamontology.org/operation_0447"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "homepage": "http://msa.cgb.ki.se/cgi-bin/msa.cgi",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "SBC tools",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Obtaining high quality multiple alignments is crucial for a range of sequence analysis tasks. A common strategy is to align the sequences several times, varying the program or parameters until the best alignment according to manual inspection by human experts is found. Ideally, this should be assisted by an automatic assessment of the alignment quality. Our web-site http://msa.cgb.ki.se allows users to perform all these steps: Kalign to align sequences, Kalignvu to view and verify the resulting alignments and Mumsa to assess the quality. Due to the computational efficiency of Kalignwecan allowusers to submit hundreds of sequences to be aligned and still guarantee fast response times. All servers are freely accessible and the underlying software can be freely downloaded for local use. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lassmann T."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    }
                ],
                "citationCount": 85,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Kalign, Kalignvu and Mumsa: Web servers for multiple sequence alignment"
            },
            "pmid": "16845078"
        },
        {
            "metadata": {
                "abstract": "Background: The alignment of multiple protein sequences is a fundamental step in the analysis of biological data. It has traditionally been applied to analyzing protein families for conserved motifs, phylogeny, structural properties, and to improve sensitivity in homology searching. The availability of complete genome sequences has increased the demands on multiple sequence alignment (MSA) programs. Current MSA methods suffer from being either too inaccurate or too computationally expensive to be applied effectively in large-scale comparative genomics. Results: We developed Kalign, a method employing the Wu-Manber string-matching algorithm, to improve both the accuracy and speed of multiple sequence alignment. We compared the speed and accuracy of Kalign to other popular methods using Balibase, Prefab, and a new large test set. Kalign was as accurate as the best other methods on small alignments, but significantly more accurate when aligning large and distantly related sets of sequences. In our comparisons, Kalign was about 10 times faster than ClustalW and, depending on the alignment size, up to 50 times faster than popular iterative methods. Conclusions: Kalign is a fast and robust alignment method. It is especially well suited for the increasingly important task of aligning large numbers of sequences. © 2005 Lassmann and Sonnhammer, licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Lassmann T."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    }
                ],
                "citationCount": 479,
                "date": "2005-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Kalign - An accurate and fast multiple sequence alignment algorithm"
            },
            "pmid": "16343337"
        },
        {
            "metadata": {
                "abstract": "Multiple sequence alignments play a central role in the annotation of novel genomes. Given the biological and computational complexity of this task, the automatic generation of high-quality alignments remains challenging. Since multiple alignments are usually employed at the very start of data analysis pipelines, it is crucial to ensure high alignment quality. We describe a simple, yet elegant, solution to assess the biological accuracy of alignments automatically. Our approach is based on the comparison of several alignments of the same sequences. We introduce two functions to compare alignments: the average overlap score and the multiple overlap score. The former identifies difficult alignment cases by expressing the similarity among several alignments, while the latter estimates the biological correctness of individual alignments. We implemented both functions in the MUMSA program and demonstrate the overall robustness and accuracy of both functions on three large benchmark sets. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Lassmann T."
                    },
                    {
                        "name": "Sonnhammer E.L.L."
                    }
                ],
                "citationCount": 99,
                "date": "2005-12-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Automatic assessment of alignment quality"
            },
            "pmid": "16361270"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}