
{
    "credit": [
        {
            "email": "j.capellades.to@gmail.com",
            "name": "Jordi Capellades",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/jcapelladesto/geoRge/blob/master/vignettes/geoRge.Rmd"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic labeling",
                    "uri": "http://edamontology.org/operation_3715"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "SILAC",
                    "uri": "http://edamontology.org/operation_3638"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 American Chemical Society.Studying the flow of chemical moieties through the complex set of metabolic reactions that happen in the cell is essential to understanding the alterations in homeostasis that occur in disease. Recently, LC/MS-based untargeted metabolomics and isotopically labeled metabolites have been used to facilitate the unbiased mapping of labeled moieties through metabolic pathways. However, due to the complexity of the resulting experimental data sets few computational tools are available for data analysis. Here we introduce geoRge, a novel computational approach capable of analyzing untargeted LC/MS data from stable isotope-labeling experiments. geoRge is written in the open language R and runs on the output structure of the XCMS package, which is in widespread use. As opposed to the few existing tools, which use labeled samples to track stable isotopes by iterating over all MS signals using the theoretical mass difference between the light and heavy isotopes, geoRge uses unlabeled and labeled biologically equivalent samples to compare isotopic distributions in the mass spectra. Isotopically enriched compounds change their isotopic distribution as compared to unlabeled compounds. This is directly reflected in a number of new m/z peaks and higher intensity peaks in the mass spectra of labeled samples relative to the unlabeled equivalents. The automated untargeted isotope annotation and relative quantification capabilities of geoRge are demonstrated by the analysis of LC/MS data from a human retinal pigment epithelium cell line (ARPE-19) grown on normal and high glucose concentrations mimicking diabetic retinopathy conditions in vitro. In addition, we compared the results of geoRge with the outcome of X13CMS, since both approaches rely entirely on XCMS parameters for feature selection, namely m/z and retention time values. To ensure data traceability and reproducibility, and enabling for comparison with other existing and future approaches, raw LC/MS files have been deposited in MetaboLights (MTBLS213) and geoRge is available as an R script at https://github.com/jcapelladesto/geoRge.",
            "authors": [
                "Capellades J.",
                "Navarro M.",
                "Samino S.",
                "Garcia-Ramirez M.",
                "Hernandez C.",
                "Simo R.",
                "Vinaixa M.",
                "Yanes O."
            ],
            "cit_count": 20,
            "doi": "10.1021/acs.analchem.5b03628",
            "journal": "Analytical Chemistry",
            "pmid": "26639619",
            "title": "GeoRge: A Computational Tool to Detect the Presence of Stable Isotope Labeling in LC/MS-Based Untargeted Metabolomics",
            "year": "2016-01-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:george",
        "biotoolsID": "george",
        "description": "Analyze untargeted LC/MS data from stable isotope-labeling experiments useing unlabeled and labeled biologically equivalent samples to compare isotopic distributions in the mass spectra.",
        "homepage": "https://github.com/jcapelladesto/geoRge",
        "name": "geoRge",
        "version": [
            "1.0"
        ]
    }
}