{
    "additionDate": "2020-01-09T17:33:49Z",
    "biotoolsCURIE": "biotools:CircCode",
    "biotoolsID": "CircCode",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "glli@snnu.edu.cn",
            "name": "Guanglin Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A Powerful Tool for Identifying circRNA Coding Ability.\n\nA Python3-base pipeline for translated circular RNA(circRNA) identification.\n\nCircCode is a Python3-base pipeline for translated circular RNA identification. It automatically tandem links sequence in series and processes a given ribosome profile data (including quality control, filtering and alignment). Finally, based on random forest and J48 classification, the final translated circular RNA was predicted. The user only needs to fill in the given configuration file and run the python scripts to get the predicted translated circular RNA",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Coding region prediction",
                    "uri": "http://edamontology.org/operation_0436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PSSUN/CircCode",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-09T17:33:49Z",
    "license": "GPL-3.0",
    "name": "CircCode",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00981",
            "metadata": {
                "abstract": "© Copyright © 2019 Sun and Li.Circular RNAs (circRNAs), which play vital roles in many regulatory pathways, are widespread in many species. Although many circRNAs have been discovered in plants and animals, the functions of these RNAs have not been fully investigated. In addition to the function of circRNAs as microRNA (miRNA) decoys, the translation potential of circRNAs is important for the study of their functions; yet, few tools are available to identify their translation potential. With the development of high-throughput sequencing technology and the emergence of ribosome profiling technology, it is possible to identify the coding ability of circRNAs with high sensitivity. To evaluate the coding ability of circRNAs, we first developed the CircCode tool and then used CircCode to investigate the translation potential of circRNAs from humans and Arabidopsis thaliana. Based on the ribosome profile databases downloaded from NCBI, we found 3,610 and 1,569 translated circRNAs in humans and A. thaliana, respectively. Finally, we tested the performance of CircCode and found a low false discovery rate and high sensitivity for identifying circRNA coding ability. CircCode, a Python 3–based framework for identifying the coding ability of circRNAs, is also a simple and powerful command line-based tool. To investigate the translation potential of circRNAs, the user can simply fill in the given configuration file and run the Python 3 scripts. The tool is freely available at https://github.com/PSSUN/CircCode.",
                "authors": [
                    {
                        "name": "Sun P."
                    },
                    {
                        "name": "Li G."
                    }
                ],
                "citationCount": 7,
                "date": "2019-10-10T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "CircCode: A Powerful Tool for Identifying circRNA Coding Ability"
            },
            "pmcid": "PMC6795751",
            "pmid": "31649739"
        }
    ],
    "topic": [
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}