{
    "additionDate": "2021-01-18T12:24:26Z",
    "biotoolsCURIE": "biotools:pnab",
    "biotoolsID": "pnab",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "anton.petrov@biology.gatech.edu",
            "name": "Anton S Petrov",
            "typeEntity": "Person"
        }
    ],
    "description": "proto-Nucleic Acid Builder (pNAB) \nThe proto-Nucleic Acid Builder is a program for modeling the 3D strucutres of DNA, RNA, and nucleic acid analogs. Nucleic acids with alternative backbones or nucleobases can be constructed by the program by supplying the 3D structure of isolated backbones or nucleobases. The program can perform a helical parameter search and backbone conformation search and find reasonable nucleic acid structures. Geometric and energetic criteria are used to evaluate candidate structures. The program is written in C++ and Python, and has a graphical user interface. The program is available for the Linux, MacOS, and Windows platforms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure prediction",
                    "uri": "http://edamontology.org/operation_0475"
                },
                {
                    "term": "Nucleic acid design",
                    "uri": "http://edamontology.org/operation_3095"
                },
                {
                    "term": "Nucleic acid structure comparison",
                    "uri": "http://edamontology.org/operation_2518"
                },
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GT-NucleicAcids/pnab",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-01-29T17:30:20Z",
    "license": "GPL-2.0",
    "name": "proto-Nucleic Acid Builder",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1159",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.The helical structures of DNA and RNA were originally revealed by experimental data. Likewise, the development of programs for modeling these natural polymers was guided by known structures. These nucleic acid polymers represent only two members of a potentially vast class of polymers with similar structural features, but that differ from DNA and RNA in the backbone or nucleobases. Xeno nucleic acids (XNAs) incorporate alternative backbones that affect the conformational, chemical, and thermodynamic properties of XNAs. Given the vast chemical space of possible XNAs, computational modeling of alternative nucleic acids can accelerate the search for plausible nucleic acid analogs and guide their rational design. Additionally, a tool for the modeling of nucleic acids could help reveal what nucleic acid polymers may have existed before RNA in the early evolution of life. To aid the development of novel XNA polymers and the search for possible pre-RNA candidates, this article presents the proto-Nucleic Acid Builder (https://github.com/GT-NucleicAcids/pnab), an open-source program for modeling nucleic acid analogs with alternative backbones and nucleobases. The torsion-driven conformation search procedure implemented here predicts structures with good accuracy compared to experimental structures, and correctly demonstrates the correlation between the helical structure and the backbone conformation in DNA and RNA.",
                "authors": [
                    {
                        "name": "Alenaizan A."
                    },
                    {
                        "name": "Barnett J.L."
                    },
                    {
                        "name": "Hud N.V."
                    },
                    {
                        "name": "Sherrill C.D."
                    },
                    {
                        "name": "Petrov A.S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-11T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The proto-Nucleic Acid Builder: A software tool for constructing nucleic acid analogs"
            },
            "pmid": "33300028"
        }
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}