{
    "accessibility": "Open access",
    "additionDate": "2023-03-28T21:47:17.029267Z",
    "biotoolsCURIE": "biotools:stagewise",
    "biotoolsID": "stagewise",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "endelman@wisc.edu",
            "name": "Jeffrey B. Endelman",
            "orcidid": "http://orcid.org/0000-0003-0957-4337",
            "typeEntity": "Person"
        }
    ],
    "description": "Fully efficient, two-stage analysis of multi-environment trials with directional dominance and multi-trait genomic selection.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jendelman/StageWise",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:50:48.339297Z",
    "license": "GPL-3.0",
    "name": "StageWise",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/s00122-023-04298-x",
            "metadata": {
                "abstract": "Key message: R/StageWise enables fully efficient, two-stage analysis of multi-environment, multi-trait datasets for genomic selection, including support for dominance heterosis and polyploidy. Abstract: Plant breeders interested in genomic selection often face challenges to fully utilizing multi-trait, multi-environment datasets. R package StageWise was developed to go beyond the capabilities of most specialized software for genomic prediction, without requiring the programming skills needed for more general-purpose software for mixed models. As the name suggests, one of the core features is a fully efficient, two-stage analysis for multiple environments, in which the full variance–covariance matrix of the Stage 1 genotype means is used in Stage 2. Another feature is directional dominance, including for polyploids, to account for inbreeding depression in outbred crops. StageWise enables selection with multi-trait indices, including restricted indices with one or more traits constrained to have zero response. For a potato dataset with 943 genotypes evaluated over 6 years, including the Stage 1 errors in Stage 2 reduced the Akaike Information Criterion (AIC) by 29, 67, and 104 for maturity, yield, and fry color, respectively. The proportion of variation explained by heterosis was largest for yield but still only 0.03, likely because of limited variation for the genomic inbreeding coefficient. Due to the large additive genetic correlation (0.57) between yield and maturity, naïve selection on an index combining yield and fry color led to an undesirable response for later maturity. The restricted index coefficients to maximize genetic merit without delaying maturity were identified. The software and three vignettes are available at https://github.com/jendelman/StageWise.",
                "authors": [
                    {
                        "name": "Endelman J.B."
                    }
                ],
                "citationCount": 8,
                "date": "2023-04-01T00:00:00Z",
                "journal": "Theoretical and Applied Genetics",
                "title": "Fully efficient, two-stage analysis of multi-environment trials with directional dominance and multi-trait genomic selection"
            },
            "pmcid": "PMC10033618",
            "pmid": "36949348"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
