{
    "additionDate": "2018-05-28T09:43:52Z",
    "biotoolsCURIE": "biotools:sea-archive",
    "biotoolsID": "sea-archive",
    "credit": [
        {
            "email": "tyozhang@ems.hrbmu.edu.cn",
            "name": "Zhang Yan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Super-Enhancer Archive. Integrates super-enhancers in multiple species and annotates their potential roles in the regulation of cell identity gene expression.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "CpG island and isochore detection",
                    "uri": "http://edamontology.org/operation_0430"
                }
            ]
        }
    ],
    "homepage": "http://sea.edbc.org",
    "language": [
        "Java",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SEA",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gkv1243",
            "metadata": {
                "abstract": "© The Author(s) 2015.Super-enhancers are large clusters of transcriptional enhancers regarded as having essential roles in driving the expression of genes that control cell identity during development and tumorigenesis. The construction of a genome-wide super-enhancer database is urgently needed to better understand super-enhancer-directed gene expression regulation for a given biology process. Here, we present a specifically designed web-accessible database, Super-Enhancer Archive (SEA, http://sea.edbc.org). SEA focuses on integrating super-enhancers in multiple species and annotating their potential roles in the regulation of cell identity gene expression. The current release of SEA incorporates 83 996 superenhancers computationally or experimentally identified in 134 cell types/tissues/diseases, including human (75 439, three of which were experimentally identified), mouse (5879, five of which were experimentally identified), Drosophila melanogaster(1774) and Caenorhabditis elegans(904). To facilitate data extraction, SEA supports multiple search options, including species, genome location, gene name, cell type/tissue and super-enhancer name. The response provides detailed (epi)genetic information, incorporating cell type specificity, nearby genes, transcriptional factor binding sites, CRISPR/Cas9 target sites, evolutionary conservation, SNPs, H3K27ac, DNA methylation, gene expression and TF ChIP-seq data. Moreover, analytical tools and a genome browser were developed for users to explore superenhancers and their roles in defining cell identity and disease processes in depth.",
                "authors": [
                    {
                        "name": "Wei Y."
                    },
                    {
                        "name": "Zhang S."
                    },
                    {
                        "name": "Shang S."
                    },
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Su J."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 56,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SEA: A Super-enhancer Archive"
            },
            "pmcid": "PMC4702879",
            "pmid": "26578594"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        }
    ],
    "validated": 1
}