{
    "accessibility": "Open access",
    "additionDate": "2022-05-17T15:02:47.356289Z",
    "biotoolsCURIE": "biotools:sequencematrix",
    "biotoolsID": "sequencematrix",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "meier@nus.edu.sg",
            "name": "Rudolf Meier"
        },
        {
            "name": "David J. Lohman"
        },
        {
            "name": "Gaurav Vaidya"
        }
    ],
    "description": "Concatenation software for the fast assembly of multi-gene datasets with character set and codon information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://www.ggvaidya.com/taxondna/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-05-17T15:02:47.358993Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://taxondna.sourceforge.net"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/gaurav/taxondna"
        }
    ],
    "name": "SequenceMatrix",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1111/J.1096-0031.2010.00329.X",
            "metadata": {
                "abstract": "We present SequenceMatrix, software that is designed to facilitate the assembly and analysis of multi-gene datasets. Genes are concatenated by dragging and dropping FASTA, NEXUS, or TNT files with aligned sequences into the program window. A multi-gene dataset is concatenated and displayed in a spreadsheet; each sequence is represented by a cell that provides information on sequence length, number of indels, the number of ambiguous bases (\"Ns\"), and the availability of codon information. Alternatively, GenBank numbers for the sequences can be displayed and exported. Matrices with hundreds of genes and taxa can be concatenated within minutes and exported in TNT, NEXUS, or PHYLIP formats, preserving both character set and codon information for TNT and NEXUS files. SequenceMatrix also creates taxon sets listing taxa with a minimum number of characters or gene fragments, which helps assess preliminary datasets. Entire taxa, whole gene fragments, or individual sequences for a particular gene and species can be excluded from export. Data matrices can be re-split into their component genes and the gene fragments can be exported as individual gene files. SequenceMatrix also includes two tools that help to identify sequences that may have been compromised through laboratory contamination or data management error. One tool lists identical or near-identical sequences within genes, while the other compares the pairwise distance pattern of one gene against the pattern for all remaining genes combined. SequenceMatrix is Java-based and compatible with the Microsoft Windows, Apple MacOS X and Linux operating systems. The software is freely available from © The Willi Hennig Society 2010. © The Willi Hennig Society 2010.",
                "authors": [
                    {
                        "name": "Lohman D.J."
                    },
                    {
                        "name": "Meier R."
                    },
                    {
                        "name": "Vaidya G."
                    }
                ],
                "citationCount": 1348,
                "date": "2011-04-01T00:00:00Z",
                "journal": "Cladistics",
                "title": "SequenceMatrix: Concatenation software for the fast assembly of multi-gene datasets with character set and codon information"
            },
            "pmid": "34875773"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}
