{
    "additionDate": "2020-01-09T18:24:24Z",
    "biotoolsCURIE": "biotools:NLP",
    "biotoolsID": "NLP",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "patrickjward@uky.edu",
            "name": "Patrick J. Ward",
            "orcidid": "https://orcid.org/0000-0001-7331-1772",
            "typeEntity": "Person"
        }
    ],
    "description": "Enhancing timeliness of drug overdose mortality surveillance.\n\nDrug overdose classification using NLP.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'certificates', 'death certificates'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://github.com/pjward5656/dcnlp",
    "lastUpdate": "2020-01-09T18:24:24Z",
    "name": "NLP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0223318",
            "metadata": {
                "abstract": "© 2019 Ward et al.Background Timely data is key to effective public health responses to epidemics. Drug overdose deaths are identified in surveillance systems through ICD-10 codes present on death certificates. ICD-10 coding takes time, but free-text information is available on death certificates prior to ICD-10 coding. The objective of this study was to develop a machine learning method to classify free-text death certificates as drug overdoses to provide faster drug overdose mortality surveillance. Methods Using 2017-2018 Kentucky death certificate data, free-text fields were tokenized and features were created from these tokens using natural language processing (NLP). Word, bigram, and trigram features were created as well as features indicating the part-of-speech of each word. These features were then used to train machine learning classifiers on 2017 data. The resulting models were tested on 2018 Kentucky data and compared to a simple rule-based classification approach. Documented code for this method is available for reuse and extensions: https://github.com/pjward5656/dcnlp. Results The top scoring machine learning model achieved 0.96 positive predictive value (PPV) and 0.98 sensitivity for an F-score of 0.97 in identification of fatal drug overdoses on test data. This machine learning model achieved significantly higher performance for sensitivity (p<0.001) than the rule-based approach. Additional feature engineering may improve the model's prediction. This model can be deployed on death certificates as soon as the freetext is available, eliminating the time needed to code the death certificates. Conclusion Machine learning using natural language processing is a relatively new approach in the context of surveillance of health conditions. This method presents an accessible application of machine learning that improves the timeliness of drug overdose mortality surveillance. As such, it can be employed to inform public health responses to the drug overdose epidemic in near-real time as opposed to several weeks following events.",
                "authors": [
                    {
                        "name": "Ward P.J."
                    },
                    {
                        "name": "Rock P.J."
                    },
                    {
                        "name": "Slavova S."
                    },
                    {
                        "name": "Young A.M."
                    },
                    {
                        "name": "Bunn T.L."
                    },
                    {
                        "name": "Kavuluru R."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Enhancing timeliness of drug overdose mortality surveillance: A machine learning approach"
            },
            "pmcid": "PMC6795484",
            "pmid": "31618226"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}