{
    "additionDate": "2021-01-18T11:25:47Z",
    "biotoolsCURIE": "biotools:peppan",
    "biotoolsID": "peppan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Zhemin.Zhou@warwick.ac.uk",
            "name": "Zhemin Zhou",
            "orcidid": "https://orcid.org/0000-0001-9783-0366",
            "typeEntity": "Person"
        }
    ],
    "description": "Accurate reconstruction of bacterial pan- and core genomes with PEPPAN.\nPEPPAN (Phylogeny Enhanced Pipeline for PAN-genome) is a pipeline that can construct a pan-genome from thousands of genetically diversified bacterial genomes. PEPPAN implements a combination of tree- and synteny-based approaches to identify and exclude paralogous genes, as well as similarity-based gene predictions that support consistent annotations of genes and pseudogenes in individual genomes.\n\nThere are two final output files for PEPPAN:.\n\nThis file includes all pan-genes predicted by PEPPAN in GFF3 format. Intact CDSs are labeled as \"CDS\", disrupted genes (potential pseudogenes) are labeled as \"pseudogene\" and suspicious annotations ignored in the pipeline are labeled as \"misc_feature\" entries.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/zheminzhou/PEPPAN/blob/master/docs/source/usage/outputs.rst"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                },
                {
                    "term": "Rarefaction",
                    "uri": "http://edamontology.org/operation_3797"
                },
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Multilocus sequence typing",
                    "uri": "http://edamontology.org/operation_3840"
                },
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zheminzhou/PEPPAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T08:32:13Z",
    "license": "GPL-3.0",
    "name": "PEPPAN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1101/GR.260828.120",
            "metadata": {
                "abstract": "© 2020 Zhou et al. This article, published in Genome Research, is available under a Creative Commons License (Attribution 4.0 International), as described at http://creativecommons.org/licenses/by/4.0/.Bacterial genomes can contain traces of a complex evolutionary history, including extensive homologous recombination, gene loss, gene duplications, and horizontal gene transfer. To reconstruct the phylogenetic and population history of a set of multiple bacteria, it is necessary to examine their pangenome, the composite of all the genes in the set. Here we introduce PEPPAN, a novel pipeline that can reliably construct pangenomes from thousands of genetically diverse bacterial genomes that represent the diversity of an entire genus. PEPPAN outperforms existing pangenome methods by providing consistent gene and pseudogene annotations extended by similarity-based gene predictions, and identifying and excluding paralogs by combining tree- and synteny-based approaches. The PEPPAN package additionally includes PEPPAN_parser, which implements additional downstream analyses, including the calculation of trees based on accessory gene content or allelic differences between core genes. To test the accuracy of PEPPAN, we implemented SimPan, a novel pipeline for simulating the evolution of bacterial pangenomes. We compared the accuracy and speed of PEPPAN with four state-of-the-art pangenome pipelines using both empirical and simulated data sets. PEPPAN was more accurate and more specific than any of the other pipelines and was almost as fast as any of them. As a case study, we used PEPPAN to construct a pangenome of approximately 40,000 genes from 3052 representative genomes spanning at least 80 species of Streptococcus. The resulting gene and allelic trees provide an unprecedented overview of the genomic diversity of the entire Streptococcus genus.",
                "authors": [
                    {
                        "name": "Zhou Z."
                    },
                    {
                        "name": "Charlesworth J."
                    },
                    {
                        "name": "Achtman M."
                    }
                ],
                "citationCount": 1,
                "date": "2020-11-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Accurate reconstruction of bacterial pan- And core genomes with PEPPAN"
            },
            "pmcid": "PMC7605250",
            "pmid": "33055096"
        }
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}