{
    "additionDate": "2021-01-18T07:04:01Z",
    "biotoolsCURIE": "biotools:sharp",
    "biotoolsID": "sharp",
    "confidence_flag": "tool",
    "description": "Single-cell RNA-seq Hyper-fast and Accurate processing via ensemble Random Projection.\n\nSHARP, short for Single-cell RNA-seq Hyper-fast and Accurate processing via ensemble Random Projection, is a bioinformatics tool to process and analyze single-cell RNA-seq (scRNA-seq) data. Algorithmically, SHARP is based on ensemble random projection (RP) and multi-layer meta-clustering which can well preserve cell-to-cell distance in reduced-dimensional space. Compared to other existing tools, it has the following advantages:.\n\nNumber of Random-Projection Applications.\n\nProcessing 1.3 Million Single Cells.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/shibiaowan/SHARP",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-16T15:53:38Z",
    "name": "SHARP",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1101/GR.254557.119",
            "metadata": {
                "abstract": "© 2020 Wan et al. This article is distributed exclusively by Cold Spring Harbor Laboratory Press for the first six months after the full-issue publication date (see http://genome.cshlp.org/site/misc/terms.xhtml). After six months, it is available under a Creative Commons License (Attribution-NonCommercial 4.0 International), as described at http://creativecommons.org/licenses/by-nc/4.0/.To process large-scale single-cell RNA-sequencing (scRNA-seq) data effectively without excessive distortion during dimension reduction, we present SHARP, an ensemble random projection-based algorithm that is scalable to clustering 10 million cells. Comprehensive benchmarking tests on 17 public scRNA-seq data sets show that SHARP outperforms existing methods in terms of speed and accuracy. Particularly, for large-size data sets (more than 40,000 cells), SHARP runs faster than other competitors while maintaining high clustering accuracy and robustness. To the best of our knowledge, SHARP is the only R-based tool that is scalable to clustering scRNA-seq data with 10 million cells.",
                "authors": [
                    {
                        "name": "Wan S."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Won K.J."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "SharP: Hyperfast and accurate processing of single-cell RNA-seq data via ensemble random projection"
            },
            "pmcid": "PMC7050522",
            "pmid": "31992615"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}