{
    "additionDate": "2017-08-03T18:44:40Z",
    "biotoolsCURIE": "biotools:gr-align",
    "biotoolsID": "gr-align",
    "credit": [
        {
            "email": "natasa@cs.ucl.ac.uk",
            "name": "Nataša Pržulj",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.doc.ic.ac.uk/~natasha//index.html"
        }
    ],
    "description": "Fast heuristic procedure for aligning/comparing protein structures according to the Contact Map Opverlap maximization (CMO) paradigm. The algorithm is based on a Needleman-Wunch algorithm where the cost for matching two residues is their graphlet degree similarity.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www0.cs.ucl.ac.uk/staff/natasa/GR-Align/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://bio-nets.doc.ic.ac.uk/home/software/gralign/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/gr-align-aligning-protein-structures.html"
        }
    ],
    "name": "GR-Align",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Protein structure alignment is key for transferring information from well-studied proteins to less studied ones. Structural alignment identifies the most precise mapping of equivalent residues, as structures are more conserved during evolution than sequences. Among the methods for aligning protein structures, maximum Contact Map Overlap (CMO) has received sustained attention during the past decade. Yet, known algorithms exhibit modest performance and are not applicable for large-scale comparison. Results: Graphlets are small induced subgraphs that are used to design sensitive topological similarity measures between nodes and networks. By generalizing graphlets to ordered graphs, we introduce GR-Align, a CMO heuristic that is suited for database searches. On the Proteus-300 set (44 850 protein domain pairs), GR-Align is several orders of magnitude faster than the state-of-the-art CMO solvers Apurva, MSVNS and AlEigen7, and its similarity score is in better agreement with the structural classification of proteins. On a largescale experiment on the Gold-standard benchmark dataset (3 207 270 protein domain pairs), GR-Align is several orders of magnitude faster than the state-of-the-art protein structure comparison tools TM-Align, DaliLite, MATT and Yakusa, while achieving similar classification performances. Finally, we illustrate the difference between GR-Align's flexible alignments and the traditional ones by querying a flexible protein in the Astral-40 database (11 154 protein domains). In this experiment, GR-Align's top scoring alignments are not only in better agreement with structural classification of proteins, but also that they allow transferring more information across proteins. © The Author 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Malod-Dognin N."
                    },
                    {
                        "name": "Przulj N."
                    }
                ],
                "citationCount": 36,
                "date": "2014-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GR-Align: Fast and flexible alignment of protein 3D structures using graphlet degree similarity"
            },
            "pmid": "24443377"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1
}
