
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinfo.ncu.edu.cn/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/plmla-prediction-of-lysine-methylation-and-lysine-acetylation.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Phosphorylation is the most important post-translational modification in eukaryotes. Although many computational phosphorylation site prediction tools exist for mammals, and a few were created specifically for Arabidopsis thaliana, none are currently available for other plants.Results: In this article, we propose a novel random forest-based method called PHOSFER (PHOsphorylation Site FindER) for applying phosphorylation data from other organisms to enhance the accuracy of predictions in a target organism. As a test case, PHOSFER is applied to phosphorylation sites in soybean, and we show that it more accurately predicts soybean sites than both the existing Arabidopsis-specific predictors, and a simpler machine-learning scheme that uses only known phosphorylation sites and non-phosphorylation sites from soybean. In addition to soybean, PHOSFER will be extended to other organisms in the near future. © The Author 2013.",
            "authors": [
                "Trost B.",
                "Kusalik A."
            ],
            "cit_count": 32,
            "doi": "10.1093/bioinformatics/btt031",
            "journal": "Bioinformatics",
            "title": "Computational phosphorylation site prediction in plants using random forests and organism-specific instance weights",
            "type": "Primary",
            "year": "2013-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:plmla",
        "biotoolsID": "plmla",
        "description": "PLMLA is an in silico online tool for prediction of potential lysine methylation and lysine acetylation from protein sequences.",
        "homepage": "http://bioinfo.ncu.edu.cn/inquiries_PLMLA.aspx",
        "name": "PLMLA"
    }
}