{
    "accessibility": "Open access",
    "additionDate": "2023-02-28T19:17:24.628319Z",
    "biotoolsCURIE": "biotools:atgo",
    "biotoolsID": "atgo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dong-Jun Yu"
        },
        {
            "name": "Yi-Heng Zhu"
        },
        {
            "name": "Chengxin Zhang",
            "orcidid": "http://orcid.org/0000-0001-7290-1324"
        },
        {
            "name": "Yang Zhang",
            "orcidid": "http://orcid.org/0000-0002-2739-1916"
        }
    ],
    "description": "Integrating Self-Attention Transformer with Triplet Neural Networks for Protein Gene Ontology Prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "https://zhanggroup.org/ATGO/",
    "lastUpdate": "2023-02-28T19:17:24.630863Z",
    "name": "ATGO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1010793",
            "metadata": {
                "abstract": "© 2022 Zhu et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Accurate identification of protein function is critical to elucidate life mechanisms and design new drugs. We proposed a novel deep-learning method, ATGO, to predict Gene Ontology (GO) attributes of proteins through a triplet neural-network architecture embedded with pre-trained language models from protein sequences. The method was systematically tested on 1068 non-redundant benchmarking proteins and 3328 targets from the third Critical Assessment of Protein Function Annotation (CAFA) challenge. Experimental results showed that ATGO achieved a significant increase of the GO prediction accuracy compared to the state-of-the-art approaches in all aspects of molecular function, biological process, and cellular component. Detailed data analyses showed that the major advantage of ATGO lies in the utilization of pre-trained transformer language models which can extract discriminative functional pattern from the feature embeddings. Meanwhile, the proposed triplet network helps enhance the association of functional similarity with feature similarity in the sequence embedding space. In addition, it was found that the combination of the network scores with the complementary homology-based inferences could further improve the accuracy of the predicted models. These results demonstrated a new avenue for high-accuracy deep-learning function prediction that is applicable to large-scale protein function annotations from sequence alone.",
                "authors": [
                    {
                        "name": "Yu D.-J."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhu Y.-H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Integrating unsupervised language model with triplet neural networks for protein gene ontology prediction"
            },
            "pmcid": "PMC9822105",
            "pmid": "36548439"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
