{
    "accessibility": "Open access",
    "additionDate": "2023-03-20T23:24:43.645625Z",
    "biotoolsCURIE": "biotools:lights",
    "biotoolsID": "lights",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Christof Manuel Schönenberger"
        },
        {
            "name": "Julian Hirt"
        },
        {
            "name": "Matthias Briel"
        },
        {
            "name": "Stefan Schandelmaier"
        }
    ],
    "description": "Introducing the Library of Guidance for Health Scientists (LIGHTS).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://www.lights.science",
    "lastUpdate": "2024-11-24T14:52:22.994577Z",
    "name": "LIGHTS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1001/jamanetworkopen.2022.53198",
            "metadata": {
                "abstract": "Importance: Improving methodological quality is a priority in the health research community. Finding appropriate methods guidance can be challenging due to heterogeneous terminology, poor indexing in medical databases, and variation in formats. The Library of Guidance for Health Scientists (LIGHTS) is a new searchable database for methods guidance articles. Observations: Journal articles that aim to provide guidance for performing (including planning, design, conduct, analysis, and interpretation), reporting, and assessing the quality of health-related research involving humans or human populations (ie, excluding basic and animal research) are eligible for LIGHTS. A team of health researchers, information specialists, and methodologists continuously identifies and manually indexes eligible guidance documents. The search strategy includes focused searches of specific journals, specialized databases, and suggestions from researchers. A current limitation is that a keyword-based search of MEDLINE (and other general databases) and manual screening of records were not feasible because of the large number of hits (n = 915 523). As of September 20, 2022, LIGHTS included 1246 articles (336 reporting guidelines, 80 quality assessment tools, and 830 other methods guidance articles). The LIGHTS website provides a user-oriented search interface including filters for study type, specific methodological topic, research context, guidance type, and development process of the guidance. Automated matching of alternative methodological expressions (eg, enter loss to follow-up and find articles indexed with missing data) enhances search queries. Conclusions and Relevance: LIGHTS is a peer-supported initiative that is intended to increase access to and use of methods guidance relevant to health researchers, statisticians, methods consultants, methods developers, ethics boards, peer reviewers, journal editors, and funding bodies.",
                "authors": [
                    {
                        "name": "Agarwal A."
                    },
                    {
                        "name": "Bhattacharjee A."
                    },
                    {
                        "name": "Briel M."
                    },
                    {
                        "name": "Buljan I."
                    },
                    {
                        "name": "Chowdhury S.R."
                    },
                    {
                        "name": "Ewald H."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Germini F."
                    },
                    {
                        "name": "Guyatt G.H."
                    },
                    {
                        "name": "Hirt J."
                    },
                    {
                        "name": "Lawson D.O."
                    },
                    {
                        "name": "Lima J.P."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Marusic A."
                    },
                    {
                        "name": "Papola D."
                    },
                    {
                        "name": "Rohner R."
                    },
                    {
                        "name": "Schandelmaier S."
                    },
                    {
                        "name": "Schonenberger C.M."
                    },
                    {
                        "name": "Shahabinezhad A."
                    },
                    {
                        "name": "Suter K."
                    },
                    {
                        "name": "Zeng L."
                    }
                ],
                "citationCount": 3,
                "date": "2023-02-01T00:00:00Z",
                "journal": "JAMA network open",
                "title": "Introducing the Library of Guidance for Health Scientists (LIGHTS): A Living Database for Methods Guidance"
            },
            "pmid": "36787138"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}
