{"credit":[],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"}]}],"labels":{"topic":[{"term":"Medical imaging","uri":"http://edamontology.org/topic_3384"},{"term":"Allergy, clinical immunology and immunotherapeutics","uri":"http://edamontology.org/topic_3400"},{"term":"Personalised medicine","uri":"http://edamontology.org/topic_3577"},{"term":"Neurology","uri":"http://edamontology.org/topic_3334"},{"term":"Biobank","uri":"http://edamontology.org/topic_3337"}]},"publication":[{"abstract":"© 2019 American Headache SocietyBackground: The American Registry for Migraine Research (ARMR) is a multicenter, prospective, longitudinal patient registry, biorepository, and neuroimaging repository that collects clinical data, electronic health record (EHR) data, blood samples, and brain imaging data from individuals with migraine or other headache types. In this manuscript, we outline ARMR research methods and report baseline data describing an initial cohort of ARMR participants. Methods: Adults with any International Classification of Headache Disorders (ICHD) diagnosis were prospectively enrolled from one of the 8 participating headache specialty centers. At baseline, ARMR participants complete web-based questionnaires, clinicians enter the participant's ICHD diagnoses, an optional blood specimen is collected, and neuroimaging data are uploaded to the ARMR neuroimaging repository. Participants maintain the ARMR daily headache diary longitudinally and follow-up questionnaires are completed by participants every 3 months. EHR data are integrated into the ARMR database from a subset of ARMR sites. Herein, we describe the ARMR methodology and report the summary data from ARMR participants who had, from February 2016 to May 2019, completed at least 1 baseline questionnaire from which data are reported in this manuscript. Descriptive statistics are used to provide an overview of patient's sociodemographics, headache diagnoses, headache characteristics, most bothersome symptoms other than headache, headache-related disability, comorbidities, and treatments. Results: Data were available from 996 ARMR participants, enrolled from Mayo Clinic Arizona, Dartmouth-Hitchcock Medical Center, University of Utah, University of Colorado, Thomas Jefferson University, University of Texas Health Science Center at Houston, Georgetown University Medical Center, and DENT Neurological Institute. Among ARMR participants, 86.7% (n = 864) were female and the mean age at the time of enrollment was 48.6 years (±13.9; range 18-84). The most common provider-reported diagnosis was chronic migraine (n = 622), followed by migraine without aura (n = 327), migraine with aura (n = 196), and medication overuse headache (n = 65). Average headache frequency was 19.1 ± 9.2 days per month (n = 751), with 68% reporting at least 15 headache days per month. Sensitivity to light was the most frequent (n = 222) most bothersome symptom overall, other than headache, but when present, cognitive dysfunction was most frequently (n = 157) the most bothersome symptom other than headache. Average migraine disability assessment (MIDAS) score was 52 ± 49 (n = 760), (very severe headache-related disability); however, 17% of the ARMR population had MIDAS scores suggesting “no” or “mild” disability. The most common non-headache health issues were allergies (n = 364), back pain (n = 296), neck pain (n = 296), depression (n = 292), and anxiety (n = 278). Nearly 85% (n = 695) of patients were using preventive medications and 24.7% were using non-medication preventive therapy (eg, vitamins and neuromodulation). The most common preventive medication classes were neurotoxins, anticonvulsants, antidepressants, vitamins/supplements, and anticalcitonin gene-related peptide ligand or receptor-targeted monoclonal antibodies. Nearly 90% (n = 734) of ARMR participants was taking medications to treat migraine attacks, with the most common classes being triptans, non-steroidal anti-inflammatory drugs, antiemetics, acetaminophen, and combination analgesics. Conclusions: ARMR is a source of real-world patient data, biospecimens, and brain neuroimaging data that provides comprehensive insight into patients with migraine and other headache types being seen in headache specialty clinics in the United States. ARMR data will allow for longitudinal and advanced analytics that are expected to lead to a better characterization of patient heterogeneity, healthcare resource utilization, identification of endophenotypes, factors that predict treatment outcomes and clinical course, and ultimately advance the field toward precision headache medicine.","authors":["Schwedt T.J.","Digre K.","Tepper S.J.","Spare N.M.","Ailani J.","Birlea M.","Burish M.","Mechtler L.","Gottschalk C.","Quinn A.M.","McGillicuddy L.","Bance L.","Dumkrieger G.","Chong C.D.","Dodick D.W."],"cit_count":0,"doi":"10.1111/HEAD.13688","journal":"Headache","pmid":"31755111","title":"The American Registry for Migraine Research: Research Methods and Baseline Data for an Initial Patient Cohort","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:ARMR","biotoolsID":"ARMR","description":"Research Methods and Baseline Data for an Initial Patient Cohort.\n\nThe American Registry for Migraine Research (ARMR).\n\nThe American Migraine Foundation (AMF) is a non-profit organization dedicated to the advancement of research and awareness surrounding migraine.\n\nThe American Migraine Foundation (AMF) is a non-profit organization dedicated to the advancement of research and awareness surrounding migraine.\n\nLearn more about the American Registry for Migraine Research.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'American Registry Migraine Research'","homepage":"http://www.armr.org","name":"ARMR"}}