{
    "accessibility": "Open access",
    "additionDate": "2023-01-26T23:40:38.810926Z",
    "biotoolsCURIE": "biotools:fdalabel",
    "biotoolsID": "fdalabel",
    "collectionID": [
        "RD-Candidate"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "p.johann@kitz-heidelberg.de",
            "name": "Pascal Johann",
            "orcidid": "https://orcid.org/0000-0002-8857-6148",
            "typeEntity": "Person"
        },
        {
            "name": "Dominic Lenz"
        },
        {
            "name": "Markus Ries"
        }
    ],
    "description": "The FDALabel Database is a web-based application used to perform customizable searches of over 140,000 human prescription, biological, over-the-counter (OTC), and animal drug labeling documents.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://nctr-crs.fda.gov/fdalabel/ui/search",
    "lastUpdate": "2023-01-26T23:40:38.814303Z",
    "name": "FDALabel",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0252924",
            "metadata": {
                "abstract": "Copyright: © 2021 Johann et al.Background Glioblastoma (GBM) is the most common malignant brain tumour among adult patients and represents an almost universally fatal disease. Novel therapies for GBM are being developed under the orphan drug legislation and the knowledge on the molecular makeup of this disease has been increasing rapidly. However, the clinical outcomes in GBM patients with currently available therapies are still dismal. An insight into the current drug development pipeline for GBM is therefore of particular interest. Objectives To provide a quantitative clinical-regulatory insight into the status of FDA orphan drug designations for compounds intended to treat GBM. Methods Quantitative cross-sectional analysis of the U.S. Food and Drug Administration Orphan Drug Product database between 1983 and 2020. STROBE criteria were respected. Results Four orphan drugs out of 161 (2,4%) orphan drug designations were approved for the treatment for GBM by the FDA between 1983 and 2020. Fourteen orphan drug designations were subsequently withdrawn for unknown reasons. The number of orphan drug designations per year shows a growing trend. In the last decade, the therapeutic mechanism of action of designated compounds intended to treat glioblastoma shifted from cytotoxic drugs (median year of designation 2008) to immunotherapeutic approaches and small molecules (median year of designation 2014 and 2015 respectively) suggesting an increased focus on precision in the therapeutic mechanism of action for compounds the development pipeline. Conclusion Despite the fact that current pharmacological treatment options in GBM are sparse, the drug development pipeline is steadily growing. In particular, the surge of designated immunotherapies detected in the last years raises the hope that elaborate combination possibilities between classical therapeutic backbones (radiotherapy and chemotherapy) and novel, currently experimental therapeutics may help to provide better therapies for this deadly disease in the future.",
                "authors": [
                    {
                        "name": "Johann P."
                    },
                    {
                        "name": "Lenz D."
                    },
                    {
                        "name": "Ries M."
                    }
                ],
                "citationCount": 2,
                "date": "2021-07-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "The drug development pipeline for glioblastoma—A cross sectional assessment of the FDA Orphan Drug Product designation database"
            },
            "pmcid": "PMC8263276",
            "pmid": "34234357"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Pharmacovigilance",
            "uri": "http://edamontology.org/topic_3378"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
