{
    "additionDate": "2017-12-18T00:06:28Z",
    "biotoolsCURIE": "biotools:fastmap",
    "biotoolsID": "fastmap",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://comptox.unc.edu/"
        }
    ],
    "description": "It is used for fast and efficient eQTL mapping in homozygous inbred populations with binary allele calls. It exploits the discrete nature and structure of the measured single nucleotide polymorphisms. SNPs are organized into a Hamming distance-based tree. Its tree can be used to perform both single marker mapping and haplotype association mapping over an m-SNP window. These performance enhancements also permit permutation-based significance testing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://comptox.unc.edu/fastmap.php",
    "homepage_status": 2,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/fastmap-2-0-fast-association-mapping-heterozygous-populations.html"
        }
    ],
    "name": "FastMap",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btn648",
            "metadata": {
                "abstract": "Motivation: Gene expression Quantitative Trait Locus (eQTL) mapping measures the association between transcript expression and genotype in order to find genomic locations likely to regulate transcript expression. The availability of both gene expression and high-density genotype data has improved our ability to perform eQTL mapping in inbred mouse and other homozygous populations. However, existing eQTL mapping software does not scale well when the number of transcripts and markers are on the order of 105 and 105 - 106, respectively. Results: We propose a new method, FastMap, for fast and efficient eQTL mapping in homozygous inbred populations with binary allele calls. FastMap exploits the discrete nature and structure of the measured single nucleotide polymorphisms (SNPs). In particular, SNPs are organized into a Hamming distance-based tree that minimizes the number of arithmetic operations required to calculate the association of a SNP by making use of the association of its parent SNP in the tree. FastMap's tree can be used to perform both single marker mapping and haplotype association mapping over an m -SNP window. These performance enhancements also permit permutation-based significance testing. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Gatti D.M."
                    },
                    {
                        "name": "Shabalin A.A."
                    },
                    {
                        "name": "Lam T.-C."
                    },
                    {
                        "name": "Wright F.A."
                    },
                    {
                        "name": "Rusyn I."
                    },
                    {
                        "name": "Nobel A.B."
                    }
                ],
                "citationCount": 27,
                "date": "2009-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FastMap: Fast eQTL mapping in homozygous populations"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "SNP",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}