{
    "accessibility": "Open access",
    "additionDate": "2022-05-17T18:10:14.718998Z",
    "biotoolsCURIE": "biotools:quickpiv",
    "biotoolsID": "quickpiv",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "pereyra@fias.uni-frankfurt.de",
            "name": "Marc Pereyra",
            "orcidid": "https://orcid.org/0000-0002-3496-7207",
            "typeEntity": "Person"
        },
        {
            "name": "Ernst H. K. Stelzer"
        },
        {
            "name": "Franziska Matthäus"
        }
    ],
    "description": "Efficient 3D particle image velocimetry software applied to quantifying cellular migration during embryogenesis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                },
                {
                    "term": "Single particle alignment and classification",
                    "uri": "http://edamontology.org/operation_3458"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Marc-3d/quickPIV",
    "language": [
        "Julia"
    ],
    "lastUpdate": "2022-05-17T18:10:14.721344Z",
    "license": "MIT",
    "name": "quickPIV",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04474-0",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The technical development of imaging techniques in life sciences has enabled the three-dimensional recording of living samples at increasing temporal resolutions. Dynamic 3D data sets of developing organisms allow for time-resolved quantitative analyses of morphogenetic changes in three dimensions, but require efficient and automatable analysis pipelines to tackle the resulting Terabytes of image data. Particle image velocimetry (PIV) is a robust and segmentation-free technique that is suitable for quantifying collective cellular migration on data sets with different labeling schemes. This paper presents the implementation of an efficient 3D PIV package using the Julia programming language—quickPIV. Our software is focused on optimizing CPU performance and ensuring the robustness of the PIV analyses on biological data. Results: QuickPIV is three times faster than the Python implementation hosted in openPIV, both in 2D and 3D. Our software is also faster than the fastest 2D PIV package in openPIV, written in C++. The accuracy evaluation of our software on synthetic data agrees with the expected accuracies described in the literature. Additionally, by applying quickPIV to three data sets of the embryogenesis of Tribolium castaneum, we obtained vector fields that recapitulate the migration movements of gastrulation, both in nuclear and actin-labeled embryos. We show normalized squared error cross-correlation to be especially accurate in detecting translations in non-segmentable biological image data. Conclusions: The presented software addresses the need for a fast and open-source 3D PIV package in biological research. Currently, quickPIV offers efficient 2D and 3D PIV analyses featuring zero-normalized and normalized squared error cross-correlations, sub-pixel/voxel approximation, and multi-pass. Post-processing options include filtering and averaging of the resulting vector fields, extraction of velocity, divergence and collectiveness maps, simulation of pseudo-trajectories, and unit conversion. In addition, our software includes functions to visualize the 3D vector fields in Paraview.",
                "authors": [
                    {
                        "name": "Drusko A."
                    },
                    {
                        "name": "Kramer F."
                    },
                    {
                        "name": "Matthaus F."
                    },
                    {
                        "name": "Pereyra M."
                    },
                    {
                        "name": "Stelzer E.H.K."
                    },
                    {
                        "name": "Strobl F."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "QuickPIV: Efficient 3D particle image velocimetry software applied to quantifying cellular migration during embryogenesis"
            },
            "pmcid": "PMC8642913",
            "pmid": "34863116"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
