{"credit":[{"name":"DRCAT","typeEntity":"Project","typeRoles":["Documentor"]},{"email":"mauno.vihinen@med.lu.se","name":"Mauno Vihinen","typeEntity":"Person","typeRoles":[],"url":"http://structure.bmc.lu.se/"}],"documentation":[{"type":"GENERAL","url":"http://structure.bmc.lu.se/idbase/administration/idbases_how_to_cite.php"}],"function":[{"input":[{"data":{"term":"Gene identifier","uri":"http://edamontology.org/data_1025"}},{"data":{"term":"Sequence accession (nucleic acid)","uri":"http://edamontology.org/data_1097"}}],"operation":[{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"}],"output":[{"data":{"term":"Sequence variations","uri":"http://edamontology.org/data_3498"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"}]}]}],"labels":{"collectionID":["DRCAT"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Pathology","uri":"http://edamontology.org/topic_0634"}]},"publication":[{"abstract":"Primary immunodeficiencies (IDs) are a heterogenic group of inherited disorders of the immune system. Immunodeficiency patients have increased susceptibility to recurrent and persistent, even life-threatening infections. Mutations in a large number of genes can cause defects in different cellular functions and lead to impaired immune response. To date, approximately 150 IDs and more than 100 affected genes have been identified. ID-related genes are distributed throughout the genome, and diseases can be inherited in an X-linked, an autosomal recessive, or an autosomal dominant way. We have collected ID mutation data into locus-specific patient-related mutation databases, IDbases (http://bioinf.uta.fi/IDbases). Mutations are described at DNA, mRNA, and protein levels with links to reference sequences and reference articles. The mutation data has been collated into entries along with some clinical information. IDbases offer an easy way, e.g., to find recently identified mutations, to reveal genotype-phenotype correlations, and to discover a specific mutation or to examine the most common mutations in a single immunodeficiency related gene. At the moment we have databases for 107 ID genes with 4,140 public patient entries. An exhaustive statistical analysis of mutation data from the IDbases was made. Missense and nonsense mutations are the most common mutation types, and the most common single substitution is a nonsense mutation from tryptophan to a stop codon. Arginine is the most mutated as well as the most abundant mutant amino acid. © 2006 Wiley-Liss, Inc.","authors":["Piirila H.","Valiaho J.","Vihinen M."],"cit_count":89,"doi":"10.1002/humu.20405","journal":"Human Mutation","pmid":"17004234","title":"Immunodeficiency mutation databases (IDbases)","type":"Primary","year":"2006-12-01"}],"summary":{"biotoolsCURIE":"biotools:idbases","biotoolsID":"idbases","description":"Locus-specific databases for immunodeficiency-causing mutations.","homepage":"http://structure.bmc.lu.se/idbase/","name":"Immunodeficiency mutation databases (IDbases)"}}