{
    "additionDate": "2017-08-03T19:06:08Z",
    "biotoolsCURIE": "biotools:idrug-target",
    "biotoolsID": "idrug-target",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "name": "Xuan Xiao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "By means of the approach of optimizing training datasets, this webserver was developed for predicting drug-target interaction. It contains four predictors: iDrug-GPCR, iDrug-Chl, iDrug-Ezy, and iDrug-NR, specialized for indentying the interactions of drug compounds with GPCRs (G protein-coupled receptors), ion channels, enzymes, and NR (nuclear receptors), respectively.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/iDrug-Target/readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iDrug-Target/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/idrug-target-web-services-for-predicting-drug-target-interaction.html"
        }
    ],
    "name": "iDrug-Target",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 © 2015 Taylor & Francis.Information about the interactions of drug compounds with proteins in cellular networking is very important for drug development. Unfortunately, all the existing predictors for identifying drug-protein interactions were trained by a skewed benchmark data-set where the number of non-interactive drug-protein pairs is overwhelmingly larger than that of the interactive ones. Using this kind of highly unbalanced benchmark data-set to train predictors would lead to the outcome that many interactive drug-protein pairs might be mispredicted as non-interactive. Since the minority interactive pairs often contain the most important information for drug design, it is necessary to minimize this kind of misprediction. In this study, we adopted the neighborhood cleaning rule and synthetic minority over-sampling technique to treat the skewed benchmark datasets and balance the positive and negative subsets. The new benchmark datasets thus obtained are called the optimized benchmark datasets, based on which a new predictor called iDrug-Target was developed that contains four sub-predictors: iDrug-GPCR, iDrug-Chl, iDrug-Ezy, and iDrug-NR, specialized for identifying the interactions of drug compounds with GPCRs (G-protein-coupled receptors), ion channels, enzymes, and NR (nuclear receptors), respectively. Rigorous cross-validations on a set of experiment-confirmed datasets have indicated that these new predictors remarkably outperformed the existing ones for the same purpose. To maximize users convenience, a public accessible Web server for iDrug-Target has been established at http://www.jci-bioinfo.cn/iDrug-Target/, by which users can easily get their desired results. It has not escaped our notice that the aforementioned strategy can be widely used in many other areas as well.",
                "authors": [
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Chou K.-C."
                    },
                    {
                        "name": "Lin W.-Z."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Min J.-L."
                    },
                    {
                        "name": "Xiao X."
                    }
                ],
                "citationCount": 169,
                "date": "2015-10-03T00:00:00Z",
                "journal": "Journal of Biomolecular Structure and Dynamics",
                "title": "IDrug-Target: Predicting the interactions between drug compounds and target proteins in cellular networking via benchmark dataset optimization approach"
            },
            "pmid": "25513722"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
