{
    "additionDate": "2021-03-19T08:33:47Z",
    "biotoolsCURIE": "biotools:snf-nn",
    "biotoolsID": "snf-nn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rsalhajj@gmail.com",
            "name": "Reda Alhajj",
            "typeEntity": "Person"
        }
    ],
    "description": "computational method to predict drug-disease interactions using similarity network fusion and neural networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://pages.cpsc.ucalgary.ca/~tnjarada/snf-nn.php",
    "lastUpdate": "2021-04-09T10:43:38.101676Z",
    "name": "SNF-NN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03950-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Drug repositioning is an emerging approach in pharmaceutical research for identifying novel therapeutic potentials for approved drugs and discover therapies for untreated diseases. Due to its time and cost efficiency, drug repositioning plays an instrumental role in optimizing the drug development process compared to the traditional de novo drug discovery process. Advances in the genomics, together with the enormous growth of large-scale publicly available data and the availability of high-performance computing capabilities, have further motivated the development of computational drug repositioning approaches. More recently, the rise of machine learning techniques, together with the availability of powerful computers, has made the area of computational drug repositioning an area of intense activities. Results: In this study, a novel framework SNF-NN based on deep learning is presented, where novel drug-disease interactions are predicted using drug-related similarity information, disease-related similarity information, and known drug-disease interactions. Heterogeneous similarity information related to drugs and disease is fed to the proposed framework in order to predict novel drug-disease interactions. SNF-NN uses similarity selection, similarity network fusion, and a highly tuned novel neural network model to predict new drug-disease interactions. The robustness of SNF-NN is evaluated by comparing its performance with nine baseline machine learning methods. The proposed framework outperforms all baseline methods (AUC- ROC = 0.867, and AUC- PR=0.876) using stratified 10-fold cross-validation. To further demonstrate the reliability and robustness of SNF-NN, two datasets are used to fairly validate the proposed framework’s performance against seven recent state-of-the-art methods for drug-disease interaction prediction. SNF-NN achieves remarkable performance in stratified 10-fold cross-validation with AUC- ROC ranging from 0.879 to 0.931 and AUC- PR from 0.856 to 0.903. Moreover, the efficiency of SNF-NN is verified by validating predicted unknown drug-disease interactions against clinical trials and published studies. Conclusion: In conclusion, computational drug repositioning research can significantly benefit from integrating similarity measures in heterogeneous networks and deep learning models for predicting novel drug-disease interactions. The data and implementation of SNF-NN are available at http://pages.cpsc.ucalgary.ca/ tnjarada/snf-nn.php.",
                "authors": [
                    {
                        "name": "Jarada T.N."
                    },
                    {
                        "name": "Rokne J.G."
                    },
                    {
                        "name": "Alhajj R."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SNF-NN: computational method to predict drug-disease interactions using similarity network fusion and neural networks"
            },
            "pmcid": "PMC7821180",
            "pmid": "33482713"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ]
}