{
    "additionDate": "2021-01-18T09:39:05Z",
    "biotoolsCURIE": "biotools:deepbrainnet",
    "biotoolsID": "deepbrainnet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "Vishnu.Bashyam@pennmedicine.upenn.edu",
            "name": "Vishnu M Bashyam",
            "typeEntity": "Person",
            "url": "https://www.med.upenn.edu/cbica/"
        },
        {
            "email": "Christos.Davatzikos@pennmedicine.upenn.edu",
            "name": "Christos Davatzikos",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepBrainNet is a convolutional Neural Network trained for age prediction using a large set of MRI scans from a highly diversified cohort spanning different studies, scanners, ages, ethnicities and geographic locations around the world.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vishnubashyam/DeepBrainNet",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-02-24T15:31:09Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://upenn.app.box.com/v/DeepBrainNet"
        }
    ],
    "name": "DeepBrainNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BRAIN/AWAA160",
            "metadata": {
                "abstract": "© The Author(s) (2020). Published by Oxford University Press on behalf of the Guarantors of Brain. All rights reserved.Deep learning has emerged as a powerful approach to constructing imaging signatures of normal brain ageing as well as of various neuropathological processes associated with brain diseases. In particular, MRI-derived brain age has been used as a comprehensive biomarker of brain health that can identify both advanced and resilient ageing individuals via deviations from typical brain ageing. Imaging signatures of various brain diseases, including schizophrenia and Alzheimer's disease, have also been identified using machine learning. Prior efforts to derive these indices have been hampered by the need for sophisticated and not easily reproducible processing steps, by insufficiently powered or diversified samples from which typical brain ageing trajectories were derived, and by limited reproducibility across populations and MRI scanners. Herein, we develop and test a sophisticated deep brain network (DeepBrainNet) using a large (n = 11 729) set of MRI scans from a highly diversified cohort spanning different studies, scanners, ages and geographic locations around the world. Tests using both cross-validation and a separate replication cohort of 2739 individuals indicate that DeepBrainNet obtains robust brain-age estimates from these diverse datasets without the need for specialized image data preparation and processing. Furthermore, we show evidence that moderately fit brain ageing models may provide brain age estimates that are most discriminant of individuals with pathologies. This is not unexpected as tightly-fitting brain age models naturally produce brain-age estimates that offer little information beyond age, and loosely fitting models may contain a lot of noise. Our results offer some experimental evidence against commonly pursued tightly-fitting models. We show that the moderately fitting brain age models obtain significantly higher differentiation compared to tightly-fitting models in two of the four disease groups tested. Critically, we demonstrate that leveraging DeepBrainNet, along with transfer learning, allows us to construct more accurate classifiers of several brain diseases, compared to directly training classifiers on patient versus healthy control datasets or using common imaging databases such as ImageNet. We, therefore, derive a domain-specific deep network likely to reduce the need for application-specific adaptation and tuning of generic deep learning networks. We made the DeepBrainNet model freely available to the community for MRI-based evaluation of brain health in the general population and over the lifespan.",
                "authors": [
                    {
                        "name": "Bashyam V.M."
                    },
                    {
                        "name": "Erus G."
                    },
                    {
                        "name": "Doshi J."
                    },
                    {
                        "name": "Habes M."
                    },
                    {
                        "name": "Nasralah I."
                    },
                    {
                        "name": "Truelove-Hill M."
                    },
                    {
                        "name": "Srinivasan D."
                    },
                    {
                        "name": "Mamourian L."
                    },
                    {
                        "name": "Pomponio R."
                    },
                    {
                        "name": "Fan Y."
                    },
                    {
                        "name": "Launer L.J."
                    },
                    {
                        "name": "Masters C.L."
                    },
                    {
                        "name": "Maruff P."
                    },
                    {
                        "name": "Zhuo C."
                    },
                    {
                        "name": "Volzke H."
                    },
                    {
                        "name": "Johnson S.C."
                    },
                    {
                        "name": "Fripp J."
                    },
                    {
                        "name": "Koutsouleris N."
                    },
                    {
                        "name": "Satterthwaite T.D."
                    },
                    {
                        "name": "Wolf D."
                    },
                    {
                        "name": "Gur R.E."
                    },
                    {
                        "name": "Gur R.C."
                    },
                    {
                        "name": "Morris J."
                    },
                    {
                        "name": "Albert M.S."
                    },
                    {
                        "name": "Grabe H.J."
                    },
                    {
                        "name": "Resnick S."
                    },
                    {
                        "name": "Nick Bryan R."
                    },
                    {
                        "name": "Wolk D.A."
                    },
                    {
                        "name": "Shou H."
                    },
                    {
                        "name": "Davatzikos C."
                    }
                ],
                "citationCount": 19,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Brain",
                "title": "MRI signatures of brain age and disease over the lifespan based on a deep brain network and 14 468 individuals worldwide"
            },
            "pmcid": "PMC7364766",
            "pmid": "32591831"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}