{
    "additionDate": "2019-11-14T19:32:40Z",
    "biotoolsCURIE": "biotools:segclust2d",
    "biotoolsID": "segclust2d",
    "confidence_flag": "tool",
    "description": "Identifying stationary phases in multivariate time series for highlighting behavioural modes and home range settlements | Bivariate Segmentation/Clustering Methods and Tools | Provides two methods for segmentation and joint segmentation clustering of bivariate time-series",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Cell migration analysis",
                    "uri": "http://edamontology.org/operation_3446"
                }
            ]
        }
    ],
    "homepage": "http://cran.r-project.org/package=segclust2d",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-19T14:39:54Z",
    "license": "GPL-3.0",
    "name": "segclust2d",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/1365-2656.13105",
            "metadata": {
                "abstract": "© 2019 The Authors. Journal of Animal Ecology © 2019 British Ecological SocietyRecent advances in biologging open promising perspectives in the study of animal movements at numerous scales. It is now possible to record time series of animal locations and ancillary data (e.g. activity level derived from on-board accelerometers) over extended areas and long durations with a high spatial and temporal resolution. Such time series are often piecewise stationary, as the animal may alternate between different stationary phases (i.e. characterized by a specific mean and variance of some key parameter for limited periods). Identifying when these phases start and end is a critical first step to understand the dynamics of the underlying movement processes. We introduce a new segmentation-clustering method we called segclust2d (available as a r package at cran.r-project.org/package=segclust2d). It can segment bivariate (or more generally multivariate) time series and possibly cluster the various segments obtained, corresponding to different phases assumed to be stationary. This method is easy to use, as it only requires specifying a minimum segment length (to prevent over-segmentation), based on biological rather than statistical considerations. This method can be applied to bivariate piecewise time series of any nature. We focus here on two types of time series related to animal movement, corresponding to (a) at large scale, series of bivariate coordinates of relocations, to highlight temporary home ranges, and (b) at smaller scale, bivariate series derived from relocations data, such as speed and turning angle, to highlight different behavioural modes such as transit, feeding and resting. Using computer simulations, we show that segclust2d can rival and even outperform previous, more complex methods, which were specifically developed to highlight changes of movement modes or home range shifts (based on hidden Markov and Ornstein–Uhlenbeck modelling), which, contrary to our method, usually require the user to provide relevant initial guesses to be efficient. Furthermore, we demonstrate it on actual examples involving a zebra's small-scale movements and an elephant's large-scale movements, to illustrate how various movement modes and home range shifts, respectively, can be identified.",
                "authors": [
                    {
                        "name": "Patin R."
                    },
                    {
                        "name": "Etienne M.-P."
                    },
                    {
                        "name": "Lebarbier E."
                    },
                    {
                        "name": "Chamaille-Jammes S."
                    },
                    {
                        "name": "Benhamou S."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Animal Ecology",
                "title": "Identifying stationary phases in multivariate time series for highlighting behavioural modes and home range settlements"
            },
            "pmid": "31539165"
        }
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}