{
    "additionDate": "2017-01-17T15:08:22Z",
    "biotoolsCURIE": "biotools:great",
    "biotoolsID": "great",
    "collectionID": [
        "ELIXIR Trainer Tools"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bejerano.stanford.edu/help/display/GREAT/Contact+Us"
        }
    ],
    "description": "Predicts functions of cis-regulatory regions. Many coding genes are well annotated with their biological functions. Non-coding regions typically lack such annotation. It assigns biological meaning to a set of non-coding genomic regions by analyzing the annotations of the nearby genes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bejerano.stanford.edu/help/display/GREAT"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://bejerano.stanford.edu/great/public/html/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "GREAT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "training_go_import",
    "publication": [
        {
            "doi": "10.1038/nbt.1630",
            "metadata": {
                "abstract": "We developed the Genomic Regions Enrichment of Annotations Tool (GREAT) to analyze the functional significance of cis-regulatory regions identified by localized measurements of DNA binding events across an entire genome. Whereas previous methods took into account only binding proximal to genes, GREAT is able to properly incorporate distal binding sites and control for false positives using a binomial test over the input genomic regions. GREAT incorporates annotations from 20 ontologies and is available as a web application. Applying GREAT to data sets from chromatin immunoprecipitation coupled with massively parallel sequencing (ChIP-seq) of multiple transcription-associated factors, including SRF, NRSF, GABP, Stat3 and p300 in different developmental contexts, we recover many functions of these factors that are missed by existing gene-based tools, and we generate testable hypotheses. The utility of GREAT is not limited to ChIP-seq, as it could also be applied to open chromatin, localized epigenomic markers and similar functional data sets, as well as comparative genomics sets. © 2010 Nature America, Inc. All rights reserved.",
                "authors": [
                    {
                        "name": "McLean C.Y."
                    },
                    {
                        "name": "Bristor D."
                    },
                    {
                        "name": "Hiller M."
                    },
                    {
                        "name": "Clarke S.L."
                    },
                    {
                        "name": "Schaar B.T."
                    },
                    {
                        "name": "Lowe C.B."
                    },
                    {
                        "name": "Wenger A.M."
                    },
                    {
                        "name": "Bejerano G."
                    }
                ],
                "citationCount": 1239,
                "date": "2010-05-01T00:00:00Z",
                "journal": "Nature Biotechnology",
                "title": "GREAT improves functional interpretation of cis-regulatory regions"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ],
    "validated": 1
}