{
    "additionDate": "2021-01-18T09:10:24Z",
    "biotoolsCURIE": "biotools:pinet",
    "biotoolsID": "pinet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mellerj@ucmail.uc.edu",
            "name": "Jarek Meller",
            "orcidid": "https://orcid.org/0000-0002-1162-8253",
            "typeEntity": "Person"
        }
    ],
    "description": "a versatile web platform for downstream analysis and visualization of proteomics data.\n\nPiNET server is a server for mapping and annotaion of protein peptides.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.pinet-server.org/pinet/peptideToProtein",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-03-20T13:27:30Z",
    "name": "piNET",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA436",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.Rapid progress in proteomics and large-scale profiling of biological systems at the protein level necessitates the continued development of efficient computational tools for the analysis and interpretation of proteomics data. Here, we present the piNET server that facilitates integrated annotation, analysis and visualization of quantitative proteomics data, with emphasis on PTM networks and integration with the LINCS library of chemical and genetic perturbation signatures in order to provide further mechanistic and functional insights. The primary input for the server consists of a set of peptides or proteins, optionally with PTM sites, and their corresponding abundance values. Several interconnected workflows can be used to generate: (i) interactive graphs and tables providing comprehensive annotation and mapping between peptides and proteins with PTM sites; (ii) high resolution and interactive visualization for enzyme-substrate networks, including kinases and their phospho-peptide targets; (iii) mapping and visualization of LINCS signature connectivity for chemical inhibitors or genetic knockdown of enzymes upstream of their target PTM sites. piNET has been built using a modular Spring-Boot Java platform as a fast, versatile and easy to use tool. The Apache Lucene indexing is used for fast mapping of peptides into UniProt entries for the human, mouse and other commonly used model organism proteomes. PTM-centric network analyses combine PhosphoSitePlus, iPTMnet and SIGNOR databases of validated enzyme-substrate relationships, for kinase networks augmented by DeepPhos predictions and sequence-based mapping of PhosphoSitePlus consensus motifs. Concordant LINCS signatures are mapped using iLINCS. For each workflow, a RESTful API counterpart can be used to generate the results programmatically in the json format. The server is available at http://pinet-server.org, and it is free and open to all users without login requirement.",
                "authors": [
                    {
                        "name": "Shamsaei B."
                    },
                    {
                        "name": "Chojnacki S."
                    },
                    {
                        "name": "Pilarczyk M."
                    },
                    {
                        "name": "Najafabadi M."
                    },
                    {
                        "name": "Niu W."
                    },
                    {
                        "name": "Chen C."
                    },
                    {
                        "name": "Ross K."
                    },
                    {
                        "name": "Matlock A."
                    },
                    {
                        "name": "Muhlich J."
                    },
                    {
                        "name": "Chutipongtanate S."
                    },
                    {
                        "name": "Zheng J."
                    },
                    {
                        "name": "Turner J."
                    },
                    {
                        "name": "Vidovic D."
                    },
                    {
                        "name": "Jaffe J."
                    },
                    {
                        "name": "MacCoss M."
                    },
                    {
                        "name": "Wu C."
                    },
                    {
                        "name": "Pillai A."
                    },
                    {
                        "name": "Ma'ayan A."
                    },
                    {
                        "name": "Schurer S."
                    },
                    {
                        "name": "Kouril M."
                    },
                    {
                        "name": "Medvedovic M."
                    },
                    {
                        "name": "Meller J."
                    }
                ],
                "citationCount": 2,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "piNET: A versatile web platform for downstream analysis and visualization of proteomics data"
            },
            "pmcid": "PMC7319557",
            "pmid": "32469073"
        }
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ]
}