{
    "additionDate": "2021-01-18T11:17:35Z",
    "biotoolsCURIE": "biotools:nl4dv",
    "biotoolsID": "nl4dv",
    "confidence_flag": "tool",
    "description": "A Toolkit for Generating Analytic Specifications for Data Visualization from Natural Language Queries.\n\nNL4DV is a Python toolkit that takes a natural language (NL) query about a given dataset as input and outputs a structured JSON object containing Data attributes, Analytic tasks, and Visualizations (Vega-Lite specifications).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://nl4dv.github.io/nl4dv/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T14:08:05Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://nl4dv.github.io/nl4dv/showcase.html"
        }
    ],
    "name": "NL4DV",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1109/TVCG.2020.3030378",
            "metadata": {
                "abstract": "© 1995-2012 IEEE.Natural language interfaces (NLls) have shown great promise for visual data analysis, allowing people to flexibly specify and interact with visualizations. However, developing visualization NLIs remains a challenging task, requiring low-level implementation of natural language processing (NLP) techniques as well as knowledge of visual analytic tasks and visualization design. We present NL4DV, a toolkit for natural language-driven data visualization. NL4DV is a Python package that takes as input a tabular dataset and a natural language query about that dataset. In response, the toolkit returns an analytic specification modeled as a JSON object containing data attributes, analytic tasks, and a list of Vega-Lite specifications relevant to the input query. In doing so, NL4DV aids visualization developers who may not have a background in NLP, enabling them to create new visualization NLIs or incorporate natural language input within their existing systems. We demonstrate NL4DV's usage and capabilities through four examples: 1) rendering visualizations using natural language in a Jupyter notebook, 2) developing a NLI to specify and edit Vega-Lite charts, 3) recreating data ambiguity widgets from the DataTone system, and 4) incorporating speech input to create a multimodal visualization system.",
                "authors": [
                    {
                        "name": "Narechania A."
                    },
                    {
                        "name": "Srinivasan A."
                    },
                    {
                        "name": "Stasko J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-02-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "NL4DV: A toolkit for generating analytic specifications for data visualization from natural language queries"
            },
            "pmid": "33048704"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}