
{
    "credit": [
        {
            "email": "sybil-info@lists.sourceforge.net",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.jcvi.org/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://sybil.sourceforge.net/documentation.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/sybil-1-5-1-web-based-software-comparative-genomics.html"
        }
    ],
    "publication": [
        {
            "abstract": "With the successful completion of genome sequencing projects for a variety of model organisms, the selection of candidate organisms for future sequencing efforts has been guided increasingly by a desire to enable comparative genomics. This trend has both depended on and encouraged the development of software tools that can elucidate and capitalize on the similarities and differences between genomes. \"Sybil,\" one such tool, is a primarily web-based software package whose primary goal is to facilitate the analysis and visualization of comparative genome data, with a particular emphasis on protein and gene cluster data. Herein, a two-phase protein clustering algorithm, used to generate protein clusters suitable for analysis through Sybil and a method for creating graphical displays of protein or gene clusters that span multiple genomes are described. When combined, these two relatively simple techniques provide the user of the Sybil software (The Institute for Genomic Research [TIGR] Bioinformatics Department) with a browsable graphical display of his or her \"input\" genomes, showing which genes are conserved based on the parameters supplied to the protein clustering algorithm. For any given protein cluster the graphical display consists of a local alignment of the genomes in which the clustered genes are located. The genomes are arranged in a vertical stack, as in a multiple alignment, and shaded areas are used to connect genes in the same cluster, thus displaying conservation at the protein level in the context of the underlying genomic sequences. The authors have found this display-and slight variants thereof-useful for a variety of annotation and comparison tasks, ranging from identifying \"missed\" gene models or single-exon discrepancies between orthologous genes, to finding large or small regions of conserved gene synteny, and investigating the properties of the breakpoints between such regions.",
            "authors": [
                "Crabtree J.",
                "Angiuoli S.V.",
                "Wortman J.R.",
                "White O.R."
            ],
            "cit_count": 46,
            "journal": "Methods in molecular biology (Clifton, N.J.)",
            "pmid": "18314579",
            "title": "Sybil: methods and software for multiple genome comparison and visualization.",
            "year": "2007-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:sybil",
        "biotoolsID": "sybil",
        "description": "A web-based software package for comparative genomics, whose primary goal is to facilitate the analysis and visualization of comparative genome data, with a particular emphasis on protein and gene cluster data. Herein, a two-phase protein clustering algorithm, used to generate protein clusters suitable for analysis through Sybil and a method for creating graphical displays of protein or gene clusters that span multiple genomes are described.",
        "homepage": "http://sybil.sourceforge.net/",
        "name": "Sybil"
    }
}