{
    "accessibility": "Open access",
    "additionDate": "2021-11-27T19:04:34.163496Z",
    "biotoolsCURIE": "biotools:elaborator",
    "biotoolsID": "elaborator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "silke.janitza@bayer.com",
            "name": "Silke Janitza"
        }
    ],
    "description": "A Novel App for Insights into Laboratory Data of Clinical Trials.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=elaborator",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-27T19:04:34.166038Z",
    "license": "GPL-3.0",
    "name": "elaborator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S43441-021-00318-4",
            "metadata": {
                "abstract": "© 2021, The Drug Information Association, Inc.In clinical studies there are huge numbers of laboratory parameters available that are measured at several visits for several treatment groups. The status quo for presenting laboratory data in clinical trials consists in generating large numbers of tables and data listings. Such tables and listings are required for submissions to health authorities. However, reviewing laboratory data presented in the form of tables and listings is a lengthy and tedious process. Thus, to enable efficient exploration of laboratory data we developed elaborator, a comprehensive and easy-to-use interactive browser-based application. The elaborator app comprises three analyses types for addressing different questions, for example about changes in laboratory values that frequently occur, treatment-related changes and changes beyond the normal ranges. In this way, the app can be used by study teams for identifying safety signals in a clinical trial as well as for generating hypotheses that are further inspected with detailed analyses and possibly data from other sources. The elaborator app is implemented in the statistical software R. The R package elaborator can be obtained from https://cran.r-project.org/package=elaborator. Patients’ laboratory data need to be extracted from the clinical database and pre-processed locally for feeding into the app. For exploring data by means of the elaborator, the user needs some familiarity with R but no programming knowledge is required.",
                "authors": [
                    {
                        "name": "Janitza S."
                    },
                    {
                        "name": "Jeske S."
                    },
                    {
                        "name": "Kulmann H."
                    },
                    {
                        "name": "Majumder M."
                    },
                    {
                        "name": "Mendolia F."
                    }
                ],
                "citationCount": 1,
                "date": "2021-11-01T00:00:00Z",
                "journal": "Therapeutic Innovation and Regulatory Science",
                "title": "elaborator: A Novel App for Insights into Laboratory Data of Clinical Trials"
            },
            "pmid": "34196957"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
