
{
    "credit": [
        {
            "email": "t.fukunaga@kurenai.waseda.jp",
            "name": "Tsukasa Fukunag",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "mhamada@waseda.jp",
            "name": "Michiaki Hamada",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/fukunagatsu/RIblast"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Residue interaction prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Nucleic acids",
                "uri": "http://edamontology.org/topic_0077"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2017. Published by Oxford University Press. Motivation: LncRNAs play important roles in various biological processes. Although more than 58 000 human lncRNA genes have been discovered, most known lncRNAs are still poorly characterized. One approach to understanding the functions of lncRNAs is the detection of the interacting RNA target of each lncRNA. Because experimental detections of comprehensive lncRNA-RNA interactions are difficult, computational prediction of lncRNA-RNA interactions is an indispensable technique. However, the high computational costs of existing RNA-RNA interaction prediction tools prevent their application to large-scale lncRNA datasets. Results: Here, we present 'RIblast', an ultrafast RNA-RNA interaction prediction method based on the seed-and-extension approach. RIblast discovers seed regions using suffix arrays and subsequently extends seed regions based on an RNA secondary structure energy model. Computational experiments indicate that RIblast achieves a level of prediction accuracy similar to those of existing programs, but at speeds over 64 times faster than existing programs. Availability and implementation: The source code of RIblast is freely available at https://github.com/fukunagatsu/RIblast . Contact: t.fukunaga@kurenai.waseda.jp or mhamada@waseda.jp. Supplementary information: Supplementary data are available at Bioinformatics online.",
            "authors": [
                "Fukunaga T.",
                "Hamada M."
            ],
            "cit_count": 8,
            "doi": "10.1093/bioinformatics/btx287",
            "journal": "Bioinformatics (Oxford, England)",
            "title": "RIblast: an ultrafast RNA-RNA interaction prediction system based on a seed-and-extension approach",
            "year": "2017-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:riblast",
        "biotoolsID": "riblast",
        "description": "An ultrafast RNA–RNA interaction prediction system based on a seed-and-extension approach.",
        "homepage": "https://funpopgen.github.io/veqtl-mapper/",
        "name": "RIblast"
    }
}