{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-06-14T13:18:54Z",
    "biotoolsCURIE": "biotools:aviator",
    "biotoolsID": "aviator",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andreas.keller@ccb.uni-saarland.de",
            "name": "Andreas Keller",
            "typeEntity": "Person"
        }
    ],
    "description": "Aviator is a web-server monitoring the availability of other published web-servers. It allows researchers to monitor their own tools or to asses if a tool they would like to access is temporarily or permanently offline.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://www.ccb.uni-saarland.de/aviator",
    "language": [
        "JavaScript",
        "PHP",
        "Perl",
        "Python"
    ],
    "lastUpdate": "2021-08-13T09:05:12Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/CCB-SB/Aviator/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/CCB-SB/Aviator"
        }
    ],
    "name": "Aviator",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAB396",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press on behalf of Nucleic Acids Research.With Aviator, we present a web service and repository that facilitates surveillance of online tools. Aviator consists of a user-friendly website and two modules, a literature-mining based general and a manually curated module. The general module currently checks 9417 websites twice a day with respect to their availability and stores many features (frontend and backend response time, required RAM and size of the web page, security certificates, analytic tools and trackers embedded in the webpage and others) in a data warehouse. Aviator is also equipped with an analysis functionality, for example authors can check and evaluate the availability of their own tools or those of their peers. Likewise, users can check the availability of a certain tool they intend to use in research or teaching to avoid including unstable tools. The curated section of Aviator offers additional services. We provide API snippets for common programming languages (Perl, PHP, Python, JavaScript) as well as an OpenAPI documentation for embedding in the backend of own web services for an automatic test of their function. We query the respective APIs twice a day and send automated notifications in case of an unexpected result. Naturally, the same analysis functionality as for the literature-based module is available for the curated section. Aviator can freely be used at https://www.ccb.uni-saarland.de/aviator.",
                "authors": [
                    {
                        "name": "Fehlmann T."
                    },
                    {
                        "name": "Hirsch P."
                    },
                    {
                        "name": "Keller A."
                    },
                    {
                        "name": "Kern F."
                    },
                    {
                        "name": "Seelow D."
                    },
                    {
                        "name": "Steinhaus R."
                    }
                ],
                "date": "2021-07-02T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Aviator: A web service for monitoring the availability of web services"
            },
            "pmid": "34038559"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
