{
    "additionDate": "2019-11-14T19:52:32Z",
    "biotoolsCURIE": "biotools:scMerge",
    "biotoolsID": "scMerge",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "jean.yang@sydney.edu.au",
            "name": "Jean Y H Yang",
            "orcidid": "https://orcid.org/0000-0002-5271-2603",
            "typeEntity": "Person"
        },
        {
            "email": "pengyi.yang@sydney.edu.au",
            "name": "Pengyi Yang",
            "orcidid": "https://orcid.org/0000-0003-1098-3138",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'scSEGIndex', 'SEGs' | Evaluating stably expressed genes in single cells | Single Cell Stably Express Gene Index — scSEGIndex | Merging multiple batches of scRNA-seq data | Single Cell Stably Express Gene Index | scMerge is a R package for merging and normalising single-cell RNA-Seq datasets | We recommend using either the pre-computed genes (see \"See Also\" below) or the top SEG genes from an user's own data as the control genes in the scMerge function (see the ctl argument in the scMerge function) | This function computes the single-cell Stably Expressed Gene (scSEG) index from Lin. et al. (2019) for a given single-cell count data matrix | If you have any enquries, especially about performing scMerge integration on your own data, then please contact bioinformatics@maths.usyd.edu.au",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://sydneybiox.github.io/scMerge/reference/scSEGIndex.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T19:52:32Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://sydneybiox.github.io/scMerge"
        }
    ],
    "name": "scMerge",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ106",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Background: Single-cell RNA-seq (scRNA-seq) profiling has revealed remarkable variation in transcription, suggesting that expression of many genes at the single-cell level is intrinsically stochastic and noisy. Yet, on the cell population level, a subset of genes traditionally referred to as housekeeping genes (HKGs) are found to be stably expressed in different cell and tissue types. It is therefore critical to question whether stably expressed genes (SEGs) can be identified on the single-cell level, and if so, how can their expression stability be assessed? We have previously proposed a computational framework for ranking expression stability of genes in single cells for scRNA-seq data normalization and integration. In this study, we perform detailed evaluation and characterization of SEGs derived from this framework. Results: Here, we show that gene expression stability indices derived from the early human and mouse development scRNA-seq datasets and the \"Mouse Atlas\" dataset are reproducible and conserved across species. We demonstrate that SEGs identified from single cells based on their stability indices are considerably more stable than HKGs defined previously from cell populations across diverse biological systems. Our analyses indicate that SEGs are inherently more stable at the single-cell level and their characteristics reminiscent of HKGs, suggesting their potential role in sustaining essential functions in individual cells. Conclusions: SEGs identified in this study have immediate utility both for understanding variation and stability of single-cell transcriptomes and for practical applications such as scRNA-seq data normalization. Our framework for calculating gene stability index, \"scSEGIndex,\" is incorporated into the scMerge Bioconductor R package (https://sydneybiox.github.io/scMerge/reference/scSEGIndex.html) and can be used for identifying genes with stable expression in scRNA-seq datasets.",
                "authors": [
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Ghazanfar S."
                    },
                    {
                        "name": "Strbenac D."
                    },
                    {
                        "name": "Wang A."
                    },
                    {
                        "name": "Patrick E."
                    },
                    {
                        "name": "Lin D.M."
                    },
                    {
                        "name": "Speed T."
                    },
                    {
                        "name": "Yang J.Y.H."
                    },
                    {
                        "name": "Yang P."
                    }
                ],
                "citationCount": 6,
                "date": "2019-09-18T00:00:00Z",
                "journal": "GigaScience",
                "title": "Evaluating stably expressed genes in single cells"
            },
            "pmcid": "PMC6748759",
            "pmid": "31531674"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}