{
    "additionDate": "2021-03-19T09:06:08Z",
    "biotoolsCURIE": "biotools:ap-cnn",
    "biotoolsID": "ap-cnn",
    "confidence_flag": "tool",
    "description": "Attention Pyramid Convolutional Neural Network (AP-CNN) is a model for Fine-Grained Visual Classification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PRIS-CV/AP-CNN_Pytorch-master",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-19T15:15:10Z",
    "license": "MIT",
    "name": "AP-CNN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TIP.2021.3055617",
            "metadata": {
                "abstract": "IEEEClassifying the sub-categories of an object from the same super-category (e.g., bird species and cars) in fine-grained visual classification (FGVC) highly relies on discriminative feature representation and accurate region localization. Existing approaches mainly focus on distilling information from high-level features. In this paper, by contrast, we show that by integrating low-level information (e.g., color, edge junctions, texture patterns), performance can be improved with enhanced feature representation and accurately located discriminative regions. Our solution, named Attention Pyramid Convolutional Neural Network (AP-CNN), consists of 1) a dual pathway hierarchy structure with a top-down feature pathway and a bottom-up attention pathway, hence learning both high-level semantic and low-level detailed feature representation, and 2) an ROI-guided refinement strategy with ROI-guided dropblock and ROI-guided zoom-in operation, which refines features with discriminative local regions enhanced and background noises eliminated. The proposed AP-CNN can be trained end-to-end, without the need of any additional bounding box/part annotation. Extensive experiments on three popularly tested FGVC datasets (CUB-200-2011, Stanford Cars, and FGVC-Aircraft) demonstrate that our approach achieves state-of-the-art performance. Models and code are available at https://github.com/PRIS-CV/AP-CNN_Pytorch-master.",
                "authors": [
                    {
                        "name": "Ding Y."
                    },
                    {
                        "name": "Ma Z."
                    },
                    {
                        "name": "Wen S."
                    },
                    {
                        "name": "Xie J."
                    },
                    {
                        "name": "Chang D."
                    },
                    {
                        "name": "Si Z."
                    },
                    {
                        "name": "Wu M."
                    },
                    {
                        "name": "Ling H."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "AP-CNN: Weakly Supervised Attention Pyramid Convolutional Neural Network for Fine-Grained Visual Classification"
            },
            "pmid": "33556008"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}