
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "license": "Apache-2.0",
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "http://github.com/ACIL-Group/DDVFA"
        }
    ],
    "publication": [
        {
            "abstract": "© 2019 Elsevier LtdThis paper presents a novel adaptive resonance theory (ART)-based modular architecture for unsupervised learning, namely the distributed dual vigilance fuzzy ART (DDVFA). DDVFA consists of a global ART system whose nodes are local fuzzy ART modules. It is equipped with distributed higher-order activation and match functions and a dual vigilance mechanism. Together, these allow DDVFA to perform unsupervised modularization, create multi-prototype cluster representations, retrieve arbitrarily-shaped clusters, and reduce category proliferation. Another important contribution is the reduction of order-dependence, an issue that affects any agglomerative clustering method. This paper demonstrates two approaches for mitigating order-dependence: pre-processing using visual assessment of cluster tendency (VAT) or post-processing using a novel Merge ART module. The former is suitable for batch processing, whereas the latter also works for online learning. Experimental results in online mode carried out on 30 benchmark data sets show that DDVFA cascaded with Merge ART statistically outperformed the best other ART-based systems when samples were randomly presented. Conversely, they were found to be statistically equivalent in offline mode when samples were pre-processed using VAT. Remarkably, performance comparisons to non-ART-based clustering algorithms show that DDVFA (which learns incrementally) was also statistically equivalent to the non-incremental (offline) methods of density-based spatial clustering of applications with noise (DBSCAN), single linkage hierarchical agglomerative clustering (SL-HAC), and k-means, while retaining the appealing properties of ART. Links to the source code and data are provided. Considering the algorithm's simplicity, online learning capability, and performance, it is an ideal choice for many agglomerative clustering applications.",
            "authors": [
                "Brito da Silva L.E.",
                "Elnabarawy I.",
                "Wunsch D.C."
            ],
            "cit_count": 1,
            "doi": "10.1016/J.NEUNET.2019.08.033",
            "journal": "Neural Networks",
            "pmid": "31574412",
            "title": "Distributed dual vigilance fuzzy adaptive resonance theory learns online, retrieves arbitrarily-shaped clusters, and mitigates order dependence",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:DDVFA",
        "biotoolsID": "DDVFA",
        "description": "Distributed dual vigilance fuzzy adaptive resonance theory learns online, retrieves arbitrarily-shaped clusters, and mitigates order dependence.\n\nDual Vigilance Fuzzy ART - Companion MATLAB Code.\n\nDistributed Dual Vigilance Fuzzy ART - Companion MATLAB Code.\n\nIf you make use of this DDVFA code please cite the following paper.\n\nAll published scholarly work that makes use of this code shall reference both the Applied Computational Intelligence Laboratory (ACIL) repository and the manuscript:",
        "homepage": "http://github.com/ACIL-Group/DVFA",
        "name": "DDVFA"
    }
}