{
    "additionDate": "2019-11-14T18:27:39Z",
    "biotoolsCURIE": "biotools:ORCA-SPOT",
    "biotoolsID": "ORCA-SPOT",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "christian.bergler@fau.de",
            "name": "Christian Bergler",
            "typeEntity": "Person"
        },
        {
            "email": "elmar.noeth@fau.de",
            "name": "Elmar Nöth",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | An Automatic Killer Whale Sound Detection Toolkit Using Deep Learning | Large bioacoustic archives of wild animals are an important source to identify reappearing communication patterns, which can then be related to recurring behavioral patterns to advance the current understanding of intra-specific communication of non-human animals. A main challenge remains that most large-scale bioacoustic archives contain only a small percentage of animal vocalizations and a large amount of environmental noise, which makes it extremely difficult to manually retrieve sufficient vocalizations for further analysis - particularly important for species with advanced social systems and complex vocalizations. In this study deep neural networks were trained on 11,509 killer whale (Orcinus orca) signals and 34,848 noise segments",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31358873",
    "lastUpdate": "2019-11-14T18:27:39Z",
    "name": "ORCA-SPOT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-47335-W",
            "metadata": {
                "abstract": "© 2019, The Author(s).Large bioacoustic archives of wild animals are an important source to identify reappearing communication patterns, which can then be related to recurring behavioral patterns to advance the current understanding of intra-specific communication of non-human animals. A main challenge remains that most large-scale bioacoustic archives contain only a small percentage of animal vocalizations and a large amount of environmental noise, which makes it extremely difficult to manually retrieve sufficient vocalizations for further analysis – particularly important for species with advanced social systems and complex vocalizations. In this study deep neural networks were trained on 11,509 killer whale (Orcinus orca) signals and 34,848 noise segments. The resulting toolkit ORCA-SPOT was tested on a large-scale bioacoustic repository – the Orchive – comprising roughly 19,000 hours of killer whale underwater recordings. An automated segmentation of the entire Orchive recordings (about 2.2 years) took approximately 8 days. It achieved a time-based precision or positive-predictive-value (PPV) of 93.2% and an area-under-the-curve (AUC) of 0.9523. This approach enables an automated annotation procedure of large bioacoustics databases to extract killer whale sounds, which are essential for subsequent identification of significant communication patterns. The code will be publicly available in October 2019 to support the application of deep learning to bioaoucstic research. ORCA-SPOT can be adapted to other animal species.",
                "authors": [
                    {
                        "name": "Bergler C."
                    },
                    {
                        "name": "Schroter H."
                    },
                    {
                        "name": "Cheng R.X."
                    },
                    {
                        "name": "Barth V."
                    },
                    {
                        "name": "Weber M."
                    },
                    {
                        "name": "Noth E."
                    },
                    {
                        "name": "Hofer H."
                    },
                    {
                        "name": "Maier A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "ORCA-SPOT: An Automatic Killer Whale Sound Detection Toolkit Using Deep Learning"
            },
            "pmcid": "PMC6662697",
            "pmid": "31358873"
        }
    ],
    "topic": [
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ]
}