{
    "additionDate": "2021-01-18T08:45:11Z",
    "biotoolsCURIE": "biotools:rionorm2",
    "biotoolsID": "rionorm2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yuanjingma2020@u.northwestern.edu",
            "name": "Yuanjing Ma",
            "typeEntity": "Person"
        },
        {
            "email": "hongmei@northwestern.edu",
            "name": "Hongmei Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel normalization and differential abundance test framework for microbiome data.\n\nsimulation/evaluation codes for RioNorm2 approach (both Multinomial and Dirichlet-Multinomial-based model).\n\nLarge scale of simulation studies are conducted to compare the performance of RioNorm2 to that of DESeq, DESeq2, metagenomeSeq, RAIDA, Omnibus and ANCOM. Specifically, we focus on evaluating the impact of sample size, library size, and effect size on the performance of different methods.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuanjing-ma/RioNorm2",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-06T17:56:42Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yuanjing-ma/RioNorm2_simulation"
        }
    ],
    "name": "RioNorm2",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA255",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Microbial communities have been proved to have close relationship with many diseases. The identification of differentially abundant microbial species is clinically meaningful for finding disease-related pathogenic or probiotic bacteria. However, certain characteristics of microbiome data have hurdled the accuracy and effectiveness of differential abundance analysis. The abundances or counts of microbiome species are usually on different scales and exhibit zero-inflation and over-dispersion. Normalization is a crucial step before the differential abundance test. However, existing normalization methods typically try to adjust counts on different scales to a common scale by constructing size factors with the assumption that count distributions across samples are equivalent up to a certain percentile. These methods often yield undesirable results when differentially abundant species are of low to medium abundance level. For differential abundance analysis, existing methods often use a single distribution to model the dispersion of species which lacks flexibility to catch a single species' distinctiveness. These methods tend to detect a lot of false positives and often lack of power when the effect size is small. Results: We develop a novel framework for differential abundance analysis on sparse high-dimensional marker gene microbiome data. Our methodology relies on a novel network-based normalization technique and a two-stage zero-inflated mixture count regression model (RioNorm2). Our normalization method aims to find a group of relatively invariant microbiome species across samples and conditions in order to construct the size factor. Another contribution of the paper is that our testing approach can take under-sampling and over-dispersion into consideration by separating microbiome species into two groups and model them separately. Through comprehensive simulation studies, the performance of our method is consistently powerful and robust across different settings with different sample size, library size and effect size. We also demonstrate the effectiveness of our novel framework using a published dataset of metastatic melanoma and find biological insights from the results.",
                "authors": [
                    {
                        "name": "Ma Y."
                    },
                    {
                        "name": "Luo Y."
                    },
                    {
                        "name": "Jiang H."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A novel normalization and differential abundance test framework for microbiome data"
            },
            "pmcid": "PMC7332570",
            "pmid": "32311021"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}