{
    "accessibility": "Open access",
    "additionDate": "2019-06-20T11:14:07Z",
    "biotoolsCURIE": "biotools:ColiCoords",
    "biotoolsID": "ColiCoords",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jhsmit@gmail.com",
            "name": "J. H. Smit",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Python package for the analysis of bacterial fluorescence microscopy data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://colicoords.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Jhsmit/ColiCoords",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "ColiCoords",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0217524",
            "metadata": {
                "abstract": "© 2019 Smit et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Single-molecule fluorescence microscopy studies of bacteria provide unique insights into the mechanisms of cellular processes and protein machineries in ways that are unrivalled by any other technique. With the cost of microscopes dropping and the availability of fully automated microscopes, the volume of microscopy data produced has increased tremendously. These developments have moved the bottleneck of throughput from image acquisition and sample preparation to data analysis. Furthermore, requirements for analysis procedures have become more stringent given the demand of various journals to make data and analysis procedures available. To address these issues we have developed a new data analysis package for analysis of fluorescence microscopy data from rod-like cells. Our software ColiCoords structures microscopy data at the single-cell level and implements a coordinate system describing each cell. This allows for the transformation of Cartesian coordinates from transmission light and fluorescence images and single-molecule localization microscopy (SMLM) data to cellular coordinates. Using this transformation, many cells can be combined to increase the statistical power of fluorescence microscopy datasets of any kind. ColiCoords is open source, implemented in the programming language Python, and is extensively documented. This allows for modifications for specific needs or to inspect and publish data analysis procedures. By providing a format that allows for easy sharing of code and associated data, we intend to promote open and reproducible research. The source code and documentation can be found via the project’s GitHub page.",
                "authors": [
                    {
                        "name": "Smit J.H."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Warszawik E.M."
                    },
                    {
                        "name": "Herrmann A."
                    },
                    {
                        "name": "Cordes T."
                    }
                ],
                "citationCount": 3,
                "date": "2019-06-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Colicoords: A Python package for the analysis of bacterial fluorescence microscopy data"
            },
            "pmid": "31216308",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ],
    "validated": 1
}