{
    "additionDate": "2018-07-08T13:25:16Z",
    "biotoolsCURIE": "biotools:becon",
    "biotoolsID": "becon",
    "credit": [
        {
            "name": "M S Kobor",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.nature.com/articles/tp2017171/email/correspondent/c1/new"
        }
    ],
    "description": "Interpreting DNA methylation findings from blood in the context of brain.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://redgar598.shinyapps.io/BECon/_w_3c840605/Blood_brain_Shiny_Help.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "https://redgar598.shinyapps.io/BECon/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "BECon",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/tp.2017.171",
            "metadata": {
                "abstract": "© The Author(s) 2017.Tissue differences are one of the largest contributors to variability in the human DNA methylome. Despite the tissue-specific nature of DNA methylation, the inaccessibility of human brain samples necessitates the frequent use of surrogate tissues such as blood, in studies of associations between DNA methylation and brain function and health. Results from studies of surrogate tissues in humans are difficult to interpret in this context, as the connection between blood-brain DNA methylation is tenuous and not well-documented. Here, we aimed to provide a resource to the community to aid interpretation of blood-based DNA methylation results in the context of brain tissue. We used paired samples from 16 individuals from three brain regions and whole blood, run on the Illumina 450 K Human Methylation Array to quantify the concordance of DNA methylation between tissues. From these data, we have made available metrics on: the variability of cytosine-phosphate-guanine dinucleotides (CpGs) in our blood and brain samples, the concordance of CpGs between blood and brain, and estimations of how strongly a CpG is affected by cell composition in both blood and brain through the web application BECon (Blood-Brain Epigenetic Concordance; https://redgar598.shinyapps.io/BECon/). We anticipate that BECon will enable biological interpretation of blood-based human DNA methylation results, in the context of brain.",
                "authors": [
                    {
                        "name": "Edgar R.D."
                    },
                    {
                        "name": "Jones M.J."
                    },
                    {
                        "name": "Kobor M.S."
                    },
                    {
                        "name": "Meaney M.J."
                    },
                    {
                        "name": "Turecki G."
                    }
                ],
                "citationCount": 87,
                "date": "2017-08-01T00:00:00Z",
                "journal": "Translational Psychiatry",
                "title": "BECon: A tool for interpreting DNA methylation findings from blood in the context of brain"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
