{"credit":[{"email":"martin.lott@uea.ac.uk","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.uea.ac.uk/computing/the-uea-computational-biology-laboratory"}],"documentation":[{"type":"GENERAL","url":"http://www.uea.ac.uk/documents/429378/432070/Visrd_manual.pdf/e9d46b2b-36b2-4b0b-8d67-740fec420827"}],"function":[{"operation":[{"term":"Phylogenetic tree visualisation","uri":"http://edamontology.org/operation_0567"},{"term":"Sequence alignment analysis","uri":"http://edamontology.org/operation_0258"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Desktop application"],"topic":[{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/visrd-3-0-visual-recombination-detection-software-package.html"}],"publication":[{"abstract":"Background: Recombination has a profound impact on the evolution of viruses, but characterizing recombination patterns in molecular sequences remains a challenging endeavor. Despite its importance in molecular evolutionary studies, identifying the sequences that exhibit such patterns has received comparatively less attention in the recombination detection framework. Here, we extend a quartet-mapping based recombination detection method to enable identification of recombinant sequences without prior specifications of either query and reference sequences. Through simulations we evaluate different recombinant identification statistics and significance tests. We compare the quartet approach with triplet-based methods that employ additional heuristic tests to identify parental and recombinant sequences. Results: Analysis of phylogenetic simulations reveal that identifying the descendents of relatively old recombination events is a challenging task for all methods available, and that quartet scanning performs relatively well compared to the triplet based methods. The use of quartet scanning is further demonstrated by analyzing both well-established and putative HIV-1 recombinant strains. In agreement with recent findings, we provide evidence that the presumed circulating recombinant CRF02_AG is a 'pure' lineage, whereas the presumed parental lineage subtype G has a recombinant origin. We also demonstrate HIV-1 intrasubtype recombination, confirm the hybrid origin of SIV in chimpanzees and further disentangle the recombinant history of SIV lineages in a primate immunodeficiency virus data set. Conclusion: Quartet scanning makes a valuable addition to triplet-based methods for identifying recombinant sequences without prior specifications of either query and reference sequences. The new method is available in the VisRD v.3.0 package http://www.cmp.uea.ac.uk/ ~vlm/visrd. © 2009 Lemey et al; licensee BioMed Central Ltd.","authors":["Lemey P.","Lott M.","Martin D.P.","Moulton V."],"cit_count":27,"journal":"BMC Bioinformatics","pmid":"19397803","title":"Identifying recombinants in human and primate immunodeficiency virus sequence alignments using quartet scanning","year":"2009-04-27"}],"summary":{"biotoolsCURIE":"biotools:visrd","biotoolsID":"visrd","description":"Software package allowing graphical inspection of the phylogenetic content of a sequence alignment, that is primarily intended for detection of recombination and recombination breakpoints.","homepage":"http://www.uea.ac.uk/computing/phylogenetics-software-visrd","name":"VisRD"}}