{
    "additionDate": "2017-08-20T15:39:29Z",
    "biotoolsCURIE": "biotools:eqtlbma",
    "biotoolsID": "eqtlbma",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "eqtlbma-users@googlegroups.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "eQtlBma: software to detect eQTLs by Bayesian Model Averaging. The software detects quantitative trait loci for gene expression levels (\"eQTLs\") jointly in multiple subgroups (e.g. multiple tissues).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/timflutre/eqtlbma/wiki#usage"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/timflutre/eqtlbma/blob/master/doc/manual_eqtlbma.pdf?raw=true"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/timflutre/eqtlbma/wiki",
    "language": [
        "Shell",
        "R"
    ],
    "lastUpdate": "2019-09-04T08:38:03Z",
    "license": "GPL-3.0",
    "name": "eQtlBma",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1371/journal.pgen.1003486",
            "metadata": {
                "abstract": "Mapping expression Quantitative Trait Loci (eQTLs) represents a powerful and widely adopted approach to identifying putative regulatory variants and linking them to specific genes. Up to now eQTL studies have been conducted in a relatively narrow range of tissues or cell types. However, understanding the biology of organismal phenotypes will involve understanding regulation in multiple tissues, and ongoing studies are collecting eQTL data in dozens of cell types. Here we present a statistical framework for powerfully detecting eQTLs in multiple tissues or cell types (or, more generally, multiple subgroups). The framework explicitly models the potential for each eQTL to be active in some tissues and inactive in others. By modeling the sharing of active eQTLs among tissues, this framework increases power to detect eQTLs that are present in more than one tissue compared with \"tissue-by-tissue\" analyses that examine each tissue separately. Conversely, by modeling the inactivity of eQTLs in some tissues, the framework allows the proportion of eQTLs shared across different tissues to be formally estimated as parameters of a model, addressing the difficulties of accounting for incomplete power when comparing overlaps of eQTLs identified by tissue-by-tissue analyses. Applying our framework to re-analyze data from transformed B cells, T cells, and fibroblasts, we find that it substantially increases power compared with tissue-by-tissue analysis, identifying 63% more genes with eQTLs (at FDR = 0.05). Further, the results suggest that, in contrast to previous analyses of the same data, the majority of eQTLs detectable in these data are shared among all three tissues. © 2013 Flutre et al.",
                "authors": [
                    {
                        "name": "Flutre T."
                    },
                    {
                        "name": "Wen X."
                    },
                    {
                        "name": "Pritchard J."
                    },
                    {
                        "name": "Stephens M."
                    }
                ],
                "citationCount": 141,
                "date": "2013-05-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "A Statistical Framework for Joint eQTL Analysis in Multiple Tissues"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}