{"credit":[{"email":"jess@jimmy.harvard.edu","name":"Jessica Mar","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"url":"http://bioconductor.org/packages/release/bioc/html/qpcrNorm.html"}],"download":[{"type":"Source code","url":"http://bioconductor/packages/release/bioc/src/contrib/qpcrNorm_1.32.0.tar.gz"}],"function":[{"operation":[{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"}]}],"labels":{"collectionID":["BioConductor"],"language":["R"],"license":"GPL-2.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Library"],"topic":[{"term":"PCR experiment","uri":"http://edamontology.org/topic_3519"}]},"publication":[{"abstract":"Background: High-throughput real-time quantitative reverse transcriptase polymerase chain reaction (qPCR) is a widely used technique in experiments where expression patterns of genes are to be profiled. Current stage technology allows the acquisition of profiles for a moderate number of genes (50 to a few thousand), and this number continues to grow. The use of appropriate normalization algorithms for qPCR-based data is therefore a highly important aspect of the data preprocessing pipeline. Results: We present and evaluate two data-driven normalization methods that directly correct for technical variation and represent robust alternatives to standard housekeeping gene-based approaches. We evaluated the performance of these methods against a single gene housekeeping gene method and our results suggest that quantile normalization performs best. These methods are implemented in freely-available software as an R package qpcrNorm distributed through the Bioconductor project. Conclusion: The utility of the approaches that we describe can be demonstrated most clearly in situations where standard housekeeping genes are regulated by some experimental condition. For large qPCR-based data sets, our approaches represent robust, data-driven strategies for normalization. © 2009 Mar et al; licensee BioMed Central Ltd.","authors":["Mar J.C.","Kimura Y.","Schroder K.","Irvine K.M.","Hayashizaki Y.","Suzuki H.","Hume D.","Quackenbush J."],"cit_count":63,"doi":"10.1186/1471-2105-10-110","journal":"BMC Bioinformatics","title":"Data-driven normalization strategies for high-throughput quantitative RT-PCR","type":"Primary","year":"2009-04-19"}],"summary":{"biotoolsCURIE":"biotools:qpcrnorm","biotoolsID":"qpcrnorm","description":"The package contains functions to perform normalization of high-throughput qPCR data. Basic functions for processing raw Ct data plus functions to generate diagnostic plots are also available.","homepage":"http://bioconductor.org/packages/release/bioc/html/qpcrNorm.html","name":"qpcrNorm","version":["1.32.0"]}}