{
    "additionDate": "2020-01-14T19:44:43Z",
    "biotoolsCURIE": "biotools:chemfp_autogenerated",
    "biotoolsID": "chemfp_autogenerated",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "dalke@dalkescientific.com",
            "name": "Andrew Dalke",
            "orcidid": "https://orcid.org/0000-0001-8933-8830",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast cheminformatics fingerprint search, at your fingertips.\n\nChemfp is a set of command-line tools and a Python library for fingerprint generation and high-performance similarity search.\n\nThere are two ways to try out chemfp. From the download page page you can request an evaluation copy of the most recent version of chemfp, or you can download an earlier version for no cost under the MIT license",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ]
        }
    ],
    "homepage": "http://www.chemfp.com/",
    "lastUpdate": "2020-01-14T19:44:43Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/dalke/chemfp_benchmark"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/dalke/chemfp_paper_reproducibles/"
        }
    ],
    "name": "chemfp_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13321-019-0398-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).The chemfp project has had four main goals: (1) promote the FPS format as a text-based exchange format for dense binary cheminformatics fingerprints, (2) develop a high-performance implementation of the BitBound algorithm that could be used as an effective baseline to benchmark new similarity search implementations, (3) experiment with funding a pure open source software project through commercial sales, and (4) publish the results and lessons learned as a guide for future implementors. The FPS format has had only minor success, though it did influence development of the FPB binary format, which is faster to load but more complex. Both are summarized. The chemfp benchmark and the no-cost/open source version of chemfp are proposed as a reference baseline to evaluate the effectiveness of other similarity search tools. They are used to evaluate the faster commercial version of chemfp, which can test 130 million 1024-bit fingerprint Tanimotos per second on a single core of a standard x86-64 server machine. When combined with the BitBound algorithm, a k = 1000 nearest-neighbor search of the 1.8 million 2048-bit Morgan fingerprints of ChEMBL 24 averages 27 ms/query. The same search of 970 million PubChem fingerprints averages 220 ms/query, making chemfp one of the fastest CPU-based similarity search implementations. Modern CPUs are fast enough that memory bandwidth and latency are now important factors. Single-threaded search uses most of the available memory bandwidth. Sorting the fingerprints by popcount improves memory coherency, which when combined with 4 OpenMP threads makes it possible to construct an N × N similarity matrix for 1 million fingerprints in about 30 min. These observations may affect the interpretation of previous publications which assumed that search was strongly CPU bound. The chemfp project funding came from selling a purely open-source software product. Several product business models were tried, but none proved sustainable. Some of the experiences are discussed, in order to contribute to the ongoing conversation on the role of open source software in cheminformatics.[Figure not available: See fulltext].",
                "authors": [
                    {
                        "name": "Dalke A."
                    }
                ],
                "date": "2019-12-05T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "The chemfp project"
            },
            "pmcid": "PMC6896769"
        }
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        }
    ]
}