{
    "additionDate": "2018-05-09T16:37:44Z",
    "biotoolsCURIE": "biotools:ubine",
    "biotoolsID": "ubine",
    "credit": [
        {
            "email": "francis@saturn.yzu.edu.tw",
            "name": "Lee TY",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Knowledge-based system that could provide potential E3 ligases for ubiquitinated proteins by the information of protein-protein interactions and substrate site specificities.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://140.138.144.145/~ubinet/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function analysis",
                    "uri": "http://edamontology.org/operation_2414"
                }
            ]
        }
    ],
    "homepage": "http://140.138.144.145/~ubinet/index.php",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "UbiNe",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAW054",
            "metadata": {
                "abstract": "© The Author(s) 2016.Protein ubiquitylation catalyzed by E3 ubiquitin ligases are crucial in the regulation of many cellular processes. Owing to the high throughput of mass spectrometry-based proteomics, a number of methods have been developed for the experimental determination of ubiquitylation sites, leading to a large collection of ubiquitylation data. However, there exist no resources for the exploration of E3-ligase-associated regulatory networks of for ubiquitylated proteins in humans. Therefore, the UbiNet database was developed to provide a full investigation of protein ubiquitylation networks by incorporating experimentally verified E3 ligases, ubiquitylated substrates and protein-protein interactions (PPIs). To date, UbiNet has accumulated 43 948 experimentally verified ubiquitylation sites from 14 692 ubiquitylated proteins of humans. Additionally, we have manually curated 499 E3 ligases as well as two E1 activating and 46 E2 conjugating enzymes. To delineate the regulatory networks among E3 ligases and ubiquitylated proteins, a total of 430 530 PPIs were integrated into UbiNet for the exploration of ubiquitylation networks with an interactive network viewer. A case study demonstrated that UbiNet was able to decipher a scheme for the ubiquitylation of tumor proteins p63 and p73 that is consistent with their functions. Although the essential role of Mdm2 in p53 regulation is well studied, UbiNet revealed that Mdm2 and additional E3 ligases might be implicated in the regulation of other tumor proteins by protein ubiquitylation. Moreover, UbiNet could identify potential substrates for a specific E3 ligase based on PPIs and substrate motifs. With limited knowledge about the mechanisms through which ubiquitylated proteins are regulated by E3 ligases, UbiNet offers users an effective means for conducting preliminary analyses of protein ubiquitylation. The UbiNet database is now freely accessible via http://csb.cse.yzu.edu.tw/UbiNet/. The content is regularly updated with the literature and newly released data.",
                "authors": [
                    {
                        "name": "Nguyen V.-N."
                    },
                    {
                        "name": "Huang K.-Y."
                    },
                    {
                        "name": "Weng J.T.-Y."
                    },
                    {
                        "name": "Lai K.R."
                    },
                    {
                        "name": "Lee T.-Y."
                    }
                ],
                "citationCount": 7,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Database",
                "title": "UbiNet: An online resource for exploring the functional associations and regulatory networks of protein ubiquitylation"
            },
            "pmcid": "PMC4843525",
            "pmid": "27114492"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}