{
    "additionDate": "2021-01-18T08:33:26Z",
    "biotoolsCURIE": "biotools:micrographcleaner",
    "biotoolsID": "micrographcleaner",
    "confidence_flag": "tool",
    "description": "A python package for cryo-EM micrograph cleaning using deep learning.\n\nMicrographCleaner (micrograph_cleaner_em) is a python package designed to segment cryo-EM micrographs into:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Single particle alignment and classification",
                    "uri": "http://edamontology.org/operation_3458"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rsanchezgarc/micrograph_cleaner_em",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-22T09:04:51Z",
    "license": "Apache-2.0",
    "name": "MicrographCleaner",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.JSB.2020.107498",
            "metadata": {
                "abstract": "© 2020 The AuthorsCryo-EM Single Particle Analysis workflows require tens of thousands of high-quality particle projections to unveil the three-dimensional structure of macromolecules. Conventional methods for automatic particle picking tend to suffer from high false-positive rates, hampering the reconstruction process. One common cause of this problem is the presence of carbon and different types of high-contrast contaminations. In order to overcome this limitation, we have developed MicrographCleaner, a deep learning package designed to discriminate, in an automated fashion, between regions of micrographs which are suitable for particle picking, and those which are not. MicrographCleaner implements a U-net-like deep learning model trained on a manually curated dataset compiled from over five hundred micrographs. The benchmarking, carried out on approximately one hundred independent micrographs, shows that MicrographCleaner is a very efficient approach for micrograph preprocessing. MicrographCleaner (micrograph_cleaner_em) package is available at PyPI and Anaconda Cloud and also as a Scipion/Xmipp protocol. Source code is available at https://github.com/rsanchezgarc/micrograph_cleaner_em.",
                "authors": [
                    {
                        "name": "Sanchez-Garcia R."
                    },
                    {
                        "name": "Segura J."
                    },
                    {
                        "name": "Maluenda D."
                    },
                    {
                        "name": "Sorzano C.O.S."
                    },
                    {
                        "name": "Carazo J.M."
                    }
                ],
                "citationCount": 7,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Journal of Structural Biology",
                "title": "MicrographCleaner: A python package for cryo-EM micrograph cleaning using deep learning"
            },
            "pmid": "32276087"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}