{
    "additionDate": "2015-01-22T11:40:44Z",
    "biotoolsCURIE": "biotools:bach",
    "biotoolsID": "bach",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "antonio.trovato@unipd.it",
            "name": "Antonio Trovato",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This server allows to use the BACHSCORE tool with the aim of discriminating the best model of a protein (the native state or a structure very similar to it) among a large set of alternative conformations.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bachserver.pd.infn.it/documentation/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "The tool uses the BACH++ (Bayesian Analysis Conformation Hunt) knowledge-based potential, an all atom energy score based on 1091 parameters derived by a statistical analysis of a small set of experimentally observed proteins. The BACH-server provides direct access to the BACH++ energy function. Both single models and sets of models (submitted as a single zip file or collectively selected from a dropdown list) can be analyzed. Input model files need to be in pdb (Protein Data Bank) format. An energy score is associated to all models in the set and then used to rank them: conformations with lowest energies are predicted to be more similar to the native state.",
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ]
        }
    ],
    "homepage": "http://bachserver.pd.infn.it/",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-3.0",
    "name": "BACH Bayesian Analysis Conformation Hunt",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1016/j.cpc.2013.07.019",
            "metadata": {
                "abstract": "In protein structure prediction it is of crucial importance, especially at the refinement stage, to score efficiently large sets of models by selecting the ones that are closest to the native state. We here present a new computational tool, BACHSCORE, that allows its users to rank different structural models of the same protein according to their quality, evaluated by using the BACH++ (Bayesian Analysis Conformation Hunt) scoring function. The original BACH statistical potential was already shown to discriminate with very good reliability the protein native state in large sets of misfolded models of the same protein. BACH++ features a novel upgrade in the solvation potential of the scoring function, now computed by adapting the LCPO (Linear Combination of Pairwise Orbitals) algorithm. This change further enhances the already good performance of the scoring function. BACHSCORE can be accessed directly through the web server: bachserver.pd.infn.it. © 2013 Elsevier B.V. All rights reserved.",
                "authors": [
                    {
                        "name": "Sarti E."
                    },
                    {
                        "name": "Zamuner S."
                    },
                    {
                        "name": "Cossio P."
                    },
                    {
                        "name": "Laio A."
                    },
                    {
                        "name": "Seno F."
                    },
                    {
                        "name": "Trovato A."
                    }
                ],
                "citationCount": 6,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Computer Physics Communications",
                "title": "BACHSCORE. A tool for evaluating efficiently and reliably the quality of large sets of protein structures"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}