{
    "accessibility": "Open access",
    "additionDate": "2022-10-03T22:37:19.479028Z",
    "biotoolsCURIE": "biotools:feednet",
    "biotoolsID": "feednet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Nagesh Kumar S"
        },
        {
            "name": "Dhruv Makwana",
            "orcidid": "https://orcid.org/0000-0003-2376-4532"
        },
        {
            "name": "Gayatri Deshmukh",
            "orcidid": "https://orcid.org/0000-0001-6442-0782"
        },
        {
            "name": "Onkar Susladkar",
            "orcidid": "https://orcid.org/0000-0003-4511-1858"
        },
        {
            "name": "Sai Chandra Teja R",
            "orcidid": "https://orcid.org/0000-0002-4433-7858"
        },
        {
            "name": "Sparsh Mittal",
            "orcidid": "https://orcid.org/0000-0002-2908-993X"
        }
    ],
    "description": "A feature enhanced encoder-decoder LSTM network for nuclei instance segmentation for histopathological diagnosis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CandleLabAI/FEEDNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:31:09.031011Z",
    "license": "MIT",
    "name": "FEEDNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1088/1361-6560/ac8594",
            "metadata": {
                "abstract": "Objective. Automated cell nuclei segmentation is vital for the histopathological diagnosis of cancer. However, nuclei segmentation from ‘hematoxylin and eosin’ (HE) stained ‘whole slide images’ (WSIs) remains a challenge due to noise-induced intensity variations and uneven staining. The goal of this paper is to propose a novel deep learning model for accurately segmenting the nuclei in HE-stained WSIs. Approach. We introduce FEEDNet, a novel encoder-decoder network that uses LSTM units and ‘feature enhancement blocks’ (FE-blocks). Our proposed FE-block avoids the loss of location information incurred by pooling layers by concatenating the downsampled version of the original image to preserve pixel intensities. FEEDNet uses an LSTM unit to capture multi-channel representations compactly. Secondly, for datasets that provide class information, we train a multiclass segmentation model, which generates masks corresponding to each class at the output. Using this information, we generate more accurate binary masks than that generated by conventional binary segmentation models. Main results. We have thoroughly evaluated FEEDNet on CoNSeP, Kumar, and CPM-17 datasets. FEEDNet achieves the best value of PQ (panoptic quality) on CoNSeP and CPM-17 datasets and the second best value of PQ on the Kumar dataset. The 32-bit floating-point version of FEEDNet has a model size of 64.90 MB. With INT8 quantization, the model size reduces to only 16.51 MB, with a negligible loss in predictive performance on Kumar and CPM-17 datasets and a minor loss on the CoNSeP dataset. Significance. Our proposed idea of generalized class-aware binary segmentation is shown to be accurate on a variety of datasets. FEEDNet has a smaller model size than the previous nuclei segmentation networks, which makes it suitable for execution on memory-constrained edge devices. The state-of-the-art predictive performance of FEEDNet makes it the most preferred network. The source code can be obtained from https://github.com/CandleLabAI/FEEDNet.",
                "authors": [
                    {
                        "name": "Chandra Teja R S."
                    },
                    {
                        "name": "Deshmukh G."
                    },
                    {
                        "name": "Kumar S N."
                    },
                    {
                        "name": "Makwana D."
                    },
                    {
                        "name": "Mittal S."
                    },
                    {
                        "name": "Susladkar O."
                    }
                ],
                "citationCount": 9,
                "date": "2022-10-07T00:00:00Z",
                "journal": "Physics in Medicine and Biology",
                "title": "FEEDNet: a feature enhanced encoder-decoder LSTM network for nuclei instance segmentation for histopathological diagnosis"
            },
            "pmid": "35905732"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
