{
    "additionDate": "2019-11-14T19:48:13Z",
    "biotoolsCURIE": "biotools:CF-targeter",
    "biotoolsID": "CF-targeter",
    "confidence_flag": "high",
    "description": "A Rational Biological Cell Factory Targeting Platform for Biosynthetic Target Chemicals | Chassis selection from 70 candidate orgainisms for more than 6,000 target molecules production | CF-Targrter: We present CF-Targeter to solve several biological problems, including host organism selection, biosynthetic pathway design and quantitative evaluations of pathways. It is very useful for those who plan to biosynthesize a target molecule but do not know which host organism should be selected, what the heterologous pathway is or what maximum theoretical yields could be achieved | Tips: please choose a search type",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "http://www.rxnfinder.org/cf_targeter/",
    "lastUpdate": "2019-11-14T19:48:13Z",
    "name": "CF-targeter",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACSSYNBIO.9B00070",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Biosynthesis is a promising method for chemical synthesis. However, due to varieties between different microorganism hosts, yield and heterologous pathways needed for production of target chemical may also vary from different strains. One of the main challenges in metabolic engineering is to select an appropriate chassis host for specified target chemical production. However, with thousands of microorganisms existing in nature and extremely complicated metabolism within them, it is still time-consuming and error-prone work to achieve such a goal only through experimental methods, even with some existing computational methods. Hence, more efficient methods should be proposed to assist in selecting appropriate chassis hosts. In this article, based on symbolic reaction repositories and a pathway search algorithm which performed 1 400 000 searches for per target compound, we established a biological reasoning system for appropriate chassis host selection by coupling with various GEM-models. By using a supercomputer to calculate the biosynthetic pathways for more than 1 month, nearly 50 000 000 biosynthetic pathways are computed for production of 6026 compounds within 70 microorganisms. With retrieved organisms for specified target production, several heterologous biosynthetic pathways can be shown in length order, and then the maximum theoretical yields and thermodynamic feasibility can be calculated in real time under customized growth conditions and physiological states. From the computation results, the system not only identifies experimentally validated pathways but also outputs more efficient solutions with less heterologous steps or higher maximum possible theoretical yield by engineering other organism hosts. CF-targeter is available at http://www.rxnfinder.org/cf_targeter/",
                "authors": [
                    {
                        "name": "Ding S."
                    },
                    {
                        "name": "Cai P."
                    },
                    {
                        "name": "Yuan L."
                    },
                    {
                        "name": "Tian Y."
                    },
                    {
                        "name": "Tu W."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Sun D."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Hu Q.-N."
                    }
                ],
                "date": "2019-10-18T00:00:00Z",
                "journal": "ACS Synthetic Biology",
                "title": "CF-Targeter: A Rational Biological Cell Factory Targeting Platform for Biosynthetic Target Chemicals"
            },
            "pmid": "31518497"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}