{
    "accessibility": "Open access",
    "additionDate": "2024-03-06T13:52:47.106674Z",
    "biotoolsCURIE": "biotools:plantenrichment",
    "biotoolsID": "plantenrichment",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gokhan.karakulah@deu.edu.tr",
            "name": "Gökhan Karakülah",
            "typeEntity": "Person"
        },
        {
            "name": "Doğa Eskier",
            "typeEntity": "Person"
        }
    ],
    "description": "PlanTEnrichment is a tool that permits enrichment analysis of transposable elements associated with a given gene list. It takes, for example, a group of differentially expressed plant genes under a particular biological condition as input and returns the list of transposable elements associated with those genes, along with their calculated enrichment scores and statistical significances.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://tools.ibg.deu.edu.tr/plantenrichment/",
    "lastUpdate": "2024-11-24T14:11:59.464994Z",
    "name": "PlanTEnrichment",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/978-1-0716-3389-2_5",
            "metadata": {
                "abstract": "Transposable elements (TEs) are repeat elements that can relocate or create novel copies of themselves in the genome and contribute to genomic complexity and expansion, via events such as chromosome recombination or regulation of gene expression. However, given the large number of such repeats across the genome, identifying repeats of interest can be a challenge in even well-annotated genomes, especially in more complex, TE-rich plant genomes. Here, we describe a protocol for PlanTEnrichment, a database we created comprising information on 11 plant genomes to analyze stress-associated TEs using publicly available data. By selecting a genome and providing a list of genes or genomic regions whose TE associations the user wants to identify, the user can rapidly obtain TE subfamilies found near the provided regions, as well as their superfamily and class, and the enrichment values of the repeats. The results also provide the locations of individual repeat instances found, alongside the input regions or genes they are associated with, and a bar graph of the top ten most significant repeat subfamilies identified. PlanTEnrichment is freely available at http://tools.ibg.deu.edu.tr/plantenrichment/ and can be used by researchers with rudimentary or no proficiency in computational analysis of TE elements, allowing for expedience in the identification of TEs of interest and helping further our understanding of the potential contributions of TEs in plant genomes.",
                "authors": [
                    {
                        "name": "Aribas A."
                    },
                    {
                        "name": "Eskier D."
                    },
                    {
                        "name": "Karakulah G."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "PlanTEnrichment: A How-to Guide on Rapid Identification of Transposable Elements Associated with Regions of Interest in Select Plant Genomes"
            },
            "pmid": "37646937"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
