{
    "accessibility": "Open access",
    "additionDate": "2023-02-10T15:01:09.861288Z",
    "biotoolsCURIE": "biotools:tomexo",
    "biotoolsID": "tomexo",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jens.lagergren@scilifelab.se",
            "name": "Jens Lagergren",
            "orcidid": "https://orcid.org/0000-0002-4552-0240",
            "typeEntity": "Person"
        },
        {
            "name": "Mohammadreza Mohaghegh Neyshabouri,",
            "orcidid": "https://orcid.org/0000-0002-0782-8308"
        }
    ],
    "description": "A probabilistic tree-structured model for cancer progression.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic inference (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mrmohaghegh/tomexo",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:03:22.270212Z",
    "license": "MIT",
    "name": "ToMExO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1010732",
            "metadata": {
                "abstract": "Identifying the interrelations among cancer driver genes and the patterns in which the driver genes get mutated is critical for understanding cancer. In this paper, we study cross-sectional data from cohorts of tumors to identify the cancer-type (or subtype) specific process in which the cancer driver genes accumulate critical mutations. We model this mutation accumulation process using a tree, where each node includes a driver gene or a set of driver genes. A mutation in each node enables its children to have a chance of mutating. This model simultaneously explains the mutual exclusivity patterns observed in mutations in specific cancer genes (by its nodes) and the temporal order of events (by its edges). We introduce a computationally efficient dynamic programming procedure for calculating the likelihood of our noisy datasets and use it to build our Markov Chain Monte Carlo (MCMC) inference algorithm, ToMExO. Together with a set of engineered MCMC moves, our fast likelihood calculations enable us to work with datasets with hundreds of genes and thousands of tumors, which cannot be dealt with using available cancer progression analysis methods. We demonstrate our method’s performance on several synthetic datasets covering various scenarios for cancer progression dynamics. Then, a comparison against two state-of-the-art methods on a moderate-size biological dataset shows the merits of our algorithm in identifying significant and valid patterns. Finally, we present our analyses of several large biological datasets, including colorectal cancer, glioblastoma, and pancreatic cancer. In all the analyses, we validate the results using a set of method-independent metrics testing the causality and significance of the relations identified by ToMExO or competing methods.",
                "authors": [
                    {
                        "name": "Lagergren J."
                    },
                    {
                        "name": "Neyshabouri M.M."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "ToMExO: A probabilistic tree-structured model for cancer progression"
            },
            "pmcid": "PMC9754607",
            "pmid": "36469540"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
