{
    "additionDate": "2017-01-13T13:14:06Z",
    "biotoolsCURIE": "biotools:cloudburst",
    "biotoolsID": "cloudburst",
    "credit": [
        {
            "email": "mschatz@umiacs.umd.edu",
            "name": "Schatz MC",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CloudBurst is a parallel read-mapping algorithm optimized for mapping next-generation sequence data to the human genome and other reference genomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/cloudburst-bio/wiki/CloudBurst/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/cloudburst-bio/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "maturity": "Legacy",
    "name": "CloudBurst",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Next-generation DNA sequencing machines are generating an enormous amount of sequence data, placing unprecedented demands on traditional single-processor read-mapping algorithms. CloudBurst is a new parallel read-mapping algorithm optimized for mapping next-generation sequence data to the human genome and other reference genomes, for use in a variety of biological analyses including SNP discovery, genotyping and personal genomics. It is modeled after the short read-mapping program RMAP, and reports either all alignments or the unambiguous best alignment for each read with any number of mismatches or differences. This level of sensitivity could be prohibitively time consuming, but CloudBurst uses the open-source Hadoop implementation of MapReduce to parallelize execution using multiple compute nodes. Results: CloudBurst's running time scales linearly with the number of reads mapped, and with near linear speedup as the number of processors increases. In a 24-processor core configuration, CloudBurst is up to 30 times faster than RMAP executing on a single core, while computing an identical set of alignments. Using a larger remote compute cloud with 96 cores, CloudBurst improved performance by >100-fold, reducing the running time from hours to mere minutes for typical jobs involving mapping of millions of short reads to the human genome. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Schatz M.C."
                    }
                ],
                "citationCount": 486,
                "date": "2009-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CloudBurst: Highly sensitive read mapping with MapReduce"
            },
            "pmid": "19357099"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}