{
    "additionDate": "2017-08-03T19:06:07Z",
    "biotoolsCURIE": "biotools:idna-methyl",
    "biotoolsID": "idna-methyl",
    "credit": [
        {
            "email": "jdzxiaoxuan@163.com",
            "name": "Xuan Xiao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.jci-bioinfo.cn/"
        }
    ],
    "description": "This web-server is according to its genetic codes by combining its trinucleotide composition (TNC) and the pseudo amino acid components (PseAAC) of the protein translated from the DNA sample. And by means of the approach of optimizing training datasets for predicting DNA methylation sites. Rigorous cross-validations on a set of experiment-confirmed datasets have indicated that these new predictors remarkably outperformed their counterparts in the existing prediction methods.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.jci-bioinfo.cn/DNAmethy/IDM_readme.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://www.jci-bioinfo.cn/iDNA-Methyl",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/idna-methyl-identifying-dna-methylation-sites-via-pseudo-trinucleotide-composition.html"
        }
    ],
    "name": "iDNA-Methyl",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2014 Elsevier Inc. All rights reserved.Predominantly occurring on cytosine, DNA methylation is a process by which cells can modify their DNAs to change the expression of gene products. It plays very important roles in life development but also in forming nearly all types of cancer. Therefore, knowledge of DNA methylation sites is significant for both basic research and drug development. Given an uncharacterized DNA sequence containing many cytosine residues, which one can be methylated and which one cannot? With the avalanche of DNA sequences generated during the postgenomic age, it is highly desired to develop computational methods for accurately identifying the methylation sites in DNA. Using the trinucleotide composition, pseudo amino acid components, and a dataset-optimizing technique, we have developed a new predictor called \"iDNA-Methyl\" that has achieved remarkably higher success rates in identifying the DNA methylation sites than the existing predictors. A user-friendly web-server for the new predictor has been established at http://www.jci-bioinfo.cn/iDNA-Methyl, where users can easily get their desired results. We anticipate that the web-server predictor will become a very useful high-throughput tool for basic research and drug development and that the novel approach and technique can also be used to investigate many other DNA-related problems and genome analysis.",
                "authors": [
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Xiao X."
                    },
                    {
                        "name": "Qiu W.-R."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 234,
                "date": "2015-04-01T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "IDNA-Methyl: Identifying DNA methylation sites via pseudo trinucleotide composition"
            },
            "pmid": "25596338"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}