{
    "additionDate": "2018-05-18T11:17:02Z",
    "biotoolsCURIE": "biotools:sparta",
    "biotoolsID": "sparta",
    "credit": [
        {
            "email": "john3434@msu.edu",
            "name": "Benjamin K. Johnson",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "matthew.b.scholz@vanderbilt.edu",
            "name": "Matthew B. Scholz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "tkteal@datacarpentry.org",
            "name": "Tracy K. Teal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "abramov5@msu.edu",
            "name": "Robert B. Abramovitch",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simple Program for Automated reference-based bacterial RNA-seq Transcriptome Analysis. Analyze single-end Illumina RNA-seq data combining several tools: Trimmomatic (read trimming/adapter removal), FastQC (read quality analysis), Bowtie (mapping reads to the reference genome), HTSeq (transcript/gene feature abundance counting), and edgeR (differential gene expression analysis).",
    "documentation": [
        {
            "note": "Mac OS Tutorial",
            "type": [
                "General"
            ],
            "url": "http://sparta.readthedocs.io/en/latest/mactut.html"
        },
        {
            "note": "Windows Tutorial",
            "type": [
                "General"
            ],
            "url": "http://sparta.readthedocs.io/en/latest/wintut.html"
        },
        {
            "note": "Linux Tutorial",
            "type": [
                "General"
            ],
            "url": "http://sparta.readthedocs.io/en/latest/lintut.html"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "http://sparta-teaching.readthedocs.io/en/latest/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://sparta.readthedocs.io/en/latest/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-01-15T02:29:19Z",
    "license": "CC-BY-4.0",
    "name": "SPARTA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1186/s12859-016-0923-y",
            "metadata": {
                "abstract": "© 2016 Johnson et al.Background: Many tools exist in the analysis of bacterial RNA sequencing (RNA-seq) transcriptional profiling experiments to identify differentially expressed genes between experimental conditions. Generally, the workflow includes quality control of reads, mapping to a reference, counting transcript abundance, and statistical tests for differentially expressed genes. In spite of the numerous tools developed for each component of an RNA-seq analysis workflow, easy-to-use bacterially oriented workflow applications to combine multiple tools and automate the process are lacking. With many tools to choose from for each step, the task of identifying a specific tool, adapting the input/output options to the specific use-case, and integrating the tools into a coherent analysis pipeline is not a trivial endeavor, particularly for microbiologists with limited bioinformatics experience. Results: To make bacterial RNA-seq data analysis more accessible, we developed a Simple Program for Automated reference-based bacterial RNA-seq Transcriptome Analysis (SPARTA). SPARTA is a reference-based bacterial RNA-seq analysis workflow application for single-end Illumina reads. SPARTA is turnkey software that simplifies the process of analyzing RNA-seq data sets, making bacterial RNA-seq analysis a routine process that can be undertaken on a personal computer or in the classroom. The easy-to-install, complete workflow processes whole transcriptome shotgun sequencing data files by trimming reads and removing adapters, mapping reads to a reference, counting gene features, calculating differential gene expression, and, importantly, checking for potential batch effects within the data set. SPARTA outputs quality analysis reports, gene feature counts and differential gene expression tables and scatterplots. Conclusions: SPARTA provides an easy-to-use bacterial RNA-seq transcriptional profiling workflow to identify differentially expressed genes between experimental conditions. This software will enable microbiologists with limited bioinformatics experience to analyze their data and integrate next generation sequencing (NGS) technologies into the classroom. The SPARTA software and tutorial are available at sparta.readthedocs.org.",
                "authors": [
                    {
                        "name": "Johnson B.K."
                    },
                    {
                        "name": "Scholz M.B."
                    },
                    {
                        "name": "Teal T.K."
                    },
                    {
                        "name": "Abramovitch R.B."
                    }
                ],
                "citationCount": 20,
                "date": "2016-02-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SPARTA: Simple Program for Automated reference-based bacterial RNA-seq Transcriptome Analysis"
            },
            "pmcid": "PMC4743240",
            "pmid": "26847232",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "The families of aunts and uncles of cystic fibrosis (CF) patients were compared with one another and with controls in order to test claims of increased fertility and sex ratio in families containing the CF allele and to identify the more fertile sex. Uncles' families were found to contain a significant excess of sons, particularly at primiparous births, as well as a significantly increased sex ratio. Reanalysis of published records of CF sibships confirmed the effect of parity on sex ratio. The families of uncles were also exceptional in exceeding the size intended, although their mean size was not raised significantly. It is suggested that these effects could be related to an interaction between CF-related, paternally-derived antigens and the maternal immune system.",
                "authors": [
                    {
                        "name": "Pritchard D.J."
                    },
                    {
                        "name": "Hickman G.R."
                    },
                    {
                        "name": "Nelson R."
                    }
                ],
                "citationCount": 8,
                "date": "1983-01-01T00:00:00Z",
                "journal": "Archives of Disease in Childhood",
                "title": "Sex ratio and heterozygote advantage in cystic fibrosis families"
            },
            "pmid": "6847232",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}