{
    "additionDate": "2017-08-03T18:37:24Z",
    "biotoolsCURIE": "biotools:bisa",
    "biotoolsID": "bisa",
    "credit": [
        {
            "email": "mkhushi@uni.sydney.edu.au",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bisa.sourceforge.net/"
        }
    ],
    "description": "Binding sites analyser is a database driven software and stores all of its data in a relational database management system (RDBMS) such as SQL Server in Windows or PostgreSQL on Linux.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bisa.sourceforge.net/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence database search",
                    "uri": "http://edamontology.org/operation_0338"
                }
            ]
        }
    ],
    "homepage": "http://bisa.sourceforge.net/",
    "language": [
        "C#",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/bisa-genomic-regions-binding-sites-analysis.html"
        }
    ],
    "name": "BiSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Genome-wide mapping of transcription factor binding and histone modification reveals complex patterns of interactions. Identifying overlaps in binding patterns by different factors is a major objective of genomic studies, but existing methods to archive large numbers of datasets in a personalised database lack sophistication and utility. Therefore we have developed transcription factor DNA binding site analyser software (BiSA), for archiving of binding regions and easy identification of overlap with or proximity to other regions of interest. Analysis results can be restricted by chromosome or base pair overlap between regions or maximum distance between binding peaks. BiSA is capable of reporting overlapping regions that share common base pairs; regions that are nearby; regions that are not overlapping; and average region sizes. BiSA can identify genes located near binding regions of interest, genomic features near a gene or locus of interest and statistical significance of overlapping regions can also be reported. Overlapping results can be visualized as Venn diagrams. A major strength of BiSA is that it is supported by a comprehensive database of publicly available transcription factor binding sites and histone modifications, which can be directly compared to user data. The documentation and source code are available on http://bisa.sourceforge.net © 2014 Khushi et al.",
                "authors": [
                    {
                        "name": "Clarke C.L."
                    },
                    {
                        "name": "Graham J.D."
                    },
                    {
                        "name": "Khushi M."
                    },
                    {
                        "name": "Liddle C."
                    }
                ],
                "citationCount": 9,
                "date": "2014-02-12T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Binding Sites Analyser (BiSA): Software for genomic binding sites archiving and overlap analysis"
            },
            "pmid": "24533055"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1
}
