{
    "accessibility": "Open access",
    "additionDate": "2022-06-17T13:23:00.425134Z",
    "biotoolsCURIE": "biotools:lcmd",
    "biotoolsID": "lcmd",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liaopc@mail.ncku.edu.tw",
            "name": "Pao-Chi Liao",
            "typeEntity": "Person"
        }
    ],
    "description": "The Lung Cancer Metabolome Database (LCMD), a freely available online database depositing 2013 lung cancer-related metabolites identified from 65 mass spectrometry-based lung cancer metabolomics studies.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "http://cosbi7.ee.ncku.edu.tw/LCMD/",
    "lastUpdate": "2022-06-17T13:23:24.992802Z",
    "license": "Not licensed",
    "name": "LCMD",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2021.12.002",
            "metadata": {
                "abstract": "© 2021 The AuthorsLung cancer, one of the most common causes of cancer-related death worldwide, has been associated with high treatment cost and imposed great burdens. The 5-year postoperative survival rate of lung cancer (13%) is lower than many other leading cancers indicating the urgent needs to dissect its pathogenic mechanisms and discover specific biomarkers. Although several proteins have been proposed to be potential candidates for the diagnosis of lung cancer, they present low accuracy in clinical settings. Metabolomics has thus emerged as a very promising tool for biomarker discovery. To date, many lung cancer-related metabolites have been highlighted in the literature but no database is available for scientists to retrieve this information. Herein, we construct and introduce the first Lung Cancer Metabolome Database (LCMD), a freely available online database depositing 2013 lung cancer-related metabolites identified from 65 mass spectrometry-based lung cancer metabolomics studies. Researchers are able to explore LCMD via two ways. Firstly, by applying various filters in the “Browse Metabolites” mode, users can access a list of lung cancer-related metabolites that satisfy the filter specifications. For each metabolite, users can acquire the value of the fold change (cancer/normal), statistical significance (p-value) of the fold change, and the comparative research designs of all the mass spectrometry-based lung cancer metabolomics studies that identify this metabolite. Secondly, by applying various filters in the “Browse Studies” mode, users can obtain a list of mass spectrometry-based lung cancer metabolomics studies that satisfy the filter specifications. For each study, users can view the type of studied specimen, mass spectrometry (MS) method, MS data processing software, and differential analysis method, as well as all the identified lung cancer-related metabolites. Furthermore, the overview of each study is clearly illustrated by a graphical summary. The LCMD (http://cosbi7.ee.ncku.edu.tw/LCMD/) is the first database that brings together the meaningful information of lung cancer-related metabolites. The development of the LCMD is envisioned to promote the biomarker discovery of lung cancer.",
                "authors": [
                    {
                        "name": "Chang C.-W."
                    },
                    {
                        "name": "Chang W.C.-W."
                    },
                    {
                        "name": "Chen K.-R."
                    },
                    {
                        "name": "Chen T.-Y."
                    },
                    {
                        "name": "Lee D.-E."
                    },
                    {
                        "name": "Liao P.-C."
                    },
                    {
                        "name": "Lin B.-H."
                    },
                    {
                        "name": "Wang P.-H."
                    },
                    {
                        "name": "Wu H.-Y."
                    },
                    {
                        "name": "Wu W.-S."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "LCMD: Lung Cancer Metabolome Database"
            },
            "pmcid": "PMC8683384",
            "pmid": "34976312"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
