{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-07-06T11:24:01.586347Z",
    "biotoolsCURIE": "biotools:hiplot",
    "biotoolsID": "hiplot",
    "confidence_flag": "tool",
    "cost": "Free of charge (with restrictions)",
    "description": "Hiplot (https://hiplot.org) provides concise and top-quality data visualization applications for the life sciences and biomedical fields. This web service permits users to conveniently and interactively complete a few specialized visualization tasks that previously could only be conducted by senior bioinformatics or biostatistics researchers. It covers most of the daily demands of biomedical researchers with its equipped 240+ biomedical data visualization functions, involving basic statistics, multi-omics, regression, clustering, dimensional reduction, meta-analysis, survival analysis, risk modelling, etc.\n\nHiplot (ORG) is maintained and updated by the Openbiox open-source community.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://hiplot.org/docs/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://hiplot.org",
    "language": [
        "JavaScript",
        "Other",
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2023-04-22T11:56:08.833061Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/hiplot"
        },
        {
            "type": [
                "Service"
            ],
            "url": "https://hiplot.org"
        }
    ],
    "maturity": "Emerging",
    "name": "Hiplot",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "lee_jianfeng",
    "publication": [
        {
            "doi": "10.1093/bib/bbac261",
            "metadata": {
                "abstract": "Complex biomedical data generated during clinical, omics and mechanism-based experiments have increasingly been exploited through cloud-and visualization-based data mining techniques. However, the scientific community still lacks an easy-To-use web service for the comprehensive visualization of biomedical data, particularly high-quality and publication-ready graphics that allow easy scaling and updatability according to user demands. Therefore, we propose a community-driven modern web service, Hiplot (https://hiplot.org), with concise and top-quality data visualization applications for the life sciences and biomedical fields. This web service permits users to conveniently and interactively complete a few specialized visualization tasks that previously could only be conducted by senior bioinformatics or biostatistics researchers. It covers most of the daily demands of biomedical researchers with its equipped 240+ biomedical data visualization functions, involving basic statistics, multi-omics, regression, clustering, dimensional reduction, meta-Analysis, survival analysis, risk modelling, etc. Moreover, to improve the efficiency in use and development of plugins, we introduced some core advantages on the client-/server-side of the website, such as spreadsheet-based data importing, cross-platform command-line controller (Hctl), multi-user plumber workers, JavaScript Object Notation-based plugin system, easy data/parameters, results and errors reproduction and real-Time updates mode. Meanwhile, using demo/real data sets and benchmark tests, we explored statistical parameters, cancer genomic landscapes, disease risk factors and the performance of website based on selected native plugins. The statistics of visits and user numbers could further reflect the potential impact of this web service on relevant fields. Thus, researchers devoted to life and data sciences would benefit from this emerging and free web service.",
                "authors": [
                    {
                        "name": "Bao Z."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Chen Z."
                    },
                    {
                        "name": "Cheng W."
                    },
                    {
                        "name": "Dong W."
                    },
                    {
                        "name": "Duan S."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu X.-S."
                    },
                    {
                        "name": "Lou J."
                    },
                    {
                        "name": "Miao B."
                    },
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Si C."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Wu R."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Yang Z."
                    },
                    {
                        "name": "Zeng H."
                    },
                    {
                        "name": "Zeng J."
                    },
                    {
                        "name": "Zhao F."
                    }
                ],
                "citationCount": 28,
                "date": "2022-07-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Hiplot: A comprehensive and easy-To-use web service for boosting publication-ready biomedical data visualization"
            },
            "pmid": "35788820",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ]
}
