{
    "additionDate": "2020-01-09T18:03:04Z",
    "biotoolsCURIE": "biotools:HydroSight",
    "biotoolsID": "HydroSight",
    "confidence_flag": "tool",
    "description": "Joint Estimation of Gross Recharge, Groundwater Usage, and Hydraulic Properties within HydroSight.\n\nA toolbox for data-driven hydrogeological insights.\n\nWebsites for you and your projects, hosted directly from your GitHub repository. Just edit, push, and your changes are live.\n\nWebsites for you and your projects.\n\nHydroSight is a highly flexible statistical toolbox for quantitative hydrogeological insights. It comprises of a powerful groundwater hydrograph time-series modelling and simulation framework plus a data quality analysis module. Multiple models can be built for one bore, allowing statistical identification of the dominant processes, or 100’s of bores can be modelled to quantify aquifer heterogeneity. This flexibility allows many novel applications such as:.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://peterson-tim-j.github.io/HydroSight/",
    "lastUpdate": "2020-12-11T08:04:13Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://github.com/peterson-tim-j/HydroSight/tree/master"
        }
    ],
    "name": "HydroSight",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/GWAT.12946",
            "metadata": {
                "abstract": "© 2019, National Ground Water Association.Groundwater management decisions are often founded upon estimates of aquifer hydraulic properties, recharge and the rate of groundwater usage. Too often hydraulic properties are unavailable, recharge estimates are very uncertain, and usage is unmetered or infrequently metered over only recent years or estimated using numerical groundwater models decoupled from the drivers of drawdown. This paper extends the HydroSight groundwater time-series package (http://peterson-tim-j.github.io/HydroSight/) to allow the joint estimation of gross recharge, transmissivity, storativity, and daily usage at multiple production bores. A genetic evolutionary scheme was extended from estimating time-series model parameters to also estimating time series of usage that honor metered volumes at each production bore and produces (1) the best fit with the observed hydrograph and (2) plausible estimates of actual evapotranspiration and hence recharge. The reliability of the approach was rigorously tested. Repeated calibration of models for four bores produced estimates of transmissivity, storativity, and mean recharge that varied by a factor of 0.22-0.32, 0.13-0.2, and 0.03-0.48, respectively, when recharge boundary effects were low and the error in monthly, quarterly, and biannual metered usage was generally <10%. Application to the 30 observation bores within the Warrion groundwater management area (Australia), produced a coefficient of efficiency of ≥0.80 at 22 bores and ≥0.90 at 12 bores. The aquifer transmissivity and storativity were reasonably estimated, and were consistent with independent estimates, while mean gross recharge may be slightly overestimated. Overall, the approach allows greater insights from the available data and provides opportunity for the exploration of usage and climatic scenarios.",
                "authors": [
                    {
                        "name": "Peterson T.J."
                    },
                    {
                        "name": "Fulton S."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Groundwater",
                "title": "Joint Estimation of Gross Recharge, Groundwater Usage, and Hydraulic Properties within HydroSight"
            },
            "pmid": "31569268"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}