{
    "additionDate": "2020-01-14T08:54:09Z",
    "biotoolsCURIE": "biotools:caspr-rna",
    "biotoolsID": "caspr-rna",
    "confidence_flag": "tool",
    "description": "An analysis pipeline for single and paired guide RNA CRISPR screens, reveals optimal target selection for long noncoding RNAs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://judithbergada.github.io/CASPR/",
    "lastUpdate": "2020-12-10T13:35:28Z",
    "name": "CASPR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ811",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: CRISPR-Cas9 loss-of-function (LOF) pooled screening promises to identify which long non-coding RNAs (lncRNAs), amongst the many thousands to have been annotated so far, are capable of mediating cellular functions. The two principal LOF perturbations, CRISPR-inhibition and CRISPR-deletion, employ one and two guide RNAs, respectively. However, no software solution has the versatility to identify hits across both modalities, and the optimal design parameters for such screens remain poorly understood. Results: Here, we present CRISPR Analysis for Single and Paired RNA-guides (CASPR), a user-friendly, end-to-end screen analysis tool. CASPR is compatible with both CRISPRi and CRISPR-del screens, and balances sensitivity and specificity by generating consensus predictions from multiple algorithms. Benchmarking on ground-truth sets of cancer-associated lncRNAs demonstrates CASPR’s improved sensitivity with respect to existing methods. Applying CASPR to published screens, we identify two parameters that predict lncRNA hits: expression and annotation quality of the transcription start site. Thus, CASPR is a versatile and complete solution for lncRNA CRISPR screen analysis, and reveals principles for including lncRNAs in screening libraries.",
                "authors": [
                    {
                        "name": "Bergada-Pijuan J."
                    },
                    {
                        "name": "Pulido-Quetglas C."
                    },
                    {
                        "name": "Vancura A."
                    },
                    {
                        "name": "Johnson R."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CASPR, an analysis pipeline for single and paired guide RNA CRISPR screens, reveals optimal target selection for long non-coding RNAs"
            },
            "pmid": "31681950"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}