
{
    "credit": [
        {
            "email": "timolassmann@gmail.com",
            "name": "TagDust Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "TagDust"
        ],
        "language": [
            "C"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Next-generation parallel sequencing technologies produce large quantities of short sequence reads. Due to experimental procedures various types of artifacts are commonly sequenced alongside the targeted RNA or DNA sequences. Identification of such artifacts is important during the development of novel sequencing assays and for the downstream analysis of the sequenced libraries. Results: Here we present TagDust, a program identifying artifactual sequences in large sequencing runs. Given a user-defined cutoff for the false discovery rate, TagDust identifies all reads explainable by combinations and partial matches to known sequences used during library preparation. We demonstrate the quality of our method on sequencing runs performed on Illumina's Genome Analyzer platform. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Lassmann T.",
                "Hayashizaki Y.",
                "Daub C.O."
            ],
            "cit_count": 128,
            "journal": "Bioinformatics",
            "pmid": "19737799",
            "title": "TagDust - A program to eliminate artifacts from next generation sequencing data",
            "year": "2009-11-09"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tagdust",
        "biotoolsID": "tagdust",
        "description": "TagDust, a program identifying artifactual sequences in large sequencing runs. Given a user-defined cutoff for the false discovery rate (FDR), TagDust identifies all reads explainable by combinations and partial matches to known sequences used during library preparation.",
        "homepage": "http://genome.gsc.riken.jp/osc/english/software/",
        "name": "TagDust"
    }
}