{
    "additionDate": "2017-08-03T18:56:36Z",
    "biotoolsCURIE": "biotools:prompredict",
    "biotoolsID": "prompredict",
    "credit": [
        {
            "email": "mb@mbu.iisc.ernet.in",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://nucleix.mbu.iisc.ernet.in/prompredict/contact.html"
        }
    ],
    "description": "Tool to identify promoter regions in genomic DNA sequence, based on difference in stability between neighboring regions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://nucleix.mbu.iisc.ernet.in/prompredict/prompredict-intro.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "http://nucleix.mbu.iisc.ernet.in/prompredict/prompredict.html",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/prompredict-200803-promoter-identification-genomic-dna-sequence.html"
        }
    ],
    "name": "PromPredict",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "The rapid increase in genome sequence information has necessitated the annotation of their functional elements, particularly those occurring in the non-coding regions, in the genomic context. Promoter region is the key regulatory region, which enables the gene to be transcribed or repressed, but it is difficult to determine experimentally. Hence an in silico identification of promoters is crucial in order to guide experimental work and to pin point the key region that controls the transcription initiation of a gene. In this analysis, we demonstrate that while the promoter regions are in general less stable than the flanking regions, their average free energy varies depending on the GC composition of the flanking genomic sequence. We have therefore obtained a set of free energy threshold values, for genomic DNA with varying GC content and used them as generic criteria for predicting promoter regions in several microbial genomes, using an in-house developed tool 'PromPredict'. On applying it to predict promoter regions corresponding to the 1144 and 612 experimentally validated TSSs in E. coli (50.8% GC) and B. subtilis (43.5% GC) sensitivity of 99% and 95% and precision values of 58% and 60%, respectively, were achieved. For the limited data set of 81 TSSs available for M. tuberculosis (65.6% GC) a sensitivity of 100% and precision of 49% was obtained. © 2009 The Royal Society of Chemistry.",
                "authors": [
                    {
                        "name": "Bansal M."
                    },
                    {
                        "name": "Rangannan V."
                    }
                ],
                "citationCount": 22,
                "date": "2009-12-01T00:00:00Z",
                "journal": "Molecular BioSystems",
                "title": "Relative stability of DNA as a generic criterion for promoter prediction: Whole genome annotation of microbial genomes with varying nucleotide base composition"
            },
            "pmid": "19593472"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
