{
    "additionDate": "2017-02-14T09:35:36Z",
    "biotoolsCURIE": "biotools:nq-flipper",
    "biotoolsID": "nq-flipper",
    "credit": [
        {
            "email": "flipper@came.sbg.ac.at",
            "name": "Chris Weichenberger",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "NQ-Flipper recognizes unfavorable rotamers of Asn and Gln residues in protein structures.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://flipper.services.came.sbg.ac.at/cgi-bin/help.php"
        }
    ],
    "editPermission": {
        "authors": [
            "cweich"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Protein modelling (mutation)",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Protein modelling (side chains)",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://flipper.services.came.sbg.ac.at/cgi-bin/flipper.php",
    "language": [
        "Java",
        "JavaScript"
    ],
    "lastUpdate": "2019-07-04T10:37:24Z",
    "name": "NQ-Flipper",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Summary: The error rate of asparagine (Asn) and glutamine (Gln) amide rotamers in protein crystal structures is in the order of 20% and as a consequence the current Protein Database (PDB) contains approximately half a million incorrect Asn and Gln side-chain rotamers. Here we present NQ-Flipper, a web service based on knowledge-based potentials of mean force to automatically detect and correct erroneous rotamers. We achieve excellent agreement with expert curated data. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Sippl M.J."
                    },
                    {
                        "name": "Weichenberger C.X."
                    }
                ],
                "citationCount": 26,
                "date": "2006-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "NQ-Flipper: Validation and correction of asparagine/glutamine amide rotamers in protein crystal structures"
            },
            "pmid": "16595557"
        },
        {
            "metadata": {
                "abstract": "The current Protein Data Bank (PDB) contains about 40 000 protein structures with approximately half a million incorrect atom positions resulting from erroneously assigned asparagine (Asn) and glutamine (Gln) rotamers. These errors affect applications in protein structure analysis, modeling and docking and therefore the detection, correction and prevention of such errors is highly desirable. We present NQ-Flipper, a web service based on mean force potentials to automatically detect and correct erroneous Asn and Gln rotamers. The service accepts protein structure files formatted in PDB style or PDB codes. For an Asn/Gln side-chain amide NQ-Flipper computes the total interaction energy with the surrounding atoms as the sum of pairwise atom-atom interaction energies. The energy difference between the original and the alternative rotamers identifies the correct configuration of the amide group. The web service lists the interaction energies of all Asn/Gln residues found in a PDB file and shows the structure and offending residues in an interactive 3D viewer. The corrected protein structure is available for download in various compression formats. The web service is accessible at http://flipper.services.came.sbg.ac.at. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Sippl M.J."
                    },
                    {
                        "name": "Weichenberger C.X."
                    }
                ],
                "citationCount": 44,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "NQ-Flipper: Recognition and correction of erroneous asparagine and glutamine side-chain rotamers in protein structures"
            },
            "pmid": "17478502"
        },
        {
            "metadata": {
                "abstract": "The current protein structure database contains unfavorable Asn/Gln amide rotamers in the order of 20%. Here, we derive a set of self-consistent potential functions to identify and correct unfavorable rotamers. Potentials of mean force for all heavy atoms are compiled from a database of high-resolution protein crystal structures. Starting from erroneous data, a refinement-correction cycle quickly converges to a self-consistent set of potentials. The refinement is entirely driven by the deposited structure data and does not involve any assumptions on molecular interactions or any artificial constraints. The refined potentials obtained in this way identify unfavorable rotamers with high confidence. Since the state of Asn/Gln rotamers is largely determined by hydrogen bond interactions, the features of the respective potentials are of interest in terms of molecular interactions, protein structure refinement, and prediction. The Asn/Gln rotamer assignment is available as a public web service intended to support protein structure refinement and modeling. © 2006 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Sippl M.J."
                    },
                    {
                        "name": "Weichenberger C.X."
                    }
                ],
                "citationCount": 21,
                "date": "2006-06-01T00:00:00Z",
                "journal": "Structure",
                "title": "Self-Consistent Assignment of Asparagine and Glutamine Amide Rotamers in Protein Crystal Structures"
            },
            "pmid": "16765889"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}
