{
    "additionDate": "2021-01-18T10:24:30Z",
    "biotoolsCURIE": "biotools:anem",
    "biotoolsID": "anem",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gpenny@nd.edu",
            "name": "Gopal Penny",
            "typeEntity": "Person"
        }
    ],
    "description": "A Simple Web-Based Platform to Build Stakeholder Understanding of Groundwater Behavior.\nThis package models simple aquifer and well configurations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://gopalpenny.shinyapps.io/anem-app",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-23T15:38:29Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/gopalpenny/anem"
        }
    ],
    "name": "anem",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/GWAT.13043",
            "metadata": {
                "abstract": "© 2020 National Ground Water AssociationGroundwater supports essential societal and ecological functions by acting as a reservoir that buffers against natural variability. Increasing water scarcity and climate variability have resulted in more intensive management of groundwater resources, but groundwater often remains difficult to understand and manage. With this in mind, we develop a simple platform that provides a straightforward, web-based user interface applicable to a wide variety of end-user scenarios. Groundwater behavior is modeled using the method of images in a new R package, anem, which serves as the engine for the web platform, anem-app, produced using R Shiny. Both tools allow users to define aquifer properties and pumping wells, view maps of hydraulic head, and simulate particle tracking under steady-state conditions. These tools have the advantage of being platform independent and open source, so that they are freely available to anyone with a web browser and internet connection (anem-app) or computing platform with R installed (anem). We designed both tools to lower the learning curve and up-front costs to building simple groundwater models. The simplicity of the web application allows exploration of groundwater behavior under various conditions, and should be especially valuable in low-budget applications where advanced analysis may not be practical or necessary. Integration with the R language allows for advanced analysis and deeper exploration of groundwater dynamics. In this manuscript, we describe how anem and anem-app are built in the R environment and demonstrate how they might be used by planners or stakeholders.",
                "authors": [
                    {
                        "name": "Penny G."
                    },
                    {
                        "name": "Mullen C."
                    },
                    {
                        "name": "Bolster D."
                    },
                    {
                        "name": "Huber B."
                    },
                    {
                        "name": "Muller M.F."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Groundwater",
                "title": "anem: A Simple Web-Based Platform to Build Stakeholder Understanding of Groundwater Behavior"
            },
            "pmid": "32856793"
        }
    ],
    "toolType": [
        "Web application",
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}