{
    "additionDate": "2024-03-06T13:04:32.190508Z",
    "biotoolsCURIE": "biotools:micone",
    "biotoolsID": "micone",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dsegre@bu.edu",
            "name": "Daniel Segrè",
            "orcidid": "https://orcid.org/0000-0003-4859-1914",
            "typeEntity": "Person"
        },
        {
            "email": "korolev@bu.edu",
            "name": "Kirill S. Korolev",
            "typeEntity": "Person"
        }
    ],
    "description": "Inferring microbial co-occurrence networks from amplicon data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://micone.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "https://github.com/segrelab/MiCoNE",
    "language": [
        "Groovy",
        "Python",
        "R",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T14:12:15.680363Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/segrelab/MiCoNE-pipeline-paper"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/segrelab/MiCoNE-synthetic-data"
        }
    ],
    "name": "MiCoNE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1128/msystems.00961-22",
            "metadata": {
                "abstract": "Microbes commonly organize into communities consisting of hundreds of species involved in complex interactions with each other. 16S ribosomal RNA (16S rRNA) amplicon profiling provides snapshots that reveal the phylogenies and abundance profiles of these microbial communities. These snapshots, when collected from multiple samples, can reveal the co-occurrence of microbes, providing a glimpse into the network of associations in these communities. However, the inference of networks from 16S data involves numerous steps, each requiring specific tools and parameter choices. Moreover, the extent to which these steps affect the final network is still unclear. In this study, we perform a meticulous analysis of each step of a pipeline that can convert 16S sequencing data into a network of microbial associations. Through this process, we map how different choices of algorithms and parameters affect the co-occurrence network and identify the steps that contribute substantially to the variance. We further determine the tools and parameters that generate robust co-occurrence networks and develop consensus network algorithms based on benchmarks with mock and synthetic data sets. The Microbial Co-occurrence Network Explorer, or MiCoNE (available at https://github.com/segrelab/MiCoNE) follows these default tools and parameters and can help explore the outcome of these combinations of choices on the inferred networks. We envisage that this pipeline could be used for integrating multiple data sets and generating comparative analyses and consensus networks that can guide our understanding of microbial community assembly in different biomes. IMPORTANCE Mapping the interrelationships between different species in a microbial community is important for understanding and controlling their structure and function. The surge in the high-throughput sequencing of microbial communities has led to the creation of thousands of data sets containing information about microbial abundances. These abundances can be transformed into co-occurrence networks, providing a glimpse into the associations within microbiomes. However, processing these data sets to obtain co-occurrence information relies on several complex steps, each of which involves numerous choices of tools and corresponding parameters. These multiple options pose questions about the robustness and uniqueness of the inferred networks. In this study, we address this workflow and provide a systematic analysis of how these choices of tools affect the final network and guidelines on appropriate tool selection for a particular data set. We also develop a consensus network algorithm that helps generate more robust co-occurrence networks based on benchmark synthetic data sets.",
                "authors": [
                    {
                        "name": "Birzu G."
                    },
                    {
                        "name": "DeLisi C."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Kishore D."
                    },
                    {
                        "name": "Korolev K.S."
                    },
                    {
                        "name": "Segre D."
                    }
                ],
                "citationCount": 4,
                "date": "2023-07-01T00:00:00Z",
                "journal": "mSystems",
                "title": "Inferring microbial co-occurrence networks from amplicon data: a systematic evaluation"
            },
            "pmcid": "PMC10469762",
            "pmid": "37338270"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
