{
    "additionDate": "2020-01-09T17:39:53Z",
    "biotoolsCURIE": "biotools:MAGO",
    "biotoolsID": "MAGO",
    "confidence_flag": "tool",
    "description": "Computational framework for high-quality production and large-scale evolutionary analysis of metagenome assembled genomes.\n\nMicrobial species play important roles in different environments and the production of high-quality genomes from metagenome datasets represents a major obstacle to understanding their ecological and evolutionary dynamics. Metagenome-Assembled Genomes Orchestra (MAGO) is a computational framework that integrates and simplifies metagenome assembly, binning, bin improvement, bin quality (completeness and contamination), bin annotation, and evolutionary placement of bins via detailed maximum-likelihood phylogeny based on multiple marker genes using different amino acid substitution models, next to average nucleotide identity analysis of genomes for delineation of species boundaries and operational taxonomic units",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://mago.fe.uni-lj.si",
    "lastUpdate": "2020-12-22T13:57:18Z",
    "name": "MAGO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/MOLBEV/MSZ237",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.Microbial species play important roles in different environments and the production of high-quality genomes from metagenome data sets represents a major obstacle to understanding their ecological and evolutionary dynamics. Metagenome-Assembled Genomes Orchestra (MAGO) is a computational framework that integrates and simplifies metagenome assembly, binning, bin improvement, bin quality (completeness and contamination), bin annotation, and evolutionary placement of bins via detailed maximum-likelihood phylogeny based on multiple marker genes using different amino acid substitution models, next to average nucleotide identity analysis of genomes for delineation of species boundaries and operational taxonomic units. MAGO offers streamlined execution of the entire metagenomics pipeline, error checking, computational resource distribution and compatibility of data formats, governed by user-tailored pipeline processing. MAGO is an open-source-software package released in three different ways, as a singularity image and a Docker container for HPC purposes as well as for running MAGO on a commodity hardware, and a virtual machine for gaining a full access to MAGO underlying structure and source code. MAGO is open to suggestions for extensions and is amenable for use in both research and teaching of genomics and molecular evolution of genomes assembled from small single-cell projects or large-scale and complex environmental metagenomes.",
                "authors": [
                    {
                        "name": "Murovec B."
                    },
                    {
                        "name": "Deutsch L."
                    },
                    {
                        "name": "Stres B."
                    }
                ],
                "date": "2020-02-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Computational Framework for High-Quality Production and Large-Scale Evolutionary Analysis of Metagenome Assembled Genomes"
            },
            "pmid": "31633780"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ],
    "validated": 1
}