{
    "additionDate": "2023-08-01T01:49:45.913258Z",
    "biotoolsCURIE": "biotools:findplantnlrs",
    "biotoolsID": "findplantnlrs",
    "credit": [
        {
            "email": "Zhenyan.Luo@anu.edu.au",
            "note": "If you use this work in your research or publication, please remember to cite 'A high-quality pseudo-phased genome for Melaleuca quinquenervia shows allelic diversity of NLR-type resistance genes'. For issues in setting up or using the pipeline, please contact zhenyan.luo@anu.edu.au"
        }
    ],
    "description": "We developed a comprehensive pipeline for annotating predicted NLR genes from a non-masked genome fasta file input. We identify loci using NLR-annotator software (Steuernagel et al. 2020), tblastn (Altschul et al. 1990) and Hidden Markov Model (HMM) (Eddy 2010). The unmasked loci identified through these methods, and including 20 kb flanking regions, are then annotated with Braker2 software (Hoff et al. 2019) using experimentally validated resistance genes as reference (Kourelis et al. 2021). Annotated amino acid fasta files are screened for domains using Interproscan (Jones et al. 2014) and the predicted coding and amino acid sequences containing both NB-ARC and LRR domains are located back to scaffolds/chromosomes and extracted in fasta and gff3 format.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/ZhenyanLuo/FindPlantNLRs"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ZhenyanLuo/FindPlantNLRs",
    "lastUpdate": "2024-11-24T14:45:29.190996Z",
    "link": [
        {
            "note": "Link of the pipeline",
            "type": [
                "Other"
            ],
            "url": "https://github.com/ZhenyanLuo/FindPlantNLRs"
        }
    ],
    "name": "FindPlantNLRs",
    "owner": "Z_Luo",
    "publication": [
        {
            "doi": "10.1101/2023.04.27.538497",
            "note": "This pipeline is used in the paper: A high-quality pseudo-phased genome for Melaleuca quinquenervia shows allelic diversity of NLR-type resistance genes"
        }
    ]
}
