{
    "additionDate": "2019-11-14T19:44:12Z",
    "biotoolsCURIE": "biotools:deepRAM",
    "biotoolsID": "deepRAM",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "asa@cs.colostate.edu",
            "name": "Asa Ben-Hur",
            "typeEntity": "Person"
        }
    ],
    "description": "Comprehensive evaluation of deep learning architectures for prediction of DNA/RNA sequence binding specificities | End-to-end deep learning toolkit for predicting protein binding sites and motifs | deepRAM is an end-to-end deep learning toolkit for predicting protein binding sites and motifs. It helps users run experiments using many state-of-the-art deep learning methods and addresses the challenge of selecting model parameters in deep learning models using a fully automatic model selection strategy. This helps avoid hand-tuning and thus removes any bias in running experiments, making it user friendly without losing its flexibility. While it was designed with ChIP-seq and CLIP-seq data in mind, it can be used for any DNA/RNA sequence binary classification problem",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3902"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MedChaabane/deepRAM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-20T11:27:26Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MedChaabane/deepRAM/issues"
        }
    ],
    "name": "deepRAM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ339",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Deep learning architectures have recently demonstrated their power in predicting DNA- and RNA-binding specificity. Existing methods fall into three classes: Some are based on convolutional neural networks (CNNs), others use recurrent neural networks (RNNs) and others rely on hybrid architectures combining CNNs and RNNs. However, based on existing studies the relative merit of the various architectures remains unclear. Results: In this study we present a systematic exploration of deep learning architectures for predicting DNA- and RNA-binding specificity. For this purpose, we present deepRAM, an end-to-end deep learning tool that provides an implementation of a wide selection of architectures; its fully automatic model selection procedure allows us to perform a fair and unbiased comparison of deep learning architectures. We find that deeper more complex architectures provide a clear advantage with sufficient training data, and that hybrid CNN/RNN architectures outperform other methods in terms of accuracy. Our work provides guidelines that can assist the practitioner in choosing an appropriate network architecture, and provides insight on the difference between the models learned by convolutional and recurrent networks. In particular, we find that although recurrent networks improve model accuracy, this comes at the expense of a loss in the interpretability of the features learned by the model.",
                "authors": [
                    {
                        "name": "Trabelsi A."
                    },
                    {
                        "name": "Chaabane M."
                    },
                    {
                        "name": "Ben-Hur A."
                    }
                ],
                "citationCount": 15,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Comprehensive evaluation of deep learning architectures for prediction of DNA/RNA sequence binding specificities"
            },
            "pmcid": "PMC6612801",
            "pmid": "31510640"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}