
{
    "credit": [
        {
            "email": "z.gu@dkfz.de",
            "name": "Zuguang Gu",
            "typeEntity": "Person",
            "typeRoles": [
                "Developer"
            ]
        },
        {
            "email": "z.gu@dkfz.de",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://jokergoo.github.io/circlize_book/book/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Omics",
                "uri": "http://edamontology.org/topic_3391"
            }
        ]
    },
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/jokergoo/circlize"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 The Author. Circular layout is an efficient way for the visualization of huge amounts of genomic information. Here we present the circlize package, which provides an implementation of circular layout generation in R as well as an enhancement of available software. The flexibility of this package is based on the usage of low-level graphics functions such that self-defined high-level graphics can be easily implemented by users for specific purposes. Together with the seamless connection between the powerful computational and visual environment in R, circlize gives users more convenience and freedom to design figures for better understanding genomic patterns behind multi-dimensional data.",
            "authors": [
                "Gu Z.",
                "Gu L.",
                "Eils R.",
                "Schlesner M.",
                "Brors B."
            ],
            "cit_count": 169,
            "doi": "10.1093/bioinformatics/btu393",
            "journal": "Bioinformatics",
            "pmid": "24930139",
            "title": "Circlize implements and enhances circular visualization in R",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:circlize",
        "biotoolsID": "circlize",
        "description": "Circular layout is an efficient way for the visualization of huge amounts of information. Here this package provides an implementation of circular layout generation in R as well as an enhancement of available software. The flexibility of the package is based on the usage of low-level graphics functions such that self-defined high-level graphics can be easily implemented by users for specific purposes. Together with the seamless connection between the powerful computational and visual environment in R, it gives users more convenience and freedom to design figures for better understanding complex patterns behind multiple dimensional data.",
        "homepage": "https://CRAN.R-project.org/package=circlize",
        "name": "circlize",
        "version": [
            "0.4.4"
        ]
    }
}