{
    "additionDate": "2017-01-13T13:14:16Z",
    "biotoolsCURIE": "biotools:decgpu",
    "biotoolsID": "decgpu",
    "credit": [
        {
            "email": "ntuliuyc@outlook.com",
            "name": "Dr. Yongchao Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://yongchao-liu.github.io/"
        }
    ],
    "description": "Parallel and distributed error correction algorithm for high-throughput short reads.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://decgpu.sourceforge.net/homepage.htm#latest"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing error detection",
                    "uri": "http://edamontology.org/operation_3195"
                }
            ]
        }
    ],
    "homepage": "http://decgpu.sourceforge.net/homepage.htm#latest",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "DecGPU",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Next-generation sequencing technologies have led to the high-throughput production of sequence data (reads) at low cost. However, these reads are significantly shorter and more error-prone than conventional Sanger shotgun reads. This poses a challenge for the de novo assembly in terms of assembly quality and scalability for large-scale short read datasets.Results: We present DecGPU, the first parallel and distributed error correction algorithm for high-throughput short reads (HTSRs) using a hybrid combination of CUDA and MPI parallel programming models. DecGPU provides CPU-based and GPU-based versions, where the CPU-based version employs coarse-grained and fine-grained parallelism using the MPI and OpenMP parallel programming models, and the GPU-based version takes advantage of the CUDA and MPI parallel programming models and employs a hybrid CPU+GPU computing model to maximize the performance by overlapping the CPU and GPU computation. The distributed feature of our algorithm makes it feasible and flexible for the error correction of large-scale HTSR datasets. Using simulated and real datasets, our algorithm demonstrates superior performance, in terms of error correction quality and execution speed, to the existing error correction algorithms. Furthermore, when combined with Velvet and ABySS, the resulting DecGPU-Velvet and DecGPU-ABySS assemblers demonstrate the potential of our algorithm to improve de novo assembly quality for de-Bruijn-graph-based assemblers.Conclusions: DecGPU is publicly available open-source software, written in CUDA C++ and MPI. The experimental results suggest that DecGPU is an effective and feasible error correction algorithm to tackle the flood of short reads produced by next-generation sequencing technologies. © 2011 Liu et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Schmidt B."
                    },
                    {
                        "name": "Maskell D.L."
                    }
                ],
                "citationCount": 44,
                "date": "2011-03-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DecGPU: Distributed error correction on massively parallel graphics processing units using CUDA and MPI"
            },
            "pmid": "21447171"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1
}