{
    "additionDate": "2017-08-03T18:53:18Z",
    "biotoolsCURIE": "biotools:openalea",
    "biotoolsID": "openalea",
    "credit": [
        {
            "email": "guillaume.garin@itkweb.com",
            "name": "guillaume.garin@itkweb.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.ibc-montpellier.fr/"
        }
    ],
    "description": "Open source project primarily aimed at the plant research community.It is a distributed collaborative effort to develop Python libraries and tools which address the needs of current and future work in Plant Architecture modeling. Includes modules to represent, analyse, and model the functioning and growth of plant architecture.",
    "documentation": [
        {
            "type": "General",
            "url": "http://openalea.gforge.inria.fr/dokuwiki/doku.php?id=documentation:documentation#user_documentation"
        },
        {
            "type": "User manual",
            "url": "http://openalea.gforge.inria.fr/dokuwiki/doku.php?id=documentation:user_guide"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://openalea.gforge.inria.fr/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/openalea-0-9-plant-modeling-environment.html"
        }
    ],
    "name": "OpenAlea",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author 2014. Background and Aims Sustainable agriculture requires the identification of new, environmentally responsible strategies of crop protection. Modelling of pathosystems can allow a better understanding of the major interactions inside these dynamic systems and may lead to innovative protection strategies. In particular, functional-structural plant models (FSPMs) have been identified as a means to optimize the use of architecture-related traits. A current limitation lies in the inherent complexity of this type of modelling, and thus the purpose of this paper is to provide a framework to both extend and simplify the modelling of pathosystems using FSPMs. Methods Different entities and interactions occurring in pathosystems were formalized in a conceptual model. A framework based on these concepts was then implemented within the open-source OpenAlea modelling platform, using the platform's general strategy of modelling plant-environment interactions and extending it to handle plant interactions with pathogens. New developments include a generic data structure for representing lesions and dispersal units, and a series of generic protocols to communicate with objects representing the canopy and its microenvironment in the OpenAlea platform. Another development is the addition of a library of elementary models involved in pathosystem modelling. Several plant and physical models are already available in OpenAlea and can be combined in models of pathosystems using this framework approach. Key Results Two contrasting pathosystems are implemented using the framework and illustrate its generic utility. Simulations demonstrate the framework's ability to simulate multiscaled interactions within pathosystems, and also show that models are modular components within the framework and can be extended. This is illustrated by testing the impact of canopy architectural traits on fungal dispersal. Conclusions This study provides a framework for modelling a large number of pathosystems using FSPMs. This structure can accommodate both previously developed models for individual aspects of pathosystems and new ones. Complex models are deconstructed into separate 'knowledge sources' originating from different specialist areas of expertise and these can be shared and reassembled into multidisciplinary models. The framework thus provides a beneficial tool for a potential diverse and dynamic research community.",
                "authors": [
                    {
                        "name": "Garin G."
                    },
                    {
                        "name": "Fournier C."
                    },
                    {
                        "name": "Andrieu B."
                    },
                    {
                        "name": "Houles V."
                    },
                    {
                        "name": "Robert C."
                    },
                    {
                        "name": "Pradal C."
                    }
                ],
                "citationCount": 15,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Annals of Botany",
                "title": "A modelling framework to simulate foliar fungal epidemics using functional-structural plant models"
            },
            "pmid": "24925323"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        }
    ],
    "validated": 1
}