{
    "additionDate": "2017-01-13T13:15:17Z",
    "biotoolsCURIE": "biotools:maq",
    "biotoolsID": "maq",
    "credit": [
        {
            "email": "lh3@sanger.ac.uk",
            "name": "Heng Li",
            "orcidid": "http://orcid.org/0000-0003-4874-2874",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mapping and Assembly with Qualities (renamed from MAPASS2). Particularly designed for Illumina-Solexa 1G Genetic Analyzer, and has preliminary functions to handle ABI SOLiD data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://maq.sourceforge.net/maq-man.shtml"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://maq.sourceforge.net/",
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2021-04-21T06:50:37.337536Z",
    "license": "GPL-3.0",
    "maturity": "Legacy",
    "name": "MAQ",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_005485"
        }
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1101/gr.078212.108",
            "metadata": {
                "abstract": "New sequencing technologies promise a new era in the use of DNA sequence. However, some of these technologies produce very short reads, typically of a few tens of base pairs, and to use these reads effectively requires new algorithms and software. In particular, there is a major issue in efficiently aligning short reads to a reference genome and handling ambiguity or lack of accuracy in this alignment. Here we introduce the concept of mapping quality, a measure of the confidence that a read actually comes from the position it is aligned to by the mapping algorithm. We describe the software MAQ that can build assemblies by mapping shotgun short reads to a reference genome, using quality scores to derive genotype calls of the consensus sequence of a diploid genome, e.g., from a human sample. MAQ makes full use of mate-pair information and estimates the error probability of each read alignment. Error probabilities are also derived for the final genotype calls, using a Bayesian statistical model that incorporates the mapping qualities, error probabilities from the raw sequence quality scores, sampling of the two haplotypes, and an empirical model for correlated errors at a site. Both read mapping and genotype calling are evaluated on simulated data and real data. MAQ is accurate, efficient, versatile, and user-friendly. It is freely available at http://maq.sourceforge. net. ©2008 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Ruan J."
                    },
                    {
                        "name": "Durbin R."
                    }
                ],
                "citationCount": 1910,
                "date": "2008-11-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Mapping short DNA sequencing reads and calling variants using mapping quality scores"
            },
            "pmcid": "PMC2577856",
            "pmid": "18714091",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-14-184",
            "metadata": {
                "abstract": "Background: The development of next-generation sequencing instruments has led to the generation of millions of short sequences in a single run. The process of aligning these reads to a reference genome is time consuming and demands the development of fast and accurate alignment tools. However, the current proposed tools make different compromises between the accuracy and the speed of mapping. Moreover, many important aspects are overlooked while comparing the performance of a newly developed tool to the state of the art. Therefore, there is a need for an objective evaluation method that covers all the aspects. In this work, we introduce a benchmarking suite to extensively analyze sequencing tools with respect to various aspects and provide an objective comparison.Results: We applied our benchmarking tests on 9 well known mapping tools, namely, Bowtie, Bowtie2, BWA, SOAP2, MAQ, RMAP, GSNAP, Novoalign, and mrsFAST (mrFAST) using synthetic data and real RNA-Seq data. MAQ and RMAP are based on building hash tables for the reads, whereas the remaining tools are based on indexing the reference genome. The benchmarking tests reveal the strengths and weaknesses of each tool. The results show that no single tool outperforms all others in all metrics. However, Bowtie maintained the best throughput for most of the tests while BWA performed better for longer read lengths. The benchmarking tests are not restricted to the mentioned tools and can be further applied to others.Conclusion: The mapping process is still a hard problem that is affected by many factors. In this work, we provided a benchmarking suite that reveals and evaluates the different factors affecting the mapping process. Still, there is no tool that outperforms all of the others in all the tests. Therefore, the end user should clearly specify his needs in order to choose the tool that provides the best results. © 2013 Hatem et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hatem A."
                    },
                    {
                        "name": "Bozdag D."
                    },
                    {
                        "name": "Toland A.E."
                    },
                    {
                        "name": "Catalyurek U.V."
                    }
                ],
                "citationCount": 119,
                "date": "2013-06-07T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Benchmarking short sequence mapping tools"
            },
            "pmcid": "PMC3694458",
            "pmid": "23758764",
            "type": [
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}