{
    "additionDate": "2021-01-18T09:16:14Z",
    "biotoolsCURIE": "biotools:blast2fish",
    "biotoolsID": "blast2fish",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mingwei@ntou.edu.tw",
            "name": "Ming-Wei Lu",
            "orcidid": "https://orcid.org/0000-0003-3249-5311",
            "typeEntity": "Person"
        }
    ],
    "description": "Blast2Fish is a reference-based annotation web tool for transcriptome analysis of non-model teleost fish. It is a novel approach for performing functional enrichment analysis on non-model teleost fish transcriptome data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ]
        }
    ],
    "homepage": "http://blast2fish.ntou.edu.tw",
    "lastUpdate": "2021-02-04T16:08:40Z",
    "name": "Blast2Fish",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3507-9",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Transcriptome analysis by next-generation sequencing has become a popular technique in recent years. This approach is quite suitable for non-model organism study, as de novo assembly is independent of prior genomic sequences of organisms. De novo sequencing has benefited many studies on commercially important fish species. However, to understand the functions of these assembled sequences, they still need to be annotated with existing sequence databases. By combining Basic Local Alignment Search Tool (BLAST) and Gene Ontology analysis, we were able to identify homologous sequences of assembled sequences and describe their characteristics using pre-defined tags for each gene, though the above conventional annotation results obtained for non-model assembled sequences was still associated with a lack of pre-defined tags and poorly documented records in the database. Results: We introduced Blast2Fish, a novel approach for performing functional enrichment analysis on non-model teleost fish transcriptome data. The Blast2Fish pipeline was designed to be a reference-based enrichment method. Instead of annotating the BLAST single top hit by a pre-defined gene-to-tag database, we included 500 hits to search related PubMed articles and parse biological terms. These descriptive terms were then sorted and recorded as annotations for the query. The results showed that Blast2Fish was capable of providing meaningful annotations on immunology topics for non-model fish transcriptome analysis. Conclusion: Blast2Fish provides a novel approach for annotating sequences of non-model fish. The reference-based strategy allows annotation to be performed without pre-defined tags for each gene. This method strongly benefits non-model teleost fish studies for gene functional enrichment analysis.",
                "authors": [
                    {
                        "name": "Tso C.-H."
                    },
                    {
                        "name": "Wu J.-L."
                    },
                    {
                        "name": "Lu M.-W."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Blast2Fish: A reference-based annotation web tool for transcriptome analysis of non-model teleost fish"
            },
            "pmcid": "PMC7199347",
            "pmid": "32366294"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}