{
    "additionDate": "2019-11-14T18:37:55Z",
    "biotoolsCURIE": "biotools:gcsa2",
    "biotoolsID": "gcsa2",
    "confidence_flag": "tool",
    "description": "Haplotype-aware graph indexes | This is a reimplementation of the Generalized Compressed Suffix Array (GCSA), a BWT-based index for directed graphs | The old implementation indexed all paths in a directed acyclic graph, which had to be determinized before index construction. GCSA2 approximates the graph with a de Bruijn graph (with k = 256 or less), allowing it to index more complex graphs as well as graphs containing cycles. The order of the de Bruijn graph limits the length of the queries the index is able to answer correctly. Longer queries may result in false positives (but no false negatives)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jltsiren/gcsa2",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-02T19:58:38.213734Z",
    "license": "MIT",
    "name": "gcsa2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ575",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: The variation graph toolkit (VG) represents genetic variation as a graph. Although each path in the graph is a potential haplotype, most paths are non-biological, unlikely recombinations of true haplotypes. Results: We augment the VG model with haplotype information to identify which paths are more likely to exist in nature. For this purpose, we develop a scalable implementation of the graph extension of the positional Burrows-Wheeler transform. We demonstrate the scalability of the new implementation by building a whole-genome index of the 5008 haplotypes of the 1000 Genomes Project, and an index of all 108 070 Trans-Omics for Precision Medicine Freeze 5 chromosome 17 haplotypes. We also develop an algorithm for simplifying variation graphs for k-mer indexing without losing any k-mers in the haplotypes.",
                "authors": [
                    {
                        "name": "Siren J."
                    },
                    {
                        "name": "Garrison E."
                    },
                    {
                        "name": "Novak A.M."
                    },
                    {
                        "name": "Paten B."
                    },
                    {
                        "name": "Durbin R."
                    }
                ],
                "citationCount": 6,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Haplotype-aware graph indexes"
            },
            "pmid": "31406990"
        }
    ],
    "toolType": [
        "Command-line tool"
    ]
}