{
    "additionDate": "2017-01-13T13:15:51Z",
    "biotoolsCURIE": "biotools:perm",
    "biotoolsID": "perm",
    "credit": [
        {
            "email": "yanghoch@usc.edu",
            "name": "Yangho Chen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PerM (Periodic Seed Mapping) uses periodic spaced seeds to significantly improve mapping efficiency for large reference genomes when compared to state-of-the-art programs.",
    "documentation": [
        {
            "type": "General",
            "url": "https://code.google.com/archive/p/perm/wikis"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://code.google.com/p/perm/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "maturity": "Mature",
    "name": "PerM",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The explosion of next-generation sequencing data has spawned the design of new algorithms and software tools to provide efficient mapping for different read lengths and sequencing technologies. In particular, ABI/s sequencer (SOLiD system) poses a big computational challenge with its capacity to produce very large amounts of data, and its unique strategy of encoding sequence data into color signals. Results: We present the mapping software, named PerM (Periodic Seed Mapping) that uses periodic spaced seeds to significantly improve mapping efficiency for large reference genomes when compared with state-of-the-art programs. The data structure in PerM requires only 4.5 bytes per base to index the human genome, allowing entire genomes to be loaded to memory, while multiple processors simultaneously map reads to the reference. Weight maximized periodic seeds offer full sensitivity for up to three mismatches and high sensitivity for four and five mismatches while minimizing the number random hits per query, significantly speeding up the running time. Such sensitivity makes PerM a valuable mapping tool for SOLiD and Solexa reads. © 2009 The Author(s).",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Souaiaia T."
                    },
                    {
                        "name": "Chen T."
                    }
                ],
                "citationCount": 77,
                "date": "2009-10-16T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PerM: Efficient mapping of short sequencing reads with periodic full sensitive spaced seeds"
            },
            "pmid": "19675096"
        },
        {
            "doi": "10.1093/bioinformatics/btp486",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}