{
    "additionDate": "2020-01-09T18:10:44Z",
    "biotoolsCURIE": "biotools:prophet-prophage",
    "biotoolsID": "prophet-prophage",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "João L. Reis-Cunha",
            "orcidid": "https://orcid.org/0000-0003-1034-0992",
            "typeEntity": "Person"
        },
        {
            "email": "cerca11@gmail.com",
            "name": "Gustavo C. Cerqueira",
            "typeEntity": "Person"
        }
    ],
    "description": "ProphET is a stand-alone prophage sequence prediction tool with self-updating reference database.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "tRNA gene prediction",
                    "uri": "http://edamontology.org/operation_0464"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jaumlrc/ProphET",
    "language": [
        "Shell",
        "Perl"
    ],
    "lastUpdate": "2021-01-13T17:45:57.217188Z",
    "name": "ProphET",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0223364",
            "metadata": {
                "abstract": "© 2019 Reis-Cunha et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Background Prophages play a significant role in prokaryotic evolution, often altering the function of the cell that they infect via transfer of new genes e.g., virulence or antibiotic resistance factors, inactivation of existing genes or by modifying gene expression. Recently, phage therapy has gathered renewed interest as a promising alternative to control bacterial infections. Cataloging the repertoire of prophages in large collections of species’ genomes is an important initial step in understanding their evolution and potential therapeutic utility. However, current widely-used tools for identifying prophages within bacterial genome sequences are mainly web-based, can have long response times, and do not scale to keep pace with the many thousands of genomes currently being sequenced routinely. Methodology In this work, we present ProphET, an easy to install prophage predictor to be used in Linux operation system, without the constraints associated with a web-based tool. ProphET predictions rely on similarity searches against a database of prophage genes, taking as input a bacterial genome sequence in FASTA format and its corresponding gene annotation in GFF. ProphET identifies prophages in three steps: similarity search, calculation of the density of prophage genes, and edge refinement. ProphET performance was evaluated and compared with other phage predictors based on a set of 54 bacterial genomes containing 267 manually annotated prophages. Findings and conclusions ProphET identifies prophages in bacterial genomes with high precision and offers a fast, highly scalable alternative to widely-used web-based applications for prophage detection.",
                "authors": [
                    {
                        "name": "Reis-Cunha J.L."
                    },
                    {
                        "name": "Bartholomeu D.C."
                    },
                    {
                        "name": "Manson A.L."
                    },
                    {
                        "name": "Earl A.M."
                    },
                    {
                        "name": "Cerqueira G.C."
                    }
                ],
                "citationCount": 3,
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "ProphET, prophage estimation tool: A standalone prophage sequence prediction tool with self-updating reference database"
            },
            "pmcid": "PMC6774505",
            "pmid": "31577829"
        }
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ]
}