{
    "additionDate": "2021-03-19T08:39:47Z",
    "biotoolsCURIE": "biotools:scissor",
    "biotoolsID": "scissor",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "neil.hayes@uthsc.edu",
            "name": "D. Neil Hayes",
            "orcidid": "https://orcid.org/0000-0001-6203-7771",
            "typeEntity": "Person"
        }
    ],
    "description": "SCISSOR is a framework for identifying structural changes in RNA transcripts.\n\nShape Changes In Selecting Sample Outliers in RNA-seq.\n\nSCISSOR (shape changes in selecting sample outliers in RNA-seq) aims for unsupervised screening of a range of structural alterations in RNA-seq data. SCISSOR considers a novel shape property of aligned short read data through a base-level pileup file. This intact and uncompressed view of RNA-seq profile enables the unbiased discovery of structural alterations by looking for anomalous shapes in expression. This approach holds promise for identifying otherwise obscured genetic aberrations. As a result, SCISSOR identifies known as well as novel aberrations including abnormal splicing, intra-/intergenic deletions, small indels, alternative transcription start/termination.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hyochoi/SCISSOR",
    "language": [
        "JavaScript",
        "R"
    ],
    "lastUpdate": "2021-04-04T07:23:40Z",
    "name": "SCISSOR",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41467-020-20593-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).High-throughput sequencing protocols such as RNA-seq have made it possible to interrogate the sequence, structure and abundance of RNA transcripts at higher resolution than previous microarray and other molecular techniques. While many computational tools have been proposed for identifying mRNA variation through differential splicing/alternative exon usage, challenges in its analysis remain. Here, we propose a framework for unbiased and robust discovery of aberrant RNA transcript structures using short read sequencing data based on shape changes in an RNA-seq coverage profile. Shape changes in selecting sample outliers in RNA-seq, SCISSOR, is a series of procedures for transforming and normalizing base-level RNA sequencing coverage data in a transcript independent manner, followed by a statistical framework for its analysis (https://github.com/hyochoi/SCISSOR). The resulting high dimensional object is amenable to unsupervised screening of structural alterations across RNA-seq cohorts with nearly no assumption on the mutational mechanisms underlying abnormalities. This enables SCISSOR to independently recapture known variants such as splice site mutations in tumor suppressor genes as well as novel variants that are previously unrecognized or difficult to identify by any existing methods including recurrent alternate transcription start sites and recurrent complex deletions in 3′ UTRs.",
                "authors": [
                    {
                        "name": "Choi H.Y."
                    },
                    {
                        "name": "Hayes D.N."
                    },
                    {
                        "name": "Hayward M.C."
                    },
                    {
                        "name": "Hoadley K.A."
                    },
                    {
                        "name": "Holt J."
                    },
                    {
                        "name": "Jo H."
                    },
                    {
                        "name": "Love M.I."
                    },
                    {
                        "name": "Marron J.S."
                    },
                    {
                        "name": "Newman S."
                    },
                    {
                        "name": "Zhao X."
                    }
                ],
                "citationCount": 2,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Nature Communications",
                "title": "SCISSOR: a framework for identifying structural changes in RNA transcripts"
            },
            "pmcid": "PMC7804101",
            "pmid": "33436599"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ]
}
