
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://sourceforge.net/projects/grasp-release/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Annotation",
                    "uri": "http://edamontology.org/operation_0226"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "NGS",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Peptides",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Studies",
                "uri": "http://edamontology.org/topic_3678"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/grasp-0-0-4-guided-reference-based-assembly-of-short-peptides.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.Protein sequences predicted from metagenomic datasets are annotated by identifying their homologs via sequence comparisons with reference or curated proteins. However, a majority of metagenomic protein sequences are partial-length, arising as a result of identifying genes on sequencing reads or on assembled nucleotide contigs, which themselves are often very fragmented. The fragmented nature of metagenomic protein predictions adversely impacts homology detection and, therefore, the quality of the overall annotation of the dataset. Here we present a novel algorithm called GRASP that accurately identifies the homologs of a given reference protein sequence from a database consisting of partial-length metagenomic proteins. Our homology detection strategy is guided by the reference sequence, and involves the simultaneous search and assembly of overlapping database sequences. GRASP was compared to three commonly used protein sequence search programs (BLASTP, PSI-BLAST and FASTM). Our evaluations using several simulated and real datasets show that GRASP has a significantly higher sensitivity than these programs while maintaining a very high specificity. GRASP can be a very useful program for detecting and quantifying taxonomic and protein family abundances in metagenomic datasets. GRASP is implementedin GNU C++, and is freely available at http://sourceforge.net/projects/grasp-release.",
            "authors": [
                "Zhong C.",
                "Yang Y.",
                "Yooseph S."
            ],
            "cit_count": 3,
            "doi": "10.1093/nar/gku1210",
            "journal": "Nucleic Acids Research",
            "title": "GRASP: Guided reference-based assembly of short peptides",
            "type": "Primary",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:grasp",
        "biotoolsID": "grasp",
        "description": "GRASP is a gene annotation tool for metagenomic studies. GRASP assembles the fragmented short-peptides, which are called from the NGS reads, and aligns the assembled contigs to the query reference protein. GRASP achieves much higher sensitivity than BLASTP for gene annotation purpose.",
        "homepage": "http://sourceforge.net/projects/grasp-release/",
        "name": "GRASP",
        "version": [
            "0.0.4"
        ]
    }
}