{
    "additionDate": "2024-01-22T12:19:04.720271Z",
    "biotoolsCURIE": "biotools:kboolnet",
    "biotoolsID": "kboolnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ikufareva@ucsd.edu",
            "name": "Irina Kufareva",
            "orcidid": "https://orcid.org/0000-0001-9083-7039",
            "typeEntity": "Person"
        }
    ],
    "description": "Toolkit for the verification, validation, and visualization of reaction-contingency (rxncon) models.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/Kufalab-UCSD/kboolnet/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Kufalab-UCSD/kboolnet",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-01-22T12:19:04.723558Z",
    "name": "kboolnet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05329-6",
            "metadata": {
                "abstract": "Background: Computational models of cell signaling networks are extremely useful tools for the exploration of underlying system behavior and prediction of response to various perturbations. By representing signaling cascades as executable Boolean networks, the previously developed rxncon (“reaction-contingency”) formalism and associated Python package enable accurate and scalable modeling of signal transduction even in large (thousands of components) biological systems. The models are split into reactions, which generate states, and contingencies, that impinge on reactions; this avoids the so-called “combinatorial explosion” of system size. Boolean description of the biological system compensates for the poor availability of kinetic parameters which are necessary for quantitative models. Unfortunately, few tools are available to support rxncon model development, especially for large, intricate systems. Results: We present the kboolnet toolkit (https://github.com/Kufalab-UCSD/kboolnet , complete documentation at https://github.com/Kufalab-UCSD/kboolnet/wiki), an R package and a set of scripts that seamlessly integrate with the python-based rxncon software and collectively provide a complete workflow for the verification, validation, and visualization of rxncon models. The verification script VerifyModel.R checks for responsiveness to repeated stimulations as well as consistency of steady state behavior. The validation scripts TruthTable.R, SensitivityAnalysis.R, and ScoreNet.R provide various readouts for the comparison of model predictions to experimental data. In particular, ScoreNet.R compares model predictions to a cloud-stored MIDAS-format experimental database to provide a numerical score for tracking model accuracy. Finally, the visualization scripts allow for graphical representations of model topology and behavior. The entire kboolnet toolkit is cloud-enabled, allowing for easy collaborative development; most scripts also allow for the extraction and analysis of individual user-defined “modules”. Conclusion: The kboolnet toolkit provides a modular, cloud-enabled workflow for the development of rxncon models, as well as their verification, validation, and visualization. This will enable the creation of larger, more comprehensive, and more rigorous models of cell signaling using the rxncon formalism in the future.",
                "authors": [
                    {
                        "name": "Carretero Chavez W."
                    },
                    {
                        "name": "Klipp E."
                    },
                    {
                        "name": "Krantz M."
                    },
                    {
                        "name": "Kufareva I."
                    }
                ],
                "citationCount": 1,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "kboolnet: a toolkit for the verification, validation, and visualization of reaction-contingency (rxncon) models"
            },
            "pmcid": "PMC10258968",
            "pmid": "37308855"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
