{
    "additionDate": "2018-08-01T11:41:17Z",
    "biotoolsCURIE": "biotools:metax",
    "biotoolsID": "metax",
    "credit": [
        {
            "email": "wenbo@genomics.cn",
            "name": "Bo Wen",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An Automatic and Comprehensive Pipeline for Processing Untargeted Metabolomics Data.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://metax.genomics.cn/files/metaX_manual.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://metax.genomics.cn/",
    "language": [
        "R",
        "Java"
    ],
    "lastUpdate": "2019-06-27T09:02:00Z",
    "license": "GPL-3.0",
    "name": "metaX",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1579-y",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Non-targeted metabolomics based on mass spectrometry enables high-throughput profiling of the metabolites in a biological sample. The large amount of data generated from mass spectrometry requires intensive computational processing for annotation of mass spectra and identification of metabolites. Computational analysis tools that are fully integrated with multiple functions and are easily operated by users who lack extensive knowledge in programing are needed in this research field. Results: We herein developed an R package, metaX, that is capable of end-to-end metabolomics data analysis through a set of interchangeable modules. Specifically, metaX provides several functions, such as peak picking and annotation, data quality assessment, missing value imputation, data normalization, univariate and multivariate statistics, power analysis and sample size estimation, receiver operating characteristic analysis, biomarker selection, pathway annotation, correlation network analysis, and metabolite identification. In addition, metaX offers a web-based interface ( http://metax.genomics.cn ) for data quality assessment and normalization method evaluation, and it generates an HTML-based report with a visualized interface. The metaX utilities were demonstrated with a published metabolomics dataset on a large scale. The software is available for operation as either a web-based graphical user interface (GUI) or in the form of command line functions. The package and the example reports are available at http://metax.genomics.cn/. Conclusions: The pipeline of metaX is platform-independent and is easy to use for analysis of metabolomics data generated from mass spectrometry.",
                "authors": [
                    {
                        "name": "Wen B."
                    },
                    {
                        "name": "Mei Z."
                    },
                    {
                        "name": "Zeng C."
                    },
                    {
                        "name": "Liu S."
                    }
                ],
                "citationCount": 108,
                "date": "2017-03-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "metaX: A flexible and comprehensive software for processing metabolomics data"
            },
            "pmcid": "PMC5361702",
            "pmid": "28327092"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Mass spectrometry",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}