
{
    "credit": [
        {
            "email": "urgi-contact@versailles.inra.fr",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://urgi.versailles.inra.fr/gnpis/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Indexing",
                    "uri": "http://edamontology.org/operation_0227"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence variations",
                        "uri": "http://edamontology.org/data_3498"
                    }
                },
                {
                    "data": {
                        "term": "Sequence set",
                        "uri": "http://edamontology.org/data_0850"
                    }
                },
                {
                    "data": {
                        "term": "Sequence features",
                        "uri": "http://edamontology.org/data_1255"
                    }
                },
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    }
                },
                {
                    "data": {
                        "term": "Ontology data",
                        "uri": "http://edamontology.org/data_2353"
                    }
                },
                {
                    "data": {
                        "term": "Database search results",
                        "uri": "http://edamontology.org/data_2080"
                    }
                },
                {
                    "data": {
                        "term": "Genotype/phenotype report",
                        "uri": "http://edamontology.org/data_0920"
                    }
                },
                {
                    "data": {
                        "term": "Identifier",
                        "uri": "http://edamontology.org/data_0842"
                    }
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access",
            "Restricted access"
        ],
        "collectionID": [
            "elixir-fr-sdp-2019",
            "Animal and Crop Genomics"
        ],
        "elixirNode": [
            "France"
        ],
        "elixirPlatform": [
            "Tools"
        ],
        "language": [
            "JavaScript",
            "C#"
        ],
        "license": "CC-BY-4.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application",
            "Database portal"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Data integration is a key challenge for modern bioinformatics. It aims to provide biologists with tools to explore relevant data produced by different studies. Large-scale international projects can generate lots of heterogeneous and unrelated data. The challenge is to integrate this information with other publicly available data. Nucleotide sequencing throughput has been improved with new technologies; this increases the need for powerful information systems able to store, manage and explore data. GnpIS is a multispecies integrative information system dedicated to plant and fungi pests. It bridges genetic and genomic data, allowing researchers access to both genetic information (e.g. genetic maps, quantitative trait loci, markers, single nucleotide polymorphisms, germplasms and genotypes) and genomic data (e.g. genomic sequences, physical maps, genome annotation and expression data) for species of agronomical interest. GnpIS is used by both large international projects and plant science departments at the French National Institute for Agricultural Research. Here, we illustrate its use. © The Author(s) 2013. Published by Oxford University Press.",
            "authors": [
                "Steinbach D.",
                "Alaux M.",
                "Amselem J.",
                "Choisne N.",
                "Durand S.",
                "Flores R.",
                "Keliet A.-O.",
                "Kimmel E.",
                "Lapalu N.",
                "Luyten I.",
                "Michotey C.",
                "Mohellibi N.",
                "Pommier C.",
                "Reboux S.",
                "Valdenaire D.",
                "Verdelet D.",
                "Quesneville H."
            ],
            "cit_count": 24,
            "doi": "10.1093/database/bat058",
            "journal": "Database",
            "title": "GnpIS: An information system to integrate genetic and genomic data from plants and fungi",
            "type": "Primary",
            "year": "2013-12-01"
        },
        {
            "abstract": "© Springer Science+Business Media New York 2017.GnpIS is an information system designed to help scientists working on plants and fungi to decipher the molecular and genetic architecture of trait variations by facilitating the navigation through genetic, genomic, and phenotypic information. The purpose of the present chapter is to illustrate how users can (1) explore datasets from phenotyping experiments in order to build new datasets for studying genotype × environment interactions in traits, (2) browse into the results of other genetic analysis data such as GWAS to generate or check working hypothesis about candidate genes or to identify important alleles and germplasms for breeding programs, and (3) explore the polymorphism in specific area of the genome using InterMine, JBrowse tools embedded in the GnpIS information system.",
            "authors": [
                "Adam-Blondon A.-F.",
                "Alaux M.",
                "Durand S.",
                "Letellier T.",
                "Merceron G.",
                "Mohellibi N.",
                "Pommier C.",
                "Steinbach D.",
                "Alfama F.",
                "Amselem J.",
                "Charruaud D.",
                "Choisne N.",
                "Flores R.",
                "Guerche C.",
                "Jamilloux V.",
                "Kimmel E.",
                "Lapalu N.",
                "Loaec M.",
                "Michotey C.",
                "Quesneville H."
            ],
            "cit_count": 0,
            "doi": "10.1007/978-1-4939-6658-5_5",
            "journal": "Methods in Molecular Biology",
            "title": "Mining plant genomic and genetic data using the gnpis information system",
            "type": "Primary",
            "year": "2017-01-01"
        },
        {
            "abstract": "© 2016 The Author(s).Viticulture, like other fields of agriculture, is currently facing important challenges that will be addressed only through sustained, dedicated and coordinated research. Although the methods used in biology have evolved tremendously in recent years and now involve the routine production of large data sets of varied nature, in many domains of study, including grapevine research, there is a need to improve the findability, accessibility, interoperability and reusability (FAIR-ness) of these data. Considering the heterogeneous nature of the data produced, the transnational nature of the scientific community and the experience gained elsewhere, we have formed an open working group, in the framework of the International Grapevine Genome Program (www.vitaceae.org), to construct a coordinated federation of information systems holding grapevine data distributed around the world, providing an integrated set of interfaces supporting advanced data modeling, rich semantic integration and the next generation of data mining tools. To achieve this goal, it will be critical to develop, implement and adopt appropriate standards for data annotation and formatting. The development of this system, the GrapeIS, linking genotypes to phenotypes, and scientific research to agronomical and oeneological data, should provide new insights into grape biology, and allow the development of new varieties to meet the challenges of biotic and abiotic stress, environmental change, and consumer demand.",
            "authors": [
                "Adam-Blondon A.-F.",
                "Alaux M.",
                "Pommier C.",
                "Cantu D.",
                "Cheng Z.-M.",
                "Cramer G.",
                "Davies C.",
                "Delrot S.",
                "Deluc L.",
                "Di Gaspero G.",
                "Grimplet J.",
                "Fennell A.",
                "Londo J.",
                "Kersey P.",
                "Mattivi F.",
                "Naithani S.",
                "Neveu P.",
                "Nikolski M.",
                "Pezzotti M.",
                "Reisch B.",
                "Topfer R.",
                "Vivier M.",
                "Ware D.",
                "Quesneville H."
            ],
            "cit_count": 15,
            "doi": "10.1038/hortres.2016.56",
            "journal": "Horticulture Research",
            "title": "Towards an open grapevine information system",
            "type": "Other",
            "year": "2016-11-23"
        },
        {
            "abstract": "© Crop Science Society of America.The genome sequences of many important Triticeae species, including bread wheat (Triticum aestivum L.) and barley (Hordeum vulgare L.), remained uncharacterized for a long time because their high repeat content, large sizes, and polyploidy. As a result of improvements in sequencing technologies and novel analyses strategies, several of these have recently been deciphered. These efforts have generated new insights into Triticeae biology and genome organization and have important implications for downstream usage by breeders, experimental biologists, and comparative genomicists. transPLANT (http://www.transplantdb.eu) is an EU-funded project aimed at constructing hardware, software, and data infrastructure for genome-scale research in the life sciences. Since the Triticeae data are intrinsically complex, heterogenous, and distributed, the transPLANT consortium has undertaken efforts to develop common data formats and tools that enable the exchange and integration of data from distributed resources. Here we present an overview of the individual Triticeae genome resources hosted by transPLANT partners, introduce the objectives of transPLANT, and outline common developments and interfaces supporting integrated data access.",
            "authors": [
                "Spannagl M.",
                "Alaux M.",
                "Lange M.",
                "Bolser D.M.",
                "Bader K.C.",
                "Letellier T.",
                "Kimmel E.",
                "Flores R.",
                "Pommier C.",
                "Kerhornou A.",
                "Walts B.",
                "Nussbaumer T.",
                "Grabmuller C.",
                "Chen J.",
                "Colmsee C.",
                "Beier S.",
                "Mascher M.",
                "Schmutzer T.",
                "Arend D.",
                "Thanki A.",
                "Ramirez-Gonzalez R.",
                "Ayling M.",
                "Ayling S.",
                "Caccamo M.",
                "Mayer K.F.X.",
                "Scholz U.",
                "Steinbach D.",
                "Quesneville H.",
                "Kersey P.J."
            ],
            "cit_count": 4,
            "doi": "10.3835/plantgenome2015.06.0038",
            "journal": "Plant Genome",
            "title": "TransPLANT resources for triticeae genomic data",
            "type": "Primary",
            "year": "2016-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gnpis",
        "biotoolsID": "gnpis",
        "description": "A multispecies integrative information system dedicated to plant and fungi pests. It bridges genetic and genomic data, allowing researchers access to both genetic information and genomic data for species of agronomical interest. It is used by both large international projects and plant science departments at the French National Institute for Agricultural Research.",
        "homepage": "https://urgi.versailles.inra.fr/gnpis",
        "name": "Genetic and Genomic Information System (GnpIS)",
        "version": [
            "18.2"
        ]
    }
}