{
    "additionDate": "2017-12-18T00:11:20Z",
    "biotoolsCURIE": "biotools:proteinvolume",
    "biotoolsID": "proteinvolume",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://gmlab.bio.rpi.edu/contact.php"
        }
    ],
    "description": "ProteinVolume (PV) is a Java program that calculates the components of the solvent-excluded (geometric) volume of a protein: van der Waals and void volume.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bmcbioinformatics.biomedcentral.com/articles/10.1186/s12859-015-0531-2#Sec2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://gmlab.bio.rpi.edu/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/proteinvolume-calculating-molecular-van-der-waals-and-void-volumes-in-proteins.html"
        }
    ],
    "name": "ProteinVolume",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/s12859-015-0531-2",
            "metadata": {
                "abstract": "© 2015 Chen and Makhatadze; licensee BioMed Central.Background: Voids and cavities in the native protein structure determine the pressure unfolding of proteins. In addition, the volume changes due to the interaction of newly exposed atoms with solvent upon protein unfolding also contribute to the pressure unfolding of proteins. Quantitative understanding of these effects is important for predicting and designing proteins with predefined response to changes in hydrostatic pressure using computational approaches. The molecular surface volume is a useful metric that describes contribution of geometrical volume, which includes van der Waals volume and volume of the voids, to the total volume of a protein in solution, thus isolating the effects of hydration for separate calculations. Results: We developed ProteinVolume, a highly robust and easy-to-use tool to compute geometric volumes of proteins. ProteinVolume generates the molecular surface of a protein and uses an innovative flood-fill algorithm to calculate the individual components of the molecular surface volume, van der Waals and intramolecular void volumes. ProteinVolume is user friendly and is available as a web-server or a platform-independent command-line version. Conclusions: ProteinVolume is a highly accurate and fast application to interrogate geometric volumes of proteins. ProteinVolume is a free web server available on http://gmlab.bio.rpi.edu. Free-standing platform-independent Java-based ProteinVolume executable is also freely available at this web site.",
                "authors": [
                    {
                        "name": "Chen C.R."
                    },
                    {
                        "name": "Makhatadze G.I."
                    }
                ],
                "citationCount": 35,
                "date": "2015-12-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ProteinVolume: Calculating molecular van der Waals and void volumes in proteins"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}