{
    "name": "PyContact", 
    "description": "GUI-based tool for rapid, versatile and customizable analysis of non-covalent interactions in molecular dynamics (MD) trajectories.", 
    "homepage": "https://pycontact.github.io/", 
    "biotoolsID": "pycontact", 
    "biotoolsCURIE": "biotools:pycontact", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2949", 
                    "term": "Protein interaction analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3306", 
            "term": "Biophysics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3524", 
            "term": "Simulation experiment"
        }, 
        {
            "uri": "http://edamontology.org/topic_0128", 
            "term": "Protein interactions"
        }, 
        {
            "uri": "http://edamontology.org/topic_0092", 
            "term": "Data visualisation"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://pycontact.github.io/tutorial/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1016/j.bpj.2017.12.003", 
            "pmid": null, 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "PyContact: Rapid, Customizable, and Visual Analysis of Noncovalent Interactions in MD Simulations", 
                "abstract": "© 2017 Biophysical SocietyMolecular dynamics (MD) simulations have become ubiquitous in all areas of life sciences. The size and model complexity of MD simulations are rapidly growing along with increasing computing power and improved algorithms. This growth has led to the production of a large amount of simulation data that need to be filtered for relevant information to address specific biomedical and biochemical questions. One of the most relevant molecular properties that can be investigated by all-atom MD simulations is the time-dependent evolution of the complex noncovalent interaction networks governing such fundamental aspects as molecular recognition, binding strength, and mechanical and structural stability. Extracting, evaluating, and visualizing noncovalent interactions is a key task in the daily work of structural biologists. We have developed PyContact, an easy-to-use, highly flexible, and intuitive graphical user interface-based application, designed to provide a toolkit to investigate biomolecular interactions in MD trajectories. PyContact is designed to facilitate this task by enabling identification of relevant noncovalent interactions in a comprehensible manner. The implementation of PyContact as a standalone application enables rapid analysis and data visualization without any additional programming requirements, and also preserves full in-program customization and extension capabilities for advanced users. The statistical analysis representation is interactively combined with full mapping of the results on the molecular system through the synergistic connection between PyContact and VMD. We showcase the capabilities and scientific significance of PyContact by analyzing and visualizing in great detail the noncovalent interactions underlying the ion permeation pathway of the human P2X3 receptor. As a second application, we examine the protein-protein interaction network of the mechanically ultrastable cohesin-dockering complex.", 
                "date": "2018-02-06T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Scheurer M."
                    }, 
                    {
                        "name": "Rodenkirch P."
                    }, 
                    {
                        "name": "Siggel M."
                    }, 
                    {
                        "name": "Bernardi R.C."
                    }, 
                    {
                        "name": "Schulten K."
                    }, 
                    {
                        "name": "Tajkhorshid E."
                    }, 
                    {
                        "name": "Rudack T."
                    }
                ], 
                "journal": "Biophysical Journal"
            }
        }
    ], 
    "credit": [
        {
            "name": "Maximilian Scheurer", 
            "email": "mscheurer@ks.uiuc.edu", 
            "url": "https://github.com/maxscheurer", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "d.gabrielaitis", 
    "additionDate": "2018-08-23T08:50:51Z", 
    "lastUpdate": "2018-12-10T12:59:01Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}