{
    "accessibility": "Open access",
    "additionDate": "2019-05-17T09:00:59Z",
    "biotoolsCURIE": "biotools:CPMCGLM",
    "biotoolsID": "CPMCGLM",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jeremie.riou@univ-angers.fr",
            "name": "Jeremie Riou",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer"
            ]
        }
    ],
    "description": "R package for p-value adjustment when looking for an optimal transformation of a single explanatory variable in generalized linear models.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/cran/CPMCGLM"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=CPMCGLM",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:21Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "CPMCGLM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12874-019-0711-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In medical research, explanatory continuous variables are frequently transformed or converted into categorical variables. If the coding is unknown, many tests can be used to identify the \"optimal\" transformation. This common process, involving the problems of multiple testing, requires a correction of the significance level. Liquet and Commenges proposed an asymptotic correction of significance level in the context of generalized linear models (GLM) (Liquet and Commenges, Stat Probab Lett 71:33-38, 2005). This procedure has been developed for dichotomous and Box-Cox transformations. Furthermore, Liquet and Riou suggested the use of resampling methods to estimate the significance level for transformations into categorical variables with more than two levels (Liquet and Riou, BMC Med Res Methodol 13:75, 2013). Results: CPMCGLM provides to users both methods of p-value adjustment. Futhermore, they are available for a large set of transformations. This paper aims to provide insight the user an overview of the methodological context, and explain in detail the use of the CPMCGLM R package through its application to a real epidemiological dataset. Conclusion: We present here the CPMCGLM R package providing efficient methods for the correction of type-I error rate in the context of generalized linear models. This is the first and the only available package in R providing such methods applied to this context. This package is designed to help researchers, who work principally in the field of biostatistics and epidemiology, to analyze their data in the context of optimal cutoff point determination.",
                "authors": [
                    {
                        "name": "Liquet B."
                    },
                    {
                        "name": "Riou J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-04-16T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "CPMCGLM: An R package for p-value adjustment when looking for an optimal transformation of a single explanatory variable in generalized linear models"
            },
            "pmcid": "PMC6469151",
            "pmid": "30991962",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}
