{
    "additionDate": "2017-01-13T13:15:52Z",
    "biotoolsCURIE": "biotools:picall",
    "biotoolsID": "picall",
    "credit": [
        {
            "email": "vbansal@scripps.edu",
            "name": "Vikas Bansal",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identifies short indel polymorphisms in population sequencing data.",
    "documentation": [
        {
            "type": "General",
            "url": "https://sites.google.com/site/vibansal/software/picall"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/vibansal/software/picall",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "PiCall",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: High-throughput sequencing technologies have made population-scale studies of human genetic variation possible. Accurate and comprehensive detection of DNA sequence variants is crucial for the success of these studies. Small insertions and deletions represent the second most frequent class of variation in the human genome after single nucleotide polymorphisms (SNPs). Although several alignment tools for the gapped alignment of sequence reads to a reference genome are available, computational methods for discriminating indels from sequencing errors and genotyping indels directly from sequence reads are needed.Results: We describe a probabilistic method for the accurate detection and genotyping of short indels from population-scale sequence data. In this approach, aligned sequence reads from a population of individuals are used to automatically account for context-specific sequencing errors associated with indels. We applied this approach to population sequence datasets from the 1000 Genomes exon pilot project generated using the Roche 454 and Illumina sequencing platforms, and were able to detect a significantly greater number of indels than reported previously. Comparison to indels identified in the 1000 Genomes pilot project demonstrated the sensitivity of our method. The consistency in the number of indels and the fraction of indels whose length is a multiple of three across different human populations and two different sequencing platforms indicated that our method has a low false discovery rate. Finally, the method represents a general approach for the detection and genotyping of small-scale DNA sequence variants for population-scale sequencing projects. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Bansal V."
                    },
                    {
                        "name": "Libiger O."
                    }
                ],
                "citationCount": 11,
                "date": "2011-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A probabilistic method for the detection and genotyping of small indels from population-scale sequence data"
            },
            "pmid": "21653520"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}