{
    "additionDate": "2019-11-14T19:27:41Z",
    "biotoolsCURIE": "biotools:RIPper",
    "biotoolsID": "RIPper",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stephanie.vanwyk@fabi.up.ac.za",
            "name": "Stephanie van Wyk",
            "typeEntity": "Person"
        }
    ],
    "description": "web-based tool for genome-wide quantification of Repeat-Induced Point (RIP) mutations | The RIPper is a set of web-based tools designed for analyses of Repeat-Induced Point (RIP) mutations in genome sequences of Ascomycota | The RIPper was built using Asp.Net Core with an AngularJs based front-end and uses session storage to keep a users files for a defined amount of time. The RIPper has no account or database requirements",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://theripper.hawk.rocks",
    "language": [
        "C#",
        "JavaScript"
    ],
    "lastUpdate": "2020-12-14T07:52:52Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/TheRIPper-Fungi/TheRIPper"
        }
    ],
    "name": "RIPper",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.7447",
            "metadata": {
                "abstract": "© 2019 van Wyk et al.Background. The RIPper (http://theripper.hawk.rocks) is a set of web-based tools designed for analyses of Repeat-Induced Point (RIP) mutations in the genome sequences of Ascomycota. The RIP pathway is a fungal genome defense mechanism that is aimed at identifying repeated and duplicated motifs, into which it then introduces cytosine to thymine transition mutations. RIP thus serves to deactivate and counteract the deleterious consequences of selfish or mobile DNA elements in fungal genomes. The occurrence, genetic context and frequency of RIP mutations are widely used to assess the activity of this pathway in genomic regions of interest. Here, we present a bioinformatics tool that is specifically fashioned to automate the investigation of changes in RIP product and substrate nucleotide frequencies in fungal genomes. Results. We demonstrated the ability of The RIPper to detect the occurrence and extent of RIP mutations in known RIP affected sequences. Specifically, a sliding window approach was used to perform genome-wide RIP analysis on the genome assembly of Neurospora crassa. Additionally, fine-scale analysis with The RIPper showed that gene regions and transposable element sequences, previously determined to be affected by RIP, were indeed characterized by high frequencies of RIP mutations. Data generated using this software further showed that large proportions of the N. crassa genome constitutes RIP mutations with extensively affected regions displaying reduced GC content. The RIPper was further useful for investigating and visualizing changes in RIP mutations across the length of sequences of interest, allowing for fine-scale analyses. Conclusion. This software identified RIP targeted genomic regions and provided RIP statistics for an entire genome assembly, including the genomic proportion affected by RIP. Here, we present The RIPper as an efficient tool for genome-wide RIP analyses.",
                "authors": [
                    {
                        "name": "De Vos L."
                    },
                    {
                        "name": "Harrison C.H."
                    },
                    {
                        "name": "Steenkamp E.T."
                    },
                    {
                        "name": "Van Der Merwe N.A."
                    },
                    {
                        "name": "Van Wyk S."
                    },
                    {
                        "name": "Wingfield B.D."
                    }
                ],
                "citationCount": 10,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "The RIPper, a web-based tool for genome-wide quantification of Repeat-Induced Point (RIP) mutations"
            },
            "pmcid": "PMC6714961",
            "pmid": "31523495"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
