{
    "additionDate": "2021-01-18T08:36:20Z",
    "biotoolsCURIE": "biotools:pdbmd2cd",
    "biotoolsID": "pdbmd2cd",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "r.w.janes@qmul.ac.uk",
            "name": "Robert W Janes",
            "orcidid": "https://orcid.org/0000-0001-5483-6282",
            "typeEntity": "Person"
        }
    ],
    "description": "PDBMD2CD is providing predicted protein circular dichroism spectra from multiple molecular dynamics-generated protein structures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure assignment",
                    "uri": "http://edamontology.org/operation_0319"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                }
            ]
        }
    ],
    "homepage": "https://pdbmd2cd.cryst.bbk.ac.uk",
    "lastUpdate": "2021-01-23T07:14:19Z",
    "name": "PDBMD2CD",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA296",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.PDBMD2CD is a new web server capable of predicting circular dichroism (CD) spectra for multiple protein structures derived from molecular dynamics (MD) simulations, enabling predictions from thousands of protein atomic coordinate files (e.g. MD trajectories) and generating spectra for each of these structures provided by the user. Using MD enables exploration of systems that cannot be monitored by direct experimentation. Validation of MD-derived data from these types of trajectories can be difficult via conventional structure-determining techniques such as crystallography or nuclear magnetic resonance spectroscopy. CD is an experimental technique that can provide protein structure information from such conditions. The website utilizes a much faster (minimum ∼1000×) and more accurate approach for calculating CD spectra than its predecessor, PDB2CD (1). As well as improving on the speed and accuracy of current methods, new analysis tools are provided to cluster predictions or compare them against experimental CD spectra. By identifying a subset of the closest predicted CD spectra derived from PDBMD2CD to an experimental spectrum, the associated cluster of structures could be representative of those found under the conditions in which the MD studies were undertaken, thereby offering an analytical insight into the results. PDBMD2CD is freely available at: https://pdbmd2cd.cryst.bbk.ac.uk.",
                "authors": [
                    {
                        "name": "Drew E.D."
                    },
                    {
                        "name": "Janes R.W."
                    }
                ],
                "citationCount": 5,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PDBMD2CD: Providing predicted protein circular dichroism spectra from multiple molecular dynamics-generated protein structures"
            },
            "pmcid": "PMC7319452",
            "pmid": "32343309"
        }
    ],
    "topic": [
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}