{
    "additionDate": "2020-01-09T18:08:01Z",
    "biotoolsCURIE": "biotools:DeepDNA",
    "biotoolsID": "DeepDNA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tianyi.zang@hit.edu.cn",
            "name": "Tianyi Zang",
            "typeEntity": "Person"
        },
        {
            "email": "ydwang@hit.edu.cn",
            "name": "Yadong Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A hybrid convolutional and recurrent neural network for compressing compression human mitochondrial genomes. DeepDNA, a novel unified model called deepDNA that combines the convolutional neural network (CNN) with the long short-term memory network (LSTM) for compressing human mitochondrial genome sequences. The experiment has shown that out method deepDNA is able to learn sequence local features through a convolutional layer, and to learn higher level representations of long-term sequences dependencies through a long short-term memory network (LSTM) layer. We evaluated the learned genome sequences representations model on human mitochondrial genome sequences compressing tasks and achieved a satisfactory result.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rongjiewang/DeepDNA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T15:56:46Z",
    "license": "MIT",
    "name": "DeepDNA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S40246-019-0225-3",
            "metadata": {
                "abstract": "BACKGROUND: In recent years, with the development of high-throughput genome sequencing technologies, a large amount of genome data has been generated, which has caused widespread concern about data storage and transmission costs. However, how to effectively compression genome sequences data remains an unsolved problem. RESULTS: In this paper, we propose a compression method using machine learning techniques (DeepDNA), for compressing human mitochondrial genome data. The experimental results show the effectiveness of our proposed method compared with other on the human mitochondrial genome data. CONCLUSIONS: The compression method we proposed can be classified as non-reference based method, but the compression effect is comparable to that of reference based methods. Moreover, our method not only have a well compression results in the population genome with large redundancy, but also in the single genome with small redundancy. The codes of DeepDNA are available at https://github.com/rongjiewang/DeepDNA .",
                "authors": [
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Zang T."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-22T00:00:00Z",
                "journal": "Human genomics",
                "title": "Human mitochondrial genome compression using machine learning techniques"
            },
            "pmcid": "PMC6805717",
            "pmid": "31639043"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1
}