{
    "additionDate": "2020-01-09T17:41:38Z",
    "biotoolsCURIE": "biotools:NAGbinder",
    "biotoolsID": "NAGbinder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "raghava@iiitd.ac.in",
            "name": "Gajendra P.S. Raghava",
            "orcidid": "https://orcid.org/0000-0002-8902-2876",
            "typeEntity": "Person"
        }
    ],
    "description": "An approach for identifying N-acetylglucosamine interacting residues of a protein from its primary sequence.\n\nThis is for predicting NAGbinding sites in a protein.\n\nA web server for predicting N-Acetylglucosamine (NAG) interacting residues in a protein.\n\nHome page of NAGbinder, which is a web based tool developed for predicting of NAG binding residues in a protein.\n\nNAGbinder is a Python-based tool for predicting NAG interacting residues in an uncharacterized protein chain.\n\nPrediction of NAG interacting residues.\n\nReference: Patiyal et. al. (2019) NAGbinder: An approach for identifying N-acetylglucosamine interacting residues of a protein from its primary sequence",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/nagbinder/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:37:07.266451Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/raghavagps/nagbinder/"
        }
    ],
    "name": "NAGbinder",
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1002/pro.3761",
            "metadata": {
                "abstract": "N-acetylglucosamine (NAG) belongs to the eight essential saccharides that are required to maintain the optimal health and precise functioning of systems ranging from bacteria to human. In the present study, we have developed a method, NAGbinder, which predicts the NAG-interacting residues in a protein from its primary sequence information. We extracted 231 NAG-interacting nonredundant protein chains from Protein Data Bank, where no two sequences share more than 40% sequence identity. All prediction models were trained, validated, and evaluated on these 231 protein chains. At first, prediction models were developed on balanced data consisting of 1,335 NAG-interacting and noninteracting residues, using various window size. The model developed by implementing Random Forest using binary profiles as the main principle for identifying NAG-interacting residue with window size 9, performed best among other models. It achieved highest Matthews Correlation Coefficient (MCC) of 0.31 and 0.25, and Area Under Receiver Operating Curve (AUROC) of 0.73 and 0.70 on training and validation data set, respectively. We also developed prediction models on realistic data set (1,335 NAG-interacting and 47,198 noninteracting residues) using the same principle, where the model achieved MCC of 0.26 and 0.27, and AUROC of 0.70 and 0.71, on training and validation data set, respectively. The success of our method can be appraised by the fact that, if a sequence of 1,000 amino acids is analyzed with our approach, 10 residues will be predicted as NAG-interacting, out of which five are correct. Best models were incorporated in the standalone version and in the webserver available at https://webs.iiitd.edu.in/raghava/nagbinder/.",
                "authors": [
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Dhall A."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Kumar V."
                    },
                    {
                        "name": "Mishra G."
                    },
                    {
                        "name": "Patiyal S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 17,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "NAGbinder: An approach for identifying N-acetylglucosamine interacting residues of a protein from its primary sequence"
            },
            "pmcid": "PMC6933864",
            "pmid": "31654438"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
