{
    "additionDate": "2022-10-28T06:03:19.484168Z",
    "biotoolsCURIE": "biotools:camlu",
    "biotoolsID": "camlu",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kimdo@mdanderson.org",
            "name": "Kim-Anh Do",
            "typeEntity": "Person"
        },
        {
            "email": "zli16@mdanderson.org",
            "name": "Ziyi Li",
            "typeEntity": "Person"
        }
    ],
    "description": "CAMLU is an R package that provides an autoencoder based method for annotating cell types from scRNA-seq data. The function can identify unknown cells with the input training data. It also can annotate the full lists of cell types with consideration of unknown cell types.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://doi.org/10.5281/zenodo.7054422",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:25:50.492476Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yizhuo-wang/CAMLU_Simulation"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ziyili20/CAMLU"
        }
    ],
    "name": "CAMLU",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac617",
            "metadata": {
                "abstract": "Motivation: Single-cell RNA sequencing (scRNA-seq) has been widely used to decompose complex tissues into functionally distinct cell types. The first and usually the most important step of scRNA-seq data analysis is to accurately annotate the cell labels. In recent years, many supervised annotation methods have been developed and shown to be more convenient and accurate than unsupervised cell clustering. One challenge faced by all the supervised annotation methods is the identification of the novel cell type, which is defined as the cell type that is not present in the training data, only exists in the testing data. Existing methods usually label the cells simply based on the correlation coefficients or confidence scores, which sometimes results in an excessive number of unlabeled cells. Results: We developed a straightforward yet effective method combining autoencoder with iterative feature selection to automatically identify novel cells from scRNA-seq data. Our method trains an autoencoder with the labeled training data and applies the autoencoder to the testing data to obtain reconstruction errors. By iteratively selecting features that demonstrate a bi-modal pattern and reclustering the cells using the selected feature, our method can accurately identify novel cells that are not present in the training data. We further combined this approach with a support vector machine to provide a complete solution for annotating the full range of cell types. Extensive numerical experiments using five real scRNA-seq datasets demonstrated favorable performance of the proposed method over existing methods serving similar purposes.",
                "authors": [
                    {
                        "name": "Colla S."
                    },
                    {
                        "name": "Do K.-A."
                    },
                    {
                        "name": "Ganan-Gomez I."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 6,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A machine learning-based method for automatically identifying novel cells in annotating single-cell RNA-seq data"
            },
            "pmcid": "PMC9801963",
            "pmid": "36083008"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
