{"credit":[{"email":"cpnDB.help@gmail.com","name":"cpnDB curator","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"},{"term":"Sequence similarity search","uri":"http://edamontology.org/operation_0346"},{"term":"Phylogenetic tree generation (from molecular sequences)","uri":"http://edamontology.org/operation_0540"},{"term":"Sequence database search","uri":"http://edamontology.org/operation_0338"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"language":["PHP"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Microbial ecology","uri":"http://edamontology.org/topic_3697"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Ecology","uri":"http://edamontology.org/topic_0610"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"publication":[{"abstract":"Type I chaperonins are molecular chaperones present in virtually all bacteria, some archaea and the plastids and mitochondria of eukaryotes. Sequences of cpn60 genes, encoding 60-kDa chaperonin protein subunits (CPN60, also known as GroEL or HSP60), are useful for phylogenetic studies and as targets for detection and identification of organisms. Conveniently, a 549-S67-bp segment of the cpn60 coding region can be amplified with universal PCR primers. Here, we introduce cpnDB, a curated collection of cpn60 sequence data collected from public databases or generated by a network of collaborators exploiting the cpn60 target in clinical, phylogenetic, and microbial ecology studies. The growing database currently contains ∼2000 records covering over 240 genera of bacteria, eukaryotes, and archaea. The database also contains over 60 sequences for the archaeal Type II chaperonin (thermosome, a homolog of eukaryotic cytoplasmic chaperonin) from 19 archaeal genera. As the largest curated collection of sequences available for a protein-encoding gene, cpnDB provides a resource for researchers interested in exploiting the power of cpn60 as a diagnostic or as a target for phylogenetic or microbial ecology studies, as well as those interested in broader subjects such as lateral gene transfer and codon usage. We built cpnDB from open source tools and it is available at http://cpndb.cbr.nrc.ca. © 2004 by Cold Spring Harbor Laboratory Press.","authors":["Hill J.E.","Penny S.L.","Crowell K.G.","Goh S.H.","Hemmingsen S.M."],"cit_count":146,"journal":"Genome Research","pmid":"15289485","title":"cpnDB: A chaperonin sequence database","year":"2004-08-01"}],"summary":{"biotoolsCURIE":"biotools:cpndb","biotoolsID":"cpndb","description":"Curated collection of chaperonin sequence data collected from public databases or generated by a network of collaborators exploiting the cpn60 target in clinical, phylogenetic and microbial ecology studies. The database contains all available sequences for both group I and group II chaperonins. It is built and maintained with open source tools.","homepage":"http://www.cpndb.ca/","name":"cpnDB"}}