{
    "additionDate": "2015-02-16T10:06:06Z",
    "biotoolsCURIE": "biotools:shelx",
    "biotoolsID": "shelx",
    "collectionID": [
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Suite of programs for small molecule crystallography, direct method and refinement.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://shelx.uni-goettingen.de/tutorials.php"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "note": "Suite of programs for small molecule crystallography, direct method and refinement. Also, Macromolecular crystallography programs for experimental phasing and restraint refinement. Substructure determination (SHELXD) and initial phasing as well as phase improvement (SHELXE) geared towards very fast indication of quality of resulting phases (maps). Restrained (high resolution) refinement in SHELXL.",
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "https://shelx.uni-goettingen.de/",
    "lastUpdate": "2024-11-24T15:57:55.500199Z",
    "name": "SHELX",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_014220"
        }
    ],
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1107/S0108767390000277",
            "metadata": {
                "authors": [
                    {
                        "name": "Sheldrick G.M."
                    }
                ],
                "citationCount": 19346,
                "date": "1990-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section A",
                "title": "Phase annealing in SHELX‐90: direct methods for larger structures"
            }
        },
        {
            "doi": "10.1107/s0907444909038360",
            "metadata": {
                "abstract": "The programs SHELXC, SHELXD and SHELXE are designed to provide simple, robust and efficient experimental phasing of macromolecules by the SAD, MAD, SIR, SIRAS and RIP methods and are particularly suitable for use in automated structure-solution pipelines. This paper gives a general account of experimental phasing using these programs and describes the extension of iterative density modification in SHELXE by the inclusion of automated protein main-chain tracing. This gives a good indication as to whether the structure has been solved and enables interpretable maps to be obtained from poorer starting phases. The autotracing algorithm starts with the location of possible seven-residue - helices and common tripeptides. After extension of these fragments in both directions, various criteria are used to decide whether to accept or reject the resulting poly-Ala traces. Noncrystallographic symmetry (NCS) is applied to the traced fragments, not to the density. Further features are the use of a no-go map to prevent the traces from passing through heavy atoms or symmetry elements and a splicing technique to combine the best parts of traces (including those generated by NCS) that partly overlap.",
                "authors": [
                    {
                        "name": "Sheldrick G.M."
                    }
                ],
                "citationCount": 995,
                "date": "2010-04-19T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Biological Crystallography",
                "title": "Experimental phasing with SHELXC/D/E: Combining chain tracing with density modification"
            },
            "pmcid": "PMC2852312",
            "pmid": "20383001"
        },
        {
            "doi": "10.1107/s2053229614024218",
            "metadata": {
                "abstract": "The improvements in the crystal structure refinement program SHELXL have been closely coupled with the development and increasing importance of the CIF (Crystallographic Information Framework) format for validating and archiving crystal structures. An important simplification is that now only one file in CIF format (for convenience, referred to simply as 'a CIF') containing embedded reflection data and SHELXL instructions is needed for a complete structure archive; the program SHREDCIF can be used to extract the.hkl and.ins files required for further refinement with SHELXL. Recent developments in SHELXL facilitate refinement against neutron diffraction data, the treatment of H atoms, the determination of absolute structure, the input of partial structure factors and the refinement of twinned and disordered structures. SHELXL is available free to academics for the Windows, Linux and Mac OS X operating systems, and is particularly suitable for multiple-core processors.",
                "authors": [
                    {
                        "name": "Sheldrick G.M."
                    }
                ],
                "citationCount": 20033,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section C: Structural Chemistry",
                "title": "Crystal structure refinement with SHELXL"
            },
            "pmcid": "PMC4294323",
            "pmid": "25567568"
        },
        {
            "doi": "10.1107/s0108767307043930",
            "metadata": {
                "abstract": "An account is given of the development of the SHELX system of computer programs from SHELX-76 to the present day. In addition to identifying useful innovations that have come into general use through their implementation in SHELX, a critical analysis is presented of the less-successful features, missed opportunities and desirable improvements for future releases of the software. An attempt is made to understand how a program originally designed for photographic intensity data, punched cards and computers over 10000 times slower than an average modern personal computer has managed to survive for so long. SHELXL is the most widely used program for small-molecule refinement and SHELXS and SHELXD are often employed for structure solution despite the availability of objectively superior programs. SHELXL also finds a niche for the refinement of macromolecules against high-resolution or twinned data; SHELXPRO acts as an interface for macromolecular applications. SHELXC, SHELXD and SHELXE are proving useful for the experimental phasing of macromolecules, especially because they are fast and robust and so are often employed in pipelines for high-throughput phasing. This paper could serve as a general literature citation when one or more of the open-source SHELX programs (and the Bruker AXS version SHELXTL) are employed in the course of a crystal-structure determination. © International Union of Crystallography 2008.",
                "authors": [
                    {
                        "name": "Sheldrick G.M."
                    }
                ],
                "citationCount": 83826,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Acta Crystallographica Section A: Foundations of Crystallography",
                "title": "A short history of SHELX"
            },
            "pmid": "18156677"
        },
        {
            "doi": "10.1107/s0907444902011678",
            "metadata": {
                "abstract": "Iterative dual-space direct methods based on phase refinement in reciprocal space and peak picking in real space are able to locate relatively large numbers of anomalous scatterers efficiently from MAD or SAD data. Truncation of the data at a particular resolution, typically in the range 3.0-3.5 Å, can be critical to success. The efficiency can be improved by roughly an order of magnitude by Patterson-based seeding instead of starting from random phases or sites; Patterson superposition methods also provide useful validation. The program SHELXD implementing this approach is available as part of the SHELX package.",
                "authors": [
                    {
                        "name": "Schneider T.R."
                    },
                    {
                        "name": "Sheldrick G.M."
                    }
                ],
                "citationCount": 1604,
                "date": "2002-10-01T00:00:00Z",
                "journal": "Acta Crystallographica Section D: Biological Crystallography",
                "title": "Substructure solution with SHELXD"
            },
            "pmid": "12351820"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
