
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "MRI",
                "uri": "http://edamontology.org/topic_3444"
            },
            {
                "term": "Medical imaging",
                "uri": "http://edamontology.org/topic_3384"
            },
            {
                "term": "Data acquisition",
                "uri": "http://edamontology.org/topic_3077"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Institute of Physics and Engineering in Medicine.With the recent advent of hybrid MRI-guided radiotherapy systems, continuous intra-fraction MR imaging for motion monitoring has become feasible. The ability to perform real-time custom image reconstructions is however often lacking. In this work we present a low-latency streaming solution, ReconSocket, which provides a real-time stream of k-space data from the magnetic resonance imaging (MRI) to custom reconstruction servers. We determined the performance of the data streaming by measuring the streaming latency (i.e. non-zero time delay due to data transfer and processing) and jitter (i.e. deviations from periodicity) using an ultra-fast 1D MRI acquisition of a moving phantom. Simultaneously, its position was recorded with near-zero time delay. The feasibility of low-latency custom reconstructions was tested by measuring the imaging latency (i.e. time delay between physical change and appearance of that change on the image) for several non-Cartesian 2D and 3D acquisitions using an in-house implemented reconstruction server. The measured streaming latency of the ReconSocket interface was ms. 98% of the incoming data packets arrived within a jitter range of 367 s. This shows that the ReconSocket interface can provide reliable real-time access to MRI data, acquired during the course of a MRI-guided radiotherapy fraction. The total imaging latency was measured to be 221 ms (2D) and 3889 ms (3D) for exemplary acquisitions, using the custom image reconstruction server. These imaging latencies are approximately equal to half of the temporal footprint (T acq/2) of the respective 2D and 3D golden-angle radial sequences. For radial sequences, it was previously showed that T acq/2 is the expected contribution of only the data acquisition to the total imaging latency. Indeed, the contribution of the non-Cartesian reconstruction to the total imaging latency was minor (<10%): 21 ms for 2D, 300 ms for 3D, indicating that the acquisition, i.e. the physical encoding of the image itself is the major contributor to the total imaging latency.",
            "authors": [
                "Borman P.T.S.",
                "Raaymakers B.W.",
                "Glitzner M."
            ],
            "cit_count": 0,
            "doi": "10.1088/1361-6560/AB3E99",
            "journal": "Physics in Medicine and Biology",
            "pmid": "31461412",
            "title": "ReconSocket: A low-latency raw data streaming interface for real-time MRI-guided radiotherapy",
            "year": "2019-09-17"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ReconSocket",
        "biotoolsID": "ReconSocket",
        "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | a low-latency raw data streaming interface for real-time MRI-guided radiotherapy | With the recent advent of hybrid MRI-guided radiotherapy systems, continuous intra-fraction MR imaging for motion monitoring has become feasible. The ability to perform real-time custom image reconstructions is however often lacking. In this work we present a low-latency streaming solution, ReconSocket, which provides a real-time stream of k-space data from the magnetic resonance imaging (MRI) to custom reconstruction servers. We determined the performance of the data streaming by measuring the streaming latency (i.e. non-zero time delay due to data transfer and processing) and jitter (i.e. deviations from periodicity) using an ultra-fast 1D MRI acquisition of a moving phantom. Simultaneously, its position was recorded with near-zero time delay",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31461412",
        "name": "ReconSocket"
    }
}