{"credit":[{"email":"jiankuihe@gmail.com","name":"Jiankui He","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.sustc-genome.org.cn/"},{"email":"ross@cuhk.edu.hk","name":"Ross Ka-Kit Leung","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"zhoufang_li@hotmail.com","name":"Zhoufang Li","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.sustc-genome.org.cn/vp/user_guide.php"}],"function":[{"operation":[{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["PHP"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Genotyping experiment","uri":"http://edamontology.org/topic_3516"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Pharmacogenomics","uri":"http://edamontology.org/topic_0208"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/virtual-pharmacist-a-platform-for-pharmacogenomics.html"}],"publication":[{"abstract":"© 2015 Cheng et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.We present Virtual Pharmacist, a web-based platform that takes common types of highthroughput data, namely microarray SNP genotyping data, FASTQ and Variant Call Format (VCF) files as inputs, and reports potential drug responses in terms of efficacy, dosage and toxicity at one glance. Batch submission facilitates multivariate analysis or data mining of targeted groups. Individual analysis consists of a report that is readily comprehensible to patients and practioners who have basic knowledge in pharmacology, a table that summarizes variants and potential affected drug response according to the US Food and Drug Administration pharmacogenomic biomarker labeled drug list and PharmGKB, and visualization of a gene-drug-target network. Group analysis provides the distribution of the variants and potential affected drug response of a target group, a sample-gene variant count table, and a sample-drug count table. Our analysis of genomes from the 1000 Genome Project underlines the potentially differential drug responses among different human populations. Even within the same population, the findings from Watson's genome highlight the importance of personalized medicine. Virtual Pharmacist can be accessed freely at http://www.sustc-genome.org.cn/vp or installed as a local web server. The codes and documentation are available at the GitHub repository (https://github.com/VirtualPharmacist/vp). Administrators can download the source codes to customize access settings for further development.","authors":["Cheng R.","Leung R.K.-K.","Chen Y.","Pan Y.","Tong Y.","Li Z.","Ning L.","Ling X.B.","He J."],"cit_count":5,"journal":"PLoS ONE","pmid":"26496198","title":"Virtual pharmacist: A platform for pharmacogenomics","year":"2015-10-23"}],"summary":{"biotoolsCURIE":"biotools:virtual_pharmacist","biotoolsID":"virtual_pharmacist","description":"Web tool that interprets personal genome for the impact of genetic variation on drug response. It can take variants data (VCF format), microarray SNP genotyping data and high-throughput sequencing data as input, and report to the users how the variants in their personal genomes impact their drug response, including drug efficacy, dosage and toxicity.","homepage":"http://www.sustc-genome.org.cn/vp/","name":"Virtual Pharmacist"}}