
{
    "credit": [
        {
            "email": "jing.han@msstate.edu",
            "name": "Ginger Han",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://sysbio.cvm.msstate.edu/CodonO/About.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Codon usage bias calculation",
                    "uri": "http://edamontology.org/operation_2962"
                },
                {
                    "term": "Codon usage bias plotting",
                    "uri": "http://edamontology.org/operation_2963"
                },
                {
                    "term": "Codon usage fraction calculation",
                    "uri": "http://edamontology.org/operation_2964"
                },
                {
                    "term": "Codon usage table generation",
                    "uri": "http://edamontology.org/operation_0284"
                },
                {
                    "term": "Codon usage analysis",
                    "uri": "http://edamontology.org/operation_0286"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Synonymous codon usage biases are associated with various biological factors, such as gene expression level, gene length, gene translation initiation signal, protein amino acid composition, protein structure, tRNA abundance, mutation frequency and patterns, and GC compositions. Quantification of codon usage bias helps understand evolution of living organisms. A codon usage bias pipeline is demanding for codon usage bias analyses within and across genomes. Here we present a CodonO webserver service as a userfriendly tool for codon usage bias analyses across and within genomes in real time. The webserver is available at http//www.sysbiology.org/CodonO. Contact: wanhenry@yahoo.com. © 2007 The Author(s).",
            "authors": [
                "Angellotti M.C.",
                "Bhuiyan S.B.",
                "Chen G.",
                "Wan X.-F."
            ],
            "cit_count": 53,
            "journal": "Nucleic Acids Research",
            "pmid": "17537810",
            "title": "CodonO: Codon usage bias analysis within and across genomes",
            "year": "2007-07-01"
        },
        {
            "abstract": "Background: Codon usage bias has been widely reported to correlate with GC composition. However, the quantitative relationship between codon usage bias and GC composition across species has not been reported. Results: Based on an informatics method (SCUO) we developed previously using Shannon informational theory and maximum entropy theory, we investigated the quantitative relationship between codon usage bias and GC composition. The regression based on 70 bacterial and 16 archaeal genomes showed that in bacteria, SCUO = -2.06 * GC3 + 2.05*(GC3)2 + 0.65, r = 0.91, and that in archaea, SCUO = -1.79 * GC3 + 1.85*(GC3)2 + 0.56, r = 0.89. We developed an analytical model to quantify synonymous codon usage bias by GC compositions based on SCUO. The parameters within this model were inferred by inspecting the relationship between codon usage bias and GC composition across 70 bacterial and 16 archaeal genomes. We further simplified this relationship using only GC3. This simple model was supported by computational simulation. Conclusions: The synonymous codon usage bias could be simply expressed as 1+ (p/2)log 2(p/2) + ((1-p)/2)log2((l-p)/2), where p = GC3. The software we developed for measuring SCUO (codonO) is available at http://digbio.missouri.edu/~wanx/cu/codonO. © 2004 Wan et al; licensee BioMed Central Ltd.",
            "authors": [
                "Wan X.-F.",
                "Xu D.",
                "Kleinhofs A.",
                "Zhou J."
            ],
            "cit_count": 92,
            "journal": "BMC Evolutionary Biology",
            "pmid": "15222899",
            "title": "Quantitative relationship between synonymous codon usage bias and GC composition across unicellular genomes",
            "year": "2004-06-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:codono",
        "biotoolsID": "codono",
        "description": "CodonO is a method for measuring synonymous codon usage bias within and across genomes.",
        "homepage": "http://digbio.missouri.edu/software/index.html",
        "name": "CodonO"
    }
}