{
    "additionDate": "2021-01-18T07:29:52Z",
    "biotoolsCURIE": "biotools:specs",
    "biotoolsID": "specs",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bhattacharyad@auburn.edu",
            "name": "Debswapna Bhattacharya",
            "orcidid": "https://orcid.org/0000-0002-9630-0141",
            "typeEntity": "Person"
        },
        {
            "email": "celine.everaert@ugent.be",
            "name": "Celine Everaert",
            "orcidid": "https://orcid.org/0000-0001-7772-4259",
            "typeEntity": "Person"
        }
    ],
    "description": "a non-parametric method to identify tissue-specific molecular features for unbalanced sample groups.\n\nIntegration of side-chain orientation and global distance-based measures for improved evaluation of protein structural models.\n\nTo understand biology and differences among various tissues or cell types, one typically searches for molecular features that display characteristic abundance patterns.\n\nSuperposition-based Protein Embedded CA SC score.\n\nA non-parameteric method to identify tissue-specific molecular features with unequal sample group sizes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Loop modelling",
                    "uri": "http://edamontology.org/operation_0481"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "http://specs.cmgg.be",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-20T14:21:13Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://watson.cse.eng.auburn.edu/SPECS/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/celineeveraert/SPECS"
        }
    ],
    "name": "SPECS",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3407-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: To understand biology and differences among various tissues or cell types, one typically searches for molecular features that display characteristic abundance patterns. Several specificity metrics have been introduced to identify tissue-specific molecular features, but these either require an equal number of replicates per tissue or they can't handle replicates at all. Results: We describe a non-parametric specificity score that is compatible with unequal sample group sizes. To demonstrate its usefulness, the specificity score was calculated on all GTEx samples, detecting known and novel tissue-specific genes. A webtool was developed to browse these results for genes or tissues of interest. An example python implementation of SPECS is available at https://github.com/celineeveraert/SPECS. The precalculated SPECS results on the GTEx data are available through a user-friendly browser at specs.cmgg.be. Conclusions: SPECS is a non-parametric method that identifies known and novel specific-expressed genes. In addition, SPECS could be adopted for other features and applications.",
                "authors": [
                    {
                        "name": "Everaert C."
                    },
                    {
                        "name": "Mestdagh P."
                    },
                    {
                        "name": "Morlion A."
                    },
                    {
                        "name": "Thas O."
                    },
                    {
                        "name": "Volders P.-J."
                    }
                ],
                "date": "2020-02-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SPECS: A non-parametric method to identify tissue-specific molecular features for unbalanced sample groups"
            },
            "pmcid": "PMC7026976",
            "pmid": "32066370"
        },
        {
            "doi": "10.1371/JOURNAL.PONE.0228245",
            "metadata": {
                "abstract": "© 2020 Alapati et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Significant advancements in the field of protein structure prediction have necessitated the need for objective and robust evaluation of protein structural models by comparing predicted models against the experimentally determined native structures to quantitate their structural similarities. Existing protein model versus native similarity metrics either consider the distances between alpha carbon (Cα) or side-chain atoms for computing the similarity. However, side-chain orientation of a protein plays a critical role in defining its conformation at the atomic-level. Despite its importance, inclusion of side-chain orientation in structural similarity evaluation has not yet been addressed. Here, we present SPECS, a side-chain-orientation-included protein model-native similarity metric for improved evaluation of protein structural models. SPECS combines side-chain orientation and global distance based measures in an integrated framework using the united-residue model of polypeptide conformation for computing model-native similarity. Experimental results demonstrate that SPECS is a reliable measure for evaluating structural similarity at the global level including and beyond the accuracy of Cα positioning. Moreover, SPECS delivers superior performance in capturing local quality aspect compared to popular global Cα positioning-based metrics ranging from models at near-experimental accuracies to models with correct overall folds—making it a robust measure suitable for both high- and moderate-resolution models. Finally, SPECS is sensitive to minute variations in side-chain χ angles even for models with perfect Cα trace, revealing the power of including side-chain orientation. Collectively, SPECS is a versatile evaluation metric covering a wide spectrum of protein modeling scenarios and simultaneously captures complementary aspects of structural similarities at multiple levels of granularities. SPECS is freely available at http://watson.cse.eng.auburn.edu/SPECS/.",
                "authors": [
                    {
                        "name": "Alapati R."
                    },
                    {
                        "name": "Bhattacharya D."
                    },
                    {
                        "name": "Hossain Shuvo M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SPECS: Integration of side-chain orientation and global distance-based measures for improved evaluation of protein structural models"
            },
            "pmcid": "PMC7018003",
            "pmid": "32053611"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
