{
    "additionDate": "2021-01-18T06:59:55Z",
    "biotoolsCURIE": "biotools:vria",
    "biotoolsID": "vria",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ees81c@bangor.ac.uk",
            "typeEntity": "Person"
        }
    ],
    "description": "A Web-based Framework for Creating Immersive Analytics Experiences.\n\nvisualization charts augmented-reality data-visualization virtual-reality webxr immersive-analytics.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vriajs",
    "lastUpdate": "2021-03-13T15:44:55Z",
    "name": "VRIA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TVCG.2020.2965109",
            "metadata": {
                "abstract": "© 1995-2012 IEEE.We present VRIA, a Web-based framework for creating Immersive Analytics (IA) experiences in Virtual Reality. VRIA is built upon WebVR, A-Frame, React and D3.js, and offers a visualization creation workflow which enables users, of different levels of expertise, to rapidly develop Immersive Analytics experiences for the Web. The use of these open-standards Web-based technologies allows us to implement VR experiences in a browser and offers strong synergies with popular visualization libraries, through the HTML Document Object Model (DOM). This makes VRIA ubiquitous and platform-independent. Moreover, by using WebVR's progressive enhancement, the experiences VRIA creates are accessible on a plethora of devices. We elaborate on our motivation for focusing on open-standards Web technologies, present the VRIA creation workflow and detail the underlying mechanics of our framework. We also report on techniques and optimizations necessary for implementing Immersive Analytics experiences on the Web, discuss scalability implications of our framework, and present a series of use case applications to demonstrate the various features of VRIA. Finally, we discuss current limitations of our framework, the lessons learned from its development, and outline further extensions.",
                "authors": [
                    {
                        "name": "Butcher P.W.S."
                    },
                    {
                        "name": "John N.W."
                    },
                    {
                        "name": "Ritsos P.D."
                    }
                ],
                "citationCount": 2,
                "date": "2021-07-01T00:00:00Z",
                "journal": "IEEE Transactions on Visualization and Computer Graphics",
                "title": "VRIA: A Web-Based Framework for Creating Immersive Analytics Experiences"
            },
            "pmid": "31944959"
        }
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}