{
    "additionDate": "2021-01-18T08:42:44Z",
    "biotoolsCURIE": "biotools:tomomqa",
    "biotoolsID": "tomomqa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jinsung@yuhs.ac",
            "name": "Jin Sung Kim",
            "typeEntity": "Person"
        },
        {
            "email": "kpark02@yuhs.ac",
            "name": "Kwangwoo Park",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated analysis program for MVCT quality assurance of helical tomotherapy.\n\nTomoMQA is written in MATLAB and contains three steps for analysis: (a) open the DICOM dataset folder generated via helical tomotherapy (i.e., TomoTherapy® and Radixact™), (b) call the baseline data for the consistency test and click the \"Analysis\" button (or click the \"Analysis\" button without the baseline data and export the results as the baseline data), and (c) print an analyzed report. The overall procedure for the QA analysis included in TomoMQA is referred from the TG-148 recommendation. Here, the tolerances for MVCT QA were implemented from TG-148 recommended values as default; however, it can be modified by a user manually",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://www.tomomqa.com/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-01T09:20:20Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mincheolhan/tomomqa"
        }
    ],
    "name": "TomoMQA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/ACM2.12875",
            "metadata": {
                "abstract": "© 2020 The Authors. Journal of Applied Clinical Medical Physics published by Wiley Periodicals LLC on behalf of American Association of Physicists in MedicinePurpose: In this study, we developed a simple but useful computer program, called TomoMQA, to offer an automated quality assurance for mega-voltage computed tomography (MVCT) images generated via helical tomotherapy. Methods: TomoMQA is written in MATLAB and contains three steps for analysis: (a) open the DICOM dataset folder generated via helical tomotherapy (i.e., TomoTherapy® and Radixact™), (b) call the baseline data for the consistency test and click the “Analysis” button (or click the “Analysis” button without the baseline data and export the results as the baseline data), and (c) print an analyzed report. The overall procedure for the QA analysis included in TomoMQA is referred from the TG-148 recommendation. Here, the tolerances for MVCT QA were implemented from TG-148 recommended values as default; however, it can be modified by a user manually. Results: To test the performance of the TomoMQA program, 15 MVCTs were prepared from five helical tomotherapy machines (1 of TomoTherapy® HD, 2 of TomoTherapy® HDA, and 2 of Radixact™) in 3 months and the QA procedures were performed using TomoMQA. From our results, the evaluation revealed that the developed program can successfully perform the MVCT QA analysis irrespective of the type of helical tomotherapy equipment. Conclusion: We successfully developed a new automated analysis program for MVCT QA of a helical tomotherapy platform, called TomoMQA. The developed program will be made freely downloadable from the TomoMQA-dedicated website.",
                "authors": [
                    {
                        "name": "Chang K.H."
                    },
                    {
                        "name": "Han M.C."
                    },
                    {
                        "name": "Han S.C."
                    },
                    {
                        "name": "Hong C.-S."
                    },
                    {
                        "name": "Kim D.W."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kim J.S."
                    },
                    {
                        "name": "Kim M.-J."
                    },
                    {
                        "name": "Lee S.H."
                    },
                    {
                        "name": "Park K."
                    },
                    {
                        "name": "Shin H.B."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Journal of Applied Clinical Medical Physics",
                "title": "TomoMQA: Automated analysis program for MVCT quality assurance of helical tomotherapy"
            },
            "pmcid": "PMC7324692",
            "pmid": "32268003"
        }
    ],
    "topic": [
        {
            "term": "Quality affairs",
            "uri": "http://edamontology.org/topic_3393"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
