
{
    "credit": [
        {
            "email": "udang@mcmaster.ca",
            "name": "Utkarsh J. Dang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://cran.r-project.org/web/packages/markophylo/markophylo.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Phylogeny",
                "uri": "http://edamontology.org/topic_0084"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Gene and protein families",
                "uri": "http://edamontology.org/topic_0623"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/markophylo-markov-chain-models-for-phylogenetic-trees.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Summary: Continuous-time Markov chain models with finite state space are routinely used for analysis of discrete character data on phylogenetic trees. Examples of such discrete character data include restriction sites, gene family presence/absence, intron presence/absence and gene family size data. While models with constrained substitution rate matrices have been used to good effect, more biologically realistic models have been increasingly implemented in the recent literature combining, e.g., site rate variation, site partitioning, branch-specific rates, allowing for non-stationary prior root probabilities, correcting for sampling bias, etc. to name a few. Here, a flexible and fast R package is introduced that infers evolutionary rates of discrete characters on a tree within a probabilistic framework. The package, markophylo, fits maximum-likelihood models using Markov chains on phylogenetic trees. The package is efficient, with the workhorse functions written in C++ and the interface in user-friendly R. Availability and implementation: markophylo is available as a platform-independent R package from the Comprehensive R Archive Network at https://cran.r-project.org/web/packages/markophylo/. A vignette with numerous examples is also provided with the R package.",
            "authors": [
                "Dang U.J.",
                "Golding G.B."
            ],
            "cit_count": 2,
            "journal": "Bioinformatics",
            "pmid": "26363176",
            "title": "Markophylo: Markov chain analysis on phylogenetic trees",
            "year": "2015-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:markophylo",
        "biotoolsID": "markophylo",
        "description": "Allows for fitting of maximum likelihood models using Markov chains on phylogenetic trees for analysis of discrete character data.",
        "homepage": "https://cran.r-project.org/web/packages/markophylo/",
        "name": "markophylo"
    }
}