{
    "additionDate": "2019-11-14T20:05:30Z",
    "biotoolsCURIE": "biotools:Lipase_Engineering_Database",
    "biotoolsID": "Lipase_Engineering_Database",
    "confidence_flag": "tool",
    "description": "The modular structure of α/β-hydrolases | The BioCatNet Database System aims to collect and present comprehensive information about biocatalysators: sequence, structure, educts, products, environmental conditions and kinetics | The Lipase Engineering Database (LED) version4.0.0 | Widmann M., Juhl PB. & Pleiss J. (2010). Structural classification by the Lipase Engineering Database: a case study of Candida antarctica lipase A. BMC Genomics 11: 123",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://led.biocatnet.de",
    "lastUpdate": "2020-12-22T11:02:44Z",
    "name": "Lipase Engineering Database",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/FEBS.15071",
            "metadata": {
                "abstract": "© 2019 The Authors. The FEBS Journal published by John Wiley & Sons Ltd on behalf of Federation of European Biochemical Societies.The α/β-hydrolase fold family is highly diverse in sequence, structure and biochemical function. To investigate the sequence–structure–function relationships, the Lipase Engineering Database (https://led.biocatnet.de) was updated. Overall, 280 638 protein sequences and 1557 protein structures were analysed. All α/β-hydrolases consist of the catalytically active core domain, but they might also contain additional structural modules, resulting in 12 different architectures: core domain only, additional lids at three different positions, three different caps, additional N- or C-terminal domains and combinations of N- and C-terminal domains with caps and lids respectively. In addition, the α/β-hydrolases were distinguished by their oxyanion hole signature (GX-, GGGX- and Y-types). The N-terminal domains show two different folds, the Rossmann fold or the β-propeller fold. The C-terminal domains show a β-sandwich fold. The N-terminal β-propeller domain and the C-terminal β-sandwich domain are structurally similar to carbohydrate-binding proteins such as lectins. The classification was applied to the newly discovered polyethylene terephthalate (PET)-degrading PETases and MHETases, which are core domain α/β-hydrolases of the GX- and the GGGX-type respectively. To investigate evolutionary relationships, sequence networks were analysed. The degree distribution followed a power law with a scaling exponent γ = 1.4, indicating a highly inhomogeneous network which consists of a few hubs and a large number of less connected sequences. The hub sequences have many functional neighbours and therefore are expected to be robust toward possible deleterious effects of mutations. The cluster size distribution followed a power law with an extrapolated scaling exponent τ = 2.6, which strongly supports the connectedness of the sequence space of α/β-hydrolases. Database : Supporting data about domains from other proteins with structural similarity to the N- or C-terminal domains of α/β-hydrolases are available in Data Repository of the University of Stuttgart (DaRUS) under doi: https://doi.org/10.18419/darus-458.",
                "authors": [
                    {
                        "name": "Bauer T.L."
                    },
                    {
                        "name": "Buchholz P.C.F."
                    },
                    {
                        "name": "Pleiss J."
                    }
                ],
                "citationCount": 5,
                "date": "2020-03-01T00:00:00Z",
                "journal": "FEBS Journal",
                "title": "The modular structure of α/β-hydrolases"
            },
            "pmid": "31545554"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1
}