{
    "additionDate": "2017-01-13T13:15:50Z",
    "biotoolsCURIE": "biotools:peralign",
    "biotoolsID": "peralign",
    "credit": [
        {
            "name": "Authors",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.netlab.uky.edu/p/bioinfo/People"
        }
    ],
    "description": "A probabilistic framework to predict the alignment of each transcript fragment to a reference genome for each PER (RNA-seq paired-end read). The alignment chosen is determined by maximizing the likelihood of all PER alignments through an expectation maximization method.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.netlab.uky.edu/dokuwiki/doku.php"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                },
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://www.netlab.uky.edu/p/bioinfo/mapPER",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "name": "PERalign",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: The RNA-seq paired-end read (PER) protocol samples transcript fragments longer than the sequencing capability of today's technology by sequencing just the two ends of each fragment. Deep sampling of the transcriptome using the PER protocol presents the opportunity to reconstruct the unsequenced portion of each transcript fragment using end reads from overlapping PERs, guided by the expected length of the fragment.Methods: A probabilistic framework is described to predict the alignment to the genome of all PER transcript fragments in a PER dataset. Starting from possible exonic and spliced alignments of all end reads, our method constructs potential splicing paths connecting paired ends. An expectation maximization method assigns likelihood values to all splice junctions and assigns the most probable alignment for each transcript fragment. Results: The method was applied to 2 × 35 bp PER datasets from cancer cell lines MCF-7 and SUM-102. PER fragment alignment increased the coverage 3-fold compared to the alignment of the end reads alone, and increased the accuracy of splice detection. The accuracy of the expectation maximization (EM) algorithm in the presence of alternative paths in the splice graph was validated by qRT-PCR experiments on eight exon skipping alternative splicing events. PER fragment alignment with long-range splicing confirmed 8 out of 10 fusion events identified in the MCF-7 cell line in an earlier study by (Maher et al., 2009). © The Author 2010. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Chiang D.Y."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Prins J.F."
                    },
                    {
                        "name": "Wang K."
                    }
                ],
                "citationCount": 16,
                "date": "2010-06-23T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "A probabilistic framework for aligning paired-end RNA-seq data"
            },
            "pmid": "20576625"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
