{
    "additionDate": "2017-08-03T18:54:19Z",
    "biotoolsCURIE": "biotools:pmfastr",
    "biotoolsID": "pmfastr",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genome.ucf.edu/"
        }
    ],
    "description": "Algorithm which iteratively uses a sequence-structure alignment procedure to build a multiple RNA structure alignment.",
    "documentation": [
        {
            "type": "General",
            "url": "http://genome.ucf.edu/PMFastR/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                }
            ]
        }
    ],
    "homepage": "http://genome.ucf.edu/PMFastR/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pmfastr-approach-multiple-rna-structure-alignment.html"
        }
    ],
    "name": "PMFastR",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Structure-based RNA multiple alignment is particularly challenging because covarying mutations make sequence information alone insufficient. Existing tools for RNA multiple alignment first generate pairwise RNA structure alignments and then build the multiple alignment using only sequence information. Here we present PMFastR, an algorithm which iteratively uses a sequence-structure alignment procedure to build a structure-based RNA multiple alignment from one sequence with known structure and a database of sequences from the same family. PMFastR also has low memory consumption allowing for the alignment of large sequences such as 16S and 23S rRNA. The algorithm also provides a method to utilize a multicore environment. We present results on benchmark data sets from BRAliBase, which shows PMFastR performs comparably to other state-of-the-art programs. Finally, we regenerate 607 Rfam seed alignments and show that our automated process creates multiple alignments similar to the manually curated Rfam seed alignments. Thus, the techniques presented in this paper allow for the generation of multiple alignments using sequence-structure guidance, while limiting memory consumption. As a result, multiple alignments of long RNA sequences, such as 16S and 23S rRNAs, can easily be generated locally on a personal computer. The software and supplementary data are available at http://genome.ucf.edu/PMFastR. © 2012 IEEE.",
                "authors": [
                    {
                        "name": "Deblasio D."
                    },
                    {
                        "name": "Bruand J."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "citationCount": 2,
                "date": "2012-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "A memory efficient method for structure-based RNA multiple alignment"
            },
            "pmid": "21576754"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}