{
    "additionDate": "2017-12-06T18:14:45Z",
    "biotoolsCURIE": "biotools:pftools",
    "biotoolsID": "pftools",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "pftools@sib.swiss",
            "name": "pftools team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The pftools are a collection of programs to build, calibrate, and search biological sequences with generalized profiles. Generalized profiles are an extension of position specific scoring matrices by including position specific scores for insertions and deletions. They correspond to a matrix representation of a multiple sequence alignment that can be used to search distant homologous sequences and precisely align sequences to the model.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://web.expasy.org/pftools/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/sib-swiss/pftools3"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools",
            "BeatriceCuche",
            "smoretti"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Switzerland"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sib-swiss/pftools3",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-11-09T13:50:34.494112Z",
    "license": "GPL-2.0",
    "name": "pftools",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1002/pro.5560030118",
            "metadata": {
                "abstract": "The sequence profile method (Gribskov M, McLachlan AD, Eisenberg D, 1987, Proc Natl Acad Sci USA 84:4355‐4358) is a powerful tool to detect distant relationships between amino acid sequences. A profile is a table of posi‐tion‐specific scores and gap penalties, providing a generalized description of a protein motif, which can be used for sequence alignments and database searches instead of an individual sequence. A sequence profile is derived from a multiple sequence alignment. We have found 2 ways to improve the sensitivity of sequence profiles: (1) Sequence weights: Usage of individual weights for each sequence avoids bias toward closely related sequences. These weights are automatically assigned based on the distance of the sequences using a published procedure (Sib‐bald PR, Argos P, 1990, J Mol Biol 216:813‐818). (2) Amino acid substitution table: In addition to the alignment, the construction of a profile also needs an amino acid substitution table. We have found that in some cases a new table, the BLOSUM45 table (Henikoff S, Henikoff JG, 1992, Proc Natl Acud Sci USA 89:10915‐10919), is more sensitive than the original Dayhoff table or the modified Dayhoff table used in the current implementation. Profiles derived by the improved method are more sensitive and selective in a number of cases where previous methods have failed to completely separate true members from false positives. Copyright © 1994 The Protein Society",
                "authors": [
                    {
                        "name": "Luthy R."
                    },
                    {
                        "name": "Xenarios I."
                    },
                    {
                        "name": "Bucher P."
                    }
                ],
                "citationCount": 108,
                "date": "1994-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Improving the sensitivity of the sequence profile method"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "The PROSITE resource provides a rich and well annotated source of signatures in the form of generalized profiles that allow protein domain detection and functional annotation. One of the major limiting factors in the application of PROSITE in genome and metagenome annotation pipelines is the time required to search protein sequence databases for putative matches. We describe an improved and optimized implementation of the PROSITE search tool pfsearch that, combined with a newly developed heuristic, addresses this limitation. On a modern x86_64 hyper-threaded quad-core desktop computer, the new pfsearchV3 is two orders of magnitude faster than the original algorithm. Source code and binaries of pfsearchV3 are freely available for download at http://web.expasy.org/pftools/#pfsearchV3, implemented in C and supported on Linux. PROSITE generalized profiles including the heuristic cut-off scores are available at the same address.",
                "authors": [
                    {
                        "name": "Schuepbach T."
                    },
                    {
                        "name": "Pagni M."
                    },
                    {
                        "name": "Bridge A."
                    },
                    {
                        "name": "Bougueleret L."
                    },
                    {
                        "name": "Xenarios I."
                    },
                    {
                        "name": "Cerutti L."
                    }
                ],
                "citationCount": 11,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "pfsearchV3: a code acceleration and heuristic to search PROSITE profiles."
            },
            "pmid": "23505298"
        }
    ],
    "toolType": [
        "Web application",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ],
    "validated": 1
}