{
    "additionDate": "2018-06-12T16:13:19Z",
    "biotoolsCURIE": "biotools:evoprinter",
    "biotoolsID": "evoprinter",
    "credit": [
        {
            "email": "brodyt@ninds.nih.gov",
            "name": "Thomas Brody",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "odenwaldw@ninds.nih.gov",
            "name": "Ward F. Odenwald",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comparative genomics tool for discovering conserved DNA sequences that are shared among three or more orthologous DNAs.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://evoprinter.ninds.nih.gov/evoprintprogramHD/tutorial/index.html"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://evoprinter.ninds.nih.gov/aboutevopHD.htm"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif discovery",
                    "uri": "http://edamontology.org/operation_0238"
                },
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "homepage": "https://evoprinter.ninds.nih.gov/evoprintprogramHD/evphd.html",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "EvoPrinter",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pntd.0005673",
            "metadata": {
                "abstract": "© 2017, Public Library of Science. All rights reserved.Background: Flavivirus and Filovirus infections are serious epidemic threats to human populations. Multi-genome comparative analysis of these evolving pathogens affords a view of their essential, conserved sequence elements as well as progressive evolutionary changes. While phylogenetic analysis has yielded important insights, the growing number of available genomic sequences makes comparisons between hundreds of viral strains challenging. We report here a new approach for the comparative analysis of these hemorrhagic fever viruses that can superimpose an unlimited number of one-on-one alignments to identify important features within genomes of interest. Methodology/Principal finding: We have adapted EvoPrinter alignment algorithms for the rapid comparative analysis of Flavivirus or Filovirus sequences including Zika and Ebola strains. The user can input a full genome or partial viral sequence and then view either individual comparisons or generate color-coded readouts that superimpose hundreds of one-on-one alignments to identify unique or shared identity SNPs that reveal ancestral relationships between strains. The user can also opt to select a database genome in order to access a library of pre-aligned genomes of either 1,094 Flaviviruses or 460 Filoviruses for rapid comparative analysis with all database entries or a select subset. Using EvoPrinter search and alignment programs, we show the following: 1) superimposing alignment data from many related strains identifies lineage identity SNPs, which enable the assessment of sublineage complexity within viral outbreaks; 2) whole-genome SNP profile screens uncover novel Dengue2 and Zika recombinant strains and their parental lineages; 3) differential SNP profiling identifies host cell A-to-I hyper-editing within Ebola and Marburg viruses, and 4) hundreds of superimposed one-on-one Ebola genome alignments highlight ultra-conserved regulatory sequences, invariant amino acid codons and evolutionarily variable protein-encoding domains within a single genome. Conclusions/Significance: EvoPrinter allows for the assessment of lineage complexity within Flavivirus or Filovirus outbreaks, identification of recombinant strains, highlights sequences that have undergone host cell A-to-I editing, and identifies unique input and database SNPs within highly conserved sequences. EvoPrinter’s ability to superimpose alignment data from hundreds of strains onto a single genome has allowed us to identify unique Zika virus sublineages that are currently spreading in South, Central and North America, the Caribbean, and in China. This new set of integrated alignment programs should serve as a useful addition to existing tools for the comparative analysis of these viruses.",
                "authors": [
                    {
                        "name": "Brody T."
                    },
                    {
                        "name": "Yavatkar A.S."
                    },
                    {
                        "name": "Park D.S."
                    },
                    {
                        "name": "Kuzin A."
                    },
                    {
                        "name": "Ross J."
                    },
                    {
                        "name": "Odenwald W.F."
                    }
                ],
                "citationCount": 1,
                "date": "2017-06-16T00:00:00Z",
                "journal": "PLoS Neglected Tropical Diseases",
                "title": "Flavivirus and Filovirus EvoPrinters: New alignment tools for the comparative analysis of viral evolution"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}