{
    "additionDate": "2020-01-14T09:15:56Z",
    "biotoolsCURIE": "biotools:RGRPT",
    "biotoolsID": "RGRPT",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "guomaozu@bucea.edu.cn",
            "name": "Maozu Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "RGRPT is a New Algorithm for Identifying Genome Rearrangements in the Mammalian Evolution.\n\nGenome rearrangements are the evolutionary events on level of genomes. It is a global view on evolution research of species to analyze the genome rearrangements. We introduce a new method called RGRPT (recovering the genome rearrangements based on phylogenetic tree) used to identify the genome rearrangements. We test the RGRPT using simulated data. The results of experiments show that RGRPT have high sensitivity and specificity compared with other tools when to predict rearrangement events. We use RGRPT to predict the rearrangement events of six mammalian genomes (human, chimpanzee, rhesus macaque, mouse, rat, and dog). RGRPT has recognized a total of 1,157 rearrangement events for them at 10 kb resolution, including 858 reversals, 16 translocations, 249 transpositions, and 34 fusions fissions.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ancestral reconstruction",
                    "uri": "http://edamontology.org/operation_3745"
                },
                {
                    "term": "Phylogenetic tree editing",
                    "uri": "http://edamontology.org/operation_0326"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree visualisation",
                    "uri": "http://edamontology.org/operation_0567"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangjuanimu/data-of-genome-rearrangement",
    "lastUpdate": "2021-01-15T19:28:21Z",
    "name": "RGRPT",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01020",
            "metadata": {
                "abstract": "© 2019 Wang, Cui, Zhao and Guo.Genome rearrangements are the evolutionary events on level of genomes. It is a global view on evolution research of species to analyze the genome rearrangements. We introduce a new method called RGRPT (recovering the genome rearrangements based on phylogenetic tree) used to identify the genome rearrangements. We test the RGRPT using simulated data. The results of experiments show that RGRPT have high sensitivity and specificity compared with other tools when to predict rearrangement events. We use RGRPT to predict the rearrangement events of six mammalian genomes (human, chimpanzee, rhesus macaque, mouse, rat, and dog). RGRPT has recognized a total of 1,157 rearrangement events for them at 10 kb resolution, including 858 reversals, 16 translocations, 249 transpositions, and 34 fusions/fissions. And RGRPT has recognized 475 rearrangement events for them at 50 kb resolution, including 332 reversals, 13 translocations, 94 transpositions, and 36 fusions/fissions. The code source of RGRPT is available from https://github.com/ wangjuanimu/data-of-genome-rearrangement.",
                "authors": [
                    {
                        "name": "Cui B."
                    },
                    {
                        "name": "Guo M."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "A new algorithm for identifying genome rearrangements in the mammalian evolution"
            },
            "pmcid": "PMC6828935",
            "pmid": "31737036"
        }
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}
