
{
    "credit": [
        {
            "email": "sohyun79@yonsei.ac.kr",
            "name": "Sohyun Hwang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.netbiolab.org/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.inetbio.org/morphin/tutorial.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Human biology",
                "uri": "http://edamontology.org/topic_2815"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/morphin-model-organisms-projected-on-a-human-integrated-gene-network.html"
        }
    ],
    "publication": [
        {
            "abstract": "Despite recent advances in human genetics, model organisms are indispensable for human disease research. Most human disease pathways are evolutionally conserved among other species, where they may phenocopy the human condition or be associated with seemingly unrelated phenotypes. Much of the known gene-to-phenotype association information is distributed across diverse databases, growing rapidly due to new experimental techniques. Accessible bioinformatics tools will therefore facilitate translation of discoveries from model organisms into human disease biology. Here, we present a web-based discovery tool for human disease studies, MORPHIN (model organisms projected on a human integrated gene network), which prioritizes the most relevant human diseases for a given set of model organism genes, potentially highlighting new model systems for human diseases and providing context to model organism studies. Conceptually, MORPHIN investigates human diseases by an orthology-based projection of a set of model organism genes onto a genome-scale human gene network. MORPHIN then prioritizes human diseases by relevance to the projected model organism genes using two distinct methods: a conventional overlap-based gene set enrichment analysis and a network-based measure of closeness between the query and disease gene sets capable of detecting associations undetectable by the conventional overlap-based methods. MORPHIN is freely accessible at http://www.inetbio.org/morphin. © 2014 The Author(s).",
            "authors": [
                "Hwang S.",
                "Kim E.",
                "Yang S.",
                "Marcotte E.M.",
                "Lee I."
            ],
            "cit_count": 12,
            "journal": "Nucleic Acids Research",
            "pmid": "24861622",
            "title": "MORPHIN: A web tool for human disease research by projecting model organism biology onto a human integrated gene network",
            "year": "2014-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:morphin",
        "biotoolsID": "morphin",
        "description": "Web-based bioinformatics tool to study human diseases using model organism genes.",
        "homepage": "http://www.inetbio.org/morphin/",
        "name": "MORPHIN"
    }
}