{
    "additionDate": "2015-12-06T15:18:32Z",
    "biotoolsCURIE": "biotools:scampi",
    "biotoolsID": "scampi",
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "arne@bioinfo.se",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Prediction of membrane protein topology from first principles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://scampi.cbr.su.se/pred/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Transmembrane protein analysis",
                    "uri": "http://edamontology.org/operation_0270"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein features",
                        "uri": "http://edamontology.org/data_1277"
                    }
                }
            ]
        }
    ],
    "homepage": "http://scampi.cbr.su.se/",
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "SCAMPI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mikael.borg@bils.se",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btv709",
            "metadata": {
                "abstract": "© 2015 The Author. All rights reserved.Motivation: The translocon recognizes sufficiently hydrophobic regions of a protein and inserts them into the membrane. Computational methods try to determine what hydrophobic regions are recognized by the translocon. Although these predictions are quite accurate, many methods still fail to distinguish marginally hydrophobic transmembrane (TM) helices and equally hydrophobic regions in soluble protein domains. In vivo, this problem is most likely avoided by targeting of the TM-proteins, so that non-TM proteins never see the translocon. Proteins are targeted to the translocon by an N-terminal signal peptide. The targeting is also aided by the fact that the N-terminal helix is more hydrophobic than other TM-helices. In addition, we also recently found that the C-terminal helix is more hydrophobic than central helices. This information has not been used in earlier topology predictors. Results: Here, we use the fact that the N-and C-terminal helices are more hydrophobic to develop a new version of the first-principle-based topology predictor, SCAMPI. The new predictor has two main advantages; first, it can be used to efficiently separate membrane and non-membrane proteins directly without the use of an extra prefilter, and second it shows improved performance for predicting the topology of membrane proteins that contain large non-membrane domains.",
                "authors": [
                    {
                        "name": "Peters C."
                    },
                    {
                        "name": "Tsirigos K.D."
                    },
                    {
                        "name": "Shu N."
                    },
                    {
                        "name": "Elofsson A."
                    }
                ],
                "citationCount": 17,
                "date": "2016-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Improved topology prediction using the terminal hydrophobic helices rule"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}