{
    "additionDate": "2016-01-20T15:28:38Z",
    "biotoolsCURIE": "biotools:crisprmap",
    "biotoolsID": "crisprmap",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "University Freiburg",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "name": "rnateam",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "rna@rna.informatik.uni-freiburg.de",
            "name": "Rolf Backofen",
            "orcidid": "http://orcid.org/0000-0001-8231-3323",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "sita@informatik.uni-freiburg.de",
            "name": "Sita Saunders",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "email": "rna@rna.informatik.uni-freiburg.de",
            "name": "Rolf Backofen",
            "orcidid": "http://orcid.org/0000-0001-8231-3323",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "sita@informatik.uni-freiburg.de",
            "name": "Sita Saunders",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Prediction of CRISPR RNA by repeat conservation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rna.informatik.uni-freiburg.de/Help.jsp?toolName=CRISPRmap"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "RNA sequence",
                        "uri": "http://edamontology.org/data_3495"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "note": "CRISPRmap enables comprehensive independent clustering analyses to determine conserved sequence families, potential structure motifs for endoribonucleases, and evolutionary relationships.",
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "newick",
                            "uri": "http://edamontology.org/format_1910"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    },
                    "format": [
                        {
                            "term": "JPG",
                            "uri": "http://edamontology.org/format_3579"
                        },
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        },
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        },
                        {
                            "term": "EPS",
                            "uri": "http://edamontology.org/format_3466"
                        },
                        {
                            "term": "PDF",
                            "uri": "http://edamontology.org/format_3508"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://rna.informatik.uni-freiburg.de/CRISPRmap/",
    "lastUpdate": "2019-02-25T20:52:38Z",
    "maturity": "Mature",
    "name": "CRISPRmap web server",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "rnateam",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu459",
            "metadata": {
                "abstract": "Motivation: The discovery of CRISPR-Cas systems almost 20 years ago rapidly changed our perception of the bacterial and archaeal immune systems. CRISPR loci consist of several repetitive DNA sequences called repeats, inter-spaced by stretches of variable length sequences called spacers. This CRISPR array is transcribed and processed into multiple mature RNA species (crRNAs). A single crRNA is integrated into an interference complex, together with CRISPR-associated (Cas) proteins, to bind and degrade invading nucleic acids. Although existing bioinformatics tools can recognize CRISPR loci by their characteristic repeat-spacer architecture, they generally output CRISPR arrays of ambiguous orientation and thus do not determine the strand from which crRNAs are processed. Knowledge of the correct orientation is crucial for many tasks, including the classification of CRISPR conservation, the detection of leader regions, the identification of target sites (protospacers) on invading genetic elements and the characterization of protospacer-adjacent motifs. Results: We present a fast and accurate tool to determine the crRNAencoding strand at CRISPR loci by predicting the correct orientation of repeats based on an advanced machine learning approach. Both the repeat sequence and mutation information were encoded and processed by an efficient graph kernel to learn higher-order correlations. The model was trained and tested on curated data comprising 44500 CRISPRs and yielded a remarkable performance of 0.95 AUC ROC (area under the curve of the receiver operator characteristic). In addition, we show that accurate orientation information greatly improved detection of conserved repeat sequence families and structure motifs. We integrated CRISPRstrand predictions into our CRISPRmap web server of CRISPR conservation and updated the latter to version 2.0. © The Author 2014. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Alkhnbashi O.S."
                    },
                    {
                        "name": "Costa F."
                    },
                    {
                        "name": "Shah S.A."
                    },
                    {
                        "name": "Garrett R.A."
                    },
                    {
                        "name": "Saunders S.J."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "citationCount": 32,
                "date": "2014-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CRISPRstrand: Predicting repeat orientations to determine the crRNA-encoding strand at CRISPR loci"
            },
            "pmcid": "PMC4147912",
            "pmid": "25161238",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Central to Clustered Regularly Interspaced Short Palindromic Repeat (CRISPR)-Cas systems are repeated RNA sequences that serve as Cas-protein-binding templates. Classification is based on the architectural composition of associated Cas proteins, considering repeat evolution is essential to complete the picture. We compiled the largest data set of CRISPRs to date, performed comprehensive, independent clustering analyses and identified a novel set of 40 conserved sequence families and 33 potential structure motifs for Cas-endoribonucleases with some distinct conservation patterns. Evolutionary relationships are presented as a hierarchical map of sequence and structure similarities for both a quick and detailed insight into the diversity of CRISPR-Cas systems. In a comparison with Cas-subtypes, I-C, I-E, I-F and type II were strongly coupled and the remaining type I and type III subtypes were loosely coupled to repeat and Cas1 evolution, respectively. Subtypes with a strong link to CRISPR evolution were almost exclusive to bacteria; nevertheless, we identified rare examples of potential horizontal transfer of I-C and I-E systems into archaeal organisms. Our easy-to-use web server provides an automated assignment of newly sequenced CRISPRs to our classification system and enables more informed choices on future hypotheses in CRISPR-Cas research: http://rna.informatik.uni-freiburg.de/CRISPRmap. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Lange S.J."
                    },
                    {
                        "name": "Alkhnbashi O.S."
                    },
                    {
                        "name": "Rose D."
                    },
                    {
                        "name": "Will S."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "citationCount": 78,
                "date": "2013-09-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CRISPRmap: An automated classification of repeat conservation in prokaryotic adaptive immune systems"
            },
            "pmid": "23863837"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "2.1.3"
    ]
}