{
    "additionDate": "2021-01-18T07:35:27Z",
    "biotoolsCURIE": "biotools:pmlipred",
    "biotoolsID": "pmlipred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "mengjun@dlut.edu.cn",
            "name": "Jun Meng",
            "typeEntity": "Person"
        },
        {
            "email": "luanyush@dlut.edu.cn",
            "name": "Yushi Luan",
            "typeEntity": "Person"
        }
    ],
    "description": "PmliPred is a method based on hybrid model and fuzzy decision for plant miRNA-lncRNA interaction prediction.\n\nWe have proposed a new method for fulfilling plant miRNA-lncRNA interaction prediction (PmliPred). The deep learning model and shallow machine learning model are trained using raw sequences and manually extracted features respectively. Then they are hybridized based on fuzzy decision for prediction. PmliPred shows a better performance and generalization ability comparing with the existing methods. Several new miRNA-lncRNA interactions in Solanum lycopersicum are successfully identified using quantitative RT-PCR from the candidates predicted by PmliPred, which further verifies its effectiveness.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://bis.zju.edu.cn/PmliPred/",
    "lastUpdate": "2021-01-24T14:00:25Z",
    "name": "PmliPred",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA074",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: The studies have indicated that not only microRNAs (miRNAs) or long non-coding RNAs (lncRNAs) play important roles in biological activities, but also their interactions affect the biological process. A growing number of studies focus on the miRNA-lncRNA interactions, while few of them are proposed for plant. The prediction of interactions is significant for understanding the mechanism of interaction between miRNA and lncRNA in plant. Results: This article proposes a new method for fulfilling plant miRNA-lncRNA interaction prediction (PmliPred). The deep learning model and shallow machine learning model are trained using raw sequence and manually extracted features, respectively. Then they are hybridized based on fuzzy decision for prediction. PmliPred shows better performance and generalization ability compared with the existing methods. Several new miRNA-lncRNA interactions in Solanum lycopersicum are successfully identified using quantitative real time-polymerase chain reaction from the candidates predicted by PmliPred, which further verifies its effectiveness.",
                "authors": [
                    {
                        "name": "Kang Q."
                    },
                    {
                        "name": "Meng J."
                    },
                    {
                        "name": "Cui J."
                    },
                    {
                        "name": "Luan Y."
                    },
                    {
                        "name": "Chen M."
                    }
                ],
                "citationCount": 4,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PmliPred: A method based on hybrid model and fuzzy decision for plant miRNA-lncRNA interaction prediction"
            },
            "pmid": "32087005"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}