{
    "additionDate": "2021-01-20T11:00:24Z",
    "biotoolsCURIE": "biotools:lfspro",
    "biotoolsID": "lfspro",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wwang7@mdanderson.org",
            "name": "Wenyi Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Penetrance of Different Cancer Types in Families with Li-Fraumeni Syndrome.\n\nNew features in 2.0.0: lfspro.mode is added to replace lfspro to account for additional utilities in cancer-specific and multiple primary cancer risk predictions. Simply specify parameter ‘mode’ to call desired functions.\n\nTP53 germline mutation carrier estimation and cancer risk predictions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://bioinformatics.mdanderson.org/public-software/lfspro/",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2021-05-17T07:37:12.426346Z",
    "license": "GPL-3.0",
    "name": "LFSPRO",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1158/0008-5472.CAN-19-0728",
            "metadata": {
                "abstract": "© 2019 American Association for Cancer Research.Li-Fraumeni syndrome (LFS) is a rare hereditary cancer syndrome associated with an autosomal-dominant mutation inheritance in the TP53 tumor suppressor gene and a wide spectrum of cancer diagnoses. The previously developed R package, LFSPRO, is capable of estimating the risk of an individual being a TP53 mutation carrier. However, an accurate estimation of the penetrance of different cancer types in LFS is crucial to improve the clinical characterization and management of high-risk individuals. Here, we developed a competing risk-based statistical model that incorporates the pedigree structure efficiently into the penetrance estimation and corrects for ascertainment bias while also increasing the effective sample size of this rare population. This enabled successful estimation of TP53 penetrance for three LFS cancer types: breast (BR), sarcoma (SA), and others (OT), from 186 pediatric sarcoma families collected at MD Anderson Cancer Center (Houston, TX). Penetrance validation was performed on a combined dataset of two clinically ascertained family cohorts with cancer to overcome internal bias in each (total number of families = 668). The age-dependent onset probability distributions of specific cancer types were different. For breast cancer, the TP53 penetrance went up at an earlier age than the reported BRCA1/2 penetrance. The prediction performance of the penetrance estimates was validated by the combined independent cohorts (BR = 85, SA = 540, and OT = 158). Area under the ROC curves (AUC) were 0.92 (BR), 0.75 (SA), and 0.81 (OT). The new penetrance estimates have been incorporated into the current LFSPRO R package to provide risk estimates for the diagnosis of breast cancer, sarcoma, or other cancers. Significance: These findings provide specific penetrance estimates for LFS-associated cancers, which will likely impact the management of families at high risk of LFS.",
                "authors": [
                    {
                        "name": "Shin S.J."
                    },
                    {
                        "name": "Dodd-Eaton E.B."
                    },
                    {
                        "name": "Peng G."
                    },
                    {
                        "name": "Bojadzieva J."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Amos C.I."
                    },
                    {
                        "name": "Frone M.N."
                    },
                    {
                        "name": "Khincha P.P."
                    },
                    {
                        "name": "Mai P.L."
                    },
                    {
                        "name": "Savage S.A."
                    },
                    {
                        "name": "Ballinger M.L."
                    },
                    {
                        "name": "Thomas D.M."
                    },
                    {
                        "name": "Yuan Y."
                    },
                    {
                        "name": "Strong L.C."
                    },
                    {
                        "name": "Wang W."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Cancer Research",
                "title": "Penetrance of different cancer types in families with Li-Fraumeni syndrome: A validation study using multicenter cohorts"
            },
            "pmcid": "PMC6980689",
            "pmid": "31719101"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}