{
    "additionDate": "2024-06-18T20:03:55.622249Z",
    "biotoolsCURIE": "biotools:ddk_linker",
    "biotoolsID": "ddk_linker",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lidong.bprc@foxmail.com",
            "name": "Dong Li",
            "orcidid": "https://orcid.org/0000-0002-8680-0468",
            "typeEntity": "Person"
        },
        {
            "email": "guoshz@bucm.edu.cn",
            "name": "Shuzhen Guo",
            "typeEntity": "Person"
        }
    ],
    "description": "A network-based strategy identifies disease signals by linking high-throughput omics datasets to disease knowledge.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://ddklinker.ncpsb.org.cn/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-06-18T20:03:55.624574Z",
    "name": "DDK-Linker",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bib/bbae111",
            "metadata": {
                "abstract": "The high-throughput genomic and proteomic scanning approaches allow investigators to measure the quantification of genome-wide genes (or gene products) for certain disease conditions, which plays an essential role in promoting the discovery of disease mechanisms. The high-throughput approaches often generate a large gene list of interest (GOIs), such as differentially expressed genes/proteins. However, researchers have to perform manual triage and validation to explore the most promising, biologically plausible linkages between the known disease genes and GOIs (disease signals) for further study. Here, to address this challenge, we proposed a network-based strategy DDK-Linker to facilitate the exploration of disease signals hidden in omics data by linking GOIs to disease knowns genes. Specifically, it reconstructed gene distances in the protein-protein interaction (PPI) network through six network methods (random walk with restart, Deepwalk, Node2Vec, LINE, HOPE, Laplacian) to discover disease signals in omics data that have shorter distances to disease genes. Furthermore, benefiting from the establishment of knowledge base we established, the abundant bioinformatics annotations were provided for each candidate disease signal. To assist in omics data interpretation and facilitate the usage, we have developed this strategy into an application that users can access through a website or download the R package. We believe DDK-Linker will accelerate the exploring of disease genes and drug targets in a variety of omics data, such as genomics, transcriptomics and proteomics data, and provide clues for complex disease mechanism and pharmacological research.",
                "authors": [
                    {
                        "name": "Diao L."
                    },
                    {
                        "name": "Guo S."
                    },
                    {
                        "name": "Jiang P."
                    },
                    {
                        "name": "Kong X."
                    },
                    {
                        "name": "Li D."
                    },
                    {
                        "name": "Nie S."
                    }
                ],
                "citationCount": 1,
                "date": "2024-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "DDK-Linker: a network-based strategy identifies disease signals by linking high-throughput omics datasets to disease knowledge"
            },
            "pmcid": "PMC10959161",
            "pmid": "38517698"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
