{
    "additionDate": "2017-02-10T11:35:43Z",
    "biotoolsCURIE": "biotools:sidirect",
    "biotoolsID": "sidirect",
    "credit": [
        {
            "email": "ktei@biochem.s.u-tokyo.ac.jp",
            "name": "K. Ui-Tei",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Server for computing small interfering RNA (siRNA) sequences which are best suited for mammalian RNA interference (RNAi).  The site accepts a sequence as input and returns a list of siRNA candidates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sidirect2.rnai.jp/doc/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "siRNA duplex prediction",
                    "uri": "http://edamontology.org/operation_2008"
                }
            ]
        }
    ],
    "homepage": "http://design.RNAi.jp/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "siDirect",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "In the present study, the relationship between short interfering RNA (siRNA) sequence and RNA interference (RNAi) effect was extensively analyzed using 62 targets of four exogenous and two endogenous genes and three mammalian and Drosophila cells. We present the rules that may govern siRNA sequence preference and in accordance with which highly effective siRNAs essential for systematic mammalian functional genomics can be readily designed. These rules indicate that siRNAs which simultaneously satisfy all four of the following sequence conditions are capable of inducing highly effective gene silencing in mammalian cells: (i) A/U at the 5′ end of the antisense strand; (ii) G/C at the 5′ end of the sense strand; (iii) at least five A/U residues in the 5′ terminal one-third of the antisense strand; and (iv) the absence of any GC stretch of more than 9 nt in length. siRNAs opposite in features with respect to the first three conditions give rise to little or no gene silencing in mammalian cells. Essentially the same rules for siRNA sequence preference were found applicable to DNA-based RNAi in mammalian cells and in ovo RNAi using chick embryos. In contrast to mammalian and chick cells, little siRNA sequence preference could be detected in Drosophila in vivo RNAi. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Ui-Tei K."
                    },
                    {
                        "name": "Naito Y."
                    },
                    {
                        "name": "Takahashi F."
                    },
                    {
                        "name": "Haraguchi T."
                    },
                    {
                        "name": "Ohki-Hamazaki H."
                    },
                    {
                        "name": "Juni A."
                    },
                    {
                        "name": "Ueda R."
                    },
                    {
                        "name": "Saigo K."
                    }
                ],
                "citationCount": 569,
                "date": "2004-07-14T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Guidelines for the selection of highly effective siRNA sequences for mammalian and chick RNA interference"
            },
            "pmid": "14769950"
        },
        {
            "metadata": {
                "abstract": "siDirect (http://design.RNAi.jp/) is a web-based online software system for computing highly effective small interfering RNA (siRNA) sequences with maximum target-specificity for mammalian RNA interference (RNAi). Highly effective siRNA sequences are selected using novel guidelines that were established through an extensive study of the relationship between siRNA sequences and RNAi activity. Our efficient software avoids off-target gene silencing to enumerate potential cross-hybridization candidates that the widely used BLAST search may overlook. The website accepts an arbitrary sequence as input and quickly returns siRNA candidates, providing a wide scope of applications in mammalian RNAi, including systematic functional genomics and therapeutic gene silencing. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Naito Y."
                    },
                    {
                        "name": "Yamada T."
                    },
                    {
                        "name": "Ui-Tei K."
                    },
                    {
                        "name": "Morishita S."
                    },
                    {
                        "name": "Saigo K."
                    }
                ],
                "citationCount": 210,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "siDirect: Highly effective, target-specific siRNA design software for mammalian RNA interference"
            },
            "pmid": "15215364"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}