
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://www.h-its.org/en/contact/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://pipsa.h-its.org/pipsa/pipsa-docu.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Shell",
            "Fortran"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Web application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Function analysis",
                "uri": "http://edamontology.org/topic_1775"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/pipsa-3-0-protein-interaction-property-similarity-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Protein electrostatics plays a key role in ligand binding and protein- protein interactions. Therefore, similarities or dissimilarities in electrostatic potentials can be used as indicators of similarities or dissimilarities in protein function. We here describe a method to compare the electrostatic properties within protein families objectively and quantitatively. Three-dimensional structures are built from database sequences by comparative modeling. Molecular potentials are then computed for these with a continuum solvation model by finite difference solution of the Poisson-Boltzmann equation or analytically as a multipole expansion that permits rapid comparison of very large datasets. This approach is applied to 104 members of the Pleckstrin homology (PH) domain family. The deviation of the potentials of the homology models from those of the corresponding experimental structures is comparable to the variation of the potential in an ensemble of structures from nuclear magnetic resonance data or between snapshots from a molecular dynamics simulation. For this dataset, the results for analysis of the full electrostatic potential and the analysis using only monopole and dipole terms are very similar. The electrostatic properties of the PH domains are generally conserved despite the extreme sequence divergence in this family. Notable exceptions from this conservation are seen for PH domains linked to a Dbl homology (DH) domain and in proteins with internal PH domain repeats.",
            "authors": [
                "Blomberg N.",
                "Gabdoulline R.R.",
                "Nilges M.",
                "Wade R.C."
            ],
            "cit_count": 83,
            "journal": "Proteins: Structure, Function and Genetics",
            "pmid": "10591098",
            "title": "Classification of protein sequences by homology modeling and quantitative analysis of electrostatic similarity",
            "year": "1999-11-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pipsa",
        "biotoolsID": "pipsa",
        "description": "Compute and analyze the pairwise similarity of 3D interaction property fields for a set of proteins.",
        "homepage": "http://pipsa.h-its.org/pipsa/",
        "name": "PIPSA"
    }
}