{
    "additionDate": "2021-01-18T11:16:10Z",
    "biotoolsCURIE": "biotools:mdeepred",
    "biotoolsID": "mdeepred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vatalay@metu.edu.tr",
            "name": "V Atalay",
            "typeEntity": "Person"
        }
    ],
    "description": "Novel Multi-Channel protein featurization for deep learning based binding affinity prediction in drug discovery.\n\nMDeePred: Multi-Channel Deep Chemogenomic Modeling of Receptor-Ligand Binding Affinity Prediction for Drug Discovery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cansyl/MDeePred",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-20T17:39:37Z",
    "license": "GPL-3.0",
    "name": "MDeePred",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA858",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Motivation: Identification of interactions between bioactive small molecules and target proteins is crucial for novel drug discovery, drug repurposing and uncovering off-target effects. Due to the tremendous size of the chemical space, experimental bioactivity screening efforts require the aid of computational approaches. Although deep learning models have been successful in predicting bioactive compounds, effective and comprehensive featurization of proteins, to be given as input to deep neural networks, remains a challenge. Results: Here, we present a novel protein featurization approach to be used in deep learning-based compound-target protein binding affinity prediction. In the proposed method, multiple types of protein features such as sequence, structural, evolutionary and physicochemical properties are incorporated within multiple 2D vectors, which is then fed to state-of-the-art pairwise input hybrid deep neural networks to predict the real-valued compound-target protein interactions. The method adopts the proteochemometric approach, where both the compound and target protein features are used at the input level to model their interaction. The whole system is called MDeePred and it is a new method to be used for the purposes of computational drug discovery and repositioning. We evaluated MDeePred on well-known benchmark datasets and compared its performance with the state-of-the-art methods. We also performed in vitro comparative analysis of MDeePred predictions with selected kinase inhibitors' action on cancer cells. MDeePred is a scalable method with sufficiently high predictive performance. The featurization approach proposed here can also be utilized for other protein-related predictive tasks. Availability and implementation: The source code, datasets, additional information and user instructions of MDeePred are available at https://github.com/cansyl/MDeePred.",
                "authors": [
                    {
                        "name": "Rifaioglu A.S."
                    },
                    {
                        "name": "Atalay R.C."
                    },
                    {
                        "name": "Kahraman D.C."
                    },
                    {
                        "name": "Dogan T."
                    },
                    {
                        "name": "Martin M."
                    },
                    {
                        "name": "Atalay V."
                    }
                ],
                "citationCount": 2,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MDeePred: Novel multi-channel protein featurization for deep learning-based binding affinity prediction in drug discovery"
            },
            "pmid": "33067636"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}