{
    "additionDate": "2022-10-19T19:15:59.286114Z",
    "biotoolsCURIE": "biotools:hnoxpred",
    "biotoolsID": "hnoxpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Aloysius Wong"
        },
        {
            "name": "Shiyu Jiang",
            "orcidid": "https://orcid.org/0000-0001-9450-7379"
        }
    ],
    "description": "A web tool for the prediction of gas sensing H-NOX proteins from amino acid sequence.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.hnoxpred.com",
    "lastUpdate": "2024-11-24T15:26:47.739437Z",
    "license": "Not licensed",
    "name": "HNOXPred",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btac571",
            "metadata": {
                "abstract": "Summary: HNOXPred is a webserver for the prediction of gas-sensing heme-nitric oxide/oxygen (H-NOX) proteins from amino acid sequence. H-NOX proteins are gas-sensing hemoproteins found in diverse organisms ranging from bacteria to eukaryotes. Recently, gas-sensing complex multi-functional proteins containing only the conserved amino acids at the heme centers of H-NOX proteins, have been identified through a motif-based approach. Based on experimental data and H-NOX candidates reported in the literature, HNOXPred is created to automate and facilitate the identification of similar H-NOX centers across systems. The server features HNOXSCORES scaled from 0 to 1 that consider in its calculation, the physicochemical properties of amino acids constituting the heme center in H-NOX in addition to the conserved amino acids within the center. From user input amino acid sequence, the server returns positive hits and their calculated HNOXSCORES ordered from high to low confidence which are accompanied by interpretation guides and recommendations. The utility of this server is demonstrated using the human proteome as an example.",
                "authors": [
                    {
                        "name": "Abdalla H.B."
                    },
                    {
                        "name": "Bi C."
                    },
                    {
                        "name": "Jiang S."
                    },
                    {
                        "name": "Tian X."
                    },
                    {
                        "name": "Wong A."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Zhu Y."
                    }
                ],
                "citationCount": 1,
                "date": "2022-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "HNOXPred: a web tool for the prediction of gas-sensing H-NOX proteins from amino acid sequence"
            },
            "pmid": "35993887"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
