{"credit":[{"name":"binf.ku.dk","typeEntity":"Institute","typeRoles":["Provider"]},{"email":"wb@bio.ku.dk","name":"Wouter Boomsma","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://people.binf.ku.dk/wb/"}],"documentation":[{"type":"GENERAL","url":"http://www.phaistos.org/home/Documentation"}],"function":[{"operation":[{"term":"Modelling and simulation","uri":"http://edamontology.org/operation_2426"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Workbench"],"topic":[{"term":"Structure analysis","uri":"http://edamontology.org/topic_0081"}]},"publication":[{"abstract":"We present a new software framework for Markov chain Monte Carlo sampling for simulation, prediction, and inference of protein structure. The software package contains implementations of recent advances in Monte Carlo methodology, such as efficient local updates and sampling from probabilistic models of local protein structure. These models form a probabilistic alternative to the widely used fragment and rotamer libraries. Combined with an easily extendible software architecture, this makes PHAISTOS well suited for Bayesian inference of protein structure from sequence and/or experimental data. Currently, two force-fields are available within the framework: PROFASI and OPLS-AA/L, the latter including the generalized Born surface area solvent model. A flexible command-line and configuration-file interface allows users quickly to set up simulations with the desired configuration. PHAISTOS is released under the GNU General Public License v3.0. Source code and documentation are freely available from http://phaistos.sourceforge.net. The software is implemented in C++ and has been tested on Linux and OSX platforms. © 2013 Wiley Periodicals, Inc.","authors":["Boomsma W.","Frellsen J.","Harder T.","Bottaro S.","Johansson K.E.","Tian P.","Stovgaard K.","Andreetta C.","Olsson S.","Valentin J.B.","Antonov L.D.","Christensen A.S.","Borg M.","Jensen J.H.","Lindorff-Larsen K.","Ferkinghoff-Borg J.","Hamelryck T."],"cit_count":25,"doi":"10.1002/jcc.23292","journal":"Journal of Computational Chemistry","title":"PHAISTOS: A framework for Markov chain Monte Carlo simulation and inference of protein structure","type":"Primary","year":"2013-07-15"}],"summary":{"biotoolsCURIE":"biotools:phaistos","biotoolsID":"phaistos","description":"A framework for all-atom Monte Carlo simulations of proteins. It incorporates several advanced probabilistic models of protein structure for conformational sampling, efficient move-algorithms and the OPLS and PROFASI forcefields.","homepage":"http://www.phaistos.org/","name":"Phaistos","version":["1.0"]}}