{
    "additionDate": "2024-01-10T10:43:17.111135Z",
    "biotoolsCURIE": "biotools:cancer_infocus",
    "biotoolsID": "cancer_infocus",
    "confidence_flag": "high",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "tburus@uky.edu",
            "name": "Justin Todd Burus",
            "orcidid": "https://orcid.org/0000-0001-6819-1788",
            "typeEntity": "Person"
        }
    ],
    "description": "Tools for cancer center catchment area geographic data collection and visualization.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://cancerinfocus.uky.edu/",
    "lastUpdate": "2024-01-10T10:43:17.113662Z",
    "name": "Cancer InFocus",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1158/1055-9965.EPI-22-1319",
            "metadata": {
                "abstract": "Background: The NCI added Community Outreach and Engagement (COE) requirements for NCI-designated cancer centers in 2017, including the charge of characterizing the cancer burden in the geographic area served by their center (i.e., catchment area). Doing so helps cancer centers better identify needs and areas of inequality in their populations to guide research and outreach. To accomplish this, current and comprehensive data must be gathered from multiple sources and analyzed by the COE—a task that is tedious and inefficient. In this paper we present an efficient solution, known as Cancer InFocus, to collecting and visualizing quantitative data that we have generalized for use by other cancer centers on their catchment areas. Methods: Cancer InFocus utilizes open source programming languages and modern data collection techniques to gather and transform publicly-available data from various sources for use in specific geographic contexts. Results: Cancer InFocus delivers a choice of two routes for creating interactive online mapping applications that visualize cancer incidence and mortality rates, along with relevant social determinant and risk factor variables, at various geographic levels for a defined cancer center catchment area. Conclusions: Generalized software has been produced to collect and visualize data on any set of U.S. counties, which can be automated to continue providing the most up-to-date data. Impact: Cancer InFocus provides tools for cancer centers to accomplish the critical task of maintaining current and comprehensive catchment area data. The open source format will facilitate future enhancements through user collaboration.",
                "authors": [
                    {
                        "name": "Burus J.T."
                    },
                    {
                        "name": "Hull P.C."
                    },
                    {
                        "name": "McAfee C.R."
                    },
                    {
                        "name": "Park L."
                    },
                    {
                        "name": "Wilhite N.P."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "Cancer Epidemiology Biomarkers and Prevention",
                "title": "Cancer InFocus: Tools for Cancer Center Catchment Area Geographic Data Collection and Visualization"
            },
            "pmcid": "PMC10320460",
            "pmid": "37222667"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
