{
    "additionDate": "2022-12-19T09:44:11.605125Z",
    "biotoolsCURIE": "biotools:abcpe",
    "biotoolsID": "abcpe",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "urmila.kulkarni.kale@gmail.com",
            "name": "Urmila Kulkarni-Kale",
            "typeEntity": "Person"
        },
        {
            "email": "valadi@gmail.com",
            "name": "Jayaraman Valadi",
            "typeEntity": "Person"
        }
    ],
    "description": "AbCPE web server implements a multi-label classification algorithm that predicts antibody class(es) for epitopes. This data driven machine learning based algorithm offers prediction of epitopes potentially recognised by an individual or multiple classes of antibodies viz. IgG, IgE, IgA and IgM (excluding IgD).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.unipune.ac.in/AbCPE/Home.html",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:17:30.999854Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bioinfo.unipune.ac.in/AbCPE/Dataset.html"
        }
    ],
    "name": "AbCPE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/fbinf.2021.709951",
            "metadata": {
                "abstract": "Development of vaccines and therapeutic antibodies to deal with infectious and other diseases are the most perceptible scientific interventions that have had huge impact on public health including that in the current Covid-19 pandemic. From inactivation methodologies to reverse vaccinology, vaccine development strategies of 21st century have undergone several transformations and are moving towards rational design approaches. These developments are driven by data as the combinatorials involved in antigenic diversity of pathogens and immune repertoire of hosts are enormous. The computational prediction of epitopes is central to these developments and numerous B-cell epitope prediction methods developed over the years in the field of immunoinformatics have contributed enormously. Most of these methods predict epitopes that could potentially bind to an antibody regardless of its type and only a few account for antibody class specific epitope prediction. Recent studies have provided evidence of more than one class of antibodies being associated with a particular disease. Therefore, it is desirable to predict and prioritize ‘peptidome’ representing B-cell epitopes that can potentially bind to multiple classes of antibodies, as an open problem in immunoinformatics. To address this, AbCPE, a novel algorithm based on multi-label classification approach has been developed for prediction of antibody class(es) to which an epitope can potentially bind. The epitopes binding to one or more antibody classes (IgG, IgE, IgA and IgM) have been used as a knowledgebase to derive features for prediction. Multi-label algorithms, Binary Relevance and Label Powerset were applied along with Random Forest and AdaBoost. Classifier performance was assessed using evaluation measures like Hamming Loss, Precision, Recall and F1 score. The Binary Relevance model based on dipeptide composition, Random Forest and AdaBoost achieved the best results with Hamming Loss of 0.1121 and 0.1074 on training and test sets respectively. The results obtained by AbCPE are promising. To the best of our knowledge, this is the first multi-label method developed for prediction of antibody class(es) for sequential B-cell epitopes and is expected to bring a paradigm shift in the field of immunoinformatics and immunotherapeutic developments in synthetic biology. The AbCPE web server is available at http://bioinfo.unipune.ac.in/AbCPE/Home.html.",
                "authors": [
                    {
                        "name": "Kadam K."
                    },
                    {
                        "name": "Karbhal R."
                    },
                    {
                        "name": "Kulkarni-Kale U."
                    },
                    {
                        "name": "Peerzada N."
                    },
                    {
                        "name": "Sawant S."
                    },
                    {
                        "name": "Valadi J."
                    }
                ],
                "citationCount": 6,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "Antibody Class(es) Predictor for Epitopes (AbCPE): A Multi-Label Classification Algorithm"
            },
            "pmcid": "PMC9581038",
            "pmid": "36303781"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Immunoinformatics",
            "uri": "http://edamontology.org/topic_3948"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Vaccinology",
            "uri": "http://edamontology.org/topic_3966"
        }
    ],
    "validated": 1
}
