{
    "additionDate": "2020-01-14T19:54:35Z",
    "biotoolsCURIE": "biotools:IntMTQ",
    "biotoolsID": "IntMTQ",
    "confidence_flag": "tool",
    "description": "Platform-integrated mRNA Isoform Quantification.\n\nIntegrated model for RNA-Seq based transcript quantification.\n\nIntMTQ is an integrative method combining isoform expressions from NanoString/Exon-array platforms to provide better quantification of RNA-Seq based transcript abundances.\n\nWe provide the source code of paper Platform-integrated mRNA Isoform Quantification for bioinformatics submission",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CompbioLabUcf/IntMTQ",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:55:18.509960Z",
    "license": "Apache-2.0",
    "name": "IntMTQ",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz932",
            "metadata": {
                "abstract": "Motivation: Accurate estimation of transcript isoform abundance is critical for downstream transcriptome analyses and can lead to precise molecular mechanisms for understanding complex human diseases, like cancer. Simplex mRNA Sequencing (RNA-Seq) based isoform quantification approaches are facing the challenges of inherent sampling bias and unidentifiable read origins. A large-scale experiment shows that the consistency between RNA-Seq and other mRNA quantification platforms is relatively low at the isoform level compared to the gene level. In this project, we developed a platform-integrated model for transcript quantification (IntMTQ) to improve the performance of RNA-Seq on isoform expression estimation. IntMTQ, which benefits from the mRNA expressions reported by the other platforms, provides more precise RNA-Seq-based isoform quantification and leads to more accurate molecular signatures for disease phenotype prediction. Results: In the experiments to assess the quality of isoform expression estimated by IntMTQ, we designed three tasks for clustering and classification of 46 cancer cell lines with four different mRNA quantification platforms, including newly developed NanoString s nCounter technology. The results demonstrate that the isoform expressions learned by IntMTQ consistently provide more and better molecular features for downstream analyses compared with five baseline algorithms which consider RNA-Seq data only. An independent RT-qPCR experiment on seven genes in twelve cancer cell lines showed that the IntMTQ improved overall transcript quantification. The platform-integrated algorithms could be applied to large-scale cancer studies, such as The Cancer Genome Atlas (TCGA), with both RNA-Seq and array-based platforms available.",
                "authors": [
                    {
                        "name": "Chang J.-W."
                    },
                    {
                        "name": "Kuang R."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Yong J."
                    },
                    {
                        "name": "Zhang T."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 3,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Platform-integrated mRNA isoform quantification"
            },
            "pmcid": "PMC7178424",
            "pmid": "31834359"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
