{
    "additionDate": "2017-03-27T12:32:23Z",
    "biotoolsCURIE": "biotools:matrixdb",
    "biotoolsID": "matrixdb",
    "collectionID": [
        "elixir-fr-sdp-2019"
    ],
    "credit": [
        {
            "email": "sylvie.ricard-blum@univ-lyon1.fr",
            "name": "MatrixDB Support",
            "note": "Professor at University Lyon 1, head of a team working on structure-interaction-function relationships of the extracellular matrix and extracellular matrix interaction networks.",
            "orcidid": "https://orcid.org/0000-0001-9263-1851",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "It is a database focused on interactions established by extracellular proteins and polysaccharides. It takes into account the multimeric nature of several extracellular protein families for the curation of interactions, and reports interactions with individual polypeptide chains or with multimers, considered as permanent complexes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://matrixdb.univ-lyon1.fr/"
        }
    ],
    "editPermission": {
        "authors": [
            "ricardblum"
        ],
        "type": "group"
    },
    "elixirNode": [
        "France"
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Protein interaction network analysis",
                    "uri": "http://edamontology.org/operation_0276"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://matrixdb.univ-lyon1.fr/",
    "lastUpdate": "2021-04-22T05:48:22Z",
    "name": "MatrixDB",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_001727"
        }
    ],
    "owner": "ricardblum",
    "publication": [
        {
            "doi": "10.1093/nar/gku1091",
            "metadata": {
                "abstract": "© The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.MatrixDB (http://matrixdb.ibcp.fr) is a freely available database focused on interactions established by extracellular proteins and polysaccharides. It is an active member of the International Molecular Exchange (IMEx) consortium and has adopted the PSIMI standards for annotating and exchanging interaction data, either at the MIMIx or IMEx level. MatrixDB content has been updated by curation and by importing extracellular interaction data fromother IMEx databases. Othermajor changes include the creation of a new website and the development of a novel graphical navigator, iNavigator, to build and expand interaction networks. Filters may be applied to build sub-networks based on a list of biomolecules, a specified interaction detection method and/or an expression level by tissue, developmental stage, and health state (UniGene data). Any molecule of the network may be selected and its partners added to the network at any time. Networks may be exported under Cytoscape and tabular formats and as images, and may be saved for subsequent re-use.",
                "authors": [
                    {
                        "name": "Launay G."
                    },
                    {
                        "name": "Multedo D."
                    },
                    {
                        "name": "Ricard-Blum S."
                    },
                    {
                        "name": "Salza R."
                    },
                    {
                        "name": "Thierry-Mieg N."
                    }
                ],
                "citationCount": 75,
                "date": "2015-01-28T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MatrixDB, the extracellular matrix interaction database: Updated content, a new navigator and expanded functionalities"
            },
            "note": "The publication reports the update of MattrixDB content, the design of a new navigator and expanded functionalities.",
            "pmcid": "PMC4383919",
            "pmid": "25378329",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/nar/gky1035",
            "metadata": {
                "abstract": "© The Author(s) 2018. Published by Oxford University Press on behalf of Nucleic Acids Research.MatrixDB (http://matrixdb.univ-lyon1.fr/) is an interaction database focused on biomolecular interactions established by extracellular matrix (ECM) proteins and glycosaminoglycans (GAGs). It is an active member of the International Molecular Exchange (IMEx) consortium (https://www.imexconsortium.org/). It has adopted the HUPO Proteomics Standards Initiative standards for annotating and exchanging interaction data, either at the MIMIx (The Minimum Information about a Molecular Interaction eXperiment) or IMEx level. The following items related to GAGs have been added in the updated version of MatrixDB: (i) cross-references of GAG sequences to the GlyTouCan database, (ii) representation of GAG sequences in different formats (IUPAC and GlycoCT) and as SNFG (Symbol Nomenclature For Glycans) images and (iii) the GAG Builder online tool to build 3D models of GAG sequences from GlycoCT codes. The database schema has been improved to represent n-Ary experiments. Gene expression data, imported from Expression Atlas (https://www.ebi.ac.uk/gxa/home), quantitative ECM proteomic datasets (http://matrisomeproject.mit.edu/ecm-Atlas), and a new visualization tool of the 3D structures of biomolecules, based on the PDB Component Library and LiteMol, have also been added. A new advanced query interface now allows users to mine MatrixDB data using combinations of criteria, in order to build specific interaction networks related to diseases, biological processes, molecular functions or publications.",
                "authors": [
                    {
                        "name": "Clerc O."
                    },
                    {
                        "name": "Deniaud M."
                    },
                    {
                        "name": "Naba A."
                    },
                    {
                        "name": "Perez S."
                    },
                    {
                        "name": "Ricard-Blum S."
                    },
                    {
                        "name": "Rivet A."
                    },
                    {
                        "name": "Thierry-Mieg N."
                    },
                    {
                        "name": "Vallet S.D."
                    }
                ],
                "citationCount": 34,
                "date": "2019-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "MatrixDB: Integration of new data with a focus on glycosaminoglycan interactions"
            },
            "note": "The publication reports the update of MatrixDB content and the development of new functionalities focused on glycosaminoglycans (GAGs) (cross-references of GAG sequences to the GlyTouCan database, representation of GAG sequences in IUPAC, GlycoCT and SNFG formats and the GAG Builder online tool to build 3D models of GAG sequences from GlycoCT codes). The database schema has been improved to represent n-ary experiments. Gene expression data, imported from Expression Atlas, quantitative ECM proteomic datasets and a new visualization tool of the 3D structures of biomolecules have been added.",
            "pmcid": "PMC6324007",
            "pmid": "30371822",
            "type": [
                "Other"
            ]
        },
        {
            "note": "The first full description of  MatrixDB as a member of the International Molecular Exchange consortium (IMEx), which has  adopted the PSI-MI standards for the curation and the exchange of interaction data.",
            "pmid": "20852260"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}
