{
    "additionDate": "2017-08-03T18:44:03Z",
    "biotoolsCURIE": "biotools:gdhc",
    "biotoolsID": "gdhc",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://web1.sph.emory.edu/users/tyu8/"
        }
    ],
    "description": "Method of hierarchical clustering for high throughput data. Nonlinear relations exist between features of high-throughput data. They reflect critical regulation patterns in the biological system. Clustering based on both linear and nonlinear relations in high throughput data is hampered by the high dimensionality and high noise level in the data.",
    "documentation": [
        {
            "type": "General",
            "url": "http://web1.sph.emory.edu/users/tyu8/GDHC/GDHC.R"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Functional clustering",
                    "uri": "http://edamontology.org/operation_3459"
                }
            ]
        }
    ],
    "homepage": "http://web1.sph.emory.edu/users/tyu8/GDHC/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gdhc-nonlinear-hierarchical-clustering.html"
        }
    ],
    "name": "GDHC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "High-throughput expression technologies, including gene expression array and liquid chromatography-mass spectrometry (LC-MS) and so on, measure thousands of features, i.e., genes or metabolites, on a continuous scale. In such data, both linear and nonlinear relations exist between features. Nonlinear relations can reflect critical regulation patterns in the biological system. However, they are not identified and utilized by traditional clustering methods based on linear associations. Clustering based on general dependences, i.e., both linear and nonlinear relations, is hampered by the high dimensionality and high noise level of the data. We developed a sensitive nonparametric measure of general dependence between (groups of) random variables in high dimensions. Based on this dependence measure, we developed a hierarchical clustering method. In simulation studies, the method outperformed correlation-and mutual information (MI)-based hierarchical clustering methods in clustering features with nonlinear dependences. We applied the method to a microarray data set measuring the gene expression in cell-cycle time series to show it generates biologically relevant results. The R code is available at http://userwww.service.emory.edu/~tyu8/GDHC. © 2013 IEEE.",
                "authors": [
                    {
                        "name": "Yu T."
                    },
                    {
                        "name": "Peng H."
                    }
                ],
                "citationCount": 9,
                "date": "2013-07-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Hierarchical clustering of high-throughput expression data based on general dependences"
            },
            "pmid": "24334400"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}