
{
    "credit": [
        {
            "email": "ys5978@rit.edu",
            "name": "Yashar Seyed Vahedein",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/YasharVahedein/CardioFAN/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/YasharVahedein/CardioFAN/releases"
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "MATLAB"
        ],
        "license": "MIT",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Workflow"
        ],
        "topic": [
            {
                "term": "MRI",
                "uri": "http://edamontology.org/topic_3444"
            },
            {
                "term": "Biomarkers",
                "uri": "http://edamontology.org/topic_3360"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, Springer-Verlag GmbH Germany, part of Springer Nature.A profound analysis of pressure and flow wave propagation in cardiovascular systems is the key in noninvasive assessment of hemodynamic parameters. Pulse transit time (PTT), which closely relates to the physical properties of the cardiovascular system, can be linked to variations of blood pressure and stroke volume to provide information for patient-specific clinical diagnostics. In this work, we present mathematical and numerical tools, capable of accurately predicting the PTT, local pulse wave velocity, vessel compliance, and pressure/flow waveforms, in a viscous hyperelastic cardiovascular network. A new one-dimensional framework, entitled cardiovascular flow analysis (CardioFAN), is presented to describe the pulsatile fluid–structure interaction in the hyperelastic arteries, where pertaining hyperbolic equations are solved using a high-resolution total variation diminishing Lax–Wendroff method. The computational algorithm is validated against well-known numerical, in vitro and in vivo data for networks of main human arteries with 55, 37 and 26 segments, respectively. PTT prediction is improved by accounting for hyperelastic nonlinear waves between two arbitrary sections of the arterial tree. Consequently, arterial compliance assignments at each segment are improved in a personalized model of the human aorta and supra-aortic branches with 26 segments, where prior in vivo data were available for comparison. This resulted in a 1.5% improvement in overall predictions of the waveforms, or average relative errors of 5.5% in predicting flow, luminal area and pressure waveforms compared to prior in vivo measurements. The open source software, CardioFAN, can be calibrated for arbitrary patient-specific vascular networks to conduct noninvasive diagnostics.",
            "authors": [
                "Seyed Vahedein Y.",
                "Liberson A.S."
            ],
            "cit_count": 0,
            "doi": "10.1007/S10237-019-01163-Z",
            "journal": "Biomechanics and Modeling in Mechanobiology",
            "pmid": "31076923",
            "title": "CardioFAN: open source platform for noninvasive assessment of pulse transit time and pulsatile flow in hyperelastic vascular networks",
            "type": "Primary",
            "year": "2019-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:CardioFAN",
        "biotoolsID": "CardioFAN",
        "description": "Platform for noninvasive assessment of pulse transit time and pulsatile flow in hyperelastic vascular networks.",
        "homepage": "https://github.com/YasharVahedein/CardioFAN",
        "name": "CardioFAN"
    }
}