{
    "additionDate": "2020-01-14T09:48:58Z",
    "biotoolsCURIE": "biotools:pymolshortcuts",
    "biotoolsID": "pymolshortcuts",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "blaine-mooers@ouhsc.edu",
            "name": "Blaine H. M. Mooers",
            "orcidid": "https://orcid.org/0000-0001-8181-8987",
            "typeEntity": "Person"
        }
    ],
    "description": "Shortcuts for faster image creation in PyMOL.\n\nThe repository pymolschortucts contains a collection of shortcuts that are loaded on startup of PyMOL. These shortcuts enable web searches from within PyMOL as well as many other convenient functions that make work in PyMOL more productive.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/MooersLab/pymolshortcuts",
    "language": [
        "PyMOL",
        "Python"
    ],
    "lastUpdate": "2021-01-13T18:20:29Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MooersLab/PyMOLshortcuts"
        }
    ],
    "name": "PyMOL",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1002/PRO.3781",
            "metadata": {
                "abstract": "© 2019 The Protein SocietyPyMOL is often used to generate images of biomolecular structures. Hundreds of parameters in PyMOL provide precise control over the appearance of structures. We developed 241 Python functions—called “shortcuts”—that extend and ease the use of PyMOL. A user runs a shortcut by entering its name at the PyMOL prompt. We clustered the shortcuts by functionality into 25 groups for faster look-up. One set of shortcuts generates new styles of molecular representation. Another group saves files with time stamps in the file names; the unique filenames avoid overwriting files that have already been developed. A third group submits search terms in the user's web browser. The help function prints the function's documentation to the command history window. This documentation includes the PyMOL commands that the user can reuse by copying and pasting onto the command line or into a script file. The shortcuts should save the average PyMOL user many hours per year searching for code fragments in their computer or on-line. Statement for Lay Public: Computer-generated images of protein structures are vital to the interpretation of and communication about the molecular structure of proteins. PyMOL is a popular computer program for generating such images. We made a large collection of macros or shortcuts that save time by executing complex operations with a few keystrokes.",
                "authors": [
                    {
                        "name": "Mooers B.H.M."
                    }
                ],
                "citationCount": 9,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Shortcuts for faster image creation in PyMOL"
            },
            "pmcid": "PMC6933860",
            "pmid": "31710740"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        }
    ],
    "validated": 1
}