{
    "additionDate": "2020-01-09T17:42:15Z",
    "biotoolsCURIE": "biotools:batcave",
    "biotoolsID": "batcave",
    "confidence_flag": "tool",
    "description": "Calling somatic mutations with a tumor- and site-specific prior.\n\nImplements BATCAVE: Bayesian Analysis Tools for Context-Aware Variant Evaluation.\n\nThis package is an implementation of the BATCAVE algorithm described in Mannakee et al. .... The algorithm is a post-variant-calling filter for variants that incorporates a tumor-and-site-specific prior probability of mutation",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                }
            ]
        }
    ],
    "homepage": "http://github.com/bmannakee/batcaver",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:56:52.505738Z",
    "name": "BATCAVE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/nargab/lqaa004",
            "metadata": {
                "abstract": "Detecting somatic mutations withins tumors is key to understanding treatment resistance, patient prognosis and tumor evolution. Mutations at low allelic frequency, those present in only a small portion of tumor cells, are particularly difficult to detect. Many algorithms have been developed to detect such mutations, but none models a key aspect of tumor biology. Namely, every tumor has its own profile of mutation types that it tends to generate. We present BATCAVE (Bayesian Analysis Tools for Context-Aware Variant Evaluation), an algorithm that first learns the individual tumor mutational profile and mutation rate then uses them in a prior for evaluating potential mutations. We also present an R implementation of the algorithm, built on the popular caller MuTect. Using simulations, we show that adding the BATCAVE algorithm to MuTect improves variant detection. It also improves the calibration of posterior probabilities, enabling more principled tradeoff between precision and recall. We also show that BATCAVE performs well on real data. Our implementation is computationally inexpensive and straightforward to incorporate into existing MuTect pipelines. More broadly, the algorithm can be added to other variant callers, and it can be extended to include additional biological features that affect mutation generation.",
                "authors": [
                    {
                        "name": "Gutenkunst R.N."
                    },
                    {
                        "name": "Mannakee B.K."
                    }
                ],
                "citationCount": 1,
                "date": "2020-03-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "BATCAVE: calling somatic mutations with a tumor- And site-specific prior"
            },
            "pmcid": "PMC7003682",
            "pmid": "32051931"
        }
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
