{
    "additionDate": "2019-11-14T19:45:06Z",
    "biotoolsCURIE": "biotools:QEVO",
    "biotoolsID": "QEVO",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "karl-michael.schebesch@ukr.de",
            "name": "Karl-Michael Schebesch",
            "typeEntity": "Person"
        }
    ],
    "description": "> HOMEPAGE MISSING! | A cadaveric study and first clinical experiences (case series) | Background:The use of endoscopes in neurosurgery is well established, but the integration of a full high definition signaling, 45° angled endoscopic tool into a digital surgical microscope, is new. We report our first experiences in a cadaveric study and a clinical case series using the new microinspection tool QEVO® that serves as a plug-in feature for the recently launched KINEVO 900 digital visualization platform (CARL ZEISS MEDITEC, Oberkochen, Germany). For illustration purposes, we offer video footage. Methods:The handling, workflow, and visualization patterns of the QEVO® microinspection tool were critically evaluated in cadaver specimens by simulating four standardized neurosurgical approaches: (1) pterional, (2) retrosigmoidal, (3) transsphenoidal, (4) and transcallosal",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31528384",
    "lastUpdate": "2019-11-14T19:45:06Z",
    "name": "QEVO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.25259/SNI-45-2019",
            "metadata": {
                "abstract": "© 2019 Published by Scientific Scholar on behalf of Surgical Neurology InternationalBackground: e use of endoscopes in neurosurgery is well established, but the integration of a full high definition signaling, 45° angled endoscopic tool into a digital surgical microscope, is new. We report our first experiences in a cadaveric study and a clinical case series using the new microinspection tool QEVO that serves as a plug-in feature for the recently launched KINEVO 900 digital visualization platform (CARL ZEISS MEDITEC, Oberkochen, Germany). For illustration purposes, we offer video footage. Methods: e handling, workflow, and visualization patterns of the QEVO microinspection tool were critically evaluated in cadaver specimens by simulating four standardized neurosurgical approaches: (1) pterional, (2) retrosigmoidal, (3) transsphenoidal, (4) and transcallosal. Similarly, we evaluated the QEVO tool in corresponding clinical cases of (1) aneurysm clipping, (2) removal of cerebellar cavernoma, (3) and pituitary adenomectomy. Results: In both the cadaveric study and clinical case series, the QEVO tool was found to be beneficial in terms of high-quality visualization of fine structures and for displaying hidden anatomical details (“looking around the corner”). The handling was good, and the workflow was easy. However, the use of this tool was restricted by the lack of an external fixation and a working channel, the shortness of the tool, and the impossibility to switch to a 0° or 30° optic. Conclusion: Despite some restrictions, the QEVO microinspection tool is an innovative, handheld, endoscopic tool that allows excellent additional visualization of the surgical field. In our opinion, this tool effectively enhances the modern neurosurgical armamentarium.",
                "authors": [
                    {
                        "name": "Schebesch K.-M."
                    },
                    {
                        "name": "Brawanski A."
                    },
                    {
                        "name": "Tamm E.R."
                    },
                    {
                        "name": "Kuhnel T.S."
                    },
                    {
                        "name": "Hohne J."
                    }
                ],
                "date": "2019-03-26T00:00:00Z",
                "journal": "Surgical Neurology International",
                "title": "QEVO - A new digital endoscopic microinspection tool - A cadaveric study and first clinical experiences (case series)"
            },
            "pmcid": "PMC6743702",
            "pmid": "31528384"
        }
    ],
    "topic": [
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ]
}