{"credit":[],"function":[{"operation":[{"term":"Differential gene expression analysis","uri":"http://edamontology.org/operation_3223"},{"term":"Query and retrieval","uri":"http://edamontology.org/operation_0224"},{"term":"Expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"topic":[{"term":"Transcription factors and regulatory sites","uri":"http://edamontology.org/topic_0749"},{"term":"Protein interaction experiment","uri":"http://edamontology.org/topic_3557"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Surgery","uri":"http://edamontology.org/topic_3421"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"publication":[{"abstract":"© 2019 The Authors. Cell Proliferation Published by John Wiley & Sons Ltd.Objectives: The osteogenesis differentiation of human bone marrow stem cells (BMSCs) is essential for bone formation and bone homeostasis. In this study, we aim to elucidate novel molecular targets for bone metabolism diseases. Materials and methods: The dataset GSE80614 which includes mRNA expression profile during BMSCs osteogenic differentiation was obtained from the GEO database (https://www.ncbi.nlm.nih.gov/geo/). The osteogenic differentiation of BMSCs was measured by ALP staining, AR staining and expression of osteogenic markers in vitro. For in vivo assay, we seeded BMSCs onto beta-tricalcium phosphate (β-TCP) and transplanted them into muscle pockets of nude mice. Luciferase assay, co-immunoprecipitation assay and in vitro ubiquitination assay were carried out to investigate the molecular mechanism. Results: We found that α-B-crystallin (CRYAB) expression was elevated during the process of BMSCs osteogenic differentiation. Further studies showed that upregulation of CRYAB significantly enhanced the osteogenic differentiation, while downregulation of CRYAB suppressed it. CRYAB regulated BMSCs osteogenic differentiation mainly through the canonical Wnt/β-catenin signalling. In addition, we found that CRYAB could physically interact with β-catenin and protect it from ubiquitination and degradation, which stabilized β-catenin and promoted the Wnt signalling. Conclusions: The present study provides evidences that CRYAB is an important regulator of BMSCs osteogenic differentiation by protecting β-catenin from ubiquitination and degradation and promoting the Wnt signalling. It may serve as a potential therapeutic target for diseases related to bone metabolism.","authors":["Zhu B.","Xue F.","Li G.","Zhang C."],"cit_count":0,"doi":"10.1111/CPR.12709","journal":"Cell Proliferation","pmid":"31638302","title":"CRYAB promotes osteogenic differentiation of human bone marrow stem cells via stabilizing β-catenin and promoting the Wnt signalling","year":"2019-01-01"}],"summary":{"biotoolsCURIE":"biotools:GSE80614","biotoolsID":"GSE80614","description":"CRYAB promotes osteogenic differentiation of human bone marrow stem cells via stabilizing β-catenin and promoting the Wnt signalling.\n\nNCBI's Gene Expression Omnibus (GEO) is a public archive and resource for gene expression data.\n\nGEO help: Mouse over screen elements for information.\n\nScope: Self Platform Samples Series Family Format: HTML SOFT MINiML Amount: Brief Quick GEO accession:.\n\n||| NAME (GSE80614) SIMILAR TO (PUB. DIFFERENT) bio.tools/GSE33335 (GSE33335), bio.tools/GSE56348 (GSE56348), bio.tools/GSE117578 (GSE117578), bio.tools/gse (GSE).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'GEO' (bio.tools/GEO), 'BMSCs osteogenic', 'BMSCs osteogenic differentiation', 'BMSCs'","homepage":"https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE80614.66","name":"GSE80614"}}