{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:16:52Z",
    "biotoolsCURIE": "biotools:PATHcrosstalk",
    "biotoolsID": "PATHcrosstalk",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yuzhangsheng@sjtu.edu.cn",
            "name": "Zhangsheng Yu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "faber@sjtu.edu.cn",
            "name": "Botao Fa",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for crosstalk correction in Pathway Deregulation Score (PDS) inferred by Pathifier algorithm.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fabotao/PATHcrosstalk",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "LGPL-3.0",
    "maturity": "Mature",
    "name": "PATHcrosstalk",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1016/J.EBIOM.2019.05.010",
            "metadata": {
                "abstract": "© 2019 The AuthorsBackground: Although many prognostic single-gene (SG) lists have been identified in cancer research, application of these features is hampered due to poor robustness and performance on independent datasets. Pathway-based approaches have thus emerged which embed biological knowledge to yield reproducible features. Methods: Pathifier estimates pathways deregulation score (PDS) to represent the extent of pathway deregulation based on expression data, and most of its applications treat pathways as independent without addressing the effect of gene overlap between pathway pairs which we refer to as crosstalk. Here, we propose a novel procedure based on Pathifier methodology, which for the first time has been utilized with crosstalk accommodated to identify disease-specific features to predict prognosis in patients with hepatocellular carcinoma (HCC). Findings: With the cohort (N = 355) of HCC patients from The Cancer Genome Atlas (TCGA), cross validation (CV) revealed that PDSs identified were more robust and accurate than the SG features by deep learning (DL)-based approach. When validated on external HCC datasets, these features outperformed the SGs consistently. Interpretation: On average, we provide 10.2% improvement of prediction accuracy. Importantly, governing genes in these features provide valuable insight into the cancer hallmarks of HCC. We develop an R package PATHcrosstalk (available from GitHub https://github.com/fabotao/PATHcrosstalk) with which users can discover pathways of interest with crosstalk effect considered.",
                "authors": [
                    {
                        "name": "Fa B."
                    },
                    {
                        "name": "Luo C."
                    },
                    {
                        "name": "Tang Z."
                    },
                    {
                        "name": "Yan Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Yu Z."
                    }
                ],
                "citationCount": 2,
                "date": "2019-06-01T00:00:00Z",
                "journal": "EBioMedicine",
                "title": "Pathway-based biomarker identification with crosstalk analysis for robust prognosis prediction in hepatocellular carcinoma"
            },
            "pmcid": "PMC6606892",
            "pmid": "31101593",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}