{
    "additionDate": "2021-01-18T10:59:59Z",
    "biotoolsCURIE": "biotools:z-tree-unleashed",
    "biotoolsID": "z-tree-unleashed",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Max R.P. Grossmann",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel client-integrating architecture for conducting z-Tree experiments over the Internet.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://cler1.gitlab.io/ztree-unleashed-doc/docs/home/",
    "lastUpdate": "2021-03-18T14:24:00Z",
    "name": "z-Tree unleashed",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1016/J.JBEF.2020.100400",
            "metadata": {
                "abstract": "© 2020 Elsevier B.V.We present z-Tree unleashed, a novel approach and set of scripts to aid the implementation of computerized behavioral experiments outside the laboratory. z-Tree unleashed enables subjects to join the experiment using a web portal that requires no software apart from a web browser. Experimenters are likewise enabled to administer their experiments from anywhere in the world. Except for z-Tree itself, z-Tree unleashed is entirely based on free and open-source software. In this paper we give a high-level overview of z-Tree unleashed's features and benefits and its design. We also show how to set up the server and demonstrate the steps required for conducting an entire experiment. We subsequently explain how to leverage the security and routing features of a virtual private network with z-Tree unleashed, enabling servers to securely run behind routers.",
                "authors": [
                    {
                        "name": "Duch M.L."
                    },
                    {
                        "name": "Grossmann M.R.P."
                    },
                    {
                        "name": "Lauer T."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Journal of Behavioral and Experimental Finance",
                "title": "z-Tree unleashed: A novel client-integrating architecture for conducting z-Tree experiments over the Internet"
            },
            "pmcid": "PMC7485551",
            "pmid": "32953459"
        }
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ]
}