{
    "additionDate": "2017-08-03T18:58:17Z",
    "biotoolsCURIE": "biotools:rv-typer",
    "biotoolsID": "rv-typer",
    "credit": [
        {
            "email": "urmila@bioinfo.net.in",
            "name": "Urmila Kulkarni-Kale",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinfo.net.in/"
        }
    ],
    "description": "Assign serotype to Rhinovirus -A, -B & -C using geomic/protein sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://196.1.114.46:1800/RV-Typer/home.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.net.in/RV-Typer/home.html",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rv-typer-typing-of-rhinoviruses-using-alignment-free-approach.html"
        }
    ],
    "name": "RV-Typer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2016 Kolekar et al.This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Rhinoviruses (RV) are increasingly being reported to cause mild to severe infections of respiratory tract in humans. RV are antigenically the most diverse species of the genus Enterovirus and family Picornaviridae. There are three species of RV (RV-A, -B and-C), with 80,32 and 55 serotypes/types, respectively. Antigenic variation is the main limiting factor for development of a cross-protective vaccine against RV.Serotyping of Rhinoviruses is carried out using cross-neutralization assays in cell culture. However, these assays become laborious and time-consuming for the large number of strains. Alternatively, serotyping of RV is carried out by alignment-based phylogeny of both protein and nucleotide sequences of VP1. However, serotyping of RV based on alignment-based phylogeny is a multi-step process, which needs to be repeated every time a new isolate is sequenced. In view of the growing need for serotyping of RV, an alignment-free method based on \"return time distribution\" (RTD) of amino acid residues in VP1 protein has been developed and implemented in the form of a web server titled RV-Typer. RV-Typer accepts nucleotide or protein sequences as an input and computes return times of di-peptides (k = 2) to assign serotypes. The RV-Typer performs with 100% sensitivity and specificity. It is significantly faster than alignmentbased methods. The web server is available at http://bioinfo.net.in/RV-Typer/home.html.",
                "authors": [
                    {
                        "name": "Kolekar P.S."
                    },
                    {
                        "name": "Waman V.P."
                    },
                    {
                        "name": "Kale M.M."
                    },
                    {
                        "name": "Kulkarni-Kale U."
                    }
                ],
                "citationCount": 3,
                "date": "2016-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "RV-typer: A web server for typing of Rhinoviruses using alignment-free approach"
            },
            "pmid": "26870949"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ],
    "validated": 1
}