{
    "additionDate": "2018-07-07T09:30:22Z",
    "biotoolsCURIE": "biotools:altered_pathway_analyzer",
    "biotoolsID": "altered_pathway_analyzer",
    "credit": [
        {
            "email": "dinesh@icgeb.res.in",
            "name": "Dinesh Gupta",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "abhinav@icgeb.res.in",
            "name": "Abhinav Kaushik",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Cross-platform and standalone tool for analyzing gene expression datasets to highlight significantly rewired pathways across case-vs-control conditions. The Tool is designed to analyze human gene expression datasets (with Entrez ID).",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinfo.icgeb.res.in/APA/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.icgeb.res.in/APA/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "Altered Pathway Analyzer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/srep40450",
            "metadata": {
                "abstract": "© The Author(s) 2017. Gene connection rewiring is an essential feature of gene network dynamics. Apart from its normal functional role, it may also lead to dysregulated functional states by disturbing pathway homeostasis. Very few computational tools measure rewiring within gene co-expression and its corresponding regulatory networks in order to identify and prioritize altered pathways which may or may not be differentially regulated. We have developed Altered Pathway Analyzer (APA), a microarray dataset analysis tool for identification and prioritization of altered pathways, including those which are differentially regulated by TFs, by quantifying rewired sub-network topology. Moreover, APA also helps in re-prioritization of APA shortlisted altered pathways enriched with context-specific genes. We performed APA analysis of simulated datasets and p53 status NCI-60 cell line microarray data to demonstrate potential of APA for identification of several case-specific altered pathways. APA analysis reveals several altered pathways not detected by other tools evaluated by us. APA analysis of unrelated prostate cancer datasets identifies sample-specific as well as conserved altered biological processes, mainly associated with lipid metabolism, cellular differentiation and proliferation. APA is designed as a cross platform tool which may be transparently customized to perform pathway analysis in different gene expression datasets. APA is freely available at http://bioinfo.icgeb.res.in/APA.",
                "authors": [
                    {
                        "name": "Kaushik A."
                    },
                    {
                        "name": "Ali S."
                    },
                    {
                        "name": "Gupta D."
                    }
                ],
                "citationCount": 4,
                "date": "2017-01-13T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Altered Pathway Analyzer: A gene expression dataset analysis tool for identification and prioritization of differentially regulated and network rewired pathways"
            }
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        }
    ],
    "validated": 1,
    "version": [
        "3.0"
    ]
}