{
    "additionDate": "2017-12-18T00:14:39Z",
    "biotoolsCURIE": "biotools:clasp",
    "biotoolsID": "clasp",
    "credit": [
        {
            "email": "christian@bioinf.uni-leipzig.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://hoffmann.bioinf.uni-leipzig.de/LIFE/Christian.html"
        }
    ],
    "description": "A fast and flexible fragment chainer that supports linear and sum-of-pair gap costs and uses highly time-efficient index structure, i.e., Johnson priority queues and range trees padded with Johnson priority queues. Chaining of short match fragments helps to quickly and accurately identify region of synteny that may not be found using common local alignment heuristics alone.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.bioinf.uni-leipzig.de/Software/clasp/clasp.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinf.uni-leipzig.de/Software/clasp/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/clasp-1-1-local-fragment-chainer-sum-of-pair-gap-costs.html"
        }
    ],
    "name": "clasp",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1748-7188-6-4",
            "metadata": {
                "abstract": "Background: Fast seed-based alignment heuristics such as BLAST and BLAT have become indispensable tools in comparative genomics for all studies aiming at the evolutionary relations of proteins, genes, and non-coding RNAs. This is true in particular for the large mammalian genomes. The sensitivity and specificity of these tools, however, crucially depend on parameters such as seed sizes or maximum expectation values. In settings that require high sensitivity the amount of short local match fragments easily becomes intractable. Then, fragment chaining is a powerful leverage to quickly connect, score, and rank the fragments to improve the specificity.Results: Here we present a fast and flexible fragment chainer that for the first time also supports a sum-of-pair gap cost model. This model has proven to achieve a higher accuracy and sensitivity in its own field of application. Due to a highly time-efficient index structure our method outperforms the only existing tool for fragment chaining under the linear gap cost model. It can easily be applied to the output generated by alignment tools such as segemehl or BLAST. As an example we consider homology-based searches for human and mouse snoRNAs demonstrating that a highly sensitive BLAST search with subsequent chaining is an attractive option. The sum-of-pair gap costs provide a substantial advantage is this context.Conclusions: Chaining of short match fragments helps to quickly and accurately identify regions of homology that may not be found using local alignment heuristics alone. By providing both the linear and the sum-of-pair gap cost model, a wider range of application can be covered. The software clasp is available at http://www.bioinf.uni-leipzig.de/Software/clasp/. © 2011 Otto et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Otto C."
                    },
                    {
                        "name": "Hoffmann S."
                    },
                    {
                        "name": "Gorodkin J."
                    },
                    {
                        "name": "Stadler P.F."
                    }
                ],
                "citationCount": 3,
                "date": "2011-03-18T00:00:00Z",
                "journal": "Algorithms for Molecular Biology",
                "title": "Fast local fragment chaining using sum-of-pair gap costs"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Synteny",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}