{
    "additionDate": "2021-11-01T09:53:51.999849Z",
    "biotoolsCURIE": "biotools:pals-pathway",
    "biotoolsID": "pals-pathway",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ronan.daly@glasgow.ac.uk",
            "name": "Rónán Daly",
            "orcidid": "https://orcid.org/0000-0002-1275-6820",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PALS (Pathway Activity Level Scoring) is a complete tool that performs database queries of pathways, decomposes activity levels in pathways via the PLAGE method, as well as presents the results in a user-friendly manner. The results are found to be more robust to noise and missing peaks compared to the alternatives (ORA, GSEA). This is particularly important for metabolomics peak data, where noise and missing peaks are prevalent.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://pals.glasgowcompbio.org/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-01T09:53:52.002232Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/glasgowcompbio/PALS"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/glasgowcompbio/PALS/issues"
        }
    ],
    "name": "PALS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/METABO11020103",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.Related metabolites can be grouped into sets in many ways, e.g., by their participation in series of chemical reactions (forming metabolic pathways), or based on fragmentation spectral similarities or shared chemical substructures. Understanding how such metabolite sets change in relation to experimental factors can be incredibly useful in the interpretation and understanding of complex metabolomics data sets. However, many of the available tools that are used to perform this analysis are not entirely suitable for the analysis of untargeted metabolomics measurements. Here, we present PALS (Pathway Activity Level Scoring), a Python library, command line tool, and Web application that performs the ranking of significantly changing metabolite sets over different experimental conditions. The main algorithm in PALS is based on the pathway level analysis of gene expression (PLAGE) factorisation method and is denoted as mPLAGE (PLAGE for metabolomics). As an example of an application, PALS is used to analyse metabolites grouped as metabolic pathways and by shared tandem mass spectrometry fragmentation patterns. A comparison of mPLAGE with two other commonly used methods (overrepresentation analysis (ORA) and gene set enrichment analysis (GSEA)) is also given and reveals that mPLAGE is more robust to missing features and noisy data than the alternatives. As further examples, PALS is also applied to human African trypanosomiasis, Rhamnaceae, and American Gut Project data. In addition, normalisation can have a significant impact on pathway analysis results, and PALS offers a framework to further investigate this. PALS is freely available from our project Web site.",
                "authors": [
                    {
                        "name": "McLuskey K."
                    },
                    {
                        "name": "Wandy J."
                    },
                    {
                        "name": "Vincent I."
                    },
                    {
                        "name": "Hooft J.J.J."
                    },
                    {
                        "name": "Rogers S."
                    },
                    {
                        "name": "Burgess K."
                    },
                    {
                        "name": "Daly R."
                    }
                ],
                "citationCount": 3,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "Ranking metabolite sets by their activity levels"
            },
            "pmcid": "PMC7916825",
            "pmid": "33670102",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Library"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}