{
    "accessibility": "Open access",
    "additionDate": "2023-03-19T09:19:30.088547Z",
    "biotoolsCURIE": "biotools:epviz",
    "biotoolsID": "epviz",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "archanav@bu.edu",
            "name": "Archana Venkataraman",
            "typeEntity": "Person"
        }
    ],
    "description": "EPViz is a tool to aid researchers in developing, validating, and reporting their predictive modeling outputs. A lightweight and standalone software package developed in Python, EPViz allows researchers to load a PyTorch deep learning model, apply it to the EEG, and overlay the output channel-wise or subject-level temporal predictions on top of the original time series.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://engineering.jhu.edu/nsa/epviz/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-19T09:19:30.094130Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/EPViz"
        }
    ],
    "name": "EPViz",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0282268",
            "metadata": {
                "abstract": "Scalp Electroencephalography (EEG) is one of the most popular noninvasive modalities for studying real-time neural phenomena. While traditional EEG studies have focused on identifying group-level statistical effects, the rise of machine learning has prompted a shift in computational neuroscience towards spatio-temporal predictive analyses. We introduce a novel open-source viewer, the EEG Prediction Visualizer (EPViz), to aid researchers in developing, validating, and reporting their predictive modeling outputs. EPViz is a lightweight and standalone software package developed in Python. Beyond viewing and manipulating the EEG data, EPViz allows researchers to load a PyTorch deep learning model, apply it to EEG features, and overlay the output channel-wise or subject-level temporal predictions on top of the original time series. These results can be saved as high-resolution images for use in manuscripts and presentations. EPViz also provides valuable tools for clinician-scientists, including spectrum visualization, computation of basic data statistics, and annotation editing. Finally, we have included a built-in EDF anonymization module to facilitate sharing of clinical data. Taken together, EPViz fills a much needed gap in EEG visualization. Our user-friendly interface and rich collection of features may also help to promote collaboration between engineers and clinicians.",
                "authors": [
                    {
                        "name": "Ahmed R."
                    },
                    {
                        "name": "Craley J."
                    },
                    {
                        "name": "Currey D."
                    },
                    {
                        "name": "Hsu D."
                    },
                    {
                        "name": "Venkataraman A."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "EPViz: A flexible and lightweight visualizer to facilitate predictive modeling for multichannel EEG"
            },
            "pmid": "36848345"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application",
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
