{
    "additionDate": "2020-01-14T09:20:53Z",
    "biotoolsCURIE": "biotools:TACITuS",
    "biotoolsID": "TACITuS",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "alaimos@dmi.unict.it",
            "name": "Salvatore Alaimo",
            "orcidid": "https://orcid.org/0000-0003-4825-7617",
            "typeEntity": "Person"
        }
    ],
    "description": "transcriptomic data collector, integrator, and selector on big data platform.\n\nTranscriptomic Data Collector, Integrator, and Selector.\n\nTACITuS is a portal, which deals with data pre-processing, selection and, eventually, integration of transcriptomic data coming from diverse sources, such as ArrayExpress. In order to take advantage of the functionality provided by this application, you will need to register, or sign in with a previously activated account.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'CONCLUSIONS:TACITuS', 'RESULTS:TACITuS'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://tacitus.app/",
    "lastUpdate": "2020-01-14T09:20:53Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/alaimos/tacitus/issues"
        }
    ],
    "name": "TACITuS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2912-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Several large public repositories of microarray datasets and RNA-seq data are available. Two prominent examples include ArrayExpress and NCBI GEO. Unfortunately, there is no easy way to import and manipulate data from such resources, because the data is stored in large files, requiring large bandwidth to download and special purpose data manipulation tools to extract subsets relevant for the specific analysis. Results: TACITuS is a web-based system that supports rapid query access to high-Throughput microarray and NGS repositories. The system is equipped with modules capable of managing large files, storing them in a cloud environment and extracting subsets of data in an easy and efficient way. The system also supports the ability to import data into Galaxy for further analysis. Conclusions: TACITuS automates most of the pre-processing needed to analyze high-Throughput microarray and NGS data from large publicly-Available repositories. The system implements several modules to manage large files in an easy and efficient way. Furthermore, it is capable deal with Galaxy environment allowing users to analyze data through a user-friendly interface.",
                "authors": [
                    {
                        "name": "Alaimo S."
                    },
                    {
                        "name": "Di Maria A."
                    },
                    {
                        "name": "Shasha D."
                    },
                    {
                        "name": "Ferro A."
                    },
                    {
                        "name": "Pulvirenti A."
                    }
                ],
                "date": "2019-11-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TACITuS: Transcriptomic data collector, integrator, and selector on big data platform"
            },
            "pmcid": "PMC6873396",
            "pmid": "31757212"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}