{
    "additionDate": "2017-02-10T14:14:14Z",
    "biotoolsCURIE": "biotools:apid",
    "biotoolsID": "apid",
    "credit": [
        {
            "email": "diego.alonso@usal.es",
            "name": "Diego Alonso-López",
            "orcidid": "https://orcid.org/0000-0003-1015-9923",
            "typeEntity": "Person",
            "typeRole": [
                "Developer",
                "Primary contact"
            ]
        },
        {
            "email": "jrivas@usal.es",
            "name": "Javier De Las Rivas",
            "orcidid": "https://orcid.org/0000-0002-0984-9946",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact",
                "Provider"
            ]
        }
    ],
    "description": "APID Interactomes provides a comprehensive collection of protein interactomes for more than 500 organisms based on the integration of known experimentally validated protein-protein physical interactions (PPIs). Construction of the interactomes is done with a methodological approach to report quality levels and coverage over the proteomes for each organism included.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cicblade.dep.usal.es:8080/APID/init.action#"
        }
    ],
    "editPermission": {
        "authors": [
            "diego.alonso"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://apid.dep.usal.es",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-04-01T08:07:33.766056Z",
    "name": "APID",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/database/baz005",
            "metadata": {
                "abstract": "© 2019 The Author(s).The collection and integration of all the known protein-protein physical interactions within a proteome framework are critical to allow proper exploration of the protein interaction networks that drive biological processes in cells at molecular level. APID Interactomes is a public resource of biological data (http://apid.dep.usal.es) that provides a comprehensive and curated collection of 'protein interactomes' for more than 1100 organisms, including 30 species with more than 500 interactions, derived from the integration of experimentally detected protein-to-protein physical interactions (PPIs). We have performed an update of APID database including a redefinition of several key properties of the PPIs to provide a more precise data integration and to avoid false duplicated records. This includes the unification of all the PPIs from five primary databases of molecular interactions (BioGRID, DIP, HPRD, IntAct and MINT), plus the information from two original systematic sources of human data and from experimentally resolved 3D structures (i.e. PDBs, Protein Data Bank files, where more than two distinct proteins have been identified). Thus, APID provides PPIs reported in published research articles (with traceable PMIDs) and detected by valid experimental interaction methods that give evidences about such protein interactions (following the 'ontology and controlled vocabulary': www.ebi.ac.uk/ols/ontologies/mi; developed by 'HUPO PSI-MI').Within this data mining framework, all interaction detection methods have been grouped into two main types: (i) 'binary' physical direct detection methods and (ii) 'indirect' methods. As a result of these redefinitions, APID provides unified protein interactomes including the specific 'experimental evidences' that support each PPI, indicating whether the interactions can be considered 'binary' (i.e. supported by at least one binary detection method) or not.",
                "authors": [
                    {
                        "name": "Alonso-Lopez D."
                    },
                    {
                        "name": "Calderwood M.A."
                    },
                    {
                        "name": "Campos-Laborie F.J."
                    },
                    {
                        "name": "De Las Rivas J."
                    },
                    {
                        "name": "Gutierrez M.A."
                    },
                    {
                        "name": "Lambourne L."
                    },
                    {
                        "name": "Vidal M."
                    }
                ],
                "citationCount": 48,
                "date": "2019-01-31T00:00:00Z",
                "journal": "Database",
                "title": "APID database: Redefining protein-protein interaction experimental evidences and binary interactomes"
            },
            "pmcid": "PMC6354026",
            "pmid": "30715274"
        },
        {
            "doi": "10.1093/nar/gkw363",
            "metadata": {
                "abstract": "© The Author(s) 2016.APID (Agile Protein Interactomes DataServer) is an interactive web server that provides unified generation and delivery of protein interactomes mapped to their respective proteomes. This resource is a new, fully redesigned server that includes a comprehensive collection of protein interactomes for more than 400 organisms (25 of which include more than 500 interactions) produced by the integration of only experimentally validated protein-protein physical interactions. For each protein-protein interaction (PPI) the server includes currently reported information about its experimental validation to allow selection and filtering at different quality levels. As a whole, it provides easy access to the interactomes from specific species and includes a global uniform compendium of 90,379 distinct proteins and 678,441 singular interactions. APID integrates and unifies PPIs frommajor primary databases of molecular interactions, from other specific repositories and also from experimentally resolved 3D structures of protein complexes where more than two proteins were identified. For this purpose, a collection of 8,388 structures were analyzed to identify specific PPIs. APID also includes a new graph tool (based on Cytoscape.js) for visualization and interactive analyses of PPI networks. The server does not require registration and it is freely available for use at http://apid.dep.usal.es.",
                "authors": [
                    {
                        "name": "Alonso-Lopez D."
                    },
                    {
                        "name": "De Las Rivas J."
                    },
                    {
                        "name": "Gutierrez M.A."
                    },
                    {
                        "name": "Lopes K.P."
                    },
                    {
                        "name": "Prieto C."
                    },
                    {
                        "name": "Santamaria R."
                    }
                ],
                "citationCount": 67,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "APID interactomes: Providing proteome-based interactomes with controlled quality for multiple species and derived networks"
            },
            "pmcid": "PMC4987915",
            "pmid": "27131791"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
