{
    "accessibility": "Open access",
    "additionDate": "2021-11-21T22:25:46.476076Z",
    "biotoolsCURIE": "biotools:rdscan",
    "biotoolsID": "rdscan",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "d.bespiatykh@gmail.com",
            "name": "D. Bespiatykh",
            "orcidid": "https://orcid.org/0000-0003-0867-5988",
            "typeEntity": "Person"
        },
        {
            "name": "E. Shitikov"
        },
        {
            "name": "I. Mokrousov"
        },
        {
            "name": "J. Bespyatykh"
        }
    ],
    "description": "RDscan is a snakemake pipeline to find deletions and putative regions of difference (RD) in mycobacterium tuberculosis complex (MTBC) genomes, it is also capable to determine already known or user defined RDs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deletion detection",
                    "uri": "http://edamontology.org/operation_3962"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dbespiatykh/RDscan",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-11-21T22:25:46.479594Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/dbespiatykh/RDscan"
        }
    ],
    "name": "RDscan",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1128/MSPHERE.00535-21",
            "metadata": {
                "abstract": "© 2021. Bespiatykh et al. This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license.Mycobacterium tuberculosis complex (MTBC) species are classic examples of genetically monomorphic microorganisms due to their low genetic variability. Wholegenome sequencing made it possible to describe both the main species within the complex and M. tuberculosis lineages and sublineages. This differentiation is based on single nucleotide polymorphisms (SNPs) and large sequence polymorphisms in the socalled regions of difference (RDs). Although a number of studies have been performed to elucidate RD localizations, their distribution among MTBC species, and their role in the bacterial life cycle, there are some inconsistencies and ambiguities in the localization of RDs in different members of the complex. To address this issue, we conducted a thorough search for all possible deletions in the WGS data collection comprising 721 samples representing the full MTBC diversity. Discovered deletions were compared with a list of all previously described RDs. As with the SNP-based analysis, we confirmed the specificities of 79 regions at the species, lineage, or sublineage level, 17 of which are described for the first time. We also present RDscan (https://github.com/dbespiatykh/RDscan), an opensource workflow, which detects deletions from short-read sequencing data and correlatesthe results with high-specificity RDs, curated in this study. Testing of the workflow on a collection comprising;7,000 samples showed a high specificity of the found RDs. This study provides novel details that can contribute to a better understanding of the species differentiation within the MTBC and can help to determine how individual clusters evolve within various MTBC species.",
                "authors": [
                    {
                        "name": "Bespiatykh D."
                    },
                    {
                        "name": "Bespyatykh J."
                    },
                    {
                        "name": "Mokrousov I."
                    },
                    {
                        "name": "Shitikov E."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "mSphere",
                "title": "A Comprehensive Map of Mycobacterium tuberculosis Complex Regions of Difference"
            },
            "pmcid": "PMC8386458",
            "pmid": "34287002"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
