{
    "additionDate": "2021-01-18T07:32:31Z",
    "biotoolsCURIE": "biotools:plappisite",
    "biotoolsID": "plappisite",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zidingzhang@cau.edu.cn",
            "name": "Ziding Zhang",
            "orcidid": "https://orcid.org/0000-0002-9296-571X",
            "typeEntity": "Person"
        },
        {
            "email": "lihongbio@163.com",
            "name": "Hong Li",
            "typeEntity": "Person"
        }
    ],
    "description": "PlaPPISite is a comprehensive database presenting fine-grained protein-protein interaction (PPI) site annotations. It covers both experimentally verified and predicted PPIs for 13 plants including Chlamydomonas reinhardtii, Arabidopsis thaliana, Ricinus communis, Glycine max, Oryza sativa, Solanum lycopersicum, Solanum tuberosum, Vitis vinifera, Zea mays, Brachypodium distachyon, Selaginella moellendorffii, Populus trichocarpa and Medicago truncatula.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Protein interaction network prediction",
                    "uri": "http://edamontology.org/operation_3094"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://zzdlab.com/plappisite/index.php",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-01-24T07:40:29Z",
    "name": "PlaPPISite",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12870-020-2254-4",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Protein-protein interactions (PPIs) play very important roles in diverse biological processes. Experimentally validated or predicted PPI data have become increasingly available in diverse plant species. To further explore the biological functions of PPIs, understanding the interaction details of plant PPIs (e.g., the 3D structural contexts of interaction sites) is necessary. By integrating bioinformatics algorithms, interaction details can be annotated at different levels and then compiled into user-friendly databases. In our previous study, we developed AraPPISite, which aimed to provide interaction site information for PPIs in the model plant Arabidopsis thaliana. Considering that the application of AraPPISite is limited to one species, it is very natural that AraPPISite should be evolved into a new database that can provide interaction details of PPIs in multiple plants. Description: PlaPPISite (http://zzdlab.com/plappisite/index.php) is a comprehensive, high-coverage and interaction details-oriented database for 13 plant interactomes. In addition to collecting 121 experimentally verified structures of protein complexes, the complex structures of experimental/predicted PPIs in the 13 plants were also constructed, and the corresponding interaction sites were annotated. For the PPIs whose 3D structures could not be modelled, the associated domain-domain interactions (DDIs) and domain-motif interactions (DMIs) were inferred. To facilitate the reliability assessment of predicted PPIs, the source species of interolog templates, GO annotations, subcellular localizations and gene expression similarities are also provided. JavaScript packages were employed to visualize structures of protein complexes, protein interaction sites and protein interaction networks. We also developed an online tool for homology modelling and protein interaction site annotation of protein complexes. All data contained in PlaPPISite are also freely available on the Download page. Conclusion: PlaPPISite provides the plant research community with an easy-to-use and comprehensive data resource for the search and analysis of protein interaction details from the 13 important plant species.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Qi H."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Yang S."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 3,
                "date": "2020-02-06T00:00:00Z",
                "journal": "BMC Plant Biology",
                "title": "PlaPPISite: A comprehensive resource for plant protein-protein interaction sites"
            },
            "pmcid": "PMC7006421",
            "pmid": "32028878"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
