{
    "additionDate": "2018-05-08T14:19:24Z",
    "biotoolsCURIE": "biotools:variantmetacaller",
    "biotoolsID": "variantmetacaller",
    "credit": [
        {
            "email": "gezsi.andras@gmail.com",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Automated fusion of variant calling pipelines for quantitative, precision-based filtering.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformatics.mit.bme.hu/VariantMetaCaller/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.mit.bme.hu/VariantMetaCaller/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "VariantMetaCaller",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12864-015-2050-Y",
            "metadata": {
                "abstract": "© 2015 Gezsi et al.Background: The low concordance between different variant calling methods still poses a challenge for the wide-spread application of next-generation sequencing in research and clinical practice. A wide range of variant annotations can be used for filtering call sets in order to improve the precision of the variant calls, but the choice of the appropriate filtering thresholds is not straightforward. Variant quality score recalibration provides an alternative solution to hard filtering, but it requires large-scale, genomic data. Results: We evaluated germline variant calling pipelines based on BWA and Bowtie 2 aligners in combination with GATK UnifiedGenotyper, GATK HaplotypeCaller, FreeBayes and SAMtools variant callers, using simulated and real benchmark sequencing data (NA12878 with Illumina Platinum Genomes). We argue that these pipelines are not merely discordant, but they extract complementary useful information. We introduce VariantMetaCaller to test the hypothesis that the automated fusion of measurement related information allows better performance than the recommended hard-filtering settings or recalibration and the fusion of the individual call sets without using annotations. VariantMetaCaller uses Support Vector Machines to combine multiple information sources generated by variant calling pipelines and estimates probabilities of variants. This novel method had significantly higher sensitivity and precision than the individual variant callers in all target region sizes, ranging from a few hundred kilobases to whole exomes. We also demonstrated that VariantMetaCaller supports a quantitative, precision based filtering of variants under wider conditions. Specifically, the computed probabilities of the variants can be used to order the variants, and for a given threshold, probabilities can be used to estimate precision. Precision then can be directly translated to the number of true called variants, or equivalently, to the number of false calls, which allows finding problem-specific balance between sensitivity and precision. Conclusions: VariantMetaCaller can be applied to small target regions and whole exomes as well, and it can be used in cases of organisms for which highly accurate variant call sets are not yet available, therefore it can be a viable alternative to hard filtering in cases where variant quality score recalibration cannot be used. VariantMetaCaller is freely available at http://bioinformatics.mit.bme.hu/VariantMetaCaller.",
                "authors": [
                    {
                        "name": "Antal P."
                    },
                    {
                        "name": "Bolgar B."
                    },
                    {
                        "name": "Gezsi A."
                    },
                    {
                        "name": "Marx P."
                    },
                    {
                        "name": "Sarkozy P."
                    },
                    {
                        "name": "Szalai C."
                    }
                ],
                "citationCount": 14,
                "date": "2015-10-28T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "VariantMetaCaller: Automated fusion of variant calling pipelines for quantitative, precision-based filtering"
            },
            "pmcid": "PMC4625715",
            "pmid": "26510841"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
