{
    "additionDate": "2020-01-09T17:54:43Z",
    "biotoolsCURIE": "biotools:MrNV",
    "biotoolsID": "MrNV",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "parin@g.swu.ac.th",
            "name": "Parin Chaivisuthangkura",
            "orcidid": "https://orcid.org/0000-0002-8326-222X",
            "typeEntity": "Person"
        }
    ],
    "description": "Transcriptomic analysis of Macrobrachium rosenbergii (giant fresh water prawn) post-larvae in response to M. rosenbergii nodavirus (MrNV) infection.\n\nData analysis pipeline used for the assembly and differential abundance analysis of M. rosenbergii transcriptome in response to MrNV infection.\n\nTranscriptomic analysis (RNAseq) of Macrobrachium rosenbergii post-larvae in response to Macrobrachium rosenbergii nodavirus (MrNV) infection.\n\nPhongthana Pasookhush, Charles Hindmarch, Siwaporn Longyant, Paisarn Sithigorngul, William G. Bendena, Parin Chaivisuthangkura. Transcriptomic analysis of Macrobrachium rosenbergii (giant fresh water prawn) postlarvae in response to M. rosenbergii nodavirus (MrNV) infection: de novo assembly and functional annotation. BMC Genomics volume 20, Article number: 762 (2019), DOI: 10.1186/s12864-019-6102-6 Article URL",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "https://github.com/prawnseq/Mrosenbergii_MrNV_RNAseq",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T10:36:42Z",
    "name": "MrNV",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12864-019-6102-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Macrobrachium rosenbergii, is one of a major freshwater prawn species cultured in Southeast Asia. White tail disease (WTD), caused by Macrobrachium rosenbergii nodavirus (MrNV), is a serious problem in farm cultivation and is responsible for up to 100% mortality in the post larvae stage. Molecular data on how M. rosenbergii post-larvae launches an immune response to an infection with MrNV is not currently available. We therefore compared the whole transcriptomic sequence of M. rosenbergii post-larvae before and after MrNV infection. Results: Transcriptome for M. rosenbergii post-larvae demonstrated high completeness (BUSCO Complete: 83.4%, fragmentation: 13%, missing:3.3%, duplication:16.2%; highest ExN50 value: 94%). The assembled transcriptome consists of 96,362 unigenes with N50 of 1308 bp. The assembled transcriptome was successfully annotated against the NCBI non-redundant arthropod database (33.75%), UniProt database (26.73%), Gene Ontology (GO) (18.98%), Evolutionary Genealogy of Genes: Non-supervised Orthologous Groups (EggNOG) (20.88%), and Kyoto Encyclopedia of Genes and Genome pathway (KEGG) (20.46%). GO annotations included immune system process, signaling, response to stimulus, and antioxidant activity. Differential abundance analysis using EdgeR showed 2413 significantly up-regulated genes and 3125 significantly down-regulated genes during the infection of MrNV. Conclusions: This study reported a highly complete transcriptome from the post-larvae stage of giant river prawn, M. rosenbergii. Differential abundant transcripts during MrNV infection were identified and validated by qPCR, many of these differentially abundant transcripts as key players in antiviral immunity. These include known members of the innate immune response with the largest expression change occurring in the M. rosenbergii post-larvae after MrNV infection such as antiviral protein, C-type lectin, prophenol oxidase, caspase, ADP ribosylation factors, and dicer.",
                "authors": [
                    {
                        "name": "Bendena W.G."
                    },
                    {
                        "name": "Chaivisuthangkura P."
                    },
                    {
                        "name": "Hindmarch C."
                    },
                    {
                        "name": "Longyant S."
                    },
                    {
                        "name": "Pasookhush P."
                    },
                    {
                        "name": "Sithigorngul P."
                    }
                ],
                "citationCount": 9,
                "date": "2019-10-22T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Transcriptomic analysis of Macrobrachium rosenbergii (giant fresh water prawn) post-larvae in response to M. rosenbergii nodavirus (MrNV) infection: De novo assembly and functional annotation"
            },
            "pmcid": "PMC6805343",
            "pmid": "31640560"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
