{
    "additionDate": "2021-01-18T11:03:47Z",
    "biotoolsCURIE": "biotools:masterpath",
    "biotoolsID": "masterpath",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nrubanova@ihes.fr",
            "name": "Natalia Rubanova",
            "orcidid": "https://orcid.org/0000-0001-8673-5144",
            "typeEntity": "Person"
        }
    ],
    "description": "Network analysis of functional genomics screening data.\n\nMasterPATH is an exploratory network analysis method that employs the shortest path approach and centrality measure to uncover members of active molecular pathways leading to the studied phenotype based on the results of functional genomics screening data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/daggoo/masterPath",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-02-20T17:10:43Z",
    "name": "MasterPATH",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12864-020-07047-2",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Functional genomics employs several experimental approaches to investigate gene functions. High-throughput techniques, such as loss-of-function screening and transcriptome profiling, allow to identify lists of genes potentially involved in biological processes of interest (so called hit list). Several computational methods exist to analyze and interpret such lists, the most widespread of which aim either at investigating of significantly enriched biological processes, or at extracting significantly represented subnetworks. Results: Here we propose a novel network analysis method and corresponding computational software that employs the shortest path approach and centrality measure to discover members of molecular pathways leading to the studied phenotype, based on functional genomics screening data. The method works on integrated interactomes that consist of both directed and undirected networks - HIPPIE, SIGNOR, SignaLink, TFactS, KEGG, TransmiR, miRTarBase. The method finds nodes and short simple paths with significant high centrality in subnetworks induced by the hit genes and by so-called final implementers - the genes that are involved in molecular events responsible for final phenotypic realization of the biological processes of interest. We present the application of the method to the data from miRNA loss-of-function screen and transcriptome profiling of terminal human muscle differentiation process and to the gene loss-of-function screen exploring the genes that regulates human oxidative DNA damage recognition. The analysis highlighted the possible role of several known myogenesis regulatory miRNAs (miR-1, miR-125b, miR-216a) and their targets (AR, NR3C1, ARRB1, ITSN1, VAV3, TDGF1), as well as linked two major regulatory molecules of skeletal myogenesis, MYOD and SMAD3, to their previously known muscle-related targets (TGFB1, CDC42, CTCF) and also to a number of proteins such as C-KIT that have not been previously studied in the context of muscle differentiation. The analysis also showed the role of the interaction between H3 and SETDB1 proteins for oxidative DNA damage recognition. Conclusion: The current work provides a systematic methodology to discover members of molecular pathways in integrated networks using functional genomics screening data. It also offers a valuable instrument to explain the appearance of a set of genes, previously not associated with the process of interest, in the hit list of each particular functional genomics screening.",
                "authors": [
                    {
                        "name": "Rubanova N."
                    },
                    {
                        "name": "Pinna G."
                    },
                    {
                        "name": "Kropp J."
                    },
                    {
                        "name": "Campalans A."
                    },
                    {
                        "name": "Radicella J.P."
                    },
                    {
                        "name": "Polesskaya A."
                    },
                    {
                        "name": "Harel-Bellan A."
                    },
                    {
                        "name": "Morozova N."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-14T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "MasterPATH: Network analysis of functional genomics screening data"
            },
            "pmcid": "PMC7491077",
            "pmid": "32928103"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}