{
    "additionDate": "2022-10-07T06:12:54.795959Z",
    "biotoolsCURIE": "biotools:imrna",
    "biotoolsID": "imrna",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/imrna/index.html"
        }
    ],
    "description": "This is developed for designing a single-strand RNA sequence with desired immunomodulatory potentials in order to develop RNA-based therapeutics, immunotherapy and vaccine-adjuvants. This server also facilitates the users in computer-aided designing of siRNAs with desired toxicity.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/imrna/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/imrna/index.html",
    "lastUpdate": "2022-10-07T06:13:09.679507Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/imrna/index.html"
        }
    ],
    "name": "imrna",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1038/srep20678",
            "metadata": {
                "abstract": "© 2016, Nature Publishing Group. All rights reserved.Our innate immune system recognizes a foreign RNA sequence of a pathogen and activates the immune system to eliminate the pathogen from our body. This immunomodulatory potential of RNA can be used to design RNA-based immunotherapy and vaccine adjuvants. In case of siRNA-based therapy, the immunomodulatory effect of an RNA sequence is unwanted as it may cause immunotoxicity. Thus, we developed a method for designing a single-stranded RNA (ssRNA) sequence with desired immunomodulatory potentials, for designing RNA-based therapeutics, immunotherapy and vaccine adjuvants. The dataset used for training and testing our models consists of 602 experimentally verified immunomodulatory oligoribonucleotides (IMORNs) that are ssRNA sequences of length 17 to 27 nucleotides and 520 circulating miRNAs as non-immunomodulatory sequences. We developed prediction models using various features that include composition-based features, binary profile, selected features, and hybrid features. All models were evaluated using five-fold cross-validation and external validation techniques; achieving a maximum mean Matthews Correlation Coefficient (MCC) of 0.86 with 93% accuracy. We identified motifs using MERCI software and observed the abundance of adenine (A) in motifs. Based on the above study, we developed a web server, imRNA, comprising of various modules important for designing RNA-based therapeutics (http://crdd.osdd.net/raghava/imrna/).",
                "authors": [
                    {
                        "name": "Chaudhary K."
                    },
                    {
                        "name": "Dhanda S.K."
                    },
                    {
                        "name": "Nagpal G."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 16,
                "date": "2016-02-10T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Prediction of Immunomodulatory potential of an RNA sequence for designing non-toxic siRNAs and RNA-based vaccine adjuvants"
            },
            "pmcid": "PMC4748260",
            "pmid": "26861761",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
