{
    "accessibility": "Open access",
    "additionDate": "2022-03-15T12:39:27.759396Z",
    "biotoolsCURIE": "biotools:tsspredator",
    "biotoolsID": "tsspredator",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cynthia.sharma@uni-wuerzburg.de",
            "name": "Cynthia M. Sharma"
        },
        {
            "name": "Gaurav Dugar"
        },
        {
            "name": "Kay Nieselt"
        }
    ],
    "description": "TSSpredator, a Java program for the automated detection and classification of TSS from RNA-seq data. TSSpredator reads RNA-seq data in the form of simple wiggle files and performs a genome wide comparative prediction of TSS, for example between different growth conditions.",
    "documentation": [
        {
            "note": "The example data used in the tutorials can be downloaded from",
            "type": [
                "Training material"
            ],
            "url": "https://itnc.informatik.uni-tuebingen.de/index.php/s/J9fQjSdc2JWpCFx"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://tsspredator20-rtd.readthedocs.io/en/latest/index.html"
        }
    ],
    "download": [
        {
            "note": "Download for TSSpredator version 1.1beta (March 2021)",
            "type": "Other",
            "url": "https://uni-tuebingen.de/fileadmin/Uni_Tuebingen/Fakultaeten/InfoKogni/WSI/IntegTranskript/Softwareprojekte/TSSPredator/TSSpredator-1.1beta.jar"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Expression data",
                        "uri": "http://edamontology.org/data_2603"
                    },
                    "format": [
                        {
                            "term": "WIG",
                            "uri": "http://edamontology.org/format_3005"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "ASTD ID (tss)",
                        "uri": "http://edamontology.org/data_2371"
                    }
                }
            ]
        }
    ],
    "homepage": "https://uni-tuebingen.de/fakultaeten/mathematisch-naturwissenschaftliche-fakultaet/fachbereiche/informatik/lehrstuehle/integrative-transkriptomik/software/tsspredator",
    "language": [
        "Java"
    ],
    "lastUpdate": "2022-03-15T12:39:27.762114Z",
    "name": "TSSpredator",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/journal.pgen.1003495",
            "metadata": {
                "abstract": "Campylobacter jejuni is currently the leading cause of bacterial gastroenteritis in humans. Comparison of multiple Campylobacter strains revealed a high genetic and phenotypic diversity. However, little is known about differences in transcriptome organization, gene expression, and small RNA (sRNA) repertoires. Here we present the first comparative primary transcriptome analysis based on the differential RNA-seq (dRNA-seq) of four C. jejuni isolates. Our approach includes a novel, generic method for the automated annotation of transcriptional start sites (TSS), which allowed us to provide genome-wide promoter maps in the analyzed strains. These global TSS maps are refined through the integration of a SuperGenome approach that allows for a comparative TSS annotation by mapping RNA-seq data of multiple strains into a common coordinate system derived from a whole-genome alignment. Considering the steadily increasing amount of RNA-seq studies, our automated TSS annotation will not only facilitate transcriptome annotation for a wider range of pro- and eukaryotes but can also be adapted for the analysis among different growth or stress conditions. Our comparative dRNA-seq analysis revealed conservation of most TSS, but also single-nucleotide-polymorphisms (SNP) in promoter regions, which lead to strain-specific transcriptional output. Furthermore, we identified strain-specific sRNA repertoires that could contribute to differential gene regulation among strains. In addition, we identified a novel minimal CRISPR-system in Campylobacter of the type-II CRISPR subtype, which relies on the host factor RNase III and a trans-encoded sRNA for maturation of crRNAs. This minimal system of Campylobacter, which seems active in only some strains, employs a unique maturation pathway, since the crRNAs are transcribed from individual promoters in the upstream repeats and thereby minimize the requirements for the maturation machinery. Overall, our study provides new insights into strain-specific transcriptome organization and sRNAs, and reveals genes that could modulate phenotypic variation among strains despite high conservation at the DNA level. © 2013 Dugar et al.",
                "authors": [
                    {
                        "name": "Dugar G."
                    },
                    {
                        "name": "Forstner K.U."
                    },
                    {
                        "name": "Heidrich N."
                    },
                    {
                        "name": "Herbig A."
                    },
                    {
                        "name": "Nieselt K."
                    },
                    {
                        "name": "Reinhardt R."
                    },
                    {
                        "name": "Sharma C.M."
                    }
                ],
                "citationCount": 186,
                "date": "2013-05-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "High-Resolution Transcriptome Maps Reveal Strain-Specific Regulatory Features of Multiple Campylobacter jejuni Isolates"
            },
            "pmcid": "PMC3656092",
            "pmid": "23696746"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
