{"credit":[{"email":"janette.nickel@charite.de","name":"Janette Nickel","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"Bjoern-Oliver.Gohlke@charite.de","name":"Bjoern-Oliver Gohlke","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"Priyanka.Banerjee@charite.de","name":"Priyanka Banerjee","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"Jevgeni.Ehreman@charite.de","name":"Jevgeni Ehreman","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"mathias.dunkel@charite.de","name":"Mathias Dunke","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://prediction.charite.de/index.php?site=faq"}],"function":[{"operation":[{"term":"Protein subcellular localisation prediction","uri":"http://edamontology.org/operation_2489"},{"term":"Structural similarity search","uri":"http://edamontology.org/operation_0360"},{"term":"Gene-set enrichment analysis","uri":"http://edamontology.org/operation_2436"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Medicinal chemistry","uri":"http://edamontology.org/topic_0209"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Drug discovery","uri":"http://edamontology.org/topic_3336"},{"term":"Drug metabolism","uri":"http://edamontology.org/topic_3375"}]},"publication":[{"abstract":"The drug classification scheme of the World Health Organization (WHO) [Anatomical Therapeutic Chemical (ATC)-code] connects chemical classification and therapeutic approach. It is generally accepted that compounds with similar physicochemical properties exhibit similar biological activity. If this hypothesis holds true for drugs, then the ATC-code, the putative medical indication area and potentially the medical target should be predictable on the basis of structural similarity. We have validated that the prediction of the drug class is reliable for WHO-classified drugs. The reliability of the predicted medical effects of the compounds increases with a rising number of (physico-) chemical properties similar to a drug with known function. The web-server translates a user-defined molecule into a structural fingerprint that is compared to about 6300 drugs, which are enriched by 7300 links to molecular targets of the drugs, derived through text mining followed by manual curation. Links to the affected pathways are provided. The similarity to the medical compounds is expressed by the Tanimoto coefficient that gives the structural similarity of two compounds. A similarity score higher than 0.85 results in correct ATC prediction for 81% of all cases. As the biological effect is well predictable, if the structural similarity is sufficient, the web-server allows prognoses about the medical indication area of novel compounds and to find new leads for known targets. Availability: the system is freely accessible at http://bioinformatics.charite.de/superpred. SuperPred can be obtained via a Creative Commons Attribution Noncommercial-Share Alike 3.0 License.","authors":["Dunkel M.","Gunther S.","Ahmed J.","Wittig B.","Preissner R."],"cit_count":79,"journal":"Nucleic acids research","pmid":"18499712","title":"SuperPred: drug classification and target prediction.","year":"2008-01-01"}],"summary":{"biotoolsCURIE":"biotools:superpred","biotoolsID":"superpred","description":"The SuperPred web server compares the structural fingerprint of an input molecule to a database of drugs connected to their drug targets and affected pathways. As the biological effect is well predictable, if the structural similarity is sufficient, the web-server allows prognoses about the medical indication area of novel compounds and to find new leads for known targets. Such information can be useful in drug classification and target prediction.","homepage":"http://bioinformatics.charite.de/superpred","name":"SuperPred"}}