{
    "additionDate": "2021-01-18T11:59:46Z",
    "biotoolsCURIE": "biotools:awcluster",
    "biotoolsID": "awcluster",
    "confidence_flag": "tool",
    "description": "aWCluster is a network-based integration method of multiomics data as well as a clustering technique founded on the Wasserstein (Earth Mover's) distance from the theory of optimal mass transport.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mpouryah/aWCluster",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-11-24T20:46:27.314261Z",
    "name": "aWCluster",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/tcbb.2020.3039511",
            "metadata": {
                "abstract": "The remarkable growth of multi-platform genomic profiles has led to the challenge of multiomics data integration. In this study, we present a novel network-based multiomics clustering founded on the Wasserstein distance from optimal mass transport. This distance has many important geometric properties making it a suitable choice for application in machine learning and clustering. Our proposed method of aggregating multiomics and Wasserstein distance clustering (aWCluster) is applied to breast carcinoma as well as bladder carcinoma, colorectal adenocarcinoma, renal carcinoma, lung non-small cell adenocarcinoma, and endometrial carcinoma from The Cancer Genome Atlas project. Subtypes were characterized by the concordant effect of mRNA expression, DNA copy number alteration, and DNA methylation of genes and their neighbors in the interaction network. aWCluster successfully clusters all cancer types into classes with significantly different survival rates. Also, a gene ontology enrichment analysis of significant genes in the low survival subgroup of breast cancer leads to the well-known phenomenon of tumor hypoxia and the transcription factor ETS1 whose expression is induced by hypoxia. We believe aWCluster has the potential to discover novel subtypes and biomarkers by accentuating the genes that have concordant multiomics measurements in their interaction network, which are challenging to find without the network inference or with single omics analysis.",
                "authors": [
                    {
                        "name": "Belkhatir Z."
                    },
                    {
                        "name": "Deasy J.O."
                    },
                    {
                        "name": "Javanmard P."
                    },
                    {
                        "name": "Mathews J.C."
                    },
                    {
                        "name": "Oh J.H."
                    },
                    {
                        "name": "Pouryahya M."
                    },
                    {
                        "name": "Tannenbaum A.R."
                    }
                ],
                "citationCount": 9,
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "aWCluster: A Novel Integrative Network-Based Clustering of Multiomics for Subtype Analysis of Cancer Data"
            },
            "pmcid": "PMC9518829",
            "pmid": "33226952"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
