{
    "accessibility": "Open access",
    "additionDate": "2024-01-30T15:44:10.920337Z",
    "biotoolsCURIE": "biotools:deepdlncud",
    "biotoolsID": "deepdlncud",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xiawang@nwafu.edu.cn",
            "name": "Xia Wang",
            "typeEntity": "Person"
        },
        {
            "name": "Jianfeng Sun",
            "typeEntity": "Person"
        },
        {
            "name": "Jinlong Ru",
            "typeEntity": "Person"
        },
        {
            "name": "Shuyue Si",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting regulation types of small molecule inhibitors on modulating lncRNA expression by deep learning.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/2003100127/deepdlncud",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:18:02.959207Z",
    "name": "DeepdlncUD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2023.107226",
            "metadata": {
                "abstract": "Targeting lncRNAs by small molecules (SM-lncR) to alter their expression levels has emerged as an important therapeutic modality for disease treatment. To date, no computational tools have been dedicated to predicting small molecule-mediated upregulation or downregulation of lncRNA expression. Here, we introduce DeepdlncUD, which integrates predictions of nine deep learning algorithms together, to infer the regulation types of small molecules on modulating lncRNA expression. Through systematic optimization on a training set of 771 upregulation and 739 downregulation SM-lncR pairs, each encoding 1369 sequence, representational, and physiochemical features, this method outperforms a recently released program, DeepsmirUD, by achieving 0.674 in AUC (area under the receiver operating characteristic curve), 0.722 in AUCPR (area under the precision-recall curve), 0.681 in F1-score, and 0.516 in Jaccard Index on a test set of 222 SM-lncR pairs. By extracting 125 upregulation and 46 downregulation SM-lncR pairs that involve disease-associated lncRNAs, DeepdlncUD is shown to gain an accuracy of 0.700 in the pathological context. Using connectivity scores, around half of the small molecules are correctly estimated as drugs to treat lncRNA-regulated diseases. This tool can be run at a fast speed to assist the discovery of potential small molecule drugs of lncRNA targets on a large scale. DeepdlncUD is publicly available at https://github.com/2003100127/deepdlncud.",
                "authors": [
                    {
                        "name": "Ru J."
                    },
                    {
                        "name": "Si S."
                    },
                    {
                        "name": "Sun J."
                    },
                    {
                        "name": "Wang X."
                    }
                ],
                "citationCount": 1,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "DeepdlncUD: Predicting regulation types of small molecule inhibitors on modulating lncRNA expression by deep learning"
            },
            "pmid": "37450966"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
