{
    "additionDate": "2021-11-29T12:11:41.420417Z",
    "biotoolsCURIE": "biotools:sc-gan",
    "biotoolsID": "sc-gan",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "haoyulan@usc.edu",
            "name": "Haoyu Lan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SC-GAN is a tool for 3D self-attention conditional GAN with spectral normalization for multi-modal neuroimaging synthesis. SC-GAN was assessed for positron emission tomography (PET), Fractional anisotropy (FA) and mean diffusivity (MD) synthesis from tasks using T1w and FLAIR magnetic resonance images (MRI).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Haoyulance/SC-GAN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:15:31.660415Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Haoyulance/SC-GAN/issues"
        }
    ],
    "name": "SC-GAN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/mrm.28819",
            "metadata": {
                "abstract": "Purpose: To develop a new 3D generative adversarial network that is designed and optimized for the application of multimodal 3D neuroimaging synthesis. Methods: We present a 3D conditional generative adversarial network (GAN) that uses spectral normalization and feature matching to stabilize the training process and ensure optimization convergence (called SC-GAN). A self-attention module was also added to model the relationships between widely separated image voxels. The performance of the network was evaluated on the data set from ADNI-3, in which the proposed network was used to predict PET images, fractional anisotropy, and mean diffusivity maps from multimodal MRI. Then, SC-GAN was applied on a multidimensional diffusion MRI experiment for superresolution application. Experiment results were evaluated by normalized RMS error, peak SNR, and structural similarity. Results: In general, SC-GAN outperformed other state-of-the-art GAN networks including 3D conditional GAN in all three tasks across all evaluation metrics. Prediction error of the SC-GAN was 18%, 24% and 29% lower compared to 2D conditional GAN for fractional anisotropy, PET and mean diffusivity tasks, respectively. The ablation experiment showed that the major contributors to the improved performance of SC-GAN are the adversarial learning and the self-attention module, followed by the spectral normalization module. In the superresolution multidimensional diffusion experiment, SC-GAN provided superior predication in comparison to 3D Unet and 3D conditional GAN. Conclusion: In this work, an efficient end-to-end framework for multimodal 3D medical image synthesis (SC-GAN) is presented. The source code is also made available at https://github.com/Haoyulance/SC-GAN.",
                "authors": [
                    {
                        "name": "Lan H."
                    },
                    {
                        "name": "Sepehrband F."
                    },
                    {
                        "name": "Toga A.W."
                    }
                ],
                "citationCount": 34,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Magnetic Resonance in Medicine",
                "title": "Three-dimensional self-attention conditional GAN with spectral normalization for multimodal neuroimaging synthesis"
            },
            "pmcid": "PMC9070032",
            "pmid": "33961321",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
