{
    "additionDate": "2024-03-06T13:21:23.938994Z",
    "biotoolsCURIE": "biotools:pycharmm",
    "biotoolsID": "pycharmm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "brookscl@umich.edu",
            "name": "Charles L. Brooks",
            "orcidid": "https://orcid.org/0000-0002-8149-5417",
            "typeEntity": "Person"
        }
    ],
    "description": "Embedding CHARMM functionality in a python framework.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BrooksResearchGroup-UM/pyCHARMM-Workshop",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:12:10.688386Z",
    "name": "pyCHARMM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/acs.jctc.3c00364",
            "metadata": {
                "abstract": "CHARMM is rich in methodology and functionality as one of the first programs addressing problems of molecular dynamics and modeling of biological macromolecules and their partners, e.g., small molecule ligands. When combined with the highly developed CHARMM parameters for proteins, nucleic acids, small molecules, lipids, sugars, and other biologically relevant building blocks, and the versatile CHARMM scripting language, CHARMM has been a trendsetting platform for modeling studies of biological macromolecules. To further enhance the utility of accessing and using CHARMM functionality in increasingly complex workflows associated with modeling biological systems, we introduce pyCHARMM, Python bindings, functions, and modules to complement and extend the extensive set of modeling tools and methods already available in CHARMM. These include access to CHARMM function-generated variables associated with the system (psf), coordinates, velocities and forces, atom selection variables, and force field related parameters. The ability to augment CHARMM forces and energies with energy terms or methods derived from machine learning or other sources, written in Python, CUDA, or OpenCL and expressed as Python callable routines is introduced together with analogous functions callable during dynamics calculations. Integration of Python-based graphical engines for visualization of simulation models and results is also accessible. Loosely coupled parallelism is available for workflows such as free energy calculations, using MBAR/TI approaches or high-throughput multisite λ-dynamics (MSλD) free energy methods, string path optimization calculations, replica exchange, and molecular docking with a new Python-based CDOCKER module. CHARMM accelerated platform kernels through the CHARMM/OpenMM API, CHARMM/DOMDEC, and CHARMM/BLaDE API are also readily integrated into this Python framework. We anticipate that pyCHARMM will be a robust platform for the development of comprehensive and complex workflows utilizing Python and its extensive functionality as well as an optimal platform for users to learn molecular modeling methods and practices within a Python-friendly environment such as Jupyter Notebooks.",
                "authors": [
                    {
                        "name": "Brooks C.L."
                    },
                    {
                        "name": "Buckner J."
                    },
                    {
                        "name": "Cervantes L.F."
                    },
                    {
                        "name": "Chakravorty A."
                    },
                    {
                        "name": "Lai T.T."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wu Y."
                    }
                ],
                "citationCount": 14,
                "date": "2023-06-27T00:00:00Z",
                "journal": "Journal of Chemical Theory and Computation",
                "title": "pyCHARMM: Embedding CHARMM Functionality in a Python Framework"
            },
            "pmcid": "PMC10504603",
            "pmid": "37267404"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
