{
    "additionDate": "2020-01-14T19:39:40Z",
    "biotoolsCURIE": "biotools:M3S",
    "biotoolsID": "M3S",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "czhang87@iu.edu",
            "name": "Chi Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Yu Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive model selection for multi-modal single-cell RNA sequencing data.\n\nM3S: A user-friendly tool for comprehensive evaluation of multi-modality and statistical model selection for single-cell RNA sequencing data.\n\nA large number of single-cell RNA sequencing (scRNA-seq) data set was recently generated to characterize the heterogeneous in cell types or states in a complex tissue or biological process",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Statistical modelling",
                    "uri": "http://edamontology.org/operation_3664"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zy26/M3S",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-22T13:44:11Z",
    "name": "M3S",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3243-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Various statistical models have been developed to model the single cell RNA-seq expression profiles, capture its multimodality, and conduct differential gene expression test. However, for expression data generated by different experimental design and platforms, there is currently lack of capability to determine the most proper statistical model. Results: We developed an R package, namely Multi-Modal Model Selection (M3S), for gene-wise selection of the most proper multi-modality statistical model and downstream analysis, useful in a single-cell or large scale bulk tissue transcriptomic data. M3S is featured with (1) gene-wise selection of the most parsimonious model among 11 most commonly utilized ones, that can best fit the expression distribution of the gene, (2) parameter estimation of a selected model, and (3) differential gene expression test based on the selected model. Conclusion: A comprehensive evaluation suggested that M3S can accurately capture the multimodality on simulated and real single cell data. An open source package and is available through GitHub at https://github.com/zy26/M3S.",
                "authors": [
                    {
                        "name": "Cao S."
                    },
                    {
                        "name": "Chang W."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Huo Y."
                    },
                    {
                        "name": "Ma Q."
                    },
                    {
                        "name": "Wan C."
                    },
                    {
                        "name": "Wang P."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "M3S: A comprehensive model selection for multi-modal single-cell RNA sequencing data"
            },
            "pmcid": "PMC6923906",
            "pmid": "31861972"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
