{
    "additionDate": "2017-08-03T18:57:09Z",
    "biotoolsCURIE": "biotools:qcut",
    "biotoolsID": "qcut",
    "credit": [
        {
            "email": "zhang@cse.wustl.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cs.utsa.edu/~jruan/"
        }
    ],
    "description": "Detect communities at a much finer scale or with a higher accuracy than other existing algorithms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cs.utsa.edu/~jruan/Software.html"
        }
    ],
    "editPermission": {
        "authors": [
            "kyang3"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://cs.utsa.edu/~jruan/Software.html",
    "lastUpdate": "2024-11-24T20:12:39.770742Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/qcut-hqcut-finding-communities-biology-networks.html"
        }
    ],
    "maturity": "Legacy",
    "name": "Qcut",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1103/physreve.77.016104",
            "metadata": {
                "abstract": "Community structure is an important property of complex networks. The automatic discovery of such structure is a fundamental task in many disciplines, including sociology, biology, engineering, and computer science. Recently, several community discovery algorithms have been proposed based on the optimization of a modularity function (Q). However, the problem of modularity optimization is NP-hard and the existing approaches often suffer from a prohibitively long running time or poor quality. Furthermore, it has been recently pointed out that algorithms based on optimizing Q will have a resolution limit; i.e., communities below a certain scale may not be detected. In this research, we first propose an efficient heuristic algorithm QCUT, which combines spectral graph partitioning and local search to optimize Q. Using both synthetic and real networks, we show that QCUT can find higher modularities and is more scalable than the existing algorithms. Furthermore, using QCUT as an essential component, we propose a recursive algorithm HQCUT to solve the resolution limit problem. We show that HQCUT can successfully detect communities at a much finer scale or with a higher accuracy than the existing algorithms. We also discuss two possible reasons that can cause the resolution limit problem and provide a method to distinguish them. Finally, we apply QCUT and HQCUT to study a protein-protein interaction network and show that the combination of the two algorithms can reveal interesting biological results that may be otherwise undetected. © 2008 The American Physical Society.",
                "authors": [
                    {
                        "name": "Ruan J."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 160,
                "date": "2008-01-14T00:00:00Z",
                "journal": "Physical Review E - Statistical, Nonlinear, and Soft Matter Physics",
                "title": "Identifying network communities with a high resolution"
            },
            "pmid": "18351912"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}
