{
    "additionDate": "2018-06-14T15:18:48Z",
    "biotoolsCURIE": "biotools:victor-virus",
    "biotoolsID": "victor-virus",
    "credit": [
        {
            "email": "jan.meier-kolthoff@dsmz.de",
            "name": "Jan Meier-Kolthoff",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Genome-based phylogeny and classification of prokaryotic viruses.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://ggdc.dsmz.de/faq.php#tabVICTOR"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://ggdc.dsmz.de/victor.php",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "VICTOR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx440",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press.Motivation: Bacterial and archaeal viruses are crucial for global biogeochemical cycles and might well be game-changing therapeutic agents in the fight against multi-resistant pathogens. Nevertheless, it is still unclear how to best use genome sequence data for a fast, universal and accurate taxonomic classification of such viruses.Results: We here present a novel in silico framework for phylogeny and classification of prokaryotic viruses, in line with the principles of phylogenetic systematics, and using a large reference dataset of officially classified viruses. The resulting trees revealed a high agreement with the classification. Except for low resolution at the family level, the majority of taxa was well supported as monophyletic. Clusters obtained with distance thresholds chosen for maximizing taxonomic agreement appeared phylogenetically reasonable, too. Analysis of an expanded dataset, containing >4000 genomes from public databases, revealed a large number of novel species, genera, subfamilies and families.Availability and implementation: The selected methods are available as the easy-to-use web service 'VICTOR' at https://victor.dsmz.de.Contact: jan.meier-kolthoff@dsmz.de.Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Meier-Kolthoff J.P."
                    },
                    {
                        "name": "Goker M."
                    }
                ],
                "citationCount": 138,
                "date": "2017-11-01T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "VICTOR: genome-based phylogeny and classification of prokaryotic viruses"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}