{
    "accessibility": "Open access",
    "additionDate": "2024-06-11T15:51:52.435107Z",
    "biotoolsCURIE": "biotools:alphafind",
    "biotoolsID": "alphafind",
    "cost": "Free of charge",
    "description": "AlphaFind is a web-based search engine that allows for structure-based search of the entire AlphaFold Protein Structure Database. Uniprot ID, PDB ID, or Gene Symbol is accepted as input – the engine will return the most similar proteins found within AlphaFold DB, with an option for additional search to extend and refine the results. The search results are grouped by their source organism and displayed along with several similarity metrics. 3D visualizations of the structural superposition of the proteins are provided, and text filters can be used to find specific organisms or Uniprot IDs. For details about the methodology and usage, please see the manual. This website is free and open to all users and there is no login requirement.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/Coda-Research-Group/AlphaFind/wiki/Manual"
        }
    ],
    "editPermission": {
        "authors": [
            "tslaninakova2"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Czech Republic"
    ],
    "elixirPlatform": [
        "Compute"
    ],
    "homepage": "https://alphafind.fi.muni.cz",
    "lastUpdate": "2024-11-24T13:55:27.242436Z",
    "link": [
        {
            "note": "Application URL",
            "type": [
                "Service"
            ],
            "url": "https://alphafind.fi.muni.cz/"
        }
    ],
    "name": "AlphaFind",
    "owner": "tslaninakova2",
    "publication": [
        {
            "doi": "10.1093/nar/gkae397",
            "metadata": {
                "abstract": "AlphaFind is a web-based search engine that provides fast structure-based retrieval in the entire set of AlphaFold DB structures. Unlike other protein processing tools, AlphaFind is focused entirely on tertiary structure, automatically extracting the main 3D features of each protein chain and using a machine learning model to find the most similar structures. This indexing approach and the 3D feature extraction method used by AlphaFind have both demonstrated remarkable scalability to large datasets as well as to large protein structures. The web application itself has been designed with a focus on clarity and ease of use. The searcher accepts any valid UniProt ID, Protein Data Bank ID or gene symbol as input, and returns a set of similar protein chains from AlphaFold DB, including various similarity metrics between the query and each of the retrieved results. In addition to the main search functionality, the application provides 3D visualizations of protein structure superpositions in order to allow researchers to instantly analyze the structural similarity of the retrieved results. The AlphaFind web application is available online for free and without any registration at https://alphafind.fi.muni.cz.",
                "authors": [
                    {
                        "name": "Antol M."
                    },
                    {
                        "name": "Cillik J."
                    },
                    {
                        "name": "Dohnal V."
                    },
                    {
                        "name": "Gresova K."
                    },
                    {
                        "name": "Janosova M."
                    },
                    {
                        "name": "Olha J."
                    },
                    {
                        "name": "Porubska J."
                    },
                    {
                        "name": "Prochazka D."
                    },
                    {
                        "name": "Rosinec A."
                    },
                    {
                        "name": "Slaninakova T."
                    },
                    {
                        "name": "Svobodova R."
                    }
                ],
                "date": "2024-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AlphaFind: Discover structure similarity across the proteome in AlphaFold DB"
            },
            "pmcid": "PMC11223785",
            "pmid": "38747341",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "version": [
        "1.0"
    ]
}
