{
    "additionDate": "2019-11-14T19:41:52Z",
    "biotoolsCURIE": "biotools:FARFAR2",
    "biotoolsID": "FARFAR2",
    "confidence_flag": "tool",
    "description": "Improved de novo Rosetta prediction of complex global RNA folds | ROSIE Rosetta server based on www.rosettacommons.org engine | Welcome to ROSIE Rosetta Online Server that Includes Everyone | Please cite the following article when referring to results from our ROSIE server: | Watkins, A. M.; Das, R. \"An automated and customizable RNA fragment assembly protocol in Rosetta. bioRxiv 223305; doi: https://doi.org/10.1101/223305",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://rosie.rosettacommons.org/farfar2/documentation"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0278"
                },
                {
                    "term": "Structured RNA prediction and optimisation",
                    "uri": "http://edamontology.org/operation_0483"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                }
            ]
        }
    ],
    "homepage": "https://rosie.rosettacommons.org/farfar2",
    "lastUpdate": "2020-12-28T17:26:43Z",
    "name": "FARFAR2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/764449"
        },
        {
            "doi": "10.1016/j.str.2020.05.011",
            "metadata": {
                "abstract": "© 2020 Elsevier LtdPredicting RNA three-dimensional structures from sequence could accelerate understanding of the growing number of RNA molecules being discovered across biology. Rosetta's Fragment Assembly of RNA with Full-Atom Refinement (FARFAR) has shown promise in community-wide blind RNA-Puzzle trials, but lack of a systematic and automated benchmark has left unclear what limits FARFAR performance. Here, we benchmark FARFAR2, an algorithm integrating RNA-Puzzle-inspired innovations with updated fragment libraries and helix modeling. In 16 of 21 RNA-Puzzles revisited without experimental data or expert intervention, FARFAR2 recovers native-like structures more accurate than models submitted during the RNA-Puzzles trials. Remaining bottlenecks include conformational sampling for >80-nucleotide problems and scoring function limitations more generally. Supporting these conclusions, preregistered blind models for adenovirus VA-I RNA and five riboswitch complexes predicted native-like folds with 3- to 14 Å root-mean-square deviation accuracies. We present a FARFAR2 webserver and three large model archives (FARFAR2-Classics, FARFAR2-Motifs, and FARFAR2-Puzzles) to guide future applications and advances. © 2020 Elsevier LtdWatkins et al. benchmark FARFAR2, an algorithm for RNA structure prediction that consolidates a decade of ad hoc strategies. FARFAR2 recovers native-like structures more accurately than original challenge submissions for 16 of 21 RNA-Puzzles and achieves native-like preregistered blind predictions for adenovirus VA-I RNA and five riboswitch complexes.",
                "authors": [
                    {
                        "name": "Watkins A.M."
                    },
                    {
                        "name": "Rangan R."
                    },
                    {
                        "name": "Das R."
                    }
                ],
                "citationCount": 12,
                "date": "2020-08-04T00:00:00Z",
                "journal": "Structure",
                "title": "FARFAR2: Improved De Novo Rosetta Prediction of Complex Global RNA Folds"
            },
            "pmcid": "PMC7415647",
            "pmid": "32531203"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}