{
    "accessibility": "Open access",
    "additionDate": "2019-07-04T07:51:29Z",
    "biotoolsCURIE": "biotools:GenePy",
    "biotoolsID": "GenePy",
    "cost": "Free of charge",
    "description": "Score for estimating gene pathogenicity in individuals using next-generation sequencing data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/UoS-HGIG/GenePy/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/UoS-HGIG/GenePy",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/UoS-HGIG/GenePy/issues"
        }
    ],
    "maturity": "Mature",
    "name": "GenePy",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2877-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Next-generation sequencing is revolutionising diagnosis and treatment of rare diseases, however its application to understanding common disease aetiology is limited. Rare disease applications binarily attribute genetic change(s) at a single locus to a specific phenotype. In common diseases, where multiple genetic variants within and across genes contribute to disease, binary modelling cannot capture the burden of pathogenicity harboured by an individual across a given gene/pathway. We present GenePy, a novel gene-level scoring system for integration and analysis of next-generation sequencing data on a per-individual basis that transforms NGS data interpretation from variant-level to gene-level. This simple and flexible scoring system is intuitive and amenable to integration for machine learning, network and topological approaches, facilitating the investigation of complex phenotypes. Results: Whole-exome sequencing data from 508 individuals were used to generate GenePy scores. For each variant a score is calculated incorporating: i) population allele frequency estimates; ii) individual zygosity, determined through standard variant calling pipelines and; iii) any user defined deleteriousness metric to inform on functional impact. GenePy then combines scores generated for all variants observed into a single gene score for each individual. We generated a matrix of ~ 14,000 GenePy scores for all individuals for each of sixteen popular deleteriousness metrics. All per-gene scores are corrected for gene length. The majority of genes generate GenePy scores < 0.01 although individuals harbouring multiple rare highly deleterious mutations can accumulate extremely high GenePy scores. In the absence of a comparator metric, we examine GenePy performance in discriminating genes known to be associated with three common, complex diseases. A Mann-Whitney U test conducted on GenePy scores for this positive control gene in cases versus controls demonstrates markedly more significant results (p = 1.37 × 10- 4) compared to the most commonly applied association tool that combines common and rare variation (p = 0.003). Conclusions: Per-gene per-individual GenePy scores are intuitive when assessing genetic variation in individual patients or comparing scores between groups. GenePy outperforms the currently accepted best practice tools for combining common and rare variation. GenePy scores are suitable for downstream data integration with transcriptomic and proteomic data that also report at the gene level.",
                "authors": [
                    {
                        "name": "Ashton J.J."
                    },
                    {
                        "name": "Beattie R.M."
                    },
                    {
                        "name": "Ennis S."
                    },
                    {
                        "name": "MacArthur B.D."
                    },
                    {
                        "name": "Mossotto E."
                    },
                    {
                        "name": "O'Gorman L."
                    },
                    {
                        "name": "Pengelly R.J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-05-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "GenePy - A score for estimating gene pathogenicity in individuals using next-generation sequencing data"
            },
            "pmcid": "PMC6524327",
            "pmid": "31096927",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}
