{
    "additionDate": "2021-01-18T07:38:59Z",
    "biotoolsCURIE": "biotools:epivia",
    "biotoolsID": "epivia",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "vahedi@pennmedicine.upenn.edu",
            "name": "Golnaz Vahedi",
            "typeEntity": "Person"
        }
    ],
    "description": "EpiVIA is joint profiling of chromatin accessibility and CAR-T integration site analysis at population and single-cell levels. EpiVIA parses each read and identifies the chimeric fragments, which are further classified into different categories based on how the read pair is aligned to the combined reference genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VahediLab/epiVIA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T08:37:29Z",
    "name": "EpiVIA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1073/PNAS.1919259117",
            "metadata": {
                "abstract": "© 2020 National Academy of Sciences. All rights reserved.Chimeric antigen receptor (CAR)-T immunotherapy has yielded impressive results in several B cell malignancies, establishing itself as a powerful means to redirect the natural properties of T lymphocytes. In this strategy, the T cell genome is modified by the integration of lentiviral vectors encoding CAR that direct tumor cell killing. However, this therapeutic approach is often limited by the extent of CAR-T cell expansion in vivo. A major outstanding question is whether or not CAR-T integration itself enhances the proliferative competence of individual T cells by rewiring their regulatory landscape. To address this question, it is critical to define the identity of an individual CAR-T cell and simultaneously chart where the CAR-T vector integrates into the genome. Here, we report the development of a method called EpiVIA (https://github.com/VahediLab/epiVIA) for the joint profiling of the chromatin accessibility and lentiviral integration site analysis at the population and single-cell levels. We validate our technique in clonal cells with previously defined integration sites and further demonstrate the ability to measure lentiviral integration sites and chromatin accessibility of host and viral genomes at the single-cell resolution in CAR-T cells. We anticipate that EpiVIA will enable the single-cell deconstruction of gene regulation during CAR-T therapy, leading to the discovery of cellular factors associated with durable treatment.",
                "authors": [
                    {
                        "name": "Cattau B."
                    },
                    {
                        "name": "Fasolino M."
                    },
                    {
                        "name": "Fraietta J.A."
                    },
                    {
                        "name": "Frederick M.A."
                    },
                    {
                        "name": "Goldman N."
                    },
                    {
                        "name": "Kiani K."
                    },
                    {
                        "name": "Kong W."
                    },
                    {
                        "name": "McCright S.J."
                    },
                    {
                        "name": "Vahedi G."
                    },
                    {
                        "name": "Wang W."
                    }
                ],
                "citationCount": 7,
                "date": "2020-03-10T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Joint profiling of chromatin accessibility and CAR-T integration site analysis at population and single-cell levels"
            },
            "pmcid": "PMC7071901",
            "pmid": "32094195"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        }
    ]
}
