{
    "additionDate": "2021-09-27T07:34:41.252220Z",
    "biotoolsCURIE": "biotools:icpagdb",
    "biotoolsID": "icpagdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dennis.ko@duke.edu",
            "name": "Dennis C. Ko",
            "orcidid": "https://orcid.org/0000-0002-0113-5981",
            "typeEntity": "Person"
        }
    ],
    "description": "iCPAGdb is an atlas connecting shared genetic architecture of human diseases and molecular phenotypes provides insight into COVID-19 susceptibility.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                }
            ]
        }
    ],
    "homepage": "http://cpag.oit.duke.edu/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-09-27T07:34:41.254952Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/tbalmat/iCPAGdb/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/tbalmat/iCPAGdb"
        }
    ],
    "name": "iCPAGdb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13073-021-00904-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: While genome-wide associations studies (GWAS) have successfully elucidated the genetic architecture of complex human traits and diseases, understanding mechanisms that lead from genetic variation to pathophysiology remains an important challenge. Methods are needed to systematically bridge this crucial gap to facilitate experimental testing of hypotheses and translation to clinical utility. Results: Here, we leveraged cross-phenotype associations to identify traits with shared genetic architecture, using linkage disequilibrium (LD) information to accurately capture shared SNPs by proxy, and calculate significance of enrichment. This shared genetic architecture was examined across differing biological scales through incorporating data from catalogs of clinical, cellular, and molecular GWAS. We have created an interactive web database (interactive Cross-Phenotype Analysis of GWAS database (iCPAGdb)) to facilitate exploration and allow rapid analysis of user-uploaded GWAS summary statistics. This database revealed well-known relationships among phenotypes, as well as the generation of novel hypotheses to explain the pathophysiology of common diseases. Application of iCPAGdb to a recent GWAS of severe COVID-19 demonstrated unexpected overlap of GWAS signals between COVID-19 and human diseases, including with idiopathic pulmonary fibrosis driven by the DPP9 locus. Transcriptomics from peripheral blood of COVID-19 patients demonstrated that DPP9 was induced in SARS-CoV-2 compared to healthy controls or those with bacterial infection. Further investigation of cross-phenotype SNPs associated with both severe COVID-19 and other human traits demonstrated colocalization of the GWAS signal at the ABO locus with plasma protein levels of a reported receptor of SARS-CoV-2, CD209 (DC-SIGN). This finding points to a possible mechanism whereby glycosylation of CD209 by ABO may regulate COVID-19 disease severity. Conclusions: Thus, connecting genetically related traits across phenotypic scales links human diseases to molecular and cellular measurements that can reveal mechanisms and lead to novel biomarkers and therapeutic approaches. The iCPAGdb web portal is accessible at http://cpag.oit.duke.edu and the software code at https://github.com/tbalmat/iCPAGdb.",
                "authors": [
                    {
                        "name": "Antonia A.L."
                    },
                    {
                        "name": "Balmat T.J."
                    },
                    {
                        "name": "Burke T.W."
                    },
                    {
                        "name": "Constantine F.J."
                    },
                    {
                        "name": "DeLong M.R."
                    },
                    {
                        "name": "Ginsburg G.S."
                    },
                    {
                        "name": "Hauser E.R."
                    },
                    {
                        "name": "Henao R."
                    },
                    {
                        "name": "Ingham A."
                    },
                    {
                        "name": "Ko D.C."
                    },
                    {
                        "name": "Ko E.R."
                    },
                    {
                        "name": "McClain M.T."
                    },
                    {
                        "name": "Shen X."
                    },
                    {
                        "name": "Tsalik E.L."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Woods C.W."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "An atlas connecting shared genetic architecture of human diseases and molecular phenotypes provides insight into COVID-19 susceptibility"
            },
            "pmcid": "PMC8127495",
            "pmid": "34001247"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
