{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:11:28Z",
    "biotoolsCURIE": "biotools:deepDR",
    "biotoolsID": "deepDR",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chengf@ccf.org",
            "name": "Feixiong Cheng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Network-based deep learning approach to in silico drug repositioning.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ChengF-Lab/deepDR/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChengF-Lab/deepDR",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2024-11-24T21:02:12.043047Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ChengF-Lab/deepDR/issues"
        }
    ],
    "maturity": "Mature",
    "name": "deepDR",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz418",
            "metadata": {
                "abstract": "Motivation: Traditional drug discovery and development are often time-consuming and high risk. Repurposing/repositioning of approved drugs offers a relatively low-cost and high-efficiency approach toward rapid development of efficacious treatments. The emergence of large-scale, heterogeneous biological networks has offered unprecedented opportunities for developing in silico drug repositioning approaches. However, capturing highly non-linear, heterogeneous network structures by most existing approaches for drug repositioning has been challenging. Results: In this study, we developed a network-based deep-learning approach, termed deepDR, for in silico drug repurposing by integrating 10 networks: one drug-disease, one drug-side-effect, one drug-target and seven drug-drug networks. Specifically, deepDR learns high-level features of drugs from the heterogeneous networks by a multi-modal deep autoencoder. Then the learned low-dimensional representation of drugs together with clinically reported drug-disease pairs are encoded and decoded collectively via a variational autoencoder to infer candidates for approved drugs for which they were not originally approved. We found that deepDR revealed high performance [the area under receiver operating characteristic curve (AUROC) = 0.908], outperforming conventional network-based or machine learning-based approaches. Importantly, deepDR-predicted drug-disease associations were validated by the ClinicalTrials.gov database (AUROC = 0.826) and we showcased several novel deepDR-predicted approved drugs for Alzheimer's disease (e.g. risperidone and aripiprazole) and Parkinson's disease (e.g. methylphenidate and pergolide).",
                "authors": [
                    {
                        "name": "Cheng F."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Nussinov R."
                    },
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Zhu S."
                    }
                ],
                "citationCount": 355,
                "date": "2019-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepDR: A network-based deep learning approach to in silico drug repositioning"
            },
            "pmcid": "PMC6954645",
            "pmid": "31116390",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ],
    "validated": 1
}
