{
    "accessibility": "Open access",
    "additionDate": "2022-09-03T22:11:50.365539Z",
    "biotoolsCURIE": "biotools:rresolver",
    "biotoolsID": "rresolver",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ibirol@bcgsc.ca",
            "name": "Inanç Birol",
            "typeEntity": "Person"
        },
        {
            "name": "Amirhossein Afshinfard"
        },
        {
            "name": "René L. Warren"
        },
        {
            "name": "Vladimir Nikolić"
        }
    ],
    "description": "Efficient short-read repeat resolution within ABySS.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bcgsc/abyss/tree/master/RResolver",
    "lastUpdate": "2022-09-03T22:11:50.368732Z",
    "license": "Not licensed",
    "name": "RResolver",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-04790-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: De novo genome assembly is essential to modern genomics studies. As it is not biased by a reference, it is also a useful method for studying genomes with high variation, such as cancer genomes. De novo short-read assemblers commonly use de Bruijn graphs, where nodes are sequences of equal length k, also known as k-mers. Edges in this graph are established between nodes that overlap by k- 1 bases, and nodes along unambiguous walks in the graph are subsequently merged. The selection of k is influenced by multiple factors, and optimizing this value results in a trade-off between graph connectivity and sequence contiguity. Ideally, multiple k sizes should be used, so lower values can provide good connectivity in lesser covered regions and higher values can increase contiguity in well-covered regions. However, current approaches that use multiple k values do not address the scalability issues inherent to the assembly of large genomes. Results: Here we present RResolver, a scalable algorithm that takes a short-read de Bruijn graph assembly with a starting k as input and uses a k value closer to that of the read length to resolve repeats. RResolver builds a Bloom filter of sequencing reads which is used to evaluate the assembly graph path support at branching points and removes paths with insufficient support. RResolver runs efficiently, taking only 26 min on average for an ABySS human assembly with 48 threads and 60 GiB memory. Across all experiments, compared to a baseline assembly, RResolver improves scaffold contiguity (NGA50) by up to 15% and reduces misassemblies by up to 12%. Conclusions: RResolver adds a missing component to scalable de Bruijn graph genome assembly. By improving the initial and fundamental graph traversal outcome, all downstream ABySS algorithms greatly benefit by working with a more accurate and less complex representation of the genome. The RResolver code is integrated into ABySS and is available at https://github.com/bcgsc/abyss/tree/master/RResolver.",
                "authors": [
                    {
                        "name": "Afshinfard A."
                    },
                    {
                        "name": "Birol I."
                    },
                    {
                        "name": "Chu J."
                    },
                    {
                        "name": "Coombe L."
                    },
                    {
                        "name": "Nikolic V."
                    },
                    {
                        "name": "Nip K.M."
                    },
                    {
                        "name": "Warren R.L."
                    },
                    {
                        "name": "Wong J."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RResolver: efficient short-read repeat resolution within ABySS"
            },
            "pmcid": "PMC9215042",
            "pmid": "35729491"
        }
    ],
    "relation": [
        {
            "biotoolsID": "abyss",
            "type": "uses"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
