
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www2.math.umd.edu/~lmendelo/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/LeeMendelowitz/maligner/blob/master/README.md"
        },
        {
            "type": "GENERAL",
            "url": "https://github.com/LeeMendelowitz/maligner/wiki"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Nucleic acids",
                "uri": "http://edamontology.org/topic_0077"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/maligner-fast-ordered-restriction-map-aligner.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: The Optical Mapping System discovers structural variants and potentiates sequence assembly of genomes via scaffolding and comparisons that globally validate or correct sequence assemblies. Despite its utility, there are few publicly available tools for aligning optical mapping datasets. Results: Here we present software, named 'Maligner', for the alignment of both single molecule restriction maps (Rmaps) and in silico restriction maps of sequence contigs to a reference. Maligner provides two modes of alignment: an efficient, sensitive dynamic programming implementation that scales to large eukaryotic genomes, and a faster indexed based implementation for finding alignments with unmatched sites in the reference but not the query. We compare our software to other publicly available tools on Rmap datasets and show that Maligner finds more correct alignments in comparable runtime. Lastly, we introduce the M-Score statistic for normalizing alignment scores across restriction maps and demonstrate its utility for selecting high quality alignments.",
            "authors": [
                "Mendelowitz L.M.",
                "Schwartz D.C.",
                "Pop M."
            ],
            "cit_count": 3,
            "journal": "Bioinformatics",
            "pmid": "26637292",
            "title": "Maligner: A fast ordered restriction map aligner",
            "year": "2016-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:maligner",
        "biotoolsID": "maligner",
        "description": "Tool for aligning molecular or insilico restriction maps to a reference map.",
        "homepage": "https://github.com/LeeMendelowitz/maligner",
        "name": "Maligner"
    }
}