{
    "additionDate": "2021-01-18T08:41:08Z",
    "biotoolsCURIE": "biotools:fastsk",
    "biotoolsID": "fastsk",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qiyanjun2012@gmail.com",
            "name": "Yanjun Qi",
            "typeEntity": "Person"
        }
    ],
    "description": "FastSK is a tool for fast sequence analysis using gapped string kernels.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA binding site prediction",
                    "uri": "http://edamontology.org/operation_3903"
                },
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QData/FastSK",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:39:32.649679Z",
    "license": "Apache-2.0",
    "name": "FastSK",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa817",
            "metadata": {
                "abstract": "Motivation: Gapped k-mer kernels with support vector machines (gkm-SVMs) have achieved strong predictive performance on regulatory DNA sequences on modestly sized training sets. However, existing gkm-SVM algorithms suffer from slow kernel computation time, as they depend exponentially on the sub-sequence feature length, number of mismatch positions, and the task's alphabet size. Results: In this work, we introduce a fast and scalable algorithm for calculating gapped k-mer string kernels. Our method, named FastSK, uses a simplified kernel formulation that decomposes the kernel calculation into a set of independent counting operations over the possible mismatch positions. This simplified decomposition allows us to devise a fast Monte Carlo approximation that rapidly converges. FastSK can scale to much greater feature lengths, allows us to consider more mismatches, and is performant on a variety of sequence analysis tasks. On multiple DNA transcription factor binding site prediction datasets, FastSK consistently matches or outperforms the state-of-the-art gkmSVM-2.0 algorithms in area under the ROC curve, while achieving average speedups in kernel computation of ∼100x and speedups of ∼800x for large feature lengths. We further show that FastSK outperforms character-level recurrent and convolutional neural networks while achieving low variance. We then extend FastSK to 7 English-language medical named entity recognition datasets and 10 protein remote homology detection datasets. FastSK consistently matches or outperforms these baselines.",
                "authors": [
                    {
                        "name": "Blakely D."
                    },
                    {
                        "name": "Collins E."
                    },
                    {
                        "name": "Lanchantin J."
                    },
                    {
                        "name": "Norton A."
                    },
                    {
                        "name": "Qi Y."
                    },
                    {
                        "name": "Singh R."
                    }
                ],
                "citationCount": 5,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "FastSK: Fast sequence analysis with gapped string kernels"
            },
            "pmid": "33381828",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1101/2020.04.21.053975",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
