{
    "additionDate": "2023-02-19T11:54:55.712111Z",
    "biotoolsCURIE": "biotools:finn",
    "biotoolsID": "finn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Alireza Gharabaghi"
        }
    ],
    "description": "Find Neuropyhsiological Networks (FiNN). A Python Toolbox for the analysis of electrophysiological data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/neurophysiological-analysis/FiNN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:59:46.065959Z",
    "license": "GPL-3.0",
    "name": "FiNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1002/hbm.26190",
            "metadata": {
                "abstract": "Neural communication across different spatial and temporal scales is a topic of great interest in clinical and basic science. Phase-amplitude coupling (PAC) has attracted particular interest due to its functional role in a wide range of cognitive and motor functions. Here, we introduce a novel measure termed the direct modulation index (dMI). Based on the classical modulation index, dMI provides an estimate of PAC that is (1) bound to an absolute interval between 0 and +1, (2) resistant against noise, and (3) reliable even for small amounts of data. To highlight the properties of this newly-proposed measure, we evaluated dMI by comparing it to the classical modulation index, mean vector length, and phase-locking value using simulated data. We ascertained that dMI provides a more accurate estimate of PAC than the existing methods and that is resilient to varying noise levels and signal lengths. As such, dMI permits a reliable investigation of PAC, which may reveal insights crucial to our understanding of functional brain architecture in key contexts such as behaviour and cognition. A Python toolbox that implements dMI and other measures of PAC is freely available at https://github.com/neurophysiological-analysis/FiNN.",
                "authors": [
                    {
                        "name": "Gharabaghi A."
                    },
                    {
                        "name": "Guggenberger R."
                    },
                    {
                        "name": "Milosevic L."
                    },
                    {
                        "name": "Scherer M."
                    },
                    {
                        "name": "Wang T."
                    }
                ],
                "citationCount": 1,
                "date": "2023-04-01T00:00:00Z",
                "journal": "Human Brain Mapping",
                "title": "Direct modulation index: A measure of phase amplitude coupling for neurophysiology data"
            },
            "pmcid": "PMC9980882",
            "pmid": "36579658"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
