{
    "additionDate": "2020-01-09T18:33:29Z",
    "biotoolsCURIE": "biotools:ICG_videoangiography_FNa_videoangiography",
    "biotoolsID": "ICG_videoangiography_FNa_videoangiography",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "neuropub@barrowneuro.org",
            "name": "Peter Nakaji",
            "typeEntity": "Person"
        }
    ],
    "description": "Application of Fluorescein Fluorescence in Vascular Neurosurgery.\n\nBackground: Fluorescein sodium (FNa) is a fluorescent drug with a long history of use for assessing retinal blood flow in ophthalmology; however, its application in vascular neurosurgery is only now gaining popularity. This review summarizes the current knowledge about using FNa videoangiography in vascular neurosurgery. Methods: We performed a literature review on the usage of FNa for fluorescent videoangiography procedures in neurosurgery. We analyzed methods of injection, dosages of FNa, visualizing platforms, and interpretation of FNa videoangiography. We also reviewed practical applications of FNa videoangiography during various vascular neurosurgeries.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'videoangiography FNa videoangiography', 'FNa videoangiography', 'ICG videoangiography FNa', 'videoangiography'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31620443",
    "lastUpdate": "2020-01-09T18:33:29Z",
    "name": "ICG videoangiography FNa videoangiography",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FSURG.2019.00052",
            "metadata": {
                "abstract": "© Copyright © 2019 Zhao, Belykh, Cavallo, Valli, Gandhi, Preul, Vajkoczy, Lawton and Nakaji.Background: Fluorescein sodium (FNa) is a fluorescent drug with a long history of use for assessing retinal blood flow in ophthalmology; however, its application in vascular neurosurgery is only now gaining popularity. This review summarizes the current knowledge about using FNa videoangiography in vascular neurosurgery. Methods: We performed a literature review on the usage of FNa for fluorescent videoangiography procedures in neurosurgery. We analyzed methods of injection, dosages of FNa, visualizing platforms, and interpretation of FNa videoangiography. We also reviewed practical applications of FNa videoangiography during various vascular neurosurgeries. Results: FNa videoangiography can be performed with intraarterial (intracarotid) or intravenous dye injections. Both methods provide excellent resolution with enhanced fluorescence that shows intravascular blood flow on top of visible surrounding anatomy, and both allow simultaneous purposeful microsurgical manipulations. Although it is invasive, an intracarotid FNa injection results in faster contrast appearance and higher-intensity fluorescence and requires a lower dose per injection (reported range, 1–50 mg) compared with peripheral intravenous FNa injection (reported range, 75–2,000 mg or 1–1.5 mg/kg body weight). Four optical excitation/detection tools for FNa videoangiography have been successfully used: conventional xenon-light operating microscope with a special filter set, pencil-type light-emitting diode probe with a filter set, laser-illumination operating microscope, and an endoscope with a filter set. FNa videoangiography was reported to be feasible and useful in various clinical scenarios, such as examining the feeders and drainers in arteriovenous malformation surgery, checking the patency of a microvascular anastomosis, and assessing blood flow during aneurysm clipping. FNa videoangiography can be repeated during the same procedure and used along with indocyanine green (ICG) videoangiography. Conclusions: Compared with ICG videoangiography, FNa videoangiography has the advantages of enabling real-time inspection and better visualization at deep locations; however, thick vessel walls limit visualization of FNa in larger vessels. FNa videoangiography is a useful tool in multiple neurovascular scenarios and merits further studies to establish its clinical value.",
                "authors": [
                    {
                        "name": "Zhao X."
                    },
                    {
                        "name": "Belykh E."
                    },
                    {
                        "name": "Cavallo C."
                    },
                    {
                        "name": "Valli D."
                    },
                    {
                        "name": "Gandhi S."
                    },
                    {
                        "name": "Preul M.C."
                    },
                    {
                        "name": "Vajkoczy P."
                    },
                    {
                        "name": "Lawton M.T."
                    },
                    {
                        "name": "Nakaji P."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-18T00:00:00Z",
                "journal": "Frontiers in Surgery",
                "title": "Application of Fluorescein Fluorescence in Vascular Neurosurgery"
            },
            "pmcid": "PMC6759993",
            "pmid": "31620443"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ]
}