
{
    "credit": [
        {
            "email": "gunnar.klau@cwi.nl",
            "name": "Gunnar W. Klau",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://homepages.cwi.nl/~klau/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/ls-cwi/heinz/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/heinz-xheinz-single-cross-species-module-discovery.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Motivation: Integrative network analysis methods provide robust interpretations of differential high-throughput molecular profile measurements. They are often used in a biomedical context - to generate novel hypotheses about the underlying cellular processes or to derive biomarkers for classification and subtyping. The underlying molecular profiles are frequently measured and validated on animal or cellular models. Therefore the results are not immediately transferable to human. In particular, this is also the case in a study of the recently discovered interleukin-17 producing helper T cells (Th17), which are fundamental for anti-microbial immunity but also known to contribute to autoimmune diseases. Results: We propose a mathematical model for finding active subnetwork modules that are conserved between two species. These are sets of genes, one for each species, which (i) induce a connected subnetwork in a species-specific interaction network, (ii) show overall differential behavior and (iii) contain a large number of orthologous genes. We propose a flexible notion of conservation, which turns out to be crucial for the quality of the resulting modules in terms of biological interpretability. We propose an algorithm that finds provably optimal or near-optimal conserved active modules in our model. We apply our algorithm to understand the mechanisms underlying Th17 T cell differentiation in both mouse and human. As a main biological result, we find that the key regulation of Th17 differentiation is conserved between human and mouse.",
            "authors": [
                "El-Kebir M.",
                "Soueidan H.",
                "Hume T.",
                "Beisser D.",
                "Dittrich M.",
                "Muller T.",
                "Blin G.",
                "Heringa J.",
                "Nikolski M.",
                "Wessels L.F.A.",
                "Klau G.W."
            ],
            "cit_count": 1,
            "journal": "Bioinformatics",
            "pmid": "26023104",
            "title": "XHeinz: An algorithm for mining cross-species network modules under a flexible conservation model",
            "year": "2015-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:heinz",
        "biotoolsID": "heinz",
        "description": "Tool for single-species active module discovery.",
        "homepage": "https://software.cwi.nl/software/heinz",
        "name": "Heinz"
    }
}