{
    "additionDate": "2025-05-15T11:35:23.428773Z",
    "biotoolsCURIE": "biotools:plantismash",
    "biotoolsID": "plantismash",
    "description": "PlantiSMASH is a specialized extension of antiSMASH for the identification and analysis of biosynthetic gene clusters (BGCs) in plant genomes. It supports advanced plant-specific detection rules and features for comparative genomics, visualization, and more.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://plantismash.github.io/documentation/"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://github.com/plantismash/plantismash/releases",
            "version": "2.0-beta4"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://plantismash.bioinformatics.nl/",
    "lastUpdate": "2025-05-19T08:49:45.958175Z",
    "license": "AGPL-3.0",
    "name": "plantiSMASH",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "elenadelpup",
    "publication": [
        {
            "doi": "10.1093/nar/gkx305",
            "metadata": {
                "abstract": "Plant specialized metabolites are chemically highly diverse, play key roles in host-microbe interactions, have important nutritional value in crops and are frequently applied as medicines. It has recently become clear that plant biosynthetic pathway-encoding genes are sometimes densely clustered in specific genomic loci: Biosynthetic gene clusters (BGCs). Here, we introduce plantiSMASH, a versatile online analysis platform that automates the identification of candidate plant BGCs. Moreover, it allows integration of transcriptomic data to prioritize candidate BGCs based on the coexpression patterns of predicted biosynthetic enzyme-coding genes, and facilitates comparative genomic analysis to study the evolutionary conservation of each cluster. Applied on 48 high-quality plant genomes, plantiSMASH identifies a rich diversity of candidate plant BGCs. These results will guide further experimental exploration of the nature and dynamics of gene clustering in plant metabolism. Moreover, spurred by the continuing decrease in costs of plant genome sequencing, they will allow genome mining technologies to be applied to plant natural product discovery.",
                "authors": [
                    {
                        "name": "Blin K."
                    },
                    {
                        "name": "Kautsar S.A."
                    },
                    {
                        "name": "Medema M.H."
                    },
                    {
                        "name": "Osbourn A."
                    },
                    {
                        "name": "Suarez Duran H.G."
                    }
                ],
                "citationCount": 214,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PlantiSMASH: Automated identification, annotation and expression analysis of plant biosynthetic gene clusters"
            },
            "pmcid": "PMC5570173"
        }
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Functional genomics",
            "uri": "http://edamontology.org/topic_0085"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "version": [
        "2.0-beta4"
    ]
}
