{
    "additionDate": "2021-01-18T11:54:15Z",
    "biotoolsCURIE": "biotools:firm-avp",
    "biotoolsID": "firm-avp",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bj@pnnl.gov",
            "name": "Bobbie-Jo M. Webb-Robertson",
            "typeEntity": "Person"
        }
    ],
    "description": "FIRM-AVP is a tool for antiviral peptide prediction. It is used for better understanding and prediction of antiviral peptides through primary and secondary structure feature importance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                }
            ]
        }
    ],
    "homepage": "https://msc-viz.emsl.pnnl.gov/AVPR",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-11T09:09:41Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pmartR/FIRM-AVP"
        }
    ],
    "name": "FIRM-AVP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41598-020-76161-8",
            "metadata": {
                "abstract": "© 2020, The Author(s).The emergence of viral epidemics throughout the world is of concern due to the scarcity of available effective antiviral therapeutics. The discovery of new antiviral therapies is imperative to address this challenge, and antiviral peptides (AVPs) represent a valuable resource for the development of novel therapies to combat viral infection. We present a new machine learning model to distinguish AVPs from non-AVPs using the most informative features derived from the physicochemical and structural properties of their amino acid sequences. To focus on those features that are most likely to contribute to antiviral performance, we filter potential features based on their importance for classification. These feature selection analyses suggest that secondary structure is the most important peptide sequence feature for predicting AVPs. Our Feature-Informed Reduced Machine Learning for Antiviral Peptide Prediction (FIRM-AVP) approach achieves a higher accuracy than either the model with all features or current state-of-the-art single classifiers. Understanding the features that are associated with AVP activity is a core need to identify and design new AVPs in novel systems. The FIRM-AVP code and standalone software package are available at https://github.com/pmartR/FIRM-AVP with an accompanying web application at https://msc-viz.emsl.pnnl.gov/AVPR.",
                "authors": [
                    {
                        "name": "Chowdhury A.S."
                    },
                    {
                        "name": "Reehl S.M."
                    },
                    {
                        "name": "Kehn-Hall K."
                    },
                    {
                        "name": "Bishop B."
                    },
                    {
                        "name": "Webb-Robertson B.-J.M."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Better understanding and prediction of antiviral peptides through primary and secondary structure feature importance"
            },
            "pmcid": "PMC7648056",
            "pmid": "33159146"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}