{
    "additionDate": "2018-07-29T08:37:52Z",
    "biotoolsCURIE": "biotools:mvqtlcim",
    "biotoolsID": "mvqtlcim",
    "credit": [
        {
            "email": "fenxiangliu@hotmail.com",
            "name": "Fenxiang Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "tongchf@njfu.edu.cn",
            "name": "Chunfa Tong",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CIM QTL mapping via multivariate statistical method in an outbred full-sib family.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/tongchf/mvqtlcim"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tongchf/mvqtlcim",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "MVQTLCIM",
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1908-1",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: With the plummeting cost of the next-generation sequencing technologies, high-density genetic linkage maps could be constructed in a forest hybrid F1 population. However, based on such genetic maps, quantitative trait loci (QTL) mapping cannot be directly conducted with traditional statistical methods or tools because the linkage phase and segregation pattern of molecular markers are not always fixed as in inbred lines. Results: We implemented the traditional composite interval mapping (CIM) method to multivariate trait data in forest trees and developed the corresponding software, mvqtlcim. Our method not only incorporated the various segregations and linkage phases of molecular markers, but also applied Takeuchi's information criterion (TIC) to discriminate the QTL segregation type among several possible alternatives. QTL mapping was performed in a hybrid F1 population of Populus deltoides and P. simonii, and 12 QTLs were detected for tree height over 6 time points. The software package allowed many options for parameters as well as parallel computing for permutation tests. The features of the software were demonstrated with the real data analysis and a large number of Monte Carlo simulations. Conclusions: We provided a powerful tool for QTL mapping of multiple or longitudinal traits in an outbred F1 population, in which the traditional software for QTL mapping cannot be used. This tool will facilitate studying of QTL mapping and thus will accelerate molecular breeding programs especially in forest trees. The tool package is freely available from https://github.com/tongchf/mvqtlcim.",
                "authors": [
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Tong C."
                    },
                    {
                        "name": "Tao S."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Yao D."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Shi J."
                    }
                ],
                "citationCount": 6,
                "date": "2017-11-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MVQTLCIM: Composite interval mapping of multivariate traits in a hybrid F1 population of outbred species"
            },
            "pmcid": "PMC5701343",
            "pmid": "29169342"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}