{
    "additionDate": "2019-11-14T18:42:24Z",
    "biotoolsCURIE": "biotools:Dysdera",
    "biotoolsID": "Dysdera",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elsanchez@ub.edu",
            "name": "Alejandro Sánchez-Gracia",
            "orcidid": "https://orcid.org/0000-0003-4543-4577",
            "typeEntity": "Person"
        },
        {
            "email": "jrozas@ub.edu",
            "name": "Julio Rozas",
            "orcidid": "https://orcid.org/0000-0002-6839-9148",
            "typeEntity": "Person"
        }
    ],
    "description": "Scripts used during the genome assembly of Dysdera silvatica.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                }
            ]
        }
    ],
    "homepage": "https://github.com/molevol-ub/Dysdera_silvatica_genome",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2021-01-09T14:58:37Z",
    "license": "MIT",
    "name": "Dysdera silvatica genome",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GIGASCIENCE/GIZ099",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.We present the draft genome sequence of Dysdera silvatica, a nocturnal ground-dwelling spider from a genus that has undergone a remarkable adaptive radiation in the Canary Islands. Results: The draft assembly was obtained using short (Illumina) and long (PaciBio and Nanopore) sequencing reads. Our de novo assembly (1.36 Gb), which represents 80% of the genome size estimated by flow cytometry (1.7 Gb), is constituted by a high fraction of interspersed repetitive elements (53.8%). The assembly completeness, using BUSCO and core eukaryotic genes, ranges from 90% to 96%. Functional annotations based on both ab initio and evidence-based information (including D. silvatica RNA sequencing) yielded a total of 48,619 protein-coding sequences, of which 36,398 (74.9%) have the molecular hallmark of known protein domains, or sequence similarity with Swiss-Prot sequences. The D. silvatica assembly is the first representative of the superfamily Dysderoidea, and just the second available genome of Synspermiata, one of the major evolutionary lineages of the \"true spiders\" (Araneomorphae). Conclusions: Dysderoids, which are known for their numerous instances of adaptation to underground environments, include some of the few examples of trophic specialization within spiders and are excellent models for the study of cryptic female choice. This resource will be therefore useful as a starting point to study fundamental evolutionary and functional questions, including the molecular bases of the adaptation to extreme environments and ecological shifts, as well of the origin and evolution of relevant spider traits, such as the venom and silk.",
                "authors": [
                    {
                        "name": "Arnedo M.A."
                    },
                    {
                        "name": "Escuer P."
                    },
                    {
                        "name": "Frias-Lopez C."
                    },
                    {
                        "name": "Hinojosa-Alvarez S."
                    },
                    {
                        "name": "Rozas J."
                    },
                    {
                        "name": "Sanchez-Gracia A."
                    },
                    {
                        "name": "Sanchez-Herrero J.F."
                    }
                ],
                "citationCount": 9,
                "date": "2019-08-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "The draft genome sequence of the spider Dysdera silvatica (Araneae, Dysderidae): A valuable resource for functional and evolutionary genomic studies in chelicerates"
            },
            "pmcid": "PMC6701490",
            "pmid": "31430368"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
