{
    "additionDate": "2019-11-14T19:46:19Z",
    "biotoolsCURIE": "biotools:WALTZ-DB_2.0",
    "biotoolsID": "WALTZ-DB_2.0",
    "collectionID": [
        "VIB"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Frederic Rousseau",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Joost Schymkowitz",
            "orcidid": "https://orcid.org/0000-0003-2020-0168",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "an updated database containing structural information of experimentally determined amyloid-forming peptides | WALTZ-DB 2.0 is a database for characterizing short peptides for their amyloid fiber-forming capacities. The majority of the data comes from electron microscopy, FTIR and Thioflavin-T experiments done by the Switch lab. Apart from that class of data we also provide the amyloid annotation for several other short peptides found in current scientific research papers. Structural models of the potential amyloid cores are provided for every peptide entry.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://waltzdb.switchlab.org/",
    "lastUpdate": "2021-01-03T16:01:12Z",
    "name": "WALTZ-DB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ758",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Transition of soluble proteins into insoluble amyloid fibrils is driven by self-propagating short sequence stretches. However, accurate prediction of aggregation determinants remains challenging. Here, we describe WALTZ-DB 2.0, an updated and significantly expanded open-access database providing information on experimentally determined amyloid-forming hexapeptide sequences (http://waltzdb.switchlab.org/). We have updated WALTZ-DB 2.0 with new entries, including: (i) experimental validation of an in-house developed dataset of 229 hexapeptides, using electron microscopy and Thioflavin-T binding assays; (ii) manual curation of 98 amyloid-forming peptides isolated from literature. Furthermore, the content has been expanded by adding novel structural information for peptide entries, including sequences of the previous version. Using a computational methodology developed in the Switch lab, we have generated 3D-models of the putative amyloid fibril cores of WALTZ-DB 2.0 entries. Structural models, coupled with information on the energetic contributions and fibril core stabilities, can be accessed through individual peptide entries. Customized filtering options for subset selections and new modelling graphical features were added to upgrade online accessibility, providing a user-friendly interface for browsing, downloading and updating. WALTZ-DB 2.0 remains the largest open-access repository for amyloid fibril formation determinants and will continue to enhance the development of new approaches focused on accurate prediction of aggregation prone sequences.",
                "authors": [
                    {
                        "name": "Louros N."
                    },
                    {
                        "name": "Konstantoulea K."
                    },
                    {
                        "name": "De Vleeschouwer M."
                    },
                    {
                        "name": "Ramakers M."
                    },
                    {
                        "name": "Schymkowitz J."
                    },
                    {
                        "name": "Rousseau F."
                    }
                ],
                "citationCount": 20,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "WALTZ-DB 2.0: An updated database containing structural information of experimentally determined amyloid-forming peptides"
            },
            "pmid": "31504823"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}