{
    "additionDate": "2020-01-09T17:58:19Z",
    "biotoolsCURIE": "biotools:E-Flow",
    "biotoolsID": "E-Flow",
    "confidence_flag": "tool",
    "description": "Using fluorescence flow cytometry data for single-cell gene expression analysis in bacteria.\n\nvngFCM is a package designed to analyse fluocytometry data of small bacterial cells.\n\nFluocytometer analysis of bacterial cells.\n\ninstall.packages(\"/path/to/E-Flow\", repos=NULL, type=\"source\").\n\nThis package has been designed to process FCM data by removing non viable cells, subtracting autofluorescence and reduce the effect of electronic noise coming from the cytometer. It has been designed for the analysis of bacterial cells, where the small dimensions and the low expression pose challanges in the correct interpretation of the data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/vanNimwegenLab/E-Flow",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-25T11:07:25Z",
    "name": "E-Flow",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/793976"
        },
        {
            "doi": "10.1371/journal.pone.0240233",
            "metadata": {
                "abstract": "© 2020 Galbusera et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Fluorescence flow cytometry is increasingly being used to quantify single-cell expression distributions in bacteria in high-throughput. However, there has been no systematic investigation into the best practices for quantitative analysis of such data, what systematic biases exist, and what accuracy and sensitivity can be obtained. We investigate these issues by measuring the same E. coli strains carrying fluorescent reporters using both flow cytometry and microscopic setups and systematically comparing the resulting single-cell expression distributions. Using these results, we develop methods for rigorous quantitative inference of single-cell expression distributions from fluorescence flow cytometry data. First, we present a Bayesian mixture model to separate debris from viable cells using all scattering signals. Second, we show that cytometry measurements of fluorescence are substantially affected by autofluorescence and shot noise, which can be mistaken for intrinsic noise in gene expression, and present methods to correct for these using calibration measurements. Finally, we show that because forward- and side-scatter signals scale non-linearly with cell size, and are also affected by a substantial shot noise component that cannot be easily calibrated unless independent measurements of cell size are available, it is not possible to accurately estimate the variability in the sizes of individual cells using flow cytometry measurements alone. To aid other researchers with quantitative analysis of flow cytometry expression data in bacteria, we distribute E-Flow, an open-source R package that implements our methods for filtering debris and for estimating true biological expression means and variances from the fluorescence signal. The package is available at https://github.com/vanNimwegenLab/E-Flow.",
                "authors": [
                    {
                        "name": "Galbusera L."
                    },
                    {
                        "name": "Bellement-Theroue G."
                    },
                    {
                        "name": "Urchueguia A."
                    },
                    {
                        "name": "Julou T."
                    },
                    {
                        "name": "van Nimwegen E."
                    }
                ],
                "date": "2020-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Using fluorescence flow cytometry data for single-cell gene expression analysis in bacteria"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ],
    "validated": 1
}