
{
    "credit": [
        {
            "email": "j.vanthor@imperial.ac.uk",
            "name": "Jasper J. van Thor",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://github.com/gadorlhiac/PyLDM/blob/master/Manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/gadorlhiac/PyLDM"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Enzyme kinetics data",
                        "uri": "http://edamontology.org/data_2024"
                    },
                    "format": [
                        {
                            "term": "CSV",
                            "uri": "http://edamontology.org/format_3752"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Enzyme kinetics calculation",
                    "uri": "http://edamontology.org/operation_0334"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Heat map",
                        "uri": "http://edamontology.org/data_1636"
                    },
                    "format": [
                        {
                            "term": "Map format",
                            "uri": "http://edamontology.org/format_2060"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "Python"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Workbench"
        ],
        "topic": [
            {
                "term": "Biochemistry",
                "uri": "http://edamontology.org/topic_3292"
            },
            {
                "term": "Enzymes",
                "uri": "http://edamontology.org/topic_0821"
            },
            {
                "term": "Simulation experiment",
                "uri": "http://edamontology.org/topic_3524"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Dorlhiac et al. Ultrafast spectroscopy offers temporal resolution for probing processes in the femto- and picosecond regimes. This has allowed for investigation of energy and charge transfer in numerous photoactive compounds and complexes. However, analysis of the resultant data can be complicated, particularly in more complex biological systems, such as photosystems. Historically, the dual approach of global analysis and target modelling has been used to elucidate kinetic descriptions of the system, and the identity of transient species respectively. With regards to the former, the technique of lifetime density analysis (LDA) offers an appealing alternative. While global analysis approximates the data to the sum of a small number of exponential decays, typically on the order of 2-4, LDA uses a semi-continuous distribution of 100 lifetimes. This allows for the elucidation of lifetime distributions, which may be expected from investigation of complex systems with many chromophores, as opposed to averages. Furthermore, the inherent assumption of linear combinations of decays in global analysis means the technique is unable to describe dynamic motion, a process which is resolvable with LDA. The technique was introduced to the field of photosynthesis over a decade ago by the Holzwarth group. The analysis has been demonstrated to be an important tool to evaluate complex dynamics such as photosynthetic energy transfer, and complements traditional global and target analysis techniques. Although theory has been well described, no open source code has so far been available to perform lifetime density analysis. Therefore, we introduce a python (2.7) based package, PyLDM, to address this need. We furthermore provide a direct comparison of the capabilities of LDA with those of the more familiar global analysis, as well as providing a number of statistical techniques for dealing with the regularization of noisy data.",
            "authors": [
                "Dorlhiac G.F.",
                "Fare C.",
                "van Thor J.J."
            ],
            "cit_count": 0,
            "doi": "10.1371/journal.pcbi.1005528",
            "journal": "PLoS Computational Biology",
            "title": "PyLDM - An open source package for lifetime density analysis of time-resolved spectroscopic data",
            "year": "2017-05-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pyldm",
        "biotoolsID": "pyldm",
        "description": "A package for lifetime density analysis of time-resolved spectroscopic data",
        "homepage": "https://github.com/gadorlhiac/PyLDM",
        "name": "PyLDM"
    }
}