{"credit":[{"email":"yangzhanglab@umich.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://zhanglab.ccmb.med.umich.edu/"}],"documentation":[{"type":"GENERAL","url":"https://zhanglab.ccmb.med.umich.edu/SEGMER/"}],"function":[{"operation":[{"term":"Protein structural motif recognition","uri":"http://edamontology.org/operation_0245"}]},{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool","Web application"],"topic":[{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Protein structural motifs and surfaces","uri":"http://edamontology.org/topic_0166"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/segmer-protein-substructure-recognition.html"}],"publication":[{"abstract":"Protein template identification is essential to protein structure and function predictions. However, conventional whole-chain threading approaches often fail to recognize conserved substructure motifs when the target and templates do not share the same fold. We developed a new approach, SEGMER, for identifying protein substructure similarities by segmental threading. The target sequence is split into segments of two to four consecutive or nonconsecutive secondary structural elements, which are then threaded through PDB to identify appropriate substructure motifs. SEGMER is tested on 144 nonredundant hard proteins. When combined with whole-chain threading, the TM-score of alignments and accuracy of spatial restraints of SEGMER increase by 16% and 25%, respectively, compared with that by the whole-chain threading methods only. When tested on 12 free modeling targets from CASP8, SEGMER increases the TM-score and contact accuracy by 28% and 48%, respectively. This significant improvement should have important impact on protein structure modeling and functional inference. © 2010 Elsevier Ltd.","authors":["Wu S.","Zhang Y."],"cit_count":19,"journal":"Structure","pmid":"20637422","title":"Recognizing Protein Substructure Similarity Using Segmental Threading","year":"2010-07-01"}],"summary":{"biotoolsCURIE":"biotools:segmer","biotoolsID":"segmer","description":"A segmental threading algorithm designed to recoginzing substructure motifs from the Protein Data Bank (PDB) library.","homepage":"http://zhanglab.ccmb.med.umich.edu/SEGMER/","name":"SEGMER"}}