
{
    "credit": [
        {
            "email": "gcyuan@jimmy.harvard.edu",
            "name": "Guo-Cheng Yuan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://sites.google.com/a/channing.harvard.edu/kimberlyglass/home"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sites.google.com/a/channing.harvard.edu/kimberlyglass/tools/panda"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/panda-pypanda-pandar-passing-attributes-between-networks-for-data-assimilation.html"
        }
    ],
    "publication": [
        {
            "abstract": "Regulatory network reconstruction is a fundamental problem in computational biology. There are significant limitations to such reconstruction using individual datasets, and increasingly people attempt to construct networks using multiple, independent datasets obtained from complementary sources, but methods for this integration are lacking. We developed PANDA (Passing Attributes between Networks for Data Assimilation), a message-passing model using multiple sources of information to predict regulatory relationships, and used it to integrate protein-protein interaction, gene expression, and sequence motif data to reconstruct genome-wide, condition-specific regulatory networks in yeast as a model. The resulting networks were not only more accurate than those produced using individual data sets and other existing methods, but they also captured information regarding specific biological mechanisms and pathways that were missed using other methodologies. PANDA is scalable to higher eukaryotes, applicable to specific tissue or cell type data and conceptually generalizable to include a variety of regulatory, interaction, expression, and other genome-scale data. An implementation of the PANDA algorithm is available at www.sourceforge.net/projects/panda-net. © 2013 Glass et al.",
            "authors": [
                "Glass K.",
                "Huttenhower C.",
                "Quackenbush J.",
                "Yuan G.-C."
            ],
            "cit_count": 35,
            "journal": "PLoS ONE",
            "pmid": "23741402",
            "title": "Passing Messages between Biological Networks to Refine Predicted Interactions",
            "year": "2013-05-31"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:panda",
        "biotoolsID": "panda",
        "description": "Message-passing model using multiple sources of information to predict regulatory relationships, and used it to integrate protein-protein interaction, gene expression, and sequence motif data to reconstruct genome-wide, condition-specific regulatory networks in yeast.",
        "homepage": "https://sites.google.com/a/channing.harvard.edu/kimberlyglass/tools/panda",
        "name": "PANDA"
    }
}