{
    "additionDate": "2021-01-18T12:29:34Z",
    "biotoolsCURIE": "biotools:likelihoodprofiler",
    "biotoolsID": "likelihoodprofiler",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "borisov@insysbio.com",
            "name": "Ivan Borisov ,",
            "typeEntity": "Person"
        }
    ],
    "description": "Algorithm and software package for practical identifiability analysis in systems biology.\n\nLikelihoodProfiler is a Julia language package for identifiability analysis and confidence intervals evaluation.\n\nLikelihoodProfiler is a package for identifiability analysis and confidence intervals evaluation which was originally written in Julia language. See https://github.com/insysbio/LikelihoodProfiler.jl This is the translation of the original Julia code to Python.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/insysbio/LikelihoodProfiler.jl",
    "language": [
        "Julia",
        "Python"
    ],
    "lastUpdate": "2021-02-16T08:45:28Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/insysbio/LikelihoodProfiler.py"
        }
    ],
    "name": "LikelihoodProfiler",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1008495",
            "metadata": {
                "abstract": "© 2020 Borisov, Metelkin. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Practical identifiability of Systems Biology models has received a lot of attention in recent scientific research. It addresses the crucial question for models’ predictability: how accurately can the models’ parameters be recovered from available experimental data. The methods based on profile likelihood are among the most reliable methods of practical identification. However, these methods are often computationally demanding or lead to inaccurate estimations of parameters’ confidence intervals. Development of methods, which can accurately produce parameters’ confidence intervals in reasonable computational time, is of utmost importance for Systems Biology and QSP modeling. We propose an algorithm Confidence Intervals by Constraint Optimization (CICO) based on profile likelihood, designed to speed-up confidence intervals estimation and reduce computational cost. The numerical implementation of the algorithm includes settings to control the accuracy of confidence intervals estimates. The algorithm was tested on a number of Systems Biology models, including Taxol treatment model and STAT5 Dimerization model, discussed in the current article. The CICO algorithm is implemented in a software package freely available in Julia (https://github.com/insysbio/LikelihoodProfiler.jl) and Python (https://github.com/insysbio/LikelihoodProfiler.py).",
                "authors": [
                    {
                        "name": "Borisov I."
                    },
                    {
                        "name": "Metelkin E."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-21T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Confidence intervals by constrained optimization—An algorithm and software package for practical identifiability analysis in systems biology"
            },
            "pmid": "33347435"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}