{
    "accessibility": "Open access",
    "additionDate": "2022-10-02T20:40:47.120637Z",
    "biotoolsCURIE": "biotools:joint-snf",
    "biotoolsID": "joint-snf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "caohy@sxmu.edu.cn",
            "name": "Hongyan Cao",
            "typeEntity": "Person"
        },
        {
            "email": "cuiy@msu.edu",
            "name": "Yuehua Cui",
            "typeEntity": "Person"
        },
        {
            "name": "Ruiling Fang"
        },
        {
            "name": "Zhi Li"
        }
    ],
    "description": "Joint-SNF method uses SNF to integrate the joint structure extracted by JIVE method to obtain the fusion matrix.\nThe fused network enhances strong similarities and weakens spurious associations between samples while reducing the noise. The realization of Joint-SNF method relies on the following two important algorithms.\nExtraction of joint structures by JIVE; Similarity Network Fusion",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Sameerer/Joint-SNF",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-10-02T20:40:47.124120Z",
    "license": "Not licensed",
    "name": "Joint-SNF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2022.06.065",
            "metadata": {
                "abstract": "© 2022 The Author(s)Lower-grade gliomas (LGG), characterized by heterogeneity and invasiveness, originate from the central nervous system. Although studies focusing on molecular subtyping and molecular characteristics have provided novel insights into improving the diagnosis and therapy of LGG, there is an urgent need to identify new molecular subtypes and biomarkers that are promising to improve patient survival outcomes. Here, we proposed a joint similarity network fusion (Joint-SNF) method to integrate different omics data types to construct a fused network using the Joint and Individual Variation Explained (JIVE) technique under the SNF framework. Focusing on the joint network structure, a spectral clustering method was employed to obtain subtypes of patients. Simulation studies show that the proposed Joint-SNF method outperforms the original SNF approach under various simulation scenarios. We further applied the method to a Chinese LGG data set including mRNA expression, DNA methylation and microRNA (miRNA). Three molecular subtypes were identified and showed statistically significant differences in patient survival outcomes. The five-year mortality rates of the three subtypes are 80.8%, 32.1%, and 34.4%, respectively. After adjusting for clinically relevant covariates, the death risk of patients in Cluster 1 was 5.06 times higher than patients in other clusters. The fused network attained by the proposed Joint-SNF method enhances strong similarities, thus greatly improves subtyping performance compared to the original SNF method. The findings in the real application may provide important clues for improving patient survival outcomes and for precision treatment for Chinese LGG patients. An R package to implement the method can be accessed in Github at https://github.com/Sameerer/Joint-SNF.",
                "authors": [
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Cui Y."
                    },
                    {
                        "name": "Fang R."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Shi G."
                    },
                    {
                        "name": "Wei Y."
                    },
                    {
                        "name": "Yang H."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "Multi-omics data integration for subtype identification of Chinese lower-grade gliomas: A joint similarity network fusion approach"
            },
            "pmcid": "PMC9284445",
            "pmid": "35860412"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
