{
    "additionDate": "2021-01-18T07:40:16Z",
    "biotoolsCURIE": "biotools:mirabel",
    "biotoolsID": "mirabel",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "christophe.dubessy@univ-rouen.fr",
            "name": "Christophe Dubessy",
            "typeEntity": "Person"
        },
        {
            "name": "Chadi Saad",
            "typeEntity": "Person"
        },
        {
            "name": "Gaëtan Ferry",
            "typeEntity": "Person"
        }
    ],
    "description": "Improving Bioinformatics Prediction of microRNA Targets by Ranks Aggregation.\n\nA simple and efficient miRNA target prediction tool.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.univ-rouen.fr/mirabel/",
    "lastUpdate": "2021-02-24T08:09:44Z",
    "name": "miRabel",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01330",
            "metadata": {
                "abstract": "© Copyright © 2020 Quillet, Saad, Ferry, Anouar, Vergne, Lecroq and Dubessy.microRNAs are noncoding RNAs which downregulate a large number of target mRNAs and modulate cell activity. Despite continued progress, bioinformatics prediction of microRNA targets remains a challenge since available software still suffer from a lack of accuracy and sensitivity. Moreover, these tools show fairly inconsistent results from one another. Thus, in an attempt to circumvent these difficulties, we aggregated all human results of four important prediction algorithms (miRanda, PITA, SVmicrO, and TargetScan) showing additional characteristics in order to rerank them into a single list. Instead of deciding which prediction tool to use, our method clearly helps biologists getting the best microRNA target predictions from all aggregated databases. The resulting database is freely available through a webtool called miRabel1 which can take either a list of miRNAs, genes, or signaling pathways as search inputs. Receiver operating characteristic curves and precision-recall curves analysis carried out using experimentally validated data and very large data sets show that miRabel significantly improves the prediction of miRNA targets compared to the four algorithms used separately. Moreover, using the same analytical methods, miRabel shows significantly better predictions than other popular algorithms such as MBSTAR, miRWalk, ExprTarget and miRMap. Interestingly, an F-score analysis revealed that miRabel also significantly improves the relevance of the top results. The aggregation of results from different databases is therefore a powerful and generalizable approach to many other species to improve miRNA target predictions. Thus, miRabel is an efficient tool to guide biologists in their search for miRNA targets and integrate them into a biological context.",
                "authors": [
                    {
                        "name": "Anouar Y."
                    },
                    {
                        "name": "Dubessy C."
                    },
                    {
                        "name": "Ferry G."
                    },
                    {
                        "name": "Lecroq T."
                    },
                    {
                        "name": "Quillet A."
                    },
                    {
                        "name": "Saad C."
                    },
                    {
                        "name": "Vergne N."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-28T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Improving Bioinformatics Prediction of microRNA Targets by Ranks Aggregation"
            },
            "pmcid": "PMC6997536",
            "pmid": "32047509"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
