{
    "additionDate": "2018-05-08T14:28:20Z",
    "biotoolsCURIE": "biotools:pedican",
    "biotoolsID": "pedican",
    "credit": [
        {
            "email": "zhaom@mail.cbi.pku.edu.cn",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An online gene resource for pediatric cancers with literature evidence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pedican.bioinfo-minzhao.org/tutorial.cgi"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://pedican.bioinfo-minzhao.org/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "Pedican",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/SREP11435",
            "metadata": {
                "abstract": "Pediatric cancer (PC), that is cancer occurring in children, is the leading cause of death among children worldwide, with an incidence of 175,000 per year. Elucidating the genetic abnormalities and underlying cellular mechanisms may provide less toxic curative treatments. Therefore, it is important to understand the pathology of pediatric cancer at the genetic, genomic and epigenetic level. To unveil the cellular complexity of PC, we have developed a database of pediatric cancers (Pedican), the first literature-based pediatric gene data resource by comprehensive literature curation and data integration. In the current release, Pedican contains 735 human genes, 88 gene fusion and 24 chromosome abnormal events curated from 2245 PubMed abstracts. Pedican provides detailed annotations for each gene, such as Entrez gene information, involved pathways, protein-protein interactions, mutations, gene expression, methylation sites, TF regulation, and post-translational modification. Additionally Pedican has a user-friendly web interface, which allows sophisticated text query, sequence searches, and browsing by highlighted literature evidence and hundreds of cancer types. Overall, our curated pediatric cancer-related gene list maps the genomic and cellular landscape for various pediatric cancers, providing a valuable resource for further experiment design. The Pedican is available at http://pedican.bioinfo-minzhao.org/.",
                "authors": [
                    {
                        "name": "Zhao M."
                    },
                    {
                        "name": "Ma L."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Qu H."
                    }
                ],
                "citationCount": 6,
                "date": "2015-06-15T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Pedican: An online gene resource for pediatric cancers with literature evidence"
            },
            "pmcid": "PMC4466794",
            "pmid": "26073932"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        }
    ],
    "validated": 1
}