{
    "accessibility": "Open access",
    "additionDate": "2025-01-29T09:17:22.793965Z",
    "biotoolsCURIE": "biotools:phagedive",
    "biotoolsID": "phagedive",
    "collectionID": [
        "DSMZ Digital Diversity"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Leibniz-Institut DSMZ-Deutsche Sammlung von Mikroorganismen und Zellkulturen GmbH",
            "rorid": "02tyer376",
            "typeEntity": "Institute",
            "typeRole": [
                "Maintainer"
            ],
            "url": "https://www.dsmz.de/"
        }
    ],
    "description": "PhageDive is a specific database for bacteriophages and archaeal viruses. Built on the BacDive model, it gathers and links all the experimental data and metadata of the viruses present in different culture collections. Its implementation aims to facilitate access to all viruses information for the scientific community. The database covers taxonomy, host strain, phage morphology, life cycle, origin and genomic data.",
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Germany"
    ],
    "elixirPlatform": [
        "Data"
    ],
    "homepage": "https://phagedive.dsmz.de/",
    "lastUpdate": "2025-01-29T09:24:11.296689Z",
    "license": "CC-BY-4.0",
    "maturity": "Mature",
    "name": "PhageDive",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "isabelschober",
    "publication": [
        {
            "doi": "10.1093/nar/gkae878",
            "metadata": {
                "abstract": "Prokaryotic viruses represent the most diverse and abundant biological entities on Earth. So far, data on bacteriophages are not standardized, not readily available for comparative analyses and cannot be linked to the rapidly growing (meta)genomic data. We developed PhageDive (https://phagedive.dsmz.de), a comprehensive database for prokaryotic viruses gathering all existing data dispersed across multiple sources, like scientific publications, specialized databases or internal files of culture collections. PhageDive allows to link own research data to the existing information through an easy and central access, providing fields for various experimental data (host range, genomic data, etc.) and available metadata (e.g. geographical origin, isolation source). An important feature is the link between experimental data, the culture collection number and the repository of the corresponding physical bioresource. To date, PhageDive covers 1167 phages from three different world-renowned public collections (DSMZ, Félix d’Hérelle Reference Center for Bacterial Viruses and NCTC) and features an advanced search function using all data fields from the sections like taxonomy or morphology by controlled vocabulary and ontologies. PhageDive is fully interoperable with other resources including NCBI, the Viral Host Range database (VHRdb) of Institute Pasteur or the BacDive and MediaDive databases of DSMZ.",
                "authors": [
                    {
                        "name": "Bunk B."
                    },
                    {
                        "name": "Carbasse J.S."
                    },
                    {
                        "name": "Dudek C.-A."
                    },
                    {
                        "name": "Ebeling C."
                    },
                    {
                        "name": "Koblitz J."
                    },
                    {
                        "name": "Overmann J."
                    },
                    {
                        "name": "Reimer L.C."
                    },
                    {
                        "name": "Rolland C."
                    },
                    {
                        "name": "Schober I."
                    },
                    {
                        "name": "Wittmann J."
                    }
                ],
                "citationCount": 1,
                "date": "2025-01-06T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PhageDive: the comprehensive strain database of prokaryotic viral diversity"
            },
            "pmcid": "PMC11701545",
            "pmid": "39373542",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ]
}
