{"credit":[{"email":"itg@beckman.illinois.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://itg.beckman.illinois.edu/index.cgi"}],"documentation":[{"type":"GENERAL","url":"http://itg.beckman.illinois.edu/technology_development/software_development/suprim/"}],"function":[{"operation":[{"term":"Image analysis","uri":"http://edamontology.org/operation_3443"}]}],"labels":{"language":["C"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Imaging","uri":"http://edamontology.org/topic_3382"},{"term":"Electron microscopy","uri":"http://edamontology.org/topic_0611"},{"term":"Analytical chemistry","uri":"http://edamontology.org/topic_3370"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/suprim-5-3-1-process-electron-microscopy-image.html"}],"publication":[{"abstract":"A flexible, modular software package intended for the processing of electron microscopy images is presented. The system consists of a set of image processing tools or filters, written in the C programming language, and a command line style user interface based on the UNIX shell. The pipe and filter structure of UNIX and the availability of command files in the form of shell scripts eases the construction of complex image processing procedures from the simpler tools. Implementation of a new image processing algorithm in SUPRIM may often be performed by construction of a new shell script, using already existing tools. Currently, the package has been used for two- and three-dimensional image processing and reconstruction of macromolecules and other structures of biological interest.","authors":["Schroeter J.P.","Bretaudiere J.-P."],"cit_count":93,"journal":"Journal of Structural Biology","pmid":"8742734","title":"SUPRIM: Easily modified image processing software","year":"1996-01-01"}],"summary":{"biotoolsCURIE":"biotools:suprim","biotoolsID":"suprim","description":"A flexible, modular software package intended for the processing of electron microscopy images is presented. The system consists of a set of image processing tools or filters, written in the C programming language, and a command line style user interface based on the UNIX shell. The pipe and filter structure of UNIX and the availability of command files in the form of shell scripts eases the construction of complex image processing procedures from the simpler tools.","homepage":"http://itg.beckman.illinois.edu/technology_development/software_development/suprim/","name":"Suprim"}}