{"collectionID": [], "accessibility": [], "topic": [{"term": "Natural language processing", "uri": "http://edamontology.org/topic_0218"}, {"term": "Data mining", "uri": "http://edamontology.org/topic_3473"}, {"term": "Proteins", "uri": "http://edamontology.org/topic_0078"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "18483079", "type": null, "pmcid": null, "metadata": {"title": "E3Miner: a text mining tool for ubiquitin-protein ligases.", "abstract": "Ubiquitination is a regulatory process critically involved in the degradation of >80% of cellular proteins, where such proteins are specifically recognized by a key enzyme, or a ubiquitin-protein ligase (E3). Because of this important role of E3s, a rapidly growing body of the published literature in biology and biomedical fields reports novel findings about various E3s and their molecular mechanisms. However, such findings are neither adequately retrieved by general text-mining tools nor systematically made available by such protein databases as UniProt alone. E3Miner is a web-based text mining tool that extracts and organizes comprehensive knowledge about E3s from the abstracts of journal articles and the relevant databases, supporting users to have a good grasp of E3s and their related information easily from the available text. The tool analyzes text sentences to identify protein names for E3s, to narrow down target substrates and other ubiquitin-transferring proteins in E3-specific ubiquitination pathways and to extract molecular features of E3s during ubiquitination. E3Miner also retrieves E3 data about protein functions, other E3-interacting partners and E3-related human diseases from the protein databases, in order to help facilitate further investigation. E3Miner is freely available through http://e3miner.biopathway.org.", "citationCount": 17, "authors": [{"name": "Lee H."}, {"name": "Yi G.S."}, {"name": "Park J.C."}], "date": "2008-01-01T00:00:00Z", "journal": "Nucleic acids research"}}], "homepage_status": 1, "credit": [], "biotoolsCURIE": "biotools:e3miner", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://e3miner.biopathway.org", "function": [{"note": null, "input": [], "operation": [{"term": "Text mining", "uri": "http://edamontology.org/operation_0306"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:40Z", "otherID": [], "description": "Web-based text mining tool that extracts and incorporates comprehensive knowledge about ubiquitin-protein ligases (E3) with their underlying mechanisms. This tool integrates available E3 data from the published literature as well as from the biological databases.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "e3miner", "additionDate": "2017-02-14T09:35:20Z", "name": "E3Miner", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}