{
    "additionDate": "2021-01-18T11:19:12Z",
    "biotoolsCURIE": "biotools:toa",
    "biotoolsID": "toa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "unai.lopezdeheredia@upm.es",
            "name": "Unai López de Heredia",
            "typeEntity": "Person"
        }
    ],
    "description": "A software package for automated functional annotation in non-model plant species.\n\nTOA (Taxonomy-oriented Annotation).\n\nTOA aims to establish workflows geared towards plant species that automate the extraction of information from genomic databases and the annotation of sequences. TOA uses the following databases: Dicots PLAZA 4.0, Monocots PLAZA 4.0, Gymno PLAZA 1.0, NCBI RefSeq Plant and NCBI Nucleotide Database (NT) and NCBI Non-Redundant Protein Sequence Database (NR). Although TOA was primarily designed to work with woody plant species, it can also be used in the analysis of experiments on any type of plant organism. Additionally, NCBI Gene, InterPro and Gene Ontology databases are also used to complete the information.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GGFHF/TOA/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-01T09:09:01Z",
    "license": "GPL-3.0",
    "name": "TOA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13285",
            "metadata": {
                "abstract": "© 2020 John Wiley & Sons LtdThe increase of sequencing capacity provided by high-throughput platforms has made it possible to routinely obtain large sets of genomic and transcriptomic sequences from model and non-model organisms. Subsequent genomic analysis and gene discovery in next-generation sequencing experiments are, however, bottlenecked by functional annotation. One common way to perform functional annotation of sets of sequences obtained from next-generation sequencing experiments, is by searching for homologous sequences and accessing the related functional information deposited in genomic databases. Functional annotation is especially challenging for non-model organisms, like many plant species. In such cases, existing free and commercial general-purpose applications may not offer complete and accurate results. We present TOA (Taxonomy-oriented annotation), a Python-based user-friendly open source application designed to establish functional annotation pipelines geared towards non-model plant species that can run in Linux/Mac computers, HPCs and cloud servers. TOA performs homology searches against proteins stored in the PLAZA databases, NCBI RefSeq Plant, Nucleotide Database and Non-Redundant Protein Sequence Database, and outputs functional information from several ontology systems: Gene Ontology, InterPro, EC, KEGG, Mapman and MetaCyc. The software performance was validated by comparing the runtimes, total number of annotated sequences and accuracy of the functional information obtained for several plant benchmark data sets with TOA and other functional annotation solutions. TOA outperformed the other software in terms of number of annotated sequences and accuracy of the annotation and constitutes a good alternative to improve functional annotation in plants. TOA is especially recommended for gymnosperms or for low quality sequence data sets of non-model plants.",
                "authors": [
                    {
                        "name": "Mora-Marquez F."
                    },
                    {
                        "name": "Chano V."
                    },
                    {
                        "name": "Vazquez-Poletti J.L."
                    },
                    {
                        "name": "Lopez de Heredia U."
                    }
                ],
                "date": "2021-02-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "TOA: A software package for automated functional annotation in non-model plant species"
            },
            "pmid": "33070442"
        }
    ],
    "topic": [
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ]
}