
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://intsim.sourceforge.net/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sourceforge.net/projects/intsim/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/intsim-an-integrated-simulator-of-next-generation-sequencing-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 1964-2012 IEEE. Objective: Next-generation sequencing data has been widely used for DNA variant discovery and tumor study through computational tools. Effective simulation of such data with many realistic features is very necessary for testing existing tools and guiding the development of new tools. Methods: We present an integrated simulation system, IntSIM, to simulate common DNA variants and to generate sequencing reads for mixture genomes. IntSIM has three novel features in comparison with other simulation programs: 1) it is able to simulate both germline and somatic variants in the same sequence, 2) it deals with tumor purity so as to generate reads corresponding to heterogeneous genomes and also produce tumor-normal matched samples, and 3) it simulates correlations among SNPs, among CNVs/CNAs based on HMM models trained from real sequencing genomes, and can simulates broad and focal CNV/CNA events. Results: The simulation data of IntSIM can reflect characteristics observed from real data and are consistent with input parameters. The IntSIM software package is freely available at http://intsim.sourceforge.net/. Conclusion: Based on a great number of experiments, IntSIM performs better than other program for some scenarios, such as simulation of heterozygous SNPs, CNVs/CNAs, and can achieve some functions that other programs cannot achieve. Significance: Simulation with IntSIM can be expected to evaluate performance of methods in detecting various types of variants, analyzing tumor samples, and especially providing a realistic assessment of effect of tumor purity on identification of somatic mutations.",
            "authors": [
                "Yuan X.",
                "Zhang J.",
                "Yang L."
            ],
            "cit_count": 3,
            "journal": "IEEE Transactions on Biomedical Engineering",
            "pmid": "27164567",
            "title": "IntSIM: An Integrated Simulator of Next-Generation Sequencing Data",
            "year": "2017-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:intsim",
        "biotoolsID": "intsim",
        "description": "This software package has been developed to simulate various genome mutations including germline and somatic variations from next generation sequencing data, and also to generate read data from mixed genomes by considering moderate levels of tumor purity.",
        "homepage": "https://sourceforge.net/projects/intsim/",
        "name": "IntSIM"
    }
}