{
    "name": "JEvTrace", 
    "description": "Jevtrace is a tool that combines multiple sequence alignments, phylogenetic, and structural data for identification of functional sites in proteins.", 
    "homepage": "http://compbio.berkeley.edu/people/marcin/jevtrace/", 
    "biotoolsID": "jevtrace", 
    "biotoolsCURIE": "biotools:jevtrace", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0499", 
                    "term": "Tree-based sequence alignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0492", 
                    "term": "Multiple sequence alignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0245", 
                    "term": "Protein structural motif recognition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0321", 
                    "term": "Protein model validation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0084", 
            "term": "Phylogeny"
        }, 
        {
            "uri": "http://edamontology.org/topic_0166", 
            "term": "Protein structural motifs and surfaces"
        }, 
        {
            "uri": "http://edamontology.org/topic_3293", 
            "term": "Phylogenetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0623", 
            "term": "Gene and protein families"
        }, 
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://compbio.berkeley.edu/people/marcin/jevtrace/manual.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "12537566", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "JEvTrace: refinement and variations of the evolutionary trace in JAVA.", 
                "abstract": "BACKGROUND: Details of functional speciation within gene families can be difficult to identify using standard multiple sequence alignment (MSA) methods. The evolutionary trace (ET) was developed as a visualization tool to combine MSA, phylogenetic and structural data for identification of functional sites in proteins. The method has been successful in extracting evolutionary details of functional surfaces in a number of biological systems and modifications of the method are useful in creating hypotheses about the function of previously unannotated genes. We wish to facilitate the graphical interpretation of disparate data types through the creation of flexible software implementations. RESULTS: We have implemented the ET method in a JAVA graphical interface, JEvTrace. Users can analyze and visualize ET input and output with respect to protein phylogeny, sequence and structure. Function discovery with JEvTrace is demonstrated on two proteins with recently determined crystal structures: YlxR from Streptococcus pneumoniae with a predicted RNA-binding function, and a Haemophilus influenzae protein of unknown function, YbaK. To facilitate analysis and storage of results we propose a MSA coloring data structure. The sequence coloring format readily captures evolutionary, biological, functional and structural features of MSAs. CONCLUSIONS: Protein families and phylogeny represent complex data with statistical outliers and special cases. The JEvTrace implementation of the ET method allows detailed mining and graphical visualization of evolutionary sequence relationships.", 
                "date": "2002-01-01T00:00:00Z", 
                "citationCount": 16, 
                "authors": [
                    {
                        "name": "Joachimiak M.P."
                    }, 
                    {
                        "name": "Cohen F.E."
                    }
                ], 
                "journal": "Genome biology"
            }
        }, 
        {
            "doi": null, 
            "pmid": "8609628", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "An evolutionary trace method defines binding surfaces common to protein families", 
                "abstract": "X-ray or NMR structures of proteins are often derived without their ligands, and even when the structure of a full complex is available, the area of contact that is functionally and energetically significant may be a specialized subset of the geometric interface deduced from the spatial proximity between ligands. Thus, even after a structure is solved, it remains a major theoretical and experimental goal to localize protein functional interfaces and understand the role of their constituent residues. The evolutionary trace method is a systematic, transparent and novel predictive technique that identifies active sites and functional interfaces in proteins with known structure. It is based on the extraction of functionally important residues from sequence conservation patterns in homologous proteins, and on their mapping onto the protein surface to generate clusters identifying functional interfaces. The SH2 and SH3 modular signaling domains and the DNA binding domain of the nuclear hormone receptors provide tests for the accuracy and validity of our method. In each case, the evolutionary trace delineates the functional epitope and identifies residues critical to binding specificity. Based on mutational evolutionary analysis and on the structural homology of protein families, this simple and versatile approach should help focus site-directed mutagenesis studies of structure-function relationships in macromolecules, as well as studies of specificity in molecular recognition. More generally, it provides an evolutionary perspective for judging the functional or structural role of each residue in a protein structure.", 
                "date": "1996-03-29T00:00:00Z", 
                "citationCount": 918, 
                "authors": [
                    {
                        "name": "Lichtarge O."
                    }, 
                    {
                        "name": "Bourne H.R."
                    }, 
                    {
                        "name": "Cohen F.E."
                    }
                ], 
                "journal": "Journal of Molecular Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "JEvTrace team", 
            "email": "marcin@compbio.berkley.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-05-02T07:18:50Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}