{
    "accessibility": "Open access",
    "additionDate": "2020-01-24T09:54:22Z",
    "biotoolsCURIE": "biotools:Midcor",
    "biotoolsID": "Midcor",
    "description": "R-program supporting a step of workflow of fluxomic analysis of artificial 13C labeling of metabolites. It designed to correct raw mass spectra (MS) of 13C-labeled metabolites of interest for natural isotopes occurrence. The raw mass spectra are supposed to be extracted from MS recording by Ramid.",
    "documentation": [
        {
            "note": "contains usage instructions and examples",
            "type": [
                "General"
            ],
            "url": "https://github.com/seliv55/ramidcor/"
        }
    ],
    "download": [
        {
            "note": "Github repository, which can be cloned or dounloaded",
            "type": "Downloads page",
            "url": "https://github.com/seliv55/ramidcor",
            "version": "0.0.1.0"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Spain"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "cmd": "midcor(infile='<path_to_description>',dadir='<path_to_Ramid_results/\\>')",
            "input": [
                {
                    "data": {
                        "term": "Mass spectrometry data",
                        "uri": "http://edamontology.org/data_2536"
                    },
                    "format": [
                        {
                            "term": "TIDE TXT",
                            "uri": "http://edamontology.org/format_3835"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Mass spectrum",
                        "uri": "http://edamontology.org/data_0943"
                    },
                    "format": [
                        {
                            "term": "TIDE TXT",
                            "uri": "http://edamontology.org/format_3835"
                        }
                    ]
                }
            ],
            "note": "Midcor takes the mass spectra extracted from raw data by Ramid and produces corrected spectra saving them in a text file.",
            "operation": [
                {
                    "term": "Spectrum calculation",
                    "uri": "http://edamontology.org/operation_3860"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Mass spectrum",
                        "uri": "http://edamontology.org/data_0943"
                    },
                    "format": [
                        {
                            "term": "TIDE TXT",
                            "uri": "http://edamontology.org/format_3835"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/seliv55/ramidcor",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:27Z",
    "license": "Freeware",
    "link": [
        {
            "note": "Code and examples on Github",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/seliv55/ramidcor"
        }
    ],
    "name": "Midcor",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "vitaly",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1513-3",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Tracing stable isotopes, such as 13C using various mass spectrometry (MS) methods provides a valuable information necessary for the study of biochemical processes in cells. However, extracting such information requires special care, such as a correction for naturally occurring isotopes, or overlapping mass spectra of various components of the cell culture medium. Developing a method for a correction of overlapping peaks is the primary objective of this study. Results: Our computer program-MIDcor (free at https://github.com/seliv55/mid_correct) written in the R programming language, corrects the raw MS spectra both for the naturally occurring isotopes and for the overlapping of peaks corresponding to various substances. To this end, the mass spectra of unlabeled metabolites measured in two media are necessary: in a minimal medium containing only derivatized metabolites and chemicals for derivatization, and in a complete cell incubated medium. The MIDcor program calculates the difference (D) between the theoretical and experimentally measured spectra of metabolites containing only the naturally occurring isotopes. The result of comparison of D in the two media determines a way of deciphering the true spectra. (1) If D in the complete medium is greater than that in the minimal medium in at least one peak, then unchanged D is subtracted from the raw spectra of the labeled metabolite. (2) If D does not depend on the medium, then the spectrum probably overlaps with a derivatized fragment of the same metabolite, and D is modified proportionally to the metabolite labeling. The program automatically reaches a decision regarding the way of correction. For some metabolites/fragments in the case (2) D was found to decrease when the tested substance was 13C labeled, and this isotopic effect also can be corrected automatically, if the user provides a measured spectrum of the substance in which the 13C labeling is known a priori. Conclusion: Using the developed program improves the reliability of stable isotope tracer data analysis.",
                "authors": [
                    {
                        "name": "Aguilar E."
                    },
                    {
                        "name": "Benito A."
                    },
                    {
                        "name": "Cascante M."
                    },
                    {
                        "name": "Centelles J.J."
                    },
                    {
                        "name": "Jayaraman A."
                    },
                    {
                        "name": "Lee P.W.N."
                    },
                    {
                        "name": "Marin S."
                    },
                    {
                        "name": "Miranda A."
                    },
                    {
                        "name": "Polat I.H."
                    },
                    {
                        "name": "Selivanov V.A."
                    }
                ],
                "citationCount": 5,
                "date": "2017-02-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MIDcor, an R-program for deciphering mass interferences in mass spectra of metabolites enriched in stable isotopes"
            },
            "pmcid": "PMC5291980",
            "pmid": "28158972",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1007/978-1-0716-0159-4_12",
            "metadata": {
                "abstract": "© Springer Science+Business Media, LLC, part of Springer Nature 2020.Stable isotope-resolved metabolomics (SIRM), based on the analysis of biological samples from living cells incubated with artificial isotope enriched substrates, enables mapping the rates of biochemical reactions (metabolic fluxes). We developed software supporting a workflow of analysis of SIRM data obtained with mass spectrometry (MS). The evaluation of fluxes starting from raw MS recordings requires at least three steps of computer support: first, extraction of mass spectra of metabolites of interest, then correction of the spectra for natural isotope abundance, and finally, evaluation of fluxes by simulation of the corrected spectra using a corresponding mathematical model. A kinetic model based on ordinary differential equations (ODEs) for isotopomers of metabolites of the corresponding biochemical network supports the final part of the analysis, which provides a dynamic flux map.",
                "authors": [
                    {
                        "name": "Cascante M."
                    },
                    {
                        "name": "Fan T.W.-M."
                    },
                    {
                        "name": "Higashi R.M."
                    },
                    {
                        "name": "Lane A.N."
                    },
                    {
                        "name": "Marin S."
                    },
                    {
                        "name": "Selivanov V.A."
                    },
                    {
                        "name": "Tarrago-Celada J."
                    },
                    {
                        "name": "de Atauri P."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Software supporting a workflow of quantitative dynamic flux maps estimation in central metabolism from SIRM experimental data"
            },
            "pmid": "31893378",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Fluxomics",
            "uri": "http://edamontology.org/topic_3955"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ],
    "validated": 1,
    "version": [
        "0.0.1.0"
    ]
}
