{
    "name": "HyperPrior", 
    "description": "Hypergraph-based semi-supervised learning algorithm to classify gene expression and arrayCGH data using biological knowledge as constraints on graph-based learning.", 
    "homepage": "http://compbio.cs.umn.edu/HyperPrior/", 
    "biotoolsID": "hyperprior", 
    "biotoolsCURIE": "biotools:hyperprior", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Gene expression analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }, 
        {
            "uri": "http://edamontology.org/topic_0622", 
            "term": "Genomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3321", 
            "term": "Molecular genetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/hyperprior-classify-gene-expression-arraycgh-data-prior-knowledge.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://compbio.cs.umn.edu/HyperPrior/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "19648139", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "A hypergraph-based learning algorithm for classifying gene expression and arrayCGH data with prior knowledge", 
                "abstract": "Motivation: Incorporating biological prior knowledge into predictive models is a challenging data integration problem in analyzing high-dimensional genomic data. We introduce a hypergraph-based semi-supervised learning algorithm called HyperPrior to classify gene expression and array-based comparative genomic hybridization (arrayCGH) data using biological knowledge as constraints on graph-based learning. HyperPrior is a robust two-step iterative method that alternatively finds the optimal labeling of the samples and the optimal weighting of the features, guided by constraints encoding prior knowledge. The prior knowledge for analyzing gene expression data is that cancer-related genes tend to interact with each other in a protein-protein interaction network. Similarly, the prior knowledge for analyzing arrayCGH data is that probes that are spatially nearby in their layout along the chromosomes tend to be involved in the same amplification or deletion event. Based on the prior knowledge, HyperPrior imposes a consistent weighting of the correlated genomic features in graph-based learning. Results: We applied HyperPrior to test two arrayCGH datasets and two gene expression datasets for both cancer classification and biomarker identification. On all the datasets, HyperPrior achieved competitive classification performance, compared with SVMs and the other baselines utilizing the same prior knowledge. HyperPrior also identified several discriminative regions on chromosomes and discriminative subnetworks in the PPI, both of which contain cancer-related genomic elements. Our results suggest that HyperPrior is promising in utilizing biological prior knowledge to achieve better classification performance and more biologically interpretable findings in gene expression and arrayCGH data. © The Author 2009. Published by Oxford University Press. All rights reserved.", 
                "date": "2009-11-09T00:00:00Z", 
                "citationCount": 47, 
                "authors": [
                    {
                        "name": "Tian Z."
                    }, 
                    {
                        "name": "Hwang T."
                    }, 
                    {
                        "name": "Kuang R."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Rui Kuang", 
            "email": null, 
            "url": "http://compbio.cs.umn.edu/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:46:40Z", 
    "lastUpdate": "2018-12-10T12:58:43Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}