{
    "additionDate": "2017-04-21T12:12:19Z",
    "biotoolsCURIE": "biotools:dbd2bs",
    "biotoolsID": "dbd2bs",
    "credit": [
        {
            "name": "Support Forum",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://bugs.launchpad.net/ubuntu/+source/apache2"
        }
    ],
    "description": "Uses the structure of DNA binding domains (DBDs) to predict the corresponding binding sites on DNA. Queries can be specified by a PDB ID or the coordinates of a DNA-binding protein in PDB format.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://dbd2bs.csbb.ntu.edu.tw/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        }
    ],
    "homepage": "http://dbd2bs.csie.ntu.edu.tw/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:44Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/dbd2bs-connecting-dna-binding-protein-binding-sites.html"
        }
    ],
    "name": "DBD2BS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "By binding to short and highly conserved DNA sequences in genomes, DNA-binding proteins initiate, enhance or repress biological processes. Accurately identifying such binding sites, often represented by position weight matrices (PWMs), is an important step in understanding the control mechanisms of cells. When given coordinates of a DNA-binding domain (DBD) bound with DNA, a potential function can be used to estimate the change of binding affinity after base substitutions, where the changes can be summarized as a PWM. This technique provides an effective alternative when the chromatin immunoprecipitation data are unavailable for PWM inference. To facilitate the procedure of predicting PWMs based on protein-DNA complexes or even structures of the unbound state, the web server, DBD2BS, is presented in this study. The DBD2BS uses an atom-level knowledge-based potential function to predict PWMs characterizing the sequences to which the query DBD structure can bind. For unbound queries, a list of 1066 DBD-DNA complexes (including 1813 protein chains) is compiled for use as templates for synthesizing bound structures. The DBD2BS provides users with an easy-to-use interface for visualizing the PWMs predicted based on different templates and the spatial relationships of the query protein, the DBDs and the DNAs. The DBD2BS is the first attempt to predict PWMs of DBDs from unbound structures rather than from bound ones. This approach increases the number of existing protein structures that can be exploited when analyzing protein-DNA interactions. In a recent study, the authors showed that the kernel adopted by the DBD2BS can generate PWMs consistent with those obtained from the experimental data. The use of DBD2BS to predict PWMs can be incorporated with sequence-based methods to discover binding sites in genome-wide studies.Available at: http://dbd2bs.csie.ntu.edu.tw/, http://dbd2bs.csbb.ntu. edu.tw/, and http://dbd2bs.ee.ncku.edu.tw. © 2012 The Author(s).",
                "authors": [
                    {
                        "name": "Chang D.T.-H."
                    },
                    {
                        "name": "Chen C.-Y."
                    },
                    {
                        "name": "Chien T.-Y."
                    },
                    {
                        "name": "Lin C.-K."
                    },
                    {
                        "name": "Lin C.-W."
                    },
                    {
                        "name": "Weng Y.-Z."
                    }
                ],
                "citationCount": 3,
                "date": "2012-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DBD2BS: Connecting a DNA-binding protein with its binding sites"
            },
            "pmid": "22693214"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}
