{
    "additionDate": "2018-05-21T15:45:52Z",
    "biotoolsCURIE": "biotools:chilin",
    "biotoolsID": "chilin",
    "credit": [
        {
            "email": "1410771@tongji.edu.cn",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Comprehensive ChIP-seq and DNase-seq quality control and analysis pipeline.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cistrome.org/chilin/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cfce/chilin",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": "BSD-3-Clause",
    "name": "ChiLin",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1274-4",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Transcription factor binding, histone modification, and chromatin accessibility studies are important approaches to understanding the biology of gene regulation. ChIP-seq and DNase-seq have become the standard techniques for studying protein-DNA interactions and chromatin accessibility respectively, and comprehensive quality control (QC) and analysis tools are critical to extracting the most value from these assay types. Although many analysis and QC tools have been reported, few combine ChIP-seq and DNase-seq data analysis and quality control in a unified framework with a comprehensive and unbiased reference of data quality metrics. Results: ChiLin is a computational pipeline that automates the quality control and data analyses of ChIP-seq and DNase-seq data. It is developed using a flexible and modular software framework that can be easily extended and modified. ChiLin is ideal for batch processing of many datasets and is well suited for large collaborative projects involving ChIP-seq and DNase-seq from different designs. ChiLin generates comprehensive quality control reports that include comparisons with historical data derived from over 23,677 public ChIP-seq and DNase-seq samples (11,265 datasets) from eight literature-based classified categories. To the best of our knowledge, this atlas represents the most comprehensive ChIP-seq and DNase-seq related quality metric resource currently available. These historical metrics provide useful heuristic quality references for experiment across all commonly used assay types. Using representative datasets, we demonstrate the versatility of the pipeline by applying it to different assay types of ChIP-seq data. The pipeline software is available open source at https://github.com/cfce/chilin. Conclusion: ChiLin is a scalable and powerful tool to process large batches of ChIP-seq and DNase-seq datasets. The analysis output and quality metrics have been structured into user-friendly directories and reports. We have successfully compiled 23,677 profiles into a comprehensive quality atlas with fine classification for users.",
                "authors": [
                    {
                        "name": "Qin Q."
                    },
                    {
                        "name": "Mei S."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Sun H."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Taing L."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Li F."
                    },
                    {
                        "name": "Liu T."
                    },
                    {
                        "name": "Zang C."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Meyer C.A."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Brown M."
                    },
                    {
                        "name": "Long H.W."
                    },
                    {
                        "name": "Liu X.S."
                    }
                ],
                "citationCount": 37,
                "date": "2016-10-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ChiLin: A comprehensive ChIP-seq and DNase-seq quality control and analysis pipeline"
            },
            "pmcid": "PMC5048594",
            "pmid": "27716038"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ],
    "validated": 1
}