{
    "additionDate": "2023-12-06T13:26:32.440271Z",
    "biotoolsCURIE": "biotools:varsum",
    "biotoolsID": "varsum",
    "credit": [
        {
            "email": "anna.bernasconi@polimi.it",
            "name": "Anna Bernasconi",
            "orcidid": "https://orcid.org/0000-0001-8016-5750",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "Tommaso Alfonsi",
            "orcidid": "https://orcid.org/0000-0002-4707-8425",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ]
        },
        {
            "name": "ELIXIR-ITA",
            "typeEntity": "Project",
            "url": "https://elixir-italy.org/"
        },
        {
            "name": "ELIXIR-ITA-POLIMI",
            "typeEntity": "Project",
            "url": "https://www.deib.polimi.it/eng/elixir-iib"
        }
    ],
    "description": "VarSum is an API that returns summary statistics on user-defined populations and their variants, using the genomic data repository maintained by the genomic computing group (GeCo) at Politecnico di Milano.",
    "download": [
        {
            "note": "GitHub repository",
            "type": "Source code",
            "url": "https://github.com/DEIB-GECO/VarSum"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-POLIMI",
            "abernasconi"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Data",
        "Tools"
    ],
    "homepage": "https://github.com/DEIB-GECO/VarSum",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-12-14T07:01:41.339048Z",
    "name": "VarSum",
    "owner": "abernasconi",
    "publication": [
        {
            "doi": "10.1186/s12859-022-04927-0",
            "metadata": {
                "abstract": "Background: Population variant analysis is of great importance for gathering insights into the links between human genotype and phenotype. The 1000 Genomes Project established a valuable reference for human genetic variation; however, the integrative use of the corresponding data with other datasets within existing repositories and pipelines is not fully supported. Particularly, there is a pressing need for flexible and fast selection of population partitions based on their variant and metadata-related characteristics. Results: Here, we target general germline or somatic mutation data sources for their seamless inclusion within an interoperable-format repository, supporting integration among them and with other genomic data, as well as their integrated use within bioinformatic workflows. In addition, we provide VarSum, a data summarization service working on sub-populations of interest selected using filters on population metadata and/or variant characteristics. The service is developed as an optimized computational framework with an Application Programming Interface (API) that can be called from within any existing computing pipeline or programming script. Provided example use cases of biological interest show the relevance, power and ease of use of the API functionalities. Conclusions: The proposed data integration pipeline and data set extraction and summarization API pave the way for solid computational infrastructures that quickly process cumbersome variation data, and allow biologists and bioinformaticians to easily perform scalable analysis on user-defined partitions of large cohorts from increasingly available genetic variation studies. With the current tendency to large (cross)nation-wide sequencing and variation initiatives, we expect an ever growing need for the kind of computational support hereby proposed.",
                "authors": [
                    {
                        "name": "Alfonsi T."
                    },
                    {
                        "name": "Bernasconi A."
                    },
                    {
                        "name": "Canakoglu A."
                    },
                    {
                        "name": "Masseroli M."
                    }
                ],
                "citationCount": 1,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Genomic data integration and user-defined sample-set extraction for population variant analysis"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        }
    ]
}
