{
    "additionDate": "2018-07-30T09:05:09Z",
    "biotoolsCURIE": "biotools:bamsi",
    "biotoolsID": "bamsi",
    "credit": [
        {
            "email": "carl.nettelblad@it.uu.se",
            "name": "Carl Nettelblad",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The BAM Search Infrastructure - is a tool for extracting data from the 1000 Genomes phase 3 set of mapped reads (BAM files). It is a filtering tool - subsets of the ~60TB data can be specied and downloaded via the browser, with no need to download the entire data set.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bamsi.research.it.uu.se"
        }
    ],
    "download": [
        {
            "type": "API specification",
            "url": "https://github.com/NGDSG/BAMSI-API"
        },
        {
            "type": "Biological data",
            "url": "http://www.1000genomes.org/"
        },
        {
            "type": "Software package",
            "url": "https://github.com/NGDSG/BAMSI"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "http://bamsi.research.it.uu.se/",
    "homepage_status": 1,
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "name": "BAMSI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2241-z",
            "metadata": {
                "abstract": "© 2018 The Author(s).Background: The advent of next-generation sequencing (NGS) has made whole-genome sequencing of cohorts of individuals a reality. Primary datasets of raw or aligned reads of this sort can get very large. For scientific questions where curated called variants are not sufficient, the sheer size of the datasets makes analysis prohibitively expensive. In order to make re-analysis of such data feasible without the need to have access to a large-scale computing facility, we have developed a highly scalable, storage-agnostic framework, an associated API and an easy-to-use web user interface to execute custom filters on large genomic datasets. Results: We present BAMSI, a Software as-a Service (SaaS) solution for filtering of the 1000 Genomes phase 3 set of aligned reads, with the possibility of extension and customization to other sets of files. Unique to our solution is the capability of simultaneously utilizing many different mirrors of the data to increase the speed of the analysis. In particular, if the data is available in private or public clouds - an increasingly common scenario for both academic and commercial cloud providers - our framework allows for seamless deployment of filtering workers close to data. We show results indicating that such a setup improves the horizontal scalability of the system, and present a possible use case of the framework by performing an analysis of structural variation in the 1000 Genomes data set. Conclusions: BAMSI constitutes a framework for efficient filtering of large genomic data sets that is flexible in the use of compute as well as storage resources. The data resulting from the filter is assumed to be greatly reduced in size, and can easily be downloaded or routed into e.g. a Hadoop cluster for subsequent interactive analysis using Hive, Spark or similar tools. In this respect, our framework also suggests a general model for making very large datasets of high scientific value more accessible by offering the possibility for organizations to share the cost of hosting data on hot storage, without compromising the scalability of downstream analysis.",
                "authors": [
                    {
                        "name": "Ausmees K."
                    },
                    {
                        "name": "Hellander A."
                    },
                    {
                        "name": "John A."
                    },
                    {
                        "name": "Nettelblad C."
                    },
                    {
                        "name": "Toor S.Z."
                    }
                ],
                "citationCount": 3,
                "date": "2018-06-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BAMSI: A multi-cloud service for scalable distributed filtering of massive genome data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Next generation sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
