{
    "additionDate": "2019-11-14T18:14:40Z",
    "biotoolsCURIE": "biotools:DynOVis",
    "biotoolsID": "DynOVis",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "tim.kuijpers@maastrichtuniversity.nl",
            "name": "T. J. M. Kuijpers",
            "orcidid": "https://orcid.org/0000-0002-6690-1245",
            "typeEntity": "Person"
        }
    ],
    "description": "a web tool to study dynamic perturbations for capturing dose-over-time effects in biological networks | BACKGROUND:The development of high throughput sequencing techniques provides us with the possibilities to obtain large data sets, which capture the effect of dynamic perturbations on cellular processes. However, because of the dynamic nature of these processes, the analysis of the results is challenging. Therefore, there is a great need for bioinformatics tools that address this problem. RESULTS:Here we present DynOVis, a network visualization tool that can capture dynamic dose-over-time effects in biological networks. DynOVis is an integrated work frame of R packages and JavaScript libraries and offers a force-directed graph network style, involving multiple network analysis methods such as degree threshold, but more importantly, it allows for node expression animations as well as a frame-by-frame view of the dynamic exposure",
    "download": [
        {
            "type": "Source code",
            "url": "https://bitbucket.org/mutgx/dynovis/src"
        },
        {
            "type": "Source code",
            "url": "https://bitbucket.org/mutgx/dynovis/src/master"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                }
            ]
        }
    ],
    "homepage": "https://tjmkuijpers.shinyapps.io/dynovistool/",
    "language": [
        "R",
        "JavaScript"
    ],
    "lastUpdate": "2019-11-14T18:14:40Z",
    "name": "DynOVis",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2995-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The development of high throughput sequencing techniques provides us with the possibilities to obtain large data sets, which capture the effect of dynamic perturbations on cellular processes. However, because of the dynamic nature of these processes, the analysis of the results is challenging. Therefore, there is a great need for bioinformatics tools that address this problem. Results: Here we present DynOVis, a network visualization tool that can capture dynamic dose-over-time effects in biological networks. DynOVis is an integrated work frame of R packages and JavaScript libraries and offers a force-directed graph network style, involving multiple network analysis methods such as degree threshold, but more importantly, it allows for node expression animations as well as a frame-by-frame view of the dynamic exposure. Valuable biological information can be highlighted on the nodes in the network, by the integration of various databases within DynOVis. This information includes pathway-to-gene associations from ConsensusPathDB, disease-to-gene associations from the Comparative Toxicogenomics databases, as well as Entrez gene ID, gene symbol, gene synonyms and gene type from the NCBI database. Conclusions: DynOVis could be a useful tool to analyse biological networks which have a dynamic nature. It can visualize the dynamic perturbations in biological networks and allows the user to investigate the changes over time. The integrated data from various online databases makes it easy to identify the biological relevance of nodes in the network. With DynOVis we offer a service that is easy to use and does not require any bioinformatics skills to visualize a network.",
                "authors": [
                    {
                        "name": "Kuijpers T.J.M."
                    },
                    {
                        "name": "Wolters J.E.J."
                    },
                    {
                        "name": "Kleinjans J.C.S."
                    },
                    {
                        "name": "Jennen D.G.J."
                    }
                ],
                "date": "2019-08-13T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DynOVis: A web tool to study dynamic perturbations for capturing dose-over-time effects in biological networks"
            },
            "pmcid": "PMC6693283",
            "pmid": "31409281"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        }
    ]
}