{
    "additionDate": "2018-07-09T16:09:25Z",
    "biotoolsCURIE": "biotools:matcol",
    "biotoolsID": "matcol",
    "credit": [
        {
            "email": "info@cmri.org.au",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Measure fluorescence signal colocalisation in biological systems.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.cmri.org.au/bioinformatics.htm",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "MatCol",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/s41598-017-08786-1",
            "metadata": {
                "abstract": "© 2017 The Author(s).Protein colocalisation is often studied using pixel intensity-based coefficients such as Pearson, Manders, Li or Costes. However, these methods cannot be used to study object-based colocalisations in biological systems. Therefore, a novel method is required to automatically identify regions of fluorescent signal in two channels, identify the co-located parts of these regions, and calculate the statistical significance of the colocalisation. We have developed MatCol to address these needs. MatCol can be used to visualise protein and/or DNA colocalisations and fine tune user-defined parameters for the colocalisation analysis, including the application of median or Wiener filtering to improve the signal to noise ratio. Command-line execution allows batch processing of multiple images. Users can also calculate the statistical significance of the observed object colocalisations compared to overlap by random chance using Student's t-test. We validated MatCol in a biological setting. The colocalisations of telomeric DNA and TRF2 protein or TRF2 and PML proteins in >350 nuclei derived from three different cell lines revealed a highly significant correlation between manual and MatCol identification of colocalisations (linear regression R2 = 0.81, P < 0.0001). MatCol has the ability to replace manual colocalisation counting, and the potential to be applied to a wide range of biological areas.",
                "authors": [
                    {
                        "name": "Arthur J.W."
                    },
                    {
                        "name": "Khushi M."
                    },
                    {
                        "name": "Napier C.E."
                    },
                    {
                        "name": "Reddel R.R."
                    },
                    {
                        "name": "Smyth C.M."
                    }
                ],
                "citationCount": 12,
                "date": "2017-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "MatCol: A tool to measure fluorescence signal colocalisation in biological systems"
            }
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
