{
    "additionDate": "2020-01-14T20:19:29Z",
    "biotoolsCURIE": "biotools:alliance-genome",
    "biotoolsID": "alliance-genome",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "carol.bult@jax.org",
            "typeEntity": "Person"
        }
    ],
    "description": "A modern data ecosystem for model organism databases.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://www.alliancegenome.org",
    "lastUpdate": "2021-01-14T15:21:02Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/alliance-genome/"
        }
    ],
    "name": "Alliance Genome Resources",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1534/GENETICS.119.302523",
            "metadata": {
                "abstract": "Copyright © 2019 Bult et al.Model organisms are essential experimental platforms for discovering gene functions, defining protein and genetic networks, uncovering functional consequences of human genome variation, and for modeling human disease. For decades, researchers who use model organisms have relied on Model Organism Databases (MODs) and the Gene Ontology Consortium (GOC) for expertly curated annotations, and for access to integrated genomic and biological information obtained from the scientific literature and public data archives. Through the development and enforcement of data and semantic standards, these genome resources provide rapid access to the collected knowledge of model organisms in human readable and computation-ready formats that would otherwise require countless hours for individual researchers to assemble on their own. Since their inception, the MODs for the predominant biomedical model organisms [Mus sp. (laboratory mouse), Saccharomyces cerevisiae, Drosophila melanogaster, Caenorhabditis elegans, Danio rerio, and Rattus norvegicus] along with the GOC have operated as a network of independent, highly collaborative genome resources. In 2016, these six MODs and the GOC joined forces as the Alliance of Genome Resources (the Alliance). By implementing shared programmatic access methods and data-specific web pages with a unified “look and feel,” the Alliance is tackling barriers that have limited the ability of researchers to easily compare common data types and annotations across model organisms. To adapt to the rapidly changing landscape for evaluating and funding core data resources, the Alliance is building a modern, extensible, and operationally efficient “knowledge commons” for model organisms using shared, modular infrastructure.",
                "authors": [
                    {
                        "name": "Bult C.J."
                    },
                    {
                        "name": "Blake J.A."
                    },
                    {
                        "name": "Calvi B.R."
                    },
                    {
                        "name": "Cherry J.M."
                    },
                    {
                        "name": "DiFrancesco V."
                    },
                    {
                        "name": "Fullem R."
                    },
                    {
                        "name": "Howe K.L."
                    },
                    {
                        "name": "Kaufman T."
                    },
                    {
                        "name": "Mungall C."
                    },
                    {
                        "name": "Perrimon N."
                    },
                    {
                        "name": "Shimoyama M."
                    },
                    {
                        "name": "Sternberg P.W."
                    },
                    {
                        "name": "Thomas P."
                    },
                    {
                        "name": "Westerfield M."
                    }
                ],
                "citationCount": 9,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Genetics",
                "title": "The alliance of genome resources: Building a modern data ecosystem for model organism databases"
            },
            "pmcid": "PMC6893393",
            "pmid": "31796553"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Data governance",
            "uri": "http://edamontology.org/topic_3571"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ],
    "validated": 1
}