{
    "additionDate": "2017-12-18T00:03:06Z",
    "biotoolsCURIE": "biotools:4sale",
    "biotoolsID": "4sale",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biozentrum.uni-wuerzburg.de/bioinformatik"
        }
    ],
    "description": "4SALE allows a fast sequence and synchronous secondary structure alignment for large data sets and for the first time synchronous manual editing of aligned sequences and their secondary structures. This study describes an algorithm for the synchronous alignment of sequences and their associated secondary structures as well as the main features of 4SALE used for further analyses and editing. 4SALE builds an optimal and unique starting point for every RNA sequence and structure analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://4sale.bioapps.biozentrum.uni-wuerzburg.de/help_1.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "http://4sale.bioapps.biozentrum.uni-wuerzburg.de/index.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/4sale-1-6-synchronous-rna-sequence-secondary-structure-alignment-editing.html"
        }
    ],
    "name": "4SALE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1756-0500-1-91",
            "metadata": {
                "abstract": "Background: The function of a noncoding RNA sequence is mainly determined by its secondary structure and therefore a family of noncoding RNA sequences is much more conserved on the structural level than on the sequence level. Understanding the function of noncoding RNA sequence families requires two things: a hand-crafted or hand-improved alignment and detailed analyses of the secondary structures. There are several tools available that help performing these tasks, but all of them are specialized and focus on only one aspect, editing the alignment or plotting the secondary structure. The problem is both these tasks need to be performed simultaneously. Findings: 4SALE is designed to handle sequence and secondary structure information of RNAs synchronously. By including a complete new method of simultaneous visualization and editing RNA sequences and secondary structure information, 4SALE enables to improve and understand RNA sequence and secondary structure evolution much more easily. Conclusion: 4SALE is a step further for simultaneously handling RNA sequence and secondary structure information. It provides a complete new way of visual monitoring different structural aspects, while editing the alignment. The software is freely available and distributed from its website at http://4sale.bioapps.biozentrum.uni-wuerzburg.de/. © 2008 Wolf et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Seibel P.N."
                    },
                    {
                        "name": "Muller T."
                    },
                    {
                        "name": "Dandekar T."
                    },
                    {
                        "name": "Wolf M."
                    }
                ],
                "citationCount": 220,
                "date": "2008-12-01T00:00:00Z",
                "journal": "BMC Research Notes",
                "title": "Synchronous visual analysis and editing of RNA sequence and secondary structure alignments using 4SALE"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "1.7"
    ]
}