
{
    "credit": [
        {
            "email": "razzaghi@ut.ac.ir",
            "name": "Zahra Razaghi-Moghadam",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.cancerouspdomains.ir/downloads/Help.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s).Background: Discriminating driver mutations from the ones that play no role in cancer is a severe bottleneck in elucidating molecular mechanisms underlying cancer development. Since protein domains are representatives of functional regions within proteins, mutations on them may disturb the protein functionality. Therefore, studying mutations at domain level may point researchers to more accurate assessment of the functional impact of the mutations. Results: This article presents a comprehensive study to map mutations from 29 cancer types to both sequence- and structure-based domains. Statistical analysis was performed to identify candidate domains in which mutations occur with high statistical significance. For each cancer type, the corresponding type-specific domains were distinguished among all candidate domains. Subsequently, cancer type-specific domains facilitated the identification of specific proteins for each cancer type. Besides, performing interactome analysis on specific proteins of each cancer type showed high levels of interconnectivity among them, which implies their functional relationship. To evaluate the role of mitochondrial genes, stem cell-specific genes and DNA repair genes in cancer development, their mutation frequency was determined via further analysis. Conclusions: This study has provided researchers with a publicly available data repository for studying both CATH and Pfam domain regions on protein-coding genes. Moreover, the associations between different groups of genes/domains and various cancer types have been clarified. The work is available at http://www.cancerouspdomains.ir.",
            "authors": [
                "Hashemi S.",
                "Nowzari Dalini A.",
                "Jalali A.",
                "Banaei-Moghaddam A.M.",
                "Razaghi-Moghadam Z."
            ],
            "cit_count": 1,
            "doi": "10.1186/s12859-017-1779-5",
            "journal": "BMC Bioinformatics",
            "title": "Cancerouspdomains: Comprehensive analysis of cancer type-specific recurrent somatic mutations in proteins and domains",
            "type": "Primary",
            "year": "2017-08-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cancerouspdomains",
        "biotoolsID": "cancerouspdomains",
        "description": "Comprehensive analysis of cancer type-specific recurrent somatic mutations in proteins and domains.",
        "homepage": "http://www.cancerouspdomains.ir/",
        "name": "Cancerouspdomains"
    }
}