{
    "additionDate": "2020-01-14T19:48:26Z",
    "biotoolsCURIE": "biotools:SMART_App",
    "biotoolsID": "SMART_App",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "lu.chunlai@zs-hospital.sh.cn",
            "name": "Chunlai Lu",
            "orcidid": "https://orcid.org/0000-0003-4230-5120",
            "typeEntity": "Person"
        }
    ],
    "description": "an interactive web application for comprehensive DNA methylation analysis and visualization.\n\nBACKGROUND:Data mining of The Cancer Genome Atlas (TCGA) data has significantly facilitated cancer genome research and provided unprecedented opportunities for cancer researchers. However, existing web applications for DNA methylation analysis does not adequately address the need of experimental biologists, and many additional functions are often required. RESULTS:To facilitate DNA methylation analysis, we present the SMART (Shiny Methylation Analysis Resource Tool) App, a user-friendly and easy-to-use web application for comprehensively analyzing the DNA methylation data of TCGA project",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinfo-zs.com/smartapp",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T19:48:26Z",
    "name": "SMART App",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13072-019-0316-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Data mining of The Cancer Genome Atlas (TCGA) data has significantly facilitated cancer genome research and provided unprecedented opportunities for cancer researchers. However, existing web applications for DNA methylation analysis does not adequately address the need of experimental biologists, and many additional functions are often required. Results: To facilitate DNA methylation analysis, we present the SMART (Shiny Methylation Analysis Resource Tool) App, a user-friendly and easy-to-use web application for comprehensively analyzing the DNA methylation data of TCGA project. The SMART App integrates multi-omics and clinical data with DNA methylation and provides key interactive and customized functions including CpG visualization, pan-cancer methylation profile, differential methylation analysis, correlation analysis and survival analysis for users to analyze the DNA methylation in diverse cancer types in a multi-dimensional manner. Conclusion: The SMART App serves as a new approach for users, especially wet-bench scientists with no programming background, to analyze the scientific big data and facilitate data mining. The SMART App is available at http://www.bioinfo-zs.com/smartapp.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Ge D."
                    },
                    {
                        "name": "Lu C."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-05T00:00:00Z",
                "journal": "Epigenetics and Chromatin",
                "title": "The SMART App: An interactive web application for comprehensive DNA methylation analysis and visualization"
            },
            "pmcid": "PMC6894252",
            "pmid": "31805986"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}