{"credit":[{"name":"Contact form","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://vienna-ptm.univie.ac.at/?page_id=300"}],"documentation":[{"url":"http://vienna-ptm.univie.ac.at/?page_id=98"}],"function":[{"operation":[{"term":"Post-translation modification site prediction","uri":"http://edamontology.org/operation_0417"},{"term":"Molecular dynamics","uri":"http://edamontology.org/operation_2476"},{"term":"PTM localisation","uri":"http://edamontology.org/operation_3755"},{"term":"PTM identification","uri":"http://edamontology.org/operation_3645"},{"term":"Protein model validation","uri":"http://edamontology.org/operation_0321"}]}],"labels":{"language":["JavaScript","PHP","C++","SQL"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Protein modifications","uri":"http://edamontology.org/topic_0601"},{"term":"Molecular dynamics","uri":"http://edamontology.org/topic_0176"},{"term":"Protein structural motifs and surfaces","uri":"http://edamontology.org/topic_0166"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"publication":[{"abstract":"Post-translational modifications (PTMs) play a key role in numerous cellular processes by directly affecting structure, dynamics and interaction networks of target proteins. Despite their importance, our understanding of protein PTMs at the atomistic level is still largely incomplete. Molecular dynamics (MD) simulations, which provide high-resolution insight into biomolecular function and underlying mechanisms, are in principle ideally suited to tackle this problem. However, because of the challenges associated with the development of novel MD parameters and a general lack of suitable computational tools for incorporating PTMs in target protein structures, MD simulations of post-translationally modified proteins have historically lagged significantly behind the studies of unmodified proteins. Here, we present Vienna-PTM web server (http://vienna-ptm.univie.ac.at), a platform for automated introduction of PTMs of choice to protein 3D structures (PDB files) in a user-friendly visual environment. With 256 different enzymatic and non-enzymatic PTMs available, the server performs geometrically realistic introduction of modifications at sites of interests, as well as subsequent energy minimization. Finally, the server makes available force field parameters and input files needed to run MD simulations of modified proteins within the framework of the widely used GROMOS 54A7 and 45A3 force fields and GROMACS simulation package.","authors":["Margreitter C.","Petrov D.","Zagrovic B."],"cit_count":40,"journal":"Nucleic acids research","pmid":"23703210","title":"Vienna-PTM web server: a toolkit for MD simulations of protein post-translational modifications.","year":"2013-01-01"}],"summary":{"biotoolsCURIE":"biotools:vienna-ptm","biotoolsID":"vienna-ptm","description":"Vienna-PTM web server is a platform for automated introduction of post-translational modifications (PTMs) of choice to protein 3D structures.","homepage":"http://vienna-ptm.univie.ac.at","name":"Vienna-PTM"}}