{
    "additionDate": "2019-11-14T19:45:24Z",
    "biotoolsCURIE": "biotools:Scavenger",
    "biotoolsID": "Scavenger",
    "confidence_flag": "tool",
    "description": "A pipeline for recovery of unaligned reads utilising similarity with aligned reads | Rescue potential false negative unmapped reads in alignment tools | Manuscript available now on bioRxiv: https://www.biorxiv.org/content/early/2018/06/13/345876 | python3 usage: scavenger.py [options] -G/--genome_file <genome_file> -i/--input <input> -at/--aligner_tool <aligner>",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/VCCRI/Scavenger",
    "language": [
        "Shell",
        "Python"
    ],
    "lastUpdate": "2020-12-17T09:15:32Z",
    "license": "MIT",
    "name": "Scavenger",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.19426.1",
            "metadata": {
                "abstract": "© 2019 Yang A et al.Read alignment is an important step in RNA-seq analysis as the result of alignment forms the basis for downstream analyses. However, recent studies have shown that published alignment tools have variable mapping sensitivity and do not necessarily align all the reads which should have been aligned, a problem we termed as the false-negative non-alignment problem. Here we present Scavenger, a python-based bioinformatics pipeline for recovering unaligned reads using a novel mechanism in which a putative alignment location is discovered based on sequence similarity between aligned and unaligned reads. We showed that Scavenger could recover unaligned reads in a range of simulated and real RNA-seq datasets, including single-cell RNA-seq data. We found that recovered reads tend to contain more genetic variants with respect to the reference genome compared to previously aligned reads, indicating that divergence between personal and reference genomes plays a role in the false-negative non-alignment problem. Even when the number of recovered reads is relatively small compared to the total number of reads, the addition of these recovered reads can impact downstream analyses, especially in terms of estimating the expression and differential expression of lowly expressed genes, such as pseudogenes.",
                "authors": [
                    {
                        "name": "Ho J.W.K."
                    },
                    {
                        "name": "Yang A."
                    },
                    {
                        "name": "Tang J.Y.S."
                    },
                    {
                        "name": "Troup M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "Scavenger: A pipeline for recovery of unaligned reads utilising similarity with aligned reads"
            }
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}