{
    "additionDate": "2016-11-21T10:33:07Z",
    "biotoolsCURIE": "biotools:poseview",
    "biotoolsID": "poseview",
    "collectionID": [
        "de.NBI"
    ],
    "credit": [
        {
            "name": "University of Hamburg - Center for Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "rarey-office@zbh.uni-hamburg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This tool automatically creates two-dimensional diagrams which depict the protein-ligand interactions and conform to chemical drawing conventions. Directed interactions between protein and ligand are estimated by an integrated scoring scheme and depicted as lines between detailed structure diagrams for both protein residues and the ligand molecule.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proteinsplus.zbh.uni-hamburg.de/help/index"
        }
    ],
    "editPermission": {
        "authors": [
            "Bietz"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Germany"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    },
                    "format": [
                        {
                            "term": "PNG",
                            "uri": "http://edamontology.org/format_3603"
                        },
                        {
                            "term": "SVG",
                            "uri": "http://edamontology.org/format_3604"
                        },
                        {
                            "term": "PDF",
                            "uri": "http://edamontology.org/format_3508"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://proteinsplus.zbh.uni-hamburg.de/#poseview",
    "lastUpdate": "2020-06-08T15:26:48Z",
    "name": "PoseView",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "stierand",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btl150",
            "metadata": {
                "abstract": "Motivation: In this paper a new algorithmic approach is presented, which automatically generates structure diagrams of molecular complexes. A complex diagram contains the ligand, the amino acids of the protein interacting with the ligand and the hydrophilic interactions schematized as dashed lines between the corresponding atoms. The algorithm is based on a combinatorial optimization strategy which solves parts of the layout problem non-heuristically. The depicted molecules are represented as structure diagrams according to the chemical nomenclature. Due to the frequent usage of complex diagrams in the scientific literature as well as in text books dealing with structural biology, biochemistry and medicinal chemistry, the new algorithm is a key element for computer applications in these areas. Results: The method was implemented in the new software tool PoseView. It was tested on a representative dataset containing 305 protein - ligand complexes in total from the Brookhaven Protein Data Bank. PoseView was able to find collision-free layouts for more than three quarters of all complexes. In the following the layout generation algorithm is presented and, additional to the statistical results, representative test cases demonstrating the challenges of the layout generation will be discussed. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Stierand K."
                    },
                    {
                        "name": "Maass P.C."
                    },
                    {
                        "name": "Rarey M."
                    }
                ],
                "citationCount": 154,
                "date": "2006-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Molecular complexes at a glance: Automated generation of two-dimensional complex diagrams"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1002/cmdc.200700010",
            "metadata": {
                "abstract": "As a result of the increasing application of structure-based drug design, the visualization of protein-ligand complexes has become an important feature in medicinal chemistry. The large number of experimentally resolved complex structures and the further development of computer-aided methods like docking or de novo design establishes new possibilities in this field. During lead finding and optimization, a manual investigation of many complexes and their interaction patterns is typically performed. We present an algorithm that automatically generates 2D-protein-ligand diagrams as a possible solution for a transparent visualization of the contact partners in a complex and as a support for scientists in the evaluation of structure-based design results. Running the software on representative test data sets, it generates collision free layouts for ∼76% of the cases in the range of tenths of a second per complex. The success rate for complexes with ligands which have a molecular weight >500 Da is 87 %. © 2007 Wiley-VCH Verlag GmbH & Co. KGaA.",
                "authors": [
                    {
                        "name": "Stierand K."
                    },
                    {
                        "name": "Rarey M."
                    }
                ],
                "citationCount": 52,
                "date": "2007-06-11T00:00:00Z",
                "journal": "ChemMedChem",
                "title": "From modeling to medicinal chemistry: Automatic generation oft wo-dimensional complex diagrams"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}