{
    "additionDate": "2021-10-11T07:57:33.720318Z",
    "biotoolsCURIE": "biotools:mpradecoder",
    "biotoolsID": "mpradecoder",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "a.pindyurin@mcb.nsc.ru",
            "name": "Alexey V. Pindyurin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MPRAdecoder is a tool for processing of the raw MPRA data with a priori unknown sequences of the region of interest and associated barcodes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Code-master2020/MPRAdecoder",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-11T07:57:33.723010Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Code-master2020/MPRAdecoder/issues"
        }
    ],
    "name": "MPRAdecoder",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.618189",
            "metadata": {
                "abstract": "© Copyright © 2021 Letiagina, Omelina, Ivankin and Pindyurin.Massively parallel reporter assays (MPRAs) enable high-throughput functional evaluation of numerous DNA regulatory elements and/or their mutant variants. The assays are based on the construction of reporter plasmid libraries containing two variable parts, a region of interest (ROI) and a barcode (BC), located outside and within the transcription unit, respectively. Importantly, each plasmid molecule in a such a highly diverse library is characterized by a unique BC–ROI association. The reporter constructs are delivered to target cells and expression of BCs at the transcript level is assayed by RT-PCR followed by next-generation sequencing (NGS). The obtained values are normalized to the abundance of BCs in the plasmid DNA sample. Altogether, this allows evaluating the regulatory potential of the associated ROI sequences. However, depending on the MPRA library construction design, the BC and ROI sequences as well as their associations can be a priori unknown. In such a case, the BC and ROI sequences, their possible mutant variants, and unambiguous BC–ROI associations have to be identified, whereas all uncertain cases have to be excluded from the analysis. Besides the preparation of additional “mapping” samples for NGS, this also requires specific bioinformatics tools. Here, we present a pipeline for processing raw MPRA data obtained by NGS for reporter construct libraries with a priori unknown sequences of BCs and ROIs. The pipeline robustly identifies unambiguous (so-called genuine) BCs and ROIs associated with them, calculates the normalized expression level for each BC and the averaged values for each ROI, and provides a graphical visualization of the processed data.",
                "authors": [
                    {
                        "name": "Ivankin A.V."
                    },
                    {
                        "name": "Letiagina A.E."
                    },
                    {
                        "name": "Omelina E.S."
                    },
                    {
                        "name": "Pindyurin A.V."
                    }
                ],
                "date": "2021-05-11T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "MPRAdecoder: Processing of the Raw MPRA Data With a priori Unknown Sequences of the Region of Interest and Associated Barcodes"
            },
            "pmcid": "PMC8148044",
            "pmid": "34046055",
            "type": [
                "Primary"
            ]
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
