{
    "additionDate": "2021-01-18T11:02:49Z",
    "biotoolsCURIE": "biotools:pesuca",
    "biotoolsID": "pesuca",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ta.jaeger@salk.at",
            "name": "Tarkan Jäger",
            "typeEntity": "Person"
        }
    ],
    "description": "A new tool to quantify the resected peritoneal surface area after cytoreductive surgery.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Accessible surface calculation",
                    "uri": "http://edamontology.org/operation_0384"
                },
                {
                    "term": "Molecular surface calculation",
                    "uri": "http://edamontology.org/operation_0387"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://pesuca.net/",
    "lastUpdate": "2021-01-23T09:16:12Z",
    "name": "PESUCA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1515/PP-2019-0031",
            "metadata": {
                "abstract": "© 2020 Schredl et al., published by De Gruyter.The body surface area (BSA) is taken as a measure for the effective contact area for dosing in hyperthermic intraperitoneal chemotherapy (HIPEC). Currently, the pharmacokinetic effect of the reduced peritoneal surface area (PSA) after cytoreductive surgery (CRS) during HIPEC remains unclear. Here a proprietary software solution (PEritoneal SUrface CAlculator (PESUCA)) to quantify the resected PSA in patients with peritoneal surface malignancies (PSM) undergoing CRS and HIPEC is presented. The PESUCA tool was programmed as a desktop and online software solution. The applicability was evaluated in 36 patients. The programming-algorithm is briefly summarized as follows: (1) calculation of BSA, (2) correlation to PSA, (3) calculation of the relative proportion of 40 different anatomical regions to total PSA before CRS, (4) instantaneous input of each resected proportion in the 40 anatomical regions during CRS, and (5) determination of the resected and remaining PSA after CRS. The proof of concept revealed a mean PSA of all patients before CRS of 18,741 ± 321 cm2 compared to 13,611 ± 485 cm2 after CRS (p<0.0001). Patients' supramesocolic and inframesocolic visceral and parietal peritoneal area before and after CRS procedure were quantitatively determined. Here the first tool that enables detailed PSA quantification in patients with PSM undergoing CRS is presented. This makes the software a valuable contribution to ensue more accurate assessment and improved comparability of peritoneal disease extent. Furthermore, after external validation, PESUCA could be the basis for dose adjustment of intraperitoneal chemotherapy regimens based on the remaining PSA after CRS.",
                "authors": [
                    {
                        "name": "Emmanuel K."
                    },
                    {
                        "name": "Jager T."
                    },
                    {
                        "name": "Neureiter D."
                    },
                    {
                        "name": "Ramspott J.P."
                    },
                    {
                        "name": "Schredl P."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "Pleura and Peritoneum",
                "title": "The Peritoneal SUrface CAlculator (PESUCA): A new tool to quantify the resected peritoneal surface area after cytoreductive surgery"
            },
            "pmcid": "PMC7446256",
            "pmid": "32885035"
        }
    ],
    "topic": [
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Gastroenterology",
            "uri": "http://edamontology.org/topic_3409"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
