{
    "accessibility": [],
    "additionDate": "2017-01-13T13:16:13Z",
    "biotoolsCURIE": "biotools:scalce",
    "biotoolsID": "scalce",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "inumanag@sfu.oh",
            "gridid": null,
            "name": "SVALCE Support",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": "fhach@sfu.oh",
            "gridid": null,
            "name": "SVALCE Support",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "SCALCE (ske?lz) is fast FASTQ compression utility that utilizes locally consistent parsing for better compression rate. It achieves around 2X more compression than gzip alone.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://scalce.sourceforge.net",
    "homepage_status": 0,
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:46Z",
    "license": null,
    "link": [],
    "maturity": "Mature",
    "name": "SCALCE",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bts593",
            "metadata": {
                "abstract": "Motivation: The high throughput sequencing (HTS) platforms generate unprecedented amounts of data that introduce challenges for the computational infrastructure. Datamanagement, storage and analysis have become major logistical obstacles for those adopting the new platforms. The requirement for large investment for this purpose almost signalled the end of the Sequence Read Archive hosted at the National Center for Biotechnology Information (NCBI), which holds most of the sequence data generated world wide. Currently, most HTS data are compressed through general purpose algorithms such as gzip. These algorithms are not designed for compressing data generated by theHTSplatforms; for example, they do not take advantage of the specific nature of genomic sequence data, that is, limited alphabet size and high similarity among reads. Fast and efficient compression algorithms designed specifically forHTS data should be able to address some of the issues in data management, storage and communication. Such algorithms would also help with analysis provided they offer additional capabilities such as random access to any read and indexing for efficient sequence similarity search. Here we present SCALCE, a 'boosting' scheme based on Locally Consistent Parsing technique which reorganizes the reads in a way that results in a higher compression speed and compression rate, independent of the compression algorithm in use and without using a reference genome. Results: Our tests indicate that SCALCE can improve the compression rate achieved through gzip by a factor of 4.19-when the goal is to compress the reads alone. In fact, on SCALCE reordered reads gzip running time can improve by a factor of 15.06 on a standard PC with a single core and 6 GB memory. Interestingly even the running time of SCALCE \\+ gzip improves that of gzip alone by a factor of 2.09. When compared with the recently published BEETL, which aims to sort the (inverted) reads in lexicographic order for improving bzip2 SCALCE\\+gzip provides up to 2.01 times better compression while improving the running time by a factor of 5.17. SCALCE also provides the option to compress the quality scores as well as the read names in addition to the reads themselves. This is achieved by compressing the quality scores through order-3 Arithmetic Coding (AC) and the read names through gzip through the reordering SCALCE provides on the reads. This way, in comparison with gzip compression of the unordered FASTQ files (including reads, read names and quality scores), SCALCE (together with gzip and arithmetic encoding) can provide up to 3.34 improvement in the compression rate and 1.26 improvement in running time. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Hach F."
                    },
                    {
                        "name": "Numanagic I."
                    },
                    {
                        "name": "Alkan C."
                    },
                    {
                        "name": "Sahinalp S.C."
                    }
                ],
                "citationCount": 74,
                "date": "2012-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SCALCE: Boosting sequence compression algorithms using locally consistent encoding"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": []
}