
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.awi.de/en/science/special-groups/scientific-computing/bioinformatics/software.html"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "https://www.awi.de/fileadmin/user_upload/AWI/Forschung/Besondere_Gruppen/Wissenschaftliches_Rechnen/Download/UG_PhylochipAnalyzer.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Windows"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Probes",
                "uri": "http://edamontology.org/topic_0632"
            },
            {
                "term": "ChiP",
                "uri": "http://edamontology.org/topic_3179"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/phylochipanalyzer-1-0-analyse-hierarchical-probe-sets.html"
        }
    ],
    "publication": [
        {
            "abstract": "Advances in next-generation sequencing technologies are providing longer nucleotide sequence reads that contain more information about phylogenetic relationships. We sought to use this information to understand the evolution and ecology of bacterioplankton at our long-term study site in the Western Sargasso Sea. A bioinformatics pipeline called PhyloAssigner was developed to align pyrosequencing reads to a reference multiple sequence alignment of 16S ribosomal RNA (rRNA) genes and assign them phylogenetic positions in a reference tree using a maximum likelihood algorithm. Here, we used this pipeline to investigate the ecologically important SAR11 clade of Alphaproteobacteria. A combined set of 2.7 million pyrosequencing reads from the 16S rRNA V1-V2 regions, representing 9 years at the Bermuda Atlantic Time-series Study (BATS) site, was quality checked and parsed into a comprehensive bacterial tree, yielding 929 036 Alphaproteobacteria reads. Phylogenetic structure within the SAR11 clade was linked to seasonally recurring spatiotemporal patterns. This analysis resolved four new SAR11 ecotypes in addition to five others that had been described previously at BATS. The data support a conclusion reached previously that the SAR11 clade diversified by subdivision of niche space in the ocean water column, but the new data reveal a more complex pattern in which deep branches of the clade diversified repeatedly across depth strata and seasonal regimes. The new data also revealed the presence of an unrecognized clade of Alphaproteobacteria, here named SMA-1 (Sargasso Mesopelagic Alphaproteobacteria, group 1), in the upper mesopelagic zone. The high-resolution phylogenetic analyses performed herein highlight significant, previously unknown, patterns of evolutionary diversification, within perhaps the most widely distributed heterotrophic marine bacterial clade, and strongly links to ecosystem regimes. © 2013 International Society for Microbial Ecology All rights reserved.",
            "authors": [
                "Vergin K.L.",
                "Beszteri B.",
                "Monier A.",
                "Cameron Thrash J.",
                "Temperton B.",
                "Treusch A.H.",
                "Kilpert F.",
                "Worden A.Z.",
                "Giovannoni S.J."
            ],
            "cit_count": 72,
            "doi": "10.1038/ismej.2013.32",
            "journal": "ISME Journal",
            "title": "High-resolution SAR11 ecotype dynamics at the Bermuda Atlantic Time-series Study site by phylogenetic placement of pyrosequences",
            "type": "Primary",
            "year": "2013-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:phylochipanalyzer",
        "biotoolsID": "phylochipanalyzer",
        "description": "PhylochipAnalyzer is a Windows-program for the analysis of experiments with hierarchical probe-sets. It operates in two modes: first, the hierarchy of probes is defined interactively, second, the intensity data of a hybridized chip is loaded and analyzed according to the hierarchy. The program can export hierarchy trees to Newick-format and analyzed data to Excel. It contains a Delphi-script that makes it configurable with respect to different criteria for positive signals.",
        "homepage": "http://www.awi.de/en/science/special-groups/scientific-computing/bioinformatics/software.html",
        "name": "PhylochipAnalyzer",
        "version": [
            "1.0"
        ]
    }
}