{
    "additionDate": "2021-01-18T09:57:29Z",
    "biotoolsCURIE": "biotools:tripal-galaxy",
    "biotoolsID": "tripal-galaxy",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stephen.ficklin@wsu.edu",
            "name": "Stephen P Ficklin",
            "typeEntity": "Person"
        }
    ],
    "description": "The Tripal Galaxy module is designed to support integration of Tripal with Galaxy. It uses the blend4php library. In the past, community databases have often provided analytical tools that come prepared with site-specific data. Examples include BLAST, CAP3, and InterProScan servers, for example. By integrating Tripal with Galaxy, the Tripal-based community database can offer more complicated analytical tools that support larger data sets using Galaxy as a backend.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://tripal-galaxy.readthedocs.io/en/latest/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://tripal-galaxy.readthedocs.io/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://tripal.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tripal/tripal_galaxy",
    "language": [
        "PHP",
        "JavaScript"
    ],
    "lastUpdate": "2021-03-05T16:38:27Z",
    "license": "GPL-2.0",
    "name": "Tripal Galaxy",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAAA032",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Online biological databases housing genomics, genetic and breeding data can be constructed using the Tripal toolkit. Tripal is an open-source, internationally developed framework that implements FAIR data principles and is meant to ease the burden of constructing such websites for research communities. Use of a common, open framework improves the sustainability and manageability of such as site. Site developers can create extensions for their site and in turn share those extensions with others. One challenge that community databases often face is the need to provide tools for their users that analyze increasingly larger datasets using multiple software tools strung together in a scientific workflow on complicated computational resources. The Tripal Galaxy module, a 'plug-in' for Tripal, meets this need through integration of Tripal with the Galaxy Project workflow management system. Site developers can create workflows appropriate to the needs of their community using Galaxy and then share those for execution on their Tripal sites via automatically constructed, but configurable, web forms or using an application programming interface to power web-based analytical applications. The Tripal Galaxy module helps reduce duplication of effort by allowing site developers to spend time constructing workflows and building their applications rather than rebuilding infrastructure for job management of multi-step applications.",
                "authors": [
                    {
                        "name": "Spoor S."
                    },
                    {
                        "name": "Wytko C."
                    },
                    {
                        "name": "Soto B."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "Almsaeed A."
                    },
                    {
                        "name": "Condon B."
                    },
                    {
                        "name": "Herndon N."
                    },
                    {
                        "name": "Hough H."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Staton M."
                    },
                    {
                        "name": "Wegrzyn J."
                    },
                    {
                        "name": "Main D."
                    },
                    {
                        "name": "Feltus F.A."
                    },
                    {
                        "name": "Ficklin S.P."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Database",
                "title": "Tripal and Galaxy: Supporting reproducible scientific workflows for community biological databases"
            },
            "pmcid": "PMC7334887",
            "pmid": "32621602"
        }
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}