{
    "additionDate": "2024-02-09T09:51:46.207118Z",
    "biotoolsCURIE": "biotools:mtm",
    "biotoolsID": "mtm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yangence@pku.edu.cn",
            "name": "Ence Yang",
            "orcidid": "https://orcid.org/0000-0002-9526-2737",
            "typeEntity": "Person"
        }
    ],
    "description": "Multi-task learning framework to predict individualized tissue gene expression profiles.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://gscas-mtm.biodesign.ac.cn/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:17:12.953626Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/yangence/MTM"
        }
    ],
    "name": "MTM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad363",
            "metadata": {
                "abstract": "Motivation: Transcriptional profiles of diverse tissues provide significant insights in both fundamental and translational researches, while transcriptome information is not always available for tissues that require invasive biopsies. Alternatively, predicting tissue expression profiles from more accessible “surrogate” samples, especially blood transcriptome, has become a promising strategy when invasive procedures are not practical. However, existing approaches ignore tissue-shared intrinsic relevance, inevitably limiting predictive performance. Results: We propose a unified deep learning-based multi-task learning framework, multi-tissue transcriptome mapping (MTM), enabling the prediction of individualized expression profiles from any available tissue of an individual. By jointly leveraging individualized cross-tissue information from reference samples through multi-task learning, MTM achieves superior sample-level and gene-level performance on unseen individuals. With the high prediction accuracy and the ability to preserve individualized biological variations, MTM could facilitate both fundamental and clinical biomedical research. Availability and implementation: MTM’s code and documentation are available upon publication on GitHub (https://github.com/yangence/ MTM).",
                "authors": [
                    {
                        "name": "Bian Y."
                    },
                    {
                        "name": "Chen M."
                    },
                    {
                        "name": "He G."
                    },
                    {
                        "name": "Yang E."
                    }
                ],
                "citationCount": 1,
                "date": "2023-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MTM: a multi-task learning framework to predict individualized tissue gene expression profiles"
            },
            "pmcid": "PMC10278940",
            "pmid": "37279739"
        },
        {
            "doi": "10.1002/biot.202200578",
            "metadata": {
                "abstract": "Recent advances in biofoundries have enabled the construction of a large quantity of strains in parallel, accelerating the design-build-test-learn (DBTL) cycles for strain development. However, the construction of a large number of strains by iterative gene manipulation is still time-consuming and costly, posing a challenge for the development of commercial strains. Common gene manipulations among different objective strains open up the possibility of reducing cost and time for strain construction in biofoundries by optimizing genetic manipulation schedules. A method is introduced consisting of two complementary algorithms for designing optimal parent-children manipulation schedules for strain construction: greedy search of common ancestor strains (GSCAS) and minimizing total manipulations (MTM). By reusing common ancestor strains, the number of strains to be constructed can be effectively reduced, resulting in a tree-like structure of descendants instead of linear lineages for each strain. The GSCAS algorithm can quickly find common ancestor strains and clusters them together based on their genetic makeup, and the MTM algorithm subsequently minimize the genetic manipulations required, resulting in a further reduction in the total number of genetic manipulations. The effectiveness of our method is demonstrated through a case study of 94 target strains, where GSCAS reduces an average of 36% of the total gene manipulations, and MTM reduces an additional 10%. The performance of both algorithms is robust among case studies with different average occurrences of gene manipulations across objective strains. Our method potentially improves cost efficiency and accelerate the development of commercial strains significantly. The implementation of the methods can be freely accessed via https://gscas-mtm.biodesign.ac.cn/.",
                "authors": [
                    {
                        "name": "Cai J."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liao X."
                    },
                    {
                        "name": "Ma H."
                    },
                    {
                        "name": "Mao Y."
                    },
                    {
                        "name": "Wang R."
                    }
                ],
                "citationCount": 2,
                "date": "2023-09-01T00:00:00Z",
                "journal": "Biotechnology Journal",
                "title": "Designing gene manipulation schedules for high throughput parallel construction of objective strains"
            },
            "pmid": "37300341"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
