{
    "accessibility": "Open access",
    "additionDate": "2022-01-19T22:42:07.141614Z",
    "biotoolsCURIE": "biotools:ideepsubmito",
    "biotoolsID": "ideepsubmito",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lixt314@jlu.edu.cn",
            "name": "Xiangtao Li",
            "typeEntity": "Person"
        },
        {
            "name": "Hui Li"
        },
        {
            "name": "Ka-chun Wong"
        },
        {
            "name": "Yuning Yang"
        },
        {
            "name": "Zilong Hou"
        }
    ],
    "description": "identification of protein submitochondrial localization with deep learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "https://github.com/houzl3416/iDeepSubMito",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-19T22:42:07.144250Z",
    "license": "Not licensed",
    "name": "iDeepSubMito",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB288",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Mitochondria are membrane-bound organelles containing over 1000 different proteins involved in mitochondrial function, gene expression and metabolic processes. Accurate localization of those proteins in the mitochondrial compartments is critical to their operation. A few computational methods have been developed for predicting submitochondrial localization from the protein sequences. Unfortunately, most of these computational methods focus on employing biological features or evolutionary information to extract sequence features, which greatly limits the performance of subsequent identification. Moreover, the efficiency of most computational models is still under explored, especially the deep learning feature, which is promising but requires improvement. To address these limitations, we propose a novel computational method called iDeepSubMito to predict the location of mitochondrial proteins to the submitochondrial compartments. First, we adopted a coding scheme using the ProteinELMo to model the probability distribution over the protein sequences and then represent the protein sequences as continuous vectors. Then, we proposed and implemented convolutional neural network architecture based on the bidirectional LSTM with self-attention mechanism, to effectively explore the contextual information and protein sequence semantic features. To demonstrate the effectiveness of our proposed iDeepSubMito, we performed cross-validation on two datasets containing 424 proteins and 570 proteins respectively, and consisting of four different mitochondrial compartments (matrix, inner membrane, outer membrane and intermembrane regions). Experimental results revealed that our method outperformed other computational methods. In addition, we tested iDeepSubMito on the M187, M983 and MitoCarta3.0 to further verify the efficiency of our method. Finally, the motif analysis and the interpretability analysis were conducted to reveal novel insights into subcellular biological functions of mitochondrial proteins. iDeepSubMito source code is available on GitHub at https://github.com/houzl3416/iDeepSubMito.",
                "authors": [
                    {
                        "name": "Hou Z."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Wong K.-C."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-11-05T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "iDeepSubMito: identification of protein submitochondrial localization with deep learning"
            },
            "pmid": "34337657"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}
