{
    "name": "UPB", 
    "description": "UPB is an Urinary Protein Biomarker database to collect existing studies of urinary protein biomarkers from published literature.", 
    "homepage": "http://59.108.16.249/biomarker/web/indexdb", 
    "biotoolsID": "upb", 
    "biotoolsCURIE": "biotools:upb", 
    "version": [
        "20130710"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2479", 
                    "term": "Protein sequence analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3360", 
            "term": "Biomarkers"
        }, 
        {
            "uri": "http://edamontology.org/topic_3678", 
            "term": "Experimental design and studies"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "JavaScript"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/upb-20130710-urine-protein-biomarker-database.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://59.108.16.249/biomarker/web/indexdb", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1074/mcp.M111.010975", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A tool for biomarker discovery in the urinary proteome: A manually curated human and animal urine protein biomarker database", 
                "abstract": "Urine is an important source of biomarkers. A single proteomics assay can identify hundreds of differentially expressed proteins between disease and control samples; however, the ability to select biomarker candidates with the most promise for further validation study remains difficult. A bioinformatics tool that allows accurate and convenient comparison of all of the existing related studies can markedly aid the development of this area. In this study, we constructed the Urinary Protein Biomarker (UPB) database to collect existing studies of urinary protein biomarkers from published literature. To ensure the quality of data collection, all literature was manually curated. The website (http://122.70.220.102/biomarker) allows users to browse the database by disease categories and search by protein IDs in bulk. Researchers can easily determine whether a biomarker candidate has already been identified by another group for the same disease or for other diseases, which allows for the confidence and disease specificity of their biomarker candidate to be evaluated. Additionally, the pathophysiological processes of the diseases can be studied using our database with the hypothesis that diseases that share biomarkers may have the same pathophysiological processes. Because of the natural relationship between urinary proteins and the urinary system, this database may be especially suitable for studying the pathogenesis of urological diseases. Currently, the database contains 553 and 275 records compiled from 174 and 31 publications of human and animal studies, respectively. We found that biomarkers identified by different proteomic methods had a poor overlap with each other. The differences between sample preparation and separation methods, mass spectrometers, and data analysis algorithms may be influencing factors. Biomarkers identified from animal models also overlapped poorly with those from human samples, but the overlap rate was not lower than that of human proteomics studies. Therefore, it is not clear how well the animal models mimic human diseases. © 2011 by The American Society for Biochemistry and Molecular Biology, Inc.", 
                "date": "2011-11-01T00:00:00Z", 
                "citationCount": 43, 
                "authors": [
                    {
                        "name": "Shao C."
                    }, 
                    {
                        "name": "Li M."
                    }, 
                    {
                        "name": "Li X."
                    }, 
                    {
                        "name": "Wei L."
                    }, 
                    {
                        "name": "Zhu L."
                    }, 
                    {
                        "name": "Yang F."
                    }, 
                    {
                        "name": "Jia L."
                    }, 
                    {
                        "name": "Mu Y."
                    }, 
                    {
                        "name": "Wang J."
                    }, 
                    {
                        "name": "Guo Z."
                    }, 
                    {
                        "name": "Zhang D."
                    }, 
                    {
                        "name": "Yin J."
                    }, 
                    {
                        "name": "Wang Z."
                    }, 
                    {
                        "name": "Sun W."
                    }, 
                    {
                        "name": "Zhang Z."
                    }, 
                    {
                        "name": "Gao Y."
                    }
                ], 
                "journal": "Molecular and Cellular Proteomics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://122.70.220.102/biomarker/Contact.asp", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:13:56Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}