{
    "additionDate": "2018-06-04T20:14:14Z",
    "biotoolsCURIE": "biotools:indcaps",
    "biotoolsID": "indcaps",
    "credit": [
        {
            "email": "jkieber@unc.edu",
            "name": "Joseph J. Kieber",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A tool for generating primers suitable for CAPS or dCAPS analyses of sites with insertions or deletions as well as SNPs.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                }
            ]
        }
    ],
    "homepage": "http://indcaps.kieber.cloudapps.unc.edu/",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "indCAPS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0188406",
            "metadata": {
                "abstract": "© 2017 Hodgens et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Genetic manipulation of organisms using CRISPR/Cas9 technology generally produces small insertions/deletions (indels) that can be difficult to detect. Here, we describe a technique to easily and rapidly identify such indels. Sequence-identified mutations that alter a restriction enzyme recognition site can be readily distinguished from wild-type alleles using a cleaved amplified polymorphic sequence (CAPS) technique. If a restriction site is created or altered by the mutation such that only one allele contains the restriction site, a polymerase chain reaction (PCR) followed by a restriction digest can be used to distinguish the two alleles. However, in the case of most CRISPR-induced alleles, no such restriction sites are present in the target sequences. In this case, a derived CAPS (dCAPS) approach can be used in which mismatches are purposefully introduced in the oligonucleotide primers to create a restriction site in one, but not both, of the amplified templates. Web-based tools exist to aid dCAPS primer design, but when supplied sequences that include indels, the current tools often fail to suggest appropriate primers. Here, we report the development of a Python-based, species-agnostic web tool, called indCAPS, suitable for the design of PCR primers used in dCAPS assays that is compatible with indels. This tool should have wide utility for screening editing events following CRISPR/Cas9 mutagenesis as well as for identifying specific editing events in a pool of CRISPR-mediated mutagenesis events. This tool was field-tested in a CRISPR mutagenesis experiment targeting a cytokinin receptor (AHK3) in Arabidopsis thaliana. The tool suggested primers that successfully distinguished between wild-type and edited alleles of a target locus and facilitated the isolation of two novel ahk3 null alleles. Users can access indCAPS and design PCR primers to employ dCAPS to identify CRISPR/Cas9 alleles at http://indcaps.kieber.cloudapps.unc.edu/.",
                "authors": [
                    {
                        "name": "Hodgens C."
                    },
                    {
                        "name": "Nimchuk Z.L."
                    },
                    {
                        "name": "Kieber J.J."
                    }
                ],
                "citationCount": 7,
                "date": "2017-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "indCAPS: A tool for designing screening primers for CRISPR/Cas9 mutagenesis events"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Laboratory information management",
            "uri": "http://edamontology.org/topic_0607"
        }
    ],
    "validated": 1
}