{
    "additionDate": "2016-03-07T12:20:06Z",
    "biotoolsCURIE": "biotools:vsearch",
    "biotoolsID": "vsearch",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "UiO",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "torognes@ifi.uio.no",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "High-throughput search and clustering sequence analysis tool. It supports de novo and reference based chimera detection, clustering, full-length and prefix dereplication, reverse complementation, masking, all-vs-all pairwise global alignment, exact and global alignment searching, shuffling, subsampling and sorting. It also supports FASTQ file analysis, filtering and conversion.",
    "documentation": [
        {
            "type": "Citation instructions",
            "url": "https://github.com/torognes/vsearch"
        },
        {
            "type": "General",
            "url": "https://github.com/torognes/vsearch"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    }
                }
            ],
            "operation": [
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                },
                {
                    "term": "Chimera detection",
                    "uri": "http://edamontology.org/operation_0450"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence similarity score",
                        "uri": "http://edamontology.org/data_0865"
                    }
                },
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    }
                }
            ]
        }
    ],
    "homepage": "https://github.com/torognes/vsearch",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": "Repository",
            "url": "https://github.com/torognes/vsearch"
        }
    ],
    "maturity": "Mature",
    "name": "VSEARCH",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "UiO",
    "publication": [
        {
            "doi": "10.7717/peerj.2584",
            "metadata": {
                "abstract": "© 2016 Rognes et al. Background VSEARCH is an open source and free of charge multithreaded 64-bit tool for processing and preparing metagenomics, genomics and population genomics nucleotide sequence data. It is designed as an alternative to the widely used USEARCH tool (Edgar, 2010) for which the source code is not publicly available, algorithm details are only rudimentarily described, and only a memory-confined 32-bit version is freely available for academic use. Methods When searching nucleotide sequences, VSEARCH uses a fast heuristic based on words shared by the query and target sequences in order to quickly identify similar sequences, a similar strategy is probably used in USEARCH. VSEARCH then performs optimal global sequence alignment of the query against potential target sequences, using full dynamic programming instead of the seed-and-extend heuristic used by USEARCH. Pairwise alignments are computed in parallel using vectorisation and multiple threads. Results VSEARCH includes most commands for analysing nucleotide sequences available in USEARCH version 7 and several of those available in USEARCH version 8, including searching (exact or based on global alignment), clustering by similarity (using length pre-sorting, abundance pre-sorting or a user-defined order), chimera detection (reference-based or de novo), dereplication (full length or prefix), pairwise alignment, reverse complementation, sorting, and subsampling. VSEARCH also includes commands for FASTQ file processing, i.e., format detection, filtering, read quality statistics, and merging of paired reads. Furthermore, VSEARCH extends functionality with several new commands and improvements, including shuffling, rereplication, masking of low-complexity sequences with the well-known DUST algorithm, a choice among different similarity definitions, and FASTQ file format conversion. VSEARCH is here shown to be more accurate than USEARCH when performing searching, clustering, chimera detection and subsampling, while on a par with USEARCH for paired-ends read merging. VSEARCH is slower than USEARCH when performing clustering and chimera detection, but significantly faster when performing paired-end reads merging and dereplication. VSEARCH is available at https://github.com/torognes/vsearch under either the BSD 2-clause license or the GNU General Public License version 3.0. Discussion VSEARCH has been shown to be a fast, accurate and full-fledged alternative to USEARCH. A free and open-source versatile tool for sequence analysis is now available to the metagenomics community.",
                "authors": [
                    {
                        "name": "Rognes T."
                    },
                    {
                        "name": "Flouri T."
                    },
                    {
                        "name": "Nichols B."
                    },
                    {
                        "name": "Quince C."
                    },
                    {
                        "name": "Mahe F."
                    }
                ],
                "citationCount": 462,
                "date": "2016-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "VSEARCH: A versatile open source tool for metagenomics"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.9.0"
    ]
}