
{
    "credit": [
        {
            "email": "wmchen@virginia.edu",
            "name": "Wei-Min Chen",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://people.virginia.edu/~wc9c/GDT/manual.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/gdt-0-1-1-genome-wide-association-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Recent advances in genotyping technology make it possible to utilize large-scale association analysis for disease-gene mapping. Powerful and robust family-based association methods are crucial for successful gene mapping. We propose a family-based association method, the generalized disequilibrium test (GDT), in which the genotype differences of all discordant relative pairs are utilized in assessing association within a family. The improvement of the GDT over existing methods is threefold: (1) information beyond first-degree relatives is incorporated efficiently, yielding substantial gains in power in comparison to existing tests; (2) the GDT statistic is implemented via a robust technique that does not rely on large sample theory, resulting in further power gains, especially at high levels of significance; and (3) covariates and weights based on family size are incorporated. Advantages of the GDT over existing methods are demonstrated by extensive computer simulations and by application to recently published large-scale genome-wide linkage data from the Type 1 Diabetes Genetics Consortium (T1DGC). In our simulations, the GDT consistently outperforms other tests for a common disease and frequently outperforms other tests for a rare disease; the power improvement is > 13% in 6 out of 8 extended pedigree scenarios. All of the six strongest associations identified by the GDT have been reported by other studies, whereas only three or four of these associations can be identified by existing methods. For the T1D association at gene UBASH3A, the GDT resulted in a genome-wide significance (p = 4.3 × 10-6), much stronger than the published significance (p = 10-4). © 2009 The American Society of Human Genetics.",
            "authors": [
                "Chen W.-M.",
                "Manichaikul A.",
                "Rich S.S."
            ],
            "cit_count": 35,
            "journal": "American Journal of Human Genetics",
            "pmid": "19732865",
            "title": "A Generalized Family-Based Association Test for Dichotomous Traits",
            "year": "2009-09-11"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gdt",
        "biotoolsID": "gdt",
        "description": "Software package for genome-wide association analysis.",
        "homepage": "http://people.virginia.edu/~wc9c/GDT/",
        "name": "GDT"
    }
}