{
    "additionDate": "2021-01-18T07:00:43Z",
    "biotoolsCURIE": "biotools:bivartect",
    "biotoolsID": "bivartect",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ykato@rna.med.osaka-u.ac.jp",
            "name": "Yuki Kato",
            "orcidid": "https://orcid.org/0000-0002-1526-2754",
            "typeEntity": "Person"
        }
    ],
    "description": "Bivartect is a simple yet versatile variant caller based on direct comparison of short sequence reads between normal and mutated samples. Bivartect can detect not only single nucleotide variants but also insertions/deletions, inversions and their complexes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ykat0/bivartect",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-02-04T15:59:56Z",
    "name": "Bivartect",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA059",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press.Motivation: Genetic variant calling with high-throughput sequencing data has been recognized as a useful tool for better understanding of disease mechanism and detection of potential off-target sites in genome editing. Since most of the variant calling algorithms rely on initial mapping onto a reference genome and tend to predict many variant candidates, variant calling remains challenging in terms of predicting variants with low false positives. Results: Here we present Bivartect, a simple yet versatile variant caller based on direct comparison of short sequence reads between normal and mutated samples. Bivartect can detect not only single nucleotide variants but also insertions/deletions, inversions and their complexes. Bivartect achieves high predictive performance with an elaborate memory-saving mechanism, which allows Bivartect to run on a computer with a single node for analyzing small omics data. Tests with simulated benchmark and real genome-editing data indicate that Bivartect was comparable to state-of-the-art variant callers in positive predictive value for detection of single nucleotide variants, even though it yielded a substantially small number of candidates. These results suggest that Bivartect, a reference-free approach, will contribute to the identification of germline mutations as well as off-target sites introduced during genome editing with high accuracy.",
                "authors": [
                    {
                        "name": "Kato Y."
                    },
                    {
                        "name": "Kawahara Y."
                    },
                    {
                        "name": "Shimmura K."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Bivartect: Accurate and memory-saving breakpoint detection by direct read comparison"
            },
            "pmcid": "PMC7203739",
            "pmid": "31985791"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
