{
    "additionDate": "2016-10-30T05:58:49Z",
    "biotoolsCURIE": "biotools:beatsonlab-microbialgenomics",
    "biotoolsID": "beatsonlab-microbialgenomics",
    "credit": [
        {
            "email": "scott.beatson@uq.edu.au",
            "name": "Australia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "University of Queensland",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Software to understand the molecular mechanisms of infectious disease and to identify therapeutic and diagnostic targets via NGS data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BeatsonLab-MicrobialGenomics/BeatsonLab-MicrobialGenomics.github.io"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BeatsonLab-MicrobialGenomics",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:53Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/BeatsonLab-MicrobialGenomics"
        }
    ],
    "name": "BeatsonLab-MicrobialGenomics",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "mv.schneider@unimelb.edu.au",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr039",
            "metadata": {
                "abstract": "Summary: Easyfig is a Python application for creating linear comparison figures of multiple genomic loci with an easy-to-use graphical user interface. BLAST comparisons between multiple genomic regions, ranging from single genes to whole prokaryote chromosomes, can be generated, visualized and interactively coloured, enabling a rapid transition between analysis and the preparation of publication quality figures. © The Author(s) 2011. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Beatson S.A."
                    },
                    {
                        "name": "Petty N.K."
                    },
                    {
                        "name": "Sullivan M.J."
                    }
                ],
                "citationCount": 1214,
                "date": "2011-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Easyfig: A genome comparison visualizer"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2164-12-402",
            "metadata": {
                "abstract": "Background: Visualisation of genome comparisons is invaluable for helping to determine genotypic differences between closely related prokaryotes. New visualisation and abstraction methods are required in order to improve the validation, interpretation and communication of genome sequence information; especially with the increasing amount of data arising from next-generation sequencing projects. Visualising a prokaryote genome as a circular image has become a powerful means of displaying informative comparisons of one genome to a number of others. Several programs, imaging libraries and internet resources already exist for this purpose, however, most are either limited in the number of comparisons they can show, are unable to adequately utilise draft genome sequence data, or require a knowledge of command-line scripting for implementation. Currently, there is no freely available desktop application that enables users to rapidly visualise comparisons between hundreds of draft or complete genomes in a single image.Results: BLAST Ring Image Generator (BRIG) can generate images that show multiple prokaryote genome comparisons, without an arbitrary limit on the number of genomes compared. The output image shows similarity between a central reference sequence and other sequences as a set of concentric rings, where BLAST matches are coloured on a sliding scale indicating a defined percentage identity. Images can also include draft genome assembly information to show read coverage, assembly breakpoints and collapsed repeats. In addition, BRIG supports the mapping of unassembled sequencing reads against one or more central reference sequences. Many types of custom data and annotations can be shown using BRIG, making it a versatile approach for visualising a range of genomic comparison data. BRIG is readily accessible to any user, as it assumes no specialist computational knowledge and will perform all required file parsing and BLAST comparisons automatically.Conclusions: There is a clear need for a user-friendly program that can produce genome comparisons for a large number of prokaryote genomes with an emphasis on rapidly utilising unfinished or unassembled genome data. Here we present BRIG, a cross-platform application that enables the interactive generation of comparative genomic images via a simple graphical-user interface. BRIG is freely available for all operating systems at http://sourceforge.net/projects/brig/. © 2011 Alikhan et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Alikhan N."
                    },
                    {
                        "name": "Beatson S.A."
                    },
                    {
                        "name": "Ben Zakour N.L."
                    },
                    {
                        "name": "Petty N.K."
                    }
                ],
                "citationCount": 1333,
                "date": "2011-08-08T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "BLAST Ring Image Generator (BRIG): Simple prokaryote genome comparisons"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.7287/peerj.preprints.1037v1",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "validated": 1
}
