{
    "additionDate": "2020-01-14T20:08:56Z",
    "biotoolsCURIE": "biotools:GMultM",
    "biotoolsID": "GMultM",
    "confidence_flag": "medium",
    "description": "Generalized Multiplicative Model for Assessing Outcomes in Psychotherapy.\n\nThe study presents further development and application of generalized multiplicative models (GMultM) for assessing outcomes in psychotherapy. GMultM is a flexible nonlinear regression method which is able to predict the impact of subjects' psychological variables (common factors) as well as theirchanges on the outcomes of cognitive-behavioral therapy and rhythmic-movement therapy.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'RMT'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31855550",
    "lastUpdate": "2020-01-14T20:08:56Z",
    "name": "GMultM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "metadata": {
                "abstract": "The study presents further development and application of generalized multiplicative models (GMultM) for assessing outcomes in psychotherapy. GMultM is a flexible nonlinear regression method which is able to predict the impact of subjects' psychological variables (common factors) as well as theirchanges on the outcomes of cognitive-behavioral therapy and rhythmic-movement therapy. The main objectives of our present study are (a) to construct GMultM with the aim to predict the impact of pre-treatment scores of subject'psychological variables (common factors) on the outcome of cognitive-behavioral therapy (CBT) for disordered eating behaviors and obesity; (b) to employ GMultM to model the change of Body Mass Index (BMI) in each participant (non18 responders to CBT treatment) individually after sessions of rhythmic movement therapy (RMT); (c) to demonstrate that GMultM is able to predict whether intervention-related changes in several psychological variables are mechanisms underlying BMI change in each individual subject participating in RMT intervention program. The processes of model construction, identification of parameters and validation procedure using data from CBT program are described. Sensitivity analysis of the developed model was provided. Results revealed that: (a) the GMultM not only predicts the outcomes of psychotherapy satisfactorily but also allows obtaining the partial response functions of psychological predictors of weight loss directly as a result of estimation of model's parameters; (b) GMultM predicts the changes in BMI after RMT intervention in each participant satisfactorily and thus can be applied as the individualized assessment tool for psychotherapy's outcome.",
                "authors": [
                    {
                        "name": "Malkina-Pykh I.G."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nonlinear dynamics, psychology, and life sciences",
                "title": "Generalized Multiplicative Model for Assessing Outcomes in Psychotherapy: Disordered Eating Behaviors and Obesity"
            },
            "pmid": "31855550"
        }
    ]
}