{
    "accessibility": "Open access",
    "additionDate": "2022-05-27T14:14:42.826158Z",
    "biotoolsCURIE": "biotools:heganlda",
    "biotoolsID": "heganlda",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "201922802039@stu.hebut.edu.cn",
            "name": "Duanyang Wang"
        },
        {
            "email": "201932805012@stu.hebut.edu.cn",
            "name": "Zhenwu Yang"
        },
        {
            "email": "lijianwei@hebut.edu.cn",
            "name": "Jianwei Li"
        },
        {
            "email": "liuminglf@hebut.edu.cn",
            "name": "Ming Liu"
        }
    ],
    "description": "A computational model for predicting potential lncRNA-disease associations based on multiple heterogeneous networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HEGANLDA/HEGANLDA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-05-27T14:14:42.828718Z",
    "license": "Not licensed",
    "name": "HEGANLDA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TCBB.2021.3136886",
            "metadata": {
                "abstract": "AuthorLong non-coding RNAs (lncRNAs) play vital regulatory roles in many human complex diseases, however, the number of validated lncRNA-disease associations is notable rare so far. How to predict potential lncRNA-disease associations precisely through computational methods remains challenging. In this study, we proposed a novel method, LDVCHN (LncRNA-Disease Vector Calculation Heterogeneous Networks), and also developed the corresponding model, HEGANLDA (Heterogeneous Embedding Generative Adversarial Networks LncRNA-Disease Association), for predicting potential lncRNA-disease associations. In HEGANLDA, the graph embedding algorithm (HeGAN) was introduced for mapping all nodes in the lncRNA-miRNA-disease heterogeneous network into the low-dimensional vectors which severed as the inputs of LDVCHN. HEGANLDA effectively adopted the XGBoost (eXtreme Gradient Boosting) classifier, which was trained by the low-dimensional vectors, to predict potential lncRNA-disease associations. The 10-fold cross-validation method was utilized to evaluate the performance of our model, our model finally achieved an area under the ROC curve of 0.983. According to the experiment results, HEGANLDA outperformed any one of five current state-of-the-art methods. To further evaluate the effectiveness of HEGANLDA in predicting potential lncRNA-disease associations, both case studies and robustness tests were performed and the results confirmed its effectiveness and robustness. The source code and data of HEGANLDA are available at https://github.com/HEGANLDA/HEGANLDA.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Wang D."
                    },
                    {
                        "name": "Yang Z."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "HEGANLDA: a computational model for predicting potential lncRNA-disease associations based on multiple heterogeneous networks"
            },
            "pmid": "34932483"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        }
    ]
}
