{
    "accessibility": "Open access",
    "additionDate": "2021-10-27T19:49:20.230464Z",
    "biotoolsCURIE": "biotools:pignon",
    "biotoolsID": "pignon",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mathieu.lavallee@uottawa.ca",
            "name": "Mathieu Lavallée-Adam",
            "orcidid": "https://orcid.org/0000-0003-2124-3872",
            "typeEntity": "Person"
        },
        {
            "name": "Anastasiia Byvsheva"
        },
        {
            "name": "Rachel Nadeau"
        }
    ],
    "description": "PIGNON is a protein-protein interaction (PPI)-guided functional enrichment analysis for quantitative proteomics. This algorithm measures the clustering of proteins with a shared Gene Ontology (GO) annotation within the provided PPI network weighted with quantitative proteomics data. The significance of this clustering measure is then estimated from a normal distribution approximated from a Monte Carlo Sampling Distribution. To correct for multiple hypothesis testing, we assess the false discovery rate at various thresholds against a null model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "BioGRID interaction ID",
                        "uri": "http://edamontology.org/data_2628"
                    }
                },
                {
                    "data": {
                        "term": "STRING ID",
                        "uri": "http://edamontology.org/data_2302"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Q-value",
                        "uri": "http://edamontology.org/data_3932"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/LavalleeAdamLab/PIGNON",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-10-27T19:49:20.233029Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/LavalleeAdamLab/PIGNON"
        }
    ],
    "name": "PIGNON",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04042-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Quantitative proteomics studies are often used to detect proteins that are differentially expressed across different experimental conditions. Functional enrichment analyses are then typically used to detect annotations, such as biological processes that are significantly enriched among such differentially expressed proteins to provide insights into the molecular impacts of the studied conditions. While common, this analytical pipeline often heavily relies on arbitrary thresholds of significance. However, a functional annotation may be dysregulated in a given experimental condition, while none, or very few of its proteins may be individually considered to be significantly differentially expressed. Such an annotation would therefore be missed by standard approaches. Results: Herein, we propose a novel graph theory-based method, PIGNON, for the detection of differentially expressed functional annotations in different conditions. PIGNON does not assess the statistical significance of the differential expression of individual proteins, but rather maps protein differential expression levels onto a protein–protein interaction network and measures the clustering of proteins from a given functional annotation within the network. This process allows the detection of functional annotations for which the proteins are differentially expressed and grouped in the network. A Monte-Carlo sampling approach is used to assess the clustering significance of proteins in an expression-weighted network. When applied to a quantitative proteomics analysis of different molecular subtypes of breast cancer, PIGNON detects Gene Ontology terms that are both significantly clustered in a protein–protein interaction network and differentially expressed across different breast cancer subtypes. PIGNON identified functional annotations that are dysregulated and clustered within the network between the HER2+, triple negative and hormone receptor positive subtypes. We show that PIGNON’s results are complementary to those of state-of-the-art functional enrichment analyses and that it highlights functional annotations missed by standard approaches. Furthermore, PIGNON detects functional annotations that have been previously associated with specific breast cancer subtypes. Conclusion: PIGNON provides an alternative to functional enrichment analyses and a more comprehensive characterization of quantitative datasets. Hence, it contributes to yielding a better understanding of dysregulated functions and processes in biological samples under different experimental conditions.",
                "authors": [
                    {
                        "name": "Byvsheva A."
                    },
                    {
                        "name": "Lavallee-Adam M."
                    },
                    {
                        "name": "Nadeau R."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PIGNON: a protein–protein interaction-guided functional enrichment analysis for quantitative proteomics"
            },
            "pmcid": "PMC8178832",
            "pmid": "34088263"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
