{
    "additionDate": "2019-11-14T18:44:07Z",
    "biotoolsCURIE": "biotools:evntextrc",
    "biotoolsID": "evntextrc",
    "confidence_flag": "tool",
    "description": "EvntExtrc is a biological event extractor on biomedical literature |\nContext awareness and embedding for biomedical event extraction",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                },
                {
                    "term": "Read binning",
                    "uri": "http://edamontology.org/operation_3798"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cskyan/evntextrc",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-28T13:39:41Z",
    "license": "Apache-2.0",
    "name": "EvntExtrc",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ607",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Biomedical event extraction is fundamental for information extraction in molecular biology and biomedical research. The detected events form the central basis for comprehensive biomedical knowledge fusion, facilitating the digestion of massive information influx from the literature. Limited by the event context, the existing event detection models are mostly applicable for a single task. A general and scalable computational model is desiderated for biomedical knowledge management. Results: We consider and propose a bottom-up detection framework to identify the events from recognized arguments. To capture the relations between the arguments, we trained a bidirectional long short-term memory network to model their context embedding. Leveraging the compositional attributes, we further derived the candidate samples for training event classifiers. We built our models on the datasets from BioNLP Shared Task for evaluations. Our method achieved the average F-scores of 0.81 and 0.92 on BioNLPST-BGI and BioNLPST-BB datasets, respectively. Comparing with seven state-of-the-art methods, our method nearly doubled the existing F-score performance (0.92 versus 0.56) on the BioNLPST-BB dataset. Case studies were conducted to reveal the underlying reasons.",
                "authors": [
                    {
                        "name": "Yan S."
                    },
                    {
                        "name": "Wong K.-C."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Context awareness and embedding for biomedical event extraction"
            },
            "pmid": "31392318"
        }
    ],
    "toolType": [
        "Library",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}