{
    "additionDate": "2021-01-18T11:10:17Z",
    "biotoolsCURIE": "biotools:compoundhetvip",
    "biotoolsID": "compoundhetvip",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stephen_piccolo@byu.edu",
            "name": "Stephen R. Piccolo",
            "typeEntity": "Person"
        }
    ],
    "description": "Compound Heterozygous Variant Identification Pipeline (CompoundHetVIP) is a tool for helping to uncover missing heritability in human diseases and other phenotypes.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/dmill903/compound-het-vip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dmiller903/CompoundHetVIP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-17T13:47:22Z",
    "license": "MIT",
    "name": "CompoundHetVIP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.12688/F1000RESEARCH.26848.1",
            "metadata": {
                "abstract": "Copyright: © 2020 Miller DB and Piccolo SR.A compound heterozygous ( CH) variant occurs when a person inherits two alternate alleles, one from each parent, and these alleles occur at different positions within the same gene. Therefore, CH variant identification requires distinguishing maternally from paternally derived nucleotides, a process that requires numerous computational tools. Using such tools can be challenging and often introduce unforeseen challenges such as installation procedures that are operating-system specific, software dependencies, and format requirements for input files. To overcome these challenges, we developed Compound Heterozygous Variant Identification Pipeline (CompoundHetVIP), which uses a single Docker image to encapsulate commonly used software tools for phasing, annotating, and analyzing CH, homozygous alternate, and de novo variants in a series of 13 steps. To begin using our tool, researchers need only install the Docker engine and download the CompoundHetVIP Docker image. The tools provided in CompoundHetVIP can be applied to Illumina whole-genome sequencing data of individual samples or trios (a child and both parents), using VCF or gVCF files as initial input. Each step of the pipeline produces an analysis-ready output file that can be further evaluated. To illustrate its use, we applied CompoundHetVIP to data from a publicly available Ashkenazim trio and identified two genes with candidate CH variants and one gene with a candidate homozygous alternate variant after filtering. While this example uses genomic data from a healthy child, we anticipate that most researchers will use CompoundHetVIP to uncover missing heritability in human diseases and other phenotypes. CompoundHetVIP is open-source software and can be found at https://github.com/dmiller903/CompoundHetVIP; this repository also provides detailed, step-by-step examples.",
                "authors": [
                    {
                        "name": "Miller D.B."
                    },
                    {
                        "name": "Piccolo S.R."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "CompoundHetVIP: Compound Heterozygous Variant Identification Pipeline"
            }
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        }
    ]
}