{
    "additionDate": "2018-05-19T17:46:08Z",
    "biotoolsCURIE": "biotools:irspot-psednc",
    "biotoolsID": "irspot-psednc",
    "credit": [
        {
            "email": "hlin@uestc.edu.cn",
            "name": "Hao Lin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identify recombination spots with pseudo dinucleotide composition.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://lin-group.cn/server/iRSpotPseDNC/readme"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                }
            ]
        }
    ],
    "homepage": "http://lin-group.cn/server/iRSpot-PseDNC",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "iRSpot-PseDNC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1093/NAR/GKS1450",
            "metadata": {
                "abstract": "Meiotic recombination is an important biological process. As a main driving force of evolution, recombination provides natural new combinations of genetic variations. Rather than randomly occurring across a genome, meiotic recombination takes place in some genomic regions (the so-called 'hotspots') with higher frequencies, and in the other regions (the so-called 'coldspots') with lower frequencies. Therefore, the information of the hotspots and coldspots would provide useful insights for in-depth studying of the mechanism of recombination and the genome evolution process as well. So far, the recombination regions have been mainly determined by experiments, which are both expensive and time-consuming. With the avalanche of genome sequences generated in the postgenomic age, it is highly desired to develop automated methods for rapidly and effectively identifying the recombination regions. In this study, a predictor, called 'iRSpot-PseDNC', was developed for identifying the recombination hotspots and coldspots. In the new predictor, the samples of DNA sequences are formulated by a novel feature vector, the so-called 'pseudo dinucleotide composition' (PseDNC), into which six local DNA structural properties, i.e. three angular parameters (twist, tilt and roll) and three translational parameters (shift, slide and rise), are incorporated. It was observed by the rigorous jackknife test that the overall success rate achieved by iRSpot-PseDNC was >82% in identifying recombination spots in Saccharomyces cerevisiae, indicating the new predictor is promising or at least may become a complementary tool to the existing methods in this area. Although the benchmark data set used to train and test the current method was from S. cerevisiae, the basic approaches can also be extended to deal with all the other genomes. Particularly, it has not escaped our notice that the PseDNC approach can be also used to study many other DNA-related problems. As a user-friendly web-server, iRSpot-PseDNC is freely accessible at http://lin.uestc.edu. cn/server/iRSpot- PseDNC. © The Author(s) 2013. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Chen W."
                    },
                    {
                        "name": "Feng P.-M."
                    },
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Chou K.-C."
                    }
                ],
                "citationCount": 503,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "IRSpot-PseDNC: Identify recombination spots with pseudo dinucleotide composition"
            },
            "pmcid": "PMC3616736",
            "pmid": "23303794"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA replication and recombination",
            "uri": "http://edamontology.org/topic_3127"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}