
{
    "credit": [
        {
            "email": "hongmei@northwestern.edu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://cals.arizona.edu/~anling/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://faculty.wcas.northwestern.edu/~hji403/REBACCA.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant pattern analysis",
                    "uri": "http://edamontology.org/operation_3504"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Metagenomics",
                "uri": "http://edamontology.org/topic_3174"
            },
            {
                "term": "Microbiology",
                "uri": "http://edamontology.org/topic_3301"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/rebacca-investigating-co-occurrence-patterns-based-on-meta-genomic-compositional-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 The Author. Motivation: The high-throughput sequencing technologies have provided a powerful tool to study the microbial organisms living in various environments. Characterizing microbial interactions can give us insights into how they live and work together as a community. Metagonomic data are usually summarized in a compositional fashion due to varying sampling/sequencing depths from one sample to another. We study the co-occurrence patterns of microbial organisms using their relative abundance information. Analyzing compositional data using conventional correlation methods has been shown prone to bias that leads to artifactual correlations. Results: We propose a novel method, regularized estimation of the basis covariance based on compositional data (REBACCA), to identify significant co-occurrence patterns by finding sparse solutions to a system with a deficient rank. To be specific, we construct the system using log ratios of count or proportion data and solve the system using the l1-norm shrinkage method. Our comprehensive simulation studies show that REBACCA (i) achieves higher accuracy in general than the existing methods when a sparse condition is satisfied; (ii) controls the false positives at a pre-specified level, while other methods fail in various cases and (iii) runs considerably faster than the existing comparable method. REBACCA is also applied to several real metagenomic datasets. Availability and implementation.",
            "authors": [
                "Ban Y.",
                "An L.",
                "Jiang H."
            ],
            "cit_count": 18,
            "journal": "Bioinformatics",
            "pmid": "26079350",
            "title": "Investigating microbial co-occurrence patterns based on metagenomic compositional data",
            "year": "2015-03-25"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rebacca",
        "biotoolsID": "rebacca",
        "description": "This R code is based on a novel method to identify significant co-occurrence patterns by finding sparse solutions to a system with a deficient rank.",
        "homepage": "http://faculty.wcas.northwestern.edu/~hji403/REBACCA.htm",
        "name": "REBACCA"
    }
}