{
    "additionDate": "2018-05-22T16:14:10Z",
    "biotoolsCURIE": "biotools:superphy",
    "biotoolsID": "superphy",
    "credit": [
        {
            "email": "chad.laing@canada.ca",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Predictive genomics for the bacterial pathogen Escherichia coli.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://lfz.corefacility.ca/superphy/",
    "language": [
        "JavaScript",
        "R",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "SuperPhy",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12866-016-0680-0",
            "metadata": {
                "abstract": "© 2016 Whiteside et al.Background: Predictive genomics is the translation of raw genome sequence data into a phenotypic assessment of the organism. For bacterial pathogens, these phenotypes can range from environmental survivability, to the severity of human disease. Significant progress has been made in the development of generic tools for genomic analyses that are broadly applicable to all microorganisms; however, a fundamental missing component is the ability to analyze genomic data in the context of organism-specific phenotypic knowledge, which has been accumulated from decades of research and can provide a meaningful interpretation of genome sequence data. Results: In this study, we present SuperPhy, an online predictive genomics platform (http://lfz.corefacility.ca/superphy/) for Escherichia coli. The platform integrates the analytical tools and genome sequence data for all publicly available E. coli genomes and facilitates the upload of new genome sequences from users under public or private settings. SuperPhy provides real-time analyses of thousands of genome sequences with results that are understandable and useful to a wide community, including those in the fields of clinical medicine, epidemiology, ecology, and evolution. SuperPhy includes identification of: 1) virulence and antimicrobial resistance determinants 2) statistical associations between genotypes, biomarkers, geospatial distribution, host, source, and phylogenetic clade; 3) the identification of biomarkers for groups of genomes on the based presence/absence of specific genomic regions and single-nucleotide polymorphisms and 4) in silico Shiga-toxin subtype. Conclusions: SuperPhy is a predictive genomics platform that attempts to provide an essential link between the vast amounts of genome information currently being generated and phenotypic knowledge in an organism-specific context.",
                "authors": [
                    {
                        "name": "Whiteside M.D."
                    },
                    {
                        "name": "Laing C.R."
                    },
                    {
                        "name": "Manji A."
                    },
                    {
                        "name": "Kruczkiewicz P."
                    },
                    {
                        "name": "Taboada E.N."
                    },
                    {
                        "name": "Gannon V.P.J."
                    }
                ],
                "citationCount": 8,
                "date": "2016-04-12T00:00:00Z",
                "journal": "BMC Microbiology",
                "title": "SuperPhy: Predictive genomics for the bacterial pathogen Escherichia coli"
            },
            "pmcid": "PMC4828761",
            "pmid": "27067409"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 1
}