{
    "additionDate": "2021-01-18T12:22:08Z",
    "biotoolsCURIE": "biotools:rnn-virseeker",
    "biotoolsID": "rnn-virseeker",
    "confidence_flag": "tool",
    "description": "a deep learning method for identification of short viral sequences from metagenomes.\n\nTo utilize RNN-VirSeeker, Python packages \"sklearn\", \"numpy\" and \"matplotlib\" are needed to be previously installed.\n\nTo make a prediction, users' own query contigs should be edited into a \".csv\" file, where every line contains a single query contig. Through test.py, RNN-VirSeeker will give a set of scores to each query contig, higher of which represents its classification result.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://github.com/crazyinter/RNN-VirSeeker",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-08T12:29:08Z",
    "name": "RNN-VirSeeker",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/TCBB.2020.3044575",
            "metadata": {
                "abstract": "IEEEViruses are the most abundant biological entities on earth, and play vital roles in many aspects of microbial communities. As major human pathogens, viruses have caused huge mortality and morbidity to human society in history. Metagenomic sequencing methods could capture all microorganisms from microbiota, with sequences of viruses mixed with these of other species. Therefore, it is necessary to identify viral sequences from metagenomes. However, existing methods perform poorly on identifying short viral sequences. To solve this problem, a deep learning based method, RNN-VirSeeker, is proposed in this paper. RNN-VirSeeker was trained by sequences of 500bp sampled from known Virus and Host RefSeq genomes. Experimental results on the testing set have shown that RNN-VirSeeker exhibited AUROC of 0.9175, recall of 0.8640 and precision of 0.9211 for sequences of 500bp, and outperformed three widely used methods, VirSorter, VirFinder, and DeepVirFinder, on identifying short viral sequences. RNN-VirSeeker was also used to identify viral sequences from a CAMI dataset and a human gut metagenome. Compared with DeepVirFinder, RNN-VirSeeker identified more viral sequences from these metagenomes and achieved greater values of AUPRC and AUROC. RNN-VirSeeker is freely available at https://github.com/crazyinter/RNN-VirSeeker.",
                "authors": [
                    {
                        "name": "Liu F."
                    },
                    {
                        "name": "Miao Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Hou T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "RNN-VirSeeker: a deep learning method for identification of short viral sequences from metagenomes"
            },
            "pmid": "33315571"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        }
    ]
}