{
    "accessibility": [],
    "additionDate": "2017-12-18T00:10:33Z",
    "biotoolsCURIE": "biotools:prorate",
    "biotoolsID": "prorate",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sunflower.kuicr.kyoto-u.ac.jp/"
        }
    ],
    "description": "PRORATE is a novel approach to predict protein folding rates for two-state and multi-state protein folding kinetics, which combines a variety of structural topology and complex network properties that are calculated from protein three-dimensional structures.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ],
            "output": []
        },
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Prediction",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://sunflower.kuicr.kyoto-u.ac.jp/~sjn/folding/",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/prorate-prediction-protein-folding-rates.html"
        }
    ],
    "maturity": null,
    "name": "PRORATE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.2197/ipsjtbio.3.40",
            "metadata": {
                "abstract": "As a fundamental biological problem, revealing the protein folding mechanism remains to be one of the most challenging problems in structural bioinformatics. Prediction of protein folding rate is an important step towards our further understanding of the protein folding mechanism and the complex sequencestructure-function relationship. In this article, we develop a novel approach to predict protein folding rates for two-state and multi-state protein folding kinetics, which combines a variety of structural topology and complex network properties that are calculated from protein three-dimensional structures. To take into account the specific correlations between network properties and protein folding rates, we define two different protein residue contact networks, based on two different scales Protein Contact Network (PCN) and Long-range Interaction Network (LIN) to characterize the corresponding network features. The leave-one-out cross-validation (LOOCV) tests indicate that this integrative strategy is more powerful in predicting the folding rates from 3D structures, with the Pearson's Correlation Coefficient (CC) of 0.88, 0.90 and 0.90 for two-state, multi-state and combined protein folding kinetics, which provides an improved performance compared with other prediction work. This study provides useful insights which shed light on the network organization of interacting residues underlying protein folding process for both two-state and multi-state folding kinetics. Moreover, our method also provides a complementary approach to the current folding rate prediction algorithms and can be used as a powerful tool for the characterization of the foldomics protein data. The implemented webserver (termed PRORATE) is freely accessible at http://sunflower.kuicr.kyoto-u.ac.jp/~sjn/folding/. © 2010 Information Processing Society of Japan.",
                "authors": [
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Takemoto K."
                    },
                    {
                        "name": "Shen H."
                    },
                    {
                        "name": "Tan H."
                    },
                    {
                        "name": "Gromiha M.M."
                    },
                    {
                        "name": "Akutsu T."
                    }
                ],
                "citationCount": 6,
                "date": "2010-12-01T00:00:00Z",
                "journal": "IPSJ Transactions on Bioinformatics",
                "title": "Prediction of protein folding rates from structural topology and complex network properties"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": "Primary",
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein folding",
            "uri": "http://edamontology.org/topic_0130"
        }
    ],
    "validated": 1,
    "version": []
}