{"credit":[{"email":"yamada@cb.k.u-tokyo.ac.jp","name":"Tomoyuki Yamada","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://ps.cb.k.u-tokyo.ac.jp/help.html#query"}],"function":[{"operation":[{"term":"Virtual PCR","uri":"http://edamontology.org/operation_0307"},{"term":"Primer removal","uri":"http://edamontology.org/operation_3237"},{"term":"Primer and probe design","uri":"http://edamontology.org/operation_2419"},{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Probes and primers","uri":"http://edamontology.org/topic_0632"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Human biology","uri":"http://edamontology.org/topic_2815"},{"term":"Nucleic acid sites, features and motifs","uri":"http://edamontology.org/topic_3511"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"PrimerStation (http://ps.cb.k.u-tokyo.ac.jp) is a web service that calculates primer sets guaranteeing high specificity against the entire human genome. To achieve high accuracy, we used the hybridization ratio of primers in liquid solution. Calculating the status of sequence hybridization in terms of the stringent hybridization ratio is computationally costly, and no web service checks the entire human genome and returns a highly specific primer set calculated using a precise physicochemical model. To shorten the response time, we precomputed candidates for specific primers using a massively parallel computer with 100 CPUs (SunFire 15 K) about 3 months in advance. This enables PrimerStation to search and output qualified primers interactively. PrimerStation can select highly specific primers suitable for multiplex PCR by seeking a wider temperature range that minimizes the possibility of cross-reaction. It also allows users to add heuristic rules to the primer design, e.g. the exclusion of single nucleotide polymorphisms (SNPs) in primers, the avoidance of poly(A) and CA-repeats in the PCR products, and the elimination of defective primers using the secondary structure prediction. We performed several tests to verify the PCR amplification of randomly selected primers for ChrX, and we confirmed that the primers amplify specific PCR products perfectly. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Yamada T.","Soma H.","Morishita S."],"cit_count":16,"journal":"Nucleic Acids Research","pmid":"16845094","title":"PrimerStation: A highly specific multiplex genomic PCR primer design server for the human genome","year":"2006-07-01"}],"summary":{"biotoolsCURIE":"biotools:primerstation","biotoolsID":"primerstation","description":"PrimerStation is a multiplex genomic PCR primer design tool specific for the human genome.","homepage":"http://ps.cb.k.u-tokyo.ac.jp/","name":"PrimerStation"}}