
{
    "credit": [
        {
            "email": "vincent@math.ku.dk",
            "name": "Vincent M",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.math.ku.dk/~richard/about/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.math.ku.dk/~richard/msgl/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Biomedical science",
                "uri": "http://edamontology.org/topic_3344"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/msgl-2-0-125-0-high-dimensional-multiclass-classification-using-sparse-group-lasso.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Contamination of a cancer tissue by the surrounding benign (non-cancerous) tissue is a concern for molecular cancer diagnostics. This is because an observed molecular signature will be distorted by the surrounding benign tissue, possibly leading to an incorrect diagnosis. One example is molecular identification of the primary tumor site of metastases because biopsies of metastases typically contain a significant amount of benign tissue. Results: A model of tissue contamination is presented. This contamination model works independently of the training of a molecular predictor, and it can be combined with any predictor model. The usability of the model is illustrated on primary tumor site identification of liver biopsies, specifically, on a human dataset consisting of microRNA expression measurements of primary tumor samples, benign liver samples and liver metastases. For a predictor trained on primary tumor and benign liver samples, the contamination model decreased the test error on biopsies from liver metastases from 77 to 45%. A further reduction to 34% was obtained by including biopsies in the training data. © The Author 2014.",
            "authors": [
                "Vincent M.",
                "Perell K.",
                "Nielsen F.C.",
                "Daugaard G.",
                "Hansen N.R."
            ],
            "cit_count": 3,
            "journal": "Bioinformatics",
            "pmid": "24463184",
            "title": "Modeling tissue contamination to improve molecular identification of the primary tumor site of metastases",
            "year": "2014-05-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:msgl",
        "biotoolsID": "msgl",
        "description": "This R package (multinomial sparse group lasso) fits multinomial models for e.g. multiclass classification with a sparse group lasso penalty.",
        "homepage": "http://www.math.ku.dk/~richard/msgl/",
        "name": "msgl"
    }
}