{
    "accessibility": "Open access",
    "additionDate": "2022-09-16T12:22:35.319018Z",
    "biotoolsCURIE": "biotools:hgsorf",
    "biotoolsID": "hgsorf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "farhana@ku.ac.bd",
            "name": "Farhana Tazmim Pinki",
            "orcidid": "https://orcid.org/0000-0001-6884-2990"
        },
        {
            "email": "m.awal@ece.ku.ac.bd",
            "name": "Md. Abdul Awal",
            "orcidid": "https://orcid.org/0000-0003-3028-4932"
        },
        {
            "email": "salahmadi@ksu.edu.sa",
            "name": "Saad Al-Ahmadi",
            "orcidid": "https://orcid.org/0000-0001-9406-6809"
        },
        {
            "email": "shahadat_qs@iubat.edu",
            "name": "Md. Shahadat Hossain",
            "orcidid": "https://orcid.org/0000-0002-1368-7230"
        }
    ],
    "description": "Henry Gas Solubility Optimization-based Random Forest for C-Section prediction and XAI-based cause analysis.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein solubility prediction",
                    "uri": "http://edamontology.org/operation_0409"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MIrazul29/HGSORF_CSection",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:39:19.037791Z",
    "license": "Not licensed",
    "name": "HGSORF",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.105671",
            "metadata": {
                "abstract": "A stable predictive model is essential for forecasting the chances of cesarean or C-section (CS) delivery, as unnecessary CS delivery can adversely affect neonatal, maternal, and pediatric morbidity and mortality, and can incur significant financial burdens. Limited state-of-the-art machine learning models have been applied in this area in recent years, and the current models are insufficient to correctly predict the probability of CS delivery. To alleviate this drawback, we have proposed a Henry gas solubility optimization (HGSO)-based random forest (RF), with an improved objective function, called HGSORF, for the classification of CS and non-CS classes. Real-world CS datasets can be noisy, such as the Pakistan Demographic and Health Survey (PDHS) dataset used in this study. The HGSO can provide fine-tuned hyperparameters of RF by avoiding local minima points. To compare performance, Gaussian Naive Bayes (GNB), linear discriminant analysis (LDA), K-nearest neighbors (KNN), gradient boosting classifier (GBC), and logistic regression (LR) have been considered in this research. The ADAptive SYNthetic (ADASYN) algorithm has been used to balance the model, and the proposed HGSORF has been compared with other classifiers as well as with other studies. The superior performance was achieved by HGSORF with an accuracy of 98.33% for the PDHS dataset. The hyperparameters of RF have also been optimized by using commonly used hyperparameter-optimization algorithms, and the proposed HGSORF provided comparatively better performance. Additionally, to analyze the causes of CS and their significance, the HGSORF is explained locally and globally using eXplainable artificial intelligence (XAI)-based tools such as SHapely Additive exPlanation (SHAP) and Local Interpretable Model-Agnostic Explanations (LIME). A decision support system has been developed as a potential application to support clinical staffs. All pre-trained models and relevant codes are available on: https://github.com/MIrazul29/HGSORF_CSection.",
                "authors": [
                    {
                        "name": "Al-Ahmadi S."
                    },
                    {
                        "name": "Awal M.A."
                    },
                    {
                        "name": "Hossain M.S."
                    },
                    {
                        "name": "Islam M.S."
                    },
                    {
                        "name": "Karmokar S."
                    },
                    {
                        "name": "Laboni J.N."
                    },
                    {
                        "name": "Mirjalili S."
                    },
                    {
                        "name": "Mumenin K.M."
                    },
                    {
                        "name": "Pinki F.T."
                    },
                    {
                        "name": "Rahman M.A."
                    }
                ],
                "citationCount": 23,
                "date": "2022-08-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "HGSORF: Henry Gas Solubility Optimization-based Random Forest for C-Section prediction and XAI-based cause analysis"
            },
            "pmid": "35660327"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
