{
    "additionDate": "2021-01-18T11:36:29Z",
    "biotoolsCURIE": "biotools:memmorf",
    "biotoolsID": "memmorf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hegedus@hegelab.org",
            "name": "Tamás Hegedűs",
            "typeEntity": "Person"
        }
    ],
    "description": "The MemMoRF database for recognizing disordered protein regions interacting with cellular membranes.\n\nMemMoRF database of membrane associated disordered protein regions.\n\nMembrane-binding Molecular Recognition Features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                }
            ]
        }
    ],
    "homepage": "https://memmorf.hegelab.org",
    "lastUpdate": "2021-02-20T18:00:21Z",
    "name": "MemMoRF",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA954",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided the original work is properly cited. For commercial re-use, please contact journals.permissions@oup.comProtein and lipid membrane interactions play fundamental roles in a large number of cellular processes (e.g. signalling, vesicle trafficking, or viral invasion). A growing number of examples indicate that such interactions can also rely on intrinsically disordered protein regions (IDRs), which can form specific reversible interactions not only with proteins but also with lipids. We named IDRs involved in such membrane lipid-induced disorder-to-order transition as MemMoRFs, in an analogy to IDRs exhibiting disorder-to-order transition upon interaction with protein partners termed Molecular Recognition Features (MoRFs). Currently, both the experimental detection and computational characterization of MemMoRFs are challenging, and information about these regions are scattered in the literature. To facilitate the related investigations we generated a comprehensive database of experimentally validated MemMoRFs based on manual curation of literature and structural data. To characterize the dynamics of MemMoRFs, secondary structure propensity and flexibility calculated from nuclear magnetic resonance chemical shifts were incorporated into the database. These data were supplemented by inclusion of sentences from papers, functional data and disease-related information. The MemMoRF database can be accessed via a user-friendly interface at https://memmorf.hegelab.org, potentially providing a central resource for the characterization of disordered regions in transmembrane and membrane-associated proteins.",
                "authors": [
                    {
                        "name": "Csizmadia G."
                    },
                    {
                        "name": "Dosztanyi Z."
                    },
                    {
                        "name": "Erdos G."
                    },
                    {
                        "name": "Hegedus T."
                    },
                    {
                        "name": "Padanyi R."
                    },
                    {
                        "name": "Tordai H."
                    },
                    {
                        "name": "Tosatto S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The MemMoRF database for recognizing disordered protein regions interacting with cellular membranes"
            },
            "pmid": "33119751"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
