{
    "additionDate": "2017-12-18T00:07:39Z",
    "biotoolsCURIE": "biotools:hnatyping",
    "biotoolsID": "hnatyping",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://myaweb.asia.edu.tw/meworksv2a/meworks/page.aspx?no=30771"
        }
    ],
    "description": "HnaTyping is a software for genotyping of human neutrophil antigens (HNA) from whole genome sequencing data",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/projects/hnatyping/files/0README.txt/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://sourceforge.net/projects/hnatyping/?source=navbar",
    "language": [
        "C#"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/hnatyping-20120804-hna-genotyping-wgs.html"
        }
    ],
    "name": "HnaTyping",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1755-8794-6-31",
            "metadata": {
                "abstract": "Background: Neutrophil antigens are involved in a variety of clinical conditions including transfusion-related acute lung injury (TRALI) and other transfusion-related diseases. Recently, there are five characterized groups of human neutrophil antigen (HNA) systems, the HNA1 to 5. Characterization of all neutrophil antigens from whole genome sequencing (WGS) data may be accomplished for revealing complete genotyping formats of neutrophil antigens collectively at genome level with molecular variations which may respectively be revealed with available genotyping techniques for neutrophil antigens conventionally. Results: We developed a computing method for the genotyping of human neutrophil antigens. Six samples from two families, available from the 1000 Genomes projects, were used for a HNA typing test. There are 500 ∼ 3000 reads per sample filtered from the adopted human WGS datasets in order for identifying single nucleotide polymorphisms (SNPs) of neutrophil antigens. The visualization of read alignment shows that the yield reads from WGS dataset are enough to cover all of the SNP loci for the antigen system: HNA1, HNA3, HNA4 and HNA5. Consequently, our implemented Bioinformatics tool successfully revealed HNA types on all of the six samples including sequence-based typing (SBT) as well as PCR sequence-specific oligonucleotide probes (SSOP), PCR sequence-specific primers (SSP) and PCR restriction fragment length polymorphism (RFLP) along with parentage possibility. Conclusions: The next-generation sequencing technology strives to deliver affordable and non-biased sequencing results, hence the complete genotyping formats of HNA may be reported collectively from mining the output data of WGS. The study shows the feasibility of HNA genotyping through new WGS technologies. Our proposed algorithmic methodology is implemented in a HNATyping software package with user's guide available to the public at. © 2013 Chu et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Chu H.-T."
                    },
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Tsao T.T.-H."
                    },
                    {
                        "name": "Chang C.-F."
                    },
                    {
                        "name": "Hsiao W.W."
                    },
                    {
                        "name": "Yeh T.-J."
                    },
                    {
                        "name": "Chang C.-M."
                    },
                    {
                        "name": "Liu Y.-W."
                    },
                    {
                        "name": "Wang T.-Y."
                    },
                    {
                        "name": "Yang K.-C."
                    },
                    {
                        "name": "Chen T.-J."
                    },
                    {
                        "name": "Chen J.-C."
                    },
                    {
                        "name": "Chen K.-C."
                    },
                    {
                        "name": "Kao C.-Y."
                    }
                ],
                "citationCount": 3,
                "date": "2013-09-17T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Genotyping of human neutrophil antigens (HNA) from whole genome sequencing data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genotyping",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "WGS",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1,
    "version": [
        "20130706"
    ]
}