
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Forcefield parameterisation",
                    "uri": "http://edamontology.org/operation_3893"
                },
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Molecular dynamics",
                "uri": "http://edamontology.org/topic_0176"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Transcription factors and regulatory sites",
                "uri": "http://edamontology.org/topic_0749"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Wiley Periodicals, Inc.Bromodomains (BrDs), a conserved structural module in chromatin-associated proteins, are well known for recognizing ε-N-acetyl lysine residues on histones. One of the most relevant BrDs is BRD4, a tandem BrD containing protein (BrD1 and BrD2) that plays a critical role in numerous diseases including cancer. Growing evidence shows that the two BrDs of BRD4 have different biological functions; hence selective ligands that can be used to study their functions are of great interest. Here, as a follow-up of our previous work, we first provide a detailed characterization study of the in silico rational design of Olinone as part of a series of five tetrahydropyrido indole-based compounds as BRD4 BrD1 inhibitors. Additionally, we investigated the molecular basis for Olinone's selective recognition by BrD1 over BrD2. Molecular dynamics simulations, free energy calculations, and conformational analyses of the apo-BRD4-BrD1|2 and BRD4-BrD1|2/Olinone complexes showed that Olinone's selectivity is facilitated by five key residues: Leu92 in BrD1|385 in BrD2 of ZA loop, Asn140|433, Asp144|His437 and Asp145|Glu438 of BC loop, and Ile146|Val49 of helix C. Furthermore, the difference in hydrogen bonds number and in mobility of the ZA and BC loops of the acetyl-lysine binding site between BRD4 BrD1/Olinone and BrD2/Olinone complexes also contribute to the difference in Olinone's binding affinity and selectivity toward BrD1 over BrD2. Altogether, our computer-aided molecular design techniques can effectively guide the development of small-molecule BRD4 BrD1 inhibitors, explain their selectivity origin, and further open doors to the design of new therapeutically improved derivatives.",
            "authors": [
                "Rodriguez Y.",
                "Gerona-Navarro G.",
                "Osman R.",
                "Zhou M.-M."
            ],
            "cit_count": 0,
            "doi": "10.1002/PROT.25818",
            "journal": "Proteins: Structure, Function and Bioinformatics",
            "pmid": "31587361",
            "title": "In silico design and molecular basis for the selectivity of Olinone toward the first over the second bromodomain of BRD4",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:BRD4_BrD1_Olinone_BrD2_Olinone",
        "biotoolsID": "BRD4_BrD1_Olinone_BrD2_Olinone",
        "description": "In silico design and molecular basis for the selectivity of Olinone toward the first over the second bromodomain of BRD4.\n\nBromodomains (BrDs), a conserved structural module in chromatin-associated proteins, are well known for recognizing ε-N-acetyl lysine residues on histones. One of the most relevant BrDs is BRD4, a tandem BrD containing protein (BrD1 and BrD2) that plays a critical role in numerous diseases including cancer. Growing evidence shows that the two BrDs of BRD4 have different biological functions; hence selective ligands that can be used to study their functions are of great interest. Here, as a follow-up of our previous work, we first provide a detailed characterization study of the in silico rational design of Olinone as part of a series of five tetrahydropyrido indole-based compounds as BRD4 BrD1 inhibitors.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'BrD1 Olinone BrD2 Olinone', 'BRD4 BrD1 Olinone BrD2', 'Olinone BrD2 Olinone', 'BrD1 Olinone BrD2'",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31587361",
        "name": "BRD4 BrD1 Olinone BrD2 Olinone"
    }
}