{
    "additionDate": "2020-01-14T19:50:50Z",
    "biotoolsCURIE": "biotools:RemeDB",
    "biotoolsID": "RemeDB",
    "confidence_flag": "tool",
    "description": "Tool for Rapid Prediction of Enzymes Involved in Bioremediation from High-Throughput Metagenome Data Sets.\n\nVenue - Responsive HTML5 Template.\n\nTool to identify Bioremediation enzymes from.\n\nRemeDB aims at identifying Pollutant Degrading Enzymes (PDE) from metagenomic sequences.\n\nA hassle-free tool to predict bioremediation enzymes from metagenomic datasets",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://www.niot.res.in/Remedb/",
    "lastUpdate": "2020-12-12T15:29:57Z",
    "name": "RemeDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1089/CMB.2019.0345",
            "metadata": {
                "abstract": "© Copyright 2020, Mary Ann Liebert, Inc., publishers 2020.Environmental pollution has emerged to be a major hazard in today's world. Pollutants from varied sources cause harmful effects to the ecosystem. The major pollutants across marine and terrestrial regions are hydrocarbons, plastics, and dyes. Conventional methods for remediation have their own limitations and shortcomings to deal with these environmental pollutants. Bio-based remediation techniques using microbes have gained momentum in the recent past, primarily ascribed to their eco-friendly approach. The role of microbial enzymes in remediating the pollutants are well reported, and further exploration of microbial resources could lead to discovery of novel pollutant degrading enzymes (PDEs). Recent advances in next-generation sequencing technologies and metagenomics have provided the impetus to explore environmental microbes for potentially novel bioremediation enzymes. In this study, a tool, RemeDB, was developed for identifying bioremediation enzymes sequences from metagenomes. RemeDB aims at identifying hydrocarbon, dye, and plastic degrading enzymes from various metagenomic libraries. A sequence database consisting of >30,000 sequences proven to degrade the major pollutants was curated from various literature sources and this constituted the PDEs' database. Programs such as HMMER and RAPSearch were incorporated to scan across large metagenomic sequences libraries to identify PDEs. The tool was tested with metagenome data sets from varied sources and the outputs were validated. RemeDB was efficient to classify and identify the signature patterns of PDEs in the input data sets.",
                "authors": [
                    {
                        "name": "Balachandran K.R.S."
                    },
                    {
                        "name": "Gopal D."
                    },
                    {
                        "name": "Rangamaran V.R."
                    },
                    {
                        "name": "Sankara Subramanian S.H."
                    }
                ],
                "citationCount": 4,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "RemeDB: Tool for Rapid Prediction of Enzymes Involved in Bioremediation from High-Throughput Metagenome Data Sets"
            },
            "pmid": "31800321"
        }
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        }
    ],
    "validated": 1
}
