{
    "name": "WaveSeqR", 
    "description": "A peak-caller for detecting punctate and diffuse enrichment regions that utilizes the continuous wavelet transform framework.", 
    "homepage": "https://rdrr.io/rforge/WaveSeqR/", 
    "biotoolsID": "waveseqr", 
    "biotoolsCURIE": "biotools:waveseqr", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3215", 
                    "term": "Peak detection"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Plug-in"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3169", 
            "term": "ChIP-seq"
        }, 
        {
            "uri": "http://edamontology.org/topic_3295", 
            "term": "Epigenetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_3176", 
            "term": "DNA packaging"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [
        "Animal and Crop Genomics"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://rdrr.io/rforge/WaveSeqR/man/", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1371/journal.pone.0045486", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "WaveSeq: A Novel Data-Driven Method of Detecting Histone Modification Enrichments Using Wavelets", 
                "abstract": "Background: Chromatin immunoprecipitation followed by next-generation sequencing is a genome-wide analysis technique that can be used to detect various epigenetic phenomena such as, transcription factor binding sites and histone modifications. Histone modification profiles can be either punctate or diffuse which makes it difficult to distinguish regions of enrichment from background noise. With the discovery of histone marks having a wide variety of enrichment patterns, there is an urgent need for analysis methods that are robust to various data characteristics and capable of detecting a broad range of enrichment patterns. Results: To address these challenges we propose WaveSeq, a novel data-driven method of detecting regions of significant enrichment in ChIP-Seq data. Our approach utilizes the wavelet transform, is free of distributional assumptions and is robust to diverse data characteristics such as low signal-to-noise ratios and broad enrichment patterns. Using publicly available datasets we showed that WaveSeq compares favorably with other published methods, exhibiting high sensitivity and precision for both punctate and diffuse enrichment regions even in the absence of a control data set. The application of our algorithm to a complex histone modification data set helped make novel functional discoveries which further underlined its utility in such an experimental setup. Conclusions: WaveSeq is a highly sensitive method capable of accurate identification of enriched regions in a broad range of data sets. WaveSeq can detect both narrow and broad peaks with a high degree of accuracy even in low signal-to-noise ratio data sets. WaveSeq is also suited for application in complex experimental scenarios, helping make biologically relevant functional discoveries. © 2012 Mitra, Song.", 
                "date": "2012-09-28T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Mitra A."
                    }, 
                    {
                        "name": "Song J."
                    }
                ], 
                "journal": "PLoS ONE"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "https://r-forge.r-project.org/sendmessage.php?touser=245929", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "admin", 
    "additionDate": "2017-08-20T15:59:19Z", 
    "lastUpdate": "2019-09-04T08:38:41Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "animalandcropgenomics"
        ]
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}