{
    "additionDate": "2022-10-09T13:23:39.597466Z",
    "biotoolsCURIE": "biotools:el-rmlocnet",
    "biotoolsID": "el-rmlocnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Muhammad_Nabeel.Asim@dfki.de",
            "name": "Muhammad Nabeel Asim",
            "typeEntity": "Person"
        }
    ],
    "description": "An explainable LSTM network for RNA-associated multi-compartment localization prediction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "https://sds_genetic_analysis.opendfki.de/subcellular_loc/",
    "lastUpdate": "2024-11-24T15:28:29.435465Z",
    "license": "Other",
    "name": "EL-RMLocNet",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2022.07.031",
            "metadata": {
                "abstract": "Subcellular localization of Ribonucleic Acid (RNA) molecules provide significant insights into the functionality of RNAs and helps to explore their association with various diseases. Predominantly developed single-compartment localization predictors (SCLPs) lack to demystify RNA association with diverse biochemical and pathological processes mainly happen through RNA co-localization in multiple compartments. Limited multi-compartment localization predictors (MCLPs) manage to produce decent performance only for target RNA class of particular sub-type. Further, existing computational approaches have limited practical significance and potential to optimize therapeutics due to the poor degree of model explainability. The paper in hand presents an explainable Long Short-Term Memory (LSTM) network “EL-RMLocNet”, predictive performance and interpretability of which are optimized using a novel GeneticSeq2Vec statistical representation learning scheme and attention mechanism for accurate multi-compartment localization prediction of different RNAs solely using raw RNA sequences. GeneticSeq2Vec generates optimized statistical vectors of raw RNA sequences by capturing short and long range relations of nucleotide k-mers. Using sequence vectors generated by GeneticSeq2Vec scheme, Long Short Term Memory layers extract most informative features, weighting of which on the basis of discriminative potential for accurate multi-compartment localization prediction is performed using attention layer. Through reverse engineering, weights of statistical feature space are mapped to nucleotide k-mers patterns to make multi-compartment localization prediction decision making transparent and explainable for different RNA classes and species. Empirical evaluation indicates that EL-RMLocNet outperforms state-of-the-art predictor for subcellular localization prediction of 4 different RNA classes by an average accuracy figure of 8% for Homo Sapiens species and 6% for Mus Musculus species. EL-RMLocNet is freely available as a web server at (https://sds_genetic_analysis.opendfki.de/subcellular_loc/).",
                "authors": [
                    {
                        "name": "Ahmed S."
                    },
                    {
                        "name": "Asim M.N."
                    },
                    {
                        "name": "Cloarec O."
                    },
                    {
                        "name": "Dengel A."
                    },
                    {
                        "name": "Ibrahim M.A."
                    },
                    {
                        "name": "Malik M.I."
                    },
                    {
                        "name": "Trygg J."
                    },
                    {
                        "name": "Zehe C."
                    }
                ],
                "citationCount": 7,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "EL-RMLocNet: An explainable LSTM network for RNA-associated multi-compartment localization prediction"
            },
            "pmcid": "PMC9356161",
            "pmid": "35983235"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
