{
    "additionDate": "2021-10-05T21:35:11.944560Z",
    "biotoolsCURIE": "biotools:xconnector",
    "biotoolsID": "xconnector",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aliali.mostafa99@gmail.com",
            "name": "Ali Mostafa Anwar",
            "orcidid": "https://orcid.org/0000-0002-5201-387X"
        }
    ],
    "description": "Xconnector is a software package designed to easily retrieve, and visualize metabolomics data from different database sources.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Proteomicslab57357/Xconnector"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://github.com/Proteomicslab57357/Xconnector"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database comparison",
                    "uri": "http://edamontology.org/operation_3561"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Proteomicslab57357/Xconnector",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-05T21:35:11.947166Z",
    "license": "Other",
    "name": "Xconnector",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JPROT.2021.104302",
            "metadata": {
                "abstract": "© 2021Metabolomics databases contain crucial information collected from various biological systems and experiments. Developers and scientists performed massive efforts to make the database public and accessible. The diversity of the metabolomics databases arises from the different data types included within the database originating from various sources and experiments can be confusing for biologists and researchers who need further manual investigation for the retrieved data. Xconnector is a software package designed to easily retrieve and visualize metabolomics data from different databases. Xconnector can parse information from Human Metabolome Database (HMDB), Livestock Metabolome Database (LMDB), Yeast Metabolome Database (YMDB), Toxin and Toxin Target Database (T3DB), ReSpect Phytochemicals Database (ReSpectDB), The Blood Exposome Database, Phenol-Explorer Database, Kyoto Encyclopedia of Genes and Genomes (KEGG), and Small Molecule Pathway Database (SMPDB). Using Python language, Xconnector connects the targeted databases, recover requested metabolites from single or different database sources, reformat and repack the data to generate a single Excel CSV file containing all information from the databases, in an application programming interface (API)/ Python dependent manner seamlessly. In addition, Xconnector automatically generates graphical outputs in a time-saving approach ready for publication. Significance: The powerful ability of Xconnector to summarize metabolomics information from different sources would enable researchers to get a closer glimpse on the nature of potential molecules of interest toward medical diagnostics, better biomarker discovery, and personalized medicine. The software is available as an executable application and as a python package compatible for different operating systems.",
                "authors": [
                    {
                        "name": "Anwar A.M."
                    },
                    {
                        "name": "Ahmed E.A."
                    },
                    {
                        "name": "Soudy M."
                    },
                    {
                        "name": "Osama A."
                    },
                    {
                        "name": "Ezzeldin S."
                    },
                    {
                        "name": "Tanios A."
                    },
                    {
                        "name": "Mahgoub S."
                    },
                    {
                        "name": "Magdeldin S."
                    }
                ],
                "date": "2021-08-15T00:00:00Z",
                "journal": "Journal of Proteomics",
                "title": "Xconnector: Retrieving and visualizing metabolites and pathways information from various database resources"
            },
            "pmid": "34111608"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}