{
    "additionDate": "2017-08-03T19:08:04Z",
    "biotoolsCURIE": "biotools:rhat",
    "biotoolsID": "rhat",
    "credit": [
        {
            "email": "dfguan@hit.edu.cn",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/derekguan/rHAT"
        }
    ],
    "description": "A seed-and-extension-based noisy long read alignment tool. It is suitable for aligning 3rd generation sequencing reads which are in large read length with relatively high error rate, especially Pacbio’s Single Molecule Read-time (SMRT) sequencing reads.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/derekguan/rHAT"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                }
            ]
        }
    ],
    "homepage": "https://github.com/derekguan/rHAT",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rhat-fast-alignment-of-noisy-long-reads-with-regional-hashing.html"
        }
    ],
    "name": "rHAT",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved.Motivation: Single Molecule Real-Time (SMRT) sequencing has been widely applied in cutting-edge genomic studies. However, it is still an expensive task to align the noisy long SMRT reads to reference genome by state-of-the-art aligners, which is becoming a bottleneck in applications with SMRT sequencing. Novel approach is on demand for improving the efficiency and effectiveness of SMRT read alignment. Results: We propose Regional Hashing-based Alignment Tool (rHAT), a seed-and-extension-based read alignment approach specifically designed for noisy long reads. rHAT indexes reference genome by regional hash table (RHT), a hash table-based index which describes the short tokens within local windows of reference genome. In the seeding phase, rHAT utilizes RHT for efficiently calculating the occurrences of short token matches between partial read and local genomic windows to find highly possible candidate sites. In the extension phase, a sparse dynamic programming-based heuristic approach is used for reducing the cost of aligning read to the candidate sites. By benchmarking on the real and simulated datasets from various prokaryote and eukaryote genomes, we demonstrated that rHAT can effectively align SMRT reads with outstanding throughput. Availability and implementation: rHAT is implemented in C++; the source code is available at https://github.com/HIT-Bioinformatics/rHAT. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Guan D."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Teng M."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 13,
                "date": "2016-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RHAT: Fast alignment of noisy long reads with regional hashing"
            },
            "pmid": "26568628"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
