{
    "additionDate": "2023-03-15T16:34:56.863478Z",
    "biotoolsCURIE": "biotools:csm-toxin",
    "biotoolsID": "csm-toxin",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "d.ascher@uq.edu.au",
            "name": "David B. Ascher",
            "orcidid": "https://orcid.org/0000-0003-2948-2413",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel in-silico protein toxicity classifier, which relies solely on the protein primary sequence.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "https://biosig.lab.uq.edu.au/csm_toxin",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-03-15T16:34:56.867939Z",
    "license": "Not licensed",
    "name": "CSM-Toxin",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3390/PHARMACEUTICS15020431",
            "metadata": {
                "abstract": "Biologics are one of the most rapidly expanding classes of therapeutics, but can be associated with a range of toxic properties. In small-molecule drug development, early identification of potential toxicity led to a significant reduction in clinical trial failures, however we currently lack robust qualitative rules or predictive tools for peptide- and protein-based biologics. To address this, we have manually curated the largest set of high-quality experimental data on peptide and protein toxicities, and developed CSM-Toxin, a novel in-silico protein toxicity classifier, which relies solely on the protein primary sequence. Our approach encodes the protein sequence information using a deep learning natural languages model to understand “biological” language, where residues are treated as words and protein sequences as sentences. The CSM-Toxin was able to accurately identify peptides and proteins with potential toxicity, achieving an MCC of up to 0.66 across both cross-validation and multiple non-redundant blind tests, outperforming other methods and highlighting the robust and generalisable performance of our model. We strongly believe the CSM-Toxin will serve as a valuable platform to minimise potential toxicity in the biologic development pipeline. Our method is freely available as an easy-to-use webserver.",
                "authors": [
                    {
                        "name": "Ascher D.B."
                    },
                    {
                        "name": "Morozov V."
                    },
                    {
                        "name": "Rodrigues C.H.M."
                    }
                ],
                "date": "2023-02-01T00:00:00Z",
                "journal": "Pharmaceutics",
                "title": "CSM-Toxin: A Web-Server for Predicting Protein Toxicity"
            },
            "pmcid": "PMC9966851",
            "pmid": "36839752"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
