{
    "additionDate": "2018-07-09T16:22:38Z",
    "biotoolsCURIE": "biotools:functionannotator",
    "biotoolsID": "functionannotator",
    "credit": [
        {
            "email": "petang@mail.cgu.edu.tw",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Versatile and efficient web tool for non-model organism annotation.",
    "documentation": [
        {
            "type": "General",
            "url": "http://fa.cgu.edu.tw/tutorial.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree annotation",
                    "uri": "http://edamontology.org/operation_0558"
                }
            ]
        }
    ],
    "homepage": "http://fa.cgu.edu.tw/",
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "FunctionAnnotator",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/s41598-017-10952-4",
            "metadata": {
                "abstract": "© 2017 The Author(s). Along with the constant improvement in high-throughput sequencing technology, an increasing number of transcriptome sequencing projects are carried out in organisms without decoded genome information and even on environmental biological samples. To study the biological functions of novel transcripts, the very first task is to identify their potential functions. We present a web-based annotation tool, FunctionAnnotator, which offers comprehensive annotations, including GO term assignment, enzyme annotation, domain/motif identification and predictions for subcellular localization. To accelerate the annotation process, we have optimized the computation processes and used parallel computing for all annotation steps. Moreover, FunctionAnnotator is designed to be versatile, and it generates a variety of useful outputs for facilitating other analyses. Here, we demonstrate how FunctionAnnotator can be helpful in annotating non-model organisms. We further illustrate that FunctionAnnotator can estimate the taxonomic composition of environmental samples and assist in the identification of novel proteins by combining RNA-Seq data with proteomics technology. In summary, FunctionAnnotator can efficiently annotate transcriptomes and greatly benefits studies focusing on non-model organisms or metatranscriptomes. FunctionAnnotator, a comprehensive annotation web-service tool, is freely available online at: http://fa.cgu.edu.tw/. This new web-based annotator will shed light on field studies involving organisms without a reference genome.",
                "authors": [
                    {
                        "name": "Chen T.-W."
                    },
                    {
                        "name": "Gan R.-C."
                    },
                    {
                        "name": "Fang Y.-K."
                    },
                    {
                        "name": "Chien K.-Y."
                    },
                    {
                        "name": "Liao W.-C."
                    },
                    {
                        "name": "Chen C.-C."
                    },
                    {
                        "name": "Wu T.H."
                    },
                    {
                        "name": "Chang I.Y.-F."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Huang P.-J."
                    },
                    {
                        "name": "Yeh Y.-M."
                    },
                    {
                        "name": "Chiu C.-H."
                    },
                    {
                        "name": "Huang T.-W."
                    },
                    {
                        "name": "Tang P."
                    }
                ],
                "citationCount": 3,
                "date": "2017-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "FunctionAnnotator, a versatile and efficient web tool for non-model organism annotation"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ],
    "validated": 1
}