{
    "additionDate": "2021-01-18T09:00:32Z",
    "biotoolsCURIE": "biotools:sceqtl",
    "biotoolsID": "sceqtl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangxg@tsinghua.edu.cn",
            "name": "Xuegong Zhang",
            "orcidid": "https://orcid.org/0000-0002-9684-5643",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for identifying eQTL from single-cell parallel sequencing data.\n\nSCeQTL is an R package that uses zero-inflated negative binomial regression to do eQTL analysis on single-cell data. It can distinguish two type of gene-expression differences among different genotype groups. It’s more suitable to use SCeQTL to identify eQTLs from single-cell data. It can also be used for finding gene expression variations associated with other grouping factors like cell lineages. Following is the detail information and usage of this program. You can also found them in READ.ME. R Packages is a book based around this workflow.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XuegongLab/SCeQTL/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T17:46:07Z",
    "name": "SCeQTL",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3534-6",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: With the rapid development of single-cell genomics, technologies for parallel sequencing of the transcriptome and genome in each single cell is being explored in several labs and is becoming available. This brings us the opportunity to uncover association between genotypes and gene expression phenotypes at single-cell level by eQTL analysis on single-cell data. New method is needed for such tasks due to special characteristics of single-cell sequencing data. Results: We developed an R package SCeQTL that uses zero-inflated negative binomial regression to do eQTL analysis on single-cell data. It can distinguish two type of gene-expression differences among different genotype groups. It can also be used for finding gene expression variations associated with other grouping factors like cell lineages or cell types. Conclusions: The SCeQTL method is capable for eQTL analysis on single-cell data as well as detecting associations of gene expression with other grouping factors. The R package of the method is available at https://github.com/XuegongLab/SCeQTL/.",
                "authors": [
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Xi X."
                    },
                    {
                        "name": "Yang Q."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2020-05-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SCeQTL: An R package for identifying eQTL from single-cell parallel sequencing data"
            },
            "pmcid": "PMC7216638",
            "pmid": "32393315"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}