{
    "additionDate": "2018-09-25T06:39:40Z",
    "biotoolsCURIE": "biotools:dssr",
    "biotoolsID": "dssr",
    "credit": [
        {
            "email": "xiangjun@x3dna.org",
            "name": "Xiang-Jun Lu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "DSSR (Dissecting the Spatial Structure of RNA) is an integrated and automated tool for analyzing and annotating RNA tertiary structures.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://docs.x3dna.org/dssr-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "http://x3dna.org/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "name": "DSSR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1093/nar/gkv716",
            "metadata": {
                "abstract": "© The Author(s) 2015. Published by Oxford University Press on behalf of Nucleic Acids Research.Insight into the three-dimensional architecture of RNA is essential for understanding its cellular functions. However, even the classic transfer RNA structure contains features that are overlooked by existing bioinformatics tools. Here we present DSSR (Dissecting the Spatial Structure of RNA), an integrated and automated tool for analyzing and annotating RNA tertiary structures. The software identifies canonical and noncanonical base pairs, including those with modified nucleotides, in any tautomeric or protonation state. DSSR detects higher-order coplanar base associations, termed multiplets. It finds arrays of stacked pairs, classifies them by base-pair identity and backbone connectivity, and distinguishes a stem of covalently connected canonical pairs from a helix of stacked pairs of arbitrary type/linkage. DSSR identifies coaxial stacking of multiple stems within a single helix and lists isolated canonical pairs that lie outside of a stem. The program characterizes 'closed' loops of various types (hairpin, bulge, internal, and junction loops) and pseudoknots of arbitrary complexity. Notably, DSSR employs isolated pairs and the ends of stems, whether pseudoknotted or not, to define junction loops. This new, inclusive definition provides a novel perspective on the spatial organization of RNA. Tests on all nucleic acid structures in the Protein Data Bank confirm the efficiency and robustness of the software, and applications to representative RNA molecules illustrate its unique features. DSSR and related materials are freely available at http://x3dna.org/.",
                "authors": [
                    {
                        "name": "Lu X.-J."
                    },
                    {
                        "name": "Bussemaker H.J."
                    },
                    {
                        "name": "Olson W.K."
                    }
                ],
                "citationCount": 68,
                "date": "2015-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DSSR: An integrated software tool for dissecting the spatial structure of RNA"
            },
            "pmcid": "PMC4666379",
            "pmid": "26184874",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "1.8.0"
    ]
}