{
    "additionDate": "2021-01-18T10:11:47Z",
    "biotoolsCURIE": "biotools:remodnav",
    "biotoolsID": "remodnav",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Michael Hanke",
            "typeEntity": "Person"
        }
    ],
    "description": "REMoDNaV is a velocity based eye movement event detection algorithm that is based on, but extends the adaptive Nyström & Holmqvist algorithm (Nyström & Holmqvist, 2010). It is built to be suitable for both static and dynamic stimulation, and is capable of detecting saccades, post-saccadic oscillations, fixations, and smooth pursuit events. REMoDNaV is especially suitable for data without a trial structure and performs robustly on data with temporally varying noise level.\n\nThis repository contains the raw data, the code to generate summary statistics, and raw figures for the manuscript, and the manuscript sources for the publication REMoDNaV: Robust Eye Movement Detection for Natural Viewing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Format detection",
                    "uri": "http://edamontology.org/operation_3357"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/remodnav",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:45:25.345475Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/psychoinformatics-de/paper-remodnav/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/psychoinformatics-de/remodnav"
        }
    ],
    "name": "REMoDNaV",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3758/s13428-020-01428-x",
            "metadata": {
                "abstract": "Tracking of eye movements is an established measurement for many types of experimental paradigms. More complex and more prolonged visual stimuli have made algorithmic approaches to eye-movement event classification the most pragmatic option. A recent analysis revealed that many current algorithms are lackluster when it comes to data from viewing dynamic stimuli such as video sequences. Here we present an event classification algorithm—built on an existing velocity-based approach—that is suitable for both static and dynamic stimulation, and is capable of classifying saccades, post-saccadic oscillations, fixations, and smooth pursuit events. We validated classification performance and robustness on three public datasets: 1) manually annotated, trial-based gaze trajectories for viewing static images, moving dots, and short video sequences, 2) lab-quality gaze recordings for a feature-length movie, and 3) gaze recordings acquired under suboptimal lighting conditions inside the bore of a magnetic resonance imaging (MRI) scanner for the same full-length movie. We found that the proposed algorithm performs on par or better compared to state-of-the-art alternatives for static stimulation. Moreover, it yields eye-movement events with biologically plausible characteristics on prolonged dynamic recordings. Lastly, algorithm performance is robust on data acquired under suboptimal conditions that exhibit a temporally varying noise level. These results indicate that the proposed algorithm is a robust tool with improved classification accuracy across a range of use cases. The algorithm is cross-platform compatible, implemented using the Python programming language, and readily available as free and open-source software from public sources.",
                "authors": [
                    {
                        "name": "Dar A.H."
                    },
                    {
                        "name": "Hanke M."
                    },
                    {
                        "name": "Wagner A.S."
                    }
                ],
                "citationCount": 30,
                "date": "2021-02-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "REMoDNaV: robust eye-movement classification for dynamic stimulation"
            },
            "pmcid": "PMC7880959",
            "pmid": "32710238"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
