{
    "accessibility": "Open access",
    "additionDate": "2021-10-09T18:59:07.237493Z",
    "biotoolsCURIE": "biotools:mel-mp",
    "biotoolsID": "mel-mp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Weidu@jlu.edu.cn",
            "name": "Wei Du",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MEL-MP is a tool for De novo prediction of moonlighting proteins using multimodal deep ensemble learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "http://ml.csbg-jlu.site/mel-mp/",
    "lastUpdate": "2021-10-09T18:59:38.152372Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://bmbl.sdstate.edu/mel-mp/"
        }
    ],
    "name": "MEL-MP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.630379",
            "metadata": {
                "abstract": "© Copyright © 2021 Li, Zhao, Liu, Wang, Wei, Han and Du.Moonlighting proteins (MPs) are a special type of protein with multiple independent functions. MPs play vital roles in cellular regulation, diseases, and biological pathways. At present, very few MPs have been discovered by biological experiments. Due to the lack of data sample, computation-based methods to identify MPs are limited. Currently, there is no de-novo prediction method for MPs. Therefore, systematic research and identification of MPs are urgently required. In this paper, we propose a multimodal deep ensemble learning architecture, named MEL-MP, which is the first de novo computation model for predicting MPs. First, we extract four sequence-based features: primary protein sequence information, evolutionary information, physical and chemical properties, and secondary protein structure information. Second, we select specific classifiers for each kind of feature. Finally, we apply the stacked ensemble to integrate the output of each classifier. Through comprehensive model selection and cross-validation experiments, it is shown that specific classifiers for specific feature types can achieve superior performance. For validating the effectiveness of the fusion-based stacked ensemble, different feature fusion strategies including direct combination and a multimodal deep auto-encoder are used for comparative purposes. MEL-MP is shown to exhibit superior prediction performance (F-score = 0.891), surpassing the existing machine learning model, MPFit (F-score = 0.784). In addition, MEL-MP is leveraged to predict the potential MPs among all human proteins. Furthermore, the distribution of predicted MPs on different chromosomes, the evolution of MPs, the association of MPs with diseases, and the functional enrichment of MPs are also explored. Finally, for maximum convenience, a user-friendly web server is available at: http://ml.csbg-jlu.site/mel-mp/.",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhao J."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wei L."
                    },
                    {
                        "name": "Han S."
                    },
                    {
                        "name": "Du W."
                    }
                ],
                "date": "2021-03-22T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "De novo Prediction of Moonlighting Proteins Using Multimodal Deep Ensemble Learning"
            },
            "pmcid": "PMC8019903",
            "pmid": "33828582",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}