{
    "additionDate": "2021-01-18T09:10:27Z",
    "biotoolsCURIE": "biotools:transpire",
    "biotoolsID": "transpire",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "icristea@princeton.edu",
            "name": "Ileana M. Cristea",
            "orcidid": "https://orcid.org/0000-0002-6533-2458",
            "typeEntity": "Person"
        }
    ],
    "description": "TRanslocation ANalysis for SPatIal pRotEomics. A Computational Pipeline to Elucidate Intracellular Protein Movements from Spatial Proteomics Data Sets.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://transpire.readthedocs.io/en/latest"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://github.com/cristealab/TRANSPIRE_JASMS2020",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-03T10:39:48Z",
    "license": "MIT",
    "name": "TRANSPIRE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/JASMS.0C00033",
            "metadata": {
                "abstract": "Protein localization is paramount to protein function, and the intracellular movement of proteins underlies the regulation of numerous cellular processes. Given advances in spatial proteomics, the investigation of protein localization at a global scale has become attainable. Also becoming apparent is the need for dedicated analytical frameworks that allow the discovery of global intracellular protein movement events. Here, we describe TRANSPIRE, a computational pipeline that facilitates TRanslocation ANalysis of SPatIal pRotEomics data sets. TRANSPIRE leverages synthetic translocation profiles generated from organelle marker proteins to train a probabilistic Gaussian process classifier that predicts changes in protein distribution. This output is then integrated with information regarding co-translocating proteins and complexes and enriched gene ontology associations to discern the putative regulation and function of movement. We validate TRANSPIRE performance for predicting nuclear-cytoplasmic shuttling events. Analyzing an existing data set of nuclear and cytoplasmic proteomes during Kaposi Sarcoma-associated herpesvirus (KSHV)-induced cellular mRNA decay, we confirm that TRANSPIRE readily discerns expected translocations of RNA binding proteins. We next investigate protein translocations during infection with human cytomegalovirus (HCMV), a β-herpesvirus known to induce global organelle remodeling. We find that HCMV infection induces broad changes in protein localization, with over 800 proteins predicted to translocate during virus replication. Evident are protein movements related to HCMV modulation of host defense, metabolism, cellular trafficking, and Wnt signaling. For example, the low-density lipoprotein receptor (LDLR) translocates to the lysosome early in infection in conjunction with its degradation, which we validate by targeted mass spectrometry. Using microscopy, we also validate the translocation of the multifunctional kinase DAPK3, a movement that may contribute to HCMV activation of Wnt signaling.",
                "authors": [
                    {
                        "name": "Cristea I.M."
                    },
                    {
                        "name": "Hofstadter W.A."
                    },
                    {
                        "name": "Kennedy M.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "TRANSPIRE: A Computational Pipeline to Elucidate Intracellular Protein Movements from Spatial Proteomics Data Sets"
            },
            "pmcid": "PMC7737664",
            "pmid": "32401031"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
