{
    "additionDate": "2021-10-10T14:54:09.049480Z",
    "biotoolsCURIE": "biotools:mirdnn",
    "biotoolsID": "mirdnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gstegmayer@sinc.unl.edu.ar",
            "name": "G. Stegmayer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MirDNN is a novel deep learning method specifically designed for pre-miRNA prediction in genome-wide data. The model is a convolutional deep residual neural network that can automatically learn suitable features from the raw data, without manual feature engineering. This model is capable of successfully learn the intrinsic structural characteristics of precursors of miRNAs, as well as their context in a sequence. The proposal has been tested with several genomes of animals and plants and compared with state-of-the-art algorithms.",
    "download": [
        {
            "type": "Source code",
            "url": "http://sourceforge.net/projects/sourcesinc/files/mirdnn"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://sinc.unl.edu.ar/web-demo/mirdnn/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-10-10T14:54:09.052025Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cyones/mirDNN"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cyones/mirDNN/issues"
        }
    ],
    "name": "mirDNN",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2021.104448",
            "metadata": {
                "abstract": "© 2021 Elsevier LtdMicroRNAs (miRNAs) are small non-coding RNAs that have a key role in the regulation of gene expression. The importance of miRNAs is widely acknowledged by the community nowadays and computational methods are needed for the precise prediction of novel candidates to miRNA. This task can be done by searching homologous with sequence alignment tools, but results are restricted to sequences that are very similar to the known miRNA precursors (pre-miRNAs). Besides, a very important property of pre-miRNAs, their secondary structure, is not taken into account by these methods. To fill this gap, many machine learning approaches were proposed in the last years. However, the methods are generally tested in very controlled conditions. If these methods were used under real conditions, the false positives increase and the precisions fall quite below those published. This work provides a novel approach for dealing with the computational prediction of pre-miRNAs: a convolutional deep residual neural network (mirDNN). This model was tested with several genomes of animals and plants, the full-genomes, achieving a precision up to 5 times larger than other approaches at the same recall rates. Furthermore, a novel validation methodology was used to ensure that the performance reported in this study can be effectively achieved when using mirDNN in novel species. To provide fast an easy access to mirDNN, a web demo is available at http://sinc.unl.edu.ar/web-demo/mirdnn/. The demo can process FASTA files with multiple sequences to calculate the prediction scores and generates the nucleotide importance plots. Full source code: http://sourceforge.net/projects/sourcesinc/files/mirdnn and https://github.com/cyones/mirDNN. Contact: gstegmayer@sinc.unl.edu.ar.",
                "authors": [
                    {
                        "name": "Yones C."
                    },
                    {
                        "name": "Raad J."
                    },
                    {
                        "name": "Bugnon L.A."
                    },
                    {
                        "name": "Milone D.H."
                    },
                    {
                        "name": "Stegmayer G."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "High precision in microRNA prediction: A novel genome-wide approach with convolutional deep residual networks"
            },
            "pmid": "33979731",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}