{
    "additionDate": "2021-11-29T08:33:43.848310Z",
    "biotoolsCURIE": "biotools:qdecr",
    "biotoolsID": "qdecr",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "s.lamballaistessensohn@erasmusmc.nl",
            "name": "Sander Lamballais",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "QDECR is an R package to perform vertex-wise analyses on cortical surface maps. It is an attempt to enrich vertex-wise analyses with features commonly found in R, such as easy design matrix creation, using multiply imputed datasets, handling complex formulas, etc. Users familiar with R will immediately notice that the package works similar to most other statistical models in R.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://www.qdecr.com",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T08:33:43.850804Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/slamballais/QDECR"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/slamballais/QDECR/issues"
        }
    ],
    "name": "QDECR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FNINF.2021.561689",
            "metadata": {
                "abstract": "© Copyright © 2021 Lamballais and Muetzel.The cerebral cortex is fundamental to the functioning of the mind and body. In vivo cortical morphology can be studied through magnetic resonance imaging in several ways, including reconstructing surface-based models of the cortex. However, existing software for surface-based statistical analyses cannot accommodate “big data” or commonly used statistical methods such as the imputation of missing data, extensive bias correction, and non-linear modeling. To address these shortcomings, we developed the QDECR package, a flexible and extensible R package for group-level statistical analysis of cortical morphology. QDECR was written with large population-based epidemiological studies in mind and was designed to fully utilize the extensive modeling options in R. QDECR currently supports vertex-wise linear regression. Design matrix generation can be done through simple, familiar R formula specification, and includes user-friendly extensions for R options such as polynomials, splines, interactions and other terms. QDECR can handle unimputed and imputed datasets with thousands of participants. QDECR has a modular design, and new statistical models can be implemented which utilize several aspects from other generic modules which comprise QDECR. In summary, QDECR provides a framework for vertex-wise surface-based analyses that enables flexible statistical modeling and features commonly used in population-based and clinical studies, which have until now been largely absent from neuroimaging research.",
                "authors": [
                    {
                        "name": "Lamballais S."
                    },
                    {
                        "name": "Muetzel R.L."
                    }
                ],
                "date": "2021-04-22T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "QDECR: A Flexible, Extensible Vertex-Wise Analysis Framework in R"
            },
            "pmcid": "PMC8100226",
            "pmid": "33967730",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}