{"credit":[{"email":"bhaibeka@ircm.qc.ca","name":"Benjamin Haibe-Kains","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.pmgenomics.ca/bhklab/"}],"documentation":[{"type":"GENERAL","url":"https://www.pmgenomics.ca/bhklab/software/mrmre"}],"function":[{"operation":[{"term":"Statistical calculation","uri":"http://edamontology.org/operation_2238"}]}],"labels":{"language":["R"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Library"],"topic":[{"term":"Statistics and probability","uri":"http://edamontology.org/topic_2269"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mrmre-parallelized-mrmr-ensemble-feature-selection.html"}],"publication":[{"abstract":"Motivation: Feature selection is one of the main challenges in analyzing high-throughput genomic data. Minimum redundancy maximum relevance (mRMR) is a particularly fast feature selection method for finding a set of both relevant and complementary features. Here we describe the mRMRe R package, in which the mRMR technique is extended by using an ensemble approach to better explore the feature space and build more robust predictors. To deal with the computational complexity of the ensemble approach, the main functions of the package are implemented and parallelized in C using the openMP Application Programming Interface.Results: Our ensemble mRMR implementations outperform the classical mRMR approach in terms of prediction accuracy. They identify genes more relevant to the biological context and may lead to richer biological interpretations. The parallelized functions included in the package show significant gains in terms of run-time speed when compared with previously released packages.Availability: The R package mRMRe is available on Comprehensive R Archive Network and is provided open source under the Artistic-2.0 License. The code used to generate all the results reported in this application note is available from Supplementary File 1. © The Author 2013.","authors":["De Jay N.","Papillon-Cavanagh S.","Olsen C.","El-Hachem N.","Bontempi G.","Haibe-Kains B."],"cit_count":38,"journal":"Bioinformatics","pmid":"23825369","title":"MRMRe: An R package for parallelized mRMR ensemble feature selection","year":"2013-09-15"}],"summary":{"biotoolsCURIE":"biotools:mrmre","biotoolsID":"mrmre","description":"Contains a set of function to compute mutual information matrices from continuous, categorical and survival variables. It also contains function to perform feature selection with minimum Redundancy, Maximum Relevance (mRMR) and a new ensemble mRMR technique.","homepage":"https://www.pmgenomics.ca/bhklab/software/mrmre","name":"mRMRe"}}