{
    "additionDate": "2021-01-18T09:09:13Z",
    "biotoolsCURIE": "biotools:mantis-ml",
    "biotoolsID": "mantis-ml",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dimitrios.vitsios@astrazeneca.com",
            "name": "Dimitrios Vitsios",
            "typeEntity": "Person"
        },
        {
            "email": "slav.petrovski@astrazeneca.com",
            "name": "Slavé Petrovski",
            "typeEntity": "Person"
        }
    ],
    "description": "Disease-Agnostic Gene Prioritization from High-Throughput Genomic Screens by Stochastic Semi-supervised Learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://dvitsios.github.io/mantis-ml-predictions",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-19T09:28:41Z",
    "license": "MPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/astrazeneca-cgr-publications/mantis-ml-release"
        }
    ],
    "name": "mantis-ml",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.AJHG.2020.03.012",
            "metadata": {
                "abstract": "© 2020 The Author(s)Access to large-scale genomics datasets has increased the utility of hypothesis-free genome-wide analyses. However, gene signals are often insufficiently powered to reach experiment-wide significance, triggering a process of laborious triaging of genomic-association-study results. We introduce mantis-ml, a multi-dimensional, multi-step machine-learning framework that allows objective assessment of the biological relevance of genes to disease studies. Mantis-ml is an automated machine-learning framework that follows a multi-model approach of stochastic semi-supervised learning to rank disease-associated genes through iterative learning sessions on random balanced datasets across the protein-coding exome. When applied to a range of human diseases, including chronic kidney disease (CKD), epilepsy, and amyotrophic lateral sclerosis (ALS), mantis-ml achieved an average area under curve (AUC) prediction performance of 0.81–0.89. Critically, to prove its value as a tool that can be used to interpret exome-wide association studies, we overlapped mantis-ml predictions with data from published cohort-level association studies. We found a statistically significant enrichment of high mantis-ml predictions among the highest-ranked genes from hypothesis-free cohort-level statistics, indicating a substantial improvement over the performance of current state-of-the-art methods and pointing to the capture of true prioritization signals for disease-associated genes. Finally, we introduce a generic mantis-ml score (GMS) trained with over 1,200 features as a generic-disease-likelihood estimator, outperforming published gene-level scores. In addition to our tool, we provide a gene prioritization atlas that includes mantis-ml's predictions across ten disease areas and empowers researchers to interactively navigate through the gene-triaging framework. Mantis-ml is an intuitive tool that supports the objective triaging of large-scale genomic discovery studies and enhances our understanding of complex genotype-phenotype associations.",
                "authors": [
                    {
                        "name": "Vitsios D."
                    },
                    {
                        "name": "Petrovski S."
                    }
                ],
                "citationCount": 4,
                "date": "2020-05-07T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Mantis-ml: Disease-Agnostic Gene Prioritization from High-Throughput Genomic Screens by Stochastic Semi-supervised Learning"
            },
            "pmcid": "PMC7212270",
            "pmid": "32386536"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ]
}