{
    "accessibility": "Open access",
    "additionDate": "2022-04-25T14:41:20.008997Z",
    "biotoolsCURIE": "biotools:cosinormixedeffects",
    "biotoolsID": "cosinormixedeffects",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Mayte.SuarezFarinas@mssm.edu",
            "name": "Mayte Suárez-Fariñas",
            "orcidid": "https://orcid.org/0000-0001-8712-3553",
            "typeEntity": "Person"
        }
    ],
    "description": "R package for mixed-effects cosinor models. The cosinoRmixedeffects package can be implemented for the estimation and prediction of the a mixed-effects cosinor model for longitudinal periodic data.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/maytesuarezfarinas/cosinoRmixedeffects",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-04-25T14:41:20.011684Z",
    "license": "GPL-3.0",
    "name": "cosinoRmixedeffects",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04463-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Wearable devices enable monitoring and measurement of physiological parameters over a 24-h period, and some of which exhibit circadian rhythm characteristics. However, the currently available R package cosinor could only analyze daily cross-sectional data and compare the parameters between groups with two levels. To evaluate longitudinal changes in the circadian patterns, we need to extend the model to a mixed-effect model framework, allowing for random effects and interaction between COSINOR parameters and time-varying covariates. Results: We developed the cosinoRmixedeffects R package for modelling longitudinal periodic data using mixed-effects cosinor models. The model allows for covariates and interactions with the non-linear parameters MESOR, amplitude, and acrophase. To facilitate ease of use, the package utilizes the syntax and functions of the widely used emmeans package to obtain estimated marginal means and contrasts. Estimation and hypothesis testing involving the non-linear circadian parameters are carried out using bootstrapping. We illustrate the package functionality by modelling daily measurements of heart rate variability (HRV) collected among health care workers over several months. Differences in circadian patterns of HRV between genders, BMI, and during infection with SARS-CoV2 are evaluated to illustrate how to perform hypothesis testing. Conclusion: cosinoRmixedeffects package provides the model fitting, estimation and hypothesis testing for the mixed-effects COSINOR model, for the linear and non-linear circadian parameters MESOR, amplitude and acrophase. The model accommodates factors with any number of categories, as well as complex interactions with circadian parameters and categorical factors.",
                "authors": [
                    {
                        "name": "Hou R."
                    },
                    {
                        "name": "Suarez-Farinas M."
                    },
                    {
                        "name": "Tomalin L.E."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "cosinoRmixedeffects: an R package for mixed-effects cosinor models"
            },
            "pmcid": "PMC8590130",
            "pmid": "34773978"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gender medicine",
            "uri": "http://edamontology.org/topic_3410"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ],
    "validated": 1
}
