{
    "additionDate": "2025-05-15T09:02:59.172438Z",
    "biotoolsCURIE": "biotools:pytximport",
    "biotoolsID": "pytximport",
    "credit": [
        {
            "email": "malte.kuehl@clin.au.dk",
            "name": "Malte Kuehl",
            "orcidid": "https://orcid.org/0000-0003-4167-2498"
        }
    ],
    "description": "pytximport is a Python package for efficient (gene-)count estimation from transcript quantification files produced by pseudoalignment/quasi-mapping tools such as salmon, kallisto, rsem and others.",
    "documentation": [
        {
            "note": "Includes vignette",
            "type": [
                "API documentation"
            ],
            "url": "https://pytximport.complextissue.com/en/stable/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://github.com/complextissue/pytximport",
    "lastUpdate": "2025-05-15T09:02:59.174828Z",
    "name": "pytximport",
    "owner": "maltekuehl",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btae700",
            "metadata": {
                "abstract": "Transcript quantification tools efficiently map bulk RNA sequencing (RNA-seq) reads to reference transcriptomes. However, their output consists of transcript count estimates that are subject to multiple biases and cannot be readily used with existing differential gene expression analysis tools in Python. Here we present pytximport, a Python implementation of the tximport R package that supports a variety of input formats, different modes of bias correction, inferential replicates, gene-level summarization of transcript counts, transcript-level exports, transcript-to-gene mapping generation, and optional filtering of transcripts by biotype. pytximport is part of the scverse ecosystem of open-source Python software packages for omics analyses and includes both a Python as well as a command-line interface. With pytximport, we propose a bulk RNA-seq analysis workflow based on Bioconda and scverse ecosystem packages, ensuring reproducible analyses through Snakemake rules. We apply this pipeline to a publicly available RNA-seq dataset, demonstrating how pytximport enables the creation of Python-centric workflows capable of providing insights into transcriptomic alterations.",
                "authors": [
                    {
                        "name": "Bonn S."
                    },
                    {
                        "name": "Kuehl M."
                    },
                    {
                        "name": "Puelles V.G."
                    },
                    {
                        "name": "Wanner N."
                    },
                    {
                        "name": "Wong M.N."
                    }
                ],
                "date": "2024-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Gene count estimation with pytximport enables reproducible analysis of bulk RNA sequencing data in Python"
            },
            "pmid": "39565903",
            "type": [
                "Method"
            ]
        }
    ]
}
