{
    "additionDate": "2020-01-14T20:18:52Z",
    "biotoolsCURIE": "biotools:dna-reed-solomon",
    "biotoolsID": "dna-reed-solomon",
    "confidence_flag": "tool",
    "description": "Error correction scheme for storing information on DNA using Reed Solomon codes.\nFor the inner code we decide on a symbol size mi of 6 bit, for the outer code the symbol size mo is 14 bit. These values reflect considerations on accessible DNA sequence lengths and optimal code length.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA mapping",
                    "uri": "http://edamontology.org/operation_2520"
                },
                {
                    "term": "DNA translation",
                    "uri": "http://edamontology.org/operation_0371"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://github.com/reinhardh/dna_rs_coding",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-12-22T09:15:40Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/reinhardh/dna_rs_coding/issues"
        }
    ],
    "name": "DNA error correction information storage",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1038/S41596-019-0244-5",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature Limited.Because of its longevity and enormous information density, DNA is considered a promising data storage medium. In this work, we provide instructions for archiving digital information in the form of DNA and for subsequently retrieving it from the DNA. In principle, information can be represented in DNA by simply mapping the digital information to DNA and synthesizing it. However, imperfections in synthesis, sequencing, storage and handling of the DNA induce errors within the molecules, making error-free information storage challenging. The procedure discussed here enables error-free storage by protecting the information using error-correcting codes. Specifically, in this protocol, we provide the technical details and precise instructions for translating digital information to DNA sequences, physically handling the biomolecules, storing them and subsequently re-obtaining the information by sequencing the DNA. Along with the protocol, we provide computer code that automatically encodes digital information to DNA sequences and decodes the information back from DNA to a digital file. The required software is provided on a Github repository. The protocol relies on commercial DNA synthesis and DNA sequencing via Illumina dye sequencing, and requires 1–2 h of preparation time, 1/2 d for sequencing preparation and 2–4 h for data analysis. This protocol focuses on storage scales of ~100 kB to 15 MB, offering an ideal starting point for small experiments. It can be augmented to enable higher data volumes and random access to the data and also allows for future sequencing and synthesis technologies, by changing the parameters of the encoder/decoder to account for the corresponding error rates.",
                "authors": [
                    {
                        "name": "Antkowiak P.L."
                    },
                    {
                        "name": "Chen W.D."
                    },
                    {
                        "name": "Grass R.N."
                    },
                    {
                        "name": "Heckel R."
                    },
                    {
                        "name": "Koch J."
                    },
                    {
                        "name": "Kohll A.X."
                    },
                    {
                        "name": "Meiser L.C."
                    },
                    {
                        "name": "Stark W.J."
                    }
                ],
                "citationCount": 17,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Reading and writing digital data in DNA"
            },
            "pmid": "31784718"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
