{
    "additionDate": "2020-01-14T09:18:05Z",
    "biotoolsCURIE": "biotools:Pypreclin",
    "biotoolsID": "Pypreclin",
    "confidence_flag": "tool",
    "description": "An automatic pipeline for macaque functional MRI preprocessing.\n\nNon-human primate functional MRI (fMRI) is a growing field in neuroscience. However, there is no standardized method for monkey fMRI data analysis, specifically for data preprocessing. The preprocessing of monkey fMRI data is challenged by several technical and experimental specificities of the monkey research such as artifacts related to body movements or to intracranial leads. Here we propose to address these challenges by developing a new versatile pipeline for macaque fMRI preprocessing. We developed a Python module, Pypreclin, to process raw images using state of the art algorithms embedded in a fully automatic pipeline. To evaluate its robustness, we applied Pypreclin to fMRI data acquired at 3T in both awake and anesthetized macaques, with or without iron oxide contrast agent, using single loop or multichannel phased-array coils, combined or not with intracranial implanted electrodes.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/neurospin/pypreclin",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-13T18:22:23.585577Z",
    "name": "Pypreclin",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.NEUROIMAGE.2019.116353",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.Non-human primate functional MRI (fMRI) is a growing field in neuroscience. However, there is no standardized method for monkey fMRI data analysis, specifically for data preprocessing. The preprocessing of monkey fMRI data is challenged by several technical and experimental specificities of the monkey research such as artifacts related to body movements or to intracranial leads. Here we propose to address these challenges by developing a new versatile pipeline for macaque fMRI preprocessing. We developed a Python module, Pypreclin, to process raw images using state of the art algorithms embedded in a fully automatic pipeline. To evaluate its robustness, we applied Pypreclin to fMRI data acquired at 3T in both awake and anesthetized macaques, with or without iron oxide contrast agent, using single loop or multichannel phased-array coils, combined or not with intracranial implanted electrodes. We performed both resting-state and auditory evoked fMRI and compared the results of Pypreclin to a previously employed preprocessing pipeline. Pypreclin successfully achieved the registration of the fMRI data to the macaque brain template in all the experimental conditions. Moreover, Pypreclin enables more accurate locations of auditory evoked activations in relation to the gray matter at corrected level in the awake fMRI condition. Finally, using the Primate neuroimaging Data-Exchange open access platform, we could further validate Pypreclin for monkey fMRI images that were acquired at ultra-high fields, from other institutions and using different protocols. Pypreclin is a validated preprocessing tool that adapts to diverse experimental and technical situations of monkey fMRI. Pypreclin code is available on open source data sharing platform.",
                "authors": [
                    {
                        "name": "Tasserie J."
                    },
                    {
                        "name": "Grigis A."
                    },
                    {
                        "name": "Uhrig L."
                    },
                    {
                        "name": "Dupont M."
                    },
                    {
                        "name": "Amadon A."
                    },
                    {
                        "name": "Jarraya B."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-15T00:00:00Z",
                "journal": "NeuroImage",
                "title": "Pypreclin: An automatic pipeline for macaque functional MRI preprocessing"
            },
            "pmid": "31743789"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}