{
    "additionDate": "2017-02-14T09:36:38Z",
    "biotoolsCURIE": "biotools:chemmine_tools",
    "biotoolsID": "chemmine_tools",
    "credit": [
        {
            "email": "thomas.girke@ucr.edu",
            "name": "Thomas Girke",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ChemMine Tools is an online service for analyzing and clustering small molecules. A suite of cheminformatics and data mining tools for data visualization, structure comparison, similarity searching, compound clustering and prediction of chemical properties are available.",
    "documentation": [
        {
            "type": "General",
            "url": "http://chemmine.ucr.edu/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structural similarity search",
                    "uri": "http://edamontology.org/operation_0360"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Structure comparison",
                    "uri": "http://edamontology.org/operation_2483"
                }
            ]
        }
    ],
    "homepage": "http://chemmine.ucr.edu",
    "language": [
        "R",
        "Java",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "ChemMine Tools",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "ChemMine Tools is an online service for small molecule data analysis. It provides a web interface to a set of cheminformatics and data mining tools that are useful for various analysis routines performed in chemical genomics and drug discovery. The service also offers programmable access options via the R library ChemmineR. The primary functionalities of ChemMine Tools fall into five major application areas: data visualization, structure comparisons, similarity searching, compound clustering and prediction of chemical properties. First, users can upload compound data sets to the online Compound Workbench. Numerous utilities are provided for compound viewing, structure drawing and format interconversion. Second, pairwise structural similarities among compounds can be quantified. Third, interfaces to ultra-fast structure similarity search algorithms are available to efficiently mine the chemical space in the public domain. These include fingerprint and embeddingindexing algorithms. Fourth, the service includes a Clustering Toolbox that integrates cheminformatic algorithms with data mining utilities to enable systematic structure and activity based analyses of custom compound sets. Fifth, physicochemical property descriptors of custom compound sets can be calculated. These descriptors are important for assessing the bioactivity profile of compounds in silico and quantitative structure - activity relationship (QSAR) analyses. ChemMine Tools is available at: http://chemmine.ucr.edu. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Backman T.W.H."
                    },
                    {
                        "name": "Cao Y."
                    },
                    {
                        "name": "Girke T."
                    }
                ],
                "citationCount": 120,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ChemMine tools: An online service for analyzing and clustering small molecules"
            },
            "pmid": "21576229"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}