{
    "accessibility": "Open access",
    "additionDate": "2016-12-19T14:29:47Z",
    "biotoolsCURIE": "biotools:gdtools_annotate",
    "biotoolsID": "gdtools_annotate",
    "collectionID": [
        "galaxyPasteur",
        "gdtools"
    ],
    "credit": [
        {
            "email": "galaxy@pasteur.fr",
            "name": "Galaxy Support Team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Merge multiple GenomeDiff input files.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://galaxy.pasteur.fr/root?tool_id=toolshed.pasteur.fr%2Frepos%2Fmvalade%2Fgdtools%2Fgdtools_annotate%2F0.26"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://barricklab.org/twiki/pub/Lab/ToolsBacterialGenomeResequencing/documentation/gd_usage.html",
    "lastUpdate": "2024-11-25T13:56:21.181287Z",
    "link": [
        {
            "type": [
                "Galaxy service"
            ],
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=toolshed.pasteur.fr/repos/mvalade/gdtools/gdtools_annotate/0.26"
        }
    ],
    "maturity": "Mature",
    "name": "gdtools_annotate",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hmenager",
    "publication": [
        {
            "doi": "10.1093/nar/gkw343",
            "metadata": {
                "abstract": "High-throughput data production technologies, particularly ‘next-generation’ DNA sequencing, have ushered in widespread and disruptive changes to biomedical research. Making sense of the large datasets produced by these technologies requires sophisticated statistical and computational methods, as well as substantial computational power. This has led to an acute crisis in life sciences, as researchers without informatics training attempt to perform computation-dependent analyses. Since 2005, the Galaxy project has worked to address this problem by providing a framework that makes advanced computational tools usable by non experts. Galaxy seeks to make data-intensive research more accessible, transparent and reproducible by providing a Web-based environment in which users can perform computational analyses and have all of the details automatically tracked for later inspection, publication, or reuse. In this report we highlight recently added features enabling biomedical analyses on a large scale.",
                "authors": [
                    {
                        "name": "Afgan E."
                    },
                    {
                        "name": "Baker D."
                    },
                    {
                        "name": "Blankenberg D."
                    },
                    {
                        "name": "Bouvier D."
                    },
                    {
                        "name": "Cech M."
                    },
                    {
                        "name": "Chilton J."
                    },
                    {
                        "name": "Clements D."
                    },
                    {
                        "name": "Coraor N."
                    },
                    {
                        "name": "Eberhard C."
                    },
                    {
                        "name": "Goecks J."
                    },
                    {
                        "name": "Gruning B."
                    },
                    {
                        "name": "Guerler A."
                    },
                    {
                        "name": "Hillman-Jackson J."
                    },
                    {
                        "name": "Kuster G.V."
                    },
                    {
                        "name": "Nekrutenko A."
                    },
                    {
                        "name": "Rasche E."
                    },
                    {
                        "name": "Soranzo N."
                    },
                    {
                        "name": "Taylor J."
                    },
                    {
                        "name": "Turaga N."
                    },
                    {
                        "name": "van den Beek M."
                    }
                ],
                "citationCount": 1410,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The Galaxy platform for accessible, reproducible and collaborative biomedical analyses: 2016 update"
            },
            "pmcid": "PMC4987906",
            "pmid": "27137889",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1186/1471-2164-15-1039",
            "metadata": {
                "abstract": "Background: Mutations that alter chromosomal structure play critical roles in evolution and disease, including in the origin of new lifestyles and pathogenic traits in microbes. Large-scale rearrangements in genomes are often mediated by recombination events involving new or existing copies of mobile genetic elements, recently duplicated genes, or other repetitive sequences. Most current software programs for predicting structural variation from short-read DNA resequencing data are intended primarily for use on human genomes. They typically disregard information in reads mapping to repeat sequences, and significant post-processing and manual examination of their output is often required to rule out false-positive predictions and precisely describe mutational events. Results: We have implemented an algorithm for identifying structural variation from DNA resequencing data as part of the breseq computational pipeline for predicting mutations in haploid microbial genomes. Our method evaluates the support for new sequence junctions present in a clonal sample from split-read alignments to a reference genome, including matches to repeat sequences. Then, it uses a statistical model of read coverage evenness to accept or reject these predictions. Finally, breseq combines predictions of new junctions and deleted chromosomal regions to output biologically relevant descriptions of mutations and their effects on genes. We demonstrate the performance of breseq on simulated Escherichia coli genomes with deletions generating unique breakpoint sequences, new insertions of mobile genetic elements, and deletions mediated by mobile elements. Then, we reanalyze data from an E. coli K-12 mutation accumulation evolution experiment in which structural variation was not previously identified. Transposon insertions and large-scale chromosomal changes detected by breseq account for ~25% of spontaneous mutations in this strain. In all cases, we find that breseq is able to reliably predict structural variation with modest read-depth coverage of the reference genome (>40-fold). Conclusions: Using breseq to predict structural variation should be useful for studies of microbial epidemiology, experimental evolution, synthetic biology, and genetics when a reference genome for a closely related strain is available. In these cases, breseq can discover mutations that may be responsible for important or unintended changes in genomes that might otherwise go undetected.",
                "authors": [
                    {
                        "name": "Barrick J.E."
                    },
                    {
                        "name": "Borges J.J."
                    },
                    {
                        "name": "Colburn G."
                    },
                    {
                        "name": "Deatherage D.E."
                    },
                    {
                        "name": "Knoester D.B."
                    },
                    {
                        "name": "Meyer A.G."
                    },
                    {
                        "name": "Reba A."
                    },
                    {
                        "name": "Strand M.D."
                    },
                    {
                        "name": "Traverse C.C."
                    }
                ],
                "citationCount": 158,
                "date": "2014-11-29T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Identifying structural variation in haploid microbial genomes from short-read resequencing data using breseq"
            },
            "pmcid": "PMC4300727",
            "pmid": "25432719",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.7490/f1000research.1114334.1",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "0.26"
    ]
}
