{
    "additionDate": "2020-01-14T09:35:40Z",
    "biotoolsCURIE": "biotools:MKpLMM",
    "biotoolsID": "MKpLMM",
    "confidence_flag": "tool",
    "description": "Multi-kernel linear mixed model with adaptive lasso for prediction analysis on high-dimensional multi-omics data.\n\nMOTIVATION:The use of human genome discoveries and other established factors to build an accurate risk prediction model is an essential step towards precision medicine. While multi-layer high-dimensional omics data provide unprecedented data resources for prediction studies, their corresponding analytical methods are much less developed. RESULTS:We present a multi-kernel linear mixed model with adaptive lasso (MKpLMM), a predictive modeling framework that extends the standard linear mixed models widely used in genomic risk prediction, for multi-omics data analysis. MKpLMM can capture not only the predictive effects from each layer of omics data but also their interactions via using multiple kernel functions.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/YaluWen/OmicPred",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:51:55.741570Z",
    "name": "MKpLMM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btz822",
            "metadata": {
                "abstract": "Motivation: The use of human genome discoveries and other established factors to build an accurate risk prediction model is an essential step toward precision medicine. While multi-layer high-dimensional omics data provide unprecedented data resources for prediction studies, their corresponding analytical methods are much less developed. Results: We present a multi-kernel penalized linear mixed model with adaptive lasso (MKpLMM), a predictive modeling framework that extends the standard linear mixed models widely used in genomic risk prediction, for multi-omics data analysis. MKpLMM can capture not only the predictive effects from each layer of omics data but also their interactions via using multiple kernel functions. It adopts a data-driven approach to select predictive regions as well as predictive layers of omics data, and achieves robust selection performance. Through extensive simulation studies, the analyses of PET-imaging outcomes from the Alzheimer’s Disease Neuroimaging Initiative study, and the analyses of 64 drug responses, we demonstrate that MKpLMM consistently outperforms competing methods in phenotype prediction.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Lu Q."
                    },
                    {
                        "name": "Wen Y."
                    }
                ],
                "citationCount": 23,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Multi-kernel linear mixed model with adaptive lasso for prediction analysis on high-dimensional multi-omics data"
            },
            "pmcid": "PMC7523642",
            "pmid": "31693075"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}
