{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:20:58Z",
    "biotoolsCURIE": "biotools:CutpointsOEHR",
    "biotoolsID": "CutpointsOEHR",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zhjinx@mail.sysu.edu.cn",
            "name": "Jinxin Zhang",
            "orcidid": "https://orcid.org/0000-0002-1123-5556",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Optimal Equal-HR Method to Find Two Cutpoints for U-Shaped Relationships in Cox Model.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/CutpointsOEHR/CutpointsOEHR.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://cran.r-project.org/src/contrib/CutpointsOEHR_0.1.2.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=CutpointsOEHR",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "CutpointsOEHR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12874-019-0738-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: In clinical and epidemiological researches, continuous predictors are often discretized into categorical variables for classification of patients. When the relationship between a continuous predictor and log relative hazards is U-shaped in survival data, there is a lack of a satisfying solution to find optimal cut-points to discretize the continuous predictor. In this study, we propose a novel approach named optimal equal-HR method to discretize a continuous variable that has a U-shaped relationship with log relative hazards in survival data. Methods: The main idea of the optimal equal-HR method is to find two optimal cut-points that have equal log relative hazard values and result in Cox models with minimum AIC value. An R package 'CutpointsOEHR' has been developed for easy implementation of the optimal equal-HR method. A Monte Carlo simulation study was carried out to investigate the performance of the optimal equal-HR method. In the simulation process, different censoring proportions, baseline hazard functions and asymmetry levels of U-shaped relationships were chosen. To compare the optimal equal-HR method with other common approaches, the predictive performance of Cox models with variables discretized by different cut-points was assessed. Results: Simulation results showed that in asymmetric U-shape scenarios the optimal equal-HR method had better performance than the median split method, the upper and lower quantiles method, and the minimum p-value method regarding discrimination ability and overall performance of Cox models. The optimal equal-HR method was applied to a real dataset of small cell lung cancer. The real data example demonstrated that the optimal equal-HR method could provide clinical meaningful cut-points and had good predictive performance in Cox models. Conclusions: In general, the optimal equal-HR method is recommended to discretize a continuous predictor with right-censored outcomes if the predictor has an asymmetric U-shaped relationship with log relative hazards based on Cox regression models.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Mahara G."
                    },
                    {
                        "name": "Lin Z."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 4,
                "date": "2019-05-09T00:00:00Z",
                "journal": "BMC Medical Research Methodology",
                "title": "A novel approach to determine two optimal cut-points of a continuous predictor with a U-shaped relationship to hazard ratio in survival data: Simulation and application"
            },
            "pmcid": "PMC6507062",
            "pmid": "31072334",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ],
    "validated": 1
}