{
    "additionDate": "2020-01-14T08:54:00Z",
    "biotoolsCURIE": "biotools:DeepMSA",
    "biotoolsID": "DeepMSA",
    "confidence_flag": "tool",
    "description": "Constructing deep multiple sequence alignment to improve contact prediction and fold-recognition for distant-homology proteins.\n\ndeep multiple sequence alignment generation.\n\nDeepMSA is a composite approach to generate high quality multiple sequence alignment with large alignment depth and diverse sequence sources by merging sequences from whole-genome sequence databases (Uniclust30 and UniRef90) and from metagenome database (Metaclust). Large-scale benchmark data show that DeepMSA profiles consistently improves contact prediction, secondary structure prediction, and threading over default HHblits or PSI-BLAST profiles",
    "download": [
        {
            "type": "Software package",
            "url": "https://zhanglab.ccmb.med.umich.edu/DeepMSA/package.zip"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "https://zhanglab.ccmb.med.umich.edu/DeepMSA/",
    "lastUpdate": "2020-12-20T11:11:26Z",
    "name": "DeepMSA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ863",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: The success of genome sequencing techniques has resulted in rapid explosion of protein sequences. Collections of multiple homologous sequences can provide critical information to the modeling of structure and function of unknown proteins. There are however no standard and efficient pipeline available for sensitive multiple sequence alignment (MSA) collection. This is particularly challenging when large whole-genome and metagenome databases are involved. Results: We developed DeepMSA, a new open-source method for sensitive MSA construction, which has homologous sequences and alignments created from multi-sources of whole-genome and metagenome databases through complementary hidden Markov model algorithms. The practical usefulness of the pipeline was examined in three large-scale benchmark experiments based on 614 non-redundant proteins. First, DeepMSA was utilized to generate MSAs for residue-level contact prediction by six coevolution and deep learning-based programs, which resulted in an accuracy increase in long-range contacts by up to 24.4% compared to the default programs. Next, multiple threading programs are performed for homologous structure identification, where the average TM-score of the template alignments has over 7.5% increases with the use of the new DeepMSA profiles. Finally, DeepMSA was used for secondary structure prediction and resulted in statistically significant improvements in the Q3 accuracy. It is noted that all these improvements were achieved without re-training the parameters and neural-network models, demonstrating the robustness and general usefulness of the DeepMSA in protein structural bioinformatics applications, especially for targets without homologous templates in the PDB library.",
                "authors": [
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Zheng W."
                    },
                    {
                        "name": "Mortuza S.M."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 24,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeepMSA: Constructing deep multiple sequence alignment to improve contact prediction and fold-recognition for distant-homology proteins"
            },
            "pmid": "31738385"
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}