{
    "additionDate": "2017-12-18T00:11:50Z",
    "biotoolsCURIE": "biotools:rna_frabase",
    "biotoolsID": "rna_frabase",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bio.cs.put.poznan.pl/"
        }
    ],
    "description": "An engine with database to search the three-dimensional fragments within 3D RNA structures using as an input the sequence(s) and / or secondary structure(s) given in the dot-bracket notation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://rnafrabase.ibch.poznan.pl/?act=help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://rnafrabase.ibch.poznan.pl/",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2021-05-13T10:19:20Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rna-frabase-2-0-rna-fragment-search-engine-database.html"
        }
    ],
    "name": "RNA FRABASE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_012808"
        }
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-11-231",
            "metadata": {
                "abstract": "Background: Recent discoveries concerning novel functions of RNA, such as RNA interference, have contributed towards the growing importance of the field. In this respect, a deeper knowledge of complex three-dimensional RNA structures is essential to understand their new biological functions. A number of bioinformatic tools have been proposed to explore two major structural databases (PDB, NDB) in order to analyze various aspects of RNA tertiary structures. One of these tools is RNA FRABASE 1.0, the first web-accessible database with an engine for automatic search of 3D fragments within PDB-derived RNA structures. This search is based upon the user-defined RNA secondary structure pattern. In this paper, we present and discuss RNA FRABASE 2.0. This second version of the system represents a major extension of this tool in terms of providing new data and a wide spectrum of novel functionalities. An intuitionally operated web server platform enables very fast user-tailored search of three-dimensional RNA fragments, their multi-parameter conformational analysis and visualization.Description: RNA FRABASE 2.0 has stored information on 1565 PDB-deposited RNA structures, including all NMR models. The RNA FRABASE 2.0 search engine algorithms operate on the database of the RNA sequences and the new library of RNA secondary structures, coded in the dot-bracket format extended to hold multi-stranded structures and to cover residues whose coordinates are missing in the PDB files. The library of RNA secondary structures (and their graphics) is made available. A high level of efficiency of the 3D search has been achieved by introducing novel tools to formulate advanced searching patterns and to screen highly populated tertiary structure elements. RNA FRABASE 2.0 also stores data and conformational parameters in order to provide \"on the spot\" structural filters to explore the three-dimensional RNA structures. An instant visualization of the 3D RNA structures is provided. RNA FRABASE 2.0 is freely available at http://rnafrabase.cs.put.poznan.pl.Conclusions: RNA FRABASE 2.0 provides a novel database and powerful search engine which is equipped with new data and functionalities that are unavailable elsewhere. Our intention is that this advanced version of the RNA FRABASE will be of interest to all researchers working in the RNA field. © 2010 Popenda et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Popenda M."
                    },
                    {
                        "name": "Szachniuk M."
                    },
                    {
                        "name": "Blazewicz M."
                    },
                    {
                        "name": "Wasik S."
                    },
                    {
                        "name": "Burke E.K."
                    },
                    {
                        "name": "Blazewicz J."
                    },
                    {
                        "name": "Adamiak R.W."
                    }
                ],
                "citationCount": 96,
                "date": "2010-05-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "RNA FRABASE 2.0: An advanced web-accessible database with the capacity to search the three-dimensional fragments within RNA structures"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}