{
    "additionDate": "2019-11-14T18:31:11Z",
    "biotoolsCURIE": "biotools:SynBioHub",
    "biotoolsID": "SynBioHub",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andrew.millar@ed.ac.uk",
            "name": "Andrew J Millar",
            "typeEntity": "Person"
        }
    ],
    "description": "evaluation of free management platforms for synthetic biology designs | Web application enabling users and software to browse, upload, and share synthetic biology designs | Dumps all sequences from SynBioHub instances as FASTA | A parts repository for synthetic biology | SynBioHub is a design repository for people designing biological constructs. It enables DNA and protein designs to be uploaded, then provides a shareable link to allow others to view them. SynBioHub also facilitates searching for information about existing useful parts and designs by combining data from a variety of sources",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://synbiohub.org",
    "lastUpdate": "2020-12-27T13:21:30Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/SynBioHub"
        }
    ],
    "name": "SynBioHub",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/SYNBIO/YSZ016",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Synthetic biology aims to introduce engineering principles into biology, for example, the construction of biological devices by assembling previously-characterized, functional parts. This approach demands new resources for cataloging and sharing biological components and designs, in order to accelerate the design-build-test-learn cycle. We evaluated two free, open source software platforms for managing synthetic biology data: Joint Bioenergy Institute-Inventory of Composable Elements (JBEI-ICE) and SynBioHub. We analyzed the systems from the perspective of experimental biology research groups in academia, which seek to incorporate the repositories into their synthetic biology workflow. Here, we define the minimal requirements for a repository in this context and develop three usage scenarios, where we then examine the two platforms: (i) supporting the synthetic biology design-build-test-learn cycle, (ii) batch deposit of existing designs into the repository and (iii) discovery and reuse of designs from the repository. Our evaluation of JBEI-ICE and SynBioHub provides an insight into the current state of synthetic biology resources, might encourage their wider adoption and should guide future development to better meet the needs of this user group.",
                "authors": [
                    {
                        "name": "Millar A.J."
                    },
                    {
                        "name": "Urquiza-Garcia U."
                    },
                    {
                        "name": "Zielinski T."
                    }
                ],
                "citationCount": 2,
                "date": "2019-05-21T00:00:00Z",
                "journal": "Synthetic Biology",
                "title": "Better research by efficient sharing: Evaluation of free management platforms for synthetic biology designs"
            },
            "pmcid": "PMC6690502",
            "pmid": "31423466"
        }
    ],
    "topic": [
        {
            "term": "Bioengineering",
            "uri": "http://edamontology.org/topic_3398"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Synthetic biology",
            "uri": "http://edamontology.org/topic_3895"
        }
    ],
    "validated": 1
}
