{"collectionID": [], "accessibility": [], "topic": [{"term": "Phylogenomics", "uri": "http://edamontology.org/topic_0194"}, {"term": "Sequence sites, features and motifs", "uri": "http://edamontology.org/topic_0160"}, {"term": "Phylogenetics", "uri": "http://edamontology.org/topic_3293"}, {"term": "Gene and protein families", "uri": "http://edamontology.org/topic_0623"}, {"term": "Protein folds and structural domains", "uri": "http://edamontology.org/topic_0736"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "12874053", "type": null, "pmcid": null, "metadata": {"title": "SATCHMO: Sequence alignment and tree construction using hidden Markov models", "abstract": "Motivation: Aligning multiple proteins based on sequence information alone is challenging if sequence identity is low or there is a significant degree of structural divergence. We present a novel algorithm (SATCHMO) that is designed to address this challenge. SATCHMO simultaneously constructs a tree and a set of multiple sequence alignments, one for each internal node of the tree. The alignment at a given node contains all sequences within its sub-tree, and predicts which positions in those sequences are alignable and which are not. Aligned regions therefore typically get shorter on a path from a leaf to the root as sequences diverge in structure. Current methods either regard all positions as alignable (e.g. ClustalW), or align only those positions believed to be homologous across all sequences (e.g. profile HMM methods); by contrast SATCHMO makes different predictions of alignable regions in different subgroups. SATCHMO generates profile hidden Markov models at each node; these are used to determine branching order, to align sequences and to predict structurally alignable regions. Results: In experiments on the BAliBASE benchmark alignment database, SATCHMO is shown to perform comparably to ClustalW and the UCSC SAM HMM software. Results using SATCHMO to identify protein domains are demonstrated on potassium channels, with implications for the mechanism by which tumor necrosis factor alpha affects potassium current.", "citationCount": 81, "authors": [{"name": "Edgar R.C."}, {"name": "Sjolander K."}], "date": "2003-07-22T00:00:00Z", "journal": "Bioinformatics"}}, {"doi": null, "note": null, "version": null, "pmid": "9783222", "type": null, "pmcid": null, "metadata": {"title": "Phylogenetic inference in protein superfamilies: analysis of SH2 domains.", "abstract": "This work focuses on the inference of evolutionary relationships in protein superfamilies, and the uses of these relationships to identify key positions in the structure, to infer attributes on the basis of evolutionary distance, and to identify potential errors in sequence annotations. Relative entropy, a distance metric from information theory, is used in combination with Dirichlet mixture priors to estimate a phylogenetic tree for a set of proteins. This method infers key structural or functional positions in the molecule, and guides the tree topology to preserve these important positions within subtrees. Minimum-description-length principles are used to determine a cut of the tree into subtrees, to identify the subfamilies in the data. This method is demonstrated on SH2-domain containing proteins, resulting in a new subfamily assignment for Src2-drome and a suggested evolutionary relationship between Nck_human and Drk_drome, Sem5_caeel, Grb2_human and Grb2_chick.", "citationCount": 59, "authors": [{"name": "Sjolander K."}], "date": "1998-01-01T00:00:00Z", "journal": "Proceedings / ... International Conference on Intelligent Systems for Molecular Biology ; ISMB. International Conference on Intelligent Systems for Molecular Biology"}}, {"doi": null, "note": null, "version": null, "pmid": "15034147", "type": null, "pmcid": null, "metadata": {"title": "MUSCLE: Multiple sequence alignment with high accuracy and high throughput", "abstract": "We describe MUSCLE, a new computer program for creating multiple alignments of protein sequences. Elements of the algorithm include fast distance estimation using kmer counting, progressive alignment using a new profile function we call the log-expectation score, and refinement using tree-dependent restricted partitioning. The speed and accuracy of MUSCLE are compared with T-Coffee, MAFFT and CLUSTALW on four test sets of reference alignments: BAliBASE, SABmark, SMART and a new benchmark, PREFAB. MUSCLE achieves the highest, or joint highest, rank in accuracy on each of these sets. Without refinement, MUSCLE achieves average accuracy statistically indistinguishable from T-Coffee and MAFFT, and is the fastest of the tested methods for large numbers of sequences, aligning 5000 sequences of average length 350 in 7 min on a current desktop computer. The MUSCLE program, source code and PREFAB test data are freely available at http://www.drive5.com/muscle. © Oxford University Press 20004; all rights reserved.", "citationCount": 18379, "authors": [{"name": "Edgar R.C."}], "date": "2004-07-09T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "17488835", "type": null, "pmcid": null, "metadata": {"title": "Berkeley phylogenomics group web servers: Resources for structural phylogenomic analysis", "abstract": "Phylogenomic analysis addresses the limitations of function prediction based on annotation transfer, and has been shown to enable the highest accuracy in prediction of protein molecular function. The Berkeley Phylogenomics Group provides a series of web servers for phylogenomic analysis: classification of sequences to pre-computed families and subfamilies using the PhyloFacts Phylogenomic Encyclopedia, FlowerPower clustering of proteins sharing the same domain architecture, MUSCLE multiple sequence alignment, SATCHMO simultaneous alignment and tree construction and SCI-PHY subfamily identification. The PhyloBuilder web server provides an integrated phylogenomic pipeline starting with a user-supplied protein sequence, proceeding to homolog identification, multiple alignment, phylogenetic tree construction, subfamily identification and structure prediction. The Berkeley Phylogenomics Group resources are available at http://phylogenomics.berkeley.edu. © 2007 The Author(s).", "citationCount": 19, "authors": [{"name": "Glanville J.G."}, {"name": "Kirshner D."}, {"name": "Krishnamurthy N."}, {"name": "Sjolander K."}], "date": "2007-07-01T00:00:00Z", "journal": "Nucleic Acids Research"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Kimmen Sjölander", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "kimmen@berkeley.edu"}], "biotoolsCURIE": "biotools:berkeley_phylogenomics_group", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://phylogenomics.berkeley.edu/", "function": [{"note": null, "input": [], "operation": [{"term": "Tree-based sequence alignment", "uri": "http://edamontology.org/operation_0499"}, {"term": "Multiple sequence alignment", "uri": "http://edamontology.org/operation_0492"}, {"term": "Sequence alignment", "uri": "http://edamontology.org/operation_0292"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:56Z", "otherID": [], "description": "The Berkeley Phylogenomics Group provides a series of web servers for phylogenomic analysis: classification of sequences to pre-computed families and subfamilies using the PhyloFacts Phylogenomic Encyclopedia, FlowerPower clustering of proteins sharing the same domain architecture, MUSCLE multiple sequence alignment, SATCHMO simultaneous alignment and tree construction, and SCI-PHY subfamily identification.", "toolType": ["Web application"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "berkeley_phylogenomics_group", "additionDate": "2017-03-25T22:23:02Z", "name": "Berkeley Phylogenomics Group", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}