{
    "accessibility": "Open access",
    "additionDate": "2017-03-24T11:31:31Z",
    "biotoolsCURIE": "biotools:ebi_tools",
    "biotoolsID": "ebi_tools",
    "collectionID": [
        "BioExcel",
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "www-prod@ebi.ac.uk",
            "name": "EMBL - European Bioinformatics Institute",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "EBI Tools is a project that aims to provide programmatic access to the various databases and retrieval and analysis services that the European Bioinformatics Institute (EBI) provides through Simple Object Access Protocol (SOAP) and other related web service technologies. Example tools include those to compute sequence similarity searches, pairwise/multiple sequence alignment and protein functional analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ebi.ac.uk/seqdb/confluence/display/JDSAT/Job+Dispatcher+Sequence+Analysis+Tools+Home#JobDispatcherSequenceAnalysisToolsHome-Usage"
        }
    ],
    "editPermission": {
        "authors": [
            "biomadeira"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                },
                {
                    "term": "Protein function analysis",
                    "uri": "http://edamontology.org/operation_2414"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Sequence similarity search",
                    "uri": "http://edamontology.org/operation_0346"
                }
            ]
        }
    ],
    "homepage": "http://www.ebi.ac.uk/Tools/webservices/",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "maturity": "Mature",
    "name": "EBI Tools",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkh405",
            "metadata": {
                "abstract": "The mission of the European Bioinformatics Institute (EBI), an outstation of the European Molecular Biology Laboratory (EMBL) in Heidelberg, is to ensure that the growing body of information from molecular biology and genome research is placed in the public domain and is accessible freely to all parts of the scientific community in ways that promote scientific progress. To fulfil this mission, the EBI provides a wide variety of free, publicly available bioinformatics services. These can be divided into data submissions processing; access to query, analysis and retrieval systems and tools; ftp downloads of software and databases; training and education and user support. All of these services are available at the EBI website: http://www.ebi.ac.uk/services. This paper provides a detailed introduction to the interactive analysis systems that are available from the EBI and a brief introduction to other, related services. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Fustero X."
                    },
                    {
                        "name": "Harte N."
                    },
                    {
                        "name": "Jokinen P."
                    },
                    {
                        "name": "Kallio K."
                    },
                    {
                        "name": "Lopez R."
                    },
                    {
                        "name": "Patel P."
                    },
                    {
                        "name": "Quevillon E."
                    },
                    {
                        "name": "Robinson S."
                    },
                    {
                        "name": "Silventoinen V."
                    }
                ],
                "citationCount": 18,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Public web-based services from the European Bioinformatics Institute"
            },
            "pmcid": "PMC441543",
            "pmid": "15215339",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gki491",
            "metadata": {
                "abstract": "SOAP (Simple Object Access Protocol) (http://www.w3.org/TR/soap) based Web Services technology (http://www.w3.org/ws) has gained much attention as an open standard enabling interoperability among applications across heterogeneous architectures and different networks. The European Bioinformatics Institute (EBI) is using this technology to provide robust data retrieval and data analysis mechanisms to the scientific community and to enhance utilization of the biological resources it already provides [N. Harte, V. Silventoinen, E. Quevillon, S. Robinson, K. Kallio, X. Fustero, P. Patel, P. Jokinen and R. Lopez (2004) Nucleic Acids Res, 32, 3-9]. These services are available free to all users from http://www.ebi.ac.uk/Tools/webservices.© 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Golovin A."
                    },
                    {
                        "name": "Henrick K."
                    },
                    {
                        "name": "Kallio K."
                    },
                    {
                        "name": "Lopez R."
                    },
                    {
                        "name": "Pillai S."
                    },
                    {
                        "name": "Rice P."
                    },
                    {
                        "name": "Senger M."
                    },
                    {
                        "name": "Silventoinen V."
                    },
                    {
                        "name": "Sobhany S."
                    },
                    {
                        "name": "Stoehr P."
                    },
                    {
                        "name": "Tate J."
                    },
                    {
                        "name": "Velankar S."
                    }
                ],
                "citationCount": 45,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "SOAP-based services provided by the European Bioinformatics Institute"
            },
            "pmcid": "PMC1160251",
            "pmid": "15980463",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkm291",
            "metadata": {
                "abstract": "We present a new version of the European Bioinformatics Institute Web Services, a complete suite of SOAP-based web tools for structural and functional analysis, with new and improved applications. New functionality has been added to most of the services already available, and an improved version of the underlying framework has allowed us to include more applications. Information on the EBI Web Services, tutorials and clients can be found at http://www.ebi.ac.uk/Tools/webservices. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Anderson M."
                    },
                    {
                        "name": "Labarga A."
                    },
                    {
                        "name": "Lopez R."
                    },
                    {
                        "name": "Valentin F."
                    }
                ],
                "citationCount": 149,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Web services at the European Bioinformatics Institute"
            },
            "pmcid": "PMC1933145",
            "pmid": "17576686",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkp302",
            "metadata": {
                "abstract": "The European Bioinformatics Institute (EMBL-EBI) has been providing access to mainstream databases and tools in bioinformatics since 1997. In addition to the traditional web form based interfaces, APIs exist for core data resources such as EMBL-Bank, Ensembl, UniProt, InterPro, PDB and ArrayExpress. These APIs are based on Web Services (SOAP/REST) interfaces that allow users to systematically access databases and analytical tools. From the user's point of view, these Web Services provide the same functionality as the browser-based forms. However, using the APIs frees the user from web page constraints and are ideal for the analysis of large batches of data, performing text-mining tasks and the casual or systematic evaluation of mathematical models in regulatory networks. Furthermore, these services are widespread and easy to use; require no prior knowledge of the technology and no more than basic experience in programming. In the following we wish to inform of new and updated services as well as briefly describe planned developments to be made available during the course of 2009-2010.",
                "authors": [
                    {
                        "name": "Goujon M."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Lopez R."
                    },
                    {
                        "name": "Martin J."
                    },
                    {
                        "name": "Mcwilliam H."
                    },
                    {
                        "name": "Miyar T."
                    },
                    {
                        "name": "Narayanasamy M."
                    },
                    {
                        "name": "Valentin F."
                    }
                ],
                "citationCount": 61,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Web services at the European Bioinformatics Institute-2009"
            },
            "pmcid": "PMC2703973",
            "pmid": "19435877",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkt376",
            "metadata": {
                "abstract": "Since 2004 the European Bioinformatics Institute (EMBL-EBI) has provided access to a wide range of databases and analysis tools via Web Services interfaces. This comprises services to search across the databases available from the EMBL-EBI and to explore the network of cross-references present in the data (e.g. EB-eye), services to retrieve entry data in various data formats and to access the data in specific fields (e.g. dbfetch), and analysis tool services, for example, sequence similarity search (e.g. FASTA and NCBI BLAST), multiple sequence alignment (e.g. Clustal Omega and MUSCLE), pairwise sequence alignment and protein functional analysis (e.g. InterProScan and Phobius). The REST/SOAP Web Services (http://www.ebi.ac.uk/Tools/webservices/) interfaces to these databases and tools allow their integration into other tools, applications, web sites, pipeline processes and analytical workflows. To get users started using the Web Services, sample clients are provided covering a range of programming languages and popular Web Service tool kits, and a brief guide to Web Services technologies, including a set of tutorials, is available for those wishing to learn more and develop their own clients. Users of the Web Services are informed of improvements and updates via a range of methods.",
                "authors": [
                    {
                        "name": "Buso N."
                    },
                    {
                        "name": "Cowley A.P."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Lopez R."
                    },
                    {
                        "name": "McWilliam H."
                    },
                    {
                        "name": "Park Y.M."
                    },
                    {
                        "name": "Squizzato S."
                    },
                    {
                        "name": "Uludag M."
                    }
                ],
                "citationCount": 1072,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "Analysis Tool Web Services from the EMBL-EBI."
            },
            "pmcid": "PMC3692137",
            "pmid": "23671338",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/nar/gkv1352",
            "metadata": {
                "abstract": "© The Author(s) 2015.New technologies are revolutionising biological research and its applications by making it easier and cheaper to generate ever-greater volumes and types of data. In response, the services and infrastructure of the European Bioinformatics Institute (EMBL-EBI, www.ebi.ac.UK) are continually expanding: total disk capacity increases significantly every year to keep pace with demand (75 petabytes as of December 2015), and interoperability between resources remains a strategic priority. Since 2014 we have launched two new resources: the European Variation Archive for genetic variation data and EMPIAR for two-dimensional electron microscopy data, as well as a Resource Description Framework platform. We also launched the Embassy Cloud service, which allows users to run large analyses in a virtual environment next to EMBL-EBI's vast public data resources.",
                "authors": [
                    {
                        "name": "Apweiler R."
                    },
                    {
                        "name": "Bergman M.T."
                    },
                    {
                        "name": "Birney E."
                    },
                    {
                        "name": "Cochrane G."
                    },
                    {
                        "name": "Cook C.E."
                    },
                    {
                        "name": "Finn R.D."
                    }
                ],
                "citationCount": 78,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The European Bioinformatics Institute in 2016: Data growth and integration"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web API",
        "Web application",
        "Web service"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Function analysis",
            "uri": "http://edamontology.org/topic_1775"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
