{
    "additionDate": "2020-01-09T17:51:30Z",
    "biotoolsCURIE": "biotools:SynQuant",
    "biotoolsID": "SynQuant",
    "confidence_flag": "tool",
    "description": "An Automatic Tool to Quantify Synapses from Microscopy Images.\n\nA Fiji plugin that automatically quantify synapses from multi-channel fluorescence microscopy images.\n\nSynQuant is a Fiji plugin that automatically quantify synapses from fluorescence microscopy images. Try SynQuant Now!.\n\nSynQuant performs better than peer unsupervised methods [5-8] for all the three data sets we tested (3D in-vivo [2], array tomography [3], neuron-astrocyte coculture [4])",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yu-lab-vt/SynQuant",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-27T13:21:59Z",
    "license": "GPL-3.0",
    "name": "SynQuant",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ760",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Synapses are essential to neural signal transmission. Therefore, quantification of synapses and related neurites from images is vital to gain insights into the underlying pathways of brain functionality and diseases. Despite the wide availability of synaptic punctum imaging data, several issues are impeding satisfactory quantification of these structures by current tools. First, the antibodies used for labeling synapses are not perfectly specific to synapses. These antibodies may exist in neurites or other cell compartments. Second, the brightness of different neurites and synaptic puncta is heterogeneous due to the variation of antibody concentration and synapse-intrinsic differences. Third, images often have low signal to noise ratio due to constraints of experiment facilities and availability of sensitive antibodies. These issues make the detection of synapses challenging and necessitates developing a new tool to easily and accurately quantify synapses. Results: We present an automatic probability-principled synapse detection algorithm and integrate it into our synapse quantification tool SynQuant. Derived from the theory of order statistics, our method controls the false discovery rate and improves the power of detecting synapses. SynQuant is unsupervised, works for both 2D and 3D data, and can handle multiple staining channels. Through extensive experiments on one synthetic and three real datasets with ground truth annotation or manually labeling, SynQuant was demonstrated to outperform peer specialized unsupervised synapse detection tools as well as generic spot detection methods. Availability and implementation: Java source code, Fiji plug-in, and test data are available at https://github.com/yulab- vt/SynQuant.",
                "authors": [
                    {
                        "name": "Broussard G.J."
                    },
                    {
                        "name": "Lyu B."
                    },
                    {
                        "name": "Ranefall P."
                    },
                    {
                        "name": "Shi G."
                    },
                    {
                        "name": "Tian L."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wu C.-T."
                    },
                    {
                        "name": "Yu G."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SynQuant: An automatic tool to quantify synapses from microscopy images"
            },
            "pmid": "31596456"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ],
    "validated": 1
}
