{"collectionID": [], "accessibility": [], "topic": [{"term": "Mapping", "uri": "http://edamontology.org/topic_0102"}, {"term": "Gene transcripts", "uri": "http://edamontology.org/topic_3512"}, {"term": "Plant biology", "uri": "http://edamontology.org/topic_0780"}, {"term": "Model organisms", "uri": "http://edamontology.org/topic_0621"}, {"term": "Molecular interactions, pathways and networks", "uri": "http://edamontology.org/topic_0602"}], "owner": "ELIXIR-EE", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": null, "note": null, "version": null, "pmid": "15608283", "type": null, "pmcid": null, "metadata": {"title": "The Legume Information System (LIS): An integrated information resource for comparative legume biology", "abstract": "The Legume Information System (LIS) (http://www.comparative-legumes.org), developed by the National Center for Genome Resources in cooperation with the USDA Agricultural Research Service (ARS), is a comparative legume resource that integrates genetic and molecular data from multiple legume species enabling cross-species genomic and transcript comparisons. The LIS virtual plant interface allows simplified and intuitive navigation of transcript data from Medicago truncatula, Lotus japonicus, Glycine max and Arabidopsis thaliana. Transcript libraries are represented as images of plant organs in different developmental stages, which are selected to query the analyzed and annotated data. Complex queries can be accomplished by adding modifiers, keywords and sequence names. The LIS also contains annotated genomic data featuring transcript alignments to validate gene predictions as well as motif and similarity analyses. The genomic browser supports comparative analysis via novel dynamic functional annotation comparisons. CMap, developed as part of the GMOD project (http://www.gmod.org/cmap/index.shtml), has been incorporated to support comparative analyses of community linkage and physical map data. LIS is being expanded to incorporate gene expression and biochemical pathways which will be seamlessly integrated forming a knowledge discovery framework. © Oxford University Press 2005; all rights reserved.", "citationCount": 79, "authors": [{"name": "Gonzales M.D."}, {"name": "Archuleta E."}, {"name": "Farmer A."}, {"name": "Gajendran K."}, {"name": "Grant D."}, {"name": "Shoemaker R."}, {"name": "Beavis W.D."}, {"name": "Waugh M.E."}], "date": "2005-01-01T00:00:00Z", "journal": "Nucleic Acids Research"}}, {"doi": null, "note": null, "version": null, "pmid": "18287696", "type": null, "pmcid": null, "metadata": {"title": "Leveraging model legume information to find candidate genes for soybean sudden death syndrome using the legume information system", "abstract": "Comparative genomics is an emerging and powerful approach to achieve crop improvement. Using comparative genomics, information from model plant species can accelerate the discovery of genes responsible for disease and pest resistance, tolerance to plant stresses such as drought, and enhanced nutritional value including production of anti-oxidants and anti-cancer compounds. We demonstrate here how to use the Legume Information System for a comparative genomics study, leveraging genomic information from Medicago truncatula (barrel medic), the model legume, to find candidate genes involved with sudden death syndrome (SDS) in Glycine max (soybean). Specifically, genetic maps, physical maps, and annotated tentative consensus and expressed sequence tag (EST) sequences from G. max and M. truncatula can be compared. In addition, the recently published M. truncatula genomic sequences can be used to identify M. truncatula candidate genes in a genomic region syntenic to a quantitative trait loci region for SDS in soybean. Genomic sequences of candidate genes from M. truncatula can then be used to identify ESTs with sequence similarities from soybean for primer design and cloning of potential soybean disease causing alleles. © Humana Press Inc.", "citationCount": 5, "authors": [{"name": "Gonzales M.D."}, {"name": "Gajendran K."}, {"name": "Farmer A.D."}, {"name": "Archuleta E."}, {"name": "Beavis W.D."}], "date": "2007-11-01T00:00:00Z", "journal": "Methods in Molecular Biology"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Contact form", "url": "https://legumeinfo.org/contact", "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": null}], "biotoolsCURIE": "biotools:lis", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://comparative-legumes.org/", "function": [{"note": null, "input": [], "operation": [{"term": "Physical mapping", "uri": "http://edamontology.org/operation_2944"}, {"term": "Genetic mapping", "uri": "http://edamontology.org/operation_0282"}, {"term": "Sequence tag mapping", "uri": "http://edamontology.org/operation_0527"}, {"term": "Gene expression QTL analysis", "uri": "http://edamontology.org/operation_3232"}, {"term": "Mapping", "uri": "http://edamontology.org/operation_2429"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:43Z", "otherID": [], "description": "The Legume Information System enables productive applied and basic research in the legumes by relating data from multiple crop and model species, and by helping researchers traverse among various data types.", "toolType": ["Database portal"], "editPermission": {"type": "private", "authors": []}, "language": [], "link": [], "biotoolsID": "lis", "additionDate": "2017-03-30T22:04:57Z", "name": "Legume Information System (LIS)", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": []}