{
    "accessibility": "Open access",
    "additionDate": "2021-11-19T20:35:46.738595Z",
    "biotoolsCURIE": "biotools:brcaseg",
    "biotoolsID": "brcaseg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kunhuang@iu.edu",
            "name": "Kun Huang"
        }
    ],
    "description": "A Deep Learning Approach for Tissue Quantification and Genomic Correlations of Histopathological Images.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Serian1992/ImgBio",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:16:22.129959Z",
    "name": "BrcaSeg",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.gpb.2020.06.026",
            "metadata": {
                "abstract": "Epithelial and stromal tissues are components of the tumor microenvironment and play a major role in tumor initiation and progression. Distinguishing stroma from epithelial tissues is critically important for spatial characterization of the tumor microenvironment. Here, we propose BrcaSeg, an image analysis pipeline based on a convolutional neural network (CNN) model to classify epithelial and stromal regions in whole-slide hematoxylin and eosin (H&E) stained histopathological images. The CNN model is trained using well-annotated breast cancer tissue microarrays and validated with images from The Cancer Genome Atlas (TCGA) Program. BrcaSeg achieves a classification accuracy of 91.02%, which outperforms other state-of-the-art methods. Using this model, we generate pixel-level epithelial/stromal tissue maps for 1000 TCGA breast cancer slide images that are paired with gene expression data. We subsequently estimate the epithelial and stromal ratios and perform correlation analysis to model the relationship between gene expression and tissue ratios. Gene Ontology (GO) enrichment analyses of genes that are highly correlated with tissue ratios suggest that the same tissue is associated with similar biological processes in different breast cancer subtypes, whereas each subtype also has its own idiosyncratic biological processes governing the development of these tissues. Taken all together, our approach can lead to new insights in exploring relationships between image-based phenotypes and their underlying genomic events and biological processes for all types of solid tumors. BrcaSeg can be accessed at https://github.com/Serian1992/ImgBio.",
                "authors": [
                    {
                        "name": "Cheng J."
                    },
                    {
                        "name": "Feng Q."
                    },
                    {
                        "name": "Han Z."
                    },
                    {
                        "name": "Huang K."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Ni D."
                    },
                    {
                        "name": "Shao W."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Zhan X."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 11,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Genomics, Proteomics and Bioinformatics",
                "title": "BrcaSeg: A Deep Learning Approach for Tissue Quantification and Genomic Correlations of Histopathological Images"
            },
            "pmcid": "PMC9403022",
            "pmid": "34280546"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
