{
    "additionDate": "2020-01-09T18:26:05Z",
    "biotoolsCURIE": "biotools:Artificial_intelligence",
    "biotoolsID": "Artificial_intelligence",
    "confidence_flag": "low",
    "description": "A helpful tool for radiologists?].\n\nArtificial Intelligence and Machine Learning in Software as a Medical Device.\n\nMedical device manufacturers are using these technologies to innovate their products to better assist health care providers and improve patient care.\n\nArtificial intelligence and machine learning technologies have the potential to transform health care by deriving new and important insights from the vast amount of data generated during the delivery of health care every day. Medical device manufacturers are using these technologies to innovate their products to better assist health care providers and improve patient care. The FDA is considering a total product lifecycle-based regulatory framework for these technologies that would allow for modifications to be made from real-world learning and adaptation, while still ensuring that the safety and effectiveness of the software as a medical device is maintained.\n\nAn official website of the United States government.\n\nU S",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.fda.gov/medical-devices/software-medical-device-samd/artificial-intelligence-and-machine-learning-software-medical-device",
    "lastUpdate": "2020-01-09T18:26:05Z",
    "name": "Artificial intelligence",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S00117-019-00599-9",
            "metadata": {
                "abstract": "© 2019, Springer Medizin Verlag GmbH, ein Teil von Springer Nature.Artificial intelligence (AI) is not intelligent in the human meaning—AI works on the basis of algorithms created by humans and the results of AI are based on real-world data. AI is regulated by all legal frameworks that also apply in other scenarios, in particular data protection law and medical device law. AI delivers results that are as good as the database that formed the learning content of the AI enables. If, for example, the data on which the AI is based contain discrimination, this discrimination is “learned” by the AI; since the AI does not really think, the AI cannot reflect its own results either—it can only make a comparison within the parameters of the specifications by the software developers. If AI is used, the question of the algorithms implemented and the database on which the decision is based must therefore be clarified beforehand and a check must be carried out based on this to determine whether the AI is suitable for use. Due to the missing possibility of real human thinking, AI cannot replace physicians, but can assist them in their daily work.",
                "authors": [
                    {
                        "name": "Schutze B."
                    },
                    {
                        "name": "Schlieter H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Radiologe",
                "title": "Artificial intelligence: A helpful tool for radiologists? Künstliche Intelligenz: Ein nützliches Werkzeug für den Radiologen?"
            },
            "pmid": "31578624"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Regulatory affairs",
            "uri": "http://edamontology.org/topic_3394"
        }
    ]
}