{
    "additionDate": "2020-01-14T19:52:37Z",
    "biotoolsCURIE": "biotools:ASA24",
    "biotoolsID": "ASA24",
    "confidence_flag": "tool",
    "description": "Nutrient Estimation from 24-Hour Food Recalls Using Machine Learning and Database Mapping.\n\nNutrient & Food Group Analysis Using ASA24®.\n\nASA24® Sample Analysis Files & Data Dictionaries.\n\nThe Automated Self-Administered 24-Hour (ASA24) Dietary Assessment Tool is a free web-based tool for collection of automatically coded dietary recalls and/or food records.\n\nEpidemiology and Genomics Research Program.\n\nNutrient and food group equivalent data analysis files available for ASA24 studies through the ASA24 Researcher Website using ASA24-2016 and ASA24-2018.\n\nExamples of ASA24 analysis files and data dictionaries describing each output from the ASA24 Researcher Website.\n\nThe ASA24 system generates several analysis output files.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'NCC'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://epi.grants.cancer.gov/asa24/",
    "lastUpdate": "2020-12-09T13:20:27.678053Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://epi.grants.cancer.gov/asa24/researcher/analysis.html"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://epi.grants.cancer.gov/asa24/researcher/sample.html"
        }
    ],
    "name": "ASA24",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/NU11123045",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.The Automated Self-Administered 24-Hour Dietary Assessment Tool (ASA24) is a free dietary recall system that outputs fewer nutrients than the Nutrition Data System for Research (NDSR). NDSR uses the Nutrition Coordinating Center (NCC) Food and Nutrient Database, both of which require a license. Manual lookup of ASA24 foods into NDSR is time-consuming but currently the only way to acquire NCC-exclusive nutrients. Using lactose as an example, we evaluated machine learning and database matching methods to estimate this NCC-exclusive nutrient from ASA24 reports. ASA24-reported foods were manually looked up into NDSR to obtain lactose estimates and split into training (n = 378) and test (n = 189) datasets. Nine machine learning models were developed to predict lactose from the nutrients common between ASA24 and the NCC database. Database matching algorithms were developed to match NCC foods to an ASA24 food using only nutrients (“Nutrient-Only”) or the nutrient and food descriptions (“Nutrient + Text”). For both methods, the lactose values were compared to the manual curation. Among machine learning models, the XGB-Regressor model performed best on held-out test data (R2 = 0.33). For the database matching method, Nutrient + Text matching yielded the best lactose estimates (R2 = 0.76), a vast improvement over the status quo of no estimate. These results suggest that computational methods can successfully estimate an NCC-exclusive nutrient for foods reported in ASA24.",
                "authors": [
                    {
                        "name": "Chin E.L."
                    },
                    {
                        "name": "Simmons G."
                    },
                    {
                        "name": "Bouzid Y.Y."
                    },
                    {
                        "name": "Kan A."
                    },
                    {
                        "name": "Burnett D.J."
                    },
                    {
                        "name": "Tagkopoulos I."
                    },
                    {
                        "name": "Lemay D.G."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Nutrients",
                "title": "Nutrient estimation from 24-hour food recalls using machine learning and database mapping: A case study with lactose"
            },
            "pmid": "31847188"
        }
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Carbohydrates",
            "uri": "http://edamontology.org/topic_0152"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}