
{
    "credit": [
        {
            "email": "brannala@ualberta.ca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.rannala.org/docs/pmle20.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "maturity": "Legacy",
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/pmle-2-0-maximum-likelihood-estimation-migration-rates-wright-island-model.html"
        }
    ],
    "publication": [
        {
            "abstract": "A new method is presented for estimating the rate of gene flow into island populations using the distribution of alleles in samples from a number of islands. The pseudo maximum likelihood estimator (PMLE) that we derive may be applied to species with either discrete or continuous generation times. For Wright's discrete-generation island model, the method provides an estimate of θ = 2Nm where N is the (haploid) population size on each island and m is the fraction of individuals replaced by immigrants in each generation. For a continuous-generation island model, the corresponding parameter θ is the ratio of the immigration rate ∅ to the individual birth rate λ. Monte Carlo simulations are used to compare the statistical properties of the PMLE with those of two alternative estimators of θ derived from Wright's F-statistics. The PMLE is shown to have greatest efficiency (least mean square error) in most cases for a wide range of sample sizes and parameter values. The PMLE is applied to estimate θ using mtDNA haplotypes and allozymes for subdivided populations of African elephants and Channel Island foxes.",
            "authors": [
                "Rannala B.",
                "Hartigan J.A."
            ],
            "cit_count": 54,
            "journal": "Genetical Research",
            "pmid": "8801187",
            "title": "Estimating gene flow in island populations",
            "year": "1996-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pmle",
        "biotoolsID": "pmle",
        "description": "Estimate the gene flow parameter q for a collection of two or more semi-isolated populations by (pseudo) maximum likelihood using either single or multi locus, haploid or diploid, genotype data. Suitable molecular data types minimally include allozymes, microsatellites, and RFLPs.",
        "homepage": "http://www.rannala.org/docs/pmle20.html",
        "name": "PMLE"
    }
}