{
    "additionDate": "2017-01-13T13:14:34Z",
    "biotoolsCURIE": "biotools:figaro",
    "biotoolsID": "figaro",
    "credit": [
        {
            "email": "Yorke@UMD.EDU",
            "name": "James A. Yorke",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://yorke.umd.edu/"
        },
        {
            "email": "mpop@umiacs.umd.edu",
            "name": "Mihai Pop",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.cbcb.umd.edu/~mpop/"
        }
    ],
    "description": "Figaro is a software tool for identifying and removing the vector from raw DNA sequence data without prior knowledge of the vector sequence.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://amos.sourceforge.net/wiki/index.php?title=Figaro"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "http://amos.sourceforge.net/wiki/index.php?title=Figaro",
    "language": [
        "C++",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "Artistic-2.0",
    "name": "Figaro",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Sequences produced by automated Sanger sequencing machines frequently contain fragments of the cloning vector on their ends. Software tools currently available for identifying and removing the vector sequence require knowledge of the vector sequence, specific splice sites and any adapter sequences used in the experiment - information often omitted from public databases. Furthermore, the clipping coordinates themselves are missing or incorrectly reported. As an example, within the ∼1.24 billion shotgun sequences deposited in the NCBI Trace Archive, as many as ∼735 million (∼60%) lack vector clipping information. Correct clipping information is essential to scientists attempting to validate, improve and even finish the increasingly large number of genomes released at a 'draft' quality level. Results: We present here Figaro, a novel software tool for identifying and removing the vector from raw sequence data without prior knowledge of the vector sequence. The vector sequence is automatically inferred by analyzing the frequency of occurrence of short oligo-nucleotides using Poisson statistics. We show that Figaro achieves 99.98% sensitivity when tested on ∼1.5 million shotgun reads from Drosophila pseudoobscura. We further explore the impact of accurate vector trimming on the quality of whole-genome assemblies by re-assembling two bacterial genomes from shotgun sequences deposited in the Trace Archive. Designed as a module in large computational pipelines, Figaro is fast, lightweight and flexible. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Pop M."
                    },
                    {
                        "name": "Roberts M."
                    },
                    {
                        "name": "White J.R."
                    },
                    {
                        "name": "Yorke J.A."
                    }
                ],
                "citationCount": 28,
                "date": "2008-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Figaro: A novel statistical method for vector sequence removal"
            },
            "pmid": "18202027"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
