{
    "additionDate": "2015-12-06T15:18:09Z",
    "biotoolsCURIE": "biotools:bioclipse",
    "biotoolsID": "bioclipse",
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://wiki.bioclipse.net/index.php?title=Main_Page"
        }
    ],
    "description": "Free and open source workbench for the life sciences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioclipse.net/documentation"
        }
    ],
    "editPermission": {
        "authors": [
            "saml"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Molecular property",
                        "uri": "http://edamontology.org/data_2087"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Molecular property",
                        "uri": "http://edamontology.org/data_2087"
                    }
                }
            ]
        }
    ],
    "homepage": "http://bioclipse.net/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "Bioclipse",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mikael.borg@bils.se",
    "publication": [
        {
            "doi": "10.1186/1471-2105-10-397",
            "metadata": {
                "abstract": "Background: Contemporary biological research integrates neighboring scientific domains to answer complex questions in fields such as systems biology and drug discovery. This calls for tools that are intuitive to use, yet flexible to adapt to new tasks. Results: Bioclipse is a free, open source workbench with advanced features for the life sciences. Version 2.0 constitutes a complete rewrite of Bioclipse, and delivers a stable, scalable integration platform for developers and an intuitive workbench for end users. All functionality is available both from the graphical user interface and from a built-in novel domain-specific language, supporting the scientist in interdisciplinary research and reproducible analyses through advanced visualization of the inputs and the results. New components for Bioclipse 2 include a rewritten editor for chemical structures, a table for multiple molecules that supports gigabyte-sized files, as well as a graphical editor for sequences and alignments. Conclusion: Bioclipse 2 is equipped with advanced tools required to carry out complex analysis in the fields of bio- and cheminformatics. Developed as a Rich Client based on Eclipse, Bioclipse 2 leverages on today's powerful desktop computers for providing a responsive user interface, but also takes full advantage of the Web and networked (Web/Cloud) services for more demanding calculations or retrieval of data. The fact that Bioclipse 2 is based on an advanced and widely used service platform ensures wide extensibility, making it easy to add new algorithms, visualizations, as well as scripting commands. The intuitive tools for end users and the extensible architecture make Bioclipse 2 ideal for interdisciplinary and integrative research. Bioclipse 2 is released under the Eclipse Public License (EPL), a flexible open source license that allows additional plugins to be of any license. Bioclipse 2 is implemented in Java and supported on all major platforms; Source code and binaries are freely available at http://www.bioclipse.net. © 2009 Spjuth et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Spjuth O."
                    },
                    {
                        "name": "Alvarsson J."
                    },
                    {
                        "name": "Berg A."
                    },
                    {
                        "name": "Eklund M."
                    },
                    {
                        "name": "Kuhn S."
                    },
                    {
                        "name": "Masak C."
                    },
                    {
                        "name": "Torrance G."
                    },
                    {
                        "name": "Wagener J."
                    },
                    {
                        "name": "Willighagen E.L."
                    },
                    {
                        "name": "Steinbeck C."
                    },
                    {
                        "name": "Wikberg J.E.S."
                    }
                ],
                "citationCount": 47,
                "date": "2009-12-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Bioclipse 2: A scriptable integration platform for the life sciences"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}