{
    "additionDate": "2017-08-03T19:08:13Z",
    "biotoolsCURIE": "biotools:slda",
    "biotoolsID": "slda",
    "credit": [
        {
            "email": "mcwu@fhcrc.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://research.fhcrc.org/wu/en.html"
        }
    ],
    "description": "Software for testing the significance of Gene Pathways when signal is relatively weak. Also included is general code for running two-group L1 penalized linear discriminant analysis.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://research.fhcrc.org/wu/en/software.html#sLDA"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://research.fhcrc.org/wu/en/software.html#sLDA",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/slda-sparse-linear-discriminant-analysis.html"
        }
    ],
    "name": "sLDA",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Pathway and gene set-based approaches for the analysis of gene expression profiling experiments have become increasingly popular for addressing problems associated with individual gene analysis. Since most genes are not differently expressed, existing gene set tests, which consider all the genes within a gene set, are subject to considerable noise and power loss, a concern exacerbated in studies in which the degree of differential expression is moderate for truly differentially expressed genes. For a significantly differentially expressed pathway, it is also of substantial interest to select important genes that drive the differential expression of the pathway. Methods: We develop a unified framework to jointly test the significance of a pathway and to select a subset of genes that drive the significant pathway effect. To achieve dimension reduction and gene selection, we decompose each gene pathway into a single score by using a regularized form of linear discriminant analysis, called sparse linear discriminant analysis (sLDA). Testing for the significance of the pathway effect proceeds via permutation of the sLDA score. The sLDA-based test is compared with competing approaches with simulations and two applications: a study on the effect of metal fume exposure on immune response and a study of gene expression profiles among Type II Diabetes patients. Results: Our results show that sLDA-based testing provides a powerful approach to test for the significance of a differentially expressed pathway and gene selection. © The Author 2009. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Wu M.C."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Christiani D.C."
                    },
                    {
                        "name": "Lin X."
                    }
                ],
                "citationCount": 77,
                "date": "2009-05-07T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Sparse linear discriminant analysis for simultaneous testing for the significance of a gene set/pathway and gene selection"
            },
            "pmid": "19168911"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}