{
    "additionDate": "2020-01-14T08:52:48Z",
    "biotoolsCURIE": "biotools:N-GlyDE",
    "biotoolsID": "N-GlyDE",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "ctchen@iis.sinica.edu.tw",
            "name": "Ching-Tai Chen",
            "typeEntity": "Person"
        },
        {
            "email": "tsung@iis.sinica.edu.tw",
            "name": "Ting-Yi Sung",
            "typeEntity": "Person"
        }
    ],
    "description": "a two-stage N-linked glycosylation site prediction incorporating gapped dipeptides and pattern-based encoding.\n\nSequence (in FASTA format, the length of each protein must be larger than 30).\n\nE-mail address : (optional: results could be returned via e-mail.)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "http://bioapp.iis.sinica.edu.tw/N-GlyDE/",
    "lastUpdate": "2020-01-14T08:52:48Z",
    "name": "N-GlyDE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-52341-Z",
            "metadata": {
                "abstract": "© 2019, The Author(s).N-linked glycosylation is one of the predominant post-translational modifications involved in a number of biological functions. Since experimental characterization of glycosites is challenging, glycosite prediction is crucial. Several predictors have been made available and report high performance. Most of them evaluate their performance at every asparagine in protein sequences, not confined to asparagine in the N-X-S/T sequon. In this paper, we present N-GlyDE, a two-stage prediction tool trained on rigorously-constructed non-redundant datasets to predict N-linked glycosites in the human proteome. The first stage uses a protein similarity voting algorithm trained on both glycoproteins and non-glycoproteins to predict a score for a protein to improve glycosite prediction. The second stage uses a support vector machine to predict N-linked glycosites by utilizing features of gapped dipeptides, pattern-based predicted surface accessibility, and predicted secondary structure. N-GlyDE’s final predictions are derived from a weight adjustment of the second-stage prediction results based on the first-stage prediction score. Evaluated on N-X-S/T sequons of an independent dataset comprised of 53 glycoproteins and 33 non-glycoproteins, N-GlyDE achieves an accuracy and MCC of 0.740 and 0.499, respectively, outperforming the compared tools. The N-GlyDE web server is available at http://bioapp.iis.sinica.edu.tw/N-GlyDE/.",
                "authors": [
                    {
                        "name": "Pitti T."
                    },
                    {
                        "name": "Chen C.-T."
                    },
                    {
                        "name": "Lin H.-N."
                    },
                    {
                        "name": "Choong W.-K."
                    },
                    {
                        "name": "Hsu W.-L."
                    },
                    {
                        "name": "Sung T.-Y."
                    }
                ],
                "citationCount": 3,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "N-GlyDE: a two-stage N-linked glycosylation site prediction incorporating gapped dipeptides and pattern-based encoding"
            },
            "pmcid": "PMC6828726",
            "pmid": "31685900"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}