{
    "additionDate": "2020-01-14T09:11:07Z",
    "biotoolsCURIE": "biotools:AppleMDO",
    "biotoolsID": "AppleMDO",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhensu@cau.edu.cn",
            "name": "Zhen Su",
            "typeEntity": "Person"
        }
    ],
    "description": "A Multi-Dimensional Omics Database for Apple Co-Expression Networks and Chromatin States.\n\nAppleMDO is a multi-dimensional omics database. Users can submit locus IDs to quickly search for co-expression networks, functional modules, chromatin states and enriched epigenetic marks. For gene lists in search results, gene expression profiling analysis and functional enrichment analysis tools are provided to systematically extract biological themes from gene lists. Additionally, the basic structural and functional annotations of each gene can be obtained, such as gene families, KEGG annotations, GO terms, orthologues in thirteen species and Pfam domains. In addition, some functional support toolkits are also provided, such as GO analysis, blast, motif analysis, ID conversion, sequence extraction and the UCSC genome browser. We hope that AppleMDO will benefit apple research communities and serve as a reference for other fruit trees",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "http://bioinformatics.cau.edu.cn/AppleMDO/",
    "lastUpdate": "2020-12-09T13:05:03Z",
    "name": "AppleMDO",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FPLS.2019.01333",
            "metadata": {
                "abstract": "© Copyright © 2019 Da, Liu, Yang, Tian, She, Ma, Xu and Su.As an economically important crop, apple is one of the most cultivated fruit trees in temperate regions worldwide. Recently, a large number of high-quality transcriptomic and epigenomic datasets for apple were made available to the public, which could be helpful in inferring gene regulatory relationships and thus predicting gene function at the genome level. Through integration of the available apple genomic, transcriptomic, and epigenomic datasets, we constructed co-expression networks, identified functional modules, and predicted chromatin states. A total of 112 RNA-seq datasets were integrated to construct a global network and a conditional network (tissue-preferential network). Furthermore, a total of 1,076 functional modules with closely related gene sets were identified to assess the modularity of biological networks and further subjected to functional enrichment analysis. The results showed that the function of many modules was related to development, secondary metabolism, hormone response, and transcriptional regulation. Transcriptional regulation is closely related to epigenetic marks on chromatin. A total of 20 epigenomic datasets, which included ChIP-seq, DNase-seq, and DNA methylation analysis datasets, were integrated and used to classify chromatin states. Based on the ChromHMM algorithm, the genome was divided into 620,122 fragments, which were classified into 24 states according to the combination of epigenetic marks and enriched-feature regions. Finally, through the collaborative analysis of different omics datasets, the online database AppleMDO (http://bioinformatics.cau.edu.cn/AppleMDO/) was established for cross-referencing and the exploration of possible novel functions of apple genes. In addition, gene annotation information and functional support toolkits were also provided. Our database might be convenient for researchers to develop insights into the function of genes related to important agronomic traits and might serve as a reference for other fruit trees.",
                "authors": [
                    {
                        "name": "Da L."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Ma X."
                    },
                    {
                        "name": "She J."
                    },
                    {
                        "name": "Su Z."
                    },
                    {
                        "name": "Tian T."
                    },
                    {
                        "name": "Xu W."
                    },
                    {
                        "name": "Yang J."
                    }
                ],
                "citationCount": 11,
                "date": "2019-10-22T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "AppleMDO: A Multi-Dimensional Omics Database for Apple Co-Expression Networks and Chromatin States"
            },
            "pmcid": "PMC6817610",
            "pmid": "31695717"
        }
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Epigenomics",
            "uri": "http://edamontology.org/topic_3173"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
