{
    "name": "HHCompare", 
    "description": "Pipeline for HMM-HMM comparison based hierarchial clustering and analysis of potential paralogues in sequence set.", 
    "homepage": "https://github.com/rgacesa/HHCompare", 
    "biotoolsID": "HHCompare", 
    "biotoolsCURIE": "biotools:HHCompare", 
    "version": [], 
    "otherID": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3432", 
                    "term": "Clustering"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0160", 
            "term": "Sequence sites, features and motifs"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_3299", 
            "term": "Evolutionary biology"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/hhcompare-hmm-based-protein-hierarchical-clustering.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/rgacesa/HHCompare/blob/master/README.md", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "26464356", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Gene duplications are extensive and contribute significantly to the toxic proteome of nematocysts isolated from Acropora digitifera (Cnidaria: Anthozoa: Scleractinia)", 
                "abstract": "© 2015 Gacesa et al. Background: Gene duplication followed by adaptive selection is a well-accepted process leading to toxin diversification in venoms. However, emergent genomic, transcriptomic and proteomic evidence now challenges this role to be at best equivocal to other processess . Cnidaria are arguably the most ancient phylum of the extant metazoa that are venomous and such provide a definitive ancestral anchor to examine the evolution of this trait. Methods: Here we compare predicted toxins from the translated genome of the coral Acropora digitifera to putative toxins revealed by proteomic analysis of soluble proteins discharged from nematocysts, to determine the extent to which gene duplications contribute to venom innovation in this reef-building coral species. A new bioinformatics tool called HHCompare was developed to detect potential gene duplications in the genomic data, which is made freely available (https://github.com/rgacesa/HHCompare). Results: A total of 55 potential toxin encoding genes could be predicted from the A. digitifera genome, of which 36 (65 %) had likely arisen by gene duplication as evinced using the HHCompare tool and verified using two standard phylogeny methods. Surprisingly, only 22 % (12/55) of the potential toxin repertoire could be detected following rigorous proteomic analysis, for which only half (6/12) of the toxin proteome could be accounted for as peptides encoded by the gene duplicates. Biological activities of these toxins are dominatedby putative phospholipases and toxic peptidases. Conclusions: Gene expansions in A. digitifera venom are the most extensive yet described in any venomous animal, and gene duplication plays a significant role leading to toxin diversification in this coral species. Since such low numbers of toxins were detected in the proteome, it is unlikely that the venom is evolving rapidly by preydriven positive natural selection. Rather we contend that the venom has a defensive role deterring predation or harm from interspecific competition and overgrowth by fouling organisms. Factors influencing translation of toxin encoding genes perhaps warrants more profound experimental consideration.", 
                "date": "2015-10-13T00:00:00Z", 
                "citationCount": 14, 
                "authors": [
                    {
                        "name": "Gacesa R."
                    }, 
                    {
                        "name": "Chung R."
                    }, 
                    {
                        "name": "Dunn S.R."
                    }, 
                    {
                        "name": "Weston A.J."
                    }, 
                    {
                        "name": "Jaimes-Becerra A."
                    }, 
                    {
                        "name": "Marques A.C."
                    }, 
                    {
                        "name": "Morandini A.C."
                    }, 
                    {
                        "name": "Hranueli D."
                    }, 
                    {
                        "name": "Starcevic A."
                    }, 
                    {
                        "name": "Ward M."
                    }, 
                    {
                        "name": "Long P.F."
                    }
                ], 
                "journal": "BMC Genomics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Ranko Gacesa", 
            "email": null, 
            "url": "https://github.com/rgacesa", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:45:56Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0
}