{
    "additionDate": "2021-01-18T09:38:59Z",
    "biotoolsCURIE": "biotools:netmet",
    "biotoolsID": "netmet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "shiri.freilich@gmail.com",
            "name": "Shiri Freilich",
            "orcidid": "https://orcid.org/0000-0002-5173-9695",
            "typeEntity": "Person"
        }
    ],
    "description": "A Network-Based Tool for Predicting Metabolic Capacities of Microbial Species and their Interactions.\n\nPlease cite Tal, O.; Selvaraj, G.; Medina, S.; Ofaim, S.; Freilich, S. NetMet: A Network-Based Tool for Predicting Metabolic Capacities of Microbial Species and their Interactions. Microorganisms 2020, 8, 840.\n\nGenome files include species-specific enzymatic reaction content in their EC format.\n\nEnvironment files include lists of metabolites in their KEGG accessions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "https://freilich-lab-tools.com/",
    "lastUpdate": "2021-03-08T13:43:01Z",
    "name": "NetMet",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3390/MICROORGANISMS8060840",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Metabolic conversions allow organisms to produce a set of essential metabolites from the available nutrients in an environment, frequently requiring metabolic exchanges among co-inhabiting organisms. Genomic-based metabolic simulations are being increasingly applied for exploring metabolic capacities, considering different environments and different combinations of microorganisms. NetMet is a web-based tool and a software package for predicting the metabolic performances of microorganisms and their corresponding combinations in user-defined environments. The algorithm takes, as input, lists of (i) species-specific enzymatic reactions (EC numbers), and (ii) relevant metabolic environments. The algorithm generates, as output, lists of (i) compounds that individual species can produce in each given environment, and (ii) compounds that are predicted to be produced through complementary interactions. The tool is demonstrated in two case studies. First, we compared the metabolic capacities of different haplotypes of the obligatory fruit and vegetable pathogen Candidatus Liberibacter solanacearum to those of their culturable taxonomic relative Liberibacter crescens. Second, we demonstrated the potential production of complementary metabolites by pairwise combinations of co-occurring endosymbionts of the plant phloem-feeding whitefly Bemisia tabaci. NetMet, a new web-based tool, is available at https://freilich-lab-tools.com/.",
                "authors": [
                    {
                        "name": "Tal O."
                    },
                    {
                        "name": "Selvaraj G."
                    },
                    {
                        "name": "Medina S."
                    },
                    {
                        "name": "Ofaim S."
                    },
                    {
                        "name": "Freilich S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Microorganisms",
                "title": "Netmet: A network-based tool for predicting metabolic capacities of microbial species and their interactions"
            },
            "pmcid": "PMC7356744",
            "pmid": "32503277"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        }
    ]
}