{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.jiscmail.ac.uk/OXSTATGEN"}],"documentation":[{"type":"GENERAL","url":"https://mathgen.stats.ox.ac.uk/impute/impute_v2.html#options"}],"function":[{"operation":[{"term":"Phasing","uri":"http://edamontology.org/operation_3454"},{"term":"Imputation","uri":"http://edamontology.org/operation_3557"}]}],"labels":{"collectionID":["Animal and Crop Genomics"],"language":["Perl"],"license":"GPL-3.0","operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Population genetics","uri":"http://edamontology.org/topic_3056"}]},"publication":[{"abstract":"Genotype imputation is a statistical technique that is often used to increase the power and resolution of genetic association studies. Imputation methods work by using haplotype patterns in a reference panel to predict unobserved genotypes in a study dataset, and a number of approaches have been proposed for choosing subsets of reference haplotypes that will maximize accuracy in a given study population. These panel selection strategies become harder to apply and interpret as sequencing efforts like the 1000 Genomes Project produce larger and more diverse reference sets, which led us to develop an alternative framework. Our approach is built around a new approximation that uses local sequence similarity to choose a custom reference panel for each study haplotype in each region of the genome. This approximation makes it computationally efficient to use all available reference haplotypes, which allows us to bypass the panel selection step and to improve accuracy at low-frequency variants by capturing unexpected allele sharing among populations. Using data from HapMap 3, we show that our framework produces accurate results in a wide range of human populations. We also use data from the Malaria Genetic Epidemiology Network (MalariaGEN) to provide recommendations for imputation-based studies in Africa. We demonstrate that our approximation improves efficiency in large, sequence-based reference panels, and we discuss general computational strategies for modern reference datasets. Genome-wide association studies will soon be able to harness the power of thousands of reference genomes, and our work provides a practical way for investigators to use this rich information. New methodology from this study is implemented in the IMPUTE2 software package. © 2011 Howie et al.","authors":["Howie B.","Marchini J.","Stephens M."],"cit_count":481,"doi":"10.1534/g3.111.001198","journal":"G3: Genes, Genomes, Genetics","title":"Genotype imputation with thousands of genomes","type":"Primary","year":"2011-11-01"},{"abstract":"Genotype imputation methods are now being widely used in the analysis of genome-wide association studies. Most imputation analyses to date have used the HapMap as a reference dataset, but new reference panels (such as controls genotyped on multiple SNP chips and densely typed samples from the 1,000 Genomes Project) will soon allow a broader range of SNPs to be imputed with higher accuracy, thereby increasing power. We describe a genotype imputation method (IMPUTE version 2) that is designed to address the challenges presented by these new datasets. The main innovation of our approach is a flexible modelling framework that increases accuracy and combines information across multiple reference panels while remaining computationally feasible. We find that IMPUTE v2 attains higher accuracy than other methods when the HapMap provides the sole reference panel, but that the size of the panel constrains the improvements that can be made. We also find that imputation accuracy can be greatly enhanced by expanding the reference panel to contain thousands of chromosomes and that IMPUTE v2 outperforms other methods in this setting at both rare and common SNPs, with overall error rates that are 15%-20% lower than those of the closest competing method. One particularly challenging aspect of next-generation association studies is to integrate information across multiple reference panels genotyped on different sets of SNPs; we show that our approach to this problem has practical advantages over other suggested solutions. © 2009 Howie et al.","authors":["Howie B.N.","Donnelly P.","Marchini J."],"cit_count":1891,"doi":"10.1371/journal.pgen.1000529","journal":"PLoS Genetics","title":"A flexible and accurate genotype imputation method for the next generation of genome-wide association studies","type":"Primary","year":"2009-06-01"}],"summary":{"biotoolsCURIE":"biotools:impute2","biotoolsID":"impute2","description":"Genotype imputation and haplotype phasing.","homepage":"https://mathgen.stats.ox.ac.uk/impute/impute_v2.html","name":"IMPUTE2"}}