{
    "additionDate": "2020-01-14T19:49:01Z",
    "biotoolsCURIE": "biotools:themetagenomics",
    "biotoolsID": "themetagenomics",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sw424@drexel.edu",
            "name": "Stephen Woloszynek",
            "orcidid": "https://orcid.org/0000-0003-0568-298X",
            "typeEntity": "Person"
        },
        {
            "email": "glr26@drexel.edu",
            "name": "Gail L. Rosen",
            "typeEntity": "Person"
        }
    ],
    "description": "Exploring thematic structure and predicted functionality of 16S rRNA amplicon data.\n\nthemetagenomics provides functions to explore topics generated from 16S rRNA sequencing information on both the abundance and functional levels. It also provides an R implementation of PICRUSt and wraps Tax4fun, giving users a choice for their functional prediction strategy",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=themetagenomics",
    "language": [
        "R",
        "C++"
    ],
    "lastUpdate": "2020-12-28T12:21:42Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/EESI/themetagenomics"
        }
    ],
    "name": "themetagenomics",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0219235",
            "metadata": {
                "abstract": "© 2019 Woloszynek et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Analysis of microbiome data involves identifying co-occurring groups of taxa associated with sample features of interest (e.g., disease state). Elucidating such relations is often difficult as microbiome data are compositional, sparse, and have high dimensionality. Also, the configuration of co-occurring taxa may represent overlapping subcommunities that contribute to sample characteristics such as host status. Preserving the configuration of co-occurring microbes rather than detecting specific indicator species is more likely to facilitate biologically meaningful interpretations. Additionally, analyses that use taxonomic relative abundances to predict the abundances of different gene functions aggregate predicted functional profiles across taxa. This precludes straightforward identification of predicted functional components associated with subsets of co-occurring taxa. We provide an approach to explore co-occurring taxa using “topics” generated via a topic model and link these topics to specific sample features (e.g., disease state). Rather than inferring predicted functional content based on overall taxonomic relative abundances, we instead focus on inference of functional content within topics, which we parse by estimating interactions between topics and pathways through a multilevel, fully Bayesian regression model. We apply our methods to three publicly available 16S amplicon sequencing datasets: an inflammatory bowel disease dataset, an oral cancer dataset, and a time-series dataset. Using our topic model approach to uncover latent structure in 16S rRNA amplicon surveys, investigators can (1) capture groups of co-occurring taxa termed topics; (2) uncover within-topic functional potential; (3) link taxa co-occurrence, gene function, and environmental/host features; and (4) explore the way in which sets of co-occurring taxa behave and evolve over time. These methods have been implemented in a freely available R package: https://cran.r-project.org/package= themetagenomics, https://github.com/EESI/themetagenomics.",
                "authors": [
                    {
                        "name": "Woloszynek S."
                    },
                    {
                        "name": "Mell J.C."
                    },
                    {
                        "name": "Zhao Z."
                    },
                    {
                        "name": "Simpson G."
                    },
                    {
                        "name": "O'Connor M.P."
                    },
                    {
                        "name": "Rosen G.L."
                    }
                ],
                "citationCount": 5,
                "date": "2019-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Exploring thematic structure and predicted functionality of 16S rRNA amplicon data"
            },
            "pmcid": "PMC6905537",
            "pmid": "31825995"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}