{
    "additionDate": "2019-11-14T19:42:43Z",
    "biotoolsCURIE": "biotools:cobia",
    "biotoolsID": "cobia",
    "confidence_flag": "tool",
    "description": "Prediction and Consequences of Cofragmentation in Metaproteomics | cobia is a computational tool to predict the number of cofragmenting ions in a mass spectrometry experiment, focused on metaproteomics. Specifically, we calculate 'cofragmentation scores' which represent identification and quantification bias using mass spectrometry based metaproteomics",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                },
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bertrand-lab/cobia",
    "language": [
        "R",
        "Shell",
        "Python"
    ],
    "lastUpdate": "2020-12-16T16:11:09Z",
    "license": "MIT",
    "name": "cobia",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.9B00144",
            "metadata": {
                "abstract": "Copyright © 2019 American Chemical Society.Metaproteomics can provide critical information about biological systems, but peptides are found within a complex background of other peptides. This complex background can change across samples, in some cases drastically. Cofragmentation, the coelution of peptides with similar mass to charge ratios, is one factor that influences which peptides are identified in an LC-MS/MS experiment: it is dependent on the nature and complexity of this dynamic background. Metaproteomics applications are particularly susceptible to cofragmentation-induced bias; they have vast protein sequence diversity and the abundance of those proteins can span many orders of magnitude. We have developed a mechanistic model that determines the number of potentially cofragmenting peptides in a given sample (called cobia, https://github.com/bertrand-lab/cobia). We then used previously published data sets to validate our model, showing that the resulting peptide-specific score reflects the cofragmentation \"risk\" of peptides. Using an Antarctic sea ice edge metatranscriptome case study, we found that more rare taxonomic and functional groups are associated with higher cofragmentation bias. We also demonstrate how cofragmentation scores can be used to guide the selection of protein- or peptide-based biomarkers. We illustrate potential consequences of cofragmentation for multiple metaproteomic approaches, and suggest practical paths forward to cope with cofragmentation-induced bias.",
                "authors": [
                    {
                        "name": "McCain J.S.P."
                    },
                    {
                        "name": "Bertrand E.M."
                    }
                ],
                "date": "2019-10-04T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Prediction and Consequences of Cofragmentation in Metaproteomics"
            },
            "pmid": "31483995"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}