{
    "name": "PROPSEARCH", 
    "description": "PROPSEARCH was designed to detect functional and / or structural homologs, if the sequence identity is below about 25%. It uses the amino acid physico-chemical properties, content of bulky residues, content of small residues, average hydrophobicity, average charge a.s.o. and are used as query vector. Sequences in the database are transformed into vectors as well, and the euclidian distance between the query and database sequences is calculated.", 
    "homepage": "http://abcis.cbs.cnrs.fr/propsearch/", 
    "biotoolsID": "propsearch", 
    "biotoolsCURIE": "biotools:propsearch", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0236", 
                    "term": "Sequence composition calculation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0239", 
                    "term": "Sequence motif recognition"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0405", 
                    "term": "Protein hydrophobic region calculation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0292", 
                    "term": "Sequence alignment"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_1775", 
            "term": "Function analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://abcis.cbs.cnrs.fr/propsearch/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1006/jmbi.1995.0442", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "A sequence property approach to searching protein databases", 
                "abstract": "Currently available sequence alignment programs are generally not capable of detecting functional and structural homologs in the twilight zone of sequence similarity, i.e. when the sequence identity falls below about 25%. Here we attempt to detect such weak similarities using an approach based on a notion of protein sequence similarity radically different from that used in sequential alignment. The approach defines protein sequence dissimilarity (or distance) as a weighted sum of differences of compositional properties such as singlet and doublet amino acid composition, molecular weight, isoelectric point (protein property search or PropSearch). With PropSearch, either single sequences can be used for a database query, or multiple sequences can be merged into an 'average' sequence reflecting the average composition of a protein family. First, we show that members of structural protein families have a low mutual PropSearch distance when the weights are optimized to discriminate maximally between structural families. Second, we demonstrate the results of database searches using the PropSearch method. Such searches are very rapid when scanning a preprocessed database and do not require alignments. In cases in which conventional alignment tools fail to detect similarities, PropSearch can be used to generate hypotheses about possible structural or functional relationships between a new sequence and sequences in the database. © 1995 Academic Press Limited.", 
                "date": "1995-08-18T00:00:00Z", 
                "citationCount": 159, 
                "authors": [
                    {
                        "name": "Hobohm U."
                    }, 
                    {
                        "name": "Sander C."
                    }
                ], 
                "journal": "Journal of Molecular Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Uwe Hobohm", 
            "email": "Uwe.Hobohm@tg.fh-giessen.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "admin", 
    "additionDate": "2017-12-06T18:14:47Z", 
    "lastUpdate": "2019-09-04T08:37:33Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}