{
    "additionDate": "2018-04-22T15:30:19Z",
    "biotoolsCURIE": "biotools:functree",
    "biotoolsID": "functree",
    "credit": [
        {
            "email": "takuji@bio.titech.ac.jp",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web-based application for analyzing and visualizing large-scale omics data, including but not limited to genomic, metagenomic, and transcriptomic data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bioviz.tokyo/functree/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                }
            ]
        }
    ],
    "homepage": "https://bioviz.tokyo/functree/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "FuncTree",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0126967",
            "metadata": {
                "abstract": "© 2015 Uchiyama et al.Exponential growth of high-throughput data and the increasing complexity of omics information have been making processing and interpreting biological data an extremely difficult and daunting task. Here we developed FuncTree (http://bioviz.tokyo/functree), a web-based application for analyzing and visualizing large-scale omics data, including but not limited to genomic, metagenomic, and transcriptomic data. FuncTree allows user to map their omics data onto the \"Functional Tree map\", a predefined circular dendrogram, which represents the hierarchical relationship of all known biological functions defined in the KEGG database. This novel visualization method allows user to overview the broad functionality of their data, thus allowing a more accurate and comprehensive understanding of the omics information. FuncTree provides extensive customization and calculation methods to not only allow user to directly map their omics data to identify the functionality of their data, but also to compute statistically enriched functions by comparing it to other predefined omics data. We have validated FuncTree's analysis and visualization capability by mapping pan-genomic data of three different types of bacterial genera, metagenomic data of the human gut, and transcriptomic data of two different types of human cell expression. All three mapping strongly confirms FuncTree's capability to analyze and visually represent key functional feature of the omics data. We believe that FuncTree's capability to conduct various functional calculations and visualizing the result into a holistic overview of biological function, would make it an integral analysis/visualization tool for extensive omics base research.",
                "authors": [
                    {
                        "name": "Uchiyama T."
                    },
                    {
                        "name": "Irie M."
                    },
                    {
                        "name": "Mori H."
                    },
                    {
                        "name": "Kurokawa K."
                    },
                    {
                        "name": "Yamada T."
                    }
                ],
                "citationCount": 20,
                "date": "2015-05-14T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FuncTree: Functional analysis and visualization for large-scale omics data"
            },
            "pmcid": "PMC4431737",
            "pmid": "25974630"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}