{
    "accessibility": [],
    "additionDate": "2017-08-03T18:54:07Z",
    "biotoolsCURIE": "biotools:piage",
    "biotoolsID": "piage",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dkfz.de/de/epidemiologie-krebserkrankungen/mitarbeiter/kontakt/epidemiologie_krebserk.php"
        }
    ],
    "description": "Perform estimation of power and sample sizes required to detect genetic and environmental main, as well as gene-environment interaction (GxE) effects in indirect matched case-control studies (1:1 matching). When the hypothesis of GxE is tested, power/sample size will be estimated for the detection of GxE, as well as for the detection of genetic and environmental marginal effects. Furthermore, power estimation is implemented for the joint test of genetic marginal and GxE effects.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.dkfz.de/en/epidemiologie-krebserkrankungen/software/PIAGE/PIAGE_FAQs.pdf"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.dkfz.de/en/epidemiologie-krebserkrankungen/software/software.html",
    "homepage_status": 1,
    "language": [],
    "lastUpdate": "2018-12-10T12:58:43Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/piage-1-0-power-indirect-association-studies-gene-environment-interactions.html"
        }
    ],
    "maturity": null,
    "name": "PIAGE",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Association studies accounting for gene-environment interactions (G x E) may be useful for detecting genetic effects. Although current technology enables very dense marker spacing in genetic association studies, the true disease variants may not be genotyped. Thus, causal genes are searched for by indirect association using genetic markers in linkage disequilibrium (LD) with the true disease variants. Sample sizes needed to detect G x E effects in indirect case-control association studies depend on the true genetic main effects, disease allele frequencies, whether marker and disease allele frequencies match, LD between loci, main effects and prevalence of environmental exposures, and the magnitude of interactions. We explored variables influencing sample sizes needed to detect G x E, compared these sample sizes with those required to detect genetic marginal effects, and provide an algorithm for power and sample size estimations. Required sample sizes may be heavily inflated if LD between marker and disease loci decreases. More than 10,000 case-control pairs may be required to detect G x E. However, given weak true genetic main effects, moderate prevalence of environmental exposures, as well as strong interactions, G x E effects may be detected with smaller sample sizes than those needed for the detection of genetic marginal effects. Moreover, in this scenario, rare disease variants may only be detectable when G x E is included in the analyses. Thus, the analysis of G x E appears to be an attractive option for the detection of weak genetic main effects of rare variants that may not be detectable in the analysis of genetic marginal effects only. © 2007 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Hein R."
                    },
                    {
                        "name": "Beckmann L."
                    },
                    {
                        "name": "Chang-Claude J."
                    }
                ],
                "citationCount": 35,
                "date": "2008-04-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "Sample size requirements for indirect association studies of gene-environment interactions (G x E)"
            },
            "note": null,
            "pmcid": null,
            "pmid": "18163529",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": []
}