{
    "additionDate": "2018-07-14T09:09:25Z",
    "biotoolsCURIE": "biotools:circlncrnanet",
    "biotoolsID": "circlncrnanet",
    "credit": [
        {
            "email": "btan@mail.cgu.edu.tw",
            "name": "Bertrand Chin-Ming Tan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An integrated web-based resource for mapping functional networks of long or circular forms of non-coding RNAs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/smw1414/circlncRNAnet"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://github.com/smw1414/circlncRNAnet",
    "language": [
        "PHP",
        "JavaScript",
        "R",
        "Shell"
    ],
    "lastUpdate": "2021-04-15T20:12:45.325811Z",
    "license": "GPL-3.0",
    "name": "circlncRNAnet",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "value": "RRID:SCR_015794"
        }
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/gigascience/gix118",
            "metadata": {
                "abstract": "© The Author(s) 2017.Background: Despite their lack of protein-coding potential, long noncoding RNAs (lncRNAs) and circular RNAs (circRNAs) have emerged as key determinants in gene regulation, acting to fine-tune transcriptional and signaling output. These noncoding RNA transcripts are known to affect expression of messenger RNAs (mRNAs) via epigenetic and post-transcriptional regulation. Given their widespread target spectrum, as well as extensive modes of action, a complete understanding of their biological relevance will depend on integrative analyses of systems data at various levels. Findings: While a handful of publicly available databases have been reported, existing tools do not fully capture, from a network perspective, the functional implications of lncRNAs or circRNAs of interest. Through an integrated and streamlined design, circlncRNAnet aims to broaden the understanding of ncRNA candidates by testing in silico several hypotheses of ncRNA-based functions, on the basis of large-scale RNA-seq data. This web server is implemented with several features that represent advances in the bioinformatics of ncRNAs: (1) a flexible framework that accepts and processes user-defined next-generation sequencing-based expression data; (2) multiple analytic modules that assign and productively assess the regulatory networks of user-selected ncRNAs by cross-referencing extensively curated databases; (3) an all-purpose, information-rich workflow design that is tailored to all types of ncRNAs. Outputs on expression profiles, co-expression networks and pathways, and molecular interactomes, are dynamically and interactively displayed according to user-defined criteria. Conclusions: In short, users may apply circlncRNAnet to obtain, in real time, multiple lines of functionally relevant information on circRNAs/lncRNAs of their interest. In summary, circlncRNAnet provides a \"one-stop\" resource for in-depth analyses of ncRNA biology. circlncRNAnet is freely available at http://app.cgu.edu.tw/circlnc/.",
                "authors": [
                    {
                        "name": "Wu S.-M."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Huang P.-J."
                    },
                    {
                        "name": "Chang I.Y.-F."
                    },
                    {
                        "name": "Lee C.-C."
                    },
                    {
                        "name": "Yang C.-Y."
                    },
                    {
                        "name": "Tsai W.-S."
                    },
                    {
                        "name": "Tan B.C.-M."
                    }
                ],
                "citationCount": 37,
                "date": "2018-01-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "circlncRNAnet: An integrated web-based resource for mapping functional networks of long or circular forms of noncoding RNAs"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}