{"credit":[{"email":"srholbrook@lbl.gov","name":"Peter S. Klosterman","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"RNA secondary structure prediction","uri":"http://edamontology.org/operation_0278"},{"term":"Structure visualisation","uri":"http://edamontology.org/operation_0570"},{"term":"Structure classification","uri":"http://edamontology.org/operation_2996"},{"term":"RNA structure prediction","uri":"http://edamontology.org/operation_2441"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"},{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"NMR","uri":"http://edamontology.org/topic_0593"}]},"publication":[{"abstract":"SCOR, the Structural Classification of RNA (http://scor.lbl.gov), is a database designed to provide a comprehensive perspective and understanding of RNA motif three-dimensional structure, function, tertiary interactions and their relationships. SCOR 2.0 represents a major expansion and introduces a new classification organization. The new version represents the classification as a Directed Acyclic Graph (DAG), which allows a classification node to have multiple parents, in contrast to the strictly hierarchical classification used in SCOR 1.2. SCOR 2.0 supports three types of query terms in the updated search engine: PDB or NDB identifier, nucleotide sequence and keyword. We also provide parseable XML files for all information. This new release contains 511 RNA entries from the PDB as of 15 May 2003. A total of 5880 secondary structural elements are classified: 2104 hairpin loops and 3776 internal loops. RNA motifs reported in the literature, such as 'Kink turn' and 'GNRA loops', are now incorporated into the structural classification along with definitions and descriptions.","authors":["Tamura M.","Hendrix D.K.","Klosterman P.S.","Schimmelman N.R.B.","Brenner S.E.","Holbrook S.R."],"cit_count":75,"journal":"Nucleic Acids Research","pmid":"14681389","title":"SCOR: Structural Classification of RNA, version 2.0","year":"2004-01-01"},{"abstract":"The Structural Classification of RNA (SCOR) database provides a survey of the three-dimensional motifs contained in 259 NMR and X-ray RNA structures. In one classification, the structures are grouped according to function. The RNA motifs, including internal and external loops, are also organized in a hierarchical classification. The 259 database entries contain 223 internal and 203 external loops; 52 entries consist of fully complementary duplexes. A classification of the well-characterized tertiary interactions found in the larger RNA structures is also included along with examples. The SCOR database is accessible at http://scor.lbl.gov.","authors":["Klosterman P.S.","Tamura M.","Holbrook S.R.","Brenner S.E."],"cit_count":93,"journal":"Nucleic Acids Research","pmid":"11752346","title":"SCOR: A structural classification of RNA database","year":"2002-01-01"}],"summary":{"biotoolsCURIE":"biotools:scor","biotoolsID":"scor","description":"Database designed to provide a comprehensive perspective and understanding of RNA motif structure, function, tertiary interactions and their relationships.","homepage":"http://scor.berkeley.edu/","name":"SCOR"}}