{
    "additionDate": "2021-01-18T11:28:45Z",
    "biotoolsCURIE": "biotools:lncrbase",
    "biotoolsID": "lncrbase",
    "confidence_flag": "tool",
    "description": "An updated resource for multispecies lncRNAs and ClinicLSNP hosting genetic variants in lncRNAs for cancer patients.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://dibresources.jcbose.ac.in/zhumur/lncrbase2/",
    "lastUpdate": "2021-02-17T07:20:24Z",
    "name": "LncRBase",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1080/15476286.2020.1833529",
            "metadata": {
                "abstract": "© 2020 Informa UK Limited, trading as Taylor & Francis Group.The recent discovery of long non-coding RNA as a regulatory molecule in the cellular system has altered the concept of the functional aptitude of the genome. Since our publication of the first version of LncRBase in 2014, there has been an enormous increase in the number of annotated lncRNAs of multiple species other than Human and Mouse. LncRBase V.2 hosts information of 549,648 lncRNAs corresponding to six additional species besides Human and Mouse, viz. Rat, Fruitfly, Zebrafish, Chicken, Cow and C.elegans. It provides additional distinct features such as (i) Transcription Factor Binding Site (TFBS) in the lncRNA promoter region, (ii) sub-cellular localization pattern of lncRNAs (iii) lnc-pri-miRNAs (iv) Possible small open reading frames (sORFs) within lncRNA. (v) Manually curated information of interacting target molecules and disease association of lncRNA genes (vi) Distribution of lncRNAs across multiple tissues of all species. Moreover, we have hosted ClinicLSNP within LncRBase V.2. ClinicLSNP has a comprehensive catalogue of lncRNA variants present within breast, ovarian, and cervical cancer inferred from 561 RNA-Seq data corresponding to these cancers. Further, we have checked whether these lncRNA variants overlap with (i)Repeat elements,(ii)CGI, (iii)TFBS within lncRNA loci (iv)SNP localization in trait-associated Linkage Disequilibrium(LD) region, (v)predicted the potentially pathogenic variants and (vi)effect of SNP on lncRNA secondary structure. Overall, LncRBaseV.2 is a user-friendly database to survey, search and retrieve information about multi-species lncRNAs. Further, ClinicLSNP will serve as a useful resource for cancer specific lncRNA variants and their related information. The database is freely accessible and available at http://dibresources.jcbose.ac.in/zhumur/lncrbase2/.",
                "authors": [
                    {
                        "name": "Das T."
                    },
                    {
                        "name": "Deb A."
                    },
                    {
                        "name": "Ghosh Z."
                    },
                    {
                        "name": "Khatua S."
                    },
                    {
                        "name": "Mondal S."
                    },
                    {
                        "name": "Parida S."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "RNA Biology",
                "title": "LncRBase V.2: an updated resource for multispecies lncRNAs and ClinicLSNP hosting genetic variants in lncRNAs for cancer patients"
            },
            "pmid": "33112702"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "version": [
        "2.0"
    ]
}
