
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 Elsevier B.V.Genotyping of Mycobacterium avium subsp. paratuberculosis (Map) is an indispensable tool for surveillance of this significant veterinary pathogen. For Map, multi-locus variable number tandem repeat analysis (MLVA) targeting mycobacterial interspersed repetitive units (MIRUs) and other variable number variable-number tandem repeats (VNTRs) was established using 8 markers. In the recent past this standard, portable, reproducible and discriminatory typing method has been frequently applied alone or in combinations with multi-locus short-sequence-repeat (MLSSR) sequencing. With the widespread use of these genotyping methods, standardization between laboratories needs to be managed, and knowledge of existing profiles and newly defined genotypes should be indexed and shared. To meet this need, a web application called “MAC-INMV-SSR database” was developed. This freely accessible service allows users to compare MLVA and MLSSR subtype data of their strains with those of existing reference strains analyzed with the same genotyping methods.",
            "authors": [
                "Cochard T.",
                "Branger M.",
                "Supply P.",
                "Sreevatsan S.",
                "Biet F."
            ],
            "cit_count": 0,
            "doi": "10.1016/J.MEEGID.2019.104075",
            "journal": "Infection, Genetics and Evolution",
            "pmid": "31634642",
            "title": "MAC-INMV-SSR: a web application dedicated to genotyping members of Mycobacterium avium complex (MAC) including Mycobacterium avium subsp. paratuberculosis strains",
            "year": "2020-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:MAC-INMV-SSR",
        "biotoolsID": "MAC-INMV-SSR",
        "description": "a web application dedicated to genotyping members of Mycobacterium avium complex (MAC) including Mycobacterium avium subsp. paratuberculosis strains.\n\nGenotyping of Mycobacterium avium subsp. paratuberculosis (Map) is an indispensable tool for surveillance of this significant veterinary pathogen. For Map, multi-locus variable number tandem repeat analysis (MLVA) targeting mycobacterial interspersed repetitive units (MIRUs) and other variable number variable-number tandem repeats (VNTRs) was established using 8 markers. In the recent past this standard, portable, reproducible and discriminatory typing method has been frequently applied alone or in combinations with multi-locus short-sequence-repeat (MLSSR) sequencing. With the widespread use of these genotyping methods, standardization between laboratories needs to be managed, and knowledge of existing profiles and newly defined genotypes should be indexed and shared.\n\n||| HOMEPAGE MISSING!",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31634642",
        "name": "MAC-INMV-SSR"
    }
}