{
    "additionDate": "2024-04-08T10:13:07.534404Z",
    "biotoolsCURIE": "biotools:pdb_bre",
    "biotoolsID": "pdb_bre",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu"
        }
    ],
    "description": "A ligand-protein interaction binding residue extractor based on Protein Data Bank.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Residue distance calculation",
                    "uri": "http://edamontology.org/operation_2950"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/PDB-BRE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:05:02.922994Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ShutaoChen97/PDB-BRE"
        }
    ],
    "name": "PDB-BRE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/prot.26596",
            "metadata": {
                "abstract": "Proteins typically exert their biological functions by interacting with other biomolecules or ligands. The study of ligand–protein interactions is crucial in elucidating the biological mechanisms of proteins. Most existing studies have focused on analyzing ligand–protein interactions, and they ignore the additional situational of inserted and modified residues. Besides, the resources often support only a single ligand type and cannot obtain satisfied results in analyzing novel complexes. Therefore, it is important to develop a general analytical tool to extract the binding residues of ligand–protein interactions in complexes fully. In this study, we propose a ligand–protein interaction binding residue extractor (PDB-BRE), which can be used to automatically extract interacting ligand or protein-binding residues from complex three-dimensional (3D) structures based on the RCSB Protein Data Bank (RCSB PDB). PDB-BRE offers a notable advantage in its comprehensive support for analyzing six distinct types of ligands, including proteins, peptides, DNA, RNA, mixed DNA and RNA entities, and non-polymeric entities. Moreover, it takes into account the consideration of inserted and modified residues within complexes. Compared to other state-of-the-art methods, PDB-BRE is more suitable for massively parallel batch analysis, and can be directly applied for downstream tasks, such as predicting binding residues of novel complexes. PDB-BRE is freely available at http://bliulab.net/PDB-BRE.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Yan K."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "PDB-BRE: A ligand–protein interaction binding residue extractor based on Protein Data Bank"
            },
            "pmid": "37750380"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
