
{
    "credit": [
        {
            "email": "serge.dmitrieff@embl.de",
            "name": "Serge Dmitrieff",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/SergeDmi/ConfocalGN/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Light microscopy",
                "uri": "http://edamontology.org/topic_3385"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017Validating image analysis pipelines and training machine-learning segmentation algorithms require images with known features. Synthetic images can be used for this purpose, with the advantage that large reference sets can be produced easily. It is however essential to obtain images that are as realistic as possible in terms of noise and resolution, which is challenging in the field of microscopy. We describe ConfocalGN, a user-friendly software that can generate synthetic microscopy stacks from a ground truth (i.e. the observed object) specified as a 3D bitmap or a list of fluorophore coordinates. This software can analyze a real microscope image stack to set the noise parameters and directly generate new images of the object with noise characteristics similar to that of the sample image. With a minimal input from the user and a modular architecture, ConfocalGN is easily integrated with existing image analysis solutions.",
            "authors": [
                "Dmitrieff S.",
                "Nedelec F."
            ],
            "cit_count": 2,
            "doi": "10.1016/j.softx.2017.09.002",
            "journal": "SoftwareX",
            "title": "ConfocalGN: A minimalistic confocal image generator",
            "type": "Primary",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:confocalgn",
        "biotoolsID": "confocalgn",
        "description": "ConfocalGN is a user-friendly software that can generate synthetic microscopy stacks from a ground truth (i.e. the observed object) specified as a 3D bitmap or a list of fluorophore coordinates. This software can analyze a real microscope image stack to set the noise parameters and directly generate new images of the object with noise characteristics similar to that of the sample image.",
        "homepage": "https://github.com/ElsevierSoftwareX/SOFTX-D-17-00018",
        "name": "ConfocalGN",
        "version": [
            "v1.1"
        ]
    }
}