{
    "additionDate": "2019-11-14T19:57:49Z",
    "biotoolsCURIE": "biotools:PPCheck",
    "biotoolsID": "PPCheck",
    "confidence_flag": "tool",
    "description": "PPCheck is a bioinformatics tool to identify protein-protein interactions, predict hotspots, perform compuational alanine scanning, predict native-like docking pose and calculate residue conservation for a protein.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Hydrogen bond calculation",
                    "uri": "http://edamontology.org/operation_0394"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Protein-protein docking",
                    "uri": "http://edamontology.org/operation_3899"
                }
            ]
        }
    ],
    "homepage": "http://caps.ncbs.res.in/ppcheck/",
    "lastUpdate": "2021-01-17T20:13:14Z",
    "name": "PPCheck",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/MINF.201800145",
            "metadata": {
                "abstract": "© 2019 Wiley-VCH Verlag GmbH & Co. KGaA, WeinheimProtein-protein interactions are an important phenomenon in biological processes and functions. We used the manually curated non-redundant dataset of 118 phycocyanin interfaces to gain additional insight into this phenomenon using a robust inter-atomic non-covalent interaction analyzing tool PPCheck. Our observations indicate that there is a relatively high composition of hydrophobic residues at the interfaces. Most of the interface residues are clustered at the middle of the range which we call “standard-size” interfaces. Furthermore, the multiple interaction patterns founded in the present study indicate that more than half of the residues involved in these interactions participate in multiple and water-bridged hydrogen bonds. Thus, hydrogen bonds contribute maximally towards the stability of protein-protein complexes. The analysis shows that hydrogen bond energies contribute to about 88 % to the total energy and it also increases with interface size. Van der Waals (vdW) energy contributes to 9.3 %±1.7 % on average in these complexes. Moreover, there is about 1.9 %±1.5 % contribution by electrostatic energy. Nevertheless, the role by vdW and electrostatic energy could not be ignored in interface binding. Results show that the total binding energy is more for large phycocyanin interfaces. The normalized energy per residue was less than −16 kJ mol−1, while most of them have energy in the range from −6 to −14 kJ mol−1. The non-covalent interacting residues in these proteins were found to be highly conserved. Obtained results might contribute to the understanding of structural stability of this class of evolutionary essential proteins with increased practical application and future designs of novel protein-bioactive compound interactions.",
                "authors": [
                    {
                        "name": "Breberina L.M."
                    },
                    {
                        "name": "Nikolic M.R."
                    },
                    {
                        "name": "Stojanovic S.D."
                    },
                    {
                        "name": "Zlatovic M.V."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Molecular Informatics",
                "title": "Computational Analysis of Non-covalent Interactions in Phycocyanin Subunit Interfaces"
            },
            "pmid": "31535472"
        }
    ],
    "topic": [
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1
}
