{
    "additionDate": "2020-01-09T17:52:08Z",
    "biotoolsCURIE": "biotools:SORA",
    "biotoolsID": "SORA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ted.ahn@slu.edu",
            "name": "Tae-Hyuk Ahn",
            "typeEntity": "Person"
        }
    ],
    "description": "Using Apache Spark on genome assembly for scalable overlap-graph reduction.\n\nScalable Overlap-Graph Reduction Algorithms for Genome Assembly using Apache Spark on Cloud.\n\nPlease go to the Wiki pages, https://github.com/BioHPC/SORA/wiki, to learn about SORA",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BioHPC/SORA/wiki"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                },
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioHPC/SORA",
    "language": [
        "Shell",
        "Scala",
        "Python"
    ],
    "lastUpdate": "2020-12-21T13:14:25Z",
    "license": "GPL-3.0",
    "name": "SORA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S40246-019-0227-1",
            "metadata": {
                "abstract": "BACKGROUND: De novo genome assembly is a technique that builds the genome of a specimen using overlaps of genomic fragments without additional work with reference sequence. Sequence fragments (called reads) are assembled as contigs and scaffolds by the overlaps. The quality of the de novo assembly depends on the length and continuity of the assembly. To enable faster and more accurate assembly of species, existing sequencing techniques have been proposed, for example, high-throughput next-generation sequencing and long-reads-producing third-generation sequencing. However, these techniques require a large amounts of computer memory when very huge-size overlap graphs are resolved. Also, it is challenging for parallel computation. RESULTS: To address the limitations, we propose an innovative algorithmic approach, called Scalable Overlap-graph Reduction Algorithms (SORA). SORA is an algorithm package that performs string graph reduction algorithms by Apache Spark. The SORA's implementations are designed to execute de novo genome assembly on either a single machine or a distributed computing platform. SORA efficiently compacts the number of edges on enormous graphing paths by adapting scalable features of graph processing libraries provided by Apache Spark, GraphX and GraphFrames. CONCLUSIONS: We shared the algorithms and the experimental results at our project website, https://github.com/BioHPC/SORA . We evaluated SORA with the human genome samples. First, it processed a nearly one billion edge graph on a distributed cloud cluster. Second, it processed mid-to-small size graphs on a single workstation within a short time frame. Overall, SORA achieved the linear-scaling simulations for the increased computing instances.",
                "authors": [
                    {
                        "name": "Paul A.J."
                    },
                    {
                        "name": "Lawrence D."
                    },
                    {
                        "name": "Song M."
                    },
                    {
                        "name": "Lim S.-H."
                    },
                    {
                        "name": "Pan C."
                    },
                    {
                        "name": "Ahn T.-H."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-22T00:00:00Z",
                "journal": "Human genomics",
                "title": "Using Apache Spark on genome assembly for scalable overlap-graph reduction"
            },
            "pmcid": "PMC6805285",
            "pmid": "31639049"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ],
    "validated": 1
}