{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:52:33Z",
    "biotoolsCURIE": "biotools:find-core-toolbox",
    "biotoolsID": "find-core-toolbox",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "David Snyder",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/1420896-david-snyder"
        }
    ],
    "description": "MATLAB implementation of the FindCore and FindCore2 algorithms",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein structure assignment",
                    "uri": "http://edamontology.org/operation_0320"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/28493-find-core-toolbox-version-2-0",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-13T19:13:16Z",
    "name": "Find Core Toolbox",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/prot.24490",
            "metadata": {
                "abstract": "Maximizing the scientific impact of NMR-based structure determination requires robust and statistically sound methods for assessing the precision of NMR-derived structures. In particular, a method to define a core atom set for calculating superimpositions and validating structure predictions is critical to the use of NMR-derived structures as targets in the CASP competition. FindCore (Snyder and Montelione, Proteins 2005;59:673-686) is a superimposition independent method for identifying a core atom set and partitioning that set into domains. However, as FindCore optimizes superimposition by sensitively excluding not-well-defined atoms, the FindCore core may not comprise all atoms suitable for use in certain applications of NMR structures, including the CASP assessment process. Adapting the FindCore approach to assess predicted models against experimental NMR structures in CASP10 required modification of the FindCore method. This paper describes conventions and a standard protocol to calculate an \"Expanded FindCore\" atom set suitable for validation and application in biological and biophysical contexts. A key application of the Expanded FindCore method is to identify a core set of atoms in the experimental NMR structure for which it makes sense to validate predicted protein structure models. We demonstrate the application of this Expanded FindCore method in characterizing well-defined regions of 18 NMR-derived CASP10 target structures. The Expanded FindCore protocol defines \"expanded core atom sets\" that match an expert's intuition of which parts of the structure are sufficiently well defined to use in assessing CASP model predictions. We also illustrate the impact of this analysis on the CASP GDT assessment scores. © 2013 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Grullon J."
                    },
                    {
                        "name": "Huang Y.J."
                    },
                    {
                        "name": "Montelione G.T."
                    },
                    {
                        "name": "Snyder D.A."
                    },
                    {
                        "name": "Tejero R."
                    }
                ],
                "citationCount": 9,
                "date": "2014-02-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "The expanded findcore method for identification of a core atom set for assessment of protein structure prediction"
            },
            "note": "Version 2.0",
            "pmcid": "PMC3932188",
            "pmid": "24327305"
        },
        {
            "doi": "10.1002/prot.20402",
            "metadata": {
                "abstract": "An important open question in the field of NMR-based biomolecular structure determination is how best to characterize the precision of the resulting ensemble of structures. Typically, the RMSD, as minimized in superimposing the ensemble of structures, is the preferred measure of precision. However, the presence of poorly determined atomic coordinates and multiple \"RMSD-stable domains\"-locally well-defined regions that are not aligned in global superimpositions-complicate RMSD calculations. In this paper, we present a method, based on a novel, structurally defined order parameter, for identifying a set of core atoms to use in determining superimpositions for RMSD calculations. In addition we present a method for deciding whether to partition that core atom set into \"RMSD-stable domains\" and, if so, how to determine partitioning of the core atom set. We demonstrate our algorithm and its application in calculating statistically sound RMSD values by applying it to a set of NMR-derived structural ensembles, superimposing each RMSD-stable domain (or the entire core atom set, where appropriate) found in each protein structure under consideration. A parameter calculated by our algorithm using a novel, kurtosis-based criterion, the ε-value, is a measure of precision of the superimposition that complements the RMSD. In addition, we compare our algorithm with previously described algorithms for determining core atom sets. The methods presented in this paper for biomolecular structure superimposition are quite general, and have application in many areas of structural bioinformatics and structural biology. © 2005 Wiley-Liss, Inc.",
                "authors": [
                    {
                        "name": "Montelione G.T."
                    },
                    {
                        "name": "Snyder D.A."
                    }
                ],
                "citationCount": 41,
                "date": "2005-06-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Genetics",
                "title": "Clustering algorithms for identifying core atom sets and for assessing the precision of protein structure ensembles"
            },
            "note": "Version 1.0",
            "pmid": "15822099",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        }
    ],
    "version": [
        "1.0",
        "2.0"
    ]
}
