{
    "accessibility": [],
    "additionDate": "2017-08-03T18:57:34Z",
    "biotoolsCURIE": "biotools:rcos",
    "biotoolsID": "rcos",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "zohar.yakhini@gmail.com",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://zohary.cswp.cs.technion.ac.il/"
        }
    ],
    "description": "Find genes (or miRNAs) that have a consistently high rank across different lists.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://bioinfo.cs.technion.ac.il/people/zohar/RCoS/"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://bioinfo.cs.technion.ac.il/people/zohar/RCoS/",
    "homepage_status": 0,
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/rcos-compute-rank-consistency-score.html"
        }
    ],
    "maturity": null,
    "name": "RCoS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: microRNAs (miRNAs) regulate target genes at the post-transcriptional level and play important roles in cancer pathogenesis and development. Variation amongst individuals is a significant confounding factor in miRNA (or other) expression studies. The true character of biologically or clinically meaningful differential expression can be obscured by inter-patient variation. In this study we aim to identify miRNAs with consistent differential expression in multiple tumor types using a novel data analysis approach. Methods: Using microarrays we profiled the expression of more than 700 miRNAs in 28 matched tumor/normal samples from 8 different tumor types (breast, colon, liver, lung, lymphoma, ovary, prostate and testis). This set is unique in putting emphasis on minimizing tissue type and patient related variability using normal and tumor samples from the same patient. We develop scores for comparing miRNA expression in the above matched sample data based on a rigorous characterization of the distribution of order statistics over a discrete state set, including exact p-values. Specifically, we compute a Rank Consistency Score (RCoS) for every miRNA measured in our data. Our methods are also applicable in various other contexts. We compare our methods, as applied to matched samples, to paired t-test and to the Wilcoxon Signed Rank test. Results: We identify consistent (across the cancer types measured) differentially expressed miRNAs. 41 miRNAs are under-expressed in cancer compared to normal, at FDR (False Discovery Rate) of 0.05 and 17 are over-expressed at the same FDR level. Differentially expressed miRNAs include known oncomiRs (e.g miR-96) as well as miRNAs that were not previously universally associated with cancer. Specific examples include miR-133b and miR-486-5p, which are consistently down regulated and mir-629* which is consistently up regulated in cancer, in the context of our cohort. Data is available in GEO. Software is available at: http://bioinfo.cs.technion.ac.il/people/zohar/RCoS/. © 2009 Navon et al.",
                "authors": [
                    {
                        "name": "Navon R."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Steinfeld I."
                    },
                    {
                        "name": "Tsalenko A."
                    },
                    {
                        "name": "Ben-Dor A."
                    },
                    {
                        "name": "Yakhini Z."
                    }
                ],
                "citationCount": 129,
                "date": "2009-11-25T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Novel rank-based statistical methods reveal microRNAs with differential expression in multiple cancer types"
            },
            "note": null,
            "pmcid": null,
            "pmid": "19946373",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1,
    "version": []
}