{
    "accessibility": "Open access",
    "additionDate": "2025-07-24T08:48:17.637773Z",
    "biotoolsCURIE": "biotools:xnat",
    "biotoolsID": "xnat",
    "collectionID": [
        "EUCAIM"
    ],
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dmarcus@wustl.edu",
            "name": "Daniel Marcus",
            "orcidid": "https://orcid.org/0000-0001-5662-5358",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://profiles.wustl.edu/en/persons/daniel-marcus"
        }
    ],
    "description": "XNAT is an open source imaging informatics platform developed by the Neuroinformatics Research Group at Washington University. XNAT was originally developed at Washington University in the Buckner Lab, which is now located at Harvard University. It facilitates common management, productivity, and quality assurance tasks for imaging and associated data. Thanks to its extensibility, XNAT can be used to support a wide range of imaging-based projects.",
    "documentation": [
        {
            "type": [
                "API documentation"
            ],
            "url": "https://wiki.xnat.org/xnat-api/xnat-rest-api-directory"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://wiki.xnat.org/documentation/"
        }
    ],
    "download": [
        {
            "type": "Downloads page",
            "url": "https://xnat.org/download/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Data deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Data sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://xnat.org",
    "language": [
        "Java"
    ],
    "lastUpdate": "2025-07-24T08:53:51.609723Z",
    "license": "BSD-2-Clause",
    "link": [
        {
            "type": [
                "Discussion forum"
            ],
            "url": "https://groups.google.com/g/xnat_discussion/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://bitbucket.org/xnatdev/workspace/repositories/"
        }
    ],
    "maturity": "Mature",
    "name": "XNAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hachterberg",
    "publication": [
        {
            "doi": "10.1162/jocn.2009.21407",
            "metadata": {
                "abstract": "The Open Access Series of Imaging Studies is a series of neuroimaging data sets that are publicly available for study and analysis. The present MRI data set consists of a longitudinal collection of 150 subjects aged 60 to 96 years all acquired on the same scanner using identical sequences. Each subject was scanned on two or more visits, separated by at least 1 year for a total of 373 imaging sessions. Subjects were characterized using the Clinical Dementia Rating (CDR) as either nondemented or with very mild tomild Alzheimer's disease. Seventy-two of the subjects were characterized as nondemented throughout the study. Sixty-four of the included subjects were characterized as demented at the time of their initial visits and remained so for subsequent scans, including 51 individuals with CDR 0.5 similar level of impairment to individuals elsewhere considered to have \"mild cognitive impairment.\" Another 14 subjects were characterized as nondemented at the time of their initial visit (CDR 0) and were subsequently characterized as demented at a later visit (CDR > 0). The subjects were all right-handed and include bothmen (n=62) and women (n = 88). For each scanning session, three or four individual T1-weighted MRI scans were obtained. Multiple withinsession acquisitions provide extremely high contrast to noise, making the data amenable to a wide range of analytic approaches including automated computational analysis. Automated calculation of whole-brain volume is presented to demonstrate use of the data for measuring differences associated with normal aging and Alzheimer's disease. © 2010 Massachusetts Institute of Technology.",
                "authors": [
                    {
                        "name": "Buckner R.L."
                    },
                    {
                        "name": "Csernansky J.G."
                    },
                    {
                        "name": "Fotenos A.F."
                    },
                    {
                        "name": "Marcus D.S."
                    },
                    {
                        "name": "Morris J.C."
                    }
                ],
                "citationCount": 461,
                "date": "2010-12-01T00:00:00Z",
                "journal": "Journal of Cognitive Neuroscience",
                "title": "Open access series of imaging studies: Longitudinal MRI data in nondemented and demented older adults"
            },
            "pmcid": "PMC2895005",
            "pmid": "19929323",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1385/ni:5:1:11",
            "metadata": {
                "abstract": "The Extensible Neuroimaging Archive Toolkit (XNAT) is a software platform designed to facilitate common management and productivity tasks for neuroimaging and associated data. In particular, XNAT enables qualitycontrol procedures and provides secure access to and storage of data. XNAT follows a threetiered architecture that includes a data archive, user interface, and middleware engine. Data can be entered into the archive as XML or through data entry forms. Newly added data are stored in a virtual quarantine until an authorized user has validated it. XNAT subsequently maintains a history profile to track all changes made to the managed data. User access to the archive is provided by a secure web application. The web application provides a number of quality control and productivity features, including data entry forms, data-type-specific searches, searches that combine across data types, detailed reports, and listings of experimental data, upload/download tools, access to standard laboratory workflows, and administration and security tools. XNAT also includes an online image viewer that supports a number of common neuroimaging formats, including DICOM and Analyze. The viewer can be extended to support additional formats and to generate custom displays. By managing data with XNAT, laboratories are prepared to better maintain the long-term integrity of their data, to explore emergent relations across data types, and to share their data with the broader neuroimaging community. © Copyright 2007 by Humana Press Inc. All rights of any nature whatsoever are reserved.",
                "authors": [
                    {
                        "name": "Buckner R.L."
                    },
                    {
                        "name": "Marcus D.S."
                    },
                    {
                        "name": "Olsen T.R."
                    },
                    {
                        "name": "Ramaratnam M."
                    }
                ],
                "citationCount": 378,
                "date": "2007-03-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "The extensible neuroimaging archive toolkit: An informatics platform for managing, exploring, and sharing neuroimaging data"
            },
            "pmid": "17426351",
            "type": [
                "Primary"
            ]
        }
    ],
    "relation": [
        {
            "biotoolsID": "bigr_xnat",
            "type": "usedBy"
        },
        {
            "biotoolsID": "rxnat",
            "type": "usedBy"
        },
        {
            "biotoolsID": "xnat-pic",
            "type": "usedBy"
        },
        {
            "biotoolsID": "xnatpy",
            "type": "usedBy"
        }
    ],
    "toolType": [
        "Web API",
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioimaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ]
}
