{
    "additionDate": "2017-01-13T13:13:59Z",
    "biotoolsCURIE": "biotools:chip-seq",
    "biotoolsID": "chip-seq",
    "credit": [
        {
            "email": "epd@sib.swiss",
            "name": "EPD",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute"
        }
    ],
    "description": "The ChIP-seq web server provides access to a set of useful tools performing common ChIP-seq data analysis tasks, including positional correlation analysis, peak detection, and genome partitioning into signal-rich and signal-poor regions. It is an open system designed to allow interoperability with other resources, in particular the motif discovery programs from the Signal Search Analysis (SSA) server.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://epd.expasy.org/chipseq/general_doc.php"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://epd.expasy.org/chipseq/tutorials.php"
        }
    ],
    "editPermission": {
        "authors": [
            "metanetx"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://epd.expasy.org/chipseq/",
    "language": [
        "C",
        "Perl"
    ],
    "lastUpdate": "2023-09-05T10:33:10.520352Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "ChIP-Seq",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "sduvaud",
    "publication": [
        {
            "doi": "10.1186/s12864-016-3288-8",
            "metadata": {
                "abstract": "Background: ChIP-seq and related high-throughput chromatin profilig assays generate ever increasing volumes of highly valuable biological data. To make sense out of it, biologists need versatile, efficient and user-friendly tools for access, visualization and itegrative analysis of such data. Results: Here we present the ChIP-Seq command line tools and web server, implementing basic algorithms for ChIP-seq data analysis starting with a read alignment file. The tools are optimized for memory-efficiency and speed thus allowing for processing of large data volumes on inexpensive hardware. The web interface provides access to a large database of public data. The ChIP-Seq tools have a modular and interoperable design in that the output from one application can serve as input to another one. Complex and innovative tasks can thus be achieved by running several tools in a cascade. Conclusions: The various ChIP-Seq command line tools and web services either complement or compare favorably to related bioinformatics resources in terms of computational efficiency, ease of access to public data and interoperability with other web-based tools. The ChIP-Seq server is accessible at http://ccg.vital-it.ch/chipseq/.",
                "authors": [
                    {
                        "name": "Ambrosini G."
                    },
                    {
                        "name": "Bucher P."
                    },
                    {
                        "name": "Dreos R."
                    },
                    {
                        "name": "Kumar S."
                    }
                ],
                "citationCount": 16,
                "date": "2016-11-18T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "The ChIP-Seq tools and web server: A resource for analyzing ChIP-seq and other types of genomic data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1
}
