{
    "additionDate": "2021-01-18T11:51:34Z",
    "biotoolsCURIE": "biotools:cardiac",
    "biotoolsID": "cardiac",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Ariel Hernán Curiale",
            "orcidid": "https://orcid.org/0000-0003-3102-4374",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "CardIAc is an open-source application designed as an alternative to commercial software for left ventricle myocardial strain quantification in short-axis cardiac magnetic resonance images. CardIAc was developed as a 3D Slicer extension for an easy installation and usability. The source code is available opon request to the corresponding author.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.cardiacatlas.org",
    "lastUpdate": "2021-02-07T13:35:32Z",
    "license": "BSD-Source-Code",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://team.inria.fr/epione/en/data/synthetic-cardiac-mr-images"
        }
    ],
    "name": "CardIAc",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S11548-020-02291-Z",
            "metadata": {
                "abstract": "© 2020, CARS.Purpose: This paper presents CardIAc, an open-source application designed as an alternative to commercial software for left ventricle myocardial strain quantification in short-axis cardiac magnetic resonance images. The aim is to provide a useful extension for myocardial strain analysis that can be easily adapted to incorporate different strategies of motion tracking to improve the strain accuracy.In this way, users with programming skills can easily modify the code and adjust the program’s performance according to their own scientific or clinical requirements. The software is intended for research and clinical use is not advised. Methods: CardIAc was developed as a 3D Slicer extension for an easy installation and usability. The main contribution of this article is to provide a general workflow, going from data and segmentation loading, 3D heart modeling, analysis and several options for visualization of the myocardial strain. Results: CardIAc strain feature was evaluated on a public dataset (Cardiac Motion Analysis Challenge—STACOM 2011) of 15 volunteers, and a synthetic one generated from this real dataset. Results on the real dataset show that cardIAc achieves suitable accuracy for myocardial motion estimation with a median error of 3.66 mm. In particular, global strain curves show strong correlation with the bibliography for healthy patients and similar approaches. On the other hand, results on the synthetic dataset show a mean global error of 4.07%, 7.76% and 8.18% for circumferential, radial and longitudinal strain. Conclusion: This paper introduces a new open-source application for strain analysis distributed under a BSD-style open-source license. Results demonstrate the capability and merits of the proposed application for strain analysis.",
                "authors": [
                    {
                        "name": "Curiale A.H."
                    },
                    {
                        "name": "Bernardo A."
                    },
                    {
                        "name": "Cardenas R."
                    },
                    {
                        "name": "Mato G."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "International Journal of Computer Assisted Radiology and Surgery",
                "title": "CardIAc: an open-source application for myocardial strain analysis"
            },
            "pmid": "33196972"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        }
    ]
}