{
    "additionDate": "2016-10-10T14:31:29Z",
    "biotoolsCURIE": "biotools:cameo",
    "biotoolsID": "cameo",
    "collectionID": [
        "3D-BioInfo",
        "3D-BioInfo-Protein-Complex",
        "3D-BioInfo-Protein-Ligand-Interactions",
        "3D-BioInfo-Structure-Function"
    ],
    "credit": [
        {
            "email": "torsten.schwede@unibas.ch",
            "name": "Torsten Schwede",
            "orcidid": "https://orcid.org/0000-0003-2715-335X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://schwedelab.org"
        },
        {
            "email": "help-cameo3d@unibas.ch",
            "typeEntity": "Project",
            "typeRole": [
                "Support"
            ]
        },
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Continuously evaluates the accuracy and reliability of protein structure prediction methods in a fully automated manner. CAMEO currently assesses predictions in two categories (3D protein structure modeling and protein structure model quality predictions). The project is open to everyone and has been used by several method developer groups to benchmark and monitor their servers and new developments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.cameo3d.org/cameong_help/"
        }
    ],
    "editPermission": {
        "authors": [
            "gerardo.tauriello",
            "juergenhaasSIB"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Switzerland"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "Analyze protein structure predictions with PDB experimental structures as gold standard",
            "operation": [
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structural quality report",
                        "uri": "http://edamontology.org/data_1539"
                    },
                    "format": [
                        {
                            "term": "scores format",
                            "uri": "http://edamontology.org/format_1999"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://cameo3d.org/",
    "lastUpdate": "2020-07-06T09:39:24Z",
    "name": "CAMEO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "SIB",
    "publication": [
        {
            "doi": "10.1002/prot.25431",
            "metadata": {
                "abstract": "© 2017 Wiley Periodicals, Inc.Every second year, the community experiment “Critical Assessment of Techniques for Structure Prediction” (CASP) is conducting an independent blind assessment of structure prediction methods, providing a framework for comparing the performance of different approaches and discussing the latest developments in the field. Yet, developers of automated computational modeling methods clearly benefit from more frequent evaluations based on larger sets of data. The “Continuous Automated Model EvaluatiOn (CAMEO)” platform complements the CASP experiment by conducting fully automated blind prediction assessments based on the weekly pre-release of sequences of those structures, which are going to be published in the next release of the PDB Protein Data Bank. CAMEO publishes weekly benchmarking results based on models collected during a 4-day prediction window, on average assessing ca. 100 targets during a time frame of 5 weeks. CAMEO benchmarking data is generated consistently for all participating methods at the same point in time, enabling developers to benchmark and cross-validate their method's performance, and directly refer to the benchmarking results in publications. In order to facilitate server development and promote shorter release cycles, CAMEO sends weekly email with submission statistics and low performance warnings. Many participants of CASP have successfully employed CAMEO when preparing their methods for upcoming community experiments. CAMEO offers a variety of scores to allow benchmarking diverse aspects of structure prediction methods. By introducing new scoring schemes, CAMEO facilitates new development in areas of active research, for example, modeling quaternary structure, complexes, or ligand binding sites.",
                "authors": [
                    {
                        "name": "Barbato A."
                    },
                    {
                        "name": "Behringer D."
                    },
                    {
                        "name": "Bertoni M."
                    },
                    {
                        "name": "Gumienny R."
                    },
                    {
                        "name": "Haas J."
                    },
                    {
                        "name": "Mostaguir K."
                    },
                    {
                        "name": "Roth S."
                    },
                    {
                        "name": "Schwede T."
                    },
                    {
                        "name": "Studer G."
                    }
                ],
                "citationCount": 44,
                "date": "2018-03-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "Continuous Automated Model EvaluatiOn (CAMEO) complementing the critical assessment of structure prediction in CASP12"
            },
            "note": "CAMEO allows many rankings according to various aspects of modeling, e.g. binding site accuracy vs all-atom model quality. Further, CAMEO features categories for protein structure prediction (3D), local quality estimation (QE) and residue-residue contact prediction (CP).",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1002/prot.25815",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.Critical blind assessment of structure prediction techniques is crucial for the scientific community to establish the state of the art, identify bottlenecks, and guide future developments. In Critical Assessment of Techniques in Structure Prediction (CASP), human experts assess the performance of participating methods in relation to the difficulty of the prediction task in a biennial experiment on approximately 100 targets. Yet, the development of automated computational modeling methods requires more frequent evaluation cycles and larger sets of data. The “Continuous Automated Model EvaluatiOn (CAMEO)” platform complements CASP by conducting fully automated blind prediction evaluations based on the weekly pre-release of sequences of those structures, which are going to be published in the next release of the Protein Data Bank (PDB). Each week, CAMEO publishes benchmarking results for predictions corresponding to a set of about 20 targets collected during a 4-day prediction window. CAMEO benchmarking data are generated consistently for all methods at the same point in time, enabling developers to cross-validate their method's performance, and referring to their results in publications. Many successful participants of CASP have used CAMEO—either by directly benchmarking their methods within the system or by comparing their own performance to CAMEO reference data. CAMEO offers a variety of scores reflecting different aspects of structure modeling, for example, binding site accuracy, homo-oligomer interface quality, or accuracy of local model confidence estimates. By introducing the \"bestSingleTemplate\" method based on structure superpositions as a reference for the accuracy of 3D modeling predictions, CAMEO facilitates objective comparison of techniques and fosters the development of advanced methods.",
                "authors": [
                    {
                        "name": "Ackermann F."
                    },
                    {
                        "name": "Barbato A."
                    },
                    {
                        "name": "Bertoni M."
                    },
                    {
                        "name": "Gumienny R."
                    },
                    {
                        "name": "Haas J."
                    },
                    {
                        "name": "Schwede T."
                    },
                    {
                        "name": "Smolinski A."
                    },
                    {
                        "name": "Studer G."
                    },
                    {
                        "name": "Tauriello G."
                    }
                ],
                "citationCount": 9,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Proteins: Structure, Function and Bioinformatics",
                "title": "Introducing “best single template” models as reference baseline for the Continuous Automated Model Evaluation (CAMEO)"
            },
            "note": "CAMEO allows many rankings according to various aspects of modeling, e.g. binding site accuracy vs all-atom model quality. Further, CAMEO features categories for protein structure prediction (3D), local quality estimation (QE) and residue-residue contact prediction (CP).",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/database/bat031",
            "metadata": {
                "abstract": "The Protein Model Portal (PMP) has been developed to foster effective use of 3D molecular models in biomedical research by providing convenient and comprehensive access to structural information for proteins. Both experimental structures and theoretical models for a given protein can be searched simultaneously and analyzed for structural variability. By providing a comprehensive view on structural information, PMP offers the opportunity to apply consistent assessment and validation criteria to the complete set of structural models available for proteins. PMP is an open project so that new methods developed by the community can contribute to PMP, for example, new modeling servers for creating homology models and model quality estimation servers for model validation. The accuracy of participating modeling servers is continuously evaluated by the Continuous Automated Model EvaluatiOn (CAMEO) project. The PMP offers a unique interface to visualize structural coverage of a protein combining both theoretical models and experimental structures, allowing straightforward assessment of the model quality and hence their utility. The portal is updated regularly and actively developed to include latest methods in the field of computational structural biology.",
                "authors": [
                    {
                        "name": "Arnold K."
                    },
                    {
                        "name": "Bordoli L."
                    },
                    {
                        "name": "Haas J."
                    },
                    {
                        "name": "Kiefer F."
                    },
                    {
                        "name": "Roth S."
                    },
                    {
                        "name": "Schmidt T."
                    },
                    {
                        "name": "Schwede T."
                    }
                ],
                "citationCount": 191,
                "date": "2013-12-01T00:00:00Z",
                "journal": "Database",
                "title": "The protein model portal - A comprehensive resource for protein structure and model information"
            },
            "pmid": "23624946",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
