
{
    "credit": [
        {
            "name": "SIB Swiss Institute of Bioinformatics",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "torsten.schwede@unibas.ch",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://www.cameo3d.org/cameong_help/"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "Analyze protein structure predictions with PDB experimental structures as gold standard",
            "operation": [
                {
                    "term": "Protein model validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structural quality report",
                        "uri": "http://edamontology.org/data_1539"
                    },
                    "format": [
                        {
                            "term": "scores format",
                            "uri": "http://edamontology.org/format_1999"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "elixirNode": [
            "Switzerland"
        ],
        "elixirPlatform": [
            "Tools"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structure analysis",
                "uri": "http://edamontology.org/topic_0081"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Protein Model Portal (PMP) has been developed to foster effective use of 3D molecular models in biomedical research by providing convenient and comprehensive access to structural information for proteins. Both experimental structures and theoretical models for a given protein can be searched simultaneously and analyzed for structural variability. By providing a comprehensive view on structural information, PMP offers the opportunity to apply consistent assessment and validation criteria to the complete set of structural models available for proteins. PMP is an open project so that new methods developed by the community can contribute to PMP, for example, new modeling servers for creating homology models and model quality estimation servers for model validation. The accuracy of participating modeling servers is continuously evaluated by the Continuous Automated Model EvaluatiOn (CAMEO) project. The PMP offers a unique interface to visualize structural coverage of a protein combining both theoretical models and experimental structures, allowing straightforward assessment of the model quality and hence their utility. The portal is updated regularly and actively developed to include latest methods in the field of computational structural biology.",
            "authors": [
                "Haas J.",
                "Roth S.",
                "Arnold K.",
                "Kiefer F.",
                "Schmidt T.",
                "Bordoli L.",
                "Schwede T."
            ],
            "cit_count": 143,
            "doi": "10.1093/database/bat031",
            "journal": "Database",
            "pmid": "23624946",
            "title": "The protein model portal - A comprehensive resource for protein structure and model information",
            "type": "Primary",
            "year": "2013-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cameo",
        "biotoolsID": "cameo",
        "description": "Continuously evaluates the accuracy and reliability of protein structure prediction methods in a fully automated manner. CAMEO currently assesses predictions in two categories (3D protein structure modeling and protein structure model quality predictions). The project is open to everyone and has been used by several method developer groups to benchmark and monitor their servers and new developments.",
        "homepage": "http://cameo3d.org/",
        "name": "CAMEO",
        "version": [
            "1"
        ]
    }
}