{
    "additionDate": "2022-10-07T08:58:27.618676Z",
    "biotoolsCURIE": "biotools:crisprcasstack",
    "biotoolsID": "crisprcasstack",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Guohua Wang"
        },
        {
            "name": "Tianjiao Zhang"
        }
    ],
    "description": "CRISPRCasStack is a toolkit capable of accurately identifying Cas proteins and comprehensively predicting CRISPR-Cas-related components, with the goal of accurately identifying potential Cas proteins that cannot currently be identified based on homology through a machine learning-based approach.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yrjia1015/CRISPRCasStack",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2022-10-07T08:58:27.621243Z",
    "license": "Not licensed",
    "name": "CRISPRCasStack",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC335",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.CRISPR-Cas system is an adaptive immune system widely found in most bacteria and archaea to defend against exogenous gene invasion. One of the most critical steps in the study of exploring and classifying novel CRISPR-Cas systems and their functional diversity is the identification of Cas proteins in CRISPR-Cas systems. The discovery of novel Cas proteins has also laid the foundation for technologies such as CRISPR-Cas-based gene editing and gene therapy. Currently, accurate and efficient screening of Cas proteins from metagenomic sequences and proteomic sequences remains a challenge. For Cas proteins with low sequence conservation, existing tools for Cas protein identification based on homology cannot guarantee identification accuracy and efficiency. In this paper, we have developed a novel stacking-based ensemble learning framework for Cas protein identification, called CRISPRCasStack. In particular, we applied the SHAP (SHapley Additive exPlanations) method to analyze the features used in CRISPRCasStack. Sufficient experimental validation and independent testing have demonstrated that CRISPRCasStack can address the accuracy deficiencies and inefficiencies of the existing state-of-the-art tools. We also provide a toolkit to accurately identify and analyze potential Cas proteins, Cas operons, CRISPR arrays and CRISPR-Cas locus in prokaryotic sequences. The CRISPRCasStack toolkit is available at https://github.com/yrjia1015/CRISPRCasStack.",
                "authors": [
                    {
                        "name": "Jia Y."
                    },
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Xu D."
                    },
                    {
                        "name": "Zhang T."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "date": "2022-09-20T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "CRISPRCasStack: a stacking strategy-based ensemble learning framework for accurate identification of Cas proteins"
            },
            "pmid": "35998924"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
