
{
    "credit": [
        {
            "name": "Pantelis G. Bagos, Ph.D.",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.compgen.org/contact"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.compgen.org/tools/metatrend"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/metatrend-estimate-trends-cumulative-meta-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Objective: Cumulative meta-analysis allows the evaluation of a study's contribution to the combined effect of the preceding research. It accrues evidence, gradually adding studies one at a time and provides updated estimates along with confidence intervals whenever new evidence emerges. In many research areas, a temporal evolution of the effect size (ES) is present, leading to diminishing effects and would be advantageous to have methods capable of detecting it. Study Design and Setting: We propose a simple regression-based approach for detecting trends in cumulative meta-analysis. We use the combined ES of studies published up to a particular time, as dependent variable and the rank of the published studies as independent variable, in a weighted linear regression to detect a possible trend over time. The correlation between successive ESs used in the regression, is dealt by introducing a first-order autoregressive coefficient using Generalized Least Squares. Results: Application in several published meta-analyses of genetic association studies provides encouraging results, outperforming the commonly used method of comparing the results of first vs. subsequent studies. Conclusion: The particular method is intuitive, easily implemented and allows drawing conclusions based on formal statistical tests. A STATA command is available at http://bioinformatics.biol.uoa.gr/∼pbagos/metatrend/. © 2009 Elsevier Inc. All rights reserved.",
            "authors": [
                "Bagos P.G.",
                "Nikolopoulos G.K."
            ],
            "cit_count": 26,
            "journal": "Journal of Clinical Epidemiology",
            "pmid": "19345563",
            "title": "Generalized least squares for assessing trends in cumulative meta-analysis with applications in genetic epidemiology",
            "year": "2009-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metatrend",
        "biotoolsID": "metatrend",
        "description": "STATA program for estimating trends in cumulative meta-analysis. The author propose a simple and formal regression-based approach for detecting trends in cumulative meta-analysis.",
        "homepage": "http://www.compgen.org/tools/metatrend",
        "name": "metatrend"
    }
}