{
    "additionDate": "2021-03-19T08:59:57Z",
    "biotoolsCURIE": "biotools:pathofusion",
    "biotoolsID": "pathofusion",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xiu.wang@sydney.edu.au",
            "name": "Xiuying Wang",
            "typeEntity": "Person"
        },
        {
            "email": "manuel.graeber@sydney.edu.au",
            "name": "Manuel B. Graeber",
            "typeEntity": "Person"
        }
    ],
    "description": "An Open-Source AI Framework for Recognition of Pathomorphological Features and Mapping of Immunohistochemical Data.\n\nA deep learning based framework for recognition and fusion of multimodal histopathological images.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/guoqingbao/Pathofusion/tree/master/data"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Heat map generation",
                    "uri": "http://edamontology.org/operation_0531"
                }
            ]
        }
    ],
    "homepage": "https://github.com/guoqingbao/Pathofusion",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-03-27T12:40:58Z",
    "license": "Apache-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/guoqingbao/Patholabelling"
        }
    ],
    "name": "PathoFusion",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/CANCERS13040617",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.We have developed a platform, termed PathoFusion, which is an integrated system for marking, training, and recognition of pathological features in whole‐slide tissue sections. The platform uses a bifocal convolutional neural network (BCNN) which is designed to simultaneously capture both index and contextual feature information from shorter and longer image tiles, respectively. This is analogous to how a microscopist in pathology works, identifying a cancerous morphological feature in the tissue context using first a narrow and then a wider focus, hence bifocal. Adjacent tissue sections obtained from glioblastoma cases were processed for hematoxylin and eosin (H&E) and immunohistochemical (CD276) staining. Image tiles cropped from the digitized images based on markings made by a consultant neuropathologist were used to train the BCNN. PathoFusion demonstrated its ability to recognize malignant neuropathological features autonomously and map immunohistochemical data simultaneously. Our experiments show that PathoFusion achieved areas under the curve (AUCs) of 0.985 ± 0.011 and 0.988 ± 0.001 in patch‐level recognition of six typical pathomorphological features and detection of associated immunoreactivity, respectively. On this basis, the system further correlated CD276 immunoreactivity to abnormal tumor vasculature. Corresponding feature distributions and overlaps were visualized by heatmaps, permitting high‐resolution qualitative as well as quantitative morphological analyses for entire histological slides. Recognition of more user‐defined pathomorphological features can be added to the system and included in future tissue analyses. Integration of PathoFusion with the day‐to‐day service workflow of a (neuro)pathology department is a goal. The software code for PathoFusion is made publicly available.",
                "authors": [
                    {
                        "name": "Bao G."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Xu R."
                    },
                    {
                        "name": "Loh C."
                    },
                    {
                        "name": "Adeyinka O.D."
                    },
                    {
                        "name": "Pieris D.A."
                    },
                    {
                        "name": "Cherepanoff S."
                    },
                    {
                        "name": "Gracie G."
                    },
                    {
                        "name": "Lee M."
                    },
                    {
                        "name": "McDonald K.L."
                    },
                    {
                        "name": "Nowak A.K."
                    },
                    {
                        "name": "Banati R."
                    },
                    {
                        "name": "Buckland M.E."
                    },
                    {
                        "name": "Graeber M.B."
                    }
                ],
                "date": "2021-02-02T00:00:00Z",
                "journal": "Cancers",
                "title": "Pathofusion: An open‐source AI framework for recognition of pathomorphological features and mapping of immunohistochemical data"
            },
            "pmcid": "PMC7913958",
            "pmid": "33557152"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}