{
    "additionDate": "2018-04-22T15:20:13Z",
    "biotoolsCURIE": "biotools:imirp",
    "biotoolsID": "imirp",
    "credit": [
        {
            "email": "bobchow@uvic.ca",
            "name": "Robert L. Chow",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web application designed to selectively mutate predicted miRNA target sites while ensuring that predicted target sites for other miRNAs, termed illegitimate target sites, are not created in the process.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/imirp/imirp-app"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                }
            ]
        }
    ],
    "homepage": "http://imirp.org/",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "ImiRP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-016-1057-Y",
            "metadata": {
                "abstract": "© 2016 Ryan et al.Background: MicroRNAs (miRNAs) are small ~22 nucleotide non-coding RNAs that function as post-transcriptional regulators of messenger RNA (mRNA) through base-pairing to 6-8 nucleotide long target sites, usually located within the mRNA 3' untranslated region. A common approach to validate and probe microRNA-mRNA interactions is to mutate predicted target sites within the mRNA and determine whether it affects miRNA-mediated activity. The introduction of miRNA target site mutations, however, is potentially problematic as it may generate new, \"illegitimate sites\" target sites for other miRNAs, which may affect the experimental outcome. While it is possible to manually generate and check single miRNA target site mutations, this process can be time consuming, and becomes particularly onerous and error prone when multiple sites are to be mutated simultaneously. We have developed a modular Java-based system called ImiRP (Illegitimate miRNA Predictor) to solve this problem and to facilitate miRNA target site mutagenesis. Results: The ImiRP interface allows users to input a sequence of interest, specify the locations of multiple predicted target sites to mutate, and set parameters such as species, mutation strategy, and disallowed illegitimate target site types. As mutant sequences are generated, ImiRP utilizes the miRBase high confidence miRNA dataset to identify illegitimate target sites in each mutant sequence by comparing target site predictions between input and mutant sequences. ImiRP then assembles a final mutant sequence in which all specified target sites have been mutated. Conclusions: ImiRP is a mutation generator program that enables selective disruption of specified miRNA target sites while ensuring predicted target sites for other miRNAs are not inadvertently created. ImiRP supports mutagenesis of single and multiple miRNA target sites within a given sequence, including sites that overlap. This software will be particularly useful for studies looking at microRNA cooperativity, where mutagenesis of multiple microRNA target sites may be desired. The software is available at imirp.org and is available open source for download through GitHub ( https://github.com/imirp ).",
                "authors": [
                    {
                        "name": "Ryan B.C."
                    },
                    {
                        "name": "Werner T.S."
                    },
                    {
                        "name": "Howard P.L."
                    },
                    {
                        "name": "Chow R.L."
                    }
                ],
                "citationCount": 11,
                "date": "2016-04-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ImiRP: A computational approach to microRNA target site mutation"
            },
            "pmcid": "PMC4848830",
            "pmid": "27122020"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}