{
    "additionDate": "2022-11-07T07:48:56.265115Z",
    "biotoolsCURIE": "biotools:icbatlas",
    "biotoolsID": "icbatlas",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "An-Yuan Guo"
        },
        {
            "name": "Mei Yang"
        }
    ],
    "description": "Immune Checkpoint Blockade therapy Atlas (ICBatlas) is a database providing comprehensive expression resources and functional analysis for patients with ICB therapy. It also compares the expression between ICB groups of Response versus Non-Response (R vs NR), as well as groups between Pre-treatment and On-treatment (Pre vs On).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.life.hust.edu.cn/ICBatlas/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:22:18.946178Z",
    "license": "Other",
    "name": "ICBatlas",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1158/2326-6066.cir-22-0249",
            "metadata": {
                "abstract": "Immune checkpoint blockade (ICB) therapy provides remarkable clinical benefits for multiple cancer types. Much work is currently being conducted to investigate the mechanisms of ICB therapy at the transcriptional level. Integrating the data produced by these studies will help us give more insight into the transcriptomic features of ICB therapy. We collected the transcriptome and clinical data of ICB-treated patient samples from the Gene Expression Omnibus, ArrayExpress, The Cancer Genome Atlas, and dbGaP databases. On the basis of the clinical information, all samples are initially classified into response/ nonresponse or pretreatment/on-treatment groups. Differential expression, pathway enrichment, and immune cell infiltration analyses are performed between the samples from different groups. We also introduce the Response Score (RS) calculated by integrating the variability degree and the frequency of the dysregulated genes in the responders to evaluate the impact of gene expression on the response. Finally, all the abovementioned contents are integrated into the ICBatlas database. ICBatlas provides the transcriptome features of ICB therapy through the analysis of 1,515 ICB-treated samples from 25 studies across nine cancer types. The data in ICBatlas include clinical outcomes, treatment-related genes, biological pathways, and immune cell infiltration. Users can investigate the abovementioned transcriptome features in the response (R vs. NR) or treatment (Pre vs. On) modules at the data set, cancer type, or immune checkpoint level and compare the degree of gene impact on the response in the RS module. ICBatlas is the first database to show the transcriptome features on ICB therapy in human cancers and freely available at http://bioinfo.life.hust. edu.cn/ICBatlas/.",
                "authors": [
                    {
                        "name": "FaiKwok H."
                    },
                    {
                        "name": "Feng J."
                    },
                    {
                        "name": "Guo A.-Y."
                    },
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Luo M."
                    },
                    {
                        "name": "Miao Y.-R."
                    },
                    {
                        "name": "Xie G.-Y."
                    },
                    {
                        "name": "Yang M."
                    }
                ],
                "citationCount": 20,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Cancer Immunology Research",
                "title": "ICBatlas: A Comprehensive Resource for Depicting Immune Checkpoint Blockade Therapy Characteristics from Transcriptome Profiles"
            },
            "pmid": "36095221"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
