{
    "additionDate": "2020-01-14T19:48:06Z",
    "biotoolsCURIE": "biotools:PACKMAN",
    "biotoolsID": "PACKMAN",
    "confidence_flag": "tool",
    "description": "Characterizing and Predicting Protein Hinges for Mechanistic Insight.\n\nPACKMAN: PACKing and Motion ANalysis",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Residue packing validation",
                    "uri": "http://edamontology.org/operation_1843"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://PACKMAN.bb.iastate.edu/",
    "lastUpdate": "2021-01-04T15:00:01Z",
    "name": "PACKMAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2019.11.018",
            "metadata": {
                "abstract": "© 2019The functioning of proteins requires highly specific dynamics, which depend critically on the details of how amino acids are packed. Hinge motions are the most common type of large motion, typified by the opening and closing of enzymes around their substrates. The packing and geometries of residues are characterized here by graph theory. This characterization is sufficient to enable reliable hinge predictions from a single static structure, and notably, this can be from either the open or the closed form of a structure. This new method to identify hinges within protein structures is called PACKMAN. The predicted hinges are validated by using permutation tests on B-factors. Hinge prediction results are compared against lists of manually curated hinge residues, and the results suggest that PACKMAN is robust enough to reproduce the known conformational changes and is able to predict hinge regions equally well from either the open or the closed forms of a protein. A group of 167 protein pairs with open and closed structures has been investigated Examples are shown for several additional proteins, including Zika virus nonstructured (NS) proteins where there are 6 hinge regions in the NS5 protein, 5 hinge regions in the NS2B bound in the NS3 protease complex and 5 hinges in the NS3- helicase protein. Results obtained from this method can be important for generating conformational ensembles of protein targets for drug design. PACKMAN is freely accessible at (https://PACKMAN.bb.iastate.edu/).",
                "authors": [
                    {
                        "name": "Jernigan R.L."
                    },
                    {
                        "name": "Khade P.M."
                    },
                    {
                        "name": "Kumar A."
                    }
                ],
                "citationCount": 5,
                "date": "2020-01-17T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "Characterizing and Predicting Protein Hinges for Mechanistic Insight"
            },
            "pmid": "31786268"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
