{"credit":[],"function":[{"operation":[{"term":"Standardisation and normalisation","uri":"http://edamontology.org/operation_3435"},{"term":"Aggregation","uri":"http://edamontology.org/operation_3436"}]}],"labels":{"topic":[{"term":"Psychiatry","uri":"http://edamontology.org/topic_3419"},{"term":"Neurobiology","uri":"http://edamontology.org/topic_3304"},{"term":"Endocrinology and metabolism","uri":"http://edamontology.org/topic_3407"},{"term":"Public health and epidemiology","uri":"http://edamontology.org/topic_3305"},{"term":"Critical care medicine","uri":"http://edamontology.org/topic_3403"}]},"publication":[{"abstract":"© 2019 AMPCo Pty LtdMood and psychotic syndromes most often emerge during adolescence and young adulthood, a period characterised by major physical and social change. Consequently, the effects of adolescent-onset mood and psychotic syndromes can have long term consequences. A key clinical challenge for youth mental health is to develop and test new systems that align with current evidence for comorbid presentations and underlying neurobiology, and are useful for predicting outcomes and guiding decisions regarding the provision of appropriate and effective care. Our highly personalised and measurement-based care model includes three core concepts: ▶ A multidimensional assessment and outcomes framework that includes: social and occupational function; self-harm, suicidal thoughts and behaviour; alcohol or other substance misuse; physical health; and illness trajectory. ▶ Clinical stage. ▶ Three common illness subtypes (psychosis, anxious depression, bipolar spectrum) based on proposed pathophysiological mechanisms (neurodevelopmental, hyperarousal, circadian). The model explicitly aims to prevent progression to more complex and severe forms of illness and is better aligned to contemporary models of the patterns of emergence of psychopathology. Inherent within this highly personalised approach is the incorporation of other evidence-based processes, including real-time measurement-based care as well as utilisation of multidisciplinary teams of health professionals. Data-driven local system modelling and personalised health information technologies provide crucial infrastructure support to these processes for better access to, and higher quality, mental health care for young people. Chapter 1: Multidimensional outcomes in youth mental health care: what matters and why?: Mood and psychotic syndromes present one of the most serious public health challenges that we face in the 21st century. Factors including prevalence, age of onset, and chronicity contribute to substantial burden and secondary risks such as alcohol or other substance misuse. Mood and psychotic syndromes most often emerge during adolescence and young adulthood, a period characterised by major physical and social change; thus, effects can have long term consequences. We propose five key domains which make up a multidimensional outcomes framework that aims to address the specific needs of young people presenting to health services with emerging mental illness. These include social and occupational function; self-harm, suicidal thoughts and behaviours; alcohol or other substance misuse; physical health; and illness type, stage and trajectory. Impairment and concurrent morbidity are well established in young people by the time they present for mental health care. Despite this, services and health professionals tend to focus on only one aspect of the presentation — illness type, stage and trajectory — and are often at odds with the preferences of young people and their families. There is a need to address the disconnect between mental health, physical health and social services and interventions, to ensure that youth mental health care focuses on the outcomes that matter to young people. Chapter 2: Combining clinical stage and pathophysiological mechanisms to understand illness trajectories in young people with emerging mood and psychotic syndromes : Traditional diagnostic classification systems for mental disorders map poorly onto the early stages of illness experienced by young people, and purport categorical distinctions that are not readily supported by research into genetic, environmental and neurobiological risk factors. Consequently, a key clinical challenge in youth mental health is to develop and test new classification systems that align with current evidence on comorbid presentations, are consistent with current understanding of underlying neurobiology, and provide utility for predicting outcomes and guiding decisions regarding the provision of appropriate and effective care. This chapter outlines a transdiagnostic framework for classifying common adolescent-onset mood and psychotic syndromes, combining two independent but complementary dimensions: clinical staging, and three proposed pathophysiological mechanisms. Clinical staging reflects the progression of mental disorders and is in line with the concept used in general medicine, where more advanced stages are associated with a poorer prognosis and a need for more intensive interventions with a higher risk-to-benefit ratio. The three proposed pathophysiological mechanisms are neurodevelopmental abnormalities, hyperarousal and circadian dysfunction, which, over time, have illness trajectories (or pathways) to psychosis, anxious depression and bipolar spectrum disorders, respectively. The transdiagnostic framework has been evaluated in young people presenting to youth mental health clinics of the University of Sydney's Brain and Mind Centre, alongside a range of clinical and objective measures. Our research to date provides support for this framework, and we are now exploring its application to the development of more personalised models of care. Chapter 3: A comprehensive assessment framework for youth mental health: guiding highly personalised and measurement-based care using multidimensional and objective measures : There is an urgent need for improved care for young people with mental health problems, in particular those with subthreshold mental disorders that are not sufficiently severe to meet traditional diagnostic criteria. New comprehensive assessment frameworks are needed to capture the biopsychosocial profile of a young person to drive highly personalised and measurement-based mental health care. We present a range of multidimensional measures involving five key domains: social and occupational function; self-harm, suicidal thoughts and behaviours; alcohol or other substance misuse; physical health; and illness type, stage and trajectory. Objective measures include: neuropsychological function; sleep–wake behaviours and circadian rhythms; metabolic and immune markers; and brain structure and function. The recommended multidimensional measures facilitate the development of a comprehensive clinical picture. The objective measures help to further develop informative and novel insights into underlying pathophysiological mechanisms and illness trajectories to guide personalised care plans. A panel of specific multidimensional and objective measures are recommended as standard clinical practice, while others are recommended secondarily to provide deeper insights with the aim of revealing alternative clinical paths for targeted interventions and treatments matched to the clinical stage and proposed pathophysiological mechanisms of the young person. Chapter 4: Personalising care options in youth mental health: using multidimensional assessment, clinical stage, pathophysiological mechanisms, and individual illness trajectories to guide treatment selection : New models of mental health care for young people require that interventions be matched to illness type, clinical stage, underlying pathophysiological mechanisms and individual illness trajectories. Narrow syndrome-focused classifications often direct clinical attention away from other key factors such as functional impairment, self-harm and suicidality, alcohol or other substance misuse, and poor physical health. By contrast, we outline a treatment selection guide for early intervention for adolescent-onset mood and psychotic syndromes (ie, active treatments and indicated and more specific secondary prevention strategies). This guide is based on experiences with the Brain and Mind Centre's highly personalised and measurement-based care model to manage youth mental health. The model incorporates three complementary core concepts: ▶A multidimensional assessment and outcomes framework including: social and occupational function; self-harm, suicidal thoughts and behaviours; alcohol or other substance misuse; physical health; and illness trajectory. ▶Clinical stage. ▶Three common illness subtypes (psychosis, anxious depression, bipolar spectrum) based on three underlying pathophysiological mechanisms (neurodevelopmental, hyperarousal, circadian). These core concepts are not mutually exclusive and together may facilitate improved outcomes through a clinical stage-appropriate and transdiagnostic framework that helps guide decisions regarding the provision of appropriate and effective care options. Given its emphasis on adolescent-onset mood and psychotic syndromes, the Brain and Mind Centre's model of care also respects a fundamental developmental perspective — categorising childhood problems (eg, anxiety and neurodevelopmental difficulties) as risk factors and respecting the fact that young people are in a period of major biological and social transition. Based on these factors, a range of social, psychological and pharmacological interventions are recommended, with an emphasis on balancing the personal benefit-to-cost ratio. Chapter 5: A service delivery model to support highly personalised and measurement-based care in youth mental health : Over the past decade, we have seen a growing focus on creating mental health service delivery models that better meet the unique needs of young Australians. Recent policy directives from the Australian Government recommend the adoption of stepped-care services to improve the appropriateness of care, determined by severity of need. Here, we propose that a highly personalised approach enhances stepped-care models by incorporating clinical staging and a young person's current and multidimensional needs. It explicitly aims to prevent progression to more complex and severe forms of illness and is better aligned to contemporary models of the patterns of emergence of psychopathology. Inherent within a highly personalised approach is the incorporation of other evidence-based processes, including real-time measurement-based care and use of multidisciplinary teams of health professionals. Data-driven local system modelling and personalised health information technologies provide crucial infrastructure support to these processes for better access to, and higher quality of, mental health care for young people.","authors":["Hickie I.B.","Scott E.M.","Cross S.P.","Iorfino F.","Davenport T.A.","Guastella A.J.","Naismith S.L.","Carpenter J.S.","Rohleder C.","Crouse J.J.","Hermens D.F.","Koethe D.","Markus Leweke F.","Tickell A.M.","Sawrikar V.","Scott J."],"cit_count":1,"doi":"10.5694/MJA2.50383","journal":"Medical Journal of Australia","pmid":"31679171","title":"Right care, first time: a highly personalised and measurement-based care model to manage youth mental health","year":"2019-11-01"}],"summary":{"biotoolsCURIE":"biotools:PERSONALISED_MEASUREMENT-BASED_CARE_YOUTH_MENTAL","biotoolsID":"PERSONALISED_MEASUREMENT-BASED_CARE_YOUTH_MENTAL","description":"a highly personalised and measurement-based care model to manage youth mental health.\n\nMood and psychotic syndromes most often emerge during adolescence and young adulthood, a period characterised by major physical and social change. Consequently, the effects of adolescent-onset mood and psychotic syndromes can have long term consequences. A key clinical challenge for youth mental health is to develop and test new systems that align with current evidence for comorbid presentations and underlying neurobiology, and are useful for predicting outcomes and guiding decisions regarding the provision of appropriate and effective care.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'adolescent-onset mood psychotic syndromes', 'PERSONALISED MEASUREMENT-BASED CARE YOUTH', 'MEASUREMENT-BASED CARE YOUTH MENTAL', 'adolescent-onset mood psychotic'","homepage":"https://www.ncbi.nlm.nih.gov/pubmed/?term=31679171","name":"PERSONALISED MEASUREMENT-BASED CARE YOUTH MENTAL"}}