{
    "additionDate": "2019-11-14T19:35:40Z",
    "biotoolsCURIE": "biotools:ChaperISM",
    "biotoolsID": "ChaperISM",
    "confidence_flag": "tool",
    "description": "improved chaperone binding prediction using position-independent scoring matrices | ChaperISM is an algorithm to identify Hsp70 binding sequences in proteins. It uses a position-independent scoring matrix which was trained on either qualitative or quantitative chemiluminescence data previously published, obtained from interaction between DnaK and different ligands. Both versions of ChaperISM, qualitative or quantitative, resulted in an improved performance in comparison to other state-of-the-art chaperone binding predictors",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinfLab/ChaperISM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-10T16:23:45Z",
    "name": "ChaperISM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ670",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Understanding the mechanisms of client protein interaction with Hsp70 chaperones is essential to analyze the complex dynamics in the context of normal or dysregulated metabolism. Because Hsp70 can bind millions of proteins, including key molecules involved in processes of stemness, tumorigenesis and survival, in silico prediction of Hsp70 interactions has great value in validating possible new clients. Currently, two algorithms are available to predict binding to DnaK-the bacterial Hsp70-but both are based on amino acid sequence and energy calculations of qualitative information-binders and non-binders. Results: We introduce a new algorithm to identify Hsp70 binding sequences in proteins-ChaperISM-a position-independent scoring matrix trained on either qualitative or quantitative chemiluminescence data previously published, which were obtained from the interaction between DnaK and different ligands. Both versions of ChaperISM, qualitative or quantitative, resulted in an improved performance in comparison to other state-of-the-art chaperone binding predictors.",
                "authors": [
                    {
                        "name": "Gutierres M.B.B."
                    },
                    {
                        "name": "Bonorino C.B.C."
                    },
                    {
                        "name": "Rigo M.M."
                    }
                ],
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ChaperISM: Improved chaperone binding prediction using position-independent scoring matrices"
            },
            "pmid": "31504177"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}