{
    "additionDate": "2021-01-18T06:57:27Z",
    "biotoolsCURIE": "biotools:llpsdb",
    "biotoolsID": "llpsdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhuqingzhang@ucas.ac.cn",
            "name": "Zhuqing Zhang",
            "orcidid": "https://orcid.org/0000-0003-3514-834X",
            "typeEntity": "Person"
        }
    ],
    "description": "A database of proteins undergoing liquid-liquid phase separation in vitro.\n\nLLPSDB contains LLPS related proteins together with the corresponding phase separation conditions validated by experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://bio-comp.org.cn/llpsdb",
    "lastUpdate": "2021-02-17T07:14:04Z",
    "name": "LLPSDB",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ778",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Liquid-liquid phase separation (LLPS) leads to a conversion of homogeneous solution into a dense phase that often resembles liquid droplets, and a dilute phase. An increasing number of investigations have shown that biomolecular condensates formed by LLPS play important roles in both physiology and pathology. It has been suggested the phase behavior of proteins would be not only determined by sequences, but controlled by micro-environmental conditions. Here, we introduce LLPSDB (http://bio-comp.ucas.ac.cn/llpsdb or http://bio-comp.org.cn/llpsdb), a web-accessible database providing comprehensive, carefully curated collection of proteins involved in LLPS as well as corresponding experimental conditions in vitro from published literatures. The current release of LLPSDB incorporates 1182 entries with 273 independent proteins and 2394 specific conditions. The database provides a variety of data including biomolecular information (protein sequence, protein modification, nucleic acid, etc.), specific phase separation information (experimental conditions, phase behavior description, etc.) and comprehensive annotations. To our knowledge, LLPSDB is the first available database designed for LLPS related proteins specifically. It offers plenty of valuable resources for exploring the relationship between protein sequence and phase behavior, and will enhance the development of phase separation prediction methods, which may further provide more insights into a comprehensive understanding of LLPS in cellular function and related diseases.",
                "authors": [
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Peng X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Tang W."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Huang J."
                    },
                    {
                        "name": "Qi Y."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 25,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LLPSDB: A database of proteins undergoing liquid-liquid phase separation in vitro"
            },
            "pmcid": "PMC6943074",
            "pmid": "31906602"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}