{"credit":[{"email":"T.Abeel@tudelft.nl","name":"Thomas Abeel","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://bioinformatics.tudelft.nl/"}],"documentation":[{"type":"GENERAL","url":"https://trac.nbic.nl/mariboes/"}],"function":[{"operation":[{"term":"Modelling and simulation","uri":"http://edamontology.org/operation_2426"}]}],"labels":{"language":["MATLAB"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Enzymes","uri":"http://edamontology.org/topic_0821"},{"term":"Function analysis","uri":"http://edamontology.org/topic_1775"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mariboes-2-1-0-metabolite-reaction-inference-based-enzyme-specificities.html"}],"publication":[{"abstract":"Motivation: Many enzymes are not absolutely specific, or even promiscuous: they can catalyze transformations of more compounds than the traditional ones as listed in, e.g. KEGG. This information is currently only available in databases, such as the BRENDA enzyme activity database. In this article, we propose to model enzyme aspecificity by predicting whether an input compound is likely to be transformed by a certain enzyme. Such a predictor has many applications, for example, to complete reconstructed metabolic networks, to aid in metabolic engineering or to help identify unknown peaks in mass spectra. Results: We have developed a system for metabolite and reaction inference based on enzyme specificities (MaRIboES). It employs structural and stereochemistry similarity measures and molecular fingerprints to generalize enzymatic reactions based on data available in BRENDA. Leave-one-out cross-validation shows that 80% of known reactions are predicted well. Application to the yeast glycolytic and pentose phosphate pathways predicts a large number of known and new reactions, often leading to the formation of novel compounds, as well as a number of interesting bypasses and cross-links. © The Author(s) 2009. Published by Oxford University Press.","authors":["De Groot M.J.L.","Van Berlo R.J.P.","Van Winden W.A.","Verheijen P.J.T.","Reinders M.J.T.","De Ridder D."],"cit_count":12,"journal":"Bioinformatics","pmid":"19696044","title":"Metabolite and reaction inference based on enzyme specificities","year":"2009-11-15"}],"summary":{"biotoolsCURIE":"biotools:mariboes","biotoolsID":"mariboes","description":"Algorithm for metabolite and reaction inference based on enzyme specificities. It has many applications, for example to complete reconstructed metabolic networks, to aid in metabolic engineering or to help identify unknown peaks in mass spectra. It employs structural and stereochemistry similarity measures and molecular fingerprints to generalise enzymatic reactions based on data available in BRENDA.","homepage":"https://trac.nbic.nl/mariboes/","name":"MaRIboES"}}