{
    "additionDate": "2018-05-09T15:50:32Z",
    "biotoolsCURIE": "biotools:larva",
    "biotoolsID": "larva",
    "credit": [
        {
            "email": "mark.gerstein@yale.edu",
            "name": "Mark Gerstein",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "An integrative framework for large-scale analysis of recurrent variants in noncoding annotations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://larva.gersteinlab.org/src-README.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "http://larva.gersteinlab.org/",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "LARVA",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/NAR/GKV803",
            "metadata": {
                "abstract": "© The Author(s) 2015.In cancer research, background models for mutation rates have been extensively calibrated in coding regions, leading to the identification of many driver genes, recurrentlymutatedmore than expected. Noncoding regions are also associated with disease; however, background models for them have not been investigated in as much detail. This is partially due to limited noncoding functional annotation. Also, great mutation heterogeneity and potential correlations between neighboring sites give rise to substantial overdispersion in mutation count, resulting in problematic background rate estimation. Here, we address these issues with a new computational framework called LARVA. It integrates variants with a comprehensive set of noncoding functional elements, modeling themutation counts of the elements with a β-binomial distribution to handle overdispersion. LARVA, moreover, uses regional genomic features such as replication timing to better estimate local mutation rates and mutational hotspots. We demonstrate LARVA's effectiveness on 760 wholegenome tumor sequences, showing that it identifies well-known noncoding drivers, such as mutations in the TERT promoter. Furthermore, LARVA highlights several novel highly mutated regulatory sites that could potentially be noncoding drivers. We make LARVA available as a software tool and release our highly mutated annotations as an online resource (larva.gersteinlab.org).",
                "authors": [
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Gerstein M."
                    },
                    {
                        "name": "Khurana E."
                    },
                    {
                        "name": "Lochovsky L."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 39,
                "date": "2015-09-30T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "LARVA: An integrative framework for large-scale analysis of recurrent variants in noncoding annotations"
            },
            "pmcid": "PMC4787796",
            "pmid": "26304545"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        }
    ],
    "validated": 1
}
