{
    "accessibility": "Open access",
    "additionDate": "2022-03-16T10:16:04.479274Z",
    "biotoolsCURIE": "biotools:cmfinder",
    "biotoolsID": "cmfinder",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Walter L. Ruzzo"
        },
        {
            "name": "Zasha Weinberg"
        },
        {
            "name": "Zizhen Yao"
        }
    ],
    "description": "The cmfinder program infers an alignment and consensus secondary structure of an RNA, using unaligned sequences as input.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://sourceforge.net/projects/weinberg-cmfinder/files/cmfinder-0.4.1.18-user-manual.pdf/download"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/weinberg-cmfinder/",
    "lastUpdate": "2022-03-16T10:16:04.482511Z",
    "license": "GPL-3.0",
    "name": "cmfinder",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btk008",
            "metadata": {
                "abstract": "Motivation: The recent discoveries of large numbers of non-coding RNAs and computational advances in genome-scale RNA search create a need for tools for automatic, high quality identification and characterization of conserved RNA motifs that can be readily used for database search. Previous tools fall short of this goal. Results: CMfinder is a new tool to predict RNA motifs in unaligned sequences. It is an expectation maximization algorithm using covariance models for motif description, featuring novel integration of multiple techniques for effective search of motif space, and a Bayesian framework that blends mutual information-based and folding energy-based approaches to predict structure in a principled way. Extensive tests show that our method works well on datasets with either low or high sequence similarity, is robust to inclusion of lengthy extraneous flanking sequence and/or completely unrelated sequences, and is reasonably fast and scalable. In testing on 19 known ncRNA families, including some difficult cases with poor sequence conservation and large indels, our method demonstrates excellent average per-base-pair accuracy - 79% compared with at most 60% for alternative methods. More importantly, the resulting probabilistic model can be directly used for homology search, allowing iterative refinement of structural models based on additional homologs. We have used this approach to obtain highly accurate covariance models of known RNA motifs based on small numbers of related sequences, which identified homologs in deeply-diverged species. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Ruzzo W.L."
                    },
                    {
                        "name": "Weinberg Z."
                    },
                    {
                        "name": "Yao Z."
                    }
                ],
                "citationCount": 238,
                "date": "2006-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CMfinder - A covariance model based RNA motif finding algorithm"
            },
            "pmid": "16357030"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}
