{
    "accessibility": "Open access",
    "additionDate": "2023-01-28T13:49:02.460703Z",
    "biotoolsCURIE": "biotools:geneselectml",
    "biotoolsID": "geneselectml",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "osman.dag@hacettepe.edu.tr",
            "name": "Osman Dag",
            "typeEntity": "Person"
        }
    ],
    "description": "This web-tool enables the researchers to find differentially expressed genes using different machine learning algorithms.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://www.softmed.hacettepe.edu.tr/GeneSelectML",
    "lastUpdate": "2023-01-28T13:49:02.463681Z",
    "license": "Not licensed",
    "name": "GeneSelectML",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S11517-022-02695-W",
            "metadata": {
                "abstract": "© 2022, International Federation for Medical and Biological Engineering.Abstract: Selection of differentially expressed genes (DEGs) is a vital process to discover the causes of diseases. It has been shown that modelling of genomics data by considering relation among genes increases the predictive performance of methods compared to univariate analysis. However, there exist serious differences among most studies analyzing the same dataset for the reasons arising from the methods. Therefore, there is a strong need for easily accessible, user-friendly, and interactive tool to perform gene selection for RNA-seq data via machine learning algorithms simultaneously not to miss DEGs. We develop an open-source and freely available web-based tool for gene selection via machine learning algorithms that can deal with high performance computation. This tool includes six machine learning algorithms having different aspects. Moreover, the tool involves classical pre-processing steps; filtering, normalization, transformation, and univariate analysis. It also offers well-arranged graphical approaches; network plot, heatmap, venn diagram, and box-and-whisker plot. Gene ontology analysis is provided for both mRNA and miRNA DEGs. The implementation is carried out on Alzheimer RNA-seq data to demonstrate the use of this web-based tool. Eleven genes are suggested by at least two out of six methods. One of these genes, hsa-miR-148a-3p, might be considered as a new biomarker for Alzheimer’s disease diagnosis. Kidney Chromophobe dataset is also analyzed to demonstrate the validity of GeneSelectML web tool on a different dataset. GeneSelectML is distinguished in that it simultaneously uses different machine learning algorithms for gene selection and can perform pre-processing, graphical representation, and gene ontology analyses on the same tool. This tool is freely available at www.softmed.hacettepe.edu.tr/GeneSelectML. Graphical abstract: [Figure not available: see fulltext.].",
                "authors": [
                    {
                        "name": "Dag O."
                    },
                    {
                        "name": "Ilk O."
                    },
                    {
                        "name": "Kasikci M."
                    },
                    {
                        "name": "Yesiltepe M."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Medical and Biological Engineering and Computing",
                "title": "GeneSelectML: a comprehensive way of gene selection for RNA-Seq data via machine learning algorithms"
            },
            "pmid": "36355333"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
