{
    "additionDate": "2022-10-05T17:31:03.819435Z",
    "biotoolsCURIE": "biotools:afa-recur",
    "biotoolsID": "afa-recur",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Andrea Saglietto"
        },
        {
            "name": "Gaetano Maria De Ferrari"
        }
    ],
    "description": "AFA-Recur, a machine-learning-based probability score predicting 1-year risk of recurrent atrial arrhythmia after AF ablation",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "http://afarec.hpc4ai.unito.it/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:30:27.402565Z",
    "license": "Not licensed",
    "name": "AFA-Recur",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/europace/euac145",
            "metadata": {
                "abstract": "Aims: Atrial fibrillation (AF) recurrence during the first year after catheter ablation remains common. Patient-specific prediction of arrhythmic recurrence would improve patient selection, and, potentially, avoid futile interventions. Available prediction algorithms, however, achieve unsatisfactory performance. Aim of the present study was to derive from ESC-EHRA Atrial Fibrillation Ablation Long-Term Registry (AFA-LT) a machine-learning scoring system based on pre-procedural, easily accessible clinical variables to predict the probability of 1-year arrhythmic recurrence after catheter ablation. Methods and results: Patients were randomly split into a training (80%) and a testing cohort (20%). Four different supervised machine-learning models (decision tree, random forest, AdaBoost, and k-nearest neighbour) were developed on the training cohort and hyperparameters were tuned using 10-fold cross validation. The model with the best discriminative performance on the testing cohort (area under the curve - AUC) was selected and underwent further optimization, including re-calibration. A total of 3128 patients were included. The random forest model showed the best performance on the testing cohort; a 19-variable version achieved good discriminative performance [AUC 0.721, 95% confidence interval (CI) 0.680-0.764], outperforming existing scores (e.g. APPLE score: AUC 0.557, 95% CI 0.506-0.607). Platt scaling was used to calibrate the model. The final calibrated model was implemented in a web calculator, freely available at http://afarec.hpc4ai.unito.it/. Conclusion: AFA-Recur, a machine-learning-based probability score predicting 1-year risk of recurrent atrial arrhythmia after AF ablation, achieved good predictive performance, significantly better than currently available tools. The calculator, freely available online, allows patient-specific predictions, favouring tailored therapeutic approaches for the individual patient.",
                "authors": [
                    {
                        "name": "Anselmino M."
                    },
                    {
                        "name": "Arbelo E."
                    },
                    {
                        "name": "Blomstrom-Lundqvist C."
                    },
                    {
                        "name": "Brugada J."
                    },
                    {
                        "name": "Dagres N."
                    },
                    {
                        "name": "De Ferrari G.M."
                    },
                    {
                        "name": "Gaita F."
                    },
                    {
                        "name": "Kautzner J."
                    },
                    {
                        "name": "Maggioni A.P."
                    },
                    {
                        "name": "Saglietto A."
                    },
                    {
                        "name": "Tavazzi L."
                    }
                ],
                "citationCount": 23,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Europace",
                "title": "AFA-Recur: an ESC EORP AFA-LT registry machine-learning web calculator predicting atrial fibrillation recurrence after ablation"
            },
            "pmcid": "PMC10103564",
            "pmid": "36006664"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
