{
    "additionDate": "2019-11-14T19:47:24Z",
    "biotoolsCURIE": "biotools:FOCAL3D",
    "biotoolsID": "FOCAL3D",
    "confidence_flag": "tool",
    "description": "A 3-dimensional clustering package for single-molecule localization microscopy | Single-molecule localization microscopy (SMLM) yields an image resolution 1-2 orders of magnitude below that of conventional light microscopy, resolving fine details on intracellular structure and macromolecular organization. The massive pointillistic data sets generated by SMLM require the development of new and highly efficient quantification tools. Density based clustering algorithms, such as DBSCAN, can provide spatial statistics on protein nucleic acid aggregation or dispersion while explicitly identifying macromolecular clusters. The performance of DBSCAN, however, is typically dependent upon an arbitrary, or at least highly subjective, parametric tuning of the algorithm. Moreover, DBSCAN can be computationally expensive, which makes it arduous to evaluate on large image stacks",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/MilsteinLab/FOCAL3D",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T10:49:08Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MilsteinLab/FOCAL3D/issues"
        }
    ],
    "name": "FOCAL3D",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/777722"
        },
        {
            "doi": "10.1371/journal.pcbi.1008479",
            "metadata": {
                "abstract": "© 2020 Nino et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Single-molecule localization microscopy (SMLM) is a powerful tool for studying intracellular structure and macromolecular organization at the nanoscale. The increasingly massive pointillistic data sets generated by SMLM require the development of new and highly efficient quantification tools. Here we present FOCAL3D, an accurate, flexible and exceedingly fast (scaling linearly with the number of localizations) density-based algorithm for quantifying spatial clustering in large 3D SMLM data sets. Unlike DBSCAN, which is perhaps the most commonly employed density-based clustering algorithm, an optimum set of parameters for FOCAL3D may be objectively determined. We initially validate the performance of FOCAL3D on simulated datasets at varying noise levels and for a range of cluster sizes. These simulated datasets are used to illustrate the parametric insensitivity of the algorithm, in contrast to DBSCAN, and clustering metrics such as the F1 and Silhouette score indicate that FOCAL3D is highly accurate, even in the presence of significant background noise and mixed populations of variable sized clusters, once optimized. We then apply FOCAL3D to 3D astigmatic dSTORM images of the nuclear pore complex (NPC) in human osteosaracoma cells, illustrating both the validity of the parameter optimization and the ability of the algorithm to accurately cluster complex, heterogeneous 3D clusters in a biological dataset. FOCAL3D is provided as an open source software package written in Python.",
                "authors": [
                    {
                        "name": "Djayakarsana D."
                    },
                    {
                        "name": "Milstein J.N."
                    },
                    {
                        "name": "Nino D.F."
                    }
                ],
                "citationCount": 1,
                "date": "2020-12-08T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "FOCAL3D: A 3-dimensional clustering package for single-molecule localization microscopy"
            },
            "pmid": "33290385",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
