{
    "additionDate": "2020-01-14T09:43:46Z",
    "biotoolsCURIE": "biotools:DDR",
    "biotoolsID": "DDR",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dkbastola@unomaha.edu",
            "name": "Dhundy Bastola",
            "typeEntity": "Person"
        }
    ],
    "description": "Multiplatform biomarker identification using a data-driven approach enables single-sample classification.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/idellyzhang/DDR",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2020-12-17T14:16:51Z",
    "name": "DDR",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3140-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: High-throughput gene expression profiles have allowed discovery of potential biomarkers enabling early diagnosis, prognosis and developing individualized treatment. However, it remains a challenge to identify a set of reliable and reproducible biomarkers across various gene expression platforms and laboratories for single sample diagnosis and prognosis. We address this need with our Data-Driven Reference (DDR) approach, which employs stably expressed housekeeping genes as references to eliminate platform-specific biases and non-biological variabilities. Results: Our method identifies biomarkers with \"built-in\"features, and these features can be interpreted consistently regardless of profiling technology, which enable classification of single-sample independent of platforms. Validation with RNA-seq data of blood platelets shows that DDR achieves the superior performance in classification of six different tumor types as well as molecular target statuses (such as MET or HER2-positive, and mutant KRAS, EGFR or PIK3CA) with smaller sets of biomarkers. We demonstrate on the three microarray datasets that our method is capable of identifying robust biomarkers for subgrouping medulloblastoma samples with data perturbation due to different microarray platforms. In addition to identifying the majority of subgroup-specific biomarkers in CodeSet of nanoString, some potential new biomarkers for subgrouping medulloblastoma were detected by our method. Conclusions: In this study, we present a simple, yet powerful data-driven method which contributes significantly to identification of robust cross-platform gene signature for disease classification of single-patient to facilitate precision medicine. In addition, our method provides a new strategy for transcriptome analysis.",
                "authors": [
                    {
                        "name": "Bastola D."
                    },
                    {
                        "name": "Haas C."
                    },
                    {
                        "name": "Thapa I."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "date": "2019-11-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Multiplatform biomarker identification using a data-driven approach enables single-sample classification"
            },
            "pmcid": "PMC6868758",
            "pmid": "31752658"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
