{
    "additionDate": "2021-01-18T07:36:31Z",
    "biotoolsCURIE": "biotools:fragte",
    "biotoolsID": "fragte",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhouyizhuang3@163.com",
            "name": "Yizhuang Zhou",
            "orcidid": "https://orcid.org/0000-0003-2795-3111",
            "typeEntity": "Person"
        },
        {
            "email": "changliangzijin@163.com",
            "name": "Junfei Jin",
            "typeEntity": "Person"
        }
    ],
    "description": "FRAGTE is a completeness-independent method for pre-selection of closely related genomes for species delineation in prokaryotes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Yizhuangzhou/FRAGTE",
    "language": [
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2021-03-11T11:10:38Z",
    "name": "FRAGTE",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-020-6597-X",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Whole-genome approaches are widely preferred for species delineation in prokaryotes. However, these methods require pairwise alignments and calculations at the whole-genome level and thus are computationally intensive. To address this problem, a strategy consisting of sieving (pre-selecting closely related genomes) followed by alignment and calculation has been proposed. Results: Here, we initially test a published approach called \"genome-wide tetranucleotide frequency correlation coefficient\" (TETRA), which is specially tailored for sieving. Our results show that sieving by TETRA requires > 40% completeness for both genomes of a pair to yield > 95% sensitivity, indicating that TETRA is completeness-dependent. Accordingly, we develop a novel algorithm called \"fragment tetranucleotide frequency correlation coefficient\" (FRAGTE), which uses fragments rather than whole genomes for sieving. Our results show that FRAGTE achieves ~ 100% sensitivity and high specificity on simulated genomes, real genomes and metagenome-assembled genomes, demonstrating that FRAGTE is completeness-independent. Additionally, FRAGTE sieved a reduced number of total genomes for subsequent alignment and calculation to greatly improve computational efficiency for the process after sieving. Aside from this computational improvement, FRAGTE also reduces the computational cost for the sieving process. Consequently, FRAGTE extremely improves run efficiency for both the processes of sieving and after sieving (subsequent alignment and calculation) to together accelerate genome-wide species delineation. Conclusions: FRAGTE is a completeness-independent algorithm for sieving. Due to its high sensitivity, high specificity, highly reduced number of sieved genomes and highly improved runtime, FRAGTE will be helpful for whole-genome approaches to facilitate taxonomic studies in prokaryotes.",
                "authors": [
                    {
                        "name": "Jin J."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Zheng J."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2020-02-26T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A completeness-independent method for pre-selection of closely related genomes for species delineation in prokaryotes"
            },
            "pmcid": "PMC7045542",
            "pmid": "32102653"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ]
}
