{
    "accessibility": "Open access",
    "additionDate": "2021-03-31T13:48:02Z",
    "biotoolsCURIE": "biotools:ddgun",
    "biotoolsID": "ddgun",
    "cost": "Free of charge",
    "description": "DDGun is an untrained method for predicting the stability change upon mutation",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/repository/docker/biofold/ddgun",
            "version": "2022"
        },
        {
            "type": "Downloads page",
            "url": "https://github.com/biofold/ddgun",
            "version": "2022"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "3D-BioInfo",
        "Rare Diseases"
    ],
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Compute",
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biofold/ddgun",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-04-21T12:45:30.020280Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/biofold/ddgun"
        }
    ],
    "maturity": "Emerging",
    "name": "DDGun",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "emidio",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2923-1",
            "metadata": {
                "abstract": "Background: Predicting the effect of single point variations on protein stability constitutes a crucial step toward understanding the relationship between protein structure and function. To this end, several methods have been developed to predict changes in the Gibbs free energy of unfolding (δδG) between wild type and variant proteins, using sequence and structure information. Most of the available methods however do not exhibit the anti-symmetric prediction property, which guarantees that the predicted δδG value for a variation is the exact opposite of that predicted for the reverse variation, i.e., δδG(A → B) = -δδG(B → A), where A and B are amino acids. Results: Here we introduce simple anti-symmetric features, based on evolutionary information, which are combined to define an untrained method, DDGun (DDG untrained). DDGun is a simple approach based on evolutionary information that predicts the δδG for single and multiple variations from sequence and structure information (DDGun3D). Our method achieves remarkable performance without any training on the experimental datasets, reaching Pearson correlation coefficients between predicted and measured δδG values of ~ 0.5 and ~ 0.4 for single and multiple site variations, respectively. Surprisingly, DDGun performances are comparable with those of state of the art methods. DDGun also naturally predicts multiple site variations, thereby defining a benchmark method for both single site and multiple site predictors. DDGun is anti-symmetric by construction predicting the value of the δδG of a reciprocal variation as almost equal (depending on the sequence profile) to -δδG of the direct variation. This is a valuable property that is missing in the majority of the methods. Conclusions: Evolutionary information alone combined in an untrained method can achieve remarkably high performances in the prediction of δδG upon protein mutation. Non-trained approaches like DDGun represent a valid benchmark both for scoring the predictive power of the individual features and for assessing the learning capability of supervised methods.",
                "authors": [
                    {
                        "name": "Ben-Tal N."
                    },
                    {
                        "name": "Capriotti E."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Frank Y."
                    },
                    {
                        "name": "Montanucci L."
                    }
                ],
                "citationCount": 38,
                "date": "2019-07-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DDGun: An untrained method for the prediction of protein stability changes upon single and multiple point variations"
            },
            "pmcid": "PMC6606456",
            "pmid": "31266447",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1093/nar/gkac325",
            "metadata": {
                "abstract": "Estimating the functional effect of single amino acid variants in proteins is fundamental for predicting the change in the thermodynamic stability, measured as the difference in the Gibbs free energy of unfolding, between the wild-type and the variant protein (ΔΔG). Here, we present the web-server of the DDGun method, which was previously developed for the ΔΔG prediction upon amino acid variants. DDGun is an untrained method based on basic features derived from evolutionary information. It is antisymmetric, as it predicts opposite ΔΔG values for direct (A → B) and reverse (B → A) single and multiple site variants. DDGun is available in two versions, one based on only sequence information and the other one based on sequence and structure information. Despite being untrained, DDGun reaches prediction performances comparable to those of trained methods. Here we make DDGun available as a web server. For the web server version, we updated the protein sequence database used for the computation of the evolutionary features, and we compiled two new data sets of protein variants to do a blind test of its performances. On these blind data sets of single and multiple site variants, DDGun confirms its prediction performance, reaching an average correlation coefficient between experimental and predicted ΔΔG of 0.45 and 0.49 for the sequence-based and structure-based versions, respectively. Besides being used for the prediction of ΔΔG, we suggest that DDGun should be adopted as a benchmark method to assess the predictive capabilities of newly developed methods. Releasing DDGun as a web-server, stand-alone program and docker image will facilitate the necessary process of method comparison to improve ΔΔG prediction.",
                "authors": [
                    {
                        "name": "Benevenuta S."
                    },
                    {
                        "name": "Birolo G."
                    },
                    {
                        "name": "Capriotti E."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Lal D."
                    },
                    {
                        "name": "Montanucci L."
                    },
                    {
                        "name": "Pancotti C."
                    }
                ],
                "citationCount": 5,
                "date": "2022-07-05T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DDGun: an untrained predictor of protein stability changes upon amino acid variants"
            },
            "pmcid": "PMC9252764",
            "pmid": "35524565",
            "type": [
                "Method"
            ],
            "version": "2022"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web service"
    ]
}
