{
    "accessibility": "Open access",
    "additionDate": "2021-03-31T13:48:02Z",
    "biotoolsCURIE": "biotools:ddgun",
    "biotoolsID": "ddgun",
    "cost": "Free of charge",
    "description": "DDGun is an untrained method for predicting the stability change upon mutation",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/repository/docker/biofold/ddgun"
        },
        {
            "type": "Downloads page",
            "url": "https://github.com/biofold/ddgun"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirCommunity": [
        "3D-BioInfo",
        "Rare Diseases"
    ],
    "elixirNode": [
        "Italy"
    ],
    "elixirPlatform": [
        "Compute",
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biofold/ddgun",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-31T14:54:45Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/biofold/ddgun"
        }
    ],
    "name": "DDGun",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "emidio",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2923-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Predicting the effect of single point variations on protein stability constitutes a crucial step toward understanding the relationship between protein structure and function. To this end, several methods have been developed to predict changes in the Gibbs free energy of unfolding (δδG) between wild type and variant proteins, using sequence and structure information. Most of the available methods however do not exhibit the anti-symmetric prediction property, which guarantees that the predicted δδG value for a variation is the exact opposite of that predicted for the reverse variation, i.e., δδG(A → B) = -δδG(B → A), where A and B are amino acids. Results: Here we introduce simple anti-symmetric features, based on evolutionary information, which are combined to define an untrained method, DDGun (DDG untrained). DDGun is a simple approach based on evolutionary information that predicts the δδG for single and multiple variations from sequence and structure information (DDGun3D). Our method achieves remarkable performance without any training on the experimental datasets, reaching Pearson correlation coefficients between predicted and measured δδG values of ~ 0.5 and ~ 0.4 for single and multiple site variations, respectively. Surprisingly, DDGun performances are comparable with those of state of the art methods. DDGun also naturally predicts multiple site variations, thereby defining a benchmark method for both single site and multiple site predictors. DDGun is anti-symmetric by construction predicting the value of the δδG of a reciprocal variation as almost equal (depending on the sequence profile) to -δδG of the direct variation. This is a valuable property that is missing in the majority of the methods. Conclusions: Evolutionary information alone combined in an untrained method can achieve remarkably high performances in the prediction of δδG upon protein mutation. Non-trained approaches like DDGun represent a valid benchmark both for scoring the predictive power of the individual features and for assessing the learning capability of supervised methods.",
                "authors": [
                    {
                        "name": "Ben-Tal N."
                    },
                    {
                        "name": "Capriotti E."
                    },
                    {
                        "name": "Fariselli P."
                    },
                    {
                        "name": "Frank Y."
                    },
                    {
                        "name": "Montanucci L."
                    }
                ],
                "citationCount": 15,
                "date": "2019-07-03T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DDGun: An untrained method for the prediction of protein stability changes upon single and multiple point variations"
            },
            "pmcid": "PMC6606456",
            "pmid": "31266447",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ]
}
