{"credit":[{"email":"kjshin@yuhs.ac","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://forensic.yonsei.ac.kr/"}],"documentation":[{"type":"GENERAL","url":"http://mtprofiler.yonsei.ac.kr/"}],"function":[{"operation":[{"term":"Nucleic acid sequence analysis","uri":"http://edamontology.org/operation_2478"}]},{"operation":[{"term":"Sequence comparison","uri":"http://edamontology.org/operation_2451"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mtdnaprofiler-mitochondrial-dna-sequence-analysis-tool.html"}],"publication":[{"abstract":"Mitochondrial DNA (mtDNA) is a valuable tool in the fields of forensic, population, and medical genetics. However, recording and comparing mtDNA control region or entire genome sequences would be difficult if researchers are not familiar with mtDNA nomenclature conventions. Therefore, mtDNAprofiler, a Web application, was designed for the analysis and comparison of mtDNA sequences in a string format or as a list of mtDNA single-nucleotide polymorphisms (mtSNPs). mtDNAprofiler which comprises four mtDNA sequence-analysis tools (mtDNA nomenclature, mtDNA assembly, mtSNP conversion, and mtSNP concordance-check) supports not only the accurate analysis of mtDNA sequences via an automated nomenclature function, but also consistent management of mtSNP data via direct comparison and validity-check functions. Since mtDNAprofiler consists of four tools that are associated with key steps of mtDNA sequence analysis, mtDNAprofiler will be helpful for researchers working with mtDNA. mtDNAprofiler is freely available at http://mtprofiler.yonsei.ac.kr. © 2013 American Academy of Forensic Sciences.","authors":["Yang I.S.","Lee H.Y.","Yang W.I.","Shin K.-J."],"cit_count":10,"journal":"Journal of Forensic Sciences","pmid":"23682804","title":"MtDNAprofiler: A web application for the nomenclature and comparison of human mitochondrial DNA Sequences","year":"2013-07-01"}],"summary":{"biotoolsCURIE":"biotools:mtdnaprofiler","biotoolsID":"mtdnaprofiler","description":"Web program which enables users to analyze and compare mtDNA sequences whether they are indicated as FASTA format or as a difference to revised Cambridge Reference Sequence (rCRS).","homepage":"http://mtprofiler.yonsei.ac.kr/","name":"mtDNAprofiler"}}