{
    "accessibility": "Open access",
    "additionDate": "2022-12-23T00:16:32.188247Z",
    "biotoolsCURIE": "biotools:netie",
    "biotoolsID": "netie",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Seongoh Park"
        },
        {
            "name": "Tianshi Lu"
        },
        {
            "name": "Jianjun Zhang",
            "orcidid": "http://orcid.org/0000-0001-7872-3477"
        },
        {
            "name": "Tao Wang",
            "orcidid": "http://orcid.org/0000-0002-4355-149X"
        }
    ],
    "description": "The Bayesian Hierarchical Model named Neoantgien-T cell interaction estimation (Netie) is developed to investigate the neoantigens observed in the patient tumors to estimate the history of the impact of the host immune pressure on the evolution of the tumor clones. The estimation results will reveal whether the host immune system has been conferring strong or weaker selection pressure on the tumor clones over the time of tumor development. This may give us a peak into the future of how the mutations and clones will evolve for that patient. The model is based on pyclone/sciclone/phylowgs estimation results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                }
            ]
        }
    ],
    "homepage": "https://github.com/tianshilu/Netie",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:16:15.454882Z",
    "license": "Apache-2.0",
    "name": "netie",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1038/s41592-022-01644-7",
            "metadata": {
                "abstract": "Neoantigens are the key targets of antitumor immune responses from cytotoxic T cells and play a critical role in affecting tumor progressions and immunotherapy treatment responses. However, little is known about how the interaction between neoantigens and T cells ultimately affects the evolution of cancerous masses. Here, we develop a hierarchical Bayesian model, named neoantigen–T cell interaction estimation (netie) to infer the history of neoantigen-CD8+ T cell interactions in tumors. Netie was systematically validated and applied to examine the molecular patterns of 3,219 tumors, compiled from a panel of 18 cancer types. We showed that tumors with an increase in immune selection pressure over time are associated with T cells that have an activation-related expression signature. We also identified a subset of exhausted cytotoxic T cells postimmunotherapy associated with tumor clones that newly arise after treatment. These analyses demonstrate how netie enables the interrogation of the relationship between individual neoantigen repertoires and the tumor molecular profiles. We found that a T cell inflammation gene expression profile (TIGEP) is more predictive of patient outcomes in the tumors with an increase in immune pressure over time, which reveals a curious synergy between T cells and neoantigen distributions. Overall, we provide a new tool that is capable of revealing the imprints left by neoantigens during each tumor’s developmental process and of predicting how tumors will progress under further pressure of the host’s immune system.",
                "authors": [
                    {
                        "name": "Futreal P.A."
                    },
                    {
                        "name": "Han Y."
                    },
                    {
                        "name": "Heymach J.V."
                    },
                    {
                        "name": "Hubert S.M."
                    },
                    {
                        "name": "Lu T."
                    },
                    {
                        "name": "Park S."
                    },
                    {
                        "name": "Reuben A."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wistuba I."
                    },
                    {
                        "name": "Zhang J."
                    }
                ],
                "citationCount": 2,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Netie: inferring the evolution of neoantigen–T cell interactions in tumors"
            },
            "pmcid": "PMC10083098",
            "pmid": "36303017"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
