{
    "additionDate": "2020-01-09T18:19:36Z",
    "biotoolsCURIE": "biotools:urban-rural",
    "biotoolsID": "urban-rural",
    "confidence_flag": "tool",
    "description": "Differences by County-Level Urban-Rural and Economic Distress Classifications.\n\nUrban Rural Classification Scheme for Counties.\n\nCenters for Disease Control and Prevention. CDC twenty four seven. Saving Lives, Protecting People.\n\nNCHS Urban-Rural Classification Scheme for Counties.\n\nNational Center for Health Statistics.\n\nNational Center for Health Statistics (NCHS) data systems are often used to study the associations between urbanization level of residence and health and to monitor the health of urban and rural residents. NCHS has developed a six-level urban-rural classification scheme for U.S. counties and county-equivalent entities. The most urban category consists of “central” counties of large metropolitan areas and the most rural category consists of nonmetropolitan “noncore” counties. Three versions of the NCHS scheme are available:",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.cdc.gov/nchs/data_access/urban_rural.htm",
    "lastUpdate": "2021-01-02T10:10:16Z",
    "name": "urban-rural",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1111/JRH.12400",
            "metadata": {
                "abstract": "© 2019 National Rural Health AssociationPurpose: High-risk opioid prescribing is a critical driver of prescription opioid-related morbidity and mortality. This study explored opioid prescribing patterns across urban-rural and economic distress classifications. Secondarily, this study explored the urban-rural distribution of relevant health services, economic factors, and population characteristics. Methods: County-level opioid prescribing metrics were based on quarterly Washington State Prescription Monitoring Program data (2012-2017). Counties were classified using the 2013 National Center for Health Statistics Urban-Rural Classification Scheme for Counties, and Washington State unemployment-based distressed areas. County-level measures from Area Health Resources Files were used to describe the urban-rural continuum. Findings: Persistent economic distress was associated with higher-risk opioid prescribing. The large central metropolitan category had lower-risk opioid prescribing metrics than the other 5 urban-rural categories, which were similar to each other and not ordered by degree of rurality. High-risk prescribing declined over time, without notable trend divergence by either urban-rural or economic distress classifications. Conclusions: The most striking urban-rural differences in opioid prescribing metrics were between large central metropolitan and all other categories; thus, we recommend caution when collapsing urban-rural categories for analysis. Further research is needed regarding geographic and economic patterning of opioid prescribing practices, as well as the dissemination of guidelines and best practices across the urban-rural continuum. Finally, the multiple intertwined burdens faced by rural communities—higher-risk prescribing practices, higher opioid morbidity and mortality rates, and fewer resources for primary care, mental health care, alternative pain treatment, and opioid use disorder treatment—must be addressed as an urgent public health priority.",
                "authors": [
                    {
                        "name": "Edmonds A.T."
                    },
                    {
                        "name": "Fulton-Kehoe D."
                    },
                    {
                        "name": "Sears J.M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Journal of Rural Health",
                "title": "Tracking Opioid Prescribing Metrics in Washington State (2012-2017): Differences by County-Level Urban-Rural and Economic Distress Classifications"
            },
            "pmid": "31583779"
        }
    ],
    "topic": [
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
