{
    "accessibility": "Open access",
    "additionDate": "2022-12-31T00:00:08.724956Z",
    "biotoolsCURIE": "biotools:idjexpress",
    "biotoolsID": "idjexpress",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jan.mauer@gmail.com",
            "name": "Jan Mauer",
            "typeEntity": "Person"
        },
        {
            "email": "linhiel@gmail.com",
            "name": "Lina Marcela Gallego-Paez",
            "typeEntity": "Person"
        }
    ],
    "description": "An Integrated Application for Differential Splicing Analysis and Visualization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MauerLab/DJExpress",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:14:48.783314Z",
    "license": "MIT",
    "name": "iDJExpress",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fbinf.2022.786898",
            "metadata": {
                "abstract": "RNA-seq analysis of alternative pre-mRNA splicing has facilitated an unprecedented understanding of transcriptome complexity in health and disease. However, despite the availability of countless bioinformatic pipelines for transcriptome-wide splicing analysis, the use of these tools is often limited to expert bioinformaticians. The need for high computational power, combined with computational outputs that are complicated to visualize and interpret present obstacles to the broader research community. Here we introduce DJExpress, an R package for differential expression analysis of transcriptomic features and expression-trait associations. To determine gene-level differential junction usage as well as associations between junction expression and molecular/clinical features, DJExpress uses raw splice junction counts as input data. Importantly, DJExpress runs on an average laptop computer and provides a set of interactive and intuitive visualization formats. In contrast to most existing pipelines, DJExpress can handle both annotated and de novo identified splice junctions, thereby allowing the quantification of novel splice events. Moreover, DJExpress offers a web-compatible graphical interface allowing the analysis of user-provided data as well as the visualization of splice events within our custom database of differential junction expression in cancer (DJEC DB). DJEC DB includes not only healthy and tumor tissue junction expression data from TCGA and GTEx repositories but also cancer cell line data from the DepMap project. The integration of DepMap functional genomics data sets allows association of junction expression with molecular features such as gene dependencies and drug response profiles. This facilitates identification of cancer cell models for specific splicing alterations that can then be used for functional characterization in the lab. Thus, DJExpress represents a powerful and user-friendly tool for exploration of alternative splicing alterations in RNA-seq data, including multi-level data integration of alternative splicing signatures in healthy tissue, tumors and cancer cell lines.",
                "authors": [
                    {
                        "name": "Gallego-Paez L.M."
                    },
                    {
                        "name": "Mauer J."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "DJExpress: An Integrated Application for Differential Splicing Analysis and Visualization"
            },
            "pmcid": "PMC9580925",
            "pmid": "36304260"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
