{
    "accessibility": "Open access",
    "additionDate": "2019-08-04T10:55:50Z",
    "biotoolsCURIE": "biotools:SDEAP",
    "biotoolsID": "SDEAP",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yyang027@cs.ucr.edu",
            "name": "Ei-Wen Yang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "jiang@cs.ucr.edu",
            "name": "Tao Jian",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Splice graph based differential transcript expression analysis tool for population data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ewyang089/SDEAP/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ewyang089/SDEAP/wiki",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ewyang089/SDEAP/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/ewyang089/SDEAP"
        }
    ],
    "maturity": "Mature",
    "name": "SDEAP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btw513",
            "metadata": {
                "abstract": "© The Author 2016.Motivation: Differential transcript expression (DTE) analysis without predefined conditions is critical to biological studies. For example, it can be used to discover biomarkers to classify cancer samples into previously unknown subtypes such that better diagnosis and therapy methods can be developed for the subtypes. Although several DTE tools for population data, i.e. data without known biological conditions, have been published, these tools either assume binary conditions in the input population or require the number of conditions as a part of the input. Fixing the number of conditions to binary is unrealistic and may distort the results of a DTE analysis. Estimating the correct number of conditions in a population could also be challenging for a routine user. Moreover, the existing tools only provide differential usages of exons, which may be insufficient to interpret the patterns of alternative splicing across samples and restrains the applications of the tools from many biology studies. Results: We propose a novel DTE analysis algorithm, called SDEAP, that estimates the number of conditions directly from the input samples using a Dirichlet mixture model and discovers alternative splicing events using a new graph modular decomposition algorithm. By taking advantage of the above technical improvement, SDEAP was able to outperform the other DTE analysis methods in our extensive experiments on simulated data and real data with qPCR validation. The prediction of SDEAP also allowed us to classify the samples of cancer subtypes and cell-cycle phases more accurately.",
                "authors": [
                    {
                        "name": "Yang E.-W."
                    },
                    {
                        "name": "Jiang T."
                    }
                ],
                "citationCount": 2,
                "date": "2016-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SDEAP: A splice graph based differential transcript expression analysis tool for population data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}