
{
    "credit": [
        {
            "email": "genome01@cau.edu.cn",
            "name": "Su Zhen Lab",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinformatics.cau.edu.cn/PMRD/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "microRNA detection",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "Plant biology",
                "uri": "http://edamontology.org/topic_0780"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "MicroRNAs (miRNA) are ̃21 nucleotide-long non-coding small RNAs, which function as post-transcriptional regulators in eukaryotes. miRNAs play essential roles in regulating plant growth and development. In recent years, research into the mechanism and consequences of miRNA action has made great progress. With whole genome sequence available in such plants as Arabidopsis thaliana, Oryza sativa, Populus trichocarpa, Glycine max, etc., it is desirable to develop a plant miRNA database through the integration of large amounts of information about publicly deposited miRNA data. The plant miRNA database (PMRD) integrates available plant miRNA data deposited in public databases, gleaned from the recent literature, and data generated in-house. This database contains sequence information, secondary structure, target genes, expression profiles and a genome browser. In total, there are 8433 miRNAs collected from 121 plant species in PMRD, including model plants and major crops such as Arabidopsis, rice, wheat, soybean, maize, sorghum, barley, etc. For Arabidopsis, rice, poplar, soybean, cotton, medicago and maize, we included the possible target genes for each miRNA with a predicted interaction site in the database. Furthermore, we provided miRNA expression profiles in the PMRD, including our local rice oxidative stress related microarray data (LC Sciences miRPlants_10.1) and the recently published microarray data for poplar, Arabidopsis, tomato, maize and rice. The PMRD database was constructed by open source technology utilizing a user-friendly web interface, and multiple search tools. The PMRD is freely available at http://bioinformatics.cau.edu.cn/PMRD. We expect PMRD to be a useful tool for scientists in the miRNA field in order to study the function of miRNAs and their target genes, especially in model plants and major crops. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Zhang Z.",
                "Yu J.",
                "Li D.",
                "Zhang Z.",
                "Liu F.",
                "Zhou X.",
                "Wang T.",
                "Ling Y.",
                "Su Z."
            ],
            "cit_count": 197,
            "journal": "Nucleic Acids Research",
            "pmid": "19808935",
            "title": "PMRD: Plant microRNA database",
            "year": "2009-10-06"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pmrd",
        "biotoolsID": "pmrd",
        "description": "The database integrates available plant miRNA data deposited in public databases, gleaned from the recent literature, and data generated in-house. This database contains sequence information, secondary structure, target genes, expression profiles and a genome browser. Includes model plants and major crops such as Arabidopsis, rice, wheat, soybean, maize, sorghum, barley, etc.",
        "homepage": "http://bioinformatics.cau.edu.cn/PMRD",
        "name": "Plant MicroRNA Database (PMRD)"
    }
}