{
    "additionDate": "2015-02-05T13:24:16Z",
    "biotoolsCURIE": "biotools:reditools",
    "biotoolsID": "reditools",
    "collectionID": [
        "ELIXIR-ITA-CNR"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "ELIXIR-ITA-CNR",
            "orcidid": "https://orcid.org/0000-0002-6549-0114",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ernesto.picardi@uniba.it",
            "name": "Ernesto Picardi",
            "orcidid": "https://orcid.org/0000-0002-6549-0114",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.uniba.it/docenti/picardi-ernesto/en"
        }
    ],
    "description": "Python scripts to detect RNA editing in deep transcriptome sequencing data (RNAseq)",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BioinfoUNIBA/REDItools"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-ITA-BARI"
        ],
        "type": "group"
    },
    "function": [
        {
            "cmd": "REDItoolDnaRna.py -i rnaseq.bam -f myreference.fa -o myoutputfolder",
            "input": [
                {
                    "data": {
                        "term": "Alignment",
                        "uri": "http://edamontology.org/data_1916"
                    },
                    "format": [
                        {
                            "term": "BAM",
                            "uri": "http://edamontology.org/format_2572"
                        }
                    ]
                }
            ],
            "note": "Run REDItools on RNA sequences",
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Text data",
                        "uri": "http://edamontology.org/data_2526"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinfoUNIBA/REDItools",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-23T15:04:11.399227Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "REDItools",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-CNR",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt287",
            "metadata": {
                "abstract": "The reliable detection of RNA editing sites from massive sequencing data remains challenging and, although several methodologies have been proposed, no computational tools have been released to date. Here, we introduce REDItools a suite of python scripts to perform high-throughput investigation of RNA editing using next-generation sequencing data.Availability and implementation: REDItools are in python programming language and freely available at http://code.google. com/p/reditools/.Contact: or graziano.pesole@uniba.itSupplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author 2013. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com.",
                "authors": [
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Pesole G."
                    }
                ],
                "citationCount": 114,
                "date": "2013-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "REDItools: High-throughput RNA editing detection made easy"
            },
            "pmid": "23742983",
            "type": [
                "Primary"
            ],
            "version": "1.0-1.3"
        },
        {
            "doi": "10.1186/s12859-020-03562-x",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: RNA editing is a widespread co-/post-transcriptional mechanism that alters primary RNA sequences through the modification of specific nucleotides and it can increase both the transcriptome and proteome diversity. The automatic detection of RNA-editing from RNA-seq data is computational intensive and limited to small data sets, thus preventing a reliable genome-wide characterisation of such process. Results: In this work we introduce HPC-REDItools, an upgraded tool for accurate RNA-editing events discovery from large dataset repositories. Availability: https://github.com/BioinfoUNIBA/REDItools2. Conclusions: HPC-REDItools is dramatically faster than the previous version, REDItools, enabling big-data analysis by means of a MPI-based implementation and scaling almost linearly with the number of available cores.",
                "authors": [
                    {
                        "name": "Flati T."
                    },
                    {
                        "name": "Gioiosa S."
                    },
                    {
                        "name": "Spallanzani N."
                    },
                    {
                        "name": "Tagliaferri I."
                    },
                    {
                        "name": "Diroma M.A."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Chillemi G."
                    },
                    {
                        "name": "Picardi E."
                    },
                    {
                        "name": "Castrignano T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-08-21T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HPC-REDItools: A novel HPC-aware tool for improved large scale RNA-editing analysis"
            },
            "pmcid": "PMC7446188",
            "pmid": "32838738",
            "version": "2.0"
        },
        {
            "doi": "10.1038/s41596-019-0279-7",
            "metadata": {
                "abstract": "© 2020, The Author(s), under exclusive licence to Springer Nature Limited.RNA editing is a widespread post-transcriptional mechanism able to modify transcripts through insertions/deletions or base substitutions. It is prominent in mammals, in which millions of adenosines are deaminated to inosines by members of the ADAR family of enzymes. A-to-I RNA editing has a plethora of biological functions, but its detection in large-scale transcriptome datasets is still an unsolved computational task. To this aim, we developed REDItools, the first software package devoted to the RNA editing profiling in RNA-sequencing (RNAseq) data. It has been successfully used in human transcriptomes, proving the tissue and cell type specificity of RNA editing as well as its pervasive nature. Outcomes from large-scale REDItools analyses on human RNAseq data have been collected in our specialized REDIportal database, containing more than 4.5 million events. Here we describe in detail two bioinformatic procedures based on our computational resources, REDItools and REDIportal. In the first procedure, we outline a workflow to detect RNA editing in the human cell line NA12878, for which transcriptome and whole genome data are available. In the second procedure, we show how to identify dysregulated editing at specific recoding sites in post-mortem brain samples of Huntington disease donors. On a 64-bit computer running Linux with ≥32 GB of random-access memory (RAM), both procedures should take ~76 h, using 4 to 24 cores. Our protocols have been designed to investigate RNA editing in different organisms with available transcriptomic and/or genomic reads. Scripts to complete both procedures and a docker image are available at https://github.com/BioinfoUNIBA/REDItools.",
                "authors": [
                    {
                        "name": "Lo Giudice C."
                    },
                    {
                        "name": "Tangaro M.A."
                    },
                    {
                        "name": "Pesole G."
                    },
                    {
                        "name": "Picardi E."
                    }
                ],
                "citationCount": 9,
                "date": "2020-03-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "Investigating RNA editing in deep transcriptome datasets with REDItools and REDIportal"
            },
            "pmid": "31996844"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1,
    "version": [
        "1.3",
        "2.0"
    ]
}