{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:18:48Z",
    "biotoolsCURIE": "biotools:AfumID",
    "biotoolsID": "AfumID",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "t.sewell@imperial.ac.uk",
            "name": "Thomas R. Sewell",
            "orcidid": "https://orcid.org/0000-0002-7239-4817",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "framework for the analysis of Aspergillus fumigatus isolates based on their microsatellite profile.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Rarefaction",
                    "uri": "http://edamontology.org/operation_3797"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://afumid.shinyapps.io/afumID",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "AfumID",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1128/MBIO.00392-19",
            "metadata": {
                "abstract": "© 2019 Sewell et al.The emergence of azole resistance in the pathogenic fungus Aspergillus fumigatus has continued to increase, with the dominant resistance mechanisms, consisting of a 34-nucleotide tandem repeat (TR34)/L98H and TR46/Y121F/T289A, now showing a structured global distribution. Using hierarchical clustering and multivariate analysis of 4,049 A. fumigatus isolates collected worldwide and genotyped at nine microsatellite loci using analysis of short tandem repeats of A. fumigatus (STRAf), we show that A. fumigatus can be subdivided into two broad clades and that cyp51A alleles TR34/L98H and TR46/Y121F/T289A are unevenly distributed across these two populations. Diversity indices show that azole-resistant isolates are genetically depauperate compared to their wild-type counterparts, compatible with selective sweeps accompanying the selection of beneficial mutations. Strikingly, we found that azole-resistant clones with identical microsatellite profiles were globally distributed and sourced from both clinical and environmental locations, confirming that azole resistance is an international public health concern. Our work provides a framework for the analysis of A. fumigatus isolates based on their microsatellite profile, which we have incorporated into a freely available, user-friendly R Shiny application (AfumID) that provides clinicians and researchers with a method for the fast, automated characterization of A. fumigatus genetic relatedness. Our study highlights the effect that azole drug resistance is having on the genetic diversity of A. fumigatus and emphasizes its global importance upon this medically important pathogenic fungus. IMPORTANCE Azole drug resistance in the human-pathogenic fungus Aspergillus fumigatus continues to emerge, potentially leading to untreatable aspergillosis in im-munosuppressed hosts. Two dominant, environmentally associated resistance mechanisms, which are thought to have evolved through selection by the agricultural application of azole fungicides, are now distributed globally. Understanding the effect that azole resistance is having on the genetic diversity and global population of A. fumigatus will help mitigate drug-resistant aspergillosis and maintain the azole class of fungicides for future use in both medicine and crop protection.",
                "authors": [
                    {
                        "name": "Sewell T.R."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Rhodes J."
                    },
                    {
                        "name": "Hagen F."
                    },
                    {
                        "name": "Meis J.F."
                    },
                    {
                        "name": "Fisher M.C."
                    },
                    {
                        "name": "Jombart T."
                    }
                ],
                "citationCount": 8,
                "date": "2019-05-01T00:00:00Z",
                "journal": "mBio",
                "title": "Nonrandom distribution of azole resistance across the global population of aspergillus fumigatus"
            },
            "pmcid": "PMC6529631",
            "pmid": "31113894",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ]
}