{
    "additionDate": "2018-04-21T09:38:59Z",
    "biotoolsCURIE": "biotools:sbmlmod",
    "biotoolsID": "sbmlmod",
    "credit": [
        {
            "email": "ines.heiland@uit.no",
            "name": "Ines Heiland",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A web application that allows the integration of various data into a given SBML model. Accepted data cover common gene expression, proteomics or metabolomics data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://sbmlmod.uit.no:8000/sbmlmod/help/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://sbmlmod.uit.no:8000/sbmlmod/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "SBMLmod",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-017-1722-9",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Systems Biology Markup Language (SBML) is the standard model representation and description language in systems biology. Enriching and analysing systems biology models by integrating the multitude of available data, increases the predictive power of these models. This may be a daunting task, which commonly requires bioinformatic competence and scripting. Results: We present SBMLmod, a Python-based web application and service, that automates integration of high throughput data into SBML models. Subsequent steady state analysis is readily accessible via the web service COPASIWS. We illustrate the utility of SBMLmod by integrating gene expression data from different healthy tissues as well as from a cancer dataset into a previously published model of mammalian tryptophan metabolism. Conclusion: SBMLmod is a user-friendly platform for model modification and simulation. The web application is available at http://sbmlmod.uit.no , whereas the WSDL definition file for the web service is accessible via http://sbmlmod.uit.no/SBMLmod.wsdl. Furthermore, the entire package can be downloaded from https://github.com/MolecularBioinformatics/sbml-mod-ws. We envision that SBMLmod will make automated model modification and simulation available to a broader research community.",
                "authors": [
                    {
                        "name": "Schauble S."
                    },
                    {
                        "name": "Stavrum A.-K."
                    },
                    {
                        "name": "Bockwoldt M."
                    },
                    {
                        "name": "Puntervoll P."
                    },
                    {
                        "name": "Heiland I."
                    }
                ],
                "citationCount": 3,
                "date": "2017-06-24T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SBMLmod: A Python-based web application and web service for efficient data integration and model simulation"
            },
            "pmcid": "PMC5483284",
            "pmid": "28646877"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data integration and warehousing",
            "uri": "http://edamontology.org/topic_3366"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1
}