{
    "additionDate": "2019-11-14T18:22:13Z",
    "biotoolsCURIE": "biotools:MR-Base",
    "biotoolsID": "MR-Base",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "venexia.walker@bristol.ac.uk",
            "name": "Venexia M Walker",
            "orcidid": "https://orcid.org/0000-0001-5064-446X",
            "typeEntity": "Person"
        }
    ],
    "description": "Using the MR-Base platform to investigate risk factors and drug targets for thousands of phenotypes | This repository contains the case studies associated with the manuscript \"Using the MR-Base platform to investigate risk factors and drug targets for thousands of phenotypes\" | 2-sample Mendelian Randomisation | MR-base is a database and analytical platform for Mendelian randomization being developed by the MRC Integrative Epidemiology Unit at the University of Bristol",
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage disequilibrium calculation",
                    "uri": "http://edamontology.org/operation_0488"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://www.mrbase.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:57:34.358889Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MRCIEU/mrbase_casestudies"
        }
    ],
    "name": "MR-Base",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.12688/WELLCOMEOPENRES.15334.1",
            "metadata": {
                "abstract": "Mendelian randomization (MR) uses genetic information to strengthen causal inference concerning the effect of exposures on outcomes. This method has a broad range of applications, including investigating risk factors and appraising potential targets for intervention. MR-Base has become established as a freely accessible, online platform, which combines a database of complete genome-wide association study results with an interface for performing Mendelian randomization and sensitivity analyses. This allows the user to explore millions of potentially causal associations. MR-Base is available as a web application or as an R package. The technical aspects of the tool have previously been documented in the literature. The present article is complimentary to this as it focuses on the applied aspects. Specifically, we describe how MR-Base can be used in several ways, including to perform novel causal analyses, replicate results and enable transparency, amongst others. We also present three use cases, which demonstrate important applications of Mendelian randomization and highlight the benefits of using MR-Base for these types of analyses.",
                "authors": [
                    {
                        "name": "Davies N.M."
                    },
                    {
                        "name": "Gaunt T.R."
                    },
                    {
                        "name": "Haycock P.C."
                    },
                    {
                        "name": "Hemani G."
                    },
                    {
                        "name": "Martin R.M."
                    },
                    {
                        "name": "Smith G.D."
                    },
                    {
                        "name": "Walker V.M."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "citationCount": 73,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Wellcome Open Research",
                "title": "Using the MR-base platform to investigate risk factors and drug targets for thousands of phenotypes."
            },
            "pmcid": "PMC6694718",
            "pmid": "31448343"
        },
        {
            "doi": "10.7554/elife.34408",
            "metadata": {
                "abstract": "Results from genome-wide association studies (GWAS) can be used to infer causal relationships between phenotypes, using a strategy known as 2-sample Mendelian randomization (2SMR) and bypassing the need for individual-level data. However, 2SMR methods are evolving rapidly and GWAS results are often insufficiently curated, undermining efficient implementation of the approach. We therefore developed MR-Base (http://www.mrbase.org): a platform that integrates a curated database of complete GWAS results (no restrictions according to statistical significance) with an application programming interface, web app and R packages that automate 2SMR. The software includes several sensitivity analyses for assessing the impact of horizontal pleiotropy and other violations of assumptions. The database currently comprises 11 billion single nucleotide polymorphism-trait associations from 1673 GWAS and is updated on a regular basis. Integrating data with software ensures more rigorous application of hypothesis-driven analyses and allows millions of potential causal relationships to be efficiently evaluated in phenome-wide association studies.",
                "authors": [
                    {
                        "name": "Baird D."
                    },
                    {
                        "name": "Bowden J."
                    },
                    {
                        "name": "Burgess S."
                    },
                    {
                        "name": "Davey Smith G."
                    },
                    {
                        "name": "Elsworth B."
                    },
                    {
                        "name": "Evans D.M."
                    },
                    {
                        "name": "Gaunt T.R."
                    },
                    {
                        "name": "Haberland V."
                    },
                    {
                        "name": "Haycock P.C."
                    },
                    {
                        "name": "Hemani G."
                    },
                    {
                        "name": "Langdon R."
                    },
                    {
                        "name": "Laurin C."
                    },
                    {
                        "name": "Martin R.M."
                    },
                    {
                        "name": "Relton C."
                    },
                    {
                        "name": "Shihab H.A."
                    },
                    {
                        "name": "Tan V.Y."
                    },
                    {
                        "name": "Timpson N.J."
                    },
                    {
                        "name": "Wade K.H."
                    },
                    {
                        "name": "Yarmolinsky J."
                    },
                    {
                        "name": "Zheng J."
                    }
                ],
                "citationCount": 3909,
                "date": "2018-05-30T00:00:00Z",
                "journal": "eLife",
                "title": "The MR-base platform supports systematic causal inference across the human phenome"
            },
            "pmcid": "PMC5976434",
            "pmid": "29846171",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Web application"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
