{
    "accessibility": "Open access",
    "additionDate": "2019-07-06T07:00:51Z",
    "biotoolsCURIE": "biotools:Cryfa",
    "biotoolsID": "Cryfa",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "seyedmorteza@ua.pt",
            "name": "Morteza Hosseini",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Secure encryption tool for genomic data, namely in Fasta, Fastq, VCF, SAM and BAM formats, which is also capable of reducing the storage size of Fasta and Fastq files.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/cobilab/cryfa/blob/master/README.md"
        }
    ],
    "download": [
        {
            "note": "Cryfa Release 2",
            "type": "Source code",
            "url": "https://github.com/cobilab/cryfa/releases/tag/v18.06"
        },
        {
            "note": "Cryfa Release 1",
            "type": "Source code",
            "url": "https://github.com/cobilab/cryfa/releases/tag/V1.17.05"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cobilab/cryfa",
    "language": [
        "Ruby"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/cobilab/cryfa/issues"
        }
    ],
    "maturity": "Mature",
    "name": "Cryfa",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/bty645",
            "metadata": {
                "abstract": "© 2018 The Author(s). Published by Oxford University Press. The ever-increasing growth of high-throughput sequencing technologies has led to a great acceleration of medical and biological research and discovery. As these platforms advance, the amount of information for diverse genomes increases at unprecedented rates. Confidentiality, integrity and authenticity of such genomic information should be ensured due to its extremely sensitive nature. In this paper, we propose Cryfa, a fast secure encryption tool for genomic data, namely in Fasta, Fastq, VCF, SAM and BAM formats, which is also capable of reducing the storage size of Fasta and Fastq files. Cryfa uses advanced encryption standard (AES) encryption combined with a shuffling mechanism, which leads to a substantial enhancement of the security against low data complexity attacks. Compared to AES Crypt, a general-purpose encryption tool, Cryfa is an industry-oriented tool, which is able to provide confidentiality, integrity and authenticity of data at four times more speed; in addition, it can reduce the file sizes to 1/3. Due to the absence of a method similar to Cryfa, we have simulated its behavior with a combination of encryption and compression tools, for comparison purpose. For instance, our tool is nine times faster than its fastest competitor in Fasta files. Also, Cryfa has a very low memory usage (only a few megabytes), which makes it feasible to run on any computer. Availability and implementation Source codes and binaries are available, under GPLv3, at https://github.com/pratas/cryfa. Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Hosseini M."
                    },
                    {
                        "name": "Pratas D."
                    },
                    {
                        "name": "Pinho A.J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Cryfa: A secure encryption tool for genomic data"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        }
    ]
}