{"credit":[{"email":"wessonwu@mail.ncku.edu.tw","name":"Wei-Sheng Wu","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"hengchilee@uchicago.edu","name":"Heng-Chi Lee","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"TRAINING_MATERIAL","url":"http://cosbi4.ee.ncku.edu.tw/pirScan/Tutorial/"}],"function":[{"input":[{"data":{"term":"DNA sequence (raw)","uri":"http://edamontology.org/data_3497"},"format":[{"term":"Textual format","uri":"http://edamontology.org/format_2330"}]}],"operation":[{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"},{"term":"Sequence feature detection","uri":"http://edamontology.org/operation_0253"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"}]},"publication":[{"abstract":"© The Author(s) 2018.pirScan is a web-based tool for identifying C. elegans piRNA-targeting sites within a given mRNA or spliced DNA sequence. The purpose of our tool is to allowC. elegans researchers to predict piRNA targeting sites and to avoid the persistent germline silencing of transgenes that has renderedmany constructs unusable. pirScan fulfills this purpose by first enumerating the predicted piRNA-targeting sites present in an input sequence. This prediction can be exported in a tabular or graphical format. Subsequently, pirScan suggests silent mutations that can be introduced to the input sequence that would allow the modified transgene to avoid piRNA targeting. The user can customize the piRNA targeting stringency and the silent mutations that he/she wants to introduce into the sequence. The modified sequences can be re-submitted to be certain that any previously present piRNA-targeting sites are now absent and no new piRNA-targeting sites are accidentally generated. This revised sequence can finally be downloaded as a text file and/or visualized in a graphical format.","authors":["Wu W.-S.","Huang W.-C.","Brown J.S.","Zhang D.","Song X.","Chen H.","Tu S.","Weng Z.","Lee H.-C."],"cit_count":2,"doi":"10.1093/nar/gky277","journal":"Nucleic Acids Research","title":"PirScan: A webserver to predict piRNA targeting sites and to avoid transgene silencing in C. elegans","year":"2018-07-02"}],"summary":{"biotoolsCURIE":"biotools:pirscan","biotoolsID":"pirscan","description":"Identify C. elegans piRNA-targeting sites within a given mRNA or spliced DNA sequence. Allows C. elegans researchers to predict piRNA targeting sites and to avoid the persistent germline silencing of transgenes that has rendered many constructs unusable.","homepage":"http://cosbi4.ee.ncku.edu.tw/pirScan/","name":"pirScan"}}