
{
    "credit": [
        {
            "name": "Contact",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://shahlab.ca/contact.html"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://shahlab.ca/projects/snvmix/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "license": "MIT",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Next-generation sequencing (NGS) has enabled whole genome and transcriptome single nucleotide variant (SNV) discovery in cancer. NGS produces millions of short sequence reads that, once aligned to a reference genome sequence, can be interpreted for the presence of SNVs. Although tools exist for SNV discovery from NGS data, none are specifically suited to work with data from tumors, where altered ploidy and tumor cellularity impact the statistical expectations of SNV discovery. Results: We developed three implementations of a probabilistic Binomial mixture model, called SNVMix, designed to infer SNVs from NGS data from tumors to address this problem. The first models allelic counts as observations and infers SNVs and model parameters using an expectation maximization (EM) algorithm and is therefore capable of adjusting to deviation of allelic frequencies inherent in genomically unstable tumor genomes. The second models nucleotide and mapping qualities of the reads by probabilistically weighting the contribution of a read/nucleotide to the inference of a SNV based on the confidence we have in the base call and the read alignment. The third combines filtering out low-quality data in addition to probabilistic weighting of the qualities. We quantitatively evaluated these approaches on 16 ovarian cancer RNASeq datasets with matched genotyping arrays and a human breast cancer genome sequenced to >40× (haploid) coverage with ground truth data and show systematically that the SNVMix models outperform competing approaches. Availability: Software and data are available at http://compbio.bccrc.ca. Contact: sshah@bccrc.ca. Supplemantary information: Supplementary data are available at Bioinformatics online. © The Author(s) 2010. Published by Oxford University Press.",
            "authors": [
                "Goya R.",
                "Sun M.G.F.",
                "Morin R.D.",
                "Leung G.",
                "Ha G.",
                "Wiegand K.C.",
                "Senz J.",
                "Crisan A.",
                "Marra M.A.",
                "Hirst M.",
                "Huntsman D.",
                "Murphy K.P.",
                "Aparicio S.",
                "Shah S.P."
            ],
            "cit_count": 152,
            "journal": "Bioinformatics",
            "pmid": "20130035",
            "title": "SNVMix: Predicting single nucleotide variants from next-generation sequencing of tumors",
            "year": "2010-02-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:snvmix",
        "biotoolsID": "snvmix",
        "description": "Detects single nucleotide variants from next generation sequencing data derived from tumor tissues.",
        "homepage": "http://shahlab.ca/projects/snvmix/",
        "name": "SNVMix"
    }
}