{"credit":[{"email":"draimond@ulb.ac.be","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"wim.vranken@vub.be","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://ibsquare.be/sephiroth"}],"function":[{"operation":[{"term":"Disulfide bond prediction","uri":"http://edamontology.org/operation_0471"}]}],"labels":{"language":["Python"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/sephiroth-20140618-disulfide-connectivity-prediction.html"}],"publication":[{"abstract":"© 2014 The Author.Motivation: Cysteine residues have particular structural and functional relevance in proteins because of their ability to form covalent disulfide bonds. Bioinformatics tools that can accurately predict cysteine bonding states are already available, whereas it remains challenging to infer the disulfide connectivity pattern of unknown protein sequences. Improving accuracy in this area is highly relevant for the structural and functional annotation of proteins. Results: We predict the intra-chain disulfide bond connectivity patterns starting from known cysteine bonding states with an evolutionary-based unsupervised approach called Sephiroth that relies on high-quality alignments obtained with HHblits and is based on a coarse-grained cluster-based modelization of tandem cysteine mutations within a protein family. We compared our method with state-of-the-art unsupervised predictors and achieve a performance improvement of 25-27% while requiring an order of magnitude less of aligned homologous sequences (1/410 3 instead of 1/410 4). Availability and implementation: The software described in this article and the datasets used are available at http://ibsquare.be/sephiroth. Contact:","authors":["Raimondi D.","Orlando G.","Vranken W.F."],"cit_count":5,"journal":"Bioinformatics","pmid":"25492406","title":"Clustering-based model of cysteine co-evolution improves disulfide bond connectivity prediction and reduces homologous sequence requirements","year":"2015-04-15"}],"summary":{"biotoolsCURIE":"biotools:sephiroth","biotoolsID":"sephiroth","description":"A disulfide connectivity pattern predictor based on evolutionary information retrieved from Multiple Sequence Alignments (MSAs).","homepage":"http://ibsquare.be/sephiroth","name":"Sephiroth"}}