{
    "additionDate": "2021-03-19T08:35:01Z",
    "biotoolsCURIE": "biotools:sempi",
    "biotoolsID": "sempi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stefan.guenther@pharmazie.uni-freiburg.de",
            "name": "Stefan Günther",
            "orcidid": "https://orcid.org/0000-0003-3744-189X",
            "typeEntity": "Person"
        }
    ],
    "description": "Web Server for PKS and NRPS Predictions Combined with Metabolite Screening in Natural Product Databases.\n\nSeMPI 2.0 - Prediction and identification pipeline for polyketides (type I) and nonribosomal peptides.\n\nUpload a genome in FASTA or GenBank format and predict metabolites. For detailed instructions have a look on our help page.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://sempi.pharmazie.uni-freiburg.de",
    "lastUpdate": "2021-04-08T12:19:52.236492Z",
    "name": "SeMPI",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/METABO11010013",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Microorganisms produce secondary metabolites with a remarkable range of bioactive properties. The constantly increasing amount of published genomic data provides the opportunity for efficient identification of biosynthetic gene clusters by genome mining. On the other hand, for many natural products with resolved structures, the encoding biosynthetic gene clusters have not been identified yet. Of those secondary metabolites, the scaffolds of nonribosomal peptides and polyketides (type I modular) can be predicted due to their building block-like assembly. SeMPI v2 provides a comprehensive prediction pipeline, which includes the screening of the scaffold in publicly available natural compound databases. The screening algorithm was designed to detect homologous structures even for partial, incomplete clusters. The pipeline allows linking of gene clusters to known natural products and therefore also provides a metric to estimate the novelty of the cluster if a matching scaffold cannot be found. Whereas currently available tools attempt to provide comprehensive information about a wide range of gene clusters, SeMPI v2 aims to focus on precise predictions. Therefore, the cluster detection algorithm, including building block generation and domain substrate prediction, was thoroughly refined and benchmarked, to provide high-quality scaffold predictions. In a benchmark based on 559 gene clusters, SeMPI v2 achieved comparable or better results than antiSMASH v5. Additionally, the SeMPI v2 web server provides features that can help to further investigate a submitted gene cluster, such as the incorporation of a genome browser, and the possibility to modify a predicted scaffold in a workbench before the database screening.",
                "authors": [
                    {
                        "name": "Zierep P.F."
                    },
                    {
                        "name": "Ceci A.T."
                    },
                    {
                        "name": "Dobrusin I."
                    },
                    {
                        "name": "Rockwell-Kollmann S.C."
                    },
                    {
                        "name": "Gunther S."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Metabolites",
                "title": "Sempi 2.0—a web server for pks and nrps predictions combined with metabolite screening in natural product databases"
            },
            "pmcid": "PMC7823522",
            "pmid": "33383692"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}