{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-01-18T08:02:51Z",
    "biotoolsCURIE": "biotools:cbptools",
    "biotoolsID": "cbptools",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "k.patil@fz-juelich.de",
            "name": "Kaustubh R. Patil",
            "orcidid": "https://orcid.org/0000-0002-0289-5480",
            "typeEntity": "Person"
        }
    ],
    "description": "CBPtools is a Python package that allows users to run an extensively evaluated rCBP analysis workflow on a given ROI. It currently supports two modalities: resting-state functional connectivity and structural connectivity based on diffusion-weighted imaging, along with support for custom connectivity matrices. Analysis parameters are customizable and the workflow can be scaled to a large number of subjects using a parallel processing environment. Parcellation results with corresponding validity metrics are provided as textual and graphical output. Regional connectivity-based parcellation (rCBP) is a widely used procedure for investigating the structural and functional differentiation within a region of interest (ROI) based on its long-range connectivity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/inm7/cbptools",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-09T07:50:12Z",
    "license": "Freeware",
    "name": "CBPtools",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1007/S00429-020-02046-1",
            "metadata": {
                "abstract": "© 2020, The Author(s).Regional connectivity-based parcellation (rCBP) is a widely used procedure for investigating the structural and functional differentiation within a region of interest (ROI) based on its long-range connectivity. No standardized software or guidelines currently exist for applying rCBP, making the method only accessible to those who develop their own tools. As such, there exists a discrepancy between the laboratories applying the procedure each with their own software solutions, making it difficult to compare and interpret the results. Here, we outline an rCBP procedure accompanied by an open source software package called CBPtools. CBPtools is a Python (version 3.5+) package that allows users to run an extensively evaluated rCBP analysis workflow on a given ROI. It currently supports two modalities: resting-state functional connectivity and structural connectivity based on diffusion-weighted imaging, along with support for custom connectivity matrices. Analysis parameters are customizable and the workflow can be scaled to a large number of subjects using a parallel processing environment. Parcellation results with corresponding validity metrics are provided as textual and graphical output. Thus, CBPtools provides a simple plug-and-play, yet customizable way to conduct rCBP analyses. By providing an open-source software we hope to promote reproducible and comparable rCBP analyses and, importantly, make the rCBP procedure readily available. Here, we demonstrate the utility of CBPtools using a voluminous data set on an average compute-cluster infrastructure by performing rCBP on three ROIs prominently featured in parcellation literature.",
                "authors": [
                    {
                        "name": "Reuter N."
                    },
                    {
                        "name": "Genon S."
                    },
                    {
                        "name": "Kharabian Masouleh S."
                    },
                    {
                        "name": "Hoffstaedter F."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Kalenscher T."
                    },
                    {
                        "name": "Eickhoff S.B."
                    },
                    {
                        "name": "Patil K.R."
                    }
                ],
                "citationCount": 2,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Brain Structure and Function",
                "title": "CBPtools: a Python package for regional connectivity-based parcellation"
            },
            "pmcid": "PMC7271019",
            "pmid": "32144496"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        }
    ]
}