{
    "additionDate": "2023-09-07T13:21:52.253244Z",
    "biotoolsCURIE": "biotools:memprotmd",
    "biotoolsID": "memprotmd",
    "description": "MemProtMD is a database of over 5000 intrinsic membrane protein structures identified in the Protein Data Bank, inserted into simulated lipid bilayers using Coarse-Grained Self Assembly Molecular Dynamics simulations.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://memprotmd.bioch.ox.ac.uk/",
    "lastUpdate": "2023-09-07T13:21:52.256643Z",
    "name": "MemProtMD",
    "owner": "laasfeld",
    "publication": [
        {
            "doi": "10.1093/nar/gky1047",
            "metadata": {
                "abstract": "Integral membrane proteins fulfil important roles in many crucial biological processes, including cell signalling, molecular transport and bioenergetic processes. Advancements in experimental techniques are revealing high resolution structures for an increasing number of membrane proteins. Yet, these structures are rarely resolved in complex with membrane lipids. In 2015, the MemProtMD pipeline was developed to allow the automated lipid bilayer assembly around new membrane protein structures, released from the Protein Data Bank (PDB). To make these data available to the scientific community, a web database (http://memprotmd.bioch.ox.ac.uk) has been developed. Simulations and the results of subsequent analysis can be viewed using a web browser, including interactive 3D visualizations of the assembled bilayer and 2D visualizations of lipid contact data and membrane protein topology. In addition, ensemble analyses are performed to detail conserved lipid interaction information across proteins, families and for the entire database of 3506 PDB entries. Proteins may be searched using keywords, PDB or Uniprot identifier, or browsed using classification systems, such as Pfam, Gene Ontology annotation, mpstruc or the Transporter Classification Database. All files required to run further molecular simulations of proteins in the database are provided.",
                "authors": [
                    {
                        "name": "Newport T.D."
                    },
                    {
                        "name": "Sansom M.S.P."
                    },
                    {
                        "name": "Stansfeld P.J."
                    }
                ],
                "citationCount": 102,
                "date": "2019-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The MemProtMD database: A resource for membrane-embedded protein structures and their lipid interactions"
            },
            "type": [
                "Primary"
            ]
        }
    ]
}
