{
    "additionDate": "2021-01-18T07:03:32Z",
    "biotoolsCURIE": "biotools:mobileq",
    "biotoolsID": "mobileq",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Kristof Meers",
            "typeEntity": "Person"
        }
    ],
    "description": "A free user-friendly application for collecting experience sampling data.\n\nmobileQ is a free, open-source web dashboard and Android smartphone application developed by the research group of quantitative psychology and individual differences at KU Leuven to enable researchers to perform experience sampling or ecological momentary assessment (ESM/EMA) studies and interventions in an easy, intuitive, and accessible way.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://mobileQ.org",
    "lastUpdate": "2021-02-26T09:08:33Z",
    "name": "mobileQ",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3758/S13428-019-01330-1",
            "metadata": {
                "abstract": "© 2019, The Psychonomic Society, Inc.In this article we introduce mobileQ, which is a free, open-source platform that our lab has developed to use in experience sampling studies. Experience sampling has several strengths and is becoming more widely conducted, but there are few free software options. To address this gap, mobileQ has freely available servers, a web interface, and an Android app. To reduce the barrier to entry, it requires no high-level programming and uses an easy, point-and-click interface. It is designed to be used on dedicated research phones, allowing for experimenter control and eliminating selection bias. In this article, we introduce setting up a study in mobileQ, outline the set of help resources available for new users, and highlight the success with which mobileQ has been used in our lab.",
                "authors": [
                    {
                        "name": "Meers K."
                    },
                    {
                        "name": "Dejonckheere E."
                    },
                    {
                        "name": "Kalokerinos E.K."
                    },
                    {
                        "name": "Rummens K."
                    },
                    {
                        "name": "Kuppens P."
                    }
                ],
                "citationCount": 9,
                "date": "2020-08-01T00:00:00Z",
                "journal": "Behavior Research Methods",
                "title": "mobileQ: A free user-friendly application for collecting experience sampling data"
            },
            "pmid": "31898294"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}