
{
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bental.tau.ac.il/ConQuass/"
        }
    ],
    "function": [
        {
            "note": "Usage instructions: To rank a PDB file, first get its evolutionary information by running the ConSurf webserver. When the execution is over, download the grades file by clicking the 'Amino acid Conservation Scores, Confidence Intervals and Conservation Scores' on the results page.",
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Instruct"
        ],
        "cost": "Free of charge",
        "language": [
            "R",
            "Perl"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Structural biology",
                "uri": "http://edamontology.org/topic_1317"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Programs that evaluate the quality of a protein structural model are important both for validating the structure determination procedure and for guiding the model-building process. Such programs are based on properties of native structures that are generally not expected for faulty models. One such property, which is rarely used for automatic structure quality assessment, is the tendency for conserved residues to be located at the structural core and for variable residues to be located at the surface. Results: We present ConQuass, a novel quality assessment program based on the consistency between the model structure and the protein's conservation pattern. We show that it can identify problematic structural models, and that the scores it assigns to the server models in CASP8 correlate with the similarity of the models to the native structure. We also show that when the conservation information is reliable, the method's performance is comparable and complementary to that of the other single-structure quality assessment methods that participated in CASP8 and that do not use additional structural information from homologs. Availability: A perl implementation of the method, as well as the various perl and R scripts used for the analysis are available at http://bental.tau.ac.il/ConQuass/. Contact: nirb@tauex.tau.ac.il. Supplementary information: Supplementary data are available at Bioinformatics online. © The Author 2010. Published by Oxford University Press.",
            "authors": [
                "Kalman M.",
                "Ben-Tal N."
            ],
            "cit_count": 31,
            "doi": "10.1093/bioinformatics/btq114",
            "journal": "Bioinformatics",
            "title": "Quality assessment of protein model-structures using evolutionary conservation",
            "type": "Primary",
            "year": "2010-04-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:conquass",
        "biotoolsID": "conquass",
        "description": "A server for Quality Assessment of Protein Model-Structures using Evolutionary Conservation.",
        "homepage": "http://bental.tau.ac.il/ConQuass/",
        "name": "ConQuass",
        "version": [
            "1"
        ]
    }
}