{
    "additionDate": "2015-01-22T11:45:56Z",
    "biotoolsCURIE": "biotools:superpose3d",
    "biotoolsID": "superpose3d",
    "credit": [
        {
            "email": "citterich@uniroma2.it",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "ELIXIR-ITA-TORVERGATA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "A Local Structural Comparison Program That Allows for User-Defined Structure Representations.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cbm.bio.uniroma2.it/superpose3D/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure comparison",
                    "uri": "http://edamontology.org/operation_2483"
                }
            ]
        }
    ],
    "homepage": "http://cbm.bio.uniroma2.it/superpose3D",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "Superpose3D",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "ELIXIR-ITA-TORVERGATA",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0011988",
            "metadata": {
                "abstract": "Local structural comparison methods can be used to find structural similarities involving functional protein patches such as enzyme active sites and ligand binding sites. The outcome of such analyses is critically dependent on the representation used to describe the structure. Indeed different categories of functional sites may require the comparison program to focus on different characteristics of the protein residues. We have therefore developed superpose3D, a novel structural comparison software that lets users specify, with a powerful and flexible syntax, the structure description most suited to the requirements of their analysis. Input proteins are processed according to the user's directives and the program identifies sets of residues (or groups of atoms) that have a similar 3D position in the two structures. The advantages of using such a general purpose program are demonstrated with several examples. These test cases show that no single representation is appropriate for every analysis, hence the usefulness of having a flexible program that can be tailored to different needs. Moreover we also discuss how to interpret the results of a database screening where a known structural motif is searched against a large ensemble of structures. The software is written in C++ and is released under the open source GPL license. Superpose3D does not require any external library, runs on Linux, Mac OSX, Windows and is available at http://cbm.bio. uniroma2.it/superpose3D. © 2010 Gherardini et al.",
                "authors": [
                    {
                        "name": "Ausiello G."
                    },
                    {
                        "name": "Gherardini P.F."
                    },
                    {
                        "name": "Helmer-Citterich M."
                    }
                ],
                "citationCount": 12,
                "date": "2010-10-15T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Superpose3D: A local structural comparison program that allows for user-defined structure representations"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}
