{
    "additionDate": "2017-08-03T18:53:50Z",
    "biotoolsCURIE": "biotools:pcaanalyser",
    "biotoolsID": "pcaanalyser",
    "credit": [
        {
            "email": "v.avery@griffith.edu.au",
            "name": "Vicky M. Avery",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cs.uno.edu/~tamjid/"
        }
    ],
    "description": "Uses novel algorithms that allow accurate and rapid quantitation of protein expression in 3D cell culture.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://cs.uno.edu/~tamjid/Software.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://cs.uno.edu/~tamjid/Software.html",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pcaanalyser-2d-image-analysis-based-module-for-effective-determination-of-prostate-cancer-progression-in-3d-culture.html"
        }
    ],
    "name": "PCaAnalyser",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Three-dimensional (3D) in vitro cell based assays for Prostate Cancer (PCa) research are rapidly becoming the preferred alternative to that of conventional 2D monolayer cultures. 3D assays more precisely mimic the microenvironment found in vivo, and thus are ideally suited to evaluate compounds and their suitability for progression in the drug discovery pipeline. To achieve the desired high throughput needed for most screening programs, automated quantification of 3D cultures is required. Towards this end, this paper reports on the development of a prototype analysis module for an automated high-content-analysis (HCA) system, which allows for accurate and fast investigation of in vitro 3D cell culture models for PCa. The Java based program, which we have named PCaAnalyser, uses novel algorithms that allow accurate and rapid quantitation of protein expression in 3D cell culture. As currently configured, the PCaAnalyser can quantify a range of biological parameters including: nuclei-count, nuclei-spheroid membership prediction, various function based classification of peripheral and non-peripheral areas to measure expression of biomarkers and protein constituents known to be associated with PCa progression, as well as defining segregate cellular-objects effectively for a range of signal-to-noise ratios. In addition, PCaAnalyser architecture is highly flexible, operating as a single independent analysis, as well as in batch mode; essential for High-Throughput-Screening (HTS). Utilising the PCaAnalyser, accurate and rapid analysis in an automated high throughput manner is provided, and reproducible analysis of the distribution and intensity of well-established markers associated with PCa progression in a range of metastatic PCa cell-lines (DU145 and PC3) in a 3D model demonstrated.",
                "authors": [
                    {
                        "name": "Avery V.M."
                    },
                    {
                        "name": "Hoque M.T."
                    },
                    {
                        "name": "Lovitt C.J."
                    },
                    {
                        "name": "Windus L.C.E."
                    }
                ],
                "citationCount": 7,
                "date": "2013-11-20T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PCaAnalyser: A 2D-image analysis based module for effective determination of prostate cancer progression in 3D culture"
            },
            "pmid": "24278197"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biological imaging",
            "uri": "http://edamontology.org/topic_3383"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
