{
    "additionDate": "2018-06-30T16:54:29Z",
    "biotoolsCURIE": "biotools:bacarena",
    "biotoolsID": "bacarena",
    "credit": [
        {
            "email": "j.zimmermann@iem.uni-kiel.de",
            "name": "Johannes Zimmermann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Modeling framework for cellular communities in their environments. Can be used for simulation of organisms living in communities. Each organism is represented individually and genome scale metabolic models determine the uptake and release of compounds. Biological processes such as movement, diffusion, chemotaxis and kinetics are available along with data analysis techniques.",
    "documentation": [
        {
            "type": "User manual",
            "url": "https://cran.r-project.org/web/packages/BacArena/BacArena.pdf"
        },
        {
            "type": "General",
            "url": "https://cran.r-project.org/web/packages/BacArena/vignettes/BacArena-Introduction.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/BacArena/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "BacArena",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1005544",
            "metadata": {
                "abstract": "© 2017 Bauer et al.Recent advances focusing on the metabolic interactions within and between cellular populations have emphasized the importance of microbial communities for human health. Constraint-based modeling, with flux balance analysis in particular, has been established as a key approach for studying microbial metabolism, whereas individual-based modeling has been commonly used to study complex dynamics between interacting organisms. In this study, we combine both techniques into the R package BacArena (https://cran.r-project.org/package=BacArena) to generate novel biological insights into Pseudomonas aeruginosa biofilm formation as well as a seven species model community of the human gut. For our P. aeruginosa model, we found that cross-feeding of fermentation products cause a spatial differentiation of emerging metabolic phenotypes in the biofilm over time. In the human gut model community, we found that spatial gradients of mucus glycans are important for niche formations which shape the overall community structure. Additionally, we could provide novel hypothesis concerning the metabolic interactions between the microbes. These results demonstrate the importance of spatial and temporal multi-scale modeling approaches such as BacArena.",
                "authors": [
                    {
                        "name": "Bauer E."
                    },
                    {
                        "name": "Zimmermann J."
                    },
                    {
                        "name": "Baldini F."
                    },
                    {
                        "name": "Thiele I."
                    },
                    {
                        "name": "Kaleta C."
                    }
                ],
                "citationCount": 22,
                "date": "2017-05-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "BacArena: Individual-based metabolic modeling of heterogeneous microbes in complex communities"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1
}