{
    "additionDate": "2017-01-13T13:15:18Z",
    "biotoolsCURIE": "biotools:mason",
    "biotoolsID": "mason",
    "credit": [
        {
            "email": "manuel.holtgrewe@fu-berlin.de",
            "name": "Manuel Holtgrewe",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A fast, feature-rich and hackable read simulator for the simulation of NGS and Sanger data.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/seqan/seqan/tree/master/apps/mason2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.seqan.de/apps/mason/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:55Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "Mason",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0049110",
            "metadata": {
                "abstract": "Pipelines for the analysis of Next-Generation Sequencing (NGS) data are generally composed of a set of different publicly available software, configured together in order to map short reads of a genome and call variants. The fidelity of pipelines is variable. We have developed ArtificialFastqGenerator, which takes a reference genome sequence as input and outputs artificial paired-end FASTQ files containing Phred quality scores. Since these artificial FASTQs are derived from the reference genome, it provides a gold-standard for read-alignment and variant-calling, thereby enabling the performance of any NGS pipeline to be evaluated. The user can customise DNA template/read length, the modelling of coverage based on GC content, whether to use real Phred base quality scores taken from existing FASTQ files, and whether to simulate sequencing errors. Detailed coverage and error summary statistics are outputted. Here we describe ArtificialFastqGenerator and illustrate its implementation in evaluating a typical bespoke NGS analysis pipeline under different experimental conditions. ArtificialFastqGenerator was released in January 2012. Source code, example files and binaries are freely available under the terms of the GNU General Public License v3.0. from https://sourceforge.net/projects/artfastqgen/. © 2012 Frampton, Houlston.",
                "authors": [
                    {
                        "name": "Frampton M."
                    },
                    {
                        "name": "Houlston R."
                    }
                ],
                "citationCount": 17,
                "date": "2012-11-12T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Generation of Artificial FASTQ Files to Evaluate the Performance of Next-Generation Sequencing Pipelines"
            },
            "type": "Review"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        }
    ],
    "validated": 1
}