
{
    "credit": [
        {
            "email": "t.h.struck@nhm.uio.no",
            "name": "Torsten H. Struck",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.annelida.de/research/bioinformatics/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://annelida.de/research/bioinformatics/software/index.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment refinement",
                    "uri": "http://edamontology.org/operation_2089"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/bacoca-heuristic-software-tool-for-parallel-assessment-of-sequence-biases-in-hundreds-of-gene-and-taxon-partitions.html"
        }
    ],
    "publication": [
        {
            "abstract": "BaCoCa (BAse COmposition CAlculator) is a user-friendly software that combines multiple statistical approaches (like RCFV and C value calculations) to identify biases in aligned sequence data which potentially mislead phylogenetic reconstructions. As a result of its speed and flexibility, the program provides the possibility to analyze hundreds of pre-defined gene partitions and taxon subsets in one single process run. BaCoCa is command-line driven and can be easily integrated into automatic process pipelines of phylogenomic studies. Moreover, given the tab-delimited output style the results can be easily used for further analyses in programs like Excel or statistical packages like R. A built-in option of BaCoCa is the generation of heat maps with hierarchical clustering of certain results using R. As input files BaCoCa can handle FASTA and relaxed PHYLIP, which are commonly used in phylogenomic pipelines. BaCoCa is implemented in Perl and works on Windows PCs, Macs and Linux operating systems. The executable source code as well as example test files and a detailed documentation of BaCoCa are freely available at http://software.zfmk.de. © 2013 Elsevier Inc.",
            "authors": [
                "Kuck P.",
                "Struck T.H."
            ],
            "cit_count": 50,
            "journal": "Molecular Phylogenetics and Evolution",
            "pmid": "24076250",
            "title": "BaCoCa - A heuristic software tool for the parallel assessment of sequence biases in hundreds of gene and taxon partitions",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bacoca",
        "biotoolsID": "bacoca",
        "description": "BAse COmposition CAlculator is a user-friendly software that combines multiple statistical approaches (like RCFV and C value calculations) to identify biases in aligned sequence data which potentially mislead phylogenetic reconstructions.",
        "homepage": "http://annelida.de/research/bioinformatics/software/index.html",
        "name": "BaCoCa"
    }
}