{
    "additionDate": "2020-01-14T20:01:05Z",
    "biotoolsCURIE": "biotools:RestraintLib",
    "biotoolsID": "RestraintLib",
    "confidence_flag": "tool",
    "description": "Programs can use RestraintLib's API to calculate restraints programmatically without interacting with this web page. To see the format of the requests, check the API documentation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid structure comparison",
                    "uri": "http://edamontology.org/operation_2518"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Protein geometry validation",
                    "uri": "http://edamontology.org/operation_1844"
                }
            ]
        }
    ],
    "homepage": "http://achesym.ibch.poznan.pl/restraintlib/",
    "lastUpdate": "2024-11-24T20:48:54.757771Z",
    "name": "RestraintLib",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/nar/gkz1122",
            "metadata": {
                "abstract": "Stereochemical restraints are commonly used to aid the refinement of macromolecular structures obtained by experimental methods at lower resolution. The standard restraint library for nucleic acids has not been updated for over two decades and needs revision. In this paper, geometrical restraints for nucleic acids sugars are derived using information from high-resolution crystal structures in the Cambridge Structural Database. In contrast to the existing restraints, this work shows that different parts of the sugar moiety form groups of covalent geometry dependent on various chemical and conformational factors, such as the type of ribose or the attached nucleobase, and ring puckering or rotamers of the glycosidic (χ) or side-chain (γ) torsion angles. Moreover, the geometry of the glycosidic link and the endocyclic ribose bond angles are functionally dependent on χ and sugar pucker amplitude (τm), respectively. The proposed restraints have been positively validated against data from the Nucleic Acid Database, compared with an ultrahigh-resolution Z-DNA structure in the Protein Data Bank, and tested by re-refining hundreds of crystal structures in the Protein Data Bank. The conformation-dependent sugar restraints presented in this work are publicly available in REFMAC, PHENIX and SHELXL format through a dedicated RestraintLib web server with an API function.",
                "authors": [
                    {
                        "name": "Brzezinski D."
                    },
                    {
                        "name": "Gilski M."
                    },
                    {
                        "name": "Jaskolski M."
                    },
                    {
                        "name": "Kowiel M."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-24T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Conformation-dependent restraints for polynucleotides: The sugar moiety"
            },
            "pmcid": "PMC6954431",
            "pmid": "31799624"
        }
    ],
    "topic": [
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
