{
    "additionDate": "2020-01-14T08:56:01Z",
    "biotoolsCURIE": "biotools:MetaErg",
    "biotoolsID": "MetaErg",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "xdong@ucalgary.ca",
            "name": "Xiaoli Dong",
            "typeEntity": "Person"
        }
    ],
    "description": "An Integrated Pipeline for Annotation and Visualization of Metagenomic Contigs.\n\nMetaErg is a stand-alone and fully automated metagenomic and metaproteomic data annotation pipeline. It bundles essential annotation tasks such as feature prediction, functional annotation with Hidden Markov Model (HMM) searches as well as blast and diamond searches. It estimates and visualizes quantitative taxonomic and pathway compositions of multiple metagenomic and proteomics samples using sequencing coverage and proteomics spectral counts, respectively. For visualization, MetaErg provides a HTML interface, bringing all annotation results together in sortable and searchable tables, collapsible trees, and other graphic representations, enabling intuitive navigation of complex data.\n\nAnalysis statistics: master.stats.txt.\n\nAnalysis annotation in gff format: master.gff.txt.\n\nMetaErg begins biological feature and element prediction by identifying CRISPR elements and non-coding RNA genes (tRNA, rRNA genes)",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/xiaolidong/docker-metaerg"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xiaoli-dong/metaerg",
    "language": [
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2020-01-14T08:56:01Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://xiaoli-dong.github.io/metaerg/"
        }
    ],
    "name": "MetaErg",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.00999",
            "metadata": {
                "abstract": "© Copyright © 2019 Dong and Strous.Here, we describe MetaErg, a standalone and fully automated metagenome and metaproteome annotation pipeline. Annotation of metagenomes is challenging. First, metagenomes contain sequence data of many organisms from all domains of life. Second, many of these are from understudied lineages, encoding genes with low similarity to experimentally validated reference genes. Third, assembly and binning are not perfect, sometimes resulting in artifactual hybrid contigs or genomes. To address these challenges, MetaErg provides graphical summaries of annotation outcomes, both for the complete metagenome and for individual metagenome-assembled genomes (MAGs). It performs a comprehensive annotation of each gene, including taxonomic classification, enabling functional inferences despite low similarity to reference genes, as well as detection of potential assembly or binning artifacts. When provided with metaproteome information, it visualizes gene and pathway activity using sequencing coverage and proteomic spectral counts, respectively. For visualization, MetaErg provides an HTML interface, bringing all annotation results together, and producing sortable and searchable tables, collapsible trees, and other graphic representations enabling intuitive navigation of complex data. MetaErg, implemented in Perl, HTML, and JavaScript, is a fully open source application, distributed under Academic Free License at https://github.com/xiaoli-dong/metaerg. MetaErg is also available as a docker image at https://hub.docker.com/r/xiaolidong/docker-metaerg.",
                "authors": [
                    {
                        "name": "Dong X."
                    },
                    {
                        "name": "Strous M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-15T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "An Integrated Pipeline for Annotation and Visualization of Metagenomic Contigs"
            },
            "pmcid": "PMC6803454",
            "pmid": "31681429"
        }
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}