{
    "additionDate": "2017-12-18T00:03:14Z",
    "biotoolsCURIE": "biotools:ancestrymap",
    "biotoolsID": "ancestrymap",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genetics.med.harvard.edu/reich/Reich_Lab/Welcome.html"
        }
    ],
    "description": "ANCESTRYMAP finds skews in ancestry that are potentially associated with disease genes in recently mixed populations. Admixture mapping is a method for localizing disease causing genetic variants that differ in frequency across populations. It is most advantageous to apply this approach to populations that have descended from a recent mix of two ancestral groups that have been geographically isolated.",
    "documentation": [
        {
            "type": "General",
            "url": "https://reich.hms.harvard.edu/sites/reich.hms.harvard.edu/files/inline-files/ANCESTRYMAP_documentation.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://genetics.med.harvard.edu/reich/Reich_Lab/Software.html",
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/ancestrymap-2-0-find-skews-ancestry.html"
        }
    ],
    "name": "ANCESTRYMAP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1086/420871",
            "metadata": {
                "abstract": "Admixture mapping (also known as \"mapping by admixture linkage disequilibrium,\" or MALD) has been proposed as an efficient approach to localizing disease-causing variants that differ in frequency (because of either drift or selection) between two historically separated populations. Near a disease gene, patient populations descended from the recent mixing of two or more ethnic groups should have an increased probability of inheriting the alleles derived from the ethnic group that carries more disease-susceptibility alleles. The central attraction of admixture mapping is that, since gene flow has occurred recently in modern populations (e.g., in African and Hispanic Americans in the past 20 generations), it is expected that admixture-generated linkage disequilibrium should extend for many centimorgans. High-resolution marker sets are now becoming available to test this approach, but progress will require (a) computational methods to infer ancestral origin at each point in the genome and (b) empirical characterization of the general properties of linkage disequilibrium due to admixture. Here we describe statistical methods to estimate the ancestral origin of a locus on the basis of the composite genotypes of linked markers, and we show that this approach accurately estimates states of ancestral origin along the genome. We apply this approach to show that strong admixture linkage disequilibrium extends, on average, for 17 cM in African Americans. Finally, we present power calculations under varying models of disease risk, sample size, and proportions of ancestry. Studying ∼2,500 markers in ∼2,500 patients should provide power to detect many regions contributing to common disease. A particularly important result is that the power of an admixture mapping study to detect a locus will be nearly the same for a wide range of mixture scenarios: the mixture proportion should be 10%-90% from both ancestral populations.",
                "authors": [
                    {
                        "name": "Patterson N."
                    },
                    {
                        "name": "Hattangadi N."
                    },
                    {
                        "name": "Lane B."
                    },
                    {
                        "name": "Lohmueller K.E."
                    },
                    {
                        "name": "Hafler D.A."
                    },
                    {
                        "name": "Oksenberg J.R."
                    },
                    {
                        "name": "Hauser S.L."
                    },
                    {
                        "name": "Smith M.W."
                    },
                    {
                        "name": "O'Brien S.J."
                    },
                    {
                        "name": "Altshuler D."
                    },
                    {
                        "name": "Daly M.J."
                    },
                    {
                        "name": "Reich D."
                    }
                ],
                "citationCount": 360,
                "date": "2004-01-01T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Methods for High-Density Admixture Mapping of Disease Genes"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Disease",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}