{
    "accessibility": "Open access",
    "additionDate": "2017-03-04T22:39:18Z",
    "biotoolsCURIE": "biotools:clinvar",
    "biotoolsID": "clinvar",
    "collectionID": [
        "RD-connect",
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "maglott@ncbi.nlm.nih.gov",
            "name": "Donna R. Maglott",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A freely accessible, public archive of reports of relationships among medically important variants and phenotypes hosted by the NCBI. It integrates and cross-references data from multiple databases at NCBI. In addition to dbSNP and dbVar, it depends on MedGen to represent phenotype, Gene to represent genes, and on human RefSeqs to represent the location of sequence variation. Each record represents the submitter, the variation and the phenotype.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://www.ncbi.nlm.nih.gov/clinvar/intro/"
        }
    ],
    "editPermission": {
        "authors": [
            "Friederike",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://www.ncbi.nlm.nih.gov/clinvar/",
    "lastUpdate": "2024-02-14T13:12:50.053374Z",
    "maturity": "Mature",
    "name": "ClinVar",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006169"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1093/nar/gkx1153",
            "metadata": {
                "abstract": "© Published by Oxford University Press on behalf of Nucleic Acids Research 2017.ClinVar (https://www.ncbi.nlm.nih.gov/clinvar/) is a freely available, public archive of human genetic variants and interpretations of their significance to disease, maintained at the National Institutes of Health. Interpretations of the clinical significance of variants are submitted by clinical testing laboratories, research laboratories, expert panels and other groups. ClinVar aggregates data by variant-disease pairs, and by variant (or set of variants). Data aggregated by variant are accessible on the website, in an improved set of variant call format files and as a new comprehensive XML report. ClinVar recently started accepting submissions that are focused primarily on providing phenotypic information for individuals who have had genetic testing. Submissions may come from clinical providers providing their own interpretation of the variant ('provider interpretation') or from groups such as patient registries that primarily provide phenotypic information from patients ('phenotyping only'). ClinVar continues to make improvements to its search and retrieval functions. Several new fields are now indexed for more precise searching, and filters allow the user to narrow down a large set of search results.",
                "authors": [
                    {
                        "name": "Benson M."
                    },
                    {
                        "name": "Brown G.R."
                    },
                    {
                        "name": "Chao C."
                    },
                    {
                        "name": "Chitipiralla S."
                    },
                    {
                        "name": "Gu B."
                    },
                    {
                        "name": "Hart J."
                    },
                    {
                        "name": "Hoffman D."
                    },
                    {
                        "name": "Holmes J.B."
                    },
                    {
                        "name": "Jang W."
                    },
                    {
                        "name": "Karapetyan K."
                    },
                    {
                        "name": "Kattman B.L."
                    },
                    {
                        "name": "Katz K."
                    },
                    {
                        "name": "Landrum M.J."
                    },
                    {
                        "name": "Lee J.M."
                    },
                    {
                        "name": "Liu C."
                    },
                    {
                        "name": "Maddipatla Z."
                    },
                    {
                        "name": "Maglott D.R."
                    },
                    {
                        "name": "Malheiro A."
                    },
                    {
                        "name": "McDaniel K."
                    },
                    {
                        "name": "Ovetsky M."
                    },
                    {
                        "name": "Riley G."
                    },
                    {
                        "name": "Zhou G."
                    }
                ],
                "citationCount": 1190,
                "date": "2018-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ClinVar: Improving access to variant interpretations and supporting evidence"
            },
            "pmcid": "PMC5753237",
            "pmid": "29165669"
        },
        {
            "doi": "10.1093/nar/gkt1113",
            "metadata": {
                "abstract": "ClinVar (http://www.ncbi.nlm.nih.gov/clinvar/) provides a freely available archive of reports of relationships among medically important variants and phenotypes. ClinVar accessions submissions reporting human variation, interpretations of the relationship of that variation to human health and the evidence supporting each interpretation. The database is tightly coupled with dbSNP and dbVar, which maintain information about the location of variation on human assemblies. ClinVar is also based on the phenotypic descriptions maintained in MedGen (http://www.ncbi.nlm.nih.gov/medgen). Each ClinVar record represents the submitter, the variation and the phenotype, i.e. the unit that is assigned an accession of the format SCV000000000.0. The submitter can update the submission at any time, in which case a new version is assigned. To facilitate evaluation of the medical importance of each variant, ClinVar aggregates submissions with the same variation/phenotype combination, adds value from other NCBI databases, assigns a distinct accession of the format RCV000000000.0 and reports if there are conflicting clinical interpretations. Data in ClinVar are available in multiple formats, including html, download as XML, VCF or tab-delimited subsets. Data from ClinVar are provided as annotation tracks on genomic RefSeqs and are used in tools such as Variation Reporter (http://www.ncbi.nlm.nih.gov/variation/tools/reporter), which reports what is known about variation based on user-supplied locations. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Church D.M."
                    },
                    {
                        "name": "Jang W."
                    },
                    {
                        "name": "Landrum M.J."
                    },
                    {
                        "name": "Lee J.M."
                    },
                    {
                        "name": "Maglott D.R."
                    },
                    {
                        "name": "Riley G.R."
                    },
                    {
                        "name": "Rubinstein W.S."
                    }
                ],
                "citationCount": 1487,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ClinVar: Public archive of relationships among sequence variation and human phenotype"
            },
            "pmcid": "PMC3965032",
            "pmid": "24234437",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ],
    "validated": 1
}
