{
    "additionDate": "2018-07-09T16:38:17Z",
    "biotoolsCURIE": "biotools:bitterpredict",
    "biotoolsID": "bitterpredict",
    "credit": [
        {
            "email": "nivlab@agri.huji.ac.il",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Classifier which predicts whether a compound is bitter or not, based on its chemical structure.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Niv-Lab/BitterPredict1"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Niv-Lab/BitterPredict1",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "BitterPredict",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1038/s41598-017-12359-7",
            "metadata": {
                "abstract": "© 2017 The Author(s).Bitter taste is an innately aversive taste modality that is considered to protect animals from consuming toxic compounds. Yet, bitterness is not always noxious and some bitter compounds have beneficial effects on health. Hundreds of bitter compounds were reported (and are accessible via the BitterDB http://bitterdb.agri.huji.ac.il/dbbitter.php), but numerous additional bitter molecules are still unknown. The dramatic chemical diversity of bitterants makes bitterness prediction a difficult task. Here we present a machine learning classifier, BitterPredict, which predicts whether a compound is bitter or not, based on its chemical structure. BitterDB was used as the positive set, and non-bitter molecules were gathered from literature to create the negative set. Adaptive Boosting (AdaBoost), based on decision trees machine-learning algorithm was applied to molecules that were represented using physicochemical and ADME/Tox descriptors. BitterPredict correctly classifies over 80% of the compounds in the hold-out test set, and 70-90% of the compounds in three independent external sets and in sensory test validation, providing a quick and reliable tool for classifying large sets of compounds into bitter and non-bitter groups. BitterPredict suggests that about 40% of random molecules, and a large portion (66%) of clinical and experimental drugs, and of natural products (77%) are bitter.",
                "authors": [
                    {
                        "name": "Bassoli A."
                    },
                    {
                        "name": "Ben Abu N."
                    },
                    {
                        "name": "Borgonovo G."
                    },
                    {
                        "name": "Dagan-Wiener A."
                    },
                    {
                        "name": "Nissim I."
                    },
                    {
                        "name": "Niv M.Y."
                    }
                ],
                "citationCount": 53,
                "date": "2017-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Bitter or not? BitterPredict, a tool for predicting taste from chemical structure"
            }
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        }
    ],
    "validated": 1
}
