{
    "additionDate": "2017-10-18T08:45:13Z",
    "biotoolsCURIE": "biotools:swisstree",
    "biotoolsID": "swisstree",
    "credit": [
        {
            "email": "swisstree@lists.isb-sib.ch",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Aims to provide a collection of 100 Gold Standard gene phylogenies to the scientific community. This set of reference gene trees is suitable for phylogenomic databases to assess their current quality status, measure changes following new database releases and diagnose improvements subsequent to an upgrade of the analysis procedure. SwissTree is used for benchmarking at the Orthology Benchmarking web service.",
    "download": [
        {
            "type": "Biological data",
            "url": "ftp://ftp.lausanne.isb-sib.ch/databases/SwissTree/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                }
            ]
        }
    ],
    "homepage": "https://swisstree.vital-it.ch/",
    "lastUpdate": "2021-05-19T14:01:45.992154Z",
    "name": "SwissTree",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_015881"
        }
    ],
    "owner": "SIB",
    "publication": [
        {
            "doi": "10.1093/gbe/evv121",
            "metadata": {
                "abstract": "© The Author(s) 2015. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.Quest for Orthologs (QfO) is a community effort with the goal to improve and benchmark orthology predictions. As quality assessment assumes prior knowledge on species phylogenies, we investigated the congruency between existing species trees by comparing the relationships of 147 QfO reference organisms from six Tree of Life (ToL)/species tree projects: The National Center for Biotechnology Information (NCBI) taxonomy, Opentree of Life, the sequenced species/species ToL, the 16S ribosomal RNA (rRNA) database, and trees published by Ciccarelli et al. (Ciccarelli FD, et al. 2006. Toward automatic reconstruction of a highly resolved tree of life. Science 311:1283-1287) and by Huerta-Cepas et al. (Huerta-Cepas J, Marcet-Houben M, Gabaldon T. 2014. A nested phylogenetic reconstruction approach provides scalable resolution in the eukaryotic Tree Of Life. PeerJ PrePrints 2:223) Our study reveals that each species tree suggests a different phylogeny: 87 of the 146 (60%) possible splits of a dichotomous and rooted tree are congruent, while all other splits are incongruent in at least one of the species trees. Topological differences are observed not only at deep speciation events, but also within younger clades, such as Hominidae, Rodentia, Laurasiatheria, or rosids. The evolutionary relationships of 27 archaea and bacteria are highly inconsistent. By assessing 458,108 gene trees from 65 genomes, we show that consistent species topologies are more often supported by gene phylogenies than contradicting ones. The largest concordant species tree includes 77 of the QfO reference organisms at the most. Results are summarized in the form of a consensus ToL (http://swisstree.vital-it.ch/species-tree) that can serve different benchmarking purposes.",
                "authors": [
                    {
                        "name": "Boeckmann B."
                    },
                    {
                        "name": "Marcet-Houben M."
                    },
                    {
                        "name": "Rees J.A."
                    },
                    {
                        "name": "Forslund K."
                    },
                    {
                        "name": "Huerta-Cepas J."
                    },
                    {
                        "name": "Muffato M."
                    },
                    {
                        "name": "Yilmaz P."
                    },
                    {
                        "name": "Xenarios I."
                    },
                    {
                        "name": "Bork P."
                    },
                    {
                        "name": "Lewis S.E."
                    },
                    {
                        "name": "Gabaldon T."
                    }
                ],
                "citationCount": 15,
                "date": "2015-07-01T00:00:00Z",
                "journal": "Genome Biology and Evolution",
                "title": "Quest for Orthologs Entails Quest for Tree of Life: In Search of the Gene Stream"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}