{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.uhnresearch.ca/labs/tillier/index.htm"}],"documentation":[{"type":"GENERAL","url":"http://wwwlabs.uhnresearch.ca/tillier/ProDesign/ProDesign.html"}],"function":[{"operation":[{"term":"Microarray probe design","uri":"http://edamontology.org/operation_0309"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Desktop application"],"topic":[{"term":"Probes and primers","uri":"http://edamontology.org/topic_0632"},{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Microarray experiment","uri":"http://edamontology.org/topic_3518"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/prodesign-1-0-generate-oligonucleotide-probes-genes-gene-families.html"}],"publication":[{"abstract":"Motivation: With hundreds of completely sequenced microbial genomes available, and advancements in DNA microarray technology, the detection of genes in microbial communities consisting of hundreds of thousands of sequences may be possible. The existing strategies developed for DNA probe design, geared toward identifying specific sequences, are not suitable due to the lack of coverage, flexibility and efficiency necessary for applications in metagenomics. Methods: ProDesign is a tool developed for the selection of oligonucleotide probes to detect members of gene families present in environmental samples. Gene family-specific probe sequences are generated based on specific and shared words, which are found with the spaced seed hashing algorithm. To detect more sequences, those sharing some common words are re-clustered into new families, then probes specific for the new families are generated. Results: The program is very flexible in that it can be used for designing probes for detecting many genes families simultaneously and specifically in one or more genomes. Neither the length nor the melting temperature of the probes needs to be predefined. We have found that ProDesign provides more flexibility, coverage and speed than other software programs used in the selection of probes for genomic and gene family arrays. © The Author 2007. Published by Oxford University Press. All rights reserved.","authors":["Feng S.","Tillier E.R.M."],"cit_count":26,"journal":"Bioinformatics","pmid":"17392329","title":"A fast and flexible approach to oligonucleotide probe design for genomes and gene families","year":"2007-05-15"}],"summary":{"biotoolsCURIE":"biotools:prodesign","biotoolsID":"prodesign","description":"Generate oligonucleotide probes for genes and gene families.","homepage":"http://www.uhnresearch.ca/labs/tillier/software.htm#7","name":"Prodesign"}}