{
    "additionDate": "2019-11-14T20:00:44Z",
    "biotoolsCURIE": "biotools:Dentareport",
    "biotoolsID": "Dentareport",
    "confidence_flag": "medium",
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | Automated longevity and risk factor analysis in dental patient care | BACKGROUND AND OBJECTIVE:During routine patient care practitioners have to document several aspects. However, currently it is difficult to methodically analyze the longevity of therapeutic concepts in dental private practice. Thus, the aim of the present paper was to introduce a software (Dentareport) to compare the success of different treatment options and to identify risk factors for failures in dental patient care. METHODS:Dentareport has a digital interface to automatically collect data of electronic patient files of practice management programs. By using computer-aided routines descriptive analyses of the treatments can be visualized. Dentareport also visually displays a bivariate risk factor analysis of treatment options",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31521901",
    "lastUpdate": "2019-11-14T20:00:44Z",
    "name": "Dentareport",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOMED.2019.103437",
            "metadata": {
                "abstract": "© 2019 Elsevier LtdBackground and objective: During routine patient care practitioners have to document several aspects. However, currently it is difficult to methodically analyze the longevity of therapeutic concepts in dental private practice. Thus, the aim of the present paper was to introduce a software (Dentareport) to compare the success of different treatment options and to identify risk factors for failures in dental patient care. Methods: Dentareport has a digital interface to automatically collect data of electronic patient files of practice management programs. By using computer-aided routines descriptive analyses of the treatments can be visualized. Dentareport also visually displays a bivariate risk factor analysis of treatment options. For this, crude associations between baseline characteristics (e.g. age) and time until failure (e.g. tooth loss) are calculated for the chosen treatment option by fitting separate models for each baseline characteristic as the independent variable. Furthermore, annual failure rates and survival graphs can be displayed. Results: The software has already been used to self-analyze treatment decisions. It highlighted the most long-lasting treatments for specific indications. Risk factors on practice-, patient- and tooth-level were easily identified. Furthermore, the software has been used to collect data for analysis of retrospective practice-based, mono-as well as multi-center observational studies. Conclusions: By using Dentareport practitioners can easily and objectively self-analyze treatment successes and risk factors. Furthermore, for researchers the software easily generates huge data sets in different fields in dentistry and enables the analysis on a multi-center level. Most relevant factors can, thus, be taken into account for treatment decisions.",
                "authors": [
                    {
                        "name": "Wierichs R.J."
                    },
                    {
                        "name": "Meyer-Lueckel H."
                    },
                    {
                        "name": "Kramer E.J."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Dentareport - Automated longevity and risk factor analysis in dental patient care"
            },
            "pmid": "31521901"
        }
    ],
    "topic": [
        {
            "term": "Dentistry",
            "uri": "http://edamontology.org/topic_3405"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        }
    ]
}