
{
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.novocraft.com/contact-us/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.novocraft.com/about-us/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Suite"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Several recent studies have demonstrated the effectiveness of resequencing and single nucleotide variant (SNV) detection by deep short-read sequencing platforms. While several reliable algorithms are available for automated SNV detection, the automated detection of microindels in deep short-read data presents a new bioinformatics challenge. Results: We systematically analyzed how the short-read mapping tools MAQ, Bowtie, Burrows-Wheeler alignment tool (BWA), Novoalign and RazerS perform on simulated datasets that contain indels and evaluated how indels affect error rates in SNV detection. We implemented a simple algorithm to compute the equivalent indel region eir, which can be used to process the alignments produced by the mapping tools in order to perform indel calling. Using simulated data that contains indels, we demonstrate that indel detection works well on short-read data: the detection rate for microindels (<4 bp) is >90%. Our study provides insights into systematic errors in SNV detection that is based on ungapped short sequence read alignments. Gapped alignments of short sequence reads can be used to reduce this error and to detect microindels in simulated shortread data. A comparison with microindels automatically identified on the ABI Sanger and Roche 454 platform indicates that microindel detection from short sequence reads identifies both overlapping and distinct indels. Contact: peter.krawitz@googlemail.com; peter.robinson@charite.de. Supplementary information: Supplementary data are available at Bioinformatics online. © The Author 2010. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oxfordjournals.org.",
            "authors": [
                "Krawitz P.",
                "Rodelsperger C.",
                "Jager M.",
                "Jostins L.",
                "Bauer S.",
                "Robinson P.N."
            ],
            "cit_count": 68,
            "journal": "Bioinformatics",
            "pmid": "20144947",
            "title": "Microindel detection in short-read sequence data",
            "year": "2010-02-09"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:novocraft",
        "biotoolsID": "novocraft",
        "description": "Program for mapping short reads from the Illumina/SOLiD sequencing platform(s) to a reference genome.",
        "homepage": "http://www.novocraft.com/",
        "name": "Novocraft"
    }
}