{
    "additionDate": "2020-01-09T17:44:34Z",
    "biotoolsCURIE": "biotools:fldgen",
    "biotoolsID": "fldgen",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "abigail.snyder@pnnl.gov",
            "name": "Abigail Snyder",
            "orcidid": "https://orcid.org/0000-0002-9034-9948",
            "typeEntity": "Person"
        }
    ],
    "description": "Joint emulation of Earth System Model temperature-precipitation realizations with internal variability and space-time and cross-variable correlation.\n\nGiven a global mean temperature pathway, generate random global climate fields consistent with it and with spatial and temporal correlation derived from an ESM.\n\nfldgen 2.0: Climate variable field generator with internal variability and spatial, temporal, and inter-variable correlation.\n\nThe fldgen package provides functions to learn the spatial, temporal, and inter-variable correlation of the variability in an earth system model (ESM) and generate random two-variable fields (e.g., temperature and precipitation) with equivalent properties",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "RNA structure covariance model generation",
                    "uri": "http://edamontology.org/operation_3469"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://jgcri.github.io/fldgen/",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-29T09:26:46Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/jgcri/fldgen/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jgcri/fldgen"
        }
    ],
    "name": "fldgen",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0223542",
            "metadata": {
                "abstract": "© 2019 Snyder et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Earth System Models (ESMs) are excellent tools for quantifying many aspects of future climate dynamics but are too computationally expensive to produce large collections of scenarios for downstream users of ESM data. In particular, many researchers focused on the impacts of climate change require large collections of ESM runs to rigorously study the impacts to both human and natural systems of low-frequency high-importance events, such as multi-year droughts. Climate model emulators provide an effective mechanism for filling this gap, reproducing many aspects of ESMs rapidly but with lower precision. The fldgen v1.0 R package quickly generates thousands of realizations of gridded temperature fields by randomizing the residuals of pattern scaling temperature output from any single ESM, retaining the spatial and temporal variance and covariance structures of the input data at a low computational cost. The fldgen v2.0 R package described here extends this capability to produce joint realizations of multiple variables, with a focus on temperature and precipitation in an open source software package available for community use (https://github.com/ jgcri/fldgen). This substantially improves the fldgen package by removing the requirement that the ESM variables be normally distributed, and will enable researchers to quickly generate covarying temperature and precipitation data that are synthetic but faithful to the characteristics of the original ESM.",
                "authors": [
                    {
                        "name": "BondLamberty B."
                    },
                    {
                        "name": "Dorheim K."
                    },
                    {
                        "name": "Hartin C."
                    },
                    {
                        "name": "Kravitz B."
                    },
                    {
                        "name": "Link R."
                    },
                    {
                        "name": "Snyder A."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Joint emulation of Earth System Model temperature-precipitation realizations with internal variability and space-time and crossvariable correlation: Fldgen v2.0 software description"
            },
            "pmcid": "PMC6777750",
            "pmid": "31584973"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}
