{
    "additionDate": "2017-03-24T14:34:17Z",
    "biotoolsCURIE": "biotools:progmap",
    "biotoolsID": "progmap",
    "description": "Facilitates the annotation of newly sequenced proteins by helping users assess the coherence of protein groups found in various databases. It is based on a non-redundant dataset of over 6.6 million protein sequences mapped to 240,000 protein groups. Queries may be made using sequence identifiers, gene symbols, protein functions or amino acid sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence tagged site (STS) mapping",
                    "uri": "http://edamontology.org/operation_2871"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://www.bioinformatics.nl/progmap",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:40Z",
    "name": "ProGMap",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Current protein sequence databases employ different classification schemes that often provide conflicting annotations, especially for poorly characterized proteins. ProGMap (Protein Group Mappings, http://www.bioinformatics.nl/progmap) is a web-tool designed to help researchers and database annotators to assess the coherence of protein groups defined in various databases and thereby facilitate the annotation of newly sequenced proteins. ProGMap is based on a non-redundant dataset of over 6.6 million protein sequences which is mapped to 240 000 protein group descriptions collected from UniProt, RefSeq, Ensembl, COG, KOG, OrthoMCL-DB, HomoloGene, TRIBES and PIRSF. ProGMap combines the underlying classification schemes via a network of links constructed by a fast and fully automated mapping approach originally developed for document classification. The web interface enables queries to be made using sequence identifiers, gene symbols, protein functions or amino acid and nucleotide sequences. For the latter query type BLAST similarity search and QuickMatch identity search services have been incorporated, for finding sequences similar (or identical) to a query sequence. ProGMap is meant to help users of high throughput methodologies who deal with partially annotated genomic data.",
                "authors": [
                    {
                        "name": "Kuzniar A."
                    },
                    {
                        "name": "Lin K."
                    },
                    {
                        "name": "He Y."
                    },
                    {
                        "name": "Nijveen H."
                    },
                    {
                        "name": "Pongor S."
                    },
                    {
                        "name": "Leunissen J.A.M."
                    }
                ],
                "citationCount": 10,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ProGMap: An integrated annotation resource for protein orthology"
            },
            "pmid": "19494185"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}