{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:18:25Z",
    "biotoolsCURIE": "biotools:PN-BOTTM",
    "biotoolsID": "PN-BOTTM",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mandi@gwu.edu",
            "name": "Mandi Pratt-Chapman",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Patient Navigation Barriers and Outcomes Tool™ (PN-BOT™), a new information management and reporting tool for oncology PN programs.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://smhs.gwu.edu/gwci/sites/gwci/files/PNBOT%20Quick%20Start%20Guide.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "http://bit.ly/PNBOTV1-1QuickStart"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "http://bit.ly/AboutPNBOT",
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "PN-BOTTM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1007/S00520-019-04837-7",
            "metadata": {
                "abstract": "© 2019, The Author(s).Purpose: The purposes of this study are to describe oncology patient navigation (PN) program perspectives on: (1) use of information systems and processes, (2) uses of program data, and (3) desired information system characteristics. Methods: We conducted multi-phase data collection to inform development of the Patient Navigation Barriers and Outcomes Tool™ (PN-BOT™), a new information management and reporting tool for oncology PN programs. Phase I was a national online survey of PN staff (n = 343) about data practices. Phase II was a pilot test of a PN-BOT™ prototype with nine PN programs. Survey results were tabulated. Qualitative analysis identified emergent themes from open-response fields from the Phase I survey and open-response survey and interview data from Phase II pilot testers. Results: PN program information management practices and systems were diverse and often leveraged a patchwork of untailored platforms. Navigators used data to inform navigation tasks, service improvement, research, and reporting. Respondents desired a streamlined, integrated, affordable data system able to minimize data entry burden, meet needs of diverse stakeholders, facilitate navigation work, readily generate reports, and share information among healthcare team members. Conclusions: Although oncology navigation programs explore diverse solutions, programs struggle to find health information technologies that sufficiently meet their needs. Information systems designed for oncology PN programs should perform a wide range of functions: be customizable, affordable, interoperable, and have low data entry burden. Organizations exploring solutions should invite PN input in decisions. PN-BOT™ was developed as a free Excel-based tool for PN programs responsive to reported needs.",
                "authors": [
                    {
                        "name": "Phillips S."
                    },
                    {
                        "name": "Pratt-Chapman M."
                    },
                    {
                        "name": "Raskin S."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "date": "2020-02-01T00:00:00Z",
                "journal": "Supportive Care in Cancer",
                "title": "Perspectives from oncology patient navigation programs on information management practices and needs: a descriptive study"
            },
            "pmid": "31073852",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}
