{
    "accessibility": "Open access",
    "additionDate": "2023-08-17T10:20:09.340146Z",
    "biotoolsCURIE": "biotools:pripath",
    "biotoolsID": "pripath",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "malik.yousef@gmail.com",
            "name": "Malik Yousef",
            "orcidid": "https://orcid.org/0000-0001-8780-6303",
            "typeEntity": "Person"
        }
    ],
    "description": "PriPath: identifying affected pathways from differential gene expression via grouping, scoring and modeling with an embedded machine learning approach.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Expression data",
                        "uri": "http://edamontology.org/data_2603"
                    }
                },
                {
                    "data": {
                        "term": "Pathway ID (KEGG)",
                        "uri": "http://edamontology.org/data_2343"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Statistical estimate score",
                        "uri": "http://edamontology.org/data_0951"
                    },
                    "format": [
                        {
                            "term": "xlsx",
                            "uri": "http://edamontology.org/format_3620"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://github.com/malikyousef/PriPath.git",
    "language": [
        "Java",
        "Python",
        "R"
    ],
    "lastUpdate": "2023-08-17T10:20:09.343993Z",
    "license": "CC-BY-4.0",
    "name": "PriPath",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05187-2",
            "metadata": {
                "abstract": "Background: Cell homeostasis relies on the concerted actions of genes, and dysregulated genes can lead to diseases. In living organisms, genes or their products do not act alone but within networks. Subsets of these networks can be viewed as modules that provide specific functionality to an organism. The Kyoto encyclopedia of genes and genomes (KEGG) systematically analyzes gene functions, proteins, and molecules and combines them into pathways. Measurements of gene expression (e.g., RNA-seq data) can be mapped to KEGG pathways to determine which modules are affected or dysregulated in the disease. However, genes acting in multiple pathways and other inherent issues complicate such analyses. Many current approaches may only employ gene expression data and need to pay more attention to some of the existing knowledge stored in KEGG pathways for detecting dysregulated pathways. New methods that consider more precompiled information are required for a more holistic association between gene expression and diseases. Results: PriPath is a novel approach that transfers the generic process of grouping and scoring, followed by modeling to analyze gene expression with KEGG pathways. In PriPath, KEGG pathways are utilized as the grouping function as part of a machine learning algorithm for selecting the most significant KEGG pathways. A machine learning model is trained to differentiate between diseases and controls using those groups. We have tested PriPath on 13 gene expression datasets of various cancers and other diseases. Our proposed approach successfully assigned biologically and clinically relevant KEGG terms to the samples based on the differentially expressed genes. We have comparatively evaluated the performance of PriPath against other tools, which are similar in their merit. For each dataset, we manually confirmed the top results of PriPath in the literature and found that most predictions can be supported by previous experimental research. Conclusions: PriPath can thus aid in determining dysregulated pathways, which applies to medical diagnostics. In the future, we aim to advance this approach so that it can perform patient stratification based on gene expression and identify druggable targets. Thereby, we cover two aspects of precision medicine.",
                "authors": [
                    {
                        "name": "Allmer J."
                    },
                    {
                        "name": "Bakir-Gungor B."
                    },
                    {
                        "name": "Jaber A."
                    },
                    {
                        "name": "Ozdemir F."
                    },
                    {
                        "name": "Yousef M."
                    }
                ],
                "citationCount": 2,
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "PriPath: identifying dysregulated pathways from differential gene expression via grouping, scoring, and modeling with an embedded feature selection approach"
            },
            "pmcid": "PMC9947447",
            "pmid": "36823571",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
