{
    "additionDate": "2019-11-14T18:12:42Z",
    "biotoolsCURIE": "biotools:CasPDB",
    "biotoolsID": "CasPDB",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "fbguo@uestc.edu.cn",
            "name": "FengBiao Guo",
            "typeEntity": "Person"
        },
        {
            "name": "Jian Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "an integrated and annotated database for Cas proteins from bacteria and archaea | Expanding the Catalog of cas Geness with Metagenomes | Expanding the Catalog of cas Genes with Metagenomes | CRISPR-Cas systems are RNA-based immune systems present in many bacteria and most archaea, almost composed of the CRISPR loci and cas gene | This website deposites the Cas proteins predicted from complete/draft genomes and metagenomes | Please cite this paper: Quan Zhang, Thomas G",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Operon prediction",
                    "uri": "http://edamontology.org/operation_0435"
                }
            ]
        }
    ],
    "homepage": "http://omics.informatics.indiana.edu/mg/CAS",
    "lastUpdate": "2019-11-14T18:12:42Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://immunet.cn/caspdb/"
        }
    ],
    "name": "CasPDB",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ093",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Clustered regularly interspaced short palindromic repeats (CRISPR) and associated proteins (Cas) constitute CRISPR-Cas systems, which are antiphage immune systems present in numerous bacterial and most archaeal species. In recent years, CRISPR-Cas systems have been developed into reliable and powerful genome editing tools. Nevertheless, finding similar or better tools from bacteria or archaea remains crucial. This requires the exploration of different CRISPR systems, identification and characterization new Cas proteins. Archives tailored for Cas proteins are urgently needed and necessitate the prediction and grouping of Cas proteins into an information center with all available experimental evidence. Here, we constructed Cas Protein Data Bank (CasPDB), an integrated and annotated online database for Cas proteins from bacteria and archaea. The CasPDB database contains 287 reviewed Cas proteins, 257 745 putative Cas proteins and 3593 Cas operons from 32 023 bacteria species and 1802 archaea species. The database can be freely browsed and searched. The CasPDB web interface also represents all the 3593 putative Cas operons and its components. Among these operons, 328 are members of the type II CRISPR-Cas system.",
                "authors": [
                    {
                        "name": "Tang Z."
                    },
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Chen A."
                    },
                    {
                        "name": "He B."
                    },
                    {
                        "name": "Zhou Y."
                    },
                    {
                        "name": "Chai G."
                    },
                    {
                        "name": "Guo F."
                    },
                    {
                        "name": "Huang J."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "CasPDB: An integrated and annotated database for Cas proteins from bacteria and archaea"
            },
            "pmcid": "PMC6693189",
            "pmid": "31411686"
        }
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}