{
    "additionDate": "2017-08-03T19:04:33Z",
    "biotoolsCURIE": "biotools:wormgender",
    "biotoolsID": "wormgender",
    "credit": [
        {
            "email": "mag@wormloco.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open-source software which designed for accurate quantification of sex ratio in Caenorhabditis elegans.  The software functions include, i) automatic recognition and counting of adult hermaphrodites and males, ii) a manual inspection feature that enables manual correction of errors, and iii) flexibility to use new training images to optimize the software for different imaging conditions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.quantworm.org/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Quantification of sex ratio",
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://www.quantworm.org/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/wormgender-automatic-caenorhabditis-elegans-sex-ratio-measurement.html"
        }
    ],
    "name": "WormGender",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Labocha et al.Fast and quantitative analysis of animal phenotypes is one of the major challenges of current biology. Here we report the WormGender open-source software, which is designed for accurate quantification of sex ratio in Caenorhabditis elegans. The software functions include, i) automatic recognition and counting of adult hermaphrodites and males, ii) a manual inspection feature that enables manual correction of errors, and iii) flexibility to use new training images to optimize the software for different imaging conditions. We evaluated the performance of our software by comparing manual and automated assessment of sex ratio. Our data showed that the WormGender software provided overall accurate sex ratio measurements. We further demonstrated the usage of WormGender by quantifying the high incidence of male (him) phenotype in 27 mutant strains. Mutants of nine genes (brc-1, C30G12.6, cep-1, coh-3, him-3, him-5, him-8, skr-1, unc-86) showed significant him phenotype. The WormGender is written in Java and can be installed and run on both Windows and Mac platforms. The source code is freely available together with a user manual and sample data at http://www.QuantWorm.org/. The source code and sample data are also available at http://dx.doi.org/10.6084/m9.figshare.1541248.",
                "authors": [
                    {
                        "name": "Aleman-Meza B."
                    },
                    {
                        "name": "Jung S.-K."
                    },
                    {
                        "name": "Labocha M.K."
                    },
                    {
                        "name": "Lee M.-H."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Zhong W."
                    }
                ],
                "citationCount": 5,
                "date": "2015-09-30T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "WormGender - Open-source software for automatic caenorhabditis elegans sex ratio measurement"
            },
            "pmid": "26421844"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
