{
    "accessibility": "Open access",
    "additionDate": "2021-10-02T07:09:21.419104Z",
    "biotoolsCURIE": "biotools:peacoqc",
    "biotoolsID": "peacoqc",
    "collectionID": [
        "BIG N2N",
        "UGent",
        "VIB"
    ],
    "description": "The PeacoQC package provides quality control functions that will check for monotonic increasing channels and that will remove outliers and unstable events introduced due to e.g. clogs, speed changes etc. during the measurement of your sample. It also provides the functionality of visualising the quality control result of only one sample and the visualisation of the results of multiple samples in one experiment.",
    "download": [
        {
            "type": "Command-line specification",
            "url": "https://github.com/saeyslab/PeacoQC",
            "version": "1.3.3"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Belgium"
    ],
    "homepage": "https://github.com/saeyslab/PeacoQC",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:18:37.239253Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/saeyslab/PeacoQC"
        }
    ],
    "name": "PeacoQC",
    "owner": "bits@vib.be",
    "publication": [
        {
            "doi": "10.1002/cyto.a.24501",
            "metadata": {
                "abstract": "In cytometry analysis, a large number of markers is measured for thousands or millions of cells, resulting in high-dimensional datasets. During the measurement of these samples, erroneous events can occur such as clogs, speed changes, slow uptake of the sample etc., which can influence the downstream analysis and can even lead to false discoveries. As these issues can be difficult to detect manually, an automated approach is recommended. In order to filter these erroneous events out, we created a novel quality control algorithm, Peak Extraction And Cleaning Oriented Quality Control (PeacoQC), that allows for automated cleaning of cytometry data. The algorithm will determine density peaks per channel on which it will remove low quality events based on their position in the isolation tree and on their mean absolute deviation distance to these density peaks. To evaluate PeacoQC's cleaning capability, it was compared to three other existing quality control algorithms (flowAI, flowClean and flowCut) on a wide variety of datasets. In comparison to the other algorithms, PeacoQC was able to filter out all different types of anomalies in flow, mass and spectral cytometry data, while the other methods struggled with at least one type. In the quantitative comparison, PeacoQC obtained the highest median balanced accuracy and a similar running time compared to the other algorithms while having a better scalability for large files. To ensure that the parameters chosen in the PeacoQC algorithm are robust, the cleaning tool was run on 16 public datasets. After inspection, only one sample was found where the parameters should be further optimized. The other 15 datasets were analyzed correctly indicating a robust parameter choice. Overall, we present a fast and accurate quality control algorithm that outperforms existing tools and ensures high-quality data that can be used for further downstream analysis. An R implementation is available.",
                "authors": [
                    {
                        "name": "Alarcon-Riquelme M.E."
                    },
                    {
                        "name": "Emmaneel A."
                    },
                    {
                        "name": "Maranon C."
                    },
                    {
                        "name": "Quintelier K."
                    },
                    {
                        "name": "Rybakowska P."
                    },
                    {
                        "name": "Saeys Y."
                    },
                    {
                        "name": "Sichien D."
                    },
                    {
                        "name": "Van Gassen S."
                    },
                    {
                        "name": "Van Isterdael G."
                    }
                ],
                "citationCount": 28,
                "date": "2022-04-01T00:00:00Z",
                "journal": "Cytometry Part A",
                "title": "PeacoQC: Peak-based selection of high quality cytometry data"
            },
            "pmcid": "PMC9293479",
            "pmid": "34549881",
            "type": [
                "Primary"
            ],
            "version": "1.3.3"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        }
    ],
    "version": [
        "1.3.3"
    ]
}
