{
    "additionDate": "2021-03-19T09:17:47Z",
    "biotoolsCURIE": "biotools:ednaflow",
    "biotoolsID": "ednaflow",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "s.mousavid@curtin.edu.au",
            "name": "Mahsa Mousavi‐Derazmahalleh",
            "orcidid": "https://orcid.org/0000-0002-2299-2050",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "eDNAFlow is a fully automated pipeline that employs a number of state-of-the-art applications to process eDNA data from raw sequences (single-end or paired-end) to generation of curated and non-curated zero-radius operational taxonomic units (ZOTUs) and their abundance tables. As part of eDNAFlow, we also present an in-house Python script to assign taxonomy to ZOTUs based on user specified thresholds for assigning Lowest Common Ancestor (LCA). This pipeline is based on Nextflow and Singularity which enables a scalable, portable and reproducible workflow using software containers on a local computer, clouds and high-performance computing (HPC) clusters.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                },
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mahsa-mousavi/eDNAFlow",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2021-05-05T09:22:49Z",
    "license": "GPL-3.0",
    "name": "eDNAFlow",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1111/1755-0998.13356",
            "metadata": {
                "abstract": "© 2021 John Wiley & Sons LtdMetabarcoding of environmental DNA (eDNA) when coupled with high throughput sequencing is revolutionising the way biodiversity can be monitored across a wide range of applications. However, the large number of tools deployed in downstream bioinformatic analyses often places a challenge in configuration and maintenance of a workflow, and consequently limits the research reproducibility. Furthermore, scalability needs to be considered to handle the growing amount of data due to increase in sequence output and the scale of project. Here, we describe eDNAFlow, a fully automated workflow that employs a number of state-of-the-art applications to process eDNA data from raw sequences (single-end or paired-end) to generation of curated and noncurated zero-radius operational taxonomic units (ZOTUs) and their abundance tables. This pipeline is based on Nextflow and Singularity which enable a scalable, portable and reproducible workflow using software containers on a local computer, clouds and high-performance computing (HPC) clusters. Finally, we present an in-house Python script to assign taxonomy to ZOTUs based on user specified thresholds for assigning lowest common ancestor (LCA). We demonstrate the utility and efficiency of the pipeline using an example of a published coral diversity biomonitoring study. Our results were congruent with the aforementioned study. The scalability of the pipeline is also demonstrated through analysis of a large data set containing 154 samples. To our knowledge, this is the first automated bioinformatic pipeline for eDNA analysis using two powerful tools: Nextflow and Singularity. This pipeline addresses two major challenges in the analysis of eDNA data; scalability and reproducibility.",
                "authors": [
                    {
                        "name": "Bunce M."
                    },
                    {
                        "name": "Christophersen C.T."
                    },
                    {
                        "name": "De La Pierre M."
                    },
                    {
                        "name": "Lines R."
                    },
                    {
                        "name": "Mousavi-Derazmahalleh M."
                    },
                    {
                        "name": "Nester G."
                    },
                    {
                        "name": "Peverley G."
                    },
                    {
                        "name": "Simpson T."
                    },
                    {
                        "name": "Stott A."
                    },
                    {
                        "name": "Zawierta M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-07-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "eDNAFlow, an automated, reproducible and scalable workflow for analysis of environmental DNA sequences exploiting Nextflow and Singularity"
            },
            "pmid": "33580619"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
