{
    "accessibility": "Open access",
    "additionDate": "2022-04-12T00:03:31.983927Z",
    "biotoolsCURIE": "biotools:msa_signature_attribution",
    "biotoolsID": "msa_signature_attribution",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "senkins@iarc.fr",
            "name": "Sergey Senkin",
            "orcidid": "https://orcid.org/0000-0001-5848-005X",
            "typeEntity": "Person"
        }
    ],
    "description": "Mutational signature attribution with confidence based on simulations",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/s.senkin/MSA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-12T00:03:31.986640Z",
    "license": "GPL-3.0",
    "name": "MSA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04450-8",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Mutational signatures proved to be a useful tool for identifying patterns of mutations in genomes, often providing valuable insights about mutagenic processes or normal DNA damage. De novo extraction of signatures is commonly performed using Non-Negative Matrix Factorisation methods, however, accurate attribution of these signatures to individual samples is a distinct problem requiring uncertainty estimation, particularly in noisy scenarios or when the acting signatures have similar shapes. Whilst many packages for signature attribution exist, a few provide accuracy measures, and most are not easily reproducible nor scalable in high-performance computing environments. Results: We present Mutational Signature Attribution (MSA), a reproducible pipeline designed to assign signatures of different mutation types on a single-sample basis, using Non-Negative Least Squares method with optimisation based on configurable simulations. Parametric bootstrap is proposed as a way to measure statistical uncertainties of signature attribution. Supported mutation types include single and doublet base substitutions, indels and structural variants. Results are validated using simulations with reference COSMIC signatures, as well as randomly generated signatures. Conclusions: MSA is a tool for optimised mutational signature attribution based on simulations, providing confidence intervals using parametric bootstrap. It comprises a set of Python scripts unified in a single Nextflow pipeline with containerisation for cross-platform reproducibility and scalability in high-performance computing environments. The tool is publicly available from https://gitlab.com/s.senkin/MSA.",
                "authors": [
                    {
                        "name": "Senkin S."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MSA: reproducible mutational signature attribution with confidence based on simulations"
            },
            "pmcid": "PMC8567580",
            "pmid": "34736398"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
