{
    "accessibility": "Open access",
    "additionDate": "2017-02-10T14:14:47Z",
    "biotoolsCURIE": "biotools:act",
    "biotoolsID": "act",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "D.R.Westhead@leeds.ac.uk",
            "name": "David R Westhead",
            "orcidid": "https://orcid.org/0000-0002-0519-3820",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://biologicalsciences.leeds.ac.uk/molecular-and-cellular-biology/staff/154/professor-david-r-westhead"
        },
        {
            "email": "imichalop@bioacademy.gr",
            "name": "Ioannis Michalopoulos",
            "orcidid": "https://orcid.org/0000-0001-8991-8712",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.michalopoulos.net/"
        }
    ],
    "description": "The Arabidopsis Coexpression Tool (ACT) is based on the coexpression analysis of 21273 Arabidopsis thaliana genes from gene pair correlation data of 3500 Affymetrix Arabidopsis ATH1 Genome Array Chip microarray samples.",
    "documentation": [
        {
            "type": [
                "FAQ"
            ],
            "url": "https://www.michalopoulos.net/act/help.php"
        }
    ],
    "editPermission": {
        "authors": [
            "imichalop@bioacademy.gr"
        ],
        "type": "private"
    },
    "elixirCommunity": [
        "Plant Sciences"
    ],
    "elixirNode": [
        "Greece"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene identifier",
                        "uri": "http://edamontology.org/data_1025"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene tree",
                        "uri": "http://edamontology.org/data_3271"
                    }
                }
            ]
        }
    ],
    "homepage": "https://www.michalopoulos.net/act/",
    "lastUpdate": "2021-07-27T20:15:39.408680Z",
    "maturity": "Mature",
    "name": "Arabidopsis Co-expression Tool (ACT)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "imichalop@bioacademy.gr",
    "publication": [
        {
            "doi": "10.1093/nar/gkl204",
            "metadata": {
                "abstract": "The Arabidopsis Co-expression Tool, ACT, ranks the genes across a large microarray dataset according to how closely their expression follows the expression of a query gene. A database stores pre-calculated co-expression results for ∼21 800 genes based on data from over 300 arrays. These results can be corroborated by calculation of co-expression results for user-defined sub-sets of arrays or experiments from the NASC/GARNet array dataset. Clique Finder (CF) identifies groups of genes which are consistently co-expressed with each other across a user-defined co-expression list. The parameters can be altered easily to adjust cluster size and the output examined for optimal inclusion of genes with known biological roles. Alternatively, a Scatter Plot tool displays the correlation coefficients for all genes against two user-selected queries on a scatter plot which can be useful for visual identification of clusters of genes with similar r-values. User-input groups of genes can be highlighted on the scatter plots. Inclusion of genes with known biology in sets of genes identified using CF and Scatter Plot tools allows inferences to be made about the roles of the other genes in the set and both tools can therefore be used to generate short lists of genes for further characterization. ACT is freely available at www.Arabidopsis.leeds.ac.uk/ACT. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Manfield I.W."
                    },
                    {
                        "name": "Jen C.-H."
                    },
                    {
                        "name": "Pinney J.W."
                    },
                    {
                        "name": "Michalopoulos I."
                    },
                    {
                        "name": "Bradford J.R."
                    },
                    {
                        "name": "Gilmartin P.M."
                    },
                    {
                        "name": "Westhead D.R."
                    }
                ],
                "citationCount": 120,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Arabidopsis Co-expression Tool (ACT): Web server tools for microarray-based gene expression analysis"
            },
            "pmcid": "PMC1538833",
            "pmid": "16845059",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1111/j.1365-313X.2006.02681.x",
            "metadata": {
                "abstract": "We present a new WWW-based tool for plant gene analysis, the Arabidopsis Co-Expression Tool (ACT), based on a large Arabidopsis thaliana microarray data set obtained from the Nottingham Arabidopsis Stock Centre. The co-expression analysis tool allows users to identify genes whose expression patterns are correlated across selected experiments or the complete data set. Results are accompanied by estimates of the statistical significance of the correlation relationships, expressed as probability (P) and expectation (E) values. Additionally, highly ranked genes on a correlation list can be examined using the novel CLIQUE FINDER tool to determine the sets of genes most likely to be regulated in a similar manner. In combination, these tools offer three levels of analysis: creation of correlation lists of co-expressed genes, refinement of these lists using two-dimensional scatter plots, and dissection into cliques of co-regulated genes. We illustrate the applications of the software by analysing genes encoding functionally related proteins, as well as pathways involved in plant responses to environmental stimuli. These analyses demonstrate novel biological relationships underlying the observed gene co-expression patterns. To demonstrate the ability of the software to develop testable hypotheses on gene function within a defined biological process we have used the example of cell wall biosynthesis genes. The resource is freely available at http://www.arabidopsis.leeds.ac.uk/ACT/. © 2006 The Authors.",
                "authors": [
                    {
                        "name": "Jen C.-H."
                    },
                    {
                        "name": "Manfield I.W."
                    },
                    {
                        "name": "Michalopoulos I."
                    },
                    {
                        "name": "Pinney J.W."
                    },
                    {
                        "name": "Willats W.G.T."
                    },
                    {
                        "name": "Gilmartin P.M."
                    },
                    {
                        "name": "Westhead D.R."
                    }
                ],
                "citationCount": 62,
                "date": "2006-04-01T00:00:00Z",
                "journal": "Plant Journal",
                "title": "The Arabidopsis co-expression tool (ACT): A WWW-based tool and database for microarray-based gene expression analysis"
            },
            "pmid": "16623895",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1016/j.isci.2021.102848",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}