{
    "accessibility": "Open access",
    "additionDate": "2017-02-10T14:14:47Z",
    "biotoolsCURIE": "biotools:act",
    "biotoolsID": "act",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "D.R.Westhead@leeds.ac.uk",
            "name": "David R Westhead",
            "orcidid": "https://orcid.org/0000-0002-0519-3820",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://biologicalsciences.leeds.ac.uk/molecular-and-cellular-biology/staff/154/professor-david-r-westhead"
        },
        {
            "email": "imichalop@bioacademy.gr",
            "name": "Ioannis Michalopoulos",
            "orcidid": "https://orcid.org/0000-0001-8991-8712",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.michalopoulos.net/"
        }
    ],
    "description": "The Arabidopsis Coexpression Tool (ACT) is based on the coexpression analysis of 21273 Arabidopsis thaliana genes from gene pair correlation data of 3500 Affymetrix Arabidopsis ATH1 Genome Array Chip microarray samples.",
    "documentation": [
        {
            "type": [
                "FAQ"
            ],
            "url": "https://www.michalopoulos.net/act/help.php"
        }
    ],
    "editPermission": {
        "authors": [
            "imichalop@bioacademy.gr"
        ],
        "type": "private"
    },
    "elixirCommunity": [
        "Plant Sciences"
    ],
    "elixirNode": [
        "Greece"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene identifier",
                        "uri": "http://edamontology.org/data_1025"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene tree",
                        "uri": "http://edamontology.org/data_3271"
                    }
                }
            ]
        }
    ],
    "homepage": "https://www.michalopoulos.net/act/",
    "lastUpdate": "2023-02-03T12:49:57.576074Z",
    "maturity": "Mature",
    "name": "Arabidopsis Co-expression Tool (ACT)",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "imichalop@bioacademy.gr",
    "publication": [
        {
            "doi": "10.1016/j.isci.2021.102848",
            "metadata": {
                "abstract": "© 2021 The AuthorsGene coexpression analysis refers to the discovery of sets of genes which exhibit similar expression patterns across multiple transcriptomic data sets, such as microarray experiment data of public repositories. Arabidopsis Coexpression Tool (ACT), a gene coexpression analysis web tool for Arabidopsis thaliana, identifies genes which are correlated to a driver gene. Primary microarray data from ATH1 Affymetrix platform were processed with Single-Channel Array Normalization algorithm and combined to produce a coexpression tree which contains ∼21,000 A. thaliana genes. ACT was developed to present subclades of coexpressed genes, as well as to perform gene set enrichment analysis, being unique in revealing enriched transcription factors targeting coexpressed genes. ACT offers a simple and user-friendly interface producing working hypotheses which can be experimentally verified for the discovery of gene partnership, pathway membership, and transcriptional regulation. ACT analyses have been successful in identifying not only genes with coordinated ubiquitous expressions but also genes with tissue-specific expressions.",
                "authors": [
                    {
                        "name": "Angelopoulou A."
                    },
                    {
                        "name": "Daras G."
                    },
                    {
                        "name": "Duddy W.J."
                    },
                    {
                        "name": "Hatzopoulos P."
                    },
                    {
                        "name": "Jen C.-H."
                    },
                    {
                        "name": "Malatras A."
                    },
                    {
                        "name": "Michalopoulos I."
                    },
                    {
                        "name": "Saxami G."
                    },
                    {
                        "name": "Westhead D.R."
                    },
                    {
                        "name": "Zogopoulos V.L."
                    }
                ],
                "citationCount": 7,
                "date": "2021-08-20T00:00:00Z",
                "journal": "iScience",
                "title": "Arabidopsis Coexpression Tool: a tool for gene coexpression analysis in Arabidopsis thaliana"
            },
            "pmcid": "PMC8334378",
            "pmid": "34381973",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1016/j.xpro.2022.101208",
            "metadata": {
                "abstract": "© 2022 The Author(s)Coexpressed genes tend to participate in related biological processes. Gene coexpression analysis allows the discovery of functional gene partners or the assignment of biological roles to genes of unknown function. In this protocol, we describe the steps necessary to create a gene coexpression tree for Arabidopsis thaliana, using publicly available Affymetrix CEL microarray data. Because the computational analysis described here is highly dependent on sample quality, we detail an automatic quality control approach. For complete details on the use and execution of this protocol, please refer to Zogopoulos et al. (2021).",
                "authors": [
                    {
                        "name": "Malatras A."
                    },
                    {
                        "name": "Michalopoulos I."
                    },
                    {
                        "name": "Zogopoulos V.L."
                    }
                ],
                "citationCount": 2,
                "date": "2022-03-18T00:00:00Z",
                "journal": "STAR Protocols",
                "title": "Gene coexpression analysis in Arabidopsis thaliana based on public microarray data"
            },
            "pmcid": "PMC8885756",
            "pmid": "35243384",
            "type": [
                "Method"
            ]
        },
        {
            "doi": "10.1093/nar/gkl204",
            "metadata": {
                "abstract": "The Arabidopsis Co-expression Tool, ACT, ranks the genes across a large microarray dataset according to how closely their expression follows the expression of a query gene. A database stores pre-calculated co-expression results for ∼21 800 genes based on data from over 300 arrays. These results can be corroborated by calculation of co-expression results for user-defined sub-sets of arrays or experiments from the NASC/GARNet array dataset. Clique Finder (CF) identifies groups of genes which are consistently co-expressed with each other across a user-defined co-expression list. The parameters can be altered easily to adjust cluster size and the output examined for optimal inclusion of genes with known biological roles. Alternatively, a Scatter Plot tool displays the correlation coefficients for all genes against two user-selected queries on a scatter plot which can be useful for visual identification of clusters of genes with similar r-values. User-input groups of genes can be highlighted on the scatter plots. Inclusion of genes with known biology in sets of genes identified using CF and Scatter Plot tools allows inferences to be made about the roles of the other genes in the set and both tools can therefore be used to generate short lists of genes for further characterization. ACT is freely available at www.Arabidopsis.leeds.ac.uk/ACT. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Bradford J.R."
                    },
                    {
                        "name": "Gilmartin P.M."
                    },
                    {
                        "name": "Jen C.-H."
                    },
                    {
                        "name": "Manfield I.W."
                    },
                    {
                        "name": "Michalopoulos I."
                    },
                    {
                        "name": "Pinney J.W."
                    },
                    {
                        "name": "Westhead D.R."
                    }
                ],
                "citationCount": 127,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Arabidopsis Co-expression Tool (ACT): Web server tools for microarray-based gene expression analysis"
            },
            "pmcid": "PMC1538833",
            "pmid": "16845059",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.3390/biology11071019",
            "metadata": {
                "abstract": "© 2022 by the authors. Licensee MDPI, Basel, Switzerland.Gene coexpression analysis constitutes a widely used practice for gene partner identification and gene function prediction, consisting of many intricate procedures. The analysis begins with the collection of primary transcriptomic data and their preprocessing, continues with the calculation of the similarity between genes based on their expression values in the selected sample dataset and results in the construction and visualisation of a gene coexpression network (GCN) and its evaluation using biological term enrichment analysis. As gene coexpression analysis has been studied ex-tensively, we present most parts of the methodology in a clear manner and the reasoning behind the selection of some of the techniques. In this review, we offer a comprehensive and comprehensi-ble account of the steps required for performing a complete gene coexpression analysis in eukary-otic organisms. We comment on the use of RNA‐Seq vs. microarrays, as well as the best practices for GCN construction. Furthermore, we recount the most popular webtools and standalone applications performing gene coexpression analysis, with details on their methods, features and outputs.",
                "authors": [
                    {
                        "name": "Iconomidou V.A."
                    },
                    {
                        "name": "Malatras A."
                    },
                    {
                        "name": "Michalopoulos I."
                    },
                    {
                        "name": "Papadopoulos K."
                    },
                    {
                        "name": "Saxami G."
                    },
                    {
                        "name": "Tsotra I."
                    },
                    {
                        "name": "Zogopoulos V.L."
                    }
                ],
                "date": "2022-07-01T00:00:00Z",
                "journal": "Biology",
                "title": "Approaches in Gene Coexpression Analysis in Eukaryotes"
            },
            "pmcid": "PMC9312353",
            "pmid": "36101400",
            "type": [
                "Review"
            ]
        },
        {
            "doi": "10.1111/j.1365-313X.2006.02681.x",
            "pmid": "16623895",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1,
    "version": [
        "2.0"
    ]
}
