
{
    "credit": [
        {
            "email": "ahmad.chan@yale.edu",
            "name": "Syed Ahmad Chan Bukhari",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "JavaScript"
        ],
        "license": "GPL-1.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Plug-in"
        ],
        "topic": [
            {
                "term": "Ontology and terminology",
                "uri": "http://edamontology.org/topic_0089"
            }
        ]
    },
    "link": [
        {
            "type": "REPOSITORY",
            "url": "https://github.com/ahmadchan/CEDAROnDemand"
        }
    ],
    "publication": [
        {
            "abstract": "© 2018 The Author(s). Background: Public biomedical data repositories often provide web-based interfaces to collect experimental metadata. However, these interfaces typically reflect the ad hoc metadata specification practices of the associated repositories, leading to a lack of standardization in the collected metadata. This lack of standardization limits the ability of the source datasets to be broadly discovered, reused, and integrated with other datasets. To increase reuse, discoverability, and reproducibility of the described experiments, datasets should be appropriately annotated by using agreed-upon terms, ideally from ontologies or other controlled term sources. Results: This work presents \"CEDAR OnDemand\", a browser extension powered by the NCBO (National Center for Biomedical Ontology) BioPortal that enables users to seamlessly enter ontology-based metadata through existing web forms native to individual repositories. CEDAR OnDemand analyzes the web page contents to identify the text input fields and associate them with relevant ontologies which are recommended automatically based upon input fields' labels (using the NCBO ontology recommender) and a pre-defined list of ontologies. These field-specific ontologies are used for controlling metadata entry. CEDAR OnDemand works for any web form designed in the HTML format. We demonstrate how CEDAR OnDemand works through the NCBI (National Center for Biotechnology Information) BioSample web-based metadata entry. Conclusion: CEDAR OnDemand helps lower the barrier of incorporating ontologies into standardized metadata entry for public data repositories. CEDAR OnDemand is available freely on the Google Chrome store https://chrome.google.com/webstore/search/CEDAROnDemand",
            "authors": [
                "Bukhari S.A.C.",
                "Martinez-Romero M.",
                "O' Connor M.J.",
                "Egyedi A.L.",
                "Willrett D.",
                "Graybeal J.",
                "Musen M.A.",
                "Cheung K.-H.",
                "Kleinstein S.H."
            ],
            "cit_count": 1,
            "doi": "10.1186/s12859-018-2247-6",
            "journal": "BMC Bioinformatics",
            "title": "CEDAR OnDemand: A browser extension to generate ontology-based scientific metadata",
            "type": "Primary",
            "year": "2018-07-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cedar_ondemand",
        "biotoolsID": "cedar_ondemand",
        "description": "It is a chrome browser extension that enables users to seamlessly enter ontology-based metadata using existing web-based submission forms provided by metadata repositories. The use of controlled vocabularies for entering metadata can help improve the quality of metadata submitted to repositories and ultimately contributes to the creation of FAIR data.",
        "homepage": "https://chrome.google.com/webstore/search/CEDAROnDemand",
        "name": "CEDAR OnDemand"
    }
}