{
    "additionDate": "2018-05-06T15:27:09Z",
    "biotoolsCURIE": "biotools:gimli",
    "biotoolsID": "gimli",
    "credit": [
        {
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/login?return_to=https%3A%2F%2Fgithub.com%2FBMDSoftware%2Fneji%2Fissues%2Fnew"
        }
    ],
    "description": "Open source and high-performance biomedical name recognition.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/BMDSoftware/neji"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BMDSoftware/neji",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "license": "NCSA",
    "name": "Gimli",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/1471-2105-14-54",
            "metadata": {
                "abstract": "Background: Automatic recognition of biomedical names is an essential task in biomedical information extraction, presenting several complex and unsolved challenges. In recent years, various solutions have been implemented to tackle this problem. However, limitations regarding system characteristics, customization and usability still hinder their wider application outside text mining research.Results: We present Gimli, an open-source, state-of-the-art tool for automatic recognition of biomedical names. Gimli includes an extended set of implemented and user-selectable features, such as orthographic, morphological, linguistic-based, conjunctions and dictionary-based. A simple and fast method to combine different trained models is also provided. Gimli achieves an F-measure of 87.17% on GENETAG and 72.23% on JNLPBA corpus, significantly outperforming existing open-source solutions.Conclusions: Gimli is an off-the-shelf, ready to use tool for named-entity recognition, providing trained and optimized models for recognition of biomedical entities from scientific text. It can be used as a command line tool, offering full functionality, including training of new models and customization of the feature set and model parameters through a configuration file. Advanced users can integrate Gimli in their text mining workflows through the provided library, and extend or adapt its functionalities. Based on the underlying system characteristics and functionality, both for final users and developers, and on the reported performance results, we believe that Gimli is a state-of-the-art solution for biomedical NER, contributing to faster and better research in the field. Gimli is freely available at http://bioinformatics.ua.pt/gimli. © 2013 Campos et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Campos D."
                    },
                    {
                        "name": "Matos S."
                    },
                    {
                        "name": "Oliveira J.L."
                    }
                ],
                "citationCount": 59,
                "date": "2013-02-15T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Gimli: Open source and high-performance biomedical name recognition"
            },
            "pmcid": "PMC3651325",
            "pmid": "23413997"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}