{
    "additionDate": "2018-06-18T18:45:41Z",
    "biotoolsCURIE": "biotools:absim",
    "biotoolsID": "absim",
    "credit": [
        {
            "email": "ayermano@ethz.ch",
            "name": "Alexander Yermanos",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Simulation methods for the evolution of antibody repertoires. The heavy and light chain variable region of both human and C57BL/6 mice can be simulated in a time-dependent fashion. Both single lineages using one set of V-, D-, and J-genes or full repertoires can be simulated.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://cran.r-project.org/web/packages/AbSim/AbSim.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/AbSim/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "license": "GPL-2.0",
    "name": "AbSim",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx533",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation: The evolution of antibody repertoires represents a hallmark feature of adaptive B-cell immunity. Recent advancements in high-throughput sequencing have dramatically increased the resolution to which we can measure the molecular diversity of antibody repertoires, thereby offering for the first time the possibility to capture the antigen-driven evolution of B cells. However, there does not exist a repertoire simulation framework yet that enables the comparison of commonly utilized phylogenetic methods with regard to their accuracy in inferring antibody evolution. Results: Here, we developed AbSim, a time-resolved antibody repertoire simulation framework, which we exploited for testing the accuracy of methods for the phylogenetic reconstruction of B-cell lineages and antibody molecular evolution. AbSim enables the (i) simulation of intermediate stages of antibody sequence evolution and (ii) the modeling of immunologically relevant parameters such as duration of repertoire evolution, and themethod and frequency ofmutations. First, we validated that our repertoire simulation framework recreates replicates topological similarities observed in experimental sequencing data. Second, we leveraged Absim to show that current methods fail to a certain extent to predict the true phylogenetic tree correctly. Finally, we formulated simulation-validated guidelines for antibody evolution, which in the future will enable the development of accurate phylogenetic methods.",
                "authors": [
                    {
                        "name": "Yermanos A."
                    },
                    {
                        "name": "Greiff V."
                    },
                    {
                        "name": "Krautler N.J."
                    },
                    {
                        "name": "Menzel U."
                    },
                    {
                        "name": "Dounas A."
                    },
                    {
                        "name": "Miho E."
                    },
                    {
                        "name": "Oxenius A."
                    },
                    {
                        "name": "Stadler T."
                    },
                    {
                        "name": "Reddy S.T."
                    }
                ],
                "citationCount": 14,
                "date": "2017-12-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Comparison of methods for phylogenetic B-cell lineage inference using time-resolved antibody repertoire simulations (AbSim)"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Simulation experiment",
            "uri": "http://edamontology.org/topic_3524"
        }
    ],
    "validated": 1,
    "version": [
        "0.2.4"
    ]
}