{
    "additionDate": "2020-01-09T18:04:48Z",
    "biotoolsCURIE": "biotools:SNAP-Ed",
    "biotoolsID": "SNAP-Ed",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "andy@agriculturalinstitute.org",
            "name": "Andy Naja-Riese",
            "orcidid": "https://orcid.org/0000-0002-2355-2823",
            "typeEntity": "Person"
        }
    ],
    "description": "demonstrating the impact of a national framework for obesity prevention in low-income populations.\n\nSNAP-Ed Evaluation Framework – SNAP-Ed Toolkit.\n\n* SNAP-Ed Priority Outcome Indicator.\n\nWelcome to the new SNAP-Ed Toolkit website! This toolkit will help SNAP-Ed Implementing Agencies across the country find evidence-based interventions and explore the SNAP-Ed Evaluation Framework in order to strengthen our impact on our goal to help SNAP-eligible households make healthy eating and physical activity choices on a limited budget.\n\nIn 2019, 52 new interventions were added to the SNAP-Ed Toolkit!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://snapedtoolkit.org/framework/index/",
    "lastUpdate": "2020-01-09T18:04:48Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://snapedtoolkit.org/"
        }
    ],
    "name": "SNAP-Ed",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/TBM/IBZ115",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of the Society of Behavioral Medicine.The United States Department of Agriculture's Supplemental Nutrition Assistance Program Education, known as SNAP-Ed, is the country's largest and most diverse community nutrition program. In 2017, nearly 140 SNAP-Ed implementing agencies (SIAs) and hundreds of contractors delivered nutrition education to almost 5 million people in nearly 60,000 low-resource sites. Millions more were impacted with social marketing campaigns and policy, systems, and environmental changes. This article introduces and describes the benefits of the newly developed SNAP-Ed Evaluation Framework (Framework) and companion Interpretive Guide to consistently measure SNAP-Ed outcomes across different settings. The Framework uses the social ecological model as its underlying theory and features 51 indicators across four levels: Individual, Environmental Supports, Sectors of Influence, and Population Results. Topline findings from the first-year Census to track Framework adoption found that most SIAs intended to impact indicators closer to the inner levels of influence: Individual (mean = 59% of SIAs; SD = 22%) and Environmental Settings (mean = 48%; SD = 23%). As yet, few SIAs targeted outcomes for long-term indicators (mean = 26%; SD = 15%), Sectors of Influence (mean = 20%; SD = 12%), or Population Results (mean = 30%; SD = 11%). An in-depth example of how one state is using the Framework is described. The SNAP-Ed Evaluation Framework offers a new suite of evaluation measures toward eliminating disparities that contribute to poor diet, physical inactivity, food insecurity and obesity. Practitioners will need technical assistance to implement the Framework, especially to measure longer-term, multi-sector and population results, and to maximize effectiveness in SNAP-Ed.",
                "authors": [
                    {
                        "name": "Naja-Riese A."
                    },
                    {
                        "name": "Keller K.J.M."
                    },
                    {
                        "name": "Bruno P."
                    },
                    {
                        "name": "Foerster S.B."
                    },
                    {
                        "name": "Puma J."
                    },
                    {
                        "name": "Whetstone L."
                    },
                    {
                        "name": "Mknelly B."
                    },
                    {
                        "name": "Cullinen K."
                    },
                    {
                        "name": "Jacobs L."
                    },
                    {
                        "name": "Sugerman S."
                    }
                ],
                "citationCount": 1,
                "date": "2019-09-30T00:00:00Z",
                "journal": "Translational Behavioral Medicine",
                "title": "The SNAP-Ed Evaluation Framework: Demonstrating the impact of a national framework for obesity prevention in low-income populations"
            },
            "pmcid": "PMC6768857",
            "pmid": "31570929"
        }
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}