{
    "accessibility": "Open access",
    "additionDate": "2017-03-04T22:58:46Z",
    "biotoolsCURIE": "biotools:rdrf",
    "biotoolsID": "rdrf",
    "collectionID": [
        "Developed_RD-Connect",
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rdrf@ccg.murdoch.edu.au",
            "name": "RDRF Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Rare Disease Registry Framework (RDRF) is an open source tool for the creation of web-based patient registries. It enables to create and modify registries without changes to the programming code. It has many features which include its ability to create multiple registries within the same framework, patients are defined once, and the ability for curators to create data elements dynamically well after the registry has been defined.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://muccg.github.io/rdrf/docs/"
        },
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://muccg.github.io/rdrf/docs/installation/index.html"
        }
    ],
    "editPermission": {
        "authors": [
            "lmatalonga"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://muccg.github.io/rdrf/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "RDRF",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1186/1751-0473-9-14",
            "metadata": {
                "abstract": "Background: Information management systems are essential to capture data be it for public health and human disease, sustainable agriculture, or plant and animal biosecurity. In public health, the term patient registry is often used to describe information management systems that are used to record and track phenotypic data of patients. Appropriate design, implementation and deployment of patient registries enables rapid decision making and ongoing data mining ultimately leading to improved patient outcomes. A major bottleneck encountered is the static nature of these registries. That is, software developers are required to work with stakeholders to determine requirements, design the system, implement the required data fields and functionality for each patient registry. Additionally, software developer time is required for ongoing maintenance and customisation. It is desirable to deploy a sophisticated registry framework that can allow scientists and registry curators possessing standard computing skills to dynamically construct a complete patient registry from scratch and customise it for their specific needs with little or no need to engage a software developer at any stage.Results: This paper introduces our second generation open source registry framework which builds on our previous rare disease registry framework (RDRF). This second generation RDRF is a new approach as it empowers registry administrators to construct one or more patient registries without software developer effort. New data elements for a diverse range of phenotypic and genotypic measurements can be defined at any time. Defined data elements can then be utilised in any of the created registries. Fine grained, multi-level user and workgroup access can be applied to each data element to ensure appropriate access and data privacy. We introduce the concept of derived data elements to assist the data element standards communities on how they might be best categorised.Conclusions: We introduce the second generation RDRF that enables the user-driven dynamic creation of patient registries. We believe this second generation RDRF is a novel approach to patient registry design, implementation and deployment and a significant advance on existing registry systems. © 2014 Bellgard et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Bellgard M.I."
                    },
                    {
                        "name": "Render L."
                    },
                    {
                        "name": "Radochonski M."
                    },
                    {
                        "name": "Hunter A."
                    }
                ],
                "citationCount": 18,
                "date": "2014-06-20T00:00:00Z",
                "journal": "Source Code for Biology and Medicine",
                "title": "Second generation registry framework"
            },
            "pmcid": "PMC4075501",
            "pmid": "24982690",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ]
}