{
    "additionDate": "2015-12-06T15:18:08Z",
    "biotoolsCURIE": "biotools:barc",
    "biotoolsID": "barc",
    "credit": [
        {
            "name": "bils.se",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "support@barcdb.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A freely available catalogue describing expertise and molecular analysis resources available at centers and companies in Sweden for analysis of biobanked samples.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Keyword",
                        "uri": "http://edamontology.org/data_0968"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Resource metadata",
                        "uri": "http://edamontology.org/data_2337"
                    }
                }
            ]
        }
    ],
    "homepage": "http://barcdb.se/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:36Z",
    "name": "BARC",
    "owner": "mikael.borg@bils.se",
    "publication": [
        {
            "doi": "10.1038/ejhg.2014.235",
            "metadata": {
                "abstract": "© 2015 Macmillan Publishers Limited All rights reserved.Biological resources (cells, tissues, bodily fluids or biomolecules) are considered essential raw material for the advancement of health-related biotechnology, for research and development in life sciences, and for ultimately improving human health. Stored in local biobanks, access to the human biological samples and related medical data for transnational research is often limited, in particular for the international life science industry. The recently established pan-European Biobanking and BioMolecular resources Research Infrastructure-European Research Infrastructure Consortium (BBMRI-ERIC) aims to improve accessibility and interoperability between academic and industrial parties to benefit personalized medicine, disease prevention to promote development of new diagnostics, devices and medicines. BBMRI-ERIC is developing the concept of Expert Centre as public-private partnerships in the precompetitive, not-for-profit field to provide a new structure to perform research projects that would face difficulties under currently established models of academic-industry collaboration. By definition, Expert Centres are key intermediaries between public and private sectors performing the analysis of biological samples under internationally standardized conditions. This paper presents the rationale behind the Expert Centres and illustrates the novel concept with model examples.",
                "authors": [
                    {
                        "name": "Van Ommen G.-J.B."
                    },
                    {
                        "name": "Tornwall O."
                    },
                    {
                        "name": "Brechot C."
                    },
                    {
                        "name": "Dagher G."
                    },
                    {
                        "name": "Galli J."
                    },
                    {
                        "name": "Hveem K."
                    },
                    {
                        "name": "Landegren U."
                    },
                    {
                        "name": "Luchinat C."
                    },
                    {
                        "name": "Metspalu A."
                    },
                    {
                        "name": "Nilsson C."
                    },
                    {
                        "name": "Solesvik O.V."
                    },
                    {
                        "name": "Perola M."
                    },
                    {
                        "name": "Litton J.-E."
                    },
                    {
                        "name": "Zatloukal K."
                    }
                ],
                "citationCount": 40,
                "date": "2015-01-01T00:00:00Z",
                "journal": "European Journal of Human Genetics",
                "title": "BBMRI-ERIC as a resource for pharmaceutical and life science industries: The development of biobank-based Expert Centres"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "validated": 1
}