{
    "accessibility": "Open access",
    "additionDate": "2024-01-02T18:06:58.303687Z",
    "biotoolsCURIE": "biotools:timesweeper",
    "biotoolsID": "timesweeper",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "drs@unc.edu",
            "name": "Daniel R Schrider",
            "orcidid": "https://orcid.org/0000-0001-5249-4151",
            "typeEntity": "Person"
        }
    ],
    "description": "Accurately identifying selective sweeps using population genomic time series.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SchriderLab/Timesweeper",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-01-02T18:06:58.306330Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/Timesweeper/"
        }
    ],
    "name": "Timesweeper",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/GENETICS/IYAD084",
            "metadata": {
                "abstract": "Despite decades of research, identifying selective sweeps, the genomic footprints of positive selection, remains a core problem in population genetics. Of the myriad methods that have been developed to tackle this task, few are designed to leverage the potential of genomic time-series data. This is because in most population genetic studies of natural populations, only a single period of time can be sampled. Recent advancements in sequencing technology, including improvements in extracting and sequencing ancient DNA, have made repeated samplings of a population possible, allowing for more direct analysis of recent evolutionary dynamics. Serial sampling of organisms with shorter generation times has also become more feasible due to improvements in the cost and throughput of sequencing. With these advances in mind, here we present Timesweeper, a fast and accurate convolutional neural network-based tool for identifying selective sweeps in data consisting of multiple genomic samplings of a population over time. Timesweeper analyzes population genomic time-series data by first simulating training data under a demographic model appropriate for the data of interest, training a one-dimensional convolutional neural network on said simulations, and inferring which polymorphisms in this serialized data set were the direct target of a completed or ongoing selective sweep. We show that Timesweeper is accurate under multiple simulated demographic and sampling scenarios, identifies selected variants with high resolution, and estimates selection coefficients more accurately than existing methods. In sum, we show that more accurate inferences about natural selection are possible when genomic time-series data are available; such data will continue to proliferate in coming years due to both the sequencing of ancient samples and repeated samplings of extant populations with faster generation times, as well as experimentally evolved populations where time-series data are often generated. Methodological advances such as Timesweeper thus have the potential to help resolve the controversy over the role of positive selection in the genome. We provide Timesweeper as a Python package for use by the community.",
                "authors": [
                    {
                        "name": "Schrider D.R."
                    },
                    {
                        "name": "Whitehouse L.S."
                    }
                ],
                "citationCount": 2,
                "date": "2023-07-01T00:00:00Z",
                "journal": "Genetics",
                "title": "Timesweeper: accurately identifying selective sweeps using population genomic time series"
            },
            "pmcid": "PMC10324941",
            "pmid": "37157914",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Population genomics",
            "uri": "http://edamontology.org/topic_3796"
        }
    ]
}
