{
    "accessibility": "Open access",
    "additionDate": "2022-01-15T02:55:29.991397Z",
    "biotoolsCURIE": "biotools:irgvalid",
    "biotoolsID": "irgvalid",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wzhou@xyzlabc.com",
            "name": "Wenli Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "Zhongxu Zhu",
            "orcidid": "https://orcid.org/0000-0003-2197-5563"
        },
        {
            "name": "Keqin Gregg"
        }
    ],
    "description": "A Robust in silico Method for Optimal Reference Gene Validation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Expression profile comparison",
                    "uri": "http://edamontology.org/operation_0315"
                }
            ]
        }
    ],
    "homepage": "https://wlake.shinyapps.io/iRGvalid/",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-01-15T02:55:29.993865Z",
    "license": "Not licensed",
    "name": "iRGvalid",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.716653",
            "metadata": {
                "abstract": "© Copyright © 2021 Zhu, Gregg and Zhou.Background: Appropriate reference genes are critical to accurately quantifying relative gene expression in research and clinical applications. Numerous efforts have been made to select the most stable reference gene(s), but a consensus has yet to be achieved. In this report, we propose an in silico reference gene validation method, iRGvalid, that can be used as a universal tool to validate the reference genes recommended from different resources so as to identify the best ones without a need for any wet lab validation tests. Methods: iRGvalid takes advantage of high throughput gene expression data and is built on a double-normalization strategy. First, the expression level of each individual gene is normalized against the total gene expression level of each sample, followed by a target gene normalization to the candidate reference gene(s). Linear regression analysis is then performed between the pre- and post- normalized target gene across the whole sample set to evaluate the stability of the reference gene(s), which is positively associated with the Pearson correlation coefficient, Rt. The higher the Rt value, the more stable the reference gene. We applied iRGvalid to 14 candidate reference genes to validate and identify the most stable reference genes in four cancer types: lung adenocarcinoma, breast cancer, colon adenocarcinoma, and nasopharyngeal cancer. The stability of the reference gene is evaluated both individually and in groups of all possible combinations. Results: Highly stable reference genes resulted in high Rt values regardless of the target gene used. The highest stability was achieved with a specific combination of 3 to 6 reference genes. A few genes were among the best reference genes across the cancer types studied here. Conclusion: iRGvalid provides an easy and robust method to validate and identify the most stable reference gene or genes from a pool of candidate reference genes. The inclusivity of large expression data sets as well as the direct comparison of candidate reference genes makes it possible to identify reference genes with universal quality. This method can be used in any other gene expression studies when large cohorts of expression data are available.",
                "authors": [
                    {
                        "name": "Zhu Z."
                    },
                    {
                        "name": "Gregg K."
                    },
                    {
                        "name": "Zhou W."
                    }
                ],
                "date": "2021-08-04T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "iRGvalid: A Robust in silico Method for Optimal Reference Gene Validation"
            },
            "pmcid": "PMC8372526",
            "pmid": "34422018"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}