{
    "additionDate": "2017-12-18T00:07:01Z",
    "biotoolsCURIE": "biotools:guess",
    "biotoolsID": "guess",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bgx.org.uk/index.html"
        }
    ],
    "description": "GUESS is a computationally optimised C++ implementation of a fully Bayesian variable selection approach that can analyse, in a genome-wide context, single and multiple responses in an integrated way.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bgx.org.uk/software/R2GUESS-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://bgx.org.uk/software/guess.html",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/guess-1-0-graphical-processing-unit-evolutionary-stochastic-search.html"
        }
    ],
    "name": "GUESS",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pgen.1003657",
            "metadata": {
                "abstract": "Genome-wide association studies (GWAS) yielded significant advances in defining the genetic architecture of complex traits and disease. Still, a major hurdle of GWAS is narrowing down multiple genetic associations to a few causal variants for functional studies. This becomes critical in multi-phenotype GWAS where detection and interpretability of complex SNP(s)-trait(s) associations are complicated by complex Linkage Disequilibrium patterns between SNPs and correlation between traits. Here we propose a computationally efficient algorithm (GUESS) to explore complex genetic-association models and maximize genetic variant detection. We integrated our algorithm with a new Bayesian strategy for multi-phenotype analysis to identify the specific contribution of each SNP to different trait combinations and study genetic regulation of lipid metabolism in the Gutenberg Health Study (GHS). Despite the relatively small size of GHS (n = 3,175), when compared with the largest published meta-GWAS (n>100,000), GUESS recovered most of the major associations and was better at refining multi-trait associations than alternative methods. Amongst the new findings provided by GUESS, we revealed a strong association of SORT1 with TG-APOB and LIPC with TG-HDL phenotypic groups, which were overlooked in the larger meta-GWAS and not revealed by competing approaches, associations that we replicated in two independent cohorts. Moreover, we demonstrated the increased power of GUESS over alternative multi-phenotype approaches, both Bayesian and non-Bayesian, in a simulation study that mimics real-case scenarios. We showed that our parallel implementation based on Graphics Processing Units outperforms alternative multi-phenotype methods. Beyond multivariate modelling of multi-phenotypes, our Bayesian model employs a flexible hierarchical prior structure for genetic effects that adapts to any correlation structure of the predictors and increases the power to identify associated variants. This provides a powerful tool for the analysis of diverse genomic features, for instance including gene expression and exome sequencing data, where complex dependencies are present in the predictor space. © 2013 Bottolo et al.",
                "authors": [
                    {
                        "name": "Blankenberg S."
                    },
                    {
                        "name": "Bottolo L."
                    },
                    {
                        "name": "Butterworth A.S."
                    },
                    {
                        "name": "Cambien F."
                    },
                    {
                        "name": "Castagne R."
                    },
                    {
                        "name": "Chadeau-Hyam M."
                    },
                    {
                        "name": "Danesh J."
                    },
                    {
                        "name": "Falchi M."
                    },
                    {
                        "name": "Froguel P."
                    },
                    {
                        "name": "Fumeron F."
                    },
                    {
                        "name": "Hastie D.I."
                    },
                    {
                        "name": "Ho W.K."
                    },
                    {
                        "name": "Liquet B."
                    },
                    {
                        "name": "Munzel T."
                    },
                    {
                        "name": "Newcombe P."
                    },
                    {
                        "name": "Nielsen S.F."
                    },
                    {
                        "name": "Nordestgaard B.G."
                    },
                    {
                        "name": "Petretto E."
                    },
                    {
                        "name": "Richardson S."
                    },
                    {
                        "name": "Schillert A."
                    },
                    {
                        "name": "Tiret L."
                    },
                    {
                        "name": "Tregouet D."
                    },
                    {
                        "name": "Tybjaerg-Hansen A."
                    },
                    {
                        "name": "Wild P.S."
                    },
                    {
                        "name": "Yengo L."
                    },
                    {
                        "name": "Zeller T."
                    },
                    {
                        "name": "Ziegler A."
                    }
                ],
                "citationCount": 43,
                "date": "2013-08-01T00:00:00Z",
                "journal": "PLoS Genetics",
                "title": "GUESS-ing Polygenic Associations with Multiple Phenotypes Using a GPU-Based Evolutionary Stochastic Search Algorithm"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}
