{
    "additionDate": "2020-01-14T19:49:34Z",
    "biotoolsCURIE": "biotools:deBGA-VARA",
    "biotoolsID": "deBGA-VARA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ydwang@hit.edu.cn",
            "name": "Yadong Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Fast read alignment with incorporation of known genomic variants.\ndeBGA-VARA is a novel variation-aware high-throughput sequencing read aligner. VARA is a variation-aware read global alignment algorithm. We developed deBGA-VARA by integrating VARA into deBGA. It is suitable for aligning various kinds of high-throughput sequencing reads to multiple similar reference genomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome indexing",
                    "uri": "http://edamontology.org/operation_3211"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                },
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hitbc/deBGA-VARA",
    "language": [
        "C"
    ],
    "lastUpdate": "2020-12-17T14:25:25Z",
    "name": "deBGA-VARA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0960-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Many genetic variants have been reported from sequencing projects due to decreasing experimental costs. Compared to the current typical paradigm, read mapping incorporating existing variants can improve the performance of subsequent analysis. This method is supposed to map sequencing reads efficiently to a graphical index with a reference genome and known variation to increase alignment quality and variant calling accuracy. However, storing and indexing various types of variation require costly RAM space. Methods: Aligning reads to a graph model-based index including the whole set of variants is ultimately an NP-hard problem in theory. Here, we propose a variation-aware read alignment algorithm (VARA), which generates the alignment between read and multiple genomic sequences simultaneously utilizing the schema of the Landau-Vishkin algorithm. VARA dynamically extracts regional variants to construct a pseudo tree-based structure on-the-fly for seed extension without loading the whole genome variation into memory space. Results: We developed the novel high-throughput sequencing read aligner deBGA-VARA by integrating VARA into deBGA. The deBGA-VARA is benchmarked both on simulated reads and the NA12878 sequencing dataset. The experimental results demonstrate that read alignment incorporating genetic variation knowledge can achieve high sensitivity and accuracy. Conclusions: Due to its efficiency, VARA provides a promising solution for further improvement of variant calling while maintaining small memory footprints. The deBGA-VARA is available at: https://github.com/hitbc/deBGA-VARA.",
                "authors": [
                    {
                        "name": "Guo H."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Guan D."
                    },
                    {
                        "name": "Fu Y."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "date": "2019-12-19T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "Fast read alignment with incorporation of known genomic variants"
            },
            "pmcid": "PMC6921400",
            "pmid": "31856811"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}