{
    "additionDate": "2018-05-08T15:15:39Z",
    "biotoolsCURIE": "biotools:tagdust2",
    "biotoolsID": "tagdust2",
    "collectionID": [
        "TagDust"
    ],
    "credit": [
        {
            "email": "timolassmann@gmail.com",
            "name": "Timo Lassmann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A generic method to extract reads from sequencing data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://tagdust.sourceforge.net/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "homepage": "http://tagdust.sourceforge.net/",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-02-16T21:44:00Z",
    "license": "GPL-3.0",
    "name": "TagDust2",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/S12859-015-0454-Y",
            "metadata": {
                "abstract": "© Lassmann.Background: Arguably the most basic step in the analysis of next generation sequencing data (NGS) involves the extraction of mappable reads from the raw reads produced by sequencing instruments. The presence of barcodes, adaptors and artifacts subject to sequencing errors makes this step non-trivial. Results: Here I present TagDust2, a generic approach utilizing a library of hidden Markov models (HMM) to accurately extract reads from a wide array of possible read architectures. TagDust2 extracts more reads of higher quality compared to other approaches. Processing of multiplexed single, paired end and libraries containing unique molecular identifiers is fully supported. Two additional post processing steps are included to exclude known contaminants and filter out low complexity sequences. Finally, TagDust2 can automatically detect the library type of sequenced data from a predefined selection. Conclusion: Taken together TagDust2 is a feature rich, flexible and adaptive solution to go from raw to mappable NGS reads in a single step. The ability to recognize and record the contents of raw reads will help to automate and demystify the initial, and often poorly documented, steps in NGS data analysis pipelines. TagDust2 is freely available at:http://tagdust.sourceforge.net",
                "authors": [
                    {
                        "name": "Lassmann T."
                    }
                ],
                "citationCount": 32,
                "date": "2015-01-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "TagDust2: A generic method to extract reads from sequencing data"
            },
            "pmcid": "PMC4384298",
            "pmid": "25627334"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}