{
    "accessibility": "Open access",
    "additionDate": "2022-04-19T22:54:36.299354Z",
    "biotoolsCURIE": "biotools:mlbp",
    "biotoolsID": "mlbp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jfxia@ahu.edu.cn",
            "name": "Junfeng Xia",
            "orcidid": "https://orcid.org/0000-0003-3024-1705",
            "typeEntity": "Person"
        },
        {
            "email": "xiaenhua@gmail.com",
            "name": "Enhua Xia",
            "typeEntity": "Person"
        },
        {
            "email": "ynbin@ahu.edu.cn",
            "name": "Yannan Bin",
            "typeEntity": "Person"
        },
        {
            "name": "Wending Tang"
        }
    ],
    "description": "Identifying multi-functional bioactive peptide functions using multi-label deep learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xialab-ahu/MLBP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-19T22:54:36.301934Z",
    "license": "Not licensed",
    "name": "MLBP",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAB414",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.The bioactive peptide has wide functions, such as lowering blood glucose levels and reducing inflammation. Meanwhile, computational methods such as machine learning are becoming more and more important for peptide functions prediction. Most of the previous studies concentrate on the single-functional bioactive peptides prediction. However, the number of multi-functional peptides is on the increase; therefore, novel computational methods are needed. In this study, we develop a method MLBP (Multi-Label deep learning approach for determining the multi-functionalities of Bioactive Peptides), which can predict multiple functions including anti-cancer, anti-diabetic, anti-hypertensive, anti-inflammatory and anti-microbial simultaneously. MLBP model takes the peptide sequence vector as input to replace the biological and physiochemical features used in other peptides predictors. Using the embedding layer, the dense continuous feature vector is learnt from the sequence vector. Then, we extract convolution features from the feature vector through the convolutional neural network layer and combine with the bidirectional gated recurrent unit layer to improve the prediction performance. The 5-fold cross-validation experiments are conducted on the training dataset, and the results show that Accuracy and Absolute true are 0.695 and 0.685, respectively. On the test dataset, Accuracy and Absolute true of MLBP are 0.709 and 0.697, with 5.0 and 4.7% higher than those of the suboptimum method, respectively. The results indicate MLBP has superior prediction performance on the multi-functional peptides identification. MLBP is available at https://github.com/xialab-ahu/MLBP and http://bioinfo.ahu.edu.cn/MLBP/.",
                "authors": [
                    {
                        "name": "Bin Y."
                    },
                    {
                        "name": "Dai R."
                    },
                    {
                        "name": "Tang W."
                    },
                    {
                        "name": "Xia E."
                    },
                    {
                        "name": "Xia J."
                    },
                    {
                        "name": "Yan W."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Identifying multi-functional bioactive peptide functions using multi-label deep learning"
            },
            "pmid": "34651655"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
