{
    "additionDate": "2019-11-14T18:47:03Z",
    "biotoolsCURIE": "biotools:Uniqprimer",
    "biotoolsID": "Uniqprimer",
    "confidence_flag": "very low",
    "description": "> VERY_LOW CONFIDENCE! | > HOMEPAGE BROKEN! | > CORRECT NAME OF TOOL COULD ALSO BE 'dianthicola', 'trialed', 'Dickeya', 'broad-host-range' | Development of the Automated Primer Design Workflow Uniqprimer and Diagnostic Primers for the Broad-Host-Range Plant Pathogen Dickeya dianthicola | Uniqprimer, a software pipeline developed in Python, was deployed as a user-friendly internet tool in Rice Galaxy for comparative genome analyses to design primer sets for PCRassays capable of detecting target bacterial taxa. The pipeline was trialed with Dickeya dianthicola, a destructive broad-host-range bacterial pathogen found in most potato-growing regions. Dickeya is a highly variable genus, and some primers available to detect this genus and species exhibit common diagnostic failures. Upon uploading a selection of target and nontarget genomes, six primer sets were rapidly identified with Uniqprimer, of which two were specific and sensitive when tested with D. dianthicola",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://uniqprimer.py",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-11-14T18:47:03Z",
    "name": "Uniqprimer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1094/PDIS-10-18-1819-RE",
            "metadata": {
                "abstract": "Uniqprimer, a software pipeline developed in Python, was deployed as a user-friendly internet tool in Rice Galaxy for comparative genome analyses to design primer sets for PCRassays capable of detecting target bacterial taxa. The pipeline was trialed with Dickeya dianthicola, a destructive broad-host-range bacterial pathogen found in most potato-growing regions. Dickeya is a highly variable genus, and some primers available to detect this genus and species exhibit common diagnostic failures. Upon uploading a selection of target and nontarget genomes, six primer sets were rapidly identified with Uniqprimer, of which two were specific and sensitive when tested with D. dianthicola. The remaining four amplified a minority of the nontarget strains tested. The two promising candidate primer sets were trialed with DNA isolated from 116 field samples from across the United States that were previously submitted for testing. D. dianthicola was detected in 41 samples, demonstrating the applicability of our detection primers and suggesting widespread occurrence of D. dianthicola in North America.",
                "authors": [
                    {
                        "name": "Karim S."
                    },
                    {
                        "name": "McNally R.R."
                    },
                    {
                        "name": "Nasaruddin A.S."
                    },
                    {
                        "name": "DeReeper A."
                    },
                    {
                        "name": "Mauleon R.P."
                    },
                    {
                        "name": "Charkowski A.O."
                    },
                    {
                        "name": "Leach J.E."
                    },
                    {
                        "name": "Ben-Hur A."
                    },
                    {
                        "name": "Triplett L.R."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Plant disease",
                "title": "Development of the Automated Primer Design Workflow Uniqprimer and Diagnostic Primers for the Broad-Host-Range Plant Pathogen Dickeya dianthicola"
            },
            "pmid": "31436473"
        }
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}