
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.bioinformatics.deib.polimi.it/bio-seco/seco"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://searchcomputing.deib.polimi.it/UIDemoBio/#example"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Bioinformatics",
                "uri": "http://edamontology.org/topic_0091"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/bio-seco-bioinformatics-search-computing-application.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2014 Masseroli et al.; licensee BioMed Central Ltd. Background: The huge amount of biomedical-molecular data increasingly produced is providing scientists with potentially valuable information. Yet, such data quantity makes difficult to find and extract those data that are most reliable and most related to the biomedical questions to be answered, which are increasingly complex and often involve many different biomedical-molecular aspects. Such questions can be addressed only by comprehensively searching and exploring different types of data, which frequently are ordered and provided by different data sources. Search Computing has been proposed for the management and integration of ranked results from heterogeneous search services. Here, we present its novel application to the explorative search of distributed biomedical-molecular data and the integration of the search results to answer complex biomedical questions. Results: A set of available bioinformatics search services has been modelled and registered in the Search Computing framework, and a Bioinformatics Search Computing application (Bio-SeCo) using such services has been created and made publicly available at http://www.bioinformatics.deib.polimi.it/bio-seco/seco/. It offers an integrated environment which eases search, exploration and ranking-aware combination of heterogeneous data provided by the available registered services, and supplies global results that can support answering complex multi-topic biomedical questions. Conclusions: By using Bio-SeCo, scientists can explore the very large and very heterogeneous biomedicalmolecular data available. They can easily make different explorative search attempts, inspect obtained results, select the most appropriate, expand or refine them and move forward and backward in the construction of a global complex biomedical query on multiple distributed sources that could eventually find the most relevant results. Thus, it provides an extremely useful automated support for exploratory integrated bio search, which is fundamental for Life Science data driven knowledge discovery.",
            "authors": [
                "Masseroli M.",
                "Picozzi M.",
                "Ghisalberti G.",
                "Ceri S."
            ],
            "cit_count": 10,
            "doi": "10.1186/1471-2105-15-S1-S3",
            "journal": "BMC Bioinformatics",
            "title": "Explorative search of distributed bio-data to answer complex biomedical questions",
            "type": "Primary",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bio-seco",
        "biotoolsID": "bio-seco",
        "description": "Bio-SeCo allows exploring and integrating data from external resources (e.g. NCBI and WU BLAST, Array Express, …).",
        "homepage": "http://www.bioinformatics.deib.polimi.it/bio-seco/seco/",
        "name": "Bio-SeCo"
    }
}