{
    "additionDate": "2023-01-25T10:19:15.207217Z",
    "biotoolsCURIE": "biotools:acp_ms",
    "biotoolsID": "acp_ms",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dragonbw@163.com",
            "name": "Bo Liao",
            "typeEntity": "Person"
        }
    ],
    "description": "A prediction model  of anticancer peptides based on feature extraction.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Zhoucaimao1998/Zc",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-25T10:19:15.210506Z",
    "name": "ACP_MS",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC462",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.Anticancer peptides (ACPs) are bioactive peptides with antitumor activity and have become the most promising drugs in the treatment of cancer. Therefore, the accurate prediction of ACPs is of great significance to the research of cancer diseases. In the paper, we developed a more efficient prediction model called ACP_MS. Firstly, the monoMonoKGap method is used to extract the characteristic of anticancer peptide sequences and form the digital features. Then, the AdaBoost model is used to select the most discriminating features from the digital features. Finally, a stochastic gradient descent algorithm is introduced to identify anticancer peptide sequences. We adopt 7-fold cross-validation and independent test set validation, and the final accuracy of the main dataset reached 92.653% and 91.597%, respectively. The accuracy of the alternate dataset reached 98.678% and 98.317%, respectively. Compared with other advanced prediction models, the ACP_MS model improves the identification ability of anticancer peptide sequences. The data of this model can be downloaded from the public website for free https://github.com/Zhoucaimao1998/Zc.",
                "authors": [
                    {
                        "name": "Jia R."
                    },
                    {
                        "name": "Liao B."
                    },
                    {
                        "name": "Peng D."
                    },
                    {
                        "name": "Wu F."
                    },
                    {
                        "name": "Zhou C."
                    }
                ],
                "date": "2022-11-19T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "ACP_MS: prediction of anticancer peptides based on feature extraction"
            },
            "pmid": "36326080"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
