{
    "additionDate": "2020-01-09T18:18:04Z",
    "biotoolsCURIE": "biotools:OC_manager",
    "biotoolsID": "OC_manager",
    "confidence_flag": "tool",
    "description": "Open-source add-on kit for automation of zone elution in planar chromatography.\n\nFollow this link to download an image of raspbian with the OC_manager set-up, last update: 20180605.\n\nShiny app to operate apparatus of office chromatography.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/OfficeChromatography/OC_manager",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2021-01-04T12:49:20Z",
    "name": "OC_manager",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/RCM.8631",
            "metadata": {
                "abstract": "© 2019 The Authors. Rapid Communications in Mass Spectrometry published by John Wiley & Sons LtdRationale: High-throughput capacity, maximal efficiency and automation are missing key features for thin-layer chromatography/high-performance thin-layer chromatography-mass spectrometry (TLC/HPTLC-MS) hyphenations. So far, commercial interfaces have been operated without an automated positioning system. Hence, a 3D-printed, fully automated, open-source add-on user interface was built for elution-head-based TLC/HPTLC-MS. Methods: Precise plate movement, batch-wise zone elution, and cleaning processes were automated and synchronized with MS data acquisition. The elution head cleaning was made adjustable in intensity and interval, and remaining elution solvent or particles were thoroughly blown out of the MS transfer line. An adjustable short gas beam across the elution zone was integrated to avoid contamination or leakage by released layer particles, or zone distortion by residual eluent flow when lifting the elution head. Results: By clicking on zones on the chromatogram, these were selected for consecutive automated positioning below the elution head, sealing and elution. Mean spatial deviations of the positioning on 294 target zones were determined to be 160 μm for track-wise and 190 μm for randomized zone positioning order. Reproducibility of the elution of butyl paraben zones (5.4%, 10 ng/band, n = 70) and its quantitative performance (R2 = 0.992–0.999, 5–50 ng/band) were proven. Conclusions: The stand-alone electronic system design and the compact footprint were achieved by a minimalistic positioning system and internally installed valves. The open-source OC_manager software opened new perspectives in terms of combining MS data evaluation with previous HPTLC results. The successfully demonstrated TLC/HPTLC-MS automation presents a highly efficient, user-independent hyphenation for a broad range of application fields.",
                "authors": [
                    {
                        "name": "Habe T.T."
                    },
                    {
                        "name": "Morlock G.E."
                    }
                ],
                "citationCount": 7,
                "date": "2020-04-15T00:00:00Z",
                "journal": "Rapid Communications in Mass Spectrometry",
                "title": "Open-source add-on kit for automation of zone elution in planar chromatography"
            },
            "pmid": "31658504"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application",
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        }
    ],
    "validated": 1
}