{
    "additionDate": "2020-01-14T19:55:26Z",
    "biotoolsCURIE": "biotools:FlyCircuit",
    "biotoolsID": "FlyCircuit",
    "confidence_flag": "tool",
    "description": "FlyCircuit is a public database for online archiving, cell type inventory, browsing, searching, analysis and 3D visualization of individual neurons in the Drosophila brain.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                }
            ]
        }
    ],
    "homepage": "http://www.flycircuit.tw",
    "lastUpdate": "2020-12-29T10:20:25Z",
    "name": "FlyCircuit",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.cub.2010.11.056",
            "metadata": {
                "abstract": "Background: Animal behavior is governed by the activity of interconnected brain circuits. Comprehensive brain wiring maps are thus needed in order to formulate hypotheses about information flow and also to guide genetic manipulations aimed at understanding how genes and circuits orchestrate complex behaviors. Results: To assemble this map, we deconstructed the adult Drosophila brain into approximately 16,000 single neurons and reconstructed them into a common standardized framework to produce a virtual fly brain. We have constructed a mesoscopic map and found that it consists of 41 local processing units (LPUs), six hubs, and 58 tracts covering the whole Drosophila brain. Despite individual local variation, the architecture of the Drosophila brain shows invariance for both the aggregation of local neurons (LNs) within specific LPUs and for the connectivity of projection neurons (PNs) between the same set of LPUs. An open-access image database, named FlyCircuit, has been constructed for online data archiving, mining, analysis, and three-dimensional visualization of all single neurons, brain-wide LPUs, their wiring diagrams, and neural tracts. Conclusion: We found that the Drosophila brain is assembled from families of multiple LPUs and their interconnections. This provides an essential first step in the analysis of information processing within and between neurons in a complete brain. © 2011 Elsevier Ltd.",
                "authors": [
                    {
                        "name": "Chiang A.-S."
                    },
                    {
                        "name": "Lin C.-Y."
                    },
                    {
                        "name": "Chuang C.-C."
                    },
                    {
                        "name": "Chang H.-M."
                    },
                    {
                        "name": "Hsieh C.-H."
                    },
                    {
                        "name": "Yeh C.-W."
                    },
                    {
                        "name": "Shih C.-T."
                    },
                    {
                        "name": "Wu J.-J."
                    },
                    {
                        "name": "Wang G.-T."
                    },
                    {
                        "name": "Chen Y.-C."
                    },
                    {
                        "name": "Wu C.-C."
                    },
                    {
                        "name": "Chen G.-Y."
                    },
                    {
                        "name": "Ching Y.-T."
                    },
                    {
                        "name": "Lee P.-C."
                    },
                    {
                        "name": "Lin C.-Y."
                    },
                    {
                        "name": "Lin H.-H."
                    },
                    {
                        "name": "Wu C.-C."
                    },
                    {
                        "name": "Hsu H.-W."
                    },
                    {
                        "name": "Huang Y.-A."
                    },
                    {
                        "name": "Chen J.-Y."
                    },
                    {
                        "name": "Chiang H.-J."
                    },
                    {
                        "name": "Lu C.-F."
                    },
                    {
                        "name": "Ni R.-F."
                    },
                    {
                        "name": "Yeh C.-Y."
                    },
                    {
                        "name": "Hwang J.-K."
                    }
                ],
                "citationCount": 358,
                "date": "2011-01-11T00:00:00Z",
                "journal": "Current Biology",
                "title": "Three-dimensional reconstruction of brain-wide wiring networks in drosophila at single-cell resolution"
            },
            "pmid": "21129968",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1007/s12021-019-09443-w",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature.Drosophila melanogaster is one of the most important model animals in neurobiology owing to its manageable brain size, complex behaviour, and extensive genetic tools. However, without a comprehensive map of the brain-wide neural network, our ability to investigate brain functions at the systems level is seriously limited. In this study, we constructed a neuron-to-neuron network of the Drosophila brain based on the 28,573 fluorescence images of single neurons in the newly released FlyCircuit v1.2 (http://www.flycircuit.tw) database. By performing modularity and centrality analyses, we identified eight communities (right olfaction, left olfaction, olfactory core, auditory, motor, pre-motor, left vision, and right vision) in the brain-wide network. Further investigation on information exchange and structural stability revealed that the communities of different functions dominated different types of centralities, suggesting a correlation between functions and network structures. Except for the two olfaction and the motor communities, the network is characterized by overall small-worldness. A rich club (RC) structure was also found in this network, and most of the innermost RC members innervated the central complex, indicating its role in information integration. We further identified numerous loops with length smaller than seven neurons. The observation suggested unique characteristics in the information processing inside the fruit fly brain.",
                "authors": [
                    {
                        "name": "Shih C.-T."
                    },
                    {
                        "name": "Lin Y.-J."
                    },
                    {
                        "name": "Wang C.-T."
                    },
                    {
                        "name": "Wang T.-Y."
                    },
                    {
                        "name": "Chen C.-C."
                    },
                    {
                        "name": "Su T.-S."
                    },
                    {
                        "name": "Lo C.-C."
                    },
                    {
                        "name": "Chiang A.-S."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "Diverse Community Structures in the Neuronal-Level Connectome of the Drosophila Brain"
            },
            "pmid": "31797265",
            "type": [
                "Usage"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}