{
    "additionDate": "2021-10-12T17:16:00.181957Z",
    "biotoolsCURIE": "biotools:absolurate",
    "biotoolsID": "absolurate",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "gromiha@iitm.ac.in",
            "name": "M. Michael Gromiha"
        }
    ],
    "description": "An in-silico method to predict the aggregation kinetics of native proteins.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://web.iitm.ac.in/bioinfo2/absolurate-pred/index.html",
    "lastUpdate": "2021-10-12T17:16:00.184465Z",
    "name": "AbsoluRATE",
    "operatingSystem": [
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.BBAPAP.2021.140682",
            "metadata": {
                "abstract": "© 2021 Elsevier B.V.Protein aggregation has two aspects, namely, mechanistic and kinetics. Understanding protein aggregation kinetics is critical for prediction of progression of diseases caused by amyloidosis, accumulation of aggregates in biotherapeutics during storage and engineering commercial nano-biomaterials. In this work, we have collected experimentally determined absolute protein aggregation rates and developed an SVM based regression model to predict absolute rates of protein and peptide aggregation near-physiological conditions. The regression model achieved a correlation coefficient of 0.72 with MAE of 0.91 (natural log of kapp, where kapp is in hour−1) using leave-one-out cross-validation on a dataset of 82 non-redundant proteins/peptides. The model accounts for the experimental conditions (such as temperature, pH, ionic and protein concentration) and sequence-based properties. The amino acid sequence features revealed by this model as being important for aggregation kinetics, are also associated with the aggregation mechanism. In particular, inherent aggregation propensity of the protein/peptide sequence and number of aggregation prone regions (APRs) unpunctuated by the gatekeeping residues, were found to play important roles in the prediction of the absolute aggregation rates. This analysis shows that mechanism and kinetics of protein aggregation are coupled via common sequence attributes. The aggregation kinetic prediction method developed in this work is available at https://web.iitm.ac.in/bioinfo2/absolurate-pred/index.html.",
                "authors": [
                    {
                        "name": "Rawat P."
                    },
                    {
                        "name": "Prabakaran R."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Gromiha M.M."
                    }
                ],
                "citationCount": 1,
                "date": "2021-09-01T00:00:00Z",
                "journal": "Biochimica et Biophysica Acta - Proteins and Proteomics",
                "title": "AbsoluRATE: An in-silico method to predict the aggregation kinetics of native proteins"
            },
            "pmid": "34102324"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}