{"credit":[{"email":"sanghyuk@ewha.ac.kr","name":"S. Lee","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"kangj@korea.ac.kr","name":"J. Kang","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Chimeric sequence detection","uri":"http://edamontology.org/operation_0450"},{"term":"Sequence tag mapping","uri":"http://edamontology.org/operation_0527"},{"term":"Gene expression profiling","uri":"http://edamontology.org/operation_0314"},{"term":"Gene expression analysis","uri":"http://edamontology.org/operation_2495"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Database portal"],"topic":[{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Gene structure","uri":"http://edamontology.org/topic_0114"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"publication":[{"abstract":"Chromosome translocations and gene fusions are frequent events in the human genome and have been found to cause diverse types of tumor. ChimerDB is a knowledgebase of fusion genes identified from bioinformatics analysis of transcript sequences in the GenBank and various other public resources such as the Sanger cancer genome project (CGP), OMIM, PubMed and the Mitelman's database. In this updated version, we significantly modified the algorithm of identifying fusion transcripts. Specifically, the new algorithm is more sensitive and has detected 2699 fusion transcripts with high confidence. Furthermore, it can identify interchromosomal translocations as well as the intrachromosomal deletions or inversions of large DNA segments. Importantly, results from the analysis of next-generation sequencing data in the short read archives are incorporated as well. We updated and integrated all contents (GenBank, Sanger CGP, OMIM, PubMed publications and the Mitelman's database), and the user-interface has been improved to support diverse types of searches and to enhance the user convenience especially in browsing PubMed articles. We also developed a new alignment viewer that should facilitate examining reliability of fusion transcripts and inferring functional significance. We expect ChimerDB 2.0, available at http://ercsb.ewha.ac.kr/fusiongene, to be a valuable tool in identifying biomarkers and drug targets. © The Author(s) 2009. Published by Oxford University Press.","authors":["Kim P.","Yoon S.","Kim N.","Lee S.","Ko M.","Lee H.","Kang H.","Kim J.","Lee S."],"cit_count":56,"journal":"Nucleic Acids Research","pmid":"19906715","title":"ChimerDB 2.0 A knowledgebase for fusion genes updated","year":"2009-11-10"},{"abstract":"Chromosome translocation and gene fusion are frequent events in the human genome and are often the cause of many types of tumor. ChimerDB is the database of fusion sequences encompassing bioinformatics analysis of mRNA and expressed sequence tag (EST) sequences in the GenBank, manual collection of literature data and integration with other known database such as OMIM. Our bioinformatics analysis identifies the fusion transcripts that have non-overlapping alignments at multiple genomic loci. Fusion events at exon-exon borders are selected to filter out the cloning artifacts in cDNA library preparation. The result is classified into two groups--genuine chromosome translocation and fusion between neighboring genes owing to intergenic splicing. We also integrated manually collected literature and OMIM data for chromosome translocation as an aid to assess the validity of each fusion event. The database is available at http://genome.ewha.ac.kr/ChimerDB/ for human, mouse and rat genomes.","authors":["Kim N.","Kim P.","Nam S.","Shin S.","Lee S."],"cit_count":30,"journal":"Nucleic acids research","pmid":"16381848","title":"ChimerDB--a knowledgebase for fusion sequences.","year":"2006-01-01"}],"summary":{"biotoolsCURIE":"biotools:chimerdb","biotoolsID":"chimerdb","description":"Knowledgebase of fusion genes identified from bioinformatics analysis of transcript sequences in the GenBank and various other public resources such as the Sanger cancer genome project, OMIM, PubMed and the Mitelman database. A new algorithm that is more sensitive, has detected 2699 fusion transcripts with high confidence. It can identify interchromosomal translocations as well as the intrachromosomal deletions or inversions of large DNA segments.","homepage":"http://ercsb.ewha.ac.kr/fusiongene","name":"ChimerDB"}}