{
    "additionDate": "2017-03-27T07:20:01Z",
    "biotoolsCURIE": "biotools:chimerdb",
    "biotoolsID": "chimerdb",
    "credit": [
        {
            "email": "sanghyuk@ewha.ac.kr",
            "name": "S. Lee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "kangj@korea.ac.kr",
            "name": "J. Kang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Knowledgebase of fusion genes identified from bioinformatics analysis of transcript sequences in the GenBank and various other public resources such as the Sanger cancer genome project, OMIM, PubMed and the Mitelman database. A new algorithm that is more sensitive, has detected 2699 fusion transcripts with high confidence. It can identify interchromosomal translocations as well as the intrachromosomal deletions or inversions of large DNA segments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chimeric sequence detection",
                    "uri": "http://edamontology.org/operation_0450"
                },
                {
                    "term": "Sequence tag mapping",
                    "uri": "http://edamontology.org/operation_0527"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://ercsb.ewha.ac.kr/fusiongene",
    "lastUpdate": "2020-12-11T19:49:55Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.kobic.re.kr/chimerdb_mirror/"
        }
    ],
    "name": "ChimerDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Chromosome translocations and gene fusions are frequent events in the human genome and have been found to cause diverse types of tumor. ChimerDB is a knowledgebase of fusion genes identified from bioinformatics analysis of transcript sequences in the GenBank and various other public resources such as the Sanger cancer genome project (CGP), OMIM, PubMed and the Mitelman's database. In this updated version, we significantly modified the algorithm of identifying fusion transcripts. Specifically, the new algorithm is more sensitive and has detected 2699 fusion transcripts with high confidence. Furthermore, it can identify interchromosomal translocations as well as the intrachromosomal deletions or inversions of large DNA segments. Importantly, results from the analysis of next-generation sequencing data in the short read archives are incorporated as well. We updated and integrated all contents (GenBank, Sanger CGP, OMIM, PubMed publications and the Mitelman's database), and the user-interface has been improved to support diverse types of searches and to enhance the user convenience especially in browsing PubMed articles. We also developed a new alignment viewer that should facilitate examining reliability of fusion transcripts and inferring functional significance. We expect ChimerDB 2.0, available at http://ercsb.ewha.ac.kr/fusiongene, to be a valuable tool in identifying biomarkers and drug targets. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Kim P."
                    },
                    {
                        "name": "Yoon S."
                    },
                    {
                        "name": "Kim N."
                    },
                    {
                        "name": "Lee S."
                    },
                    {
                        "name": "Ko M."
                    },
                    {
                        "name": "Lee H."
                    },
                    {
                        "name": "Kang H."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Lee S."
                    }
                ],
                "citationCount": 65,
                "date": "2009-11-10T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ChimerDB 2.0 A knowledgebase for fusion genes updated"
            },
            "pmid": "19906715"
        },
        {
            "metadata": {
                "abstract": "Chromosome translocation and gene fusion are frequent events in the human genome and are often the cause of many types of tumor. ChimerDB is the database of fusion sequences encompassing bioinformatics analysis of mRNA and expressed sequence tag (EST) sequences in the GenBank, manual collection of literature data and integration with other known database such as OMIM. Our bioinformatics analysis identifies the fusion transcripts that have non-overlapping alignments at multiple genomic loci. Fusion events at exon-exon borders are selected to filter out the cloning artifacts in cDNA library preparation. The result is classified into two groups--genuine chromosome translocation and fusion between neighboring genes owing to intergenic splicing. We also integrated manually collected literature and OMIM data for chromosome translocation as an aid to assess the validity of each fusion event. The database is available at http://genome.ewha.ac.kr/ChimerDB/ for human, mouse and rat genomes.",
                "authors": [
                    {
                        "name": "Kim N."
                    },
                    {
                        "name": "Kim P."
                    },
                    {
                        "name": "Nam S."
                    },
                    {
                        "name": "Shin S."
                    },
                    {
                        "name": "Lee S."
                    }
                ],
                "citationCount": 32,
                "date": "2006-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "ChimerDB--a knowledgebase for fusion sequences."
            },
            "pmid": "16381848"
        },
        {
            "doi": "10.1093/nar/gkz1013",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Fusion genes represent an important class of biomarkers and therapeutic targets in cancer. ChimerDB is a comprehensive database of fusion genes encompassing analysis of deep sequencing data (ChimerSeq) and text mining of publications (ChimerPub) with extensive manual annotations (ChimerKB). In this update, we present all three modules substantially enhanced by incorporating the recent flood of deep sequencing data and related publications. ChimerSeq now covers all 10 565 patients in the TCGA project, with compilation of computational results from two reliable programs of STAR-Fusion and FusionScan with several public resources. In sum, ChimerSeq includes 65 945 fusion candidates, 21 106 of which were predicted by multiple programs (ChimerSeq-Plus). ChimerPub has been upgraded by applying a deep learning method for text mining followed by extensive manual curation, which yielded 1257 fusion genes including 777 cases with experimental supports (ChimerPub-Plus). ChimerKB includes 1597 fusion genes with publication support, experimental evidences and breakpoint information. Importantly, we implemented several new features to aid estimation of functional significance, including the fusion structure viewer with domain information, gene expression plot of fusion positive versus negative patients and a STRING network viewer. The user interface also was greatly enhanced by applying responsive web design. ChimerDB 4.0 is available at http://www.kobic.re.kr/chimerdb/.",
                "authors": [
                    {
                        "name": "Jang Y.E."
                    },
                    {
                        "name": "Jang I."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Cho S."
                    },
                    {
                        "name": "Kim D."
                    },
                    {
                        "name": "Kim K."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Hwang J."
                    },
                    {
                        "name": "Kim S."
                    },
                    {
                        "name": "Kim J."
                    },
                    {
                        "name": "Kang J."
                    },
                    {
                        "name": "Lee B."
                    },
                    {
                        "name": "Lee S."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "ChimerDB 4.0: An updated and expanded database of fusion genes"
            },
            "pmcid": "PMC7145594",
            "pmid": "31680157"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}