{
    "additionDate": "2017-12-18T00:13:48Z",
    "biotoolsCURIE": "biotools:transmodis",
    "biotoolsID": "transmodis",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://wanglab.ucsd.edu/"
        }
    ],
    "description": "Generalization of MODEM to consider sequence motif and multiple gene expression or ChIP-binding experiments to identify TF binding sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Microarray data analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://wanglab.ucsd.edu/star/download.php",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:58Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/transmodis-sequence-motif-gene-expression-chip-binding-data-identify-tf-binding-sites.html"
        }
    ],
    "name": "TransModis",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0001821",
            "metadata": {
                "abstract": "A major challenge in the post-genome era is to construct regulatory networks from the biological knowledge accumulated up to date. The development of tools for identifying direct target genes of transcription factors (TFs) is critical to this endeavor. Given a set of microscopy experiments, a probabilistics model called TRANSMODIS has been developed which can infer the direct targets of a TF by integrating sequence motif, gene expression and ChIP-chip data. The performance of TRANSMODIS was first validated on a set of transcription factor perturbation experiments (TFPEs) involving Pho4p, a well studied TF in Sacchoromyces cerevisiae. TRANSMODIS removed elements of arbitrarines in manual target gene selection process and produced results that concur with one's intuition. TRANSMODIS was further validated on a genome-wide scale by comparing it with two other methods in Sacchoromyces cerevisiae. The usefulness of TRANSMODIS was then demonstrated by applying it to the identification of direct targets of DAF-16, a critical TF regulating ageing in Caenorhabditis elegans. We found that 189 genes were tightly regulated by DAF-16. In addition, DAF-16 has differential preference for motifs when acting as an activator or repressor, which awaits experimental verification. TRANSMODIS is computationally efficient and robust, making it a useful probabilistics framework for finding immediate targets. © 2008 Yu et al.",
                "authors": [
                    {
                        "name": "Yu R.X."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "True N."
                    },
                    {
                        "name": "Wang W."
                    }
                ],
                "citationCount": 7,
                "date": "2008-03-19T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Identification of direct target genes using joint sequence and expression likelihood with application to DAF-16"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChiP",
            "uri": "http://edamontology.org/topic_3179"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}