{
    "additionDate": "2017-08-03T19:03:21Z",
    "biotoolsCURIE": "biotools:timetree",
    "biotoolsID": "timetree",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.timetree.org/contact"
        }
    ],
    "description": "A public resource for knowledge on the timescale and evolutionary history of life.A search utility allows exploration of the thousands of divergence times among organisms in the published literature. A tree-based (hierarchical) system is used to identify all published molecular time estimates bearing on the divergence of two chosen taxa, such as species, compute summary statistics, and present the results.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.timetree.org/about"
        }
    ],
    "editPermission": {
        "authors": [
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "homepage": "http://www.timetree.org/",
    "lastUpdate": "2022-06-21T13:05:33.532500Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/timetree-3-1-species-divergence-times-mobile-phone.html"
        }
    ],
    "name": "TimeTree",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/molbev/msx116",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution. All rights reserved.Evolutionary information on species divergence times is fundamental to studies of biodiversity, development, and disease. Molecular dating has enhanced our understanding of the temporal patterns of species divergences over the last five decades, and the number of studies is increasing quickly due to an exponential growth in the available collection of molecular sequences from diverse species and large number of genes. Our TimeTree resource is a public knowledge-base with the primary focus to make available all species divergence times derived using molecular sequence data to scientists, educators, and the general public in a consistent and accessible format. Here, we report a major expansion of the TimeTree resource, which more than triples the number of species (>97,000) and more than triples the number of studies assembled (>3,000). Furthermore, scientists can access not only the divergence time between two species or higher taxa, but also a timetree of a group of species and a timeline that traces a species’ evolution through time. The new timetree and timeline visualizations are integrated with display of events on earth and environmental history over geological time, which will lead to broader and better understanding of the interplay of the change in the biosphere with the diversity of species on Earth. The next generation TimeTree resource is publicly available online at http://www.timetree.org.",
                "authors": [
                    {
                        "name": "Blair Hedges S."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Stecher G."
                    },
                    {
                        "name": "Suleski M."
                    }
                ],
                "citationCount": 1013,
                "date": "2017-07-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "TimeTree: A Resource for Timelines, Timetrees, and Divergence Times"
            },
            "pmid": "28387841"
        },
        {
            "metadata": {
                "abstract": "Summary: Scientists, educators and the general public often need to know times of divergence between species. But they rarely can locate that information because it is buried in the scientific literature, usually in a format that is inaccessible to text search engines. We have developed a public knowledgebase that enables data-driven access to the collection of peer-reviewed publications in molecular evolution and phylogenetics that have reported estimates of time of divergence between species. Users can query the TimeTree resource by providing two names of organisms (common or scientific) that can correspond to species or groups of species. The current TimeTree web resource (TimeTree2) contains timetrees reported from molecular clock analyses in 910 published studies and 17 341 species that span the diversity of life. TimeTree2 interprets complex and hierarchical data from these studies for each user query, which can be launched using an iPhone application, in addition to the website. Published time estimates are now readily accessible to the scientific community, K-12 and college educators, and the general public, without requiring knowledge of evolutionary nomenclature. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Hedges S.B."
                    },
                    {
                        "name": "Kumar S."
                    }
                ],
                "citationCount": 102,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Timetree2: Species divergence times on the iPhone"
            },
            "pmid": "21622662"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
