
{
    "credit": [
        {
            "email": "Neil.Wijetunga@med.einstein.yu.edu",
            "name": "Neil Ari Wijetunga",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "Andrew.Johnston@med.einstein.yu.edu",
            "name": "Andrew Damon Johnston",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/SMITE.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/SMITE_1.2.0.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Differentially-methylated region identification",
                    "uri": "http://edamontology.org/operation_3809"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Epigenomics",
                "uri": "http://edamontology.org/topic_3173"
            },
            {
                "term": "Systems biology",
                "uri": "http://edamontology.org/topic_2259"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            }
        ]
    },
    "link": [
        {
            "type": "Mirror",
            "url": "https://github.com/GreallyLab/SMITE"
        }
    ],
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: The molecular assays that test gene expression, transcriptional, and epigenetic regulation are increasingly diverse and numerous. The information generated by each type of assay individually gives an insight into the state of the cells tested. What should be possible is to add the information derived from separate, complementary assays to gain higher-confidence insights into cellular states. At present, the analysis of multi-dimensional, massive genome-wide data requires an initial pruning step to create manageable subsets of observations that are then used for integration, which decreases the sizes of the intersecting data sets and the potential for biological insights. Our Significance-based Modules Integrating the Transcriptome and Epigenome (SMITE) approach was developed to integrate transcriptional and epigenetic regulatory data without a loss of resolution. Results: SMITE combines p-values by accounting for the correlation between non-independent values within data sets, allowing genes and gene modules in an interaction network to be assigned significance values. The contribution of each type of genomic data can be weighted, permitting integration of individually under-powered data sets, increasing the overall ability to detect effects within modules of genes. We apply SMITE to a complex genomic data set including the epigenomic and transcriptomic effects of Toxoplasma gondii infection on human host cells and demonstrate that SMITE is able to identify novel subnetworks of dysregulated genes. Additionally, we show that SMITE outperforms Functional Epigenetic Modules (FEM), the current paradigm of using the spin-glass algorithm to integrate gene expression and epigenetic data. Conclusions: SMITE represents a flexible, scalable tool that allows integration of transcriptional and epigenetic regulatory data from genome-wide assays to boost confidence in finding gene modules reflecting altered cellular states.",
            "authors": [
                "Wijetunga N.A.",
                "Johnston A.D.",
                "Maekawa R.",
                "Delahaye F.",
                "Ulahannan N.",
                "Kim K.",
                "Greally J.M."
            ],
            "cit_count": 5,
            "doi": "10.1186/s12859-017-1477-3",
            "journal": "BMC Bioinformatics",
            "title": "SMITE: An R/Bioconductor package that identifies network modules by integrating genomic and epigenomic information",
            "type": "Primary",
            "year": "2017-01-18"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:smite",
        "biotoolsID": "smite",
        "description": "This package builds on the Epimods framework which facilitates finding weighted subnetworks (\"modules\") on Illumina Infinium 27k arrays using the SpinGlass algorithm, as implemented in the iGraph package. We have created a class of gene centric annotations associated with p-values and effect sizes and scores from any researchers prior statistical results to find functional modules.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/SMITE.html",
        "name": "SMITE",
        "version": [
            "1.2.0"
        ]
    }
}