{
    "accessibility": "Open access",
    "additionDate": "2023-02-17T13:10:47.533024Z",
    "biotoolsCURIE": "biotools:npgreat",
    "biotoolsID": "npgreat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "eadam002@odu.edu",
            "name": "Eleni Adam",
            "typeEntity": "Person"
        },
        {
            "name": "Desh Ranjan"
        },
        {
            "name": "Harold Riethman"
        }
    ],
    "description": "Assembly of human subtelomere regions with the use of ultralong nanopore reads and linked-reads.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/eleniadam/npgreat/blob/main/manual_npgreat.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://github.com/eleniadam/npgreat",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2023-02-17T13:10:47.535527Z",
    "license": "Not licensed",
    "name": "NPGREAT",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12859-022-05081-3",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Human subtelomeric DNA regulates the length and stability of adjacent telomeres that are critical for cellular function, and contains many gene/pseudogene families. Large evolutionarily recent segmental duplications and associated structural variation in human subtelomeres has made complete sequencing and assembly of these regions difficult to impossible for many loci, complicating or precluding a wide range of genetic analyses to investigate their function. Results: We present a hybrid assembly method, NanoPore Guided REgional Assembly Tool (NPGREAT), which combines Linked-Read data with mapped ultralong nanopore reads spanning subtelomeric segmental duplications to potentially overcome these difficulties. Linked-Read sets of DNA sequences identified by matches with 1-copy subtelomere sequence adjacent to segmental duplications are assembled and extended into the segmental duplication regions using Regional Extension of Assemblies using Linked-Reads (REXTAL). Mapped telomere-containing ultralong nanopore reads are then used to provide contiguity and correct orientation for matching REXTAL sequence contigs as well as identification/correction of any misassemblies. Our method was tested for a subset of representative subtelomeres with ultralong nanopore read coverage in the haploid human cell line CHM13. A 10X Linked-Read dataset from CHM13 was combined with ultralong nanopore reads from the same genome to provide improved subtelomere assemblies. Comparison of Nanopore-only assemblies using SHASTA with our NPGREAT assemblies in the distal-most subtelomere regions showed that NPGREAT produced higher-quality and more complete assemblies than SHASTA alone when these regions had low ultralong nanopore coverage (such as cases where large segmental duplications were immediately adjacent to (TTAGGG) tracts). Conclusion: In genomic regions with large segmental duplications adjacent to telomeres, NPGREAT offers an alternative economical approach to improving assembly accuracy and coverage using linked-read datasets when more expensive HiFi datasets of 10–20 kb reads are unavailable.",
                "authors": [
                    {
                        "name": "Adam E."
                    },
                    {
                        "name": "Ranjan D."
                    },
                    {
                        "name": "Riethman H."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "NPGREAT: assembly of human subtelomere regions with the use of ultralong nanopore reads and linked-reads"
            },
            "pmcid": "PMC9758922",
            "pmid": "36526983"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}
