{
    "additionDate": "2018-10-20T00:34:45Z",
    "biotoolsCURIE": "biotools:impre",
    "biotoolsID": "impre",
    "credit": [
        {
            "email": "liuxiao@genomics.cn",
            "name": "Xiao Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Immune Germline Prediction (IMPre), a tool for predicting germline Variable/Joining genes and alleles using deep-sequencing data derived from T-cell receptor/B-cell receptor repertoires.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/zhangwei2015/IMPre/blob/master/README.txt"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhangwei2015/IMPre",
    "language": [
        "C",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/zhangwei2015/IMPre/issues"
        }
    ],
    "name": "IMPre",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.3389/fimmu.2016.00457",
            "metadata": {
                "abstract": "© 2016 Zhang, Wang, Wang, Lin, Chai, Wu, Bett, Dhanasekaran, Casimiro and Liu.Large-scale study of the properties of T-cell receptor (TCR) and B-cell receptor (BCR) repertoires through next-generation sequencing is providing excellent insights into the understanding of adaptive immune responses. Variable(Diversity)Joining [V(D)J] germline genes and alleles must be characterized in detail to facilitate repertoire analyses. However,most species do not have well-characterized TCR/BCR germline genes because of their high homology. Also, more germline alleles are required for humans and other species, which limits the capacity for studying immune repertoires. Herein, we developed \"Immune Germline Prediction\" (IMPre), a tool for predicting germline V/J genes and alleles using deep-sequencing data derived from TCR/BCR repertoires. We developed a new algorithm, \"Seed_Clust,\" for clustering, produced a multiway tree for assembly and optimized the sequence according to the characteristics of rearrangement. We trained IMPre on human samples of T-cell receptor beta (TRB) and immunoglobulin heavy chain and then tested it on additional human samples. Accuracy of 97.7, 100, 92.9, and 100% was obtained for TRBV, TRBJ, IGHV, and IGHJ, respectively. Analyses of subsampling performance for these samples showed IMPre to be robust using different data quantities. Subsequently, IMPre was tested on samples from rhesus monkeys and human long sequences: the highly accurate results demonstrated IMPre to be stable with animal and multiple data types. With rapid accumulation of high-throughput sequence data for TCR and BCR repertoires, IMPre can be applied broadly for obtaining novel genes and a large number of novel alleles. IMPre is available at https://github.com/zhangwei2015/IMPre.",
                "authors": [
                    {
                        "name": "Bett A.J."
                    },
                    {
                        "name": "Casimiro D.R."
                    },
                    {
                        "name": "Chai X."
                    },
                    {
                        "name": "Dhanasekaran G."
                    },
                    {
                        "name": "Lin L."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Wang I.-M."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Zhang W."
                    }
                ],
                "citationCount": 21,
                "date": "2016-11-04T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "IMPre: An accurate and efficient software for prediction of T- and B-cell receptor germline genes and alleles from rearranged repertoire data"
            },
            "pmcid": "PMC5095119",
            "pmid": "27867380",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Immunoproteins, genes and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}
