{
    "additionDate": "2019-11-14T18:06:29Z",
    "biotoolsCURIE": "biotools:MEPSAnd",
    "biotoolsID": "MEPSAnd",
    "confidence_flag": "tool",
    "description": "Minimum Energy Path Surface Analysis over n-dimensional surfaces | Molecular Modelling Group. Grupo de Modelado Molecular. Centro de Biologia Molecular 'Severo Ochoa' CBMSO, CSIC-UAM | bioweb: molecular modelling group / grupo de modelado molecular | [ http://www.cbm.csic.es/bioweb ] [ http://bioweb.cbm.uam.es ] | n-dimensional energy surfaces are becoming computationally accessible, yet interpreting their information is not straightforward. We present MEPSAnd, an open source GUI-based program that natively calculates minimum energy paths across energy surfaces of any number of dimensions. Among other features, MEPSAnd can compute the path through lowest barriers and automatically provide a set of alternative paths. MEPSAnd offers distinct plotting solutions as well as direct python scripting",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Surface rendering",
                    "uri": "http://edamontology.org/operation_1816"
                }
            ]
        }
    ],
    "homepage": "http://bioweb.cbm.uam.es/software/MEPSAnd/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-23T08:42:18Z",
    "license": "GPL-3.0",
    "name": "MEPSAnd",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ649",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Summary: n-dimensional energy surfaces are becoming computationally accessible, yet interpreting their information is not straightforward. We present minimum energy path surface analysis over n-dimensional surfaces (MEPSAnd), an open source GUI-based program that natively calculates minimum energy paths across energy surfaces of any number of dimensions. Among other features, MEPSAnd can compute the path through lowest barriers and automatically provide a set of alternative paths. MEPSAnd offers distinct plotting solutions as well as direct python scripting.",
                "authors": [
                    {
                        "name": "Marcos-Alcalde I."
                    },
                    {
                        "name": "Lopez-Vinas E."
                    },
                    {
                        "name": "Gomez-Puertas P."
                    }
                ],
                "citationCount": 2,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MEPSAnd: Minimum energy path surface analysis over n-dimensional surfaces"
            },
            "pmid": "31418769"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}