{
    "additionDate": "2015-08-03T09:36:40Z",
    "biotoolsCURIE": "biotools:gmd",
    "biotoolsID": "gmd",
    "credit": [
        {
            "name": "BioCatalogue",
            "typeEntity": "Project",
            "typeRole": [
                "Documentor"
            ],
            "url": "https://www.biocatalogue.org"
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://gmd.mpimp-golm.mpg.de/contact.aspx"
        }
    ],
    "description": "Database which facilitates the search and dissemination of mass spectra from biologically active metabolites quantified using Gas chromatography (GC) coupled to mass spectrometry (MS).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://gmd.mpimp-golm.mpg.de/REST/default.aspx"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "http://gmd.mpimp-golm.mpg.de/REST/default.aspx",
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://www.biocatalogue.org/services/2632"
        }
    ],
    "name": "Golm Metabolome Database (GMD)",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "BioCatalogue",
    "publication": [
        {
            "doi": "10.1007/4735_2007_0229",
            "metadata": {
                "abstract": "In the post-genomic era, biological science continues a transition from a predominantly qualitative towards an increasingly quantitative science. Genomic, transcriptomic, proteomic, and now metabolomic technologies significantly contribute to the generation of huge amounts of data. These data, which typically describe changes in gene expression or changes in protein and metabolite pools, cannot effectively be analysed and interpreted by computer based programming if access is only provided through traditional publication schemes. Therefore '-omics' data sets require formalised representation and access through databases. Otherwise important information will be lost which may serve as reference data for current and future science. Transcript and protein profiling is dominated by few almost comprehensive technologies. In contrast, the metabolomic field will require multiple analytical profiling approaches to cover the chemical multitude of primary and secondary metabolism. As a consequence, technology-oriented metabolomics databases start to emerge. We will use GC-TOF-MS-based metabolite profiling as an example for the prototypical design of central database objects and structures. The focus will be on the required detailed information for the archiving of metabolite fingerprinting and profiling data sets. Special consideration is given to aspects of maintaining information sufficient and necessary for the experimental reproduction of metabolite identification and quantification results. Both aspects are essential for the sustainable use of GC-TOF-MS-based metabolite profiling and for the comparison to other metabolomics technologies. © 2007 Springer-Verlag Berlin Heidelberg.",
                "authors": [
                    {
                        "name": "Hummel J."
                    },
                    {
                        "name": "Selbig J."
                    },
                    {
                        "name": "Walther D."
                    },
                    {
                        "name": "Kopka J."
                    }
                ],
                "citationCount": 67,
                "date": "2007-09-27T00:00:00Z",
                "journal": "Topics in Current Genetics",
                "title": "The golm metabolome database: A database for GC-MS based metabolite profiling"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web API"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}