{
    "additionDate": "2020-01-14T09:22:40Z",
    "biotoolsCURIE": "biotools:CottonGen",
    "biotoolsID": "CottonGen",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sook_jung@wsu.edu",
            "name": "Sook Jung",
            "typeEntity": "Person"
        }
    ],
    "description": "A genomics, genetics and breeding web portal for cotton research.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Genome visualisation",
                    "uri": "http://edamontology.org/operation_3208"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "http://cottongen.org",
    "lastUpdate": "2021-01-11T12:37:05Z",
    "name": "CottonGen",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAX092",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press.Tripal is an open-source database platform primarily used for development of genomic, genetic and breeding databases. We report here on the release of the Chado Loader, Chado Data Display and Chado Search modules to extend the functionality of the core Tripal modules. These new extension modules provide additional tools for (1) data loading, (2) customized visualization and (3) advanced search functions for supported data types such as organism, marker, QTL/Mendelian Trait Loci, germplasm, map, project, phenotype, genotype and their respective metadata. The Chado Loader module provides data collection templates in Excel with defined metadata and data loaders with front end forms. The Chado Data Display module contains tools to visualize each data type and the metadata which can be used as is or customized as desired. The Chado Search module provides search and download functionality for the supported data types. Also included are the tools to visualize map and species summary. The use of materialized views in the Chado Search module enables better performance as well as flexibility of data modeling in Chado, allowing existing Tripal databases with different metadata types to utilize the module. These Tripal Extension modules are implemented in the Genome Database for Rosaceae (rosaceae.org), CottonGen (cottongen.org), Citrus Genome Database (citrusgenomedb.org), Genome Database for Vaccinium (vaccinium.org) and the Cool Season Food Legume Database (coolseasonfoodlegume.org). Database URL: https://www.citrusgenomedb.org/, https://www.coolseasonfoodlegume.org/, https://www.cottongen.org/, https://www.rosaceae.org/, https://www.vaccinium.org/.",
                "authors": [
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Lee T."
                    },
                    {
                        "name": "Cheng C.-H."
                    },
                    {
                        "name": "Ficklin S."
                    },
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Humann J."
                    },
                    {
                        "name": "Main D."
                    }
                ],
                "citationCount": 7,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "Extension modules for storage, visualization and querying of genomic, genetic and breeding data in Tripal databases"
            },
            "pmcid": "PMC5727400",
            "pmid": "31725859"
        },
        {
            "doi": "10.1093/nar/gkt1064",
            "metadata": {
                "abstract": "CottonGen (http://www.cottongen.org) is a curated and integrated web-based relational database providing access to publicly available genomic, genetic and breeding data for cotton. CottonGen supercedes CottonDB and the Cotton Marker Database, with enhanced tools for easier data sharing, mining, visualization and data retrieval of cotton research data. CottonGen contains annotated whole genome sequences, unigenes from expressed sequence tags (ESTs), markers, trait loci, genetic maps, genes, taxonomy, germplasm, publications and communication resources for the cotton community. Annotated whole genome sequences of Gossypium raimondii are available with aligned genetic markers and transcripts. These whole genome data can be accessed through genome pages, search tools and GBrowse, a popular genome browser. Most of the published cotton genetic maps can be viewed and compared using CMap, a comparative map viewer, and are searchable via map search tools. Search tools also exist for markers, quantitative trait loci (QTLs), germplasm, publications and trait evaluation data. CottonGen also provides online analysis tools such as NCBI BLAST and Batch BLAST. © 2013 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Yu J."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Cheng C.-H."
                    },
                    {
                        "name": "Ficklin S.P."
                    },
                    {
                        "name": "Lee T."
                    },
                    {
                        "name": "Zheng P."
                    },
                    {
                        "name": "Jones D."
                    },
                    {
                        "name": "Percy R.G."
                    },
                    {
                        "name": "Main D."
                    }
                ],
                "citationCount": 135,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CottonGen: A genomics, genetics and breeding database for cotton research"
            },
            "pmcid": "PMC3964939",
            "pmid": "24203703",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}