{
    "additionDate": "2017-02-10T14:15:16Z",
    "biotoolsCURIE": "biotools:rpbs",
    "biotoolsID": "rpbs",
    "description": "Structural bioinformatics resource",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://bioserv.rpbs.jussieu.fr/",
    "lastUpdate": "2020-01-21T15:36:24Z",
    "name": "RPBS",
    "owner": "reyjul",
    "publication": [
        {
            "metadata": {
                "abstract": "PredAcc is a tool for predicting the solvent accessibility of protein residues from the sequence at different relative accessibility levels (0-55%). The prediction rate varies between 70.7% (for 25% relative accessibility) and 85.7% (for 0% relative accessibility). Amino acids are predicted in four categories: almost certainly hidden and almost certainly exposed with a given a posteriori prediction error, probably hidden and probably exposed otherwise. Availability: http://condor.urbb.jussieu.fr/PredAccCfg.html. Contact: tuffery@@@urbb.jussieu.fr.",
                "authors": [
                    {
                        "name": "Mucchielli-Giorgi M.H."
                    },
                    {
                        "name": "Hazout S."
                    },
                    {
                        "name": "Tuffery P."
                    }
                ],
                "citationCount": 48,
                "date": "1999-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "PredAcc: Prediction of solvent accessibility"
            },
            "pmid": "10089205"
        },
        {
            "metadata": {
                "abstract": "Database scanning programs such as BLAST and FASTA are used nowadays by most biologists for the post-genomic processing of DNA or protein sequence information (in particular to retrieve the structure/function of uncharacterized proteins). Unfortunately, their results can be polluted by identical alignments (called redundancies) coming from the same protein or DNA sequences present in different entries of the database. This makes the efficient use of the listed alignments difficult. Pretreatment of databases has been proposed to suppress strictly identical entries. However, there still remain many identical alignments since redundancies may occur locally for entries corresponding to various fragments of the same sequence or for entries corresponding to very homologous sequences but differing at the level of a few residues such as ortholog proteins. In the present work, we show that redundant alignments can be indeed numerous even when working with a pretreated non-redundant data bank, going as high as 60% of the output results according to the query and the bank. Therefore the accuracy and the efficiency of the post-genomic work will be greatly increased if these redundancies are removed. To solve this up to now unaddressed problem, we have developed an algorithm that allows for the efficient and safe suppression of all the redundancies with no loss of information. This algorithm is based on various filtering steps that we describe here in the context of the Automat similarity search program, and such an algorithm should also be added to the other similarity search programs (BLAST, FASTA, etc…). © 2005 Taylor & Francis Group, LLC.",
                "authors": [
                    {
                        "name": "Cantalloube H."
                    },
                    {
                        "name": "Chomilier J."
                    },
                    {
                        "name": "Chiusa S."
                    },
                    {
                        "name": "Lonquety M."
                    },
                    {
                        "name": "Spadoni J.-L."
                    },
                    {
                        "name": "Zagury J.-F."
                    }
                ],
                "citationCount": 2,
                "date": "2005-01-01T00:00:00Z",
                "journal": "Journal of Biomolecular Structure and Dynamics",
                "title": "Filtering redundancies for sequence similarity search programs"
            },
            "pmid": "15588112"
        },
        {
            "metadata": {
                "abstract": "A bank of loops from three to eight amino acid residues long has been constituted. On the basis of statistical analysis of occurrences of conformations and residue, loops could be divided into two parts: the side residues directly bonded to the secondary structure flanking element, and the inner part. The conformations of the side residues are correlated to the nature of their neighboring flanks, while the inner residues adopt conformations uncorrelated from one residue to the next; thus they are unrelated to the flanks. Two zones in the Ramachandran plot are important: α(L) and β(P). In particular, the high occurrence of α(L), mainly occupied by glycine residues, is necessary to induce flexibility and thus allow loops to comply with the geometrical constraints of the flanks. An algorithm of clustering has been used to aggregate loops of the same length within families of similar 3D structures. At each position in each cluster, sequence and conformational signatures have been deduced if the occurrence of a residue (or a conformation) is higher than an equiprobable distribution over all clusters. The result is that some positions favor particular amino acids and conformations, which are typical of a cluster although not unique. This is an indication of a relation between structure and sequence in loops. A taxonomy is proposed that classifies the various clusters. It relies on two terms: the mean distance between the first and last C(α) in one cluster and, perpendicular to this line, the distance to the center of gravity of the cluster. It is noteworthy that the differently populated clusters represented in such 2D plots can be separated. Thus, although the conformations of loops in globular proteins could cover a continuum, it has been possible to cluster them into a limited number of well populated families and superfamilies. This basic feature of protein architecture could be further exploited to better predict their geometry.",
                "authors": [
                    {
                        "name": "Kwasigroch J.-M."
                    },
                    {
                        "name": "Chomilier J."
                    },
                    {
                        "name": "Mornon J.-P."
                    }
                ],
                "citationCount": 86,
                "date": "1996-06-21T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "A global taxonomy of loops in globular proteins"
            },
            "pmid": "8683588"
        },
        {
            "metadata": {
                "abstract": "A new method for comparing and aligning protein sequences is described. This method, hydrophobic cluster analysis (HCA), relies upon a two-dimensional (2D) representation of the sequences. Hydrophobic clusters are determined in this 2D pattern and then used for the sequence comparisons. The method does not require powerful computer resources and can deal with distantly related proteins, even if no 3D data are available. This is illustrated in the present report by a comparison of human haemoglobin with leghaemoglobin, a comparison of the two domains of liver rhodanese (thiosulphate sulphurtransferase) and a comparison of plastocyanin and azurin. © 1987.",
                "authors": [
                    {
                        "name": "Gaboriaud C."
                    },
                    {
                        "name": "Bissery V."
                    },
                    {
                        "name": "Benchetrit T."
                    },
                    {
                        "name": "Mornon J.P."
                    }
                ],
                "citationCount": 538,
                "date": "1987-11-16T00:00:00Z",
                "journal": "FEBS Letters",
                "title": "Hydrophobic cluster analysis: An efficient new way to compare and analyse amino acid sequences"
            },
            "pmid": "3678489"
        },
        {
            "metadata": {
                "abstract": "RPBS (Ressource Parisienne en Bioinformatique Structurale) is a resource dedicated primarily to structural bioinformatics. It is the result of a joint effort by several teams to set up an interface that offers original and powerful methods in the field. As an illustration, we focus here on three such methods uniquely available at RPBS: AUTOMAT for sequence databank scanning, YAKUSA for structure databank scanning and WLOOP for homology loop modelling. The RPBS server can be accessed at http://bioserv.rpbs.jussieu.fr/ and the specific services at http://bioserv.rpbs.jussieu.fr/SpecificServices.html. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Alland C."
                    },
                    {
                        "name": "Moreews F."
                    },
                    {
                        "name": "Boens D."
                    },
                    {
                        "name": "Carpentier M."
                    },
                    {
                        "name": "Chiusa S."
                    },
                    {
                        "name": "Lonquety M."
                    },
                    {
                        "name": "Renault N."
                    },
                    {
                        "name": "Wong Y."
                    },
                    {
                        "name": "Cantalloube H."
                    },
                    {
                        "name": "Chomilier J."
                    },
                    {
                        "name": "Hochez J."
                    },
                    {
                        "name": "Pothier J."
                    },
                    {
                        "name": "Villoutreix B.O."
                    },
                    {
                        "name": "Zagury J.-F."
                    },
                    {
                        "name": "Tuffery P."
                    }
                ],
                "citationCount": 63,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "RPBS: A web resource for structural bioinformatics"
            },
            "pmid": "15980507"
        },
        {
            "metadata": {
                "abstract": "A bank of 13,563 loops from three to eight amino acid residues long, representing motifs between two consecutive regular secondary structures, has been derived from protein structures presenting less than 95% sequence identity. Statistical analyses of occurrences of conformations and residues revealed length-dependent over-representations of particular amino acids (glycine, proline, asparagine, serine, and aspartate) and conformations (α(L), ε, β(p) regions of the Ramachandran plot). A position-dependent distribution of these occurrences was observed for N and C-terminal residues, which are correlated to the nature of the flanking regions. Loops of the same length were clustered into statistically meaningful families on the basis of their backbone structures when placed in a common reference frame, independent of the flanks. These clusters present significantly different distributions of sequence, conformations, and endpoint residue C(α) distances. On the basis of the sequence-structure correlation of this clustering, an automatic loop modeling algorithm was developed. Based on the knowledge of its sequence and of its flank backbone structures each query loop is assigned to a family and target loop supports are selected in this family. The support backbones of these target loops are then adjusted on flanking structures by partial exploration of the conformational space. Loop closure is performed by energy minimization for each support and the final model is chosen among connected supports based upon energy criteria. The quality of the prediction is evaluated by the root-mean-square deviation (rmsd) between the final model and the native loops when the whole bank is re-attributed on itself with a Jacknife test. This average rmsd ranges from 1.1 Å for three-residue loops to 3.8 Å for eight-residue loops. A few poorly predicted loops are inescapable, considering the high level of diversity in loops and the lack of environment data. To overcome such modeling problems, a statistical reliability score was assigned for each prediction. This score is correlated to the quality of the prediction, in terms of rmsd, and thus improves the selection accuracy of the model. The algorithm efficiency was compared to CASP3 target loop predictions, Moreover, when tested on a test loop bank, this algorithm was shown to be robust when the loops are not precisely delimited, therefore proving to be a useful tool in practice for protein modeling.",
                "authors": [
                    {
                        "name": "Wojcik J."
                    },
                    {
                        "name": "Mornon J.-P."
                    },
                    {
                        "name": "Chomilier J."
                    }
                ],
                "citationCount": 84,
                "date": "1999-06-25T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "New efficient statistical sequence-dependent structure prediction of short to medium-sized protein loops based on an exhaustive loop classification"
            },
            "pmid": "10373380"
        },
        {
            "metadata": {
                "abstract": "Automat is a novel program which finds exhaustively all the oligopeptide segments shared by a given protein of any size with the proteins of a whole databank. It allows the user to collect statistics on the composition of the sequence studied in reference to the databank used. We present here the rationale and the algorithm underlying this powerful software. Besides its immediate interest for identifying efficiently similarities between proteins (orDNAs), biological applications of this software have already been described in the case of HIV-1 viral proteins, and Automat should prove useful also for studying more generally autoimmune diseases. © 1994 Oxford University Press.",
                "authors": [
                    {
                        "name": "Cantalloube H."
                    },
                    {
                        "name": "Nahum C."
                    },
                    {
                        "name": "Achour A."
                    },
                    {
                        "name": "Lehner T."
                    },
                    {
                        "name": "Callebaut I."
                    },
                    {
                        "name": "Burny A."
                    },
                    {
                        "name": "Bizzini B."
                    },
                    {
                        "name": "Mornon J.-P."
                    },
                    {
                        "name": "Zagury D."
                    },
                    {
                        "name": "Zagury J.-F."
                    }
                ],
                "citationCount": 11,
                "date": "1994-04-02T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Automat: A novel software system for the systematic search for protein (or DNA) similarities with a notable application to autoimmune diseases and AIDS"
            },
            "pmid": "8019863"
        },
        {
            "metadata": {
                "abstract": "A statistical analysis of the PDB structures has led us to define a new set of small 3D structural prototypes called Protein Blocks (PBs). This structural alphabet includes 16 PBs, each one is defined by the (Φ, Ψ) dihedral angles of 5 consecutive residues. The amino acid distributions observed in sequence windows encompassing these PBs are used to predict by a Bayesian approach the local 3D structure of proteins from the sole knowledge of their sequences. LocPred is a software which allows the users to submit a protein sequence and performs a prediction in terms of PBs. The prediction results are given both textually and graphically. © 2004 - IOS Press and Bioinformation Systems e.V. and the authors. All rights reserved.",
                "authors": [
                    {
                        "name": "de Brevern A.G."
                    },
                    {
                        "name": "Benros C."
                    },
                    {
                        "name": "Gautier R."
                    },
                    {
                        "name": "Valadie H."
                    },
                    {
                        "name": "Hazout S."
                    },
                    {
                        "name": "Etchebest C."
                    }
                ],
                "citationCount": 44,
                "date": "2004-12-17T00:00:00Z",
                "journal": "In Silico Biology",
                "title": "Local backbone structure prediction of proteins"
            },
            "pmid": "15724288"
        },
        {
            "metadata": {
                "abstract": "Since the early 1980s, protein/DNA sequence similarity search has become of major importance to biologists, and the need for fast and efficient tools grows with the size of databanks. Two programs use the strategy of finite state deterministic automatons to accomplish these searches. One of these two is BLAST, which is now widely used, and the other Automat, which has just been published. The differences and similarities in their basic principles, their use and their performances are analysed in this paper in order to allow optimal use of these important softwares. © 1995 Oxford University Press.",
                "authors": [
                    {
                        "name": "Cantalloube H."
                    },
                    {
                        "name": "Labesse G."
                    },
                    {
                        "name": "Chomilier J."
                    },
                    {
                        "name": "Nahum C."
                    },
                    {
                        "name": "Cho Y.Y."
                    },
                    {
                        "name": "Chams V."
                    },
                    {
                        "name": "Achour A."
                    },
                    {
                        "name": "Lachgar A."
                    },
                    {
                        "name": "Mbika J.P."
                    },
                    {
                        "name": "Issing W."
                    },
                    {
                        "name": "Mornon J.P."
                    },
                    {
                        "name": "Bizzini B."
                    },
                    {
                        "name": "Zagury D."
                    },
                    {
                        "name": "Zagury J.-F."
                    }
                ],
                "citationCount": 7,
                "date": "1995-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Automat and BLAST: Comparison of two protein sequence similarity search programs"
            },
            "pmid": "7583694"
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}