{
    "additionDate": "2017-08-03T18:35:47Z",
    "biotoolsCURIE": "biotools:amylpred",
    "biotoolsID": "amylpred",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "email": "shamodr@biol.uoa.gr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://biophysics.biol.uoa.gr/"
        }
    ],
    "description": "Consensus prediction method for identifying possible amyloidogenic regions in protein sequences.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://aias.biol.uoa.gr/AMYLPRED/login.php"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                }
            ]
        }
    ],
    "homepage": "http://aias.biol.uoa.gr/AMYLPRED/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-25T14:17:16.586759Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/amylpred-a-consensus-method-for-amyloid-propensity-prediction.html"
        }
    ],
    "name": "AMYLPRED",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1472-6807-9-44",
            "metadata": {
                "abstract": "Background. Amyloidoses are a group of usually fatal diseases, probably caused by protein misfolding and subsequent aggregation into amyloid fibrillar deposits. The mechanisms involved in amyloid fibril formation are largely unknown and are the subject of current, intensive research. In an attempt to identify possible amyloidogenic regions in proteins for further experimental investigation, we have developed and present here a publicly available online tool that utilizes five different and independently published methods, to form a consensus prediction of amyloidogenic regions in proteins, using only protein primary structure data. Results. It appears that the consensus prediction tool is slightly more objective than individual prediction methods alone and suggests several previously not identified amino acid stretches as potential amyloidogenic determinants, which (although several of them may be overpredictions) require further experimental studies. The tool is available at: http://biophysics.biol.uoa.gr/AMYLPRED. Utilizing molecular graphics programs, like O and PyMOL, as well as the algorithm DSSP, it was found that nearly all experimentally verified amyloidogenic determinants (short peptide stretches favouring aggregation and subsequent amyloid formation), and several predicted, with the aid of the tool AMYLPRED, but not experimentally verified amyloidogenic determinants, are located on the surface of the relevant amyloidogenic proteins. This finding may be important in efforts directed towards inhibiting amyloid fibril formation. Conclusion. The most significant result of this work is the observation that virtually all, to date, experimentally determined amyloidogenic determinants and the majority of predicted, but not yet experimentally verified short amyloidogenic stretches, lie 'exposed' on the surface of the relevant amyloidogenic proteins, and also several of them have the ability to act as conformational 'switches'. Experiments, focused on these fragments, should be performed to test this idea. © 2009 Frousios et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Frousios K.K."
                    },
                    {
                        "name": "Hamodrakas S.J."
                    },
                    {
                        "name": "Iconomidou V.A."
                    },
                    {
                        "name": "Karletidi C.-M."
                    }
                ],
                "citationCount": 128,
                "date": "2009-07-30T00:00:00Z",
                "journal": "BMC Structural Biology",
                "title": "Amyloidogenic determinants are usually not buried"
            },
            "pmcid": "PMC2714319",
            "pmid": "19589171"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
