{
    "additionDate": "2021-01-18T11:16:30Z",
    "biotoolsCURIE": "biotools:pyneal",
    "biotoolsID": "pyneal",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "kathryn.dickerson@duke.edu",
            "name": "Kathryn C. Dickerson",
            "typeEntity": "Person"
        }
    ],
    "description": "Pyneal is an open source software package to support real-time functional magnetic resonance imaging (fMRI). It is entirely Python-based and depends exclusively on free, open source neuroimaging libraries.\n\nThis repository contains a set of tutorials to accompany the Pyneal real-time fMRI software package. For more information on Pyneal, please see Pyneal Docs.\n\nIn order to help with the initial setup, as well as test any analysis scripts and network communications later on, Pyneal includes a suite of simulation tools that mimic various inputs and outputs along the data flow path.\n\nThis respository contains representative data from GE, Siemens, and Philips scanning environments. For a detailed, step-by-step walk-through on setting up and running Pyneal across each of these environments, please see link above.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://github.com/jeffmacinnes/pyneal-tutorial"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://jeffmacinnes.github.io/pyneal-docs/"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://jeffmacinnes.github.io/pyneal-docs/simulations/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Formatting",
                    "uri": "http://edamontology.org/operation_0335"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jeffmacinnes/pyneal",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-30T16:33:28Z",
    "license": "MIT",
    "name": "Pyneal",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FNINS.2020.00900",
            "metadata": {
                "abstract": "© Copyright © 2020 MacInnes, Adcock, Stocco, Prat, Rao and Dickerson.Increasingly, neuroimaging researchers are exploring the use of real-time functional magnetic resonance imaging (rt-fMRI) as a way to access a participant’s ongoing brain function throughout a scan. This approach presents novel and exciting experimental applications ranging from monitoring data quality in real time, to delivering neurofeedback from a region of interest, to dynamically controlling experimental flow, or interfacing with remote devices. Yet, for those interested in adopting this method, the existing software options are few and limited in application. This presents a barrier for new users, as well as hinders existing users from refining techniques and methods. Here we introduce a free, open-source rt-fMRI package, the Pyneal toolkit, designed to address this limitation. The Pyneal toolkit is python-based software that offers a flexible and user friendly framework for rt-fMRI, is compatible with all three major scanner manufacturers (GE, Siemens, Phillips), and, critically, allows fully customized analysis pipelines. In this article, we provide a detailed overview of the architecture, describe how to set up and run the Pyneal toolkit during an experimental session, offer tutorials with scan data that demonstrate how data flows through the Pyneal toolkit with example analyses, and highlight the advantages that the Pyneal toolkit offers to the neuroimaging community.",
                "authors": [
                    {
                        "name": "Adcock R.A."
                    },
                    {
                        "name": "Dickerson K.C."
                    },
                    {
                        "name": "MacInnes J.J."
                    },
                    {
                        "name": "Prat C.S."
                    },
                    {
                        "name": "Rao R.P.N."
                    },
                    {
                        "name": "Stocco A."
                    }
                ],
                "date": "2020-09-15T00:00:00Z",
                "journal": "Frontiers in Neuroscience",
                "title": "Pyneal: Open Source Real-Time fMRI Software"
            },
            "pmcid": "PMC7522368",
            "pmid": "33041750"
        }
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
