{
    "additionDate": "2023-01-28T14:29:30.363249Z",
    "biotoolsCURIE": "biotools:gra-gcn",
    "biotoolsID": "gra-gcn",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Zhenyu Yue",
            "orcidid": "https://orcid.org/0000-0002-9370-2540"
        }
    ],
    "description": "Dense granule protein prediction in Apicomplexa protozoa through graph convolutional network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "http://dgpd.tlds.cc/GRAGCN/index/",
    "lastUpdate": "2024-11-24T15:07:08.957609Z",
    "license": "Other",
    "name": "GRA-GCN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/tcbb.2022.3224836",
            "metadata": {
                "abstract": "Dense granule proteins (GRAs) are secreted by Apicomplexa protozoa, which are closely related to an extensive variety of farm animal diseases. Predicting GRAs is an integral part in prevention and treatment of parasitic diseases. Considering that biological experiment approach is time-consuming and labor-intensive, computational method is a superior choice. Hence, developing an effective computational method for GRAs prediction is of urgency. In this paper, we present a novel computational method named GRA-GCN through graph convolutional network. In terms of the graph theory, the GRAs prediction can be regarded as a node classification task. GRA-GCN leverages k-nearest neighbor algorithm to construct the feature graph for aggregating more informative representation. To our knowledge, this is the first attempt to utilize computational approach for GRAs prediction. Evaluated by 5-fold cross-validations, the GRA-GCN method achieves satisfactory performance, and is superior to four classic machine learning-based methods and three state-of-the-art models. The analysis of the comprehensive experiment results and a case study could offer valuable information for understanding complex mechanisms, and would contribute to accurate prediction of GRAs. Moreover, we also implement a web server at http://dgpd.tlds.cc/GRAGCN/index/, for facilitating the process of using our model.",
                "authors": [
                    {
                        "name": "Feng H."
                    },
                    {
                        "name": "Lu Z."
                    },
                    {
                        "name": "Shi H."
                    },
                    {
                        "name": "Xue W."
                    },
                    {
                        "name": "Yang C."
                    },
                    {
                        "name": "Yue Z."
                    }
                ],
                "citationCount": 1,
                "date": "2023-05-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "GRA-GCN: Dense Granule Protein Prediction in Apicomplexa Protozoa Through Graph Convolutional Network"
            },
            "pmid": "36441896"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ]
}
