{
    "additionDate": "2021-01-18T10:23:47Z",
    "biotoolsCURIE": "biotools:idrmutpred",
    "biotoolsID": "idrmutpred",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yezq@pku.org.cn",
            "name": "Zhi-Qiang Ye",
            "orcidid": "https://orcid.org/0000-0002-8822-6148",
            "typeEntity": "Person"
        },
        {
            "email": "ydwu@pku.edu.cn",
            "name": "Yun-Dong Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "Predicting disease-associated germline nonsynonymous single nucleotide variants (nsSNVs) in intrinsically disordered regions.\n\nIDRMutPred is a specific and accurate computational approach to prioritizing disease-associated nonsynonymous single nucleotide variants (nsSNVs) in intrinsically disordered regions (IDR).\n\nIDRMutPred is specifically trained on the IDR nsSNVs, and is specifically utilized to the IDR nsSNVs. IDRMutPred outperforms other general-purpose predictors for the IDR nsSNVs. This web server will serve as a valuable tool in the research community that focuses on the study of nsSNVs, especially those located in intrinsic disordered regions (Go to Predictor).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein disorder prediction",
                    "uri": "http://edamontology.org/operation_3904"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "http://www.wdspdb.com/IDRMutPred",
    "lastUpdate": "2021-02-03T07:29:56Z",
    "name": "IDRMutPred",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA618",
            "metadata": {
                "abstract": "© The Author(s) 2020.Motivation: Despite of the lack of folded structure, intrinsically disordered regions (IDRs) of proteins play versatile roles in various biological processes, and many nonsynonymous single nucleotide variants (nsSNVs) in IDRs are associated with human diseases. The continuous accumulation of nsSNVs resulted from the wide application of NGS has driven the development of disease-association prediction methods for decades. However, their performance on nsSNVs in IDRs remains inferior, possibly due to the domination of nsSNVs from structured regions in training data. Therefore, it is highly demanding to build a disease-association predictor specifically for nsSNVs in IDRs with better performance. Results: We present IDRMutPred, a machine learning-based tool specifically for predicting disease-associated germline nsSNVs in IDRs. Based on 17 selected optimal features that are extracted from sequence alignments, protein annotations, hydrophobicity indices and disorder scores, IDRMutPred was trained using three ensemble learning algorithms on the training dataset containing only IDR nsSNVs. The evaluation on the two testing datasets shows that all the three prediction models outperform 17 other popular general predictors significantly, achieving the ACC between 0.856 and 0.868 and MCC between 0.713 and 0.737. IDRMutPred will prioritize disease-associated IDR germline nsSNVs more reliably than general predictors.",
                "authors": [
                    {
                        "name": "An K."
                    },
                    {
                        "name": "Wu Y.-D."
                    },
                    {
                        "name": "Xiong Y."
                    },
                    {
                        "name": "Ye Z.-Q."
                    },
                    {
                        "name": "Zhou J.-B."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IDRMutPred: Predicting disease-associated germline nonsynonymous single nucleotide variants (nsSNVs) in intrinsically disordered regions"
            },
            "pmcid": "PMC7755418",
            "pmid": "32756939"
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein disordered structure",
            "uri": "http://edamontology.org/topic_3538"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
