{
    "additionDate": "2016-04-27T13:39:57Z",
    "biotoolsCURIE": "biotools:viperdb",
    "biotoolsID": "viperdb",
    "credit": [
        {
            "email": "mauricio.carrillo@cinvestav.mx",
            "name": "M. Carrillo-Tripp",
            "orcidid": "http://orcid.org/0000-0003-0060-6486",
            "typeEntity": "Person",
            "typeRole": [
                "Contributor"
            ]
        },
        {
            "name": "rki.de",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://viperdb.scripps.edu/contact.php"
        }
    ],
    "description": "Web-based catalogue of structural information that describes the icosahedral virus particles. In addition to high-resolution crystal structures, it has expanded to include virus structures obtained by cryo-electron microscopy (EM) techniques. This database is a powerful resource for virologists, microbiologists, virus crystallographers and EM researchers.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://viperdb.scripps.edu/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "homepage": "http://viperdb.scripps.edu/",
    "lastUpdate": "2021-04-25T12:49:59Z",
    "name": "VIPERdb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_007970"
        }
    ],
    "owner": "dabrowskiw@rki.de",
    "publication": [
        {
            "doi": "10.1093/nar/gkn840",
            "metadata": {
                "abstract": "VIPERdb (http://viperdb.scripps.edu) is a relational database and a web portal for icosahedral virus capsid structures. Our aim is to provide a comprehensive resource specific to the needs of the virology community, with an emphasis on the description and comparison of derived data from structural and computational analyses of the virus capsids. In the current release, VIPERdb2, we implemented a useful and novel method to represent capsid protein residues in the icosahedral asymmetric unit (IAU) using azimuthal polar orthographic projections, otherwise known as Φ-Ψ (Phi-Psi) diagrams. In conjunction with a new Application Programming Interface (API), these diagrams can be used as a dynamic interface to the database to map residues (categorized as surface, interface and core residues) and identify family wide conserved residues including hotspots at the interfaces. Additionally, we enhanced the interactivity with the database by interfacing with web-based tools. In particular, the applications Jmol and STRAP were implemented to visualize and interact with the virus molecular structures and provide sequence-structure alignment capabilities. Together with extended curation practices that maintain data uniformity, a relational database implementation based on a schema for macromolecular structures and the APIs provided will greatly enhance the ability to do structural bioinformatics analysis of virus capsids. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Borelli I.A."
                    },
                    {
                        "name": "Brooks III C.I."
                    },
                    {
                        "name": "Carrillo-Tripp M."
                    },
                    {
                        "name": "Johnson J.E."
                    },
                    {
                        "name": "Lander G."
                    },
                    {
                        "name": "Natarajan P."
                    },
                    {
                        "name": "Reddy V.S."
                    },
                    {
                        "name": "Shepherd C.M."
                    },
                    {
                        "name": "Venkataraman S."
                    }
                ],
                "citationCount": 287,
                "date": "2009-01-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "VIPERdb2: An enhanced and web API enabled relational database for structural virology"
            },
            "pmcid": "PMC2686430",
            "pmid": "18981051",
            "type": [
                "Primary"
            ]
        },
        {
            "metadata": {
                "abstract": "Virus structures are megadalton nucleoprotein complexes with an exceptional variety of protein -protein and protein -nucleic-acid interactions. Three-dimensional crystal structures of over 70 virus capsids, from more than 20 families and 30 different genera of viruses, have been solved to near-atomic resolution. The enormous amount of information contained in these structures is difficult to access, even for scientists trained in structural biology. Virus Particle Explorer (VIPER) is a web-based catalogue of structural information that describes the icosahedral virus particles. In addition to high-resolution crystal structures, VIPER has expanded to include virus structures obtained by cryo-electron microscopy (EM) techniques. The VIPER database is a powerful resource for virologists, microbiologists, virus crystallographers and EM researchers. This review describes how to use VIPER, using several examples to show the power of this resource for research and educational purposes. © 2005 Nature Publishing Group.",
                "authors": [
                    {
                        "name": "Brooks III C.L."
                    },
                    {
                        "name": "Johnson J.E."
                    },
                    {
                        "name": "Lander G.C."
                    },
                    {
                        "name": "Natarajan P."
                    },
                    {
                        "name": "Reddy V.S."
                    },
                    {
                        "name": "Shepherd C.M."
                    }
                ],
                "citationCount": 36,
                "date": "2005-10-01T00:00:00Z",
                "journal": "Nature Reviews Microbiology",
                "title": "Exploring icosahedral virus structures with VIPER"
            },
            "pmid": "16205712",
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        }
    ],
    "validated": 1
}
