{
    "additionDate": "2022-06-25T08:26:56.610480Z",
    "biotoolsCURIE": "biotools:dhi-gan",
    "biotoolsID": "dhi-gan",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Yi Lin"
        },
        {
            "name": "Yi Zhang",
            "orcidid": "https://orcid.org/0000-0001-7201-2092"
        }
    ],
    "description": "Improving Dental-Based Human Identification Using Generative Adversarial Networks",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sculyi/MedicalImages/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T16:01:23.995178Z",
    "name": "DHI-GAN",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/tnnls.2022.3159781",
            "metadata": {
                "abstract": "—In this work, a novel semisupervised framework is proposed to tackle the small-sample problem of dental-based human identification (DHI), achieving enhanced performance via a “classifying while generating” paradigm. A generative adversarial network (GAN), called the DHI-GAN, is presented to implement this idea, in which an extra classifier is also dedicatedly proposed to achieve an efficient training procedure. Considering the complex specificities of this problem, except for the noise input of the generator, an identity embedding-guided architecture is proposed to retain informative features for each individual. A parallel spatial and channel fusion attention block is innovatively designed to encourage the model to learn discriminative and informative features by focusing on different regional details and abstract concepts. The attention block is also widely applied to the overall classifier to learn identity-dependent information. A loss combination of the ArcFace and focal loss is utilized to address the small-sample problem. Two parameters are proposed to control the generated samples that are fed into the classifier during the optimization procedure. The proposed DHI-GAN framework is finally validated on a real-world dataset, and the experimental results demonstrate that it outperforms other baselines, achieving a 92.5% top-one accuracy rate. Most importantly, the proposed GAN-based semisupervised training strategy is able to reduce the required number of training samples (individuals) and can also be incorporated into other classification models. Our code will be available at https://github.com/sculyi/MedicalImages/.",
                "authors": [
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Deng Z."
                    },
                    {
                        "name": "Fan F."
                    },
                    {
                        "name": "Liao P."
                    },
                    {
                        "name": "Lin Y."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "citationCount": 2,
                "date": "2023-12-01T00:00:00Z",
                "journal": "IEEE Transactions on Neural Networks and Learning Systems",
                "title": "DHI-GAN: Improving Dental-Based Human Identification Using Generative Adversarial Networks"
            },
            "pmid": "35333725"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Echography",
            "uri": "http://edamontology.org/topic_3954"
        },
        {
            "term": "Human biology",
            "uri": "http://edamontology.org/topic_2815"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "validated": 1
}
