{"credit":[{"email":"aneuwald@som.umaryland.edu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://mapgaps.igs.umaryland.edu/readme"}],"documentation":[{"type":"GENERAL","url":"http://mapgaps.igs.umaryland.edu/readme"}],"function":[{"operation":[{"term":"Sequence alignment","uri":"http://edamontology.org/operation_0292"}]},{"operation":[{"term":"Classification","uri":"http://edamontology.org/operation_2990"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mapgaps-multiply-aligned-profiles-for-global-alignment-of-protein-sequences.html"}],"publication":[{"abstract":"Motivation: The patterns of sequence similarity and divergence present within functionally diverse, evolutionarily related proteins contain implicit information about corresponding biochemical similarities and differences. A first step toward accessing such information is to statistically analyze these patterns, which, in turn, requires that one first identify and accurately align a very large set of protein sequences. Ideally, the set should include many distantly related, functionally divergent subgroups. Because it is extremely difficult, if not impossible for fully automated methods to align such sequences correctly, researchers often resort to manual curation based on detailed structural and biochemical information. However, multiply-aligning vast numbers of sequences in this way is clearly impractical. Results: This problem is addressed using Multiply-Aligned Profiles for Global Alignment of Protein Sequences (MAPGAPS). The MAPGAPS program uses a set of multiply-aligned profiles both as a query to detect and classify related sequences and as a template to multiply-align the sequences. It relies on Karlin-Altschul statistics for sensitivity and on PSI-BLAST (and other) heuristics for speed. Using as input a carefully curated multiple-profile alignment for P-loop GTPases, MAPGAPS correctly aligned weakly conserved sequence motifs within 33 distantly related GTPases of known structure. By comparison, the sequence- and structurally based alignment methods hmmalign and PROMALS3D misaligned at least 11 and 23 of these regions, respectively. When applied to a dataset of 65 million protein sequences, MAPGAPS identified, classified and aligned (with comparable accuracy) nearly half a million putative P-loop GTPase sequences. © The Author 2009. Published by Oxford University Press. All rights reserved.","authors":["Neuwald A.F."],"cit_count":29,"journal":"Bioinformatics","pmid":"19505947","title":"Rapid detection, classification and accurate alignment of up to a million or more related protein sequences","year":"2009-08-01"}],"summary":{"biotoolsCURIE":"biotools:mapgaps","biotoolsID":"mapgaps","description":"Uses a set of multiply-aligned profiles both as a query to detect and classify related sequences and as a template to multiply-align the sequences.","homepage":"http://mapgaps.igs.umaryland.edu/","name":"MAPGAPS"}}