{
    "additionDate": "2020-01-14T19:59:16Z",
    "biotoolsCURIE": "biotools:DIVERCROP",
    "biotoolsID": "DIVERCROP",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "marta.debolini@inra.fr",
            "name": "Marta Debolini",
            "typeEntity": "Person"
        }
    ],
    "description": "An open dataset about georeferenced harmonized national agricultural censuses and surveys of seven mediterranean countries.\n\nDivercrop – The DIVERCROP project aims to highlight interactions between current dynamics of the Mediterranean agricultural practices, species diversity and local food systems.\n\nIndex of /gn_plateau_ressources/divercrop.\n\nThe DIVERCROP project aims to highlights interactions between current dynamics of the Mediterranean agricultural practices, species diversity and local food systems at multiple spatial scales.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/phylosift (WORDPRESS.COM), bio.tools/WATCLUST (WORDPRESS.COM), bio.tools/PinMol (WORDPRESS.COM), bio.tools/imdev (WORDPRESS.COM), bio.tools/graphdtl (WORDPRESS.COM)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://divercropblog.wordpress.com/",
    "lastUpdate": "2020-01-14T19:59:16Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://w3.avignon.inra.fr/gn_plateau_ressources/divercrop/"
        }
    ],
    "name": "DIVERCROP",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.DIB.2019.104774",
            "metadata": {
                "abstract": "© 2019 The AuthorsThe dataset presented in this paper is based on data gathered from several countries within the West Mediterranean area at the highest detailed scale regarding official statistics, with the aim of investigating land and food systems dynamics in the Mediterranean. Characterizing land and food systems dynamics is critical to reveal insights regarding interactions between current dynamics of agricultural practices, species diversity and local food systems. These interactions were analyzed, at multiple spatial scales, on a large part of the Mediterranean basin within the DIVERCROP Project (https://divercropblog.wordpress.com/). An harmonized dataset with the desired characteristics was not readily available from official sources and, therefore, it was necessary to build an ad hoc database that could: (1) cover the Mediterranean areas of seven countries, namely Algeria (DZ), France (FR), Italy (IT), Malta (MT), Portugal (PT), Spain (ES) and Tunisia (TN); (2) contain data referred to the most disaggregated level of administrative units for which data is available in each country; (3) contain data referred to at least two time points, including the latest available data, in each country; (4) contain data on number of farm holdings, on the physical areas covered by the main annual and permanent crops and on livestock (number of heads); (5) contain a primary key that allows joining the census and surveys database to a geographical dataset of administrative units covering the entire area; (6) have an associated complete geographical dataset of administrative units, to allow spatial data analyses.",
                "authors": [
                    {
                        "name": "Villani R."
                    },
                    {
                        "name": "Sabbatini T."
                    },
                    {
                        "name": "Perez O.M."
                    },
                    {
                        "name": "Guiomar N."
                    },
                    {
                        "name": "Debolini M."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Data in Brief",
                "title": "An open dataset about georeferenced harmonized national agricultural censuses and surveys of seven mediterranean countries"
            },
            "pmcid": "PMC6880016",
            "pmid": "31788512"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        }
    ]
}