{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.csbio.sjtu.edu.cn/"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequences","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/targetvita-vitamin-specific-predictor-for-targeting-protein-vitamin-binding-residues.html"}],"publication":[{"abstract":"© 2014 Yu et al.; licensee BioMed Central Ltd.Background: Vitamins are typical ligands that play critical roles in various metabolic processes. The accurate identification of the vitamin-binding residues solely based on a protein sequence is of significant importance for the functional annotation of proteins, especially in the post-genomic era, when large volumes of protein sequences are accumulating quickly without being functionally annotated.Results: In this paper, a new predictor called TargetVita is designed and implemented for predicting protein-vitamin binding residues using protein sequences. In TargetVita, features derived from the position-specific scoring matrix (PSSM), predicted protein secondary structure, and vitamin binding propensity are combined to form the original feature space; then, several feature subspaces are selected by performing different feature selection methods. Finally, based on the selected feature subspaces, heterogeneous SVMs are trained and then ensembled for performing prediction.Conclusions: The experimental results obtained with four separate vitamin-binding benchmark datasets demonstrate that the proposed TargetVita is superior to the state-of-the-art vitamin-specific predictor, and an average improvement of 10% in terms of the Matthews correlation coefficient (MCC) was achieved over independent validation tests. The TargetVita web server and the datasets used are freely available for academic use at http://csbio.njust.edu.cn/bioinf/TargetVita or http://www.csbio.sjtu.edu.cn/bioinf/TargetVita.","authors":["Yu D.-J.","Hu J.","Yan H.","Yang X.-B.","Yang J.-Y.","Shen H.-B."],"cit_count":15,"doi":"10.1186/1471-2105-15-297","journal":"BMC Bioinformatics","title":"Enhancing protein-vitamin binding residues prediction by multiple heterogeneous subspace SVMs ensemble","type":"Primary","year":"2014-09-05"}],"summary":{"biotoolsCURIE":"biotools:targetvita","biotoolsID":"targetvita","description":"Vitamin-specific predictor for targeting protein-vitamin binding residues.","homepage":"http://www.csbio.sjtu.edu.cn:8080/TargetVita/","name":"TargetVita"}}