{
    "additionDate": "2021-07-06T16:57:04Z",
    "biotoolsCURIE": "biotools:control-freec",
    "biotoolsID": "control-freec",
    "description": "Control-FREEC is a tool for detection of copy-number changes and allelic imbalances (including LOH) using deep-sequencing data",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Complex CNV detection",
                    "uri": "http://edamontology.org/operation_3964"
                }
            ]
        }
    ],
    "homepage": "http://boevalab.inf.ethz.ch/FREEC/",
    "lastUpdate": "2024-11-24T20:21:38.226762Z",
    "name": "Control-FREEC",
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr670",
            "metadata": {
                "abstract": "More and more cancer studies use next-generation sequencing (NGS) data to detect various types of genomic variation. However, even when researchers have such data at hand, single-nucleotide polymorphism arrays have been considered necessary to assess copy number alterations and especially loss of heterozygosity (LOH). Here, we present the tool Control-FREEC that enables automatic calculation of copy number and allelic content profiles from NGS data, and consequently predicts regions of genomic alteration such as gains, losses and LOH. Taking as input aligned reads, Control-FREEC constructs copy number and B-allele frequency profiles. The profiles are then normalized, segmented and analyzed in order to assign genotype status (copy number and allelic content) to each genomic region. When a matched normal sample is provided, Control-FREEC discriminates somatic from germline events. Control-FREEC is able to analyze overdiploid tumor samples and samples contaminated by normal cells. Low mappability regions can be excluded from the analysis using provided mappability tracks. © The Author(s) 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Barillot E."
                    },
                    {
                        "name": "Bleakley K."
                    },
                    {
                        "name": "Boeva V."
                    },
                    {
                        "name": "Cappo J."
                    },
                    {
                        "name": "Chiche P."
                    },
                    {
                        "name": "Delattre O."
                    },
                    {
                        "name": "Janoueix-Lerosey I."
                    },
                    {
                        "name": "Popova T."
                    },
                    {
                        "name": "Schleiermacher G."
                    }
                ],
                "citationCount": 695,
                "date": "2012-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Control-FREEC: A tool for assessing copy number and allelic content using next-generation sequencing data"
            },
            "pmcid": "PMC3268243",
            "pmid": "22155870"
        }
    ]
}
