
{
    "credit": [
        {
            "email": "megamapper@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://wiki.med.harvard.edu/SysBio/Megason/"
        }
    ],
    "documentation": [
        {
            "url": "http://megason.med.harvard.edu/downloads/VB_MM_Galaxy_tutorial.htm"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Polymorphism detection",
                    "uri": "http://edamontology.org/operation_3202"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA mutation",
                "uri": "http://edamontology.org/topic_2533"
            },
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/megamapper-1-01d-software-positional-cloning-mutations-genome-sequencing.html"
        }
    ],
    "publication": [
        {
            "abstract": "Forward genetic screens in zebrafish have identified >9000 mutants, many of which are potential disease models. Most mutants remain molecularly uncharacterized because of the high cost, time and labor investment required for positional cloning. These costs limit the benefit of previous genetic screens and discourage future screens. Drastic improvements in DNA sequencing technology could dramatically improve the efficiency of positional cloning in zebrafish and other model organisms, but the best strategy for cloning by sequencing has yet to be established. Using four zebrafish inner ear mutants, we developed and compared two approaches for 'cloning by sequencing': one based on bulk segregant linkage (BSFseq) and one based on homozygosity mapping (HMFseq). Using BSFseq we discovered that mutations in lmx1b and jagged1b cause abnormal ear morphogenesis. With HMFseq we validated that the disruption of cdh23 abolishes the ear's sensory functions and identified a candidate lesion in lhfpl5a predicted to cause nonsyndromic deafness. The success of HMFseq shows that the high intrastrain polymorphism rate in zebrafish eliminates the need for time-consuming map crosses. Additionally, we analyzed diversity in zebrafish laboratory strains to find areas of elevated diversity and areas of fixed homozygosity, reinforcing recent findings that genome diversity is clustered. We present a database of >15 million sequence variants that provides much of this approach's power. In our four test cases, only a single candidate single nucleotide polymorphism (SNP) remained after subtracting all database SNPs from a mutant's critical region. The saturation of the common SNP database and our open source analysis pipeline MegaMapper will improve the pace at which the zebrafish community makes unique discoveries relevant to human health. © 2012. Published by The Company of Biologists Ltd.",
            "authors": [
                "Obholzer N.",
                "Swinburne I.A.",
                "Schwab E.",
                "Nechiporuk A.V.",
                "Nicolson T.",
                "Megason S.G."
            ],
            "cit_count": 47,
            "journal": "Development (Cambridge)",
            "pmid": "23052906",
            "title": "Rapid positional cloning of zebrafish mutations by linkage and homozygosity mapping using whole-genome sequencing",
            "year": "2012-11-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:megamapper",
        "biotoolsID": "megamapper",
        "description": "Computational pipeline for positional cloning of mutations by whole genome sequencing.",
        "homepage": "https://wiki.med.harvard.edu/SysBio/Megason/MegaMapper",
        "name": "MegaMapper"
    }
}