{
    "additionDate": "2017-12-06T18:14:11Z",
    "biotoolsCURIE": "biotools:mltree",
    "biotoolsID": "mltree",
    "credit": [
        {
            "email": "wwwphylo@unil.ch",
            "name": "MLtree Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MLtree is a software to compute maximum likelihood optimization of models of character evolution (either DNA or phenotypic ones) along the branches of a phylogenetic tree. It is assuming that the phylogenetic tree is known.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (maximum likelihood and Bayesian methods)",
                    "uri": "http://edamontology.org/operation_0547"
                }
            ]
        }
    ],
    "homepage": "https://www2.unil.ch/phylo/bioinformatics/mltree.html",
    "homepage_status": 1,
    "lastUpdate": "2019-09-04T08:37:50Z",
    "name": "MLtree",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1016/j.cub.2007.11.058",
            "metadata": {
                "abstract": "C4 photosynthesis is an adaptation derived from the more common C3 photosynthetic pathway that confers a higher productivity under warm temperature and low atmospheric CO2 concentration [1, 2]. C4 evolution has been seen as a consequence of past atmospheric CO2 decline, such as the abrupt CO2 fall 32-25 million years ago (Mya) [3-6]. This relationship has never been tested rigorously, mainly because of a lack of accurate estimates of divergence times for the different C4 lineages [3]. In this study, we inferred a large phylogenetic tree for the grass family and estimated, through Bayesian molecular dating, the ages of the 17 to 18 independent grass C4 lineages. The first transition from C3 to C4 photosynthesis occurred in the Chloridoideae subfamily, 32.0-25.0 Mya. The link between CO2 decrease and transition to C4 photosynthesis was tested by a novel maximum likelihood approach. We showed that the model incorporating the atmospheric CO2 levels was significantly better than the null model, supporting the importance of CO2 decline on C4 photosynthesis evolvability. This finding is relevant for understanding the origin of C4 photosynthesis in grasses, which is one of the most successful ecological and evolutionary innovations in plant history. © 2008 Elsevier Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Christin P.-A."
                    },
                    {
                        "name": "Besnard G."
                    },
                    {
                        "name": "Samaritani E."
                    },
                    {
                        "name": "Duvall M.R."
                    },
                    {
                        "name": "Hodkinson T.R."
                    },
                    {
                        "name": "Savolainen V."
                    },
                    {
                        "name": "Salamin N."
                    }
                ],
                "citationCount": 237,
                "date": "2008-01-08T00:00:00Z",
                "journal": "Current Biology",
                "title": "Oligocene CO2 Decline Promoted C4 Photosynthesis in Grasses"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}