{
    "additionDate": "2019-11-14T19:57:54Z",
    "biotoolsCURIE": "biotools:LabNet",
    "biotoolsID": "LabNet",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "barbara.izzo@unina.it",
            "name": "Barbara Izzo",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'CML', 'Monitoring Chronic Myeloid Leukemia', 'TKI', 'tempt' | How Molecular Tools May Drive Therapeutic Approaches | È una rete che mette in comunicazione i medici ematologi italiani che trattano la Leucemia Mieloide Cronica (CML) con laboratori dove si eseguono esami molto sofisticati di biologia molecolare . Al momento nella rete LabNet LMC operano 55 Laboratori, standardizzati e sottoposti a controlli di qualità; ciascun di essi, grazie alla rete, funziona da riferimento per uno o più Centri di ematologia",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "http://www.gimema.it/labnet-cml/",
    "lastUpdate": "2019-11-14T19:57:54Z",
    "name": "LabNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FONC.2019.00833",
            "metadata": {
                "abstract": "© Copyright © 2019 Izzo, Gottardi, Errichiello, Daraio, Baratè and Galimberti.More than 15 years ago, imatinib entered into the clinical practice as a “magic bullet”; from that point on, the prognosis of patients affected by chronic myeloid leukemia (CML) became comparable to that of aged-matched healthy subjects. The aims of treatment with tyrosine kinase inhibitors (TKIs) are for complete hematological response after 3 months of treatment, complete cytogenetic response after 6 months, and a reduction of the molecular disease of at least 3 logs after 12 months. Patients who do not reach their goal can switch to another TKI. Thus, the molecular monitoring of response is the main consideration of management of CML patients. Moreover, cases in deep and persistent molecular response can tempt the physician to interrupt treatment, and this “dream” is possible due to the quantitative PCR. After great international effort, today the BCR-ABL1 expression obtained in each laboratory is standardized and expressed as “international scale.” This aim has been reached after the establishment of the EUTOS program (in Europe) and the LabNet network (in Italy), the platforms where biologists meet clinicians. In the field of quantitative PCR, the digital PCR is now a new and promising, sensitive and accurate tool. Some authors reported that digital PCR is able to better classify patients in precise “molecular classes,” which could lead to a better identification of those cases that will benefit from the interruption of therapy. In addition, digital PCR can be used to identify a point mutation in the ABL1 domain, mutations that are often responsible for the TKI resistance. In the field of resistance, a prominent role is played by the NGS that enables identification of any mutation in ABL1 domain, even at sub-clonal levels. This manuscript reviews how the molecular tools can lead the management of CML patients, focusing on the more recent technical advances.",
                "authors": [
                    {
                        "name": "Izzo B."
                    },
                    {
                        "name": "Gottardi E.M."
                    },
                    {
                        "name": "Errichiello S."
                    },
                    {
                        "name": "Daraio F."
                    },
                    {
                        "name": "Barate C."
                    },
                    {
                        "name": "Galimberti S."
                    }
                ],
                "citationCount": 2,
                "date": "2019-09-06T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "Monitoring Chronic Myeloid Leukemia: How Molecular Tools May Drive Therapeutic Approaches"
            },
            "pmcid": "PMC6742705",
            "pmid": "31555590"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}