{
    "additionDate": "2018-07-16T11:10:57Z",
    "biotoolsCURIE": "biotools:p4p",
    "biotoolsID": "p4p",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://sing-group.org/p4p/index.php#section-contact"
        }
    ],
    "description": "Peptidomes for Phylogenies. Bacterial strain classification based on peptide datasets.",
    "documentation": [
        {
            "type": [
                "General",
                "Training material"
            ],
            "url": "http://sing-group.org/p4p/tutorial.php"
        },
        {
            "type": [
                "Training material"
            ],
            "url": "http://sing-group.org/p4p/demos.php"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Protein fragment weight comparison",
                    "uri": "http://edamontology.org/operation_2929"
                }
            ]
        }
    ],
    "homepage": "http://sing-group.org/p4p",
    "lastUpdate": "2019-03-26T08:29:13Z",
    "name": "P4P",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/nar/gkx389",
            "metadata": {
                "abstract": "© 2017 The Author(s).Peptidome similarity analysis enables researchers to gain insights into differential peptide profiles, providing a robust tool to discriminate strain-specific peptides, true intra-species differences among biological replicates or even microorganism-phenotype variations. However, no in silico peptide fingerprinting software existed to facilitate such phylogeny inference. Hence, we developed the Peptidomes for Phylogenies (P4P) web tool, which enables the survey of similarities between microbial proteomes and simplifies the process of obtaining new biological insights into their phylogeny. P4P can be used to analyze different peptide datasets, i.e. bacteria, viruses, eukaryotic species or even metaproteomes. Also, it is able to work with whole proteome datasets and experimental mass-to-charge lists originated from mass spectrometers. The ultimate aim is to generate a valid and manageable list of peptides that have phylogenetic signal and are potentially sample-specific. Sample-to-sample comparison is based on a consensus peak set matrix, which can be further submitted to phylogenetic analysis. P4P holds great potential for improving phylogenetic analyses in challenging taxonomic groups, biomarker identification or epidemiologic studies. Notably, P4P can be of interest for applications handling large proteomic datasets, which it is able to reduce to small matrices while maintaining high phylogenetic resolution. The web server is available at http://sing-group.org/p4p.",
                "authors": [
                    {
                        "name": "Blanco-Miguez A."
                    },
                    {
                        "name": "Fdez-Riverola F."
                    },
                    {
                        "name": "Lourenco A."
                    },
                    {
                        "name": "Sanchez B."
                    }
                ],
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "P4P: A peptidome-based strain-level genome comparison web tool"
            },
            "pmcid": "PMC5570244",
            "pmid": "28482090"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
