{
    "additionDate": "2019-11-14T18:41:16Z",
    "biotoolsCURIE": "biotools:MIND",
    "biotoolsID": "MIND",
    "confidence_flag": "tool",
    "description": "Using multiple measurements of tissue to estimate subject- and cell-type-specific gene expression | Using Multiple Measurements of Tissue to Estimate Subject- And Cell-Type-Specific Gene Expression via Deconvolution | MIND (Multi-measure INdividual Deconvolution) | MIND is a method to glean insights from bulk gene expression. It borrows information across multiple measurements of the same tissue per subject, such as multiple regions of the brain, using an empirical Bayes approach to estimate subject- and cell-type-specific gene expression via deconvolution",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                }
            ]
        }
    ],
    "homepage": "https://github.com/randel/MIND",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-28T10:51:04Z",
    "name": "MIND",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ619",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Patterns of gene expression, quantified at the level of tissue or cells, can inform on etiology of disease. There are now rich resources for tissue-level (bulk) gene expression data, which have been collected from thousands of subjects, and resources involving single-cell RNA-sequencing (scRNA-seq) data are expanding rapidly. The latter yields cell type information, although the data can be noisy and typically are derived from a small number of subjects. Results: Complementing these approaches, we develop a method to estimate subject- and cell-type-specific (CTS) gene expression from tissue using an empirical Bayes method that borrows information across multiple measurements of the same tissue per subject (e.g. multiple regions of the brain). Analyzing expression data from multiple brain regions from the Genotype-Tissue Expression project (GTEx) reveals CTS expression, which then permits downstream analyses, such as identification of CTS expression Quantitative Trait Loci (eQTL).",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Devlin B."
                    },
                    {
                        "name": "Roeder K."
                    }
                ],
                "citationCount": 4,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Using multiple measurements of tissue to estimate subject- And cell-type-specific gene expression"
            },
            "pmid": "31400192"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}