{
    "additionDate": "2017-10-10T16:23:45Z",
    "biotoolsCURIE": "biotools:wopper",
    "biotoolsID": "wopper",
    "credit": [
        {
            "email": "flavio.licciulli@ba.itb.cnr.it",
            "name": "Flavio Licciulli",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://wopper.ba.itb.cnr.it/Credits"
        }
    ],
    "description": "Webserver for Position Related data analysis of gene Expression in Prokaryotes is a web-tool for the analysis of bacteria transcriptomic data. Gene expression is integrated with genomic annotations to reveal connections between transcription regulation and structural organization of bacterial genomes. The analysis results include clusters of positionally proximal genes having the same trend of differential gene expression, along with graphical representations of the modulated clusters.",
    "documentation": [
        {
            "type": "User manual",
            "url": "https://wopper.ba.itb.cnr.it/Tutorials"
        }
    ],
    "editPermission": {
        "authors": [
            "flavioli"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression profile",
                        "uri": "http://edamontology.org/data_0928"
                    },
                    "format": [
                        {
                            "term": "BED",
                            "uri": "http://edamontology.org/format_3003"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "RNA-Seq quantification",
                    "uri": "http://edamontology.org/operation_3800"
                }
            ]
        }
    ],
    "homepage": "https://wopper.ba.itb.cnr.it/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "WoPPER",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "flavioli",
    "publication": [
        {
            "doi": "10.1093/nar/gkx329",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press on behalf of Nucleic Acids Research. The structural and conformational organization of chromosomes is crucial for gene expression regulation in eukaryotes and prokaryotes as well. Up to date, gene expression data generated using either microarray or RNA-sequencing are available for many bacterial genomes. However, differential gene expression is usually investigated with methods considering each gene independently, thus not taking into account the physical localization of genes along a bacterial chromosome. Here, we present WoPPER, a web tool integrating gene expression and genomic annotations to identify differentially expressed chromosomal regions in bacteria. RNA-sequencing or microarray-based gene expression data are provided as input, along with gene annotations. The user can select genomic annotations from an internal database including 2780 bacterial strains, or provide custom genomic annotations. The analysis produces as output the lists of positionally related genes showing a coordinated trend of differential expression. Graphical representations, including a circular plot of the analyzed chromosome, allow intuitive browsing of the results. The analysis procedure is based on our previously published R-package PREDA. The release of this tool is timely and relevant for the scientific community, as WoPPER will fill an existing gap in prokaryotic gene expression data analysis and visualization tools.",
                "authors": [
                    {
                        "name": "Puccio S."
                    },
                    {
                        "name": "Grillo G."
                    },
                    {
                        "name": "Licciulli F."
                    },
                    {
                        "name": "Severgnini M."
                    },
                    {
                        "name": "Liuni S."
                    },
                    {
                        "name": "Bicciato S."
                    },
                    {
                        "name": "De Bellis G."
                    },
                    {
                        "name": "Ferrari F."
                    },
                    {
                        "name": "Peano C."
                    }
                ],
                "citationCount": 1,
                "date": "2017-07-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "WoPPER: Web server for Position Related data analysis of gene Expression in Prokaryotes"
            },
            "pmid": "28460063"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}