{
    "accessibility": "Open access",
    "additionDate": "2022-06-28T09:24:43.038808Z",
    "biotoolsCURIE": "biotools:lptd",
    "biotoolsID": "lptd",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "kalnasr@tnstate.edu",
            "name": "Mahmoud Naghibzadeh",
            "typeEntity": "Person"
        },
        {
            "email": "naghibzadeh@um.ac.ir",
            "name": "Kamal Al Nasr",
            "typeEntity": "Person"
        }
    ],
    "description": "The LPTD is an automatic topology determination method for intermediate resolution cryo-EM maps.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                },
                {
                    "term": "Protein secondary structure assignment",
                    "uri": "http://edamontology.org/operation_0319"
                },
                {
                    "term": "Protein secondary structure comparison",
                    "uri": "http://edamontology.org/operation_2488"
                }
            ]
        }
    ],
    "homepage": "https://github.com/B-Behkamal/LPTD",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-06-28T09:24:43.041253Z",
    "license": "Not licensed",
    "name": "LPTD",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAC170",
            "metadata": {
                "abstract": "© 2022 The Author(s). Published by Oxford University Press. All rights reserved.Topology determination is one of the most important intermediate steps toward building the atomic structure of proteins from their medium-resolution cryo-electron microscopy (cryo-EM) map. The main goal in the topology determination is to identify correct matches (i.e. assignment and direction) between secondary structure elements (SSEs) (α-helices and β-sheets) detected in a protein sequence and cryo-EM density map. Despite many recent advances in molecular biology technologies, the problem remains a challenging issue. To overcome the problem, this article proposes a linear programming-based topology determination (LPTD) method to solve the secondary structure topology problem in three-dimensional geometrical space. Through modeling of the protein's sequence with the aid of extracting highly reliable features and a distance-based scoring function, the secondary structure matching problem is transformed into a complete weighted bipartite graph matching problem. Subsequently, an algorithm based on linear programming is developed as a decision-making strategy to extract the true topology (native topology) between all possible topologies. The proposed automatic framework is verified using 12 experimental and 15 simulated α-β proteins. Results demonstrate that LPTD is highly efficient and extremely fast in such a way that for 77% of cases in the dataset, the native topology has been detected in the first rank topology in <2 s. Besides, this method is able to successfully handle large complex proteins with as many as 65 SSEs. Such a large number of SSEs have never been solved with current tools/methods.",
                "authors": [
                    {
                        "name": "Al Nasr K."
                    },
                    {
                        "name": "Behkamal B."
                    },
                    {
                        "name": "Naghibzadeh M."
                    },
                    {
                        "name": "Pagnani A."
                    },
                    {
                        "name": "Saberi M.R."
                    }
                ],
                "date": "2022-05-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "LPTD: A novel linear programming-based topology determination method for cryo-EM maps"
            },
            "pmid": "35311956"
        }
    ],
    "toolType": [
        "Desktop application",
        "Library"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Protein secondary structure",
            "uri": "http://edamontology.org/topic_3542"
        }
    ]
}
