{
    "additionDate": "2020-01-14T09:49:16Z",
    "biotoolsCURIE": "biotools:epiviz-feed",
    "biotoolsID": "epiviz-feed",
    "confidence_flag": "tool",
    "description": "A proactive and automatic visual analytics system integrated with Epiviz that alleviates the burden of manually executing data analysis required to test biologically meaningful hypotheses.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/epiviz/epiviz-feed-computation",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-11T13:16:52Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://epiviz.cbcb.umd.edu"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://epiviz.github.io/"
        }
    ],
    "name": "Epiviz Feed",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ883",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press.Motivation: Integrative analysis of genomic data that includes statistical methods in combination with visual exploration has gained widespread adoption. Many existing methods involve a combination of tools and resources: user interfaces that provide visualization of large genomic datasets, and computational environments that focus on data analyses over various subsets of a given dataset. Over the last few years, we have developed Epiviz as an integrative and interactive genomic data analysis tool that incorporates visualization tightly with state-of-the-art statistical analysis framework. Results: In this article, we present Epiviz Feed, a proactive and automatic visual analytics system integrated with Epiviz that alleviates the burden of manually executing data analysis required to test biologically meaningful hypotheses. Results of interest that are proactively identified by server-side computations are listed as notifications in a feed. The feed turns genomic data analysis into a collaborative work between the analyst and the computational environment, which shortens the analysis time and allows the analyst to explore results efficiently. We discuss three ways where the proposed system advances the field of genomic data analysis: (i) takes the first step of proactive data analysis by utilizing available CPU power from the server to automate the analysis process; (ii) summarizes hypothesis test results in a way that analysts can easily understand and investigate; (iii) enables filtering and grouping of analysis results for quick search. This effort provides initial work on systems that substantially expand how computational and visualization frameworks can be tightly integrated to facilitate interactive genomic data analysis.",
                "authors": [
                    {
                        "name": "Chang K.W."
                    },
                    {
                        "name": "Corrada Bravo H."
                    },
                    {
                        "name": "Cui Z."
                    },
                    {
                        "name": "Elmqvist N."
                    },
                    {
                        "name": "Kancherla J."
                    }
                ],
                "date": "2020-04-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Proactive visual and statistical analysis of genomic data in Epiviz"
            },
            "pmid": "31782758"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
