{
    "additionDate": "2021-12-13T08:10:12.545924Z",
    "biotoolsCURIE": "biotools:tapas-neuro",
    "biotoolsID": "tapas-neuro",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "stephan@biomed.ee.ethz.ch",
            "name": "Klaas E. Stephan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "TAPAS (Translational Algorithms for Psychiatry-Advancing Science) is an open-source software package for Translational Neuromodeling and Computational Psychiatry. \nTAPAS is a collection of algorithms and software tools that are developed by the Translational Neuromodeling Unit (TNU, Zurich) and collaborators. These tools have been developed to support translational neuroscience, particularly concerning the application of neuroimaging and computational modeling to research questions in psychiatry, neurology and psychosomatics. Problems that can be addressed by tools in TAPAS presently include:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://www.translationalneuromodeling.org/tapas",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-12-13T08:10:12.548841Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/translationalneuromodeling/tapas"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/translationalneuromodeling/tapas"
        }
    ],
    "name": "TAPAS",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/fpsyt.2021.680811",
            "metadata": {
                "abstract": "© Copyright © 2021 Frässle, Aponte, Bollmann, Brodersen, Do, Harrison, Harrison, Heinzle, Iglesias, Kasper, Lomakina, Mathys, Müller-Schrader, Pereira, Petzschner, Raman, Schöbi, Toussaint, Weber, Yao and Stephan.Psychiatry faces fundamental challenges with regard to mechanistically guided differential diagnosis, as well as prediction of clinical trajectories and treatment response of individual patients. This has motivated the genesis of two closely intertwined fields: (i) Translational Neuromodeling (TN), which develops “computational assays” for inferring patient-specific disease processes from neuroimaging, electrophysiological, and behavioral data; and (ii) Computational Psychiatry (CP), with the goal of incorporating computational assays into clinical decision making in everyday practice. In order to serve as objective and reliable tools for clinical routine, computational assays require end-to-end pipelines from raw data (input) to clinically useful information (output). While these are yet to be established in clinical practice, individual components of this general end-to-end pipeline are being developed and made openly available for community use. In this paper, we present the Translational Algorithms for Psychiatry-Advancing Science (TAPAS) software package, an open-source collection of building blocks for computational assays in psychiatry. Collectively, the tools in TAPAS presently cover several important aspects of the desired end-to-end pipeline, including: (i) tailored experimental designs and optimization of measurement strategy prior to data acquisition, (ii) quality control during data acquisition, and (iii) artifact correction, statistical inference, and clinical application after data acquisition. Here, we review the different tools within TAPAS and illustrate how these may help provide a deeper understanding of neural and cognitive mechanisms of disease, with the ultimate goal of establishing automatized pipelines for predictions about individual patients. We hope that the openly available tools in TAPAS will contribute to the further development of TN/CP and facilitate the translation of advances in computational neuroscience into clinically relevant computational assays.",
                "authors": [
                    {
                        "name": "Frassle S."
                    },
                    {
                        "name": "Aponte E.A."
                    },
                    {
                        "name": "Bollmann S."
                    },
                    {
                        "name": "Brodersen K.H."
                    },
                    {
                        "name": "Do C.T."
                    },
                    {
                        "name": "Harrison O.K."
                    },
                    {
                        "name": "Harrison S.J."
                    },
                    {
                        "name": "Heinzle J."
                    },
                    {
                        "name": "Iglesias S."
                    },
                    {
                        "name": "Kasper L."
                    },
                    {
                        "name": "Lomakina E.I."
                    },
                    {
                        "name": "Mathys C."
                    },
                    {
                        "name": "Muller-Schrader M."
                    },
                    {
                        "name": "Pereira I."
                    },
                    {
                        "name": "Petzschner F.H."
                    },
                    {
                        "name": "Raman S."
                    },
                    {
                        "name": "Schobi D."
                    },
                    {
                        "name": "Toussaint B."
                    },
                    {
                        "name": "Weber L.A."
                    },
                    {
                        "name": "Yao Y."
                    },
                    {
                        "name": "Stephan K.E."
                    }
                ],
                "citationCount": 2,
                "date": "2021-06-02T00:00:00Z",
                "journal": "Frontiers in Psychiatry",
                "title": "TAPAS: An Open-Source Software Package for Translational Neuromodeling and Computational Psychiatry"
            }
        }
    ],
    "toolType": [
        "Library",
        "Suite"
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}