{
    "additionDate": "2017-08-03T18:58:01Z",
    "biotoolsCURIE": "biotools:rnaentropy",
    "biotoolsID": "rnaentropy",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.bc.edu/clotelab/"
        }
    ],
    "description": "The tool implements two cubic time algorithms to compute the RNA thermodynamic structural entropy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/clotelab/RNAentropy/tree/master/RNAentropy"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid thermodynamic property calculation",
                    "uri": "http://edamontology.org/operation_0455"
                }
            ]
        }
    ],
    "homepage": "https://github.com/clotelab/RNAentropy/",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rnaentropy-compute-rna-secondary-structure-conformational-entropy.html"
        }
    ],
    "name": "RNAentropy",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 Garcia-Martin, Clote. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Conformational entropy for atomic-level, three dimensional biomolecules is known experimentally to play an important role in protein-ligand discrimination, yet reliable computation of entropy remains a difficult problem. Here we describe the first two accurate and efficient algorithms to compute the conformational entropy for RNA secondary structures, with respect to the Turner energy model, where free energy parameters are determined from UV absorption experiments. An algorithm to compute the derivational entropy for RNA secondary structures had previously been introduced, using stochastic context free grammars (SCFGs). However, the numerical value of derivational entropy depends heavily on the chosen context free grammar and on the training set used to estimate rule probabilities. Using data from the Rfam database, we determine that both of our thermodynamic methods, which agree in numerical value, are substantially faster than the SCFG method. Thermodynamic structural entropy is much smaller than derivational entropy, and the correlation between length-normalized thermodynamic entropy and derivational entropy is moderately weak to poor. In applications, we plot the structural entropy as a function of temperature for known thermoswitches, such as the repression of heat shock gene expression (ROSE) element, we determine that the correlation between hammerhead ribozyme cleavage activity and total free energy is improved by including an additional free energy term arising from conformational entropy, and we plot the structural entropy of windows of the HIV-1 genome. Our software RNAentropy can compute structural entropy for any user-specified temperature, and supports both the Turner'99 and Turner'04 energy parameters. It follows that RNAentropy is state-of-The-Art software to compute RNA secondary structure conformational entropy. Source code is available at https://github.com/ clotelab/RNAentropy/; a full web server is available at http://bioinformatics.bc.edu/ clotelab/RNAentropy, including source code and ancillary programs.",
                "authors": [
                    {
                        "name": "Clote P."
                    },
                    {
                        "name": "Garcia-Martin J.A."
                    }
                ],
                "citationCount": 8,
                "date": "2015-11-10T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "RNA thermodynamic structural entropy"
            },
            "pmid": "26555444"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}
