{
    "additionDate": "2019-11-14T18:31:46Z",
    "biotoolsCURIE": "biotools:GOcats",
    "biotoolsID": "GOcats",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hunter.moseley@uky.edu",
            "name": "Hunter N. B. Moseley",
            "orcidid": "https://orcid.org/0000-0003-3995-5368",
            "typeEntity": "Person"
        }
    ],
    "description": "Advances in gene ontology utilization improve statistical power of annotation enrichment | Welcome to GOcats’ documentation! — GOcats 1.1.5 documentation",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Ontology comparison",
                    "uri": "http://edamontology.org/operation_3352"
                },
                {
                    "term": "Ontology visualisation",
                    "uri": "http://edamontology.org/operation_3559"
                }
            ]
        }
    ],
    "homepage": "https://gocats.readthedocs.io",
    "lastUpdate": "2020-12-03T12:16:09Z",
    "name": "GOcats",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0220728",
            "metadata": {
                "abstract": "© 2019 Hinderer et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Gene-annotation enrichment is a common method for utilizing ontology-based annotations in gene and gene-product centric knowledgebases. Effective utilization of these annotations requires inferring semantic linkages by tracing paths through edges in the ontological graph, referred to as relations. However, some relations are semantically problematic with respect to scope, necessitating their omission or modification lest erroneous term mappings occur. To address these issues, we created the Gene Ontology Categorization Suite, or GOcats—a novel tool that organizes the Gene Ontology into subgraphs representing user-defined concepts, while ensuring that all appropriate relations are congruent with respect to scoping semantics. Here, we demonstrate the improvements in annotation enrichment by re-interpreting edges that would otherwise be omitted by traditional ancestor path-tracing methods. Specifically, we show that GOcats’ unique handling of relations improves enrichment over conventional methods in the analysis of two different gene-expression datasets: a breast cancer microarray dataset and several horse cartilage development RNAseq datasets. With the breast cancer microarray dataset, we observed significant improvement (one-sided binomial test p-value = 1.86E-25) in 182 of 217 significantly enriched GO terms identified from the conventional path traversal method when GOcats’ path traversal was used. We also found new significantly enriched terms using GOcats, whose biological relevancy has been experimentally demonstrated elsewhere. Likewise, on the horse RNAseq datasets, we observed a significant improvement in GO term enrichment when using GOcat’s path traversal: one-sided binomial test p-values range from 1.32E-03 to 2.58E-44.",
                "authors": [
                    {
                        "name": "Dubey R."
                    },
                    {
                        "name": "Flight R.M."
                    },
                    {
                        "name": "Hinderer E.W."
                    },
                    {
                        "name": "MacLeod J.N."
                    },
                    {
                        "name": "Moseley H.N.B."
                    }
                ],
                "citationCount": 5,
                "date": "2019-08-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Advances in gene ontology utilization improve statistical power of annotation enrichment"
            },
            "pmcid": "PMC6695228",
            "pmid": "31415589"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ],
    "validated": 1
}
