{
    "additionDate": "2021-01-20T10:59:07Z",
    "biotoolsCURIE": "biotools:resultssift",
    "biotoolsID": "resultssift",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "marina.rprado@academicos.udg.mx",
            "name": "Marina María de Jesús Romero-Prado",
            "typeEntity": "Person"
        }
    ],
    "description": "In silico analysis of missense mutations in exons 1-5 of the F9 gene that cause hemophilia B.\n\nPROVEAN ( Pro tein V ariation E ffect An alyzer) is a software tool which predicts whether an amino acid substitution or indel has an impact on the biological function of a protein.\n\nPROVEAN is useful for filtering sequence variants to identify nonsynonymous or indel variants that are predicted to be functionally important.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "http://sift.jcvi.org/",
    "lastUpdate": "2021-05-19T06:34:02.790926Z",
    "name": "RESULTS:SIFT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2919-X",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Missense mutations in the first five exons of F9, which encodes factor FIX, represent 40% of all mutations that cause hemophilia B. To address the ongoing debate regarding in silico identification of disease-causing mutations at these exons, we analyzed 215 missense mutations from www.factorix.org using six in silico prediction tools, which are the most common used programs for analysis prediction of impact of mutations on the protein structure and function, with further advantage of using similar approaches. We developed different algorithms to integrate multiple predictions from such tools. In order to approach a structural analysis on FIX we performed a modeling of five selected pathogenic mutations. Results: SIFT, PolyPhen-2 HumDiv, SNAP2, and MutationAssessor were the most successful in identifying true non-causative and causative mutations. A proposed function integrating these algorithms (wgP4) was the most sensitive (90.1%), specific (22.6%), and accurate (87%) than similar functions, and identified 187 variants as deleterious. Clinical phenotype was significantly associated with predicted causative mutations at all five exons. However, PolyPhen-2 HumDiv was more successful in linking clinical severity to specific exons, while functions that integrate 4-6 predictions were more successful in linking phenotype to genotypes at the light chain (exons 3-5). The most important value of integrating multiple predictions is the inclusion of scores derived from different approaches. Modeling of protein structure showed the effects of pathogenic nsSNPs on structure and function of FIX. Conclusions: A simple function that integrates information from different in silico programs yields the best prediction of mutated phenotypes. However, the specificity, sensitivity, and accuracy of genotype-phenotype predictions depend on specific characteristics of the protein domain and the disease of interest as we validated by the structural analysis of selected pathogenic F9 mutations. The proposed function integrating algorithm (wgP4) might be useful for the analysis of nsSNPs impact on other genes.",
                "authors": [
                    {
                        "name": "Melendez-Aranda L."
                    },
                    {
                        "name": "Jaloma-Cruz A.R."
                    },
                    {
                        "name": "Pastor N."
                    },
                    {
                        "name": "Romero-Prado M.M.D.J."
                    }
                ],
                "date": "2019-06-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "In silico analysis of missense mutations in exons 1-5 of the F9 gene that cause hemophilia B"
            },
            "pmcid": "PMC6599346",
            "pmid": "31253089"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}