
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinf.spbau.ru/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Assembly",
                "uri": "http://edamontology.org/topic_0196"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/rectangles-2-0-rectangle-graph-repeat-resolution-genome-assembly.html"
        }
    ],
    "publication": [
        {
            "abstract": "Jigsaw puzzles were originally constructed by painting a picture on a rectangular piece of wood and further cutting it into smaller pieces with a jigsaw. The Jigsaw Puzzle Problem is to find an arrangement of these pieces that fills up the rectangle in such a way that neighboring pieces have \"matching\" boundaries with respect to color and texture. While the general Jigsaw Puzzle Problem is NP-complete [6], we discuss its simpler version (called Rectangle Puzzle Problem) and study the rectangle graphs, recently introduced by Bankevich et al., 2012 [3], for assembling such puzzles. We establish the connection between Rectangle Puzzle Problem and the problem of assembling genomes from read-pairs, and further extend the analysis in [3] to real challenges encountered in applications of rectangle graphs in genome assembly. We demonstrate that addressing these challenges results in an assembler SPAdes+ that improves on existing assembly algorithms in the case of bacterial genomes (including particularly difficult case of genome assemblies from single cells). SPAdes+ is freely available from http://bioinf.spbau.ru/ spades. © 2012 Springer-Verlag.",
            "authors": [
                "Vyahhi N.",
                "Pyshkin A.",
                "Pham S.",
                "Pevzner P.A."
            ],
            "cit_count": 7,
            "doi": "10.1007/978-3-642-33122-0_20",
            "journal": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)",
            "title": "From de Bruijn graphs to rectangle graphs for genome assembly",
            "type": "Primary",
            "year": "2012-10-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rectangles",
        "biotoolsID": "rectangles",
        "description": "Ultimate tool for resolving repeats in genome assemblies.",
        "homepage": "http://bioinf.spbau.ru/en/rectangles",
        "name": "rectangles",
        "version": [
            "2.0"
        ]
    }
}