
{
    "credit": [
        {
            "email": "e.r.jefferson@dundee.ac.uk",
            "name": "Emily Jefferson",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://github.com/HicServices/RDMP/wiki"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Loading",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Ruby",
            "C++"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Laboratory information management",
                "uri": "http://edamontology.org/topic_0607"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            },
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press.Background: The Health Informatics Centre at the University of Dundee provides a service to securely host clinical datasets and extract relevant data for anonymized cohorts to researchers to enable them to answer key research questions. As is common in research using routine healthcare data, the service was historically delivered using ad-hoc processes resulting in the slow provision of data whose provenance was often hidden to the researchers using it. This paper describes the development and evaluation of the Research Data Management Platform (RDMP): an open source tool to load, manage, clean, and curate longitudinal healthcare data for research and provide reproducible and updateable datasets for defined cohorts to researchers. Results: Between 2013 and 2017, RDMP tool implementation tripled the productivity of data analysts producing data releases for researchers from 7.1 to 25.3 per month and reduced the error rate from 12.7% to 3.1%. The effort on data management reduced from a mean of 24.6 to 3.0 hours per data release. The waiting time for researchers to receive data after agreeing a specification reduced from approximately 6 months to less than 1 week. The software is scalable and currently manages 163 datasets. A total 1,321 data extracts for research have been produced, with the largest extract linking data from 70 different datasets. Conclusions: The tools and processes that encompass the RDMP not only fulfil the research data management requirements of researchers but also support the seamless collaboration of data cleaning, data transformation, data summarization and data quality assessment activities by different research groups.",
            "authors": [
                "Nind T.",
                "Galloway J.",
                "McAllister G.",
                "Scobbie D.",
                "Bonney W.",
                "Hall C.",
                "Tramma L.",
                "Reel P.",
                "Groves M.",
                "Appleby P.",
                "Doney A.",
                "Guthrie B.",
                "Jefferson E."
            ],
            "cit_count": 0,
            "doi": "10.1093/gigascience/giy060",
            "journal": "GigaScience",
            "title": "The research data management platform (RDMP): A novel, process driven, open-source tool for the management of longitudinal cohorts of clinical data",
            "year": "2018-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rdmp",
        "biotoolsID": "rdmp",
        "description": "A novel, process driven, open-source tool for the management of longitudinal cohorts of clinical data.",
        "homepage": "https://github.com/HicServices/RDMP",
        "name": "RDMP"
    }
}