{
    "additionDate": "2019-11-14T19:30:26Z",
    "biotoolsCURIE": "biotools:scDAPA",
    "biotoolsID": "scDAPA",
    "confidence_flag": "tool",
    "description": "detection and visualization of dynamic alternative polyadenylation from single cell RNA-seq data | Detection and visualization of dynamic alternative polyadenylation | scDAPA - a tool for detection and visualization of dynamic alternative polyadenylation from scRNA-seq data",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "PolyA signal detection",
                    "uri": "http://edamontology.org/operation_0428"
                }
            ]
        }
    ],
    "homepage": "https://scdapa.sourceforge.io",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2020-12-17T09:18:44Z",
    "name": "scDAPA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ701",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Alternative polyadenylation (APA) plays a key post-transcriptional regulatory role in mRNA stability and functions in eukaryotes. Single cell RNA-seq (scRNA-seq) is a powerful tool to discover cellular heterogeneity at gene expression level. Given 3′ enriched strategy in library construction, the most commonly used scRNA-seq protocol-10× Genomics enables us to improve the study resolution of APA to the single cell level. However, currently there is no computational tool available for investigating APA profiles from scRNA-seq data. Results: Here, we present a package scDAPA for detecting and visualizing dynamic APA from scRNA-seq data. Taking bam/sam files and cell cluster labels as inputs, scDAPA detects APA dynamics using a histogram-based method and the Wilcoxon rank-sum test, and visualizes candidate genes with dynamic APA. Benchmarking results demonstrated that scDAPA can effectively identify genes with dynamic APA among different cell groups from scRNA-seq data.",
                "authors": [
                    {
                        "name": "Ji G."
                    },
                    {
                        "name": "Li Q.Q."
                    },
                    {
                        "name": "Saban D.R."
                    },
                    {
                        "name": "Wu X."
                    },
                    {
                        "name": "Ye C."
                    },
                    {
                        "name": "Yu C."
                    },
                    {
                        "name": "Zhou Q."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ScDAPA: Detection and visualization of dynamic alternative polyadenylation from single cell RNA-seq data"
            },
            "pmid": "31557285"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
