{
    "additionDate": "2017-02-10T14:14:05Z",
    "biotoolsCURIE": "biotools:whets",
    "biotoolsID": "whets",
    "description": "Resource that combines Triticeae ESTs/mRNAs with rice genes to find the best estimate of hexaploid wheat transcript sequences for a target gene, supplemented with information on tissue distribution and likely gene structure, to aid in primer design.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://www.rothamsted.ac.uk/whets/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:39Z",
    "name": "WhETS",
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Wheat biologists face particular problems because of the lack of genomic sequence and the three homoeologous genomes which give rise to three very similar forms for many transcripts. However, over 1.3 million available public-domain Triticeae ESTs (of which >850 000 are wheat) and the full rice genomic sequence can be used to estimate likely transcript sequences present in any wheat cDNA sample to which PCR primers may then be designed. Wheat Estimated Transcript Server (WhETS) is designed to do this in a convenient form, and to provide information on the number of matching EST and high quality cDNA (hq-cDNA) sequences, tissue distribution and likely intron position inferred from rice. Triticeae EST and hq-cDNA sequences are mapped onto rice loci and stored in a database. The user selects a rice locus (directly or via Arabidopsis) and the matching Triticeae sequences are assembled according to user-defined filter and stringency settings. Assembly is achieved initially with the CAP3 program and then with a single nucleotide polymorphism (SNP)-analysis algorithm designed to separate homoeologues. Alignment of the resulting contigs and singlets against the rice template sequence is then displayed. Sequences and assembly details are available for download in fasta and ace formats, respectively. WhETS is accessible at http://www4.rothamsted.bbsrc. ac.uk/whets. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Mitchell R.A.C."
                    },
                    {
                        "name": "Castells-Brooke N."
                    },
                    {
                        "name": "Taubert J."
                    },
                    {
                        "name": "Verrier P.J."
                    },
                    {
                        "name": "Leader D.J."
                    },
                    {
                        "name": "Rawlings C.J."
                    }
                ],
                "citationCount": 12,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Wheat Estimated Transcript Server (WhETS): A tool to provide best estimate of hexaploid wheat transcript sequence"
            },
            "pmid": "17439966"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ],
    "validated": 1
}