{
    "additionDate": "2021-01-18T12:06:37Z",
    "biotoolsCURIE": "biotools:casboundary",
    "biotoolsID": "casboundary",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Omer S Alkhnbashi",
            "typeEntity": "Person"
        },
        {
            "name": "Rolf Backofen",
            "typeEntity": "Person"
        }
    ],
    "description": "Casboundary is a method which is able to automatically define CRISPR cassette boundaries. In addition. It contains a Cas type predictive model used to assign each gene located in the region defined by a cassette’s boundaries a Cas label from a set of pre-defined Cas types. Furthermore, the proposed method can detect potentially new cas genes and decompose a cassette into its modules.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/padilha/casboundary"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BackofenLab/Casboundary",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-07T13:59:32Z",
    "license": "GPL-3.0",
    "name": "Casboundary",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA984",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press.MOTIVATION: CRISPR-Cas are important systems found in most archaeal and many bacterial genomes, providing adaptive immunity against mobile genetic elements in prokaryotes. The CRISPR-Cas systems are encoded by a set of consecutive cas genes, here termed cassette. The identification of cassette boundaries is key for finding cassettes in CRISPR research field. This is often carried out by using Hidden Markov Models and manual annotation. In this article, we propose the first method able to automatically define the cassette boundaries. In addition, we present a Cas-type predictive model used by the method to assign each gene located in the region defined by a cassette's boundaries a Cas label from a set of pre-defined Cas types. Furthermore, the proposed method can detect potentially new cas genes and decompose a cassette into its modules. RESULTS: We evaluate the predictive performance of our proposed method on data collected from the two most recent CRISPR classification studies. In our experiments, we obtain an average similarity of 0.86 between the predicted and expected cassettes. Besides, we achieve F-scores above 0.9 for the classification of cas genes of known types and 0.73 for the unknown ones. Finally, we conduct two additional study cases, where we investigate the occurrence of potentially new cas genes and the occurrence of module exchange between different genomes. AVAILABILITY AND IMPLEMENTATION: https://github.com/BackofenLab/Casboundary. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Padilha V.A."
                    },
                    {
                        "name": "Alkhnbashi O.S."
                    },
                    {
                        "name": "Tran V.D."
                    },
                    {
                        "name": "Shah S.A."
                    },
                    {
                        "name": "Carvalho A.C.P.L.F."
                    },
                    {
                        "name": "Backofen R."
                    }
                ],
                "citationCount": 1,
                "date": "2021-06-16T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "Casboundary: automated definition of integral Cas cassettes"
            },
            "pmid": "33226067"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Immunogenetics",
            "uri": "http://edamontology.org/topic_3930"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}