{
    "additionDate": "2022-11-15T08:58:42.055157Z",
    "biotoolsCURIE": "biotools:peakcnv",
    "biotoolsID": "peakcnv",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "h.alinejad@ieee.org",
            "name": "Hamid Alinejad-Rokny",
            "typeEntity": "Person"
        },
        {
            "name": "Amin Beheshti",
            "typeEntity": "Person"
        }
    ],
    "description": "A multi-feature ranking algorithm-based tool for genome-wide copy number variation-association study.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://rdrr.io/github/mahdieh1/PeakCNV",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:20:56.268472Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mahdieh1/PeakCNV/"
        }
    ],
    "name": "PeakCNV",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.csbj.2022.09.001",
            "metadata": {
                "abstract": "Copy Number Variation (CNV) refers to a type of structural genomic alteration in which a segment of chromosome is duplicated or deleted. To date, many CNVs have been identified as causative genetic elements for several diseases and phenotypes. However, performing a CNV-based genome-wide association study is challenging due to inconsistency in length and occurrence of CNVs across different individuals under investigation. One of the most efficient strategies to address this issue is building CNV regions (genomic regions in which CNVs are overlapping - CNVRs). However, this approach is susceptible to a high false positive rate due to overlapping and co-occurring of confounding CNVRs with true positive CNVRs. Here, we develop PeakCNV that differentiates false-positive CNVRs from true positives by calculating a new metric, independence ranking score, (IR-score) via a feature ranking approach. We compared the performance of PeakCNV with other current existing tools by carrying out two case studies one using the CNV genotype data for individuals with prostate cancer (194 cases and 2,392 healthy individuals) and the second one for individuals with neurodevelopmental disorders (19,642 cases and 6,451 healthy individuals). Crucially, our benchmarking analyses on prostate cancer cohort indicated that PeakCNV identifies a fewer risk candidate CNVRs with shorter lengths compared to other tools. Importantly, these CNVRs cover a greater proportion of case over healthy individuals compared to other tools. The accuracy of PeakCNV in identifying relevant candidate CNVRs was reproducible in the case study on neurodevelopmental disorders. Using data from the FANTOM5 expression atlas and the Clinical Genomic Database, we show that the candidate CNVRs identified by PeakCNV for neurodevelopmental disorders overlap with a greater number of genes with the brain-enriched expression, and a greater number of genes that are associated with neurological conditions compared to candidate CNVRs identified by other tools. Taken together, PeakCNV outperformed current existing CNV association study tools by identifying more biologically meaningful CNVRs relevant to the phenotype of interest. PeakCNV is publicly available for the analysis of CNV-associated diseases and is accessible from https://rdrr.io/github/mahdieh1/PeakCNV.",
                "authors": [
                    {
                        "name": "Afrasiabi A."
                    },
                    {
                        "name": "Alinejad-Rokny H."
                    },
                    {
                        "name": "Beheshti A."
                    },
                    {
                        "name": "Labani M."
                    },
                    {
                        "name": "Lovell N.H."
                    }
                ],
                "citationCount": 3,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "PeakCNV: A multi-feature ranking algorithm-based tool for genome-wide copy number variation-association study"
            },
            "pmcid": "PMC9478359",
            "pmid": "36147666"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Copy number variation",
            "uri": "http://edamontology.org/topic_3958"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ],
    "validated": 1
}
