{
    "additionDate": "2021-01-18T10:58:56Z",
    "biotoolsCURIE": "biotools:nanopass",
    "biotoolsID": "nanopass",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "linda.boehmert@bfr.bund.de",
            "name": "Linda Böhmert",
            "orcidid": "https://orcid.org/0000-0002-1153-2841",
            "typeEntity": "Person"
        }
    ],
    "description": "An easy-to-use user interface for nanoparticle dosimetry with the 3DSDD model.\n\nThe Nano Particle Administration Sedimentation Simulator (NanoPASS) is a package which intends to simulate the sedimentation process of nano particles in a cell culture well. By simulating this process the experimentator can estimate the effective dose over time the cells are exposed to. Also, this gives an idea on at which time point the cells are exposed to the calculated concentration of sedimenting particles.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/falfren/NanoPASS",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-08T09:23:03Z",
    "name": "NanoPASS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S12989-020-00368-W",
            "metadata": {
                "abstract": "© 2020 The Author(s).Nanoparticles exhibit a specific diffusion and sedimentation behavior under cell culture conditions as used in nantoxicological in vitro testing. How a particular particle suspension behaves depends on the particular physicochemical characteristics of the particles and the cell culture system. Only a fraction of the nanoparticles applied to a cell culture will thus reach the cells within a given time frame. Therefore, dosimetric calculations are essential not only to determine the exact fraction of nanoparticles that has come into contact with the cells, but also to ensure experimental comparability and correct interpretation of results, respectively. Yet, the use of published dosimetry models is limited. Not the least because the correct application of these in silico tools usually requires bioinformatics knowledge, which often is perceived a hurdle. Moreover, not all models are freely available and accessible. In order to overcome this obstacle, we have now developed an easy-to-use interface for our recently published 3DSDD dosimetry model, called NanoPASS (NanoParticle Administration Sedimentation Simulator). The interface is freely available to all researchers. It will facilitate the use of in silico dosimetry in nanotoxicology and thus improve interpretation and comparability of in vitro results in the field.",
                "authors": [
                    {
                        "name": "Bohmert L."
                    },
                    {
                        "name": "Braeuning A."
                    },
                    {
                        "name": "Frenzel F."
                    },
                    {
                        "name": "Konig-Mattern L."
                    },
                    {
                        "name": "Paul M.B."
                    },
                    {
                        "name": "Sieg H."
                    },
                    {
                        "name": "Stock V."
                    },
                    {
                        "name": "Voigt A."
                    },
                    {
                        "name": "Voss L."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-18T00:00:00Z",
                "journal": "Particle and Fibre Toxicology",
                "title": "NanoPASS: An easy-to-use user interface for nanoparticle dosimetry with the 3DSDD model"
            },
            "pmcid": "PMC7502021",
            "pmid": "32948196"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}
