{
    "additionDate": "2017-01-17T15:08:22Z",
    "biotoolsCURIE": "biotools:genemark",
    "biotoolsID": "genemark",
    "collectionID": [
        "ELIXIR Trainer Tools"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://exon.gatech.edu/GeneMark/contact.html"
        }
    ],
    "description": "A family of gene prediction programs: Gene Prediction in Bacteria, Archaea, Metagenomes and Metatranscriptomes; Gene Prediction in Eukaryotes; Gene Prediction in Transcripts; Gene Prediction in Viruses, Phages and Plasmids.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://exon.gatech.edu/GeneMark/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "name": "GeneMark",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "training_go_import",
    "publication": [
        {
            "doi": "10.1016/0097-8485(93)85004-V",
            "metadata": {
                "abstract": "The problem of predicting gene locations in newly sequenced DNA is well known but still far from being successfully resolved. A novel approach to the problem based on the frame dependent (non-homogeneous) Markov chain models of protein-coding regions was previously suggested. This approach is, apparently, one of the most powerful \"search by content\" methods. The initial idea of the method combines the specific Markov models of coding and non-coding region together with Bayes' decision making function and allows easy generalization for employing of higher order Markov chain models. Another generalization which is described in this article allows the analysis of both DNA strands simultaneously. Currently known gene searching methods perform the analysis of the two DNA strands in turn, one after another. In doing this all the known methods fail in the sense that they generate false (artifactual) prediction signals for the given strand when the real coding region is located on the complementary DNA strand. This common drawback is avoided by employing the Bayesian algorithm which uses an additional non-homogeneous Markov chain model of the \"shadow\" of the coding region-the sequence which is complementary to the protein-coding sequence. © 1993.",
                "authors": [
                    {
                        "name": "Borodovsky M."
                    },
                    {
                        "name": "McIninch J."
                    }
                ],
                "citationCount": 483,
                "date": "1993-01-01T00:00:00Z",
                "journal": "Computers and Chemistry",
                "title": "GENMARK: Parallel gene recognition for both DNA strands"
            }
        },
        {
            "doi": "10.1101/gr.081612.108",
            "metadata": {
                "abstract": "We describe a new ab initio algorithm, GeneMark-ES version 2, that identifies protein-coding genes in fungal genomes. The algorithm does not require a predetermined training set to estimate parameters of the underlying hidden Markov model (HMM). Instead, the anonymous genomic sequence in question is used as an input for iterative unsupervised training. The algorithm extends our previously developed method tested on genomes of Arabidopsis thaliana, Caenorhabditis elegans, and Drosophila melanogaster. To better reflect features of fungal gene organization, we enhanced the intron submodel to accommodate sequences with and without branch point sites. This design enables the algorithm to work equally well for species with the kinds of variations in splicing mechanisms seen in the fungal phyla Ascomycota, Basidiomycota, and Zygomycota. Upon self-training, the intron submodel switches on in several steps to reach its full complexity. We demonstrate that the algorithm accuracy, both at the exon and the whole gene level, is favorably compared to the accuracy of gene finders that employ supervised training. Application of the new method to known fungal genomes indicates substantial improvement over existing annotations. By eliminating the effort necessary to build comprehensive training sets, the new algorithm can streamline and accelerate the process of annotation in a large number of fungal genome sequencing projects. ©2008 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Ter-Hovhannisyan V."
                    },
                    {
                        "name": "Lomsadze A."
                    },
                    {
                        "name": "Chernoff Y.O."
                    },
                    {
                        "name": "Borodovsky M."
                    }
                ],
                "citationCount": 282,
                "date": "2008-12-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Gene prediction in novel fungal genomes using an ab initio algorithm with unsupervised training"
            }
        }
    ],
    "toolType": [
        "Web application",
        "Suite"
    ],
    "topic": [
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        }
    ],
    "validated": 1
}