{
    "additionDate": "2017-08-03T19:00:27Z",
    "biotoolsCURIE": "biotools:sp",
    "biotoolsID": "sp",
    "credit": [
        {
            "email": "ruedi@ini.phys.ethz.ch",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://stoop.ini.uzh.ch/"
        }
    ],
    "description": "The tool provides an implementation and graphical user interface for: Superparamagnetic Clustering and Sequential Superparamagnetic Clustering.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://stoop.ini.uzh.ch/research/clustering"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Superparamagnetic Clustering",
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://stoop.ini.uzh.ch/research/clustering",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/spss-clustering-superparamagnetic-clustering-and-sequential-superparamagnetic-clustering.html"
        }
    ],
    "name": "SP",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: Clustering of chemical and biochemical data based on observed features is a central cognitive step in the analysis of chemical substances, in particular in combinatorial chemistry, or of complex biochemical reaction networks. Often, for reasons unknown to the researcher, this step produces disappointing results. Once the sources of the problem are known, improved clustering methods might revitalize the statistical approach of compound and reaction search and analysis. Here, we present a generic mechanism that may be at the origin of many clustering difficulties. Results: The variety of dynamical behaviors that can be exhibited by complex biochemical reactions on variation of the system parameters are fundamental system fingerprints. In parameter space, shrimp-like or swallow-tail structures separate parameter sets that lead to stable periodic dynamical behavior from those leading to irregular behavior. We work out the genericity of this phenomenon and demonstrate novel examples for their occurrence in realistic models of biophysics. Although we elucidate the phenomenon by considering the emergence of periodicity in dependence on system parameters in a lowdimensional parameter space, the conclusions from our simple setting are shown to continue to be valid for features in a higher-dimensional feature space, as long as the feature-generating mechanism is not too extreme and the dimension of this space is not too high compared with the amount of available data.. © The Author(s) 2014.",
                "authors": [
                    {
                        "name": "Gomez F."
                    },
                    {
                        "name": "Stoop R.L."
                    },
                    {
                        "name": "Stoop R."
                    }
                ],
                "citationCount": 8,
                "date": "2014-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Universal dynamical properties preclude standard clustering in a large class of biochemical data"
            },
            "pmid": "24813543"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        }
    ],
    "validated": 1
}