
{
    "credit": [
        {
            "email": "piotr@cs.put.poznan.pl",
            "name": "Piotr Formanowicz",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://www.cs.put.poznan.pl/mradom/Holmes/HolmesEN.pdf"
        }
    ],
    "download": [
        {
            "note": "Holmes 1.0.0 (stable version 1.0.0, (Bioinformatics, 2017), release: 5-5-2017)",
            "url": "http://www.cs.put.poznan.pl/mradom/Holmes/HolmesRelease_100.zip"
        },
        {
            "note": "Holmes 1.0.5 (stable version 1.0.5, minor fixes, release: 29-11-2017)",
            "url": "http://www.cs.put.poznan.pl/mradom/Holmes/HolmesRelease_105.zip"
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "R",
            "Java"
        ],
        "license": "Artistic-2.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved. Summary: Model development and its analysis is a fundamental step in systems biology. The theory of Petri nets offers a tool for such a task. Since the rapid development of computer science, a variety of tools for Petri nets emerged, offering various analytical algorithms. From this follows a problem of using different programs to analyse a single model. Many file formats and different representations of results make the analysis much harder. Especially for larger nets the ability to visualize the results in a proper form provides a huge help in the understanding of their significance. We present a new tool for Petri nets development and analysis called Holmes. Our program contains algorithms for model analysis based on different types of Petri nets, e.g. invariant generator, Maximum Common Transitions (MCT) sets and cluster modules, simulation algorithms or knockout analysis tools. A very important feature is the ability to visualize the results of almost all analytical modules. The integration of such modules into one graphical environment allows a researcher to fully devote his or her time to the model building and analysis.",
            "authors": [
                "Radom M.",
                "Rybarczyk A.",
                "Szawulak B.",
                "Andrzejewski H.",
                "Chabelski P.",
                "Kozak A.",
                "Formanowicz P."
            ],
            "cit_count": 2,
            "doi": "10.1093/bioinformatics/btx492",
            "journal": "Bioinformatics",
            "title": "Holmes: A graphical tool for development, simulation and analysis of Petri net based models of complex biological systems",
            "type": "Primary",
            "year": "2017-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:Holmes",
        "biotoolsID": "Holmes",
        "description": "Graphical tool for development, simulation and analysis of Petri net based models of complex biological systems.",
        "homepage": "http://www.cs.put.poznan.pl/mradom/Holmes/holmes.html",
        "name": "Holmes"
    }
}