
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://stanford.edu/~nspies/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://svviz.readthedocs.io/en/latest/install.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence visualisation",
                    "uri": "http://edamontology.org/operation_0564"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "DNA",
                "uri": "http://edamontology.org/topic_0654"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/svviz-a-read-viewer-for-validating-structural-variants.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2015. Published by Oxford University Press. All rights reserved. Visualizing read alignments is the most effective way to validate candidate structural variants (SVs) with existing data. We present svviz, a sequencing read visualizer for SVs that sorts and displays only reads relevant to a candidate SV. svviz works by searching input bam(s) for potentially relevant reads, realigning them against the inferred sequence of the putative variant allele as well as the reference allele and identifying reads that match one allele better than the other. Separate views of the two alleles are then displayed in a scrollable web browser view, enabling a more intuitive visualization of each allele, compared with the single reference genome-based view common to most current read browsers. The browser view facilitates examining the evidence for or against a putative variant, estimating zygosity, visualizing affected genomic annotations and manual refinement of breakpoints. svviz supports data from most modern sequencing platforms.",
            "authors": [
                "Spies N.",
                "Zook J.M.",
                "Salit M.",
                "Sidow A."
            ],
            "cit_count": 6,
            "journal": "Bioinformatics",
            "pmid": "26286809",
            "title": "Svviz: A read viewer for validating structural variants",
            "year": "2015-07-03"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:svviz",
        "biotoolsID": "svviz",
        "description": "Visualizes high-throughput sequencing data relevant to a structural variant. Only reads supporting the variant or the reference allele will be shown.",
        "homepage": "http://svviz.github.io/svviz/",
        "name": "svviz"
    }
}