{
    "additionDate": "2021-01-18T09:59:29Z",
    "biotoolsCURIE": "biotools:drugsniper",
    "biotoolsID": "drugsniper",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "arubio@tecnun.es",
            "name": "Angel Rubio",
            "typeEntity": "Person"
        },
        {
            "email": "rpio@unav.es",
            "name": "Ruben Pio",
            "typeEntity": "Person"
        }
    ],
    "description": "DrugSniper is a tool to exploit loss-of-function screens, identifies CREBBP as a predictive biomarker of VOLASERTIB in small cell lung carcinoma.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                }
            ]
        }
    ],
    "homepage": "http://biotecnun.unav.es/app/DrugSniper",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-03T19:55:04Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.com/ccastilla.1/DrugSniper"
        }
    ],
    "name": "DrugSniper",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/CANCERS12071824",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.The development of predictive biomarkers of response to targeted therapies is an unmet clinical need for many antitumoral agents. Recent genome-wide loss-of-function screens, such as RNA interference (RNAi) and CRISPR-Cas9 libraries, are an unprecedented resource to identify novel drug targets, reposition drugs and associate predictive biomarkers in the context of precision oncology. In this work, we have developed and validated a large-scale bioinformatics tool named DrugSniper, which exploits loss-of-function experiments to model the sensitivity of 6237 inhibitors and predict their corresponding biomarkers of sensitivity in 30 tumor types. Applying DrugSniper to small cell lung cancer (SCLC), we identified genes extensively explored in SCLC, such as Aurora kinases or epigenetic agents. Interestingly, the analysis suggested a remarkable vulnerability to polo-like kinase 1 (PLK1) inhibition in CREBBP-mutant SCLC cells. We validated this association in vitro using four mutated and four wild-type SCLC cell lines and two PLK1 inhibitors (Volasertib and BI2536), confirming that the effect of PLK1 inhibitors depended on the mutational status of CREBBP. Besides, DrugSniper was validated in-silico with several known clinically-used treatments, including the sensitivity of Tyrosine Kinase Inhibitors (TKIs) and Vemurafenib to FLT3 and BRAF mutant cells, respectively. These findings show the potential of genome-wide loss-of-function screens to identify new personalized therapeutic hypotheses in SCLC and potentially in other tumors, which is a valuable starting point for further drug development and drug repositioning projects.",
                "authors": [
                    {
                        "name": "Bertolo C."
                    },
                    {
                        "name": "Campuzano L."
                    },
                    {
                        "name": "Carazo F."
                    },
                    {
                        "name": "Castilla C."
                    },
                    {
                        "name": "Cendoya X."
                    },
                    {
                        "name": "Gimeno M."
                    },
                    {
                        "name": "Montuenga L.M."
                    },
                    {
                        "name": "Pio R."
                    },
                    {
                        "name": "Planes F.J."
                    },
                    {
                        "name": "Rubio A."
                    },
                    {
                        "name": "Serrano D."
                    }
                ],
                "citationCount": 2,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Cancers",
                "title": "Drugsniper, a tool to exploit loss-of-function screens, identifies CREBBP as a predictive biomarker of VOLASERTIB in small cell lung carcinoma (SCLC)"
            },
            "pmcid": "PMC7408696",
            "pmid": "32645997"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "RNAi experiment",
            "uri": "http://edamontology.org/topic_3523"
        }
    ]
}
