{
    "additionDate": "2021-10-18T11:02:00.446078Z",
    "biotoolsCURIE": "biotools:asfold-dnn",
    "biotoolsID": "asfold-dnn",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Guangzhong Liu"
        }
    ],
    "description": "Protein Fold Recognition based on Evolutionary Features with Variable Parameters using Full Connected Neural Network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Bioinformatics-Laboratory/project/tree/master/ASFold",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-18T11:02:00.449679Z",
    "name": "ASFold-DNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TCBB.2021.3089168",
            "metadata": {
                "abstract": "IEEEProtein fold recognition contribute to comprehend the function of proteins, which is of great help to the gene therapy of diseases and the development of new drugs. Researchers have been working in this direction and have made considerable achievements, but challenges still exist on low sequence similarity datasets. In this study, we propose the ASFold-DNN framework for protein fold recognition research. Above all, four groups of evolutionary features are extracted from the primary structures of proteins, and a preliminary selection of variable parameter is made for two groups of features including ACC HMM and SXG HMM, respectively. Then several feature selection algorithms are selected for comparison and the best feature selection scheme is obtained by changing their internal threshold values. Finally, multiple hyper-parameters of Full Connected Neural Network are fully optimized to construct the best model. DD, EDD and TG datasets with low sequence similarities are chosen to evaluate the performance of the models constructed by the framework, and the final prediction accuracy are 85.28%, 95.00% and 88.84%, respectively. Furthermore, the ASTRAL186 and LE datasets are introduced to further verify the generalization ability of our proposed framework. Comprehensive experimental results prove that the ASFold-DNN framework is more prominent than the state-of-the-art studies on protein fold recognition. The source code and data of ASFold-DNN can be downloaded from https://github.com/Bioinformatics-Laboratory/project/tree/master/ASFold.",
                "authors": [
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Liu I."
                    },
                    {
                        "name": "Qin X."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "ASFold-DNN: Protein Fold Recognition based on Evolutionary Features with Variable Parameters using Full Connected Neural Network"
            },
            "pmid": "34133282"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
