{
    "additionDate": "2020-01-14T09:46:32Z",
    "biotoolsCURIE": "biotools:nolanlab",
    "biotoolsID": "nolanlab",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "Anna.Nolan@med.nyu.edu",
            "name": "Anna Nolan",
            "orcidid": "https://orcid.org/0000-0002-0631-1171",
            "typeEntity": "Person"
        }
    ],
    "description": "Quantitative lung morphology: semi-automated measurement of mean linear intercept.\n\nOur studies focus on predictors of lung function loss in never smoking firefighters from the World Trade Center exposed Fire Department of New York cohort. This group has pre-9/11/01 clinical/spirometric data and continues to have serial post-9/11 assessments. In preliminary data, we demonstrate that elevated serum levels of one such LDL byproduct soon after intense WTC dust exposure is a risk factor for developing abnormal forced expiratory volume in one second (FEV1) years later. This development of lung injury is what we call World Trade Center Lung Injury (WTC-LI).\n\nOur group has demonstrated that mediators of Metabolic Syndrome, inflammation and vascular injury in serum sampled within 6 months of 9 11 are predictive of eventual abnormal lung function.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'MLI', 'MLI PM-exposed', 'chords', 'MLIactual'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://med.nyu.edu/nolanlab",
    "lastUpdate": "2020-01-14T09:46:32Z",
    "name": "nolanlab",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12890-019-0915-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Quantifying morphologic changes is critical to our understanding of the pathophysiology of the lung. Mean linear intercept (MLI) measures are important in the assessment of clinically relevant pathology, such as emphysema. However, qualitative measures are prone to error and bias, while quantitative methods such as mean linear intercept (MLI) are manually time consuming. Furthermore, a fully automated, reliable method of assessment is nontrivial and resource-intensive. Methods: We propose a semi-automated method to quantify MLI that does not require specialized computer knowledge and uses a free, open-source image-processor (Fiji). We tested the method with a computer-generated, idealized dataset, derived an MLI usage guide, and successfully applied this method to a murine model of particulate matter (PM) exposure. Fields of randomly placed, uniform-radius circles were analyzed. Optimal numbers of chords to assess based on MLI were found via receiver-operator-characteristic (ROC)-area under the curve (AUC) analysis. Intraclass correlation coefficient (ICC) measured reliability. Results: We demonstrate high accuracy (AUCROC > 0.8 for MLIactual > 63.83 pixels) and excellent reliability (ICC = 0.9998, p < 0.0001). We provide a guide to optimize the number of chords to sample based on MLI. Processing time was 0.03 s/image. We showed elevated MLI in PM-exposed mice compared to PBS-exposed controls. We have also provided the macros that were used and have made an ImageJ plugin available free for academic research use at https://med.nyu.edu/nolanlab. Conclusions: Our semi-automated method is reliable, equally fast as fully automated methods, and uses free, open-source software. Additionally, we quantified the optimal number of chords that should be measured per lung field.",
                "authors": [
                    {
                        "name": "Crowley G."
                    },
                    {
                        "name": "Kwon S."
                    },
                    {
                        "name": "Caraher E.J."
                    },
                    {
                        "name": "Haider S.H."
                    },
                    {
                        "name": "Lam R."
                    },
                    {
                        "name": "Batra P."
                    },
                    {
                        "name": "Melles D."
                    },
                    {
                        "name": "Liu M."
                    },
                    {
                        "name": "Nolan A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-09T00:00:00Z",
                "journal": "BMC Pulmonary Medicine",
                "title": "Quantitative lung morphology: Semi-automated measurement of mean linear intercept"
            },
            "pmcid": "PMC6842138",
            "pmid": "31706309"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}