{
    "additionDate": "2021-01-18T10:58:34Z",
    "biotoolsCURIE": "biotools:clustrviz",
    "biotoolsID": "clustrviz",
    "confidence_flag": "tool",
    "description": "Dynamic Visualization and Fast Computation for Convex Clustering via Algorithmic Regularization.\n\nclustRviz aims to enable fast computation and easy visualization of Convex Clustering solution paths.\n\nNote that RcppEigen (which clustRviz internally) triggers many compiler warnings (which cannot be suppressed per CRAN policies). Many of these warnings can be locally suppressed by adding the line CXX11FLAGS+=-Wno-ignored-attributes to your ~/.R/Makevars file. To install an R package from source, you will need suitable development tools installed including a C++ compiler and potentially a Fortran runtime. Details about these toolchains are available on CRAN for Windows and macOS.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DataSlingers/clustRviz",
    "language": [
        "C++",
        "R"
    ],
    "lastUpdate": "2021-02-12T16:24:17Z",
    "license": "GPL-3.0",
    "name": "clustRviz",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1080/10618600.2019.1629943",
            "metadata": {
                "abstract": "© 2019, © 2019 American Statistical Association, Institute of Mathematical Statistics, and Interface Foundation of North America.Convex clustering is a promising new approach to the classical problem of clustering, combining strong performance in empirical studies with rigorous theoretical foundations. Despite these advantages, convex clustering has not been widely adopted, due to its computationally intensive nature and its lack of compelling visualizations. To address these impediments, we introduce Algorithmic Regularization, an innovative technique for obtaining high-quality estimates of regularization paths using an iterative one-step approximation scheme. We justify our approach with a novel theoretical result, guaranteeing global convergence of the approximate path to the exact solution under easily checked non-data-dependent assumptions. The application of algorithmic regularization to convex clustering yields the Convex Clustering via Algorithmic Regularization Paths (CARP) algorithm for computing the clustering solution path. On example datasets from genomics and text analysis, CARP delivers over a 100-fold speed-up over existing methods, while attaining a finer approximation grid than standard methods. Furthermore, CARP enables improved visualization of clustering solutions: the fine solution grid returned by CARP can be used to construct a convex clustering-based dendrogram, as well as forming the basis of a dynamic path-wise visualization based on modern web technologies. Our methods are implemented in the open-source R package clustRviz, available at https://github.com/DataSlingers/clustRviz. Supplementary materials for this article are available online.",
                "authors": [
                    {
                        "name": "Allen G.I."
                    },
                    {
                        "name": "Nagorski J."
                    },
                    {
                        "name": "Weylandt M."
                    }
                ],
                "citationCount": 3,
                "date": "2020-01-02T00:00:00Z",
                "journal": "Journal of Computational and Graphical Statistics",
                "title": "Dynamic Visualization and Fast Computation for Convex Clustering via Algorithmic Regularization"
            },
            "pmcid": "PMC7518335",
            "pmid": "32982130"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}
