
{
    "credit": [
        {
            "name": "BioCarian Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.biocarian.com/contact"
        },
        {
            "email": "nzaki@uaeu.ac.ae",
            "name": "Nazar Zaki",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Data submission, annotation and curation",
                "uri": "http://edamontology.org/topic_0219"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 The Author(s). Background: There are a large number of biological databases publicly available for scientists in the web. Also, there are many private databases generated in the course of research projects. These databases are in a wide variety of formats. Web standards have evolved in the recent times and semantic web technologies are now available to interconnect diverse and heterogeneous sources of data. Therefore, integration and querying of biological databases can be facilitated by techniques used in semantic web. Heterogeneous databases can be converted into Resource Description Format (RDF) and queried using SPARQL language. Searching for exact queries in these databases is trivial. However, exploratory searches need customized solutions, especially when multiple databases are involved. This process is cumbersome and time consuming for those without a sufficient background in computer science. In this context, a search engine facilitating exploratory searches of databases would be of great help to the scientific community. Results: We present BioCarian, an efficient and user-friendly search engine for performing exploratory searches on biological databases. The search engine is an interface for SPARQL queries over RDF databases. We note that many of the databases can be converted to tabular form. We first convert the tabular databases to RDF. The search engine provides a graphical interface based on facets to explore the converted databases. The facet interface is more advanced than conventional facets. It allows complex queries to be constructed, and have additional features like ranking of facet values based on several criteria, visually indicating the relevance of a facet value and presenting the most important facet values when a large number of choices are available. For the advanced users, SPARQL queries can be run directly on the databases. Using this feature, users will be able to incorporate federated searches of SPARQL endpoints. We used the search engine to do an exploratory search on previously published viral integration data and were able to deduce the main conclusions of the original publication. BioCarian is accessible via http://www.biocarian.com. Conclusions: We have developed a search engine to explore RDF databases that can be used by both novice and advanced users.",
            "authors": [
                "Zaki N.",
                "Tennakoon C."
            ],
            "cit_count": 2,
            "doi": "10.1186/s12859-017-1840-4",
            "journal": "BMC Bioinformatics",
            "title": "BioCarian: Search engine for exploratory searches in heterogeneous biological databases",
            "type": "Primary",
            "year": "2017-10-02"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:biocarian",
        "biotoolsID": "biocarian",
        "description": "Search engine for exploratory searches in heterogeneous biological databases.",
        "homepage": "http://www.biocarian.com/",
        "name": "BioCarian"
    }
}