{
    "additionDate": "2020-01-14T09:47:45Z",
    "biotoolsCURIE": "biotools:silicon_microprobes",
    "biotoolsID": "silicon_microprobes",
    "confidence_flag": "tool",
    "description": "Open source silicon microprobes for high throughput neural recording.\n\nResources related to design, use, and sharing of silicon microprobes developed by the Masmanidis lab",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "https://github.com/sotmasman/Silicon-microprobes",
    "lastUpdate": "2020-12-20T14:45:34Z",
    "name": "silicon microprobes",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1088/1741-2552/AB581A",
            "metadata": {
                "abstract": "© 2020 IOP Publishing Ltd.Objective. Microfabricated multielectrode arrays are widely used for high throughput recording of extracellular neural activity, which is transforming our understanding of brain function in health and disease. Currently there is a plethora of electrode-based tools being developed at higher education and research institutions. However, taking such tools from the initial research and development phase to widespread adoption by the neuroscience community is often hindered by several obstacles. The objective of this work is to describe the development, application, and open dissemination of silicon microprobes for recording neural activity in vivo. Approach. We propose an open source dissemination platform as an alternative to commercialization. This framework promotes recording tools that are openly and inexpensively available to the community. The silicon microprobes are designed in house, but the fabrication and assembly processes are carried out by third party companies. This enables mass production, a key requirement for large-scale dissemination. Main results. We demonstrate the operation of silicon microprobes containing up to 256 electrodes in conjunction with optical fibers for optogenetic manipulations or fiber photometry. These data provide new insights about the relationship between calcium activity and neural spiking activity. We also describe the current state of dissemination of these tools. A file repository of resources related to designing, using, and sharing these tools is maintained online. Significance. This paper is likely to be a valuable resource for both current and prospective users, as well as developers of silicon microprobes. Based on their extensive usage by a number of labs including ours, these tools present a promising alternative to other types of electrode-based technologies aimed at high throughput recording in head-fixed animals. This work also demonstrates the importance of validating fiber photometry measurements with simultaneous electrophysiological recordings.",
                "authors": [
                    {
                        "name": "Yang L."
                    },
                    {
                        "name": "Lee K."
                    },
                    {
                        "name": "Villagracia J."
                    },
                    {
                        "name": "Masmanidis S.C."
                    }
                ],
                "citationCount": 7,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Neural Engineering",
                "title": "Open source silicon microprobes for high throughput neural recording"
            },
            "pmid": "31731284"
        }
    ],
    "topic": [
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "RNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3794"
        }
    ],
    "validated": 1
}