
{
    "credit": [
        {
            "email": "antonio.colaprico@ulb.ac.be",
            "name": "Antonio Colaprico",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "tiagochst@usp.br",
            "name": "Tiago Chedraoui Silva",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/TCGAbiolinks.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/TCGAbiolinks_2.2.6.tar.gz"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "GPL-3.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Gene regulation",
                "uri": "http://edamontology.org/topic_0204"
            },
            {
                "term": "Microarray experiment",
                "uri": "http://edamontology.org/topic_3518"
            }
        ]
    },
    "link": [
        {
            "type": "MIRROR",
            "url": "https://github.com/BioinformaticsFMRP/TCGAbiolinks"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2015. Published by Oxford University Press on behalf of Nucleic Acids Research.The Cancer Genome Atlas (TCGA) research network has made public a large collection of clinical and molecular phenotypes of more than 10 000 tumor patients across 33 different tumor types. Using this cohort, TCGA has published over 20 marker papers detailing the genomic and epigenomic alterations associated with these tumor types. Although many important discoveries have been made by TCGA's research network, opportunities still exist to implement novel methods, thereby elucidating new biological pathways and diagnostic markers. However, mining the TCGA data presents several bioinformatics challenges, such as data retrieval and integration with clinical data and other molecular data types (e.g. RNA and DNA methylation). We developed an R/Bioconductor package called TCGAbiolinks to address these challenges and offer bioinformatics solutions by using a guided workflow to allow users to query, download and perform integrative analyses of TCGA data. We combined methods from computer science and statistics into the pipeline and incorporated methodologies developed in previous TCGA marker studies and in our own group. Using four different TCGA tumor types (Kidney, Brain, Breast and Colon) as examples, we provide case studies to illustrate examples of reproducibility, integrative analysis and utilization of different Bioconductor packages to advance and accelerate novel discoveries.",
            "authors": [
                "Colaprico A.",
                "Silva T.C.",
                "Olsen C.",
                "Garofano L.",
                "Cava C.",
                "Garolini D.",
                "Sabedot T.S.",
                "Malta T.M.",
                "Pagnotta S.M.",
                "Castiglioni I.",
                "Ceccarelli M.",
                "Bontempi G.",
                "Noushmehr H."
            ],
            "cit_count": 111,
            "doi": "10.1093/nar/gkv1507",
            "journal": "Nucleic Acids Research",
            "title": "TCGAbiolinks: An R/Bioconductor package for integrative analysis of TCGA data",
            "type": "Primary",
            "year": "2016-05-05"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tcgabiolinks",
        "biotoolsID": "tcgabiolinks",
        "description": "Aims: i) facilitate the TCGA open-access data retrieval, ii) prepare the data using the appropriate pre-processing strategies, iii) provide the means to carry out different standard analyses and iv) allow the user to download a specific version of the data and thus to easily reproduce earlier research results. In more detail, the package provides multiple methods for analysis and methods for visualization to easily develop complete analysis pipelines.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/TCGAbiolinks.html",
        "name": "TCGAbiolinks",
        "version": [
            "2.2.6"
        ]
    }
}