{
    "additionDate": "2021-01-18T09:10:34Z",
    "biotoolsCURIE": "biotools:pine",
    "biotoolsID": "pine",
    "confidence_flag": "tool",
    "description": "An Automation Tool to Extract and Visualize Protein-Centric Functional Networks.\n\nPINE (Protein Interaction Network Extractor) is a tool for visualizing protein-protein interactions. PINE is provided in two forms: a command line version built in Python and a graphical user interface (GUI).\n\nOntology and Pathway Term Status.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/csmc-vaneykjlab/pine",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:47:24.601903Z",
    "license": "Apache-2.0",
    "name": "PINE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1021/jasms.0c00032",
            "metadata": {
                "abstract": "Recent surges in mass spectrometry-based proteomics studies demand a concurrent rise in speedy and optimized data processing tools and pipelines. Although several stand-alone bioinformatics tools exist that provide protein-protein interaction (PPI) data, we developed Protein Interaction Network Extractor (PINE) as a fully automated, user-friendly, graphical user interface application for visualization and exploration of global proteome and post-translational modification (PTM) based networks. PINE also supports overlaying differential expression, statistical significance thresholds, and PTM sites on functionally enriched visualization networks to gain insights into proteome-wide regulatory mechanisms and PTM-mediated networks. To illustrate the relevance of the tool, we explore the total proteome and its PTM-associated relationships in two different nonalcoholic steatohepatitis (NASH) mouse models to demonstrate different context-specific case studies. The strength of this tool relies in its ability to (1) perform accurate protein identifier mapping to resolve ambiguity, (2) retrieve interaction data from multiple publicly available PPI databases, and (3) assimilate these complex networks into functionally enriched pathways, ontology categories, and terms. Ultimately, PINE can be used as an extremely powerful tool for novel hypothesis generation to understand underlying disease mechanisms.",
                "authors": [
                    {
                        "name": "Go J."
                    },
                    {
                        "name": "Lu S.C."
                    },
                    {
                        "name": "Mato J.M."
                    },
                    {
                        "name": "Robinson A.E."
                    },
                    {
                        "name": "Sundararaman N."
                    },
                    {
                        "name": "Van Eyk J.E."
                    },
                    {
                        "name": "Venkatraman V."
                    }
                ],
                "citationCount": 17,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "PINE: An Automation Tool to Extract and Visualize Protein-Centric Functional Networks"
            },
            "pmcid": "PMC10362945",
            "pmid": "32463229"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
