{
    "additionDate": "2024-04-08T10:26:08.414013Z",
    "biotoolsCURIE": "biotools:allccs2",
    "biotoolsID": "allccs2",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jiangzhu@sioc.ac.cn",
            "name": "Zheng-Jiang Zhu",
            "orcidid": "https://orcid.org/0000-0002-3272-3567"
        }
    ],
    "description": "Curation of ion mobility collision cross-section atlas for small molecules using comprehensive molecular representations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "http://allccs.zhulab.cn/",
    "lastUpdate": "2024-04-08T10:26:08.417771Z",
    "name": "AllCCS2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.3C02267",
            "metadata": {
                "abstract": "The development of ion mobility-mass spectrometry (IM-MS) has revolutionized the analysis of small molecules, such as metabolomics, lipidomics, and exposome studies. The curation of comprehensive reference collision cross-section (CCS) databases plays a pivotal role in the successful application of IM-MS for small-molecule analysis. In this study, we presented AllCCS2, an enhanced version of AllCCS, designed for the universal prediction of the ion mobility CCS values of small molecules. AllCCS2 incorporated newly available experimental CCS data, including 10,384 records and 7713 unified values, as training data. By leveraging a neural network trained on diverse molecular representations encompassing mass spectrometry features, molecular descriptors, and graph features extracted using a graph convolutional network, AllCCS2 achieved exceptional prediction accuracy. AllCCS2 achieved median relative error (MedRE) values of 0.31, 0.72, and 1.64% in the training, validation, and testing sets, respectively, surpassing existing CCS prediction tools in terms of accuracy and coverage. Furthermore, AllCCS2 exhibited excellent compatibility with different instrument platforms (DTIMS, TWIMS, and TIMS). The prediction uncertainties in AllCCS2 from the training data and the prediction model were comprehensively investigated by using representative structure similarity and model prediction variation. Notably, small molecules with high structural similarities to the training set and lower model prediction variation exhibited improved accuracy and lower relative errors. In summary, AllCCS2 serves as a valuable resource to support applications of IM-MS technologies. The AllCCS2 database and tools are freely accessible at http://allccs.zhulab.cn/.",
                "authors": [
                    {
                        "name": "Luo M."
                    },
                    {
                        "name": "Ren F."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Yin Y."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhu Z.-J."
                    }
                ],
                "citationCount": 3,
                "date": "2023-09-19T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "AllCCS2: Curation of Ion Mobility Collision Cross-Section Atlas for Small Molecules Using Comprehensive Molecular Representations"
            },
            "pmid": "37664900"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
