{
    "accessibility": "Open access",
    "additionDate": "2022-03-02T16:50:35.946129Z",
    "biotoolsCURIE": "biotools:fxr",
    "biotoolsID": "fxr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "martin.wagner@medunigraz.at",
            "name": "Martin Wagner",
            "orcidid": "https://orcid.org/0000-0002-2769-2364",
            "typeEntity": "Person"
        },
        {
            "email": "Gerhard.Thallinger@tugraz.at",
            "name": "Gerhard G. Thallinger",
            "typeEntity": "Person"
        },
        {
            "name": "Emilian Jungwirth"
        },
        {
            "name": "Hanns-Ulrich Marschall"
        },
        {
            "name": "Katrin Panzitt"
        }
    ],
    "description": "Meta-analysis and Consolidation of Farnesoid X Receptor Chromatin Immunoprecipitation Sequencing Data Across Different Species and Conditions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://fxratlas.tugraz.at",
    "lastUpdate": "2022-03-02T16:50:35.949549Z",
    "license": "Not licensed",
    "name": "FXR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/HEP4.1749",
            "metadata": {
                "abstract": "© 2021 The Authors. Hepatology Communications published by Wiley Periodicals LLC on behalf of the American Association for the Study of Liver Diseases.Farnesoid X receptor (FXR) is a nuclear receptor that controls gene regulation of different metabolic pathways and represents an upcoming drug target for various liver diseases. Several data sets on genome-wide FXR binding in different species and conditions exist. We have previously reported that these data sets are heterogeneous and do not cover the full spectrum of potential FXR binding sites. Here, we report the first meta-analysis of all publicly available FXR chromatin immunoprecipitation sequencing (ChIP-seq) data sets from mouse, rat, and human across different conditions using a newly generated analysis pipeline. All publicly available single data sets were biocurated in a standardized manner and compared on every relevant level from raw reads to affected functional pathways. Individual murine data sets were then virtually merged into a single unique “FXR binding atlas” spanning all potential binding sites across various conditions. Comparison of the single biocurated data sets showed that the overlap of FXR binding sites between different species is modest and ranges from 48% (mouse-human) to 55% (mouse-rat). Moreover, in vivo data among different species are more similar than human in vivo data compared to human in vitro data. The consolidated murine global FXR binding atlas virtually increases sequencing depth and allows recovering more and novel potential binding sites and signaling pathways that were missed in the individual data sets. The FXR binding atlas is publicly searchable (https://fxratlas.tugraz.at). Conclusion: Published single FXR ChIP-seq data sets and large-scale integrated omics data sets do not cover the full spectrum of FXR binding. Combining different individual data sets and creating an “FXR super-binding atlas” enhances understanding of FXR signaling capacities across different conditions. This is important when considering the potential wide spectrum for drugs targeting FXR in liver diseases.",
                "authors": [
                    {
                        "name": "Jungwirth E."
                    },
                    {
                        "name": "Marschall H.-U."
                    },
                    {
                        "name": "Panzitt K."
                    },
                    {
                        "name": "Thallinger G.G."
                    },
                    {
                        "name": "Wagner M."
                    }
                ],
                "date": "2021-10-01T00:00:00Z",
                "journal": "Hepatology Communications",
                "title": "Meta-analysis and Consolidation of Farnesoid X Receptor Chromatin Immunoprecipitation Sequencing Data Across Different Species and Conditions"
            },
            "pmcid": "PMC8485886",
            "pmid": "34558825"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
