{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:53:09Z",
    "biotoolsCURIE": "biotools:raboonet",
    "biotoolsID": "raboonet",
    "collectionID": [
        "MATLAB",
        "File Exchange"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "name": "Dana Ferranti",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/8430309-dana-ferranti"
        }
    ],
    "description": "Random Boolean Network Creation, Simulation, and Prediction Toolbox (RaBooNet) allows for creation, simulation, and prediction of random Boolean networks.",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/60779-random-boolean-network-creation-simulation-and-prediction-toolbox-raboonet",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-14T10:36:03.810693Z",
    "name": "RaBooNet",
    "operatingSystem": [
        "Windows",
        "Linux",
        "Mac"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx438",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation Our overall goal is to develop machine-learning approaches based on genomics and other relevant accessible information for use in predicting how a patient will respond to a given proposed drug or treatment. Given the complexity of this problem, we begin by developing, testing and analyzing learning methods using data from simulated systems, which allows us access to a known ground truth. We examine the benefits of using prior system knowledge and investigate how learning accuracy depends on various system parameters as well as the amount of training data available. Results The simulations are based on Boolean networks - directed graphs with 0/1 node states and logical node update rules - which are the simplest computational systems that can mimic the dynamic behavior of cellular systems. Boolean networks can be generated and simulated at scale, have complex yet cyclical dynamics and as such provide a useful framework for developing machine-learning algorithms for modular and hierarchical networks such as biological systems in general and cancer in particular. We demonstrate that utilizing prior knowledge (in the form of network connectivity information), without detailed state equations, greatly increases the power of machine-learning algorithms to predict network steady-state node values (â 'phenotypes') and perturbation responses (â 'drug effects'). Availability and implementation Links to codes and datasets here: https://gray.mgh.harvard.edu/people-directory/71-david-craft-phd. Contact dcraft@broadinstitute.org Supplementary informationSupplementary dataare available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Ferranti D."
                    },
                    {
                        "name": "Krane D."
                    },
                    {
                        "name": "Craft D."
                    }
                ],
                "citationCount": 11,
                "date": "2017-11-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "The value of prior knowledge in machine learning of complex network systems"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        }
    ],
    "version": [
        "1.0"
    ]
}