{
    "additionDate": "2020-01-14T09:27:44Z",
    "biotoolsCURIE": "biotools:CCi-MOBILE",
    "biotoolsID": "CCi-MOBILE",
    "confidence_flag": "medium",
    "description": "Design and Evaluation of a Cochlear Implant and Hearing Aid Research Platform for Speech Scientists and Engineers.\n\nHearing loss is an increasingly prevalent condition resulting from damage to the inner ear which causes a reduction in speech intelligibility. The societal need for assistive hearing devices has increased exponentially over the past two decades; however, actual human performance with such devices has only seen modest gains relative to advancements in digital signal processing (DSP) technology. A major challenge with clinical hearing technologies is the limited ability to run complex signal processing algorithms requiring high computation power.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'UT-Dallas', 'speech', 'hearing', 'software-mediated'",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31763625",
    "lastUpdate": "2020-01-14T09:27:44Z",
    "name": "CCi-MOBILE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/BHI.2019.8834652",
            "metadata": {
                "abstract": "© 2019 IEEE.Hearing loss is an increasingly prevalent condition resulting from damage to the inner ear which causes a reduction in speech intelligibility. The societal need for assistive hearing devices has increased exponentially over the past two decades; however, actual human performance with such devices has only seen modest gains relative to advancements in digital signal processing (DSP) technology. A major challenge with clinical hearing technologies is the limited ability to run complex signal processing algorithms requiring high computation power. The CCi-MOBILE platform, developed at UT-Dallas, provides the research community with an open-source, flexible, easy-to-use, software-mediated, powerful computing research interface to conduct a wide variety of listening experiments. The platform supports cochlear implants (CIs) and hearing aids (HAs) independently, as well as bimodal hearing (i.e., a CI in one ear and HA in the contralateral ear). The platform is ideally suited to address hearing research for: both quiet and naturalistic noisy conditions, sound localization, and lateralization. The platform uses commercially available smartphone/tablet devices as portable sound processors and can provide bilateral electric and acoustic stimulation. The hardware components, firmware, and software suite are presented to demonstrate safety to the speech scientist and CI/HA user, highlight user-specificity, and outline various applications of the platform for research.",
                "authors": [
                    {
                        "name": "Hansen J.H.L."
                    },
                    {
                        "name": "Ali H."
                    },
                    {
                        "name": "Saba J.N."
                    },
                    {
                        "name": "Charan M.C.R."
                    },
                    {
                        "name": "Mamun N."
                    },
                    {
                        "name": "Ghosh R."
                    },
                    {
                        "name": "Brueggeman A."
                    }
                ],
                "date": "2019-05-01T00:00:00Z",
                "journal": "2019 IEEE EMBS International Conference on Biomedical and Health Informatics, BHI 2019 - Proceedings",
                "title": "CCi-MOBILE: Design and Evaluation of a Cochlear Implant and Hearing Aid Research Platform for Speech Scientists and Engineers"
            },
            "pmcid": "PMC6874365",
            "pmid": "31763625"
        }
    ]
}