
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.statgen.nus.edu.sg/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://phg.nus.edu.sg/#about"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            },
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/haplosuite-1-1-package-haplotype-clustering-visualization.html"
        }
    ],
    "publication": [
        {
            "abstract": "In population genetics, it is common to represent the haplotype diversity at a genomic region between multiple populations using well-constructed visual representations. This typically requires the chromosomes from these populations to be grouped according to some definition of haplotypic similarity. Here, we introduce a novel algorithm for clustering haplotypes with the specific aim of addressing haplotype diversity within or between populations. The algorithm allows for missing data in the haplotypes and appropriately downweighs single nucleotide polymorphisms with higher extent of missingness. By identifying the canonical haplotypes in a genomic region, defined as the haplotype forms, which most chromosomes are similar to, the algorithm maps each chromosome to either a unique canonical haplotype or as a mosaic of the identified canonical haplotypes. This mapping can subsequently be utilized for producing graphical visualizations of the haplotype clustering for understanding the extent of haplotype diversity in the region. The clustering application has been implemented in R for distribution as haplosim, and we also provide a visualization script hapvisual for graphical display of the clustering results. The outcome of such analysis can be informative in understanding the extent of haplotype diversity between populations, in addressing the reproducibility of established association signals across multiple populations, and also in the investigation of positive selection in the human genome. © 2009 Wiley-Liss, Inc.",
            "authors": [
                "Teo Y.Y.",
                "Small K.S."
            ],
            "cit_count": 6,
            "journal": "Genetic Epidemiology",
            "pmid": "19479748",
            "title": "A novel method for haplotype clustering and visualization",
            "year": "2010-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:haplosuite",
        "biotoolsID": "haplosuite",
        "description": "Collection of R codes, including HAPLOSIM and HAPVISUAL, for the purpose of clustering haplotypes and haplotype visualization",
        "homepage": "http://www.statgen.nus.edu.sg",
        "name": "Haplosuite"
    }
}