{"credit":[{"name":"Utrecht University","typeEntity":"Institute","typeRoles":["Provider"]},{"name":"EGI","typeEntity":"Consortium","typeRoles":[],"url":"https://www.egi.eu"},{"name":"European FP7 e-Infrastructure grant, WeNMR, grant no. 261572","typeEntity":"Funding agency","typeRoles":["Contributor"]},{"name":"Netherlands Organization for Scientific Research (NWO) , TOP-PUNT grant no. 718.015.001","typeEntity":"Funding agency","typeRoles":["Contributor"]},{"name":"Netherlands Organization for Scientific Research (NWO), VICI grant no. 700.96.442","typeEntity":"Funding agency","typeRoles":["Contributor"]},{"name":"European H2020 e-Infrastructure grant, West-Life VRE, grant no. 675858","typeEntity":"Funding agency","typeRoles":["Contributor"]},{"name":"European H2020 e-Infrastructure grant, INDICO-DataCloud, grant no. 653549","typeEntity":"Funding agency","typeRoles":["Contributor"]},{"name":"European H2020 e-Infrastructure grant, EGI-Engage, grant no. 654142","typeEntity":"Funding agency","typeRoles":["Contributor"]},{"name":"European H2020 e-Infrastructure grant, BioExcel, grant no. 675728","typeEntity":"Funding agency","typeRoles":["Contributor"]},{"name":"Netherlands Organization for Scientific Research (NWO), ECHO grant no.711.011.009","typeEntity":"Funding agency","typeRoles":["Contributor"]},{"email":"a.m.j.j.bonvin@uu.nl","name":"Bonvin Lab","typeEntity":"Institute","typeRoles":["Provider","Developer","Maintainer"],"url":"http://www.bonvinlab.org"},{"email":"disvis.server@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://ask.bioexcel.eu/c/disvis"},{"name":"European H2020 e-Infrastructure grant, BioExcel, grant no. 823830","typeRoles":[]},{"name":"European H2020 e-Infrastructure grant, EOSC-Hub, grant no.777536","typeRoles":[]}],"documentation":[{"type":"CITATION_INSTRUCTIONS","url":"http://milou.science.uu.nl/cgi/services/DISVIS/disvis/"},{"url":"http://milou.science.uu.nl/cgi/services/DISVIS/disvis/help"},{"type":"TERMS_OF_USE","url":"https://bianca.science.uu.nl/conditions"},{"type":"TRAINING_MATERIAL","url":"http://www.bonvinlab.org/education/Others/disvis-webserver/"},{"type":"OTHER","url":"https://bianca.science.uu.nl/auth/register/disvis"}],"download":[{"type":"Source code","url":"https://github.com/haddocking/disvis"}],"function":[{"note":"Visualisation of interaction space between two molecules and identification of false positive restraints from MS cross-linking experiment","operation":[{"term":"Structure visualisation","uri":"http://edamontology.org/operation_0570"},{"term":"Filtering","uri":"http://edamontology.org/operation_3695"},{"term":"Structure analysis","uri":"http://edamontology.org/operation_2480"}]}],"labels":{"collectionID":["BioExcel","West-Life","WeNMR","EOSC-Hub","INSTRUCT"],"elixirNode":["Netherlands"],"maturity":"Mature","operatingSystem":["Linux","Mac"],"toolType":["Web application"],"topic":[{"term":"Structural biology","uri":"http://edamontology.org/topic_1317"}]},"publication":[{"abstract":"© The Author 2015. Summary: We present DisVis, a Python package and command line tool to calculate the reduced accessible interaction space of distance-restrained binary protein complexes, allowing for direct visualization and quantification of the information content of the distance restraints. The approach is general and can also be used as a knowledge-based distance energy term in FFT-based docking directly during the sampling stage.","authors":["Van Zundert G.C.P.","Bonvin A.M.J.J."],"cit_count":11,"doi":"10.1093/bioinformatics/btv333","journal":"Bioinformatics","title":"DisVis: Quantifying and visualizing accessible interaction space of distance-restrained biomolecular complexes","type":"Method","year":"2015-10-01"},{"abstract":"© 2016 The Author(s) Structure determination of complex molecular machines requires a combination of an increasing number of experimental methods with highly specialized software geared toward each data source to properly handle the gathered data. Recently, we introduced the two software packages PowerFit and DisVis. These combine high-resolution structures of atomic subunits with density maps from cryo-electron microscopy or distance restraints, typically acquired by chemical cross-linking coupled with mass spectrometry, respectively. Here, we report on recent advances in both GPGPU-accelerated software packages: PowerFit is a tool for rigid body fitting of atomic structures in cryo-electron density maps and has been updated to also output reliability indicators for the success of fitting, through the use of the Fisher z-transformation and associated confidence intervals; DisVis aims at quantifying the information content of distance restraints and identifying false-positive restraints. We extended its analysis capabilities to include an analysis of putative interface residues and to output an average shape representing the putative location of the ligand. To facilitate their use by a broad community, they have been implemented as web portals harvesting both local CPU resources and GPGPU-accelerated EGI grid resources. They offer user-friendly interfaces, while minimizing computational requirements, and provide a first interactive view of the results. The portals can be accessed freely after registration via http://milou.science.uu.nl/services/DISVIS and http://milou.science.uu.nl/services/POWERFIT.","authors":["van Zundert G.C.P.","Trellet M.","Schaarschmidt J.","Kurkcuoglu Z.","David M.","Verlato M.","Rosato A.","Bonvin A.M.J.J."],"cit_count":13,"doi":"10.1016/j.jmb.2016.11.032","journal":"Journal of Molecular Biology","title":"The DisVis and PowerFit Web Servers: Explorative and Integrative Modeling of Biomolecular Complexes","type":"Primary","year":"2017-02-03"}],"summary":{"biotoolsCURIE":"biotools:disvis","biotoolsID":"disvis","description":"Visualize and quantify the information content of distance restraints between macromolecular complexes. A full and systematic 6 dimensional search of the three translational and rotational degrees of freedom to determine the number of complexes consistent with the restraints. It outputs the percentage of restraints being violated and a density that represents the center-of-mass position of the scanning chain corresponding to the highest number of consistent restraints at every position in space.","homepage":"http://milou.science.uu.nl/services/DISVIS","name":"DisVis","version":["1.0"]}}