{
    "additionDate": "2021-10-10T15:58:44.550290Z",
    "biotoolsCURIE": "biotools:mmeta-marker",
    "biotoolsID": "mmeta-marker",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hyunwook.koh@stonybrook.edu",
            "name": "Hyunwook Koh",
            "orcidid": "https://orcid.org/0000-0001-6893-7164",
            "typeEntity": "Person",
            "typeRole": [
                "Maintainer",
                "Primary contact"
            ]
        },
        {
            "email": "nzhao10@jhu.edu",
            "name": "Ni Zhao",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Adaptive multi-marker meta-analysis (aMeta) is an R package provides facilities for multi-marker meta analysis (mMeta) and adaptive multi-marker meta-analysis (aMeta) which conduct meta-analyses to combine multiple studies throughout multiple related markers. The R package includes two core functions, mMeta.aMeta and mMeta.aMeta.plot, and one summary data set, HIV.Sum.Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hk1785/mMeta",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T20:18:06.256698Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/hk1785/mMeta/issues"
        }
    ],
    "name": "mMeta",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/sim.8940",
            "metadata": {
                "abstract": "Meta-analysis is a practical and powerful analytic tool that enables a unified statistical inference across the results from multiple studies. Notably, researchers often report the results on multiple related markers in each study (eg, various α-diversity indices in microbiome studies). However, univariate meta-analyses are limited to combining the results on a single common marker at a time, whereas existing multivariate meta-analyses are limited to the situations where marker-by-marker correlations are given in each study. Thus, here we introduce two meta-analysis methods, multi-marker meta-analysis (mMeta) and adaptive multi-marker meta-analysis (aMeta), to combine multiple studies throughout multiple related markers with no priori results on marker-by-marker correlations. mMeta is a statistical estimator for a pooled estimate and its SE across all the studies and markers, whereas aMeta is a statistical test based on the test statistic of the minimum P-value among marker-specific meta-analyses. mMeta conducts both effect estimation and hypothesis testing based on a weighted average of marker-specific pooled estimates while estimating marker-by-marker correlations non-parametrically via permutations, yet its power is only moderate. In contrast, aMeta closely approaches the highest power among marker-specific meta-analyses, yet it is limited to hypothesis testing. While their applications can be broader, we illustrate the use of mMeta and aMeta to combine microbiome studies throughout multiple α-diversity indices. We evaluate mMeta and aMeta in silico and apply them to real microbiome studies on the disparity in α-diversity by the status of human immunodeficiency virus (HIV) infection. The R package for mMeta and aMeta is freely available at https://github.com/hk1785/mMeta.",
                "authors": [
                    {
                        "name": "Koh H."
                    },
                    {
                        "name": "Sears C.L."
                    },
                    {
                        "name": "Tuddenham S."
                    },
                    {
                        "name": "Zhao N."
                    }
                ],
                "citationCount": 5,
                "date": "2021-05-30T00:00:00Z",
                "journal": "Statistics in Medicine",
                "title": "Meta-analysis methods for multiple related markers: Applications to microbiome studies with the results on multiple α-diversity indices"
            },
            "pmcid": "PMC8325033",
            "pmid": "33768631",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
