{
    "accessibility": "Open access",
    "additionDate": "2019-05-19T07:18:32Z",
    "biotoolsCURIE": "biotools:ElemCor",
    "biotoolsID": "ElemCor",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "dudthu06@gmail.com",
            "name": "Di Du",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "xs137@rwjms.rutgers.edu",
            "name": "Xiaoyang Su",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software tool to correct LC-MS data in isotope labeling experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Isotopic distributions calculation",
                    "uri": "http://edamontology.org/operation_3632"
                },
                {
                    "term": "SILAC",
                    "uri": "http://edamontology.org/operation_3638"
                }
            ]
        }
    ],
    "homepage": "https://github.com/4dsoftware/elemcor",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "MIT",
    "maturity": "Mature",
    "name": "ElemCor",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2669-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The investigation of intracellular metabolism is the mainstay in the biotechnology and physiology settings. Intracellular metabolic rates are commonly evaluated using labeling pattern of the identified metabolites obtained from stable isotope labeling experiments. The labeling pattern or mass distribution vector describes the fractional abundances of all isotopologs with different masses as a result of isotopic labeling, which are typically resolved using mass spectrometry. Because naturally occurring isotopes and isotopic impurity also contribute to measured signals, the measured patterns must be corrected to obtain the labeling patterns. Since contaminant isotopologs with the same nominal mass can be resolved using modern mass spectrometers with high mass resolution, the correction process should be resolution dependent. Results: Here we present a software tool, ElemCor, to perform correction of such data in a resolution-dependent manner. The tool is based on mass difference theory (MDT) and information from unlabeled samples (ULS) to account for resolution effects. MDT is a mathematical theory and only requires chemical formulae to perform correction. ULS is semi-empirical and requires additional measurement of isotopologs from unlabeled samples. We validate both methods and show their improvement in accuracy and comprehensiveness over existing methods using simulated data and experimental data from Saccharomyces cerevisiae. The tool is available at https://github.com/4dsoftware/elemcor. Conclusions: We present a software tool based on two methods, MDT and ULS, to correct LC-MS data from isotopic labeling experiments for natural abundance and isotopic impurity. We recommend MDT for low-mass compounds for cost efficiency in experiments, and ULS for high-mass compounds with relatively large spectral inaccuracy that can be tracked by unlabeled standards.",
                "authors": [
                    {
                        "name": "Du D."
                    },
                    {
                        "name": "Lorenzi P.L."
                    },
                    {
                        "name": "Peng B."
                    },
                    {
                        "name": "Su X."
                    },
                    {
                        "name": "Tan L."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Weinstein J.N."
                    },
                    {
                        "name": "Wondisford F.E."
                    }
                ],
                "citationCount": 6,
                "date": "2019-02-19T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ElemCor: Accurate data analysis and enrichment calculation for high-resolution LC-MS stable isotope labeling experiments"
            },
            "pmcid": "PMC6381631",
            "pmid": "30782135",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
