
{
    "credit": [
        {
            "email": "charles.joly-beauparlant@crchul.ulaval.ca",
            "name": "Charles Joly Beauparlant",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/metagene.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/metagene_2.6.1.tar.gz"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "BAM",
                            "uri": "http://edamontology.org/format_2572"
                        },
                        {
                            "term": "BED",
                            "uri": "http://edamontology.org/format_3003"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Plot",
                        "uri": "http://edamontology.org/data_2884"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "BioConductor"
        ],
        "language": [
            "R"
        ],
        "license": "Artistic-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool",
            "Library"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 Joly Beauparlant et al.ChIP-Sequencing (ChIP-Seq) provides a vast amount of information regarding the localization of proteins across the genome. The aggregation of ChIP-Seq enrichment signal in a metagene plot is an approach commonly used to summarize data complexity and to obtain a high level visual representation of the general occupancy pattern of a protein. Here we present the R package metagene, the graphical interface Imetagene and the companion package similaRpeak. Together, they provide a framework to integrate, summarize and compare the ChIP-Seq enrichment signal from complex experimental designs. Those packages identify and quantify similarities or dissimilarities in patterns between large numbers of ChIP-Seq profiles. We used metagene to investigate the differential occupancy of regulatory factors at noncoding regulatory regions (promoters and enhancers) in relation to transcriptional activity in GM12878 B-lymphocytes. The relationships between occupancy patterns and transcriptional activity suggest two different mechanisms of action for transcriptional control: i) a “gradient effect” where the regulatory factor occupancy levels follow transcription and ii) a “threshold effect” where the regulatory factor occupancy levels max out prior to reaching maximal transcription. metagene, Imetagene and similaRpeak are implemented in R under the Artistic license 2.0 and are available on Bioconductor.",
            "authors": [
                "Joly Beauparlant C.",
                "Lamaze F.C.",
                "Deschenes A.",
                "Samb R.",
                "Lemacon A.",
                "Belleau P.",
                "Bilodeau S.",
                "Droit A."
            ],
            "cit_count": 4,
            "doi": "10.1371/journal.pcbi.1004751",
            "journal": "PLoS Computational Biology",
            "title": "metagene Profiles Analyses Reveal Regulatory Element’s Factor-Specific Recruitment Patterns",
            "type": "Primary",
            "year": "2016-08-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:metagene",
        "biotoolsID": "metagene",
        "description": "This package produces metagenic plots to compare the behavior of DNA-interacting proteins at selected groups of genes/features. Bam files are used to increase the resolution. Multiple combination of group of bam files and/or group of genomic regions can be compared in a single analysis. Bootstraping analysis is used to compare the groups and locate regions with statistically different enrichment profiles.",
        "homepage": "http://bioconductor.org/packages/release/bioc/html/metagene.html",
        "name": "metagene",
        "version": [
            "2.6.1"
        ]
    }
}