{
    "additionDate": "2021-01-18T10:53:13Z",
    "biotoolsCURIE": "biotools:kmergo",
    "biotoolsID": "kmergo",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fsun@usc.edu",
            "name": "Fengzhu Sun",
            "typeEntity": "Person"
        },
        {
            "email": "wangying@xmu.edu.cn",
            "name": "Ying Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A Tool to Identify Group-Specific Sequences With k-mers.\n\nKmerGO is a user-friendly tool to identify the group-specific sequences on two groups of high throughput sequencing datasets. A sequence that is present, or rich, in one group, but absent, or scarce, in another group is considered “group-specific” here. Furthermore, KmerGO can also be applied to capture trait-associated sequences for continuous-trait dataset.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome comparison",
                    "uri": "http://edamontology.org/operation_3209"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChnMasterOG/KmerGO",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-12T10:43:01Z",
    "name": "KmerGO",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FMICB.2020.02067",
            "metadata": {
                "abstract": "© Copyright © 2020 Wang, Chen, Deng, Zheng and Sun.Capturing group-specific sequences between two groups of genomic/metagenomic sequences is critical for the follow-up identifications of singular nucleotide variants (SNVs), gene families, microbial species or other elements associated with each group. A sequence that is present, or rich, in one group, but absent, or scarce, in another group is considered a “group-specific” sequence in our study. We developed a user-friendly tool, KmerGO, to identify group-specific sequences between two groups of genomic/metagenomic long sequences or high-throughput sequencing datasets. Compared with other tools, KmerGO captures group-specific k-mers (k up to 40 bps) with much lower requirements for computing resources in much shorter running time. For a 1.05 TB dataset (.fasta), it takes KmerGO about 21.5 h (including k-mer counting) to return assembled group-specific sequences on a regular stand-alone workstation with no more than 1 GB memory. Furthermore, KmerGO can also be applied to capture trait-associated sequences for continuous-trait. Through multi-process parallel computing, KmerGO is implemented with both graphic user interface and command line on Linux and Windows free from any pre-installed supporting environments, packages, and complex configurations. The output group-specific k-mers or sequences from KmerGO could be the inputs of other tools for the downstream discovery of biomarkers, such as genetic variants, species, or genes. KmerGO is available at https://github.com/ChnMasterOG/KmerGO.",
                "authors": [
                    {
                        "name": "Chen Q."
                    },
                    {
                        "name": "Deng C."
                    },
                    {
                        "name": "Sun F."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Zheng Y."
                    }
                ],
                "citationCount": 2,
                "date": "2020-08-25T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "KmerGO: A Tool to Identify Group-Specific Sequences With k-mers"
            },
            "pmcid": "PMC7477287",
            "pmid": "32983048"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
