{
    "additionDate": "2021-03-19T09:00:19Z",
    "biotoolsCURIE": "biotools:hmd-arg",
    "biotoolsID": "hmd-arg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xin.gao@kaust.edu.sa",
            "name": "Xin Gao",
            "orcidid": "https://orcid.org/0000-0002-7108-3574",
            "typeEntity": "Person"
        }
    ],
    "description": "Hierarchical multi-task deep learning for annotating antibiotic resistance genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://www.cbrc.kaust.edu.sa/HMDARG/",
    "lastUpdate": "2021-03-31T17:37:28Z",
    "name": "HMD-ARG",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S40168-021-01002-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The spread of antibiotic resistance has become one of the most urgent threats to global health, which is estimated to cause 700,000 deaths each year globally. Its surrogates, antibiotic resistance genes (ARGs), are highly transmittable between food, water, animal, and human to mitigate the efficacy of antibiotics. Accurately identifying ARGs is thus an indispensable step to understanding the ecology, and transmission of ARGs between environmental and human-associated reservoirs. Unfortunately, the previous computational methods for identifying ARGs are mostly based on sequence alignment, which cannot identify novel ARGs, and their applications are limited by currently incomplete knowledge about ARGs. Results: Here, we propose an end-to-end Hierarchical Multi-task Deep learning framework for ARG annotation (HMD-ARG). Taking raw sequence encoding as input, HMD-ARG can identify, without querying against existing sequence databases, multiple ARG properties simultaneously, including if the input protein sequence is an ARG, and if so, what antibiotic family it is resistant to, what resistant mechanism the ARG takes, and if the ARG is an intrinsic one or acquired one. In addition, if the predicted antibiotic family is beta-lactamase, HMD-ARG further predicts the subclass of beta-lactamase that the ARG is resistant to. Comprehensive experiments, including cross-fold validation, third-party dataset validation in human gut microbiota, wet-experimental functional validation, and structural investigation of predicted conserved sites, demonstrate not only the superior performance of our method over the state-of-art methods, but also the effectiveness and robustness of the proposed method. Conclusions: We propose a hierarchical multi-task method, HMD-ARG, which is based on deep learning and can provide detailed annotations of ARGs from three important aspects: resistant antibiotic class, resistant mechanism, and gene mobility. We believe that HMD-ARG can serve as a powerful tool to identify antibiotic resistance genes and, therefore mitigate their global threat. Our method and the constructed database are available at http://www.cbrc.kaust.edu.sa/HMDARG/. [MediaObject not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Xu Z."
                    },
                    {
                        "name": "Han W."
                    },
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Umarov R."
                    },
                    {
                        "name": "Yan A."
                    },
                    {
                        "name": "Fan M."
                    },
                    {
                        "name": "Chen H."
                    },
                    {
                        "name": "Duarte C.M."
                    },
                    {
                        "name": "Li L."
                    },
                    {
                        "name": "Ho P.-L."
                    },
                    {
                        "name": "Gao X."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Microbiome",
                "title": "HMD-ARG: hierarchical multi-task deep learning for annotating antibiotic resistance genes"
            },
            "pmcid": "PMC7871585",
            "pmid": "33557954"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        }
    ]
}