{
    "additionDate": "2020-01-14T19:58:39Z",
    "biotoolsCURIE": "biotools:RCorp",
    "biotoolsID": "RCorp",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "hou.li@imicams.ac.cn",
            "name": "Li Hou",
            "typeEntity": "Person"
        }
    ],
    "description": "a resource for chemical disease semantic extraction in Chinese.\n\nBACKGROUND:To robustly identify synergistic combinations of drugs, high-throughput screenings are desirable. It will be of great help to automatically identify the relations in the published papers with machine learning based tools. To support the chemical disease semantic relation extraction especially for chronic diseases, a chronic disease specific corpus for combination therapy discovery in Chinese (RCorp) is manually annotated. METHODS:In this study, we extracted abstracts from a Chinese medical literature server and followed the annotation framework of the BioCreative CDR corpus, with the guidelines modified to make the combination therapy related relations available. An annotation tool was incorporated to the standard annotation process.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text annotation",
                    "uri": "http://edamontology.org/operation_3778"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Named-entity and concept recognition",
                    "uri": "http://edamontology.org/operation_3280"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31801523",
    "lastUpdate": "2020-01-14T19:58:39Z",
    "name": "RCorp",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0936-3",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: To robustly identify synergistic combinations of drugs, high-throughput screenings are desirable. It will be of great help to automatically identify the relations in the published papers with machine learning based tools. To support the chemical disease semantic relation extraction especially for chronic diseases, a chronic disease specific corpus for combination therapy discovery in Chinese (RCorp) is manually annotated. Methods: In this study, we extracted abstracts from a Chinese medical literature server and followed the annotation framework of the BioCreative CDR corpus, with the guidelines modified to make the combination therapy related relations available. An annotation tool was incorporated to the standard annotation process. Results: The resulting RCorp consists of 339 Chinese biomedical articles with 2367 annotated chemicals, 2113 diseases, 237 symptoms, 164 chemical-induce-disease relations, 163 chemical-induce-symptom relations, and 805 chemical-treat-disease relations. Each annotation includes both the mention text spans and normalized concept identifiers. The corpus gets an inter-annotator agreement score of 0.883 for chemical entities, 0.791 for disease entities which are measured by F score. And the F score for chemical-treat-disease relations gets 0.788 after unifying the entity mentions. Conclusions: We extracted and manually annotated a chronic disease specific corpus for combination therapy discovery in Chinese. The result analysis of the corpus proves its quality for the combination therapy related knowledge discovery task. Our annotated corpus would be a useful resource for the modelling of entity recognition and relation extraction tools. In the future, an evaluation based on the corpus will be held.",
                "authors": [
                    {
                        "name": "Sun Y."
                    },
                    {
                        "name": "Hou L."
                    },
                    {
                        "name": "Qin L."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Qian Q."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-05T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "RCorp: A resource for chemical disease semantic extraction in Chinese"
            },
            "pmcid": "PMC6894109",
            "pmid": "31801523"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Respiratory medicine",
            "uri": "http://edamontology.org/topic_3322"
        },
        {
            "term": "Safety sciences",
            "uri": "http://edamontology.org/topic_3377"
        }
    ]
}