{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://sfb.kaust.edu.sa/Pages/Home.aspx"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"}]},{"operation":[{"term":"Prediction","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequences","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/hotspot-hot-spot-residues-prediction.html"}],"publication":[{"abstract":"Hot spot residues of proteins are fundamental interface residues that help proteins perform their functions. Detecting hot spots by experimental methods is costly and time-consuming. Sequential and structural information has been widely used in the computational prediction of hot spots. However, structural information is not always available. In this article, we investigated the problem of identifying hot spots using only physicochemical characteristics extracted from amino acid sequences. We first extracted 132 relatively independent physicochemical features from a set of the 544 properties in AAindex1, an amino acid index database. Each feature was utilized to train a classification model with a novel encoding schema for hot spot prediction by the IBk algorithm, an extension of the K-nearest neighbor algorithm. The combinations of the individual classifiers were explored and the classifiers that appeared frequently in the top performing combinations were selected. The hot spot predictor was built based on an ensemble of these classifiers and to work in a voting manner. Experimental results demonstrated that our method effectively exploited the feature space and allowed flexible weights of features for different queries. On the commonly used hot spot benchmark sets, our method significantly outperformed other machine learning algorithms and state-of-the-art hot spot predictors. The program is available at http://sfb.kaust.edu.sa/pages/software.aspx. © 2013 Wiley Periodicals, Inc.","authors":["Chen P.","Li J.","Wong L.","Kuwahara H.","Huang J.Z.","Gao X."],"cit_count":30,"doi":"10.1002/prot.24278","journal":"Proteins: Structure, Function and Bioinformatics","title":"Accurate prediction of hot spot residues through physicochemical characteristics of amino acid sequences","type":"Primary","year":"2013-08-01"}],"summary":{"biotoolsCURIE":"biotools:hotspot","biotoolsID":"hotspot","description":"HotSpot is a software of prediction of hot spot residues through physicochemical characteristics of amino acid sequences","homepage":"http://sfb.kaust.edu.sa/Pages/Software.aspx","name":"HotSpot"}}