{
    "accessibility": "Open access",
    "additionDate": "2019-07-31T19:00:25Z",
    "biotoolsCURIE": "biotools:WellInverter",
    "biotoolsID": "WellInverter",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Hidde.de-Jong@inria.fr",
            "name": "Hidde de Jong",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "hans.geiselmann@ujf-grenoble.fr",
            "name": "Johannes Geiselmann",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Web application for the analysis of fluorescent reporter gene data.",
    "documentation": [
        {
            "note": "Tutorial material",
            "type": [
                "Training material"
            ],
            "url": "http://ibis.inrialpes.fr/people/dejong/WellInverter/tutorial_WellInverter_new.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://team.inria.fr/ibis/wellinverter/",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "Proprietary",
    "link": [
        {
            "note": "WellInverter Standalone Windows",
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.inria.fr/WellInverter/WellInverter_Standalone_Windows"
        }
    ],
    "maturity": "Mature",
    "name": "WellInverter",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/s12859-019-2920-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Fluorescent reporter genes have become widely used for monitoring gene expression in living cells. When a microbial strain carrying a reporter gene is grown in a microplate reader, the fluorescence and the absorbance (optical density) of the culture can be automatically measured every few minutes in a highly parallelized way. The extraction of useful information from the resulting large amounts of data is not easy to achieve, because the fluorescence and absorbance measurements are only indirectly related to promoter activities and protein concentrations, requiring mathematical models of the expression of reporter genes for their interpretation. Although the principles of the analysis of reporter gene data are well-established today, there is a lack of general-purpose bioinformatics tools based on generic measurement models and sound inference procedures. This has motivated the development of WellInverter, a web application based on well-known methods for regularized linear inversion. Results: We present a new version of WellInverter that considerably improves the performance and usability of the original application. In particular, we have put in place a parallel computing architecture with a load balancer to distribute analysis queries over several back-end servers, we have completely redesigned the graphical user interface to better support the different analysis steps, and we have developed a plug-in system for the parsing of data files produced by microplate readers from different manufacturers. We illustrate the functioning of WellInverter by analyzing data of the expression of a fluorescent reporter gene controlled by a phage promoter in growing Escherichia coli populations. We show that the expression pattern in different growth media, supporting different growth rates, corresponds to the pattern expected for a constitutive gene. Conclusions: The new version of WellInverter is a robust, easy-to-use and scalable web application, which has been deployed on two publicly accessible web servers and which can also be installed locally. A demo version of the application with two sample datasets is available on-line.",
                "authors": [
                    {
                        "name": "Martin Y."
                    },
                    {
                        "name": "Page M."
                    },
                    {
                        "name": "Blanchet C."
                    },
                    {
                        "name": "De Jong H."
                    }
                ],
                "date": "2019-06-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "WellInverter: A web application for the analysis of fluorescent reporter gene data"
            },
            "pmcid": "PMC6558888",
            "pmid": "31185910",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "RNA-seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}