{
    "additionDate": "2020-01-14T20:15:16Z",
    "biotoolsCURIE": "biotools:elastix",
    "biotoolsID": "elastix",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "m.staring@lumc.nl",
            "name": "Marius Staring",
            "typeEntity": "Person",
            "url": "https://www.lumc.nl/org/radiologie/medewerkers/912080517562222"
        },
        {
            "email": "s.klein@erasmusmc.nl",
            "name": "Stefan Klein",
            "typeEntity": "Person",
            "url": "http://www.bigr.nl/people/StefanKlein"
        }
    ],
    "description": "Evaluation of an Open Source Registration Package for Automatic Contour Propagation in Online Adaptive Intensity-Modulated Proton Therapy of Prostate Cancer.\n\nHome : About : FAQ : wiki : Download : News : Legal stuff : Documentation.\n\nWelcome to elastix : a toolbox for rigid and nonrigid registration of images.\n\nelastix is open source software, based on the well-known Insight Segmentation and Registration Toolkit (ITK). The software consists of a collection of algorithms that are commonly used to solve (medical) image registration problems. The modular design of elastix allows the user to quickly configure, test, and compare different registration methods for a specific application. A command-line interface enables automated processing of large numbers of data sets, by means of scripting. Nowadays elastix is accompanied by SimpleElastix , making it available in languages like C++, Python, Java, R, Ruby, C# and Lua.",
    "documentation": [
        {
            "type": [
                "FAQ"
            ],
            "url": "https://github.com/SuperElastix/elastix/wiki/FAQ"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/SuperElastix/elastix/wiki"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://elastix.lumc.nl/download/elastix-5.0.1-manual.pdf"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "http://elastix.isi.uu.nl",
    "lastUpdate": "2020-12-25T12:24:39Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/SuperElastix/elastix/issues"
        }
    ],
    "name": "elastix",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fninf.2013.00050",
            "metadata": {
                "abstract": "Nonrigid image registration is an important, but time-consuming task in medical image analysis. In typical neuroimaging studies, multiple image registrations are performed, i.e., for atlas-based segmentation or template construction. Faster image registration routines would therefore be beneficial. In this paper we explore acceleration of the image registration package elastix by a combination of several techniques: (i) parallelization on the CPU, to speed up the cost function derivative calculation; (ii) parallelization on the GPU building on and extending the OpenCL framework from ITKv4, to speed up the Gaussian pyramid computation and the image resampling step; (iii) exploitation of certain properties of the B-spline transformation model; (iv) further software optimizations. The accelerated registration tool is employed in a study on diagnostic classification of Alzheimer's disease and cognitively normal controls based on T1-weighted MRI. We selected 299 participants from the publicly available Alzheimer's Disease Neuroimaging Initiative database. Classification is performed with a support vector machine based on gray matter volumes as a marker for atrophy. We evaluated two types of strategies (voxel-wise and region-wise) that heavily rely on nonrigid image registration. Parallelization and optimization resulted in an acceleration factor of 4-5x on an 8-core machine. Using OpenCL a speedup factor of 2 was realized for computation of the Gaussian pyramids, and 15-60 for the resampling step, for larger images. The voxel-wise and the region-wise classification methods had an area under the receiver operator characteristic curve of 88 and 90%, respectively, both for standard and accelerated registration. We conclude that the image registration package elastix was substantially accelerated, with nearly identical results to the non-optimized version. The new functionality will become available in the next release of elastix as open source under the BSD license. © 2014 Shamonin, Bron, Lelieveldt, Smits, Klein and Staring.",
                "authors": [
                    {
                        "name": "Bron E.E."
                    },
                    {
                        "name": "Klein S."
                    },
                    {
                        "name": "Lelieveldt B.P.F."
                    },
                    {
                        "name": "Shamonin D.P."
                    },
                    {
                        "name": "Smits M."
                    },
                    {
                        "name": "Staring M."
                    }
                ],
                "citationCount": 254,
                "date": "2014-01-16T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "Fast parallel image registration on CPU and GPU for diagnostic classification of Alzheimer's disease"
            },
            "pmcid": "PMC3893567",
            "pmid": "24474917"
        },
        {
            "doi": "10.3389/FONC.2019.01297",
            "metadata": {
                "abstract": "© Copyright © 2019 Qiao, Jagt, Hoogeman, Lelieveldt and Staring.Objective: Our goal was to investigate the performance of an open source deformable image registration package, elastix, for fast and robust contour propagation in the context of online-adaptive intensity-modulated proton therapy (IMPT) for prostate cancer. Methods: A planning and 7–10 repeat CT scans were available of 18 prostate cancer patients. Automatic contour propagation of repeat CT scans was performed using elastix and compared with manual delineations in terms of geometric accuracy and runtime. Dosimetric accuracy was quantified by generating IMPT plans using the propagated contours expanded with a 2 mm (prostate) and 3.5 mm margin (seminal vesicles and lymph nodes) and calculating dosimetric coverage based on the manual delineation. A coverage of V95% ≥ 98% (at least 98% of the target volumes receive at least 95% of the prescribed dose) was considered clinically acceptable. Results: Contour propagation runtime varied between 3 and 30 s for different registration settings. For the fastest setting, 83 in 93 (89.2%), 73 in 93 (78.5%), and 91 in 93 (97.9%) registrations yielded clinically acceptable dosimetric coverage of the prostate, seminal vesicles, and lymph nodes, respectively. For the prostate, seminal vesicles, and lymph nodes the Dice Similarity Coefficient (DSC) was 0.87 ± 0.05, 0.63 ± 0.18, and 0.89 ± 0.03 and the mean surface distance (MSD) was 1.4 ± 0.5 mm, 2.0 ± 1.2 mm, and 1.5 ± 0.4 mm, respectively. Conclusion: With a dosimetric success rate of 78.5–97.9%, this software may facilitate online adaptive IMPT of prostate cancer using a fast, free and open implementation.",
                "authors": [
                    {
                        "name": "Hoogeman M."
                    },
                    {
                        "name": "Jagt T."
                    },
                    {
                        "name": "Lelieveldt B.P.F."
                    },
                    {
                        "name": "Qiao Y."
                    },
                    {
                        "name": "Staring M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-27T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "Evaluation of an Open Source Registration Package for Automatic Contour Propagation in Online Adaptive Intensity-Modulated Proton Therapy of Prostate Cancer"
            },
            "pmcid": "PMC6890846",
            "pmid": "31828037",
            "type": [
                "Benchmarking study"
            ]
        },
        {
            "doi": "10.1109/TMI.2009.2035616",
            "metadata": {
                "abstract": "Medical image registration is an important task in medical image processing. It refers to the process of aligning data sets, possibly from different modalities (e.g., magnetic resonance and computed tomography), different time points (e.g., follow-up scans), and/or different subjects (in case of population studies). A large number of methods for image registration are described in the literature. Unfortunately, there is not one method that works for all applications. We have therefore developed elastix, a publicly available computer program for intensity-based medical image registration. The software consists of a collection of algorithms that are commonly used to solve medical image registration problems. The modular design of elastix allows the user to quickly configure, test, and compare different registration methods for a specific application. The command-line interface enables automated processing of large numbers of data sets, by means of scripting. The usage of elastix for comparing different registration methods is illustrated with three example experiments, in which individual components of the registration method are varied. © 2006 IEEE.",
                "authors": [
                    {
                        "name": "Klein S."
                    },
                    {
                        "name": "Murphy K."
                    },
                    {
                        "name": "Pluim J.P.W."
                    },
                    {
                        "name": "Staring M."
                    },
                    {
                        "name": "Viergever M.A."
                    }
                ],
                "citationCount": 2163,
                "date": "2010-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Elastix: A toolbox for intensity-based medical image registration"
            },
            "pmid": "19923044"
        }
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
