{
    "additionDate": "2021-03-19T08:49:06Z",
    "biotoolsCURIE": "biotools:4specid",
    "biotoolsID": "4specid",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "aamorim@ipatimup.pt",
            "name": "António Amorim",
            "orcidid": "https://orcid.org/0000-0002-7518-6247",
            "typeEntity": "Person"
        }
    ],
    "description": "4SpecID is a cross-platform program to audit and annotate reference DNA libraries. It is oriented to ensure the golden standards for forensic applications.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA profiling",
                    "uri": "http://edamontology.org/operation_3894"
                },
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Taxonomic classification",
                    "uri": "http://edamontology.org/operation_3460"
                }
            ]
        }
    ],
    "homepage": "https://4specid.github.io",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-04-11T06:13:24Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/4SpecID/4SpecID"
        }
    ],
    "name": "4SpecID",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/GENES12010061",
            "metadata": {
                "abstract": "© 2021 by the authors.Forensic genetics is a fast-growing field that frequently requires DNA-based taxonomy, namely, when evidence are parts of specimens, often highly processed in food, potions, or ointments. Reference DNA-sequences libraries, such as BOLD or GenBank, are imperative tools for taxonomic assignment, particularly when morphology is inadequate for classification. The auditing and cura- tion of these datasets require reliable mechanisms, preferably with automated data preprocessing. Software tools were developed to grade these datasets considering as primary criterion the number of records, which is not compliant with forensic standards, where the priority is validation from independent sources. Moreover, 4SpecID is an efficient software tool developed to audit and annotate reference libraries, specifically designed for forensic applications. Its intuitive user-friendly interface virtually accesses any database and includes specific data mining functions tuned for the widespread BOLD repositories. The built tool was evaluated in laptop MacBook and a dual-Xeon server with a large BOLD dataset (Culicidae, 36,115 records), and the best execution time to grade the dataset on the laptop was 0.28 s. Datasets of Bovidae and Felidae families were used to evaluate the quality of the tool and the relevance of independent sources validation.",
                "authors": [
                    {
                        "name": "Amorim A."
                    },
                    {
                        "name": "Conde-Sousa E."
                    },
                    {
                        "name": "Neto L."
                    },
                    {
                        "name": "Pinto N."
                    },
                    {
                        "name": "Proenca A."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Forests",
                "title": "4specid: Reference dna libraries auditing and annotation system for forensic applications"
            },
            "pmcid": "PMC7824288",
            "pmid": "33401773"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ]
}
