{
    "additionDate": "2021-03-19T08:47:13Z",
    "biotoolsCURIE": "biotools:preanticov",
    "biotoolsID": "preanticov",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leetzongyi@cuhk.edu.cn",
            "name": "Tzong-Yi Lee",
            "typeEntity": "Person"
        }
    ],
    "description": "PreAntiCoV is a tool for identifying anti-coronavirus peptides by incorporating different negative datasets and imbalanced learning strategies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence composition calculation",
                    "uri": "http://edamontology.org/operation_0236"
                },
                {
                    "term": "Protein property calculation",
                    "uri": "http://edamontology.org/operation_0250"
                }
            ]
        }
    ],
    "homepage": "https://github.com/poncey/PreAntiCoV",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-04-11T09:06:07.451926Z",
    "license": "MIT",
    "name": "PreAntiCoV",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA423",
            "metadata": {
                "abstract": "© The Author(s) 2021. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com.As the current worldwide outbreaks of the SARS-CoV-2, it is urgently needed to develop effective therapeutic agents for inhibiting the pathogens or treating the related diseases. Antimicrobial peptides (AMP) with functional activity against coronavirus could be a considerable solution, yet there is no research for identifying anti-coronavirus (anti-CoV) peptides with the computational approach. In this study, we first investigated the physiochemical and compositional properties of the collected anti-CoV peptides by comparing against three other negative sets: antivirus peptides without anti-CoV function (antivirus), regular AMP without antivirus functions (non-AVP) and peptides without antimicrobial functions (non-AMP). Then, we established classifiers for identifying anti-CoV peptides between different negative sets based on random forest. Imbalanced learning strategies were adopted due to the severe class-imbalance within the datasets. The geometric mean of the sensitivity and specificity (GMean) under the identification from antivirus, non-AVP and non-AMP reaches 83.07%, 85.51% and 98.82%, respectively. Then, to pursue identifying anti-CoV peptides from broad-spectrum peptides, we designed a double-stages classifier based on the collected datasets. In the first stage, the classifier characterizes AMPs from regular peptides. It achieves an area under the receiver operating curve (AUCROC) value of 97.31%. The second stage is to identify the anti-CoV peptides between the combined negatives of other AMPs. Here, the GMean of evaluation on the independent test set is 79.42%. The proposed approach is considered as an applicable scheme for assisting the development of novel anti-CoV peptides. The datasets and source codes used in this study are available at https://github.com/poncey/PreAntiCoV.",
                "authors": [
                    {
                        "name": "Pang Y."
                    },
                    {
                        "name": "Wang Z."
                    },
                    {
                        "name": "Jhong J.-H."
                    },
                    {
                        "name": "Lee T.-Y."
                    }
                ],
                "date": "2021-03-22T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "Identifying anti-coronavirus peptides by incorporating different negative datasets and imbalanced learning strategies"
            },
            "pmcid": "PMC7929366",
            "pmid": "33497434"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}