{
    "additionDate": "2018-05-07T16:03:30Z",
    "biotoolsCURIE": "biotools:wormhole",
    "biotoolsID": "wormhole",
    "credit": [
        {
            "email": "george.sutphin@jax.org",
            "name": "George Sutphin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Novel Least Diverged Ortholog Prediction through Machine Learning.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://wormhole.jax.org/about.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                }
            ]
        }
    ],
    "homepage": "http://wormhole.jax.org/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "WORMHOLE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1005182",
            "metadata": {
                "abstract": "© 2016 Sutphin et al.The rapid advancement of technology in genomics and targeted genetic manipulation has made comparative biology an increasingly prominent strategy to model human disease processes. Predicting orthology relationships between species is a vital component of comparative biology. Dozens of strategies for predicting orthologs have been developed using combinations of gene and protein sequence, phylogenetic history, and functional interaction with progressively increasing accuracy. A relatively new class of orthology prediction strategies combines aspects of multiple methods into meta-tools, resulting in improved prediction performance. Here we present WORMHOLE, a novel ortholog prediction meta-tool that applies machine learning to integrate 17 distinct ortholog prediction algorithms to identify novel least diverged orthologs (LDOs) between 6 eukaryotic species—humans, mice, zebrafish, fruit flies, nematodes, and budding yeast. Machine learning allows WORMHOLE to intelligently incorporate predictions from a wide-spectrum of strategies in order to form aggregate predictions of LDOs with high confidence. In this study we demonstrate the performance of WORMHOLE across each combination of query and target species. We show that WORMHOLE is particularly adept at improving LDO prediction performance between distantly related species, expanding the pool of LDOs while maintaining low evolutionary distance and a high level of functional relatedness between genes in LDO pairs. We present extensive validation, including cross-validated prediction of PANTHER LDOs and evaluation of evolutionary divergence and functional similarity, and discuss future applications of machine learning in ortholog prediction. A WORMHOLE web tool has been developed and is available at http://wormhole.jax.org/.",
                "authors": [
                    {
                        "name": "Sutphin G.L."
                    },
                    {
                        "name": "Mahoney J.M."
                    },
                    {
                        "name": "Sheppard K."
                    },
                    {
                        "name": "Walton D.O."
                    },
                    {
                        "name": "Korstanje R."
                    }
                ],
                "citationCount": 9,
                "date": "2016-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "WORMHOLE: Novel Least Diverged Ortholog Prediction through Machine Learning"
            },
            "pmcid": "PMC5094675",
            "pmid": "27812085"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}