{
    "accessibility": "Open access",
    "additionDate": "2023-01-17T21:35:03.050563Z",
    "biotoolsCURIE": "biotools:membrain_pipeline",
    "biotoolsID": "membrain_pipeline",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ben.engel@unibas.ch",
            "name": "Benjamin D. Engel",
            "orcidid": "http://orcid.org/0000-0002-0941-4387",
            "typeEntity": "Person"
        },
        {
            "email": "tingying.peng@helmholtz-muenchen.de",
            "name": "Tingying Peng",
            "orcidid": "http://orcid.org/0000-0002-7881-1749",
            "typeEntity": "Person"
        },
        {
            "name": "Lorenz Lamm",
            "orcidid": "http://orcid.org/0000-0003-0698-7769"
        },
        {
            "name": "Ricardo D. Righetto",
            "orcidid": "http://orcid.org/0000-0003-4247-4303"
        }
    ],
    "description": "A Deep Learning-aided Pipeline for Automated Detection of Membrane Proteins in Cryo-electron Tomograms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Single particle alignment and classification",
                    "uri": "http://edamontology.org/operation_3458"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CellArchLab/MemBrain",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-01-17T21:35:03.053149Z",
    "license": "MPL-2.0",
    "name": "MemBrain",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.cmpb.2022.106990",
            "metadata": {
                "abstract": "© 2022Background and Objective: Cryo-electron tomography (cryo-ET) is an imaging technique that enables 3D visualization of the native cellular environment at sub-nanometer resolution, providing unpreceded insights into the molecular organization of cells. However, cryo-electron tomograms suffer from low signal-to-noise ratios and anisotropic resolution, which makes subsequent image analysis challenging. In particular, the efficient detection of membrane-embedded proteins is a problem still lacking satisfactory solutions. Methods: We present MemBrain – a new deep learning-aided pipeline that automatically detects membrane-bound protein complexes in cryo-electron tomograms. After subvolumes are sampled along a segmented membrane, each subvolume is assigned a score using a convolutional neural network (CNN), and protein positions are extracted by a clustering algorithm. Incorporating rotational subvolume normalization and using a tiny receptive field simplify the task of protein detection and thus facilitate the network training. Results: MemBrain requires only a small quantity of training labels and achieves excellent performance with only a single annotated membrane (F1 score: 0.88). A detailed evaluation shows that our fully trained pipeline outperforms existing classical computer vision-based and CNN-based approaches by a large margin (F1 score: 0.92 vs. max. 0.63). Furthermore, in addition to protein center positions, MemBrain can determine protein orientations, which has not been implemented by any existing CNN-based method to date. We also show that a pre-trained MemBrain program generalizes to tomograms acquired using different cryo-ET methods and depicting different types of cells. Conclusions: MemBrain is a powerful and annotation-efficient tool for the detection of membrane protein complexes in cryo-ET data, with the potential to be used in a wide range of biological studies. It is generalizable to various kinds of tomograms, making it possible to use pretrained models for different tasks. Its efficiency in terms of required annotations also allows rapid training and fine-tuning of models. The corresponding code, pretrained models, and instructions for operating the MemBrain program can be found at: https://github.com/CellArchLab/MemBrain.",
                "authors": [
                    {
                        "name": "Engel B.D."
                    },
                    {
                        "name": "Lamm L."
                    },
                    {
                        "name": "Martinez-Sanchez A."
                    },
                    {
                        "name": "Peng T."
                    },
                    {
                        "name": "Poge M."
                    },
                    {
                        "name": "Righetto R.D."
                    },
                    {
                        "name": "Wietrzynski W."
                    }
                ],
                "citationCount": 3,
                "date": "2022-09-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "MemBrain: A deep learning-aided pipeline for detection of membrane proteins in Cryo-electron tomograms"
            },
            "pmid": "35858496"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
