{
    "accessibility": "Open access",
    "additionDate": "2024-06-26T13:54:39.637629Z",
    "biotoolsCURIE": "biotools:smoother",
    "biotoolsID": "smoother",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Markus Schmidt",
            "orcidid": "https://orcid.org/0000-0002-5601-6349"
        }
    ],
    "description": "Smoother is an interactive analysis and visualization software for nucleic acid interactome data (e.g. Hi-C data) that allows the change of parameters such as normalization, bin size, or MAPQ, on-the-fly. Smoother can load multiple samples which can be grouped and compared. Smoother also allows filtering by annotations and the display of coverage for additional sequencing data.\n\nSmoother is centered around an index including the genome, annotations, and datasets to be analyzed and visualized. Using this index, Smoother allows changing analysis parameters on-the-fly.\n\nInstall: pip install biosmoother",
    "documentation": [
        {
            "type": [
                "API documentation",
                "Citation instructions",
                "Installation instructions",
                "User manual"
            ],
            "url": "https://biosmoother.readthedocs.io/en/latest/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://biosmoother.readthedocs.io/en/latest/",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2024-11-24T13:51:26.063274Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Siegel-Lab/BioSmoother"
        }
    ],
    "maturity": "Mature",
    "name": "Smoother",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "MarkusSchmidt",
    "publication": [
        {
            "doi": "10.1093/nar/gkae008",
            "metadata": {
                "abstract": "Nucleic acid interactome data, such as chromosome conformation capture data and RNA-DNA interactome data, are currently analyzed via pipelines that must be rerun for each new parameter set. A more dynamic approach is desirable since the optimal parameter set is commonly unknown ahead of time and rerunning pipelines is a time-consuming process. We ha v e de v eloped an approach fast enough to process interac- tome data on-the-fly using a sparse prefix sum index. With this inde x, w e created Smoother, a flexible, multifeatured visualization and analysis tool that allo ws interactiv e filtering , e.g . by mapping qualit y, almost inst ant comparisons bet ween different normalization approaches, e.g . iterative cor rection, and ploidy cor rection. Further, Smoother can o v erla y other sequencing data or genomic annotations, compare different samples, and perform virtual 4C analysis. Smoother permits a novel way to interact with and explore interactome data, fostering comprehensive, high-quality data analysis. Smoother is available at https: // github.com / Siegel-Lab / BioSmoother under the MIT license.",
                "authors": [
                    {
                        "name": "Barcons-Simon A."
                    },
                    {
                        "name": "Rabuffo C."
                    },
                    {
                        "name": "Schmidt M.R."
                    },
                    {
                        "name": "Siegel T.N."
                    }
                ],
                "date": "2024-03-21T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Smoother: on-the-fly processing of int er act ome data using prefix sums"
            },
            "pmcid": "PMC10954447",
            "pmid": "38281191",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        }
    ]
}
