
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Humans",
                "uri": "http://edamontology.org/topic_2815"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Medline is a rich information source, from which links between genes and keywords describing biological processes, pathways, drugs, pathologies and diseases can be extracted. We developed a publicly available tool called CoPub that uses the information in the Medline database for the biological interpretation of microarray data. CoPub allows batch input of multiple human, mouse or rat genes and produces lists of keywords from several biomedical thesauri that are significantly correlated with the set of input genes. These lists link to Medline abstracts in which the co-occurring input genes and correlated keywords are highlighted. Furthermore, CoPub can graphically visualize differentially expressed genes and over-represented keywords in a network, providing detailed insight in the relationships between genes and keywords, and revealing the most influential genes as highly connected hubs. CoPub is freely accessible at http://services.nbic.nl/cgi-bin/copub/CoPub.pl.",
            "authors": [
                "Frijters R.",
                "Heupers B.",
                "van Beek P.",
                "Bouwhuis M.",
                "van Schaik R.",
                "de Vlieg J.",
                "Polman J.",
                "Alkema W."
            ],
            "cit_count": 62,
            "journal": "Nucleic acids research",
            "pmid": "18442992",
            "title": "CoPub: a literature-based keyword enrichment tool for microarray data analysis.",
            "year": "2008-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:copub",
        "biotoolsID": "copub",
        "description": "Text mining tool for the detection of biomedical terms that co-occur in abstracts with the list of input genes (human, rat, and mouse genes). It also graphically displays differentially expressed genes and over-represented keywords in a network for better visualization of relationships. Version 5.0 uses a new thesauri. It allows for searching of keywords, provides highlighting and sorting mechanisms and statistics. It searches for indirect relations between genes, pathways, drugs and diseases.",
        "homepage": "http://www.copub.org",
        "name": "CoPub"
    }
}