{
    "additionDate": "2019-11-14T20:07:53Z",
    "biotoolsCURIE": "biotools:Immunopaedia",
    "biotoolsID": "Immunopaedia",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "Dietrich.kabelitz@uksh.de",
            "name": "Dieter Kabelitz",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/krisp (ORG.ZA) | > CORRECT NAME OF TOOL COULD ALSO BE 'IUIS', 'IUIS-EDU' | Immunology Education Without Borders | Advancing Global Immunology Education | EARN CPD POINTS ON OUR AWARD WINNING SITE AND LEARN IMMUNOLOGY",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA vaccine design",
                    "uri": "http://edamontology.org/operation_0560"
                }
            ]
        }
    ],
    "homepage": "https://www.immunopaedia.org.za/",
    "lastUpdate": "2019-11-14T20:07:53Z",
    "name": "Immunopaedia",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2019.02012",
            "metadata": {
                "abstract": "© 2019 Kabelitz, Letarte and Gray.One of the mandates of the International Union of Immunological Societies (IUIS) is to promote immunological education to young scientists across the globe, including a large focus on those from low and low-to-middle income countries (LIC and LMIC). It strives to achieve this goal through the Education Committee (EDU), which is one of ten committees of the IUIS. To this end, EDU organizes three to four one-week courses per year in close cooperation with regional immunological societies and local organizers. Initially, the focus has been on Africa, addressing the most relevant topics and health issues facing specific countries or regions in the continent. The idea was then extended to Latin America and now also includes courses in Asia. The faculty of all courses is a blend of international and local/regional experts also known for their teaching expertise. The courses are highly interactive, and include “meet-the-speakers” sessions, poster walks, and sessions on grant or PhD project writing, and on practical aspects of becoming a successful scientist. Importantly, all the IUIS-EDU courses use a combination of pre-and during-course on-line learning followed by consolidation of knowledge in a collegial setting. This “flipped” classroom approach ensures that participants have acquired the basic knowledge needed to optimize their participation in the course. Immunopaedia is the IUIS-endorsed immunology learning site used for this purpose. All faculty members are requested to contribute material related to their specific topic while students must learn the on-line material before coming in person to the course. All course participants have free access to all Immunopaedia material indefinitely. The implementation of regional immunology courses targeted to local health issues in areas of the world where PhD students, post-doctoral, and early career scientists often do not have access to open on-line resources and contact with renowned experts in the field has proven to be highly successful. The long-term impact of this structured educational program is already visible through the large number of young scientists who are now connected via Immunopaedia and who are forming networks in regions where there had been very little contact before and building new Immunological Societies.",
                "authors": [
                    {
                        "name": "Kabelitz D."
                    },
                    {
                        "name": "Letarte M."
                    },
                    {
                        "name": "Gray C.M."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "Immunology education without borders"
            },
            "pmcid": "PMC6724660",
            "pmid": "31555265"
        }
    ],
    "topic": [
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}