{
    "accessibility": "Open access",
    "additionDate": "2021-11-20T23:05:58.851335Z",
    "biotoolsCURIE": "biotools:scpnmf",
    "biotoolsID": "scpnmf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jli@stat.ucla.edu",
            "name": "Jingyi Jessica Li",
            "typeEntity": "Person"
        },
        {
            "email": "aileenlikexin@outlook.com",
            "name": "Kexin Li"
        },
        {
            "email": "dongyuansong@ucla.edu",
            "name": "Dongyuan Song"
        }
    ],
    "description": "A dimensionality reduction method to facilitate gene selection for targeted gene profiling by learning a sparse gene encoding of single cells",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "homepage": "https://github.com/JSB-UCLA/scPNMF",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-20T23:07:57.716754Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/JSB-UCLA/scPNMF"
        }
    ],
    "name": "scPNMF",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB273",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Motivation: Single-cell RNA sequencing (scRNA-seq) captures whole transcriptome information of individual cells. While scRNA-seq measures thousands of genes, researchers are often interested in only dozens to hundreds of genes for a closer study. Then, a question is how to select those informative genes from scRNA-seq data. Moreover, single-cell targeted gene profiling technologies are gaining popularity for their low costs, high sensitivity and extra (e.g. spatial) information; however, they typically can only measure up to a few hundred genes. Then another challenging question is how to select genes for targeted gene profiling based on existing scRNA-seq data. Results: Here, we develop the single-cell Projective Non-negative Matrix Factorization (scPNMF) method to select informative genes from scRNA-seq data in an unsupervised way. Compared with existing gene selection methods, scPNMF has two advantages. First, its selected informative genes can better distinguish cell types. Second, it enables the alignment of new targeted gene profiling data with reference data in a low-dimensional space to facilitate the prediction of cell types in the new data. Technically, scPNMF modifies the PNMF algorithm for gene selection by changing the initialization and adding a basis selection step, which selects informative bases to distinguish cell types. We demonstrate that scPNMF outperforms the state-of-the-art gene selection methods on diverse scRNA-seq datasets. Moreover, we show that scPNMF can guide the design of targeted gene profiling experiments and the celltype annotation on targeted gene profiling data. Availability and implementation: The R package is open-access and available at https://github.com/JSB-UCLA/ scPNMF. The data used in this work are available at Zenodo: https://doi.org/10.5281/zenodo.4797997. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Song D."
                    },
                    {
                        "name": "Li K."
                    },
                    {
                        "name": "Hemminger Z."
                    },
                    {
                        "name": "Wollman R."
                    },
                    {
                        "name": "Li J.J."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ScPNMF: Sparse gene encoding of single cells to facilitate gene selection for targeted gene profiling"
            },
            "pmcid": "PMC8275345",
            "pmid": "34252925"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}