{
    "additionDate": "2021-10-04T07:16:33.701071Z",
    "biotoolsCURIE": "biotools:isosplitter",
    "biotoolsID": "isosplitter",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hfyin@caf.ac.cn",
            "name": "Hengfu Yin",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "IsoSplitter is a de novo identification tool of alternative splicing sites using long-reads transcriptome without a reference genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Hengfu-Yin/IsoSplitter",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-10-04T07:16:33.703653Z",
    "license": "LGPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Hengfu-Yin/IsoSplitter/issues"
        }
    ],
    "name": "IsoSplitter",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1261/RNA.077834.120",
            "metadata": {
                "abstract": "© 2021 Wang et al.Long-read transcriptome sequencing is designed to sequence full-length RNA molecules and advantageous for identifying alternative splice isoforms; however, in the absence of a reference genome, it is difficult to accurately locate splice sites because of the diversity of patterns of alternative splicing (AS). Based on long-read transcriptome data, we developed a versatile tool, IsoSplitter, to reverse-trace and validate AS gene \"split sites\"with the following features: (i) IsoSplitter initially invokes a modified SIM4 program to find transcript split sites; (ii) each split site is then quantified, to reveal transcript diversity, and putative isoforms are grouped into gene clusters; (iii) an optional step for aligning short reads is provided, to validate split sites by identifying unique junction reads, and revealing and quantifying tissue-specific alternative splice isoforms. We tested IsoSplitter AS prediction using data sets from multiple model and nonmodel plant species and showed that the IsoSplitter pipeline is efficient to handle different transcriptomes with high accuracy. Furthermore, we evaluated the IsoSplitter pipeline compared with that of the splice junction identification tools, Program to Assemble Spliced Alignments (PASA software needs a reference genome for AS identification) and AStrap, using data from the model plant Arabidopsis thaliana. We found that IsoSplitter determined more than twice as many AS events than AStrap analysis, and 94.13% of the IsoSplitter predicted AS events were also identified by the PASA analysis. Starting from a simple sequence file, IsoSplitter is an assembly-free tool for identification and characterization of AS. IsoSplitter is developed and implemented in Python 3.5 using the Linux platform and is freely available at https://github.com/Hengfu-Yin/IsoSplitter.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Hu Z."
                    },
                    {
                        "name": "Ye N."
                    },
                    {
                        "name": "Yin H."
                    }
                ],
                "date": "2021-08-01T00:00:00Z",
                "journal": "RNA",
                "title": "IsoSplitter: Identification and characterization of alternative splicing sites without a reference genome"
            },
            "pmid": "34021065",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ]
}