{
    "accessibility": "Open access",
    "additionDate": "2024-01-01T18:27:34.905778Z",
    "biotoolsCURIE": "biotools:quickbam",
    "biotoolsID": "quickbam",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yi.qiao@genetics.utah.edu",
            "name": "Yi Qiao",
            "orcidid": "https://orcid.org/0000-0002-8612-9598",
            "typeEntity": "Person"
        },
        {
            "name": "Anders Pitman",
            "typeEntity": "Person"
        },
        {
            "name": "Gabor T Marth",
            "typeEntity": "Person"
        },
        {
            "name": "Xiaomeng Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "Parallelized BAM file access API for high-throughput sequence analysis informatics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://yiq.gitlab.io/quickbam/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/yiq/quickbam/",
    "lastUpdate": "2024-01-01T18:27:34.908442Z",
    "license": "BSD-3-Clause",
    "name": "quickBAM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD463",
            "metadata": {
                "abstract": "Motivation: In time-critical clinical settings, such as precision medicine, genomic data needs to be processed as fast as possible to arrive at data-informed treatment decisions in a timely fashion. While sequencing throughput has dramatically increased over the past decade, bioinformatics analysis throughput has not been able to keep up with the pace of computer hardware improvement, and consequently has now turned into the primary bottleneck. Modern computer hardware today is capable of much higher performance than current genomic informatics algorithms can typically utilize, therefore presenting opportunities for significant improvement of performance. Accessing the raw sequencing data from BAM files, e.g. is a necessary and time-consuming step in nearly all sequence analysis tools, however existing programming libraries for BAM access do not take full advantage of the parallel input/output capabilities of storage devices. Results: In an effort to stimulate the development of a new generation of faster sequence analysis tools, we developed quickBAM, a software library to accelerate sequencing data access by exploiting the parallelism in commodity storage hardware currently widely available. We demonstrate that analysis software ported to quickBAM consistently outperforms their current versions, in some cases finishing an analysis in under 3 min while the original version took 1.5 h, using the same storage solution.",
                "authors": [
                    {
                        "name": "Huang X."
                    },
                    {
                        "name": "Marth G.T."
                    },
                    {
                        "name": "Pitman A."
                    },
                    {
                        "name": "Qiao Y."
                    }
                ],
                "date": "2023-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "QuickBAM: A parallelized BAM file access API for high-throughput sequence analysis informatics"
            },
            "pmcid": "PMC10412403",
            "pmid": "37498562"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ]
}
