{
    "additionDate": "2018-09-19T15:20:05Z",
    "biotoolsCURIE": "biotools:magellan",
    "biotoolsID": "magellan",
    "credit": [
        {
            "email": "ristov@irb.hr",
            "name": "Strahil Ristov",
            "orcidid": "http://orcid.org/0000-0001-6039-0838",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MaGelLAn is a software that facilitates quantitative and population genetic analysis of maternal inheritance by combination of molecular and pedigree information",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/sristov/magellan/blob/master/MagManual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://lissp.irb.hr/software/magellan-1-0/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-01-13T17:28:18Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sristov/magellan"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/sristov/magellan/issues"
        }
    ],
    "name": "MaGelLAn",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12711-016-0242-9",
            "metadata": {
                "abstract": "© 2016 The Author(s).Background: Identification of genes or even nucleotides that are responsible for quantitative and adaptive trait variation is a difficult task due to the complex interdependence between a large number of genetic and environmental factors. The polymorphism of the mitogenome is one of the factors that can contribute to quantitative trait variation. However, the effects of the mitogenome have not been comprehensively studied, since large numbers of mitogenome sequences and recorded phenotypes are required to reach the adequate power of analysis. Current research in our group focuses on acquiring the necessary mitochondria sequence information and analysing its influence on the phenotype of a quantitative trait. To facilitate these tasks we have produced software for processing pedigrees that is optimised for maternal lineage analysis. Results: We present MaGelLAn 1.0 (maternal genealogy lineage analyser), a suite of four Python scripts (modules) that is designed to facilitate the analysis of the impact of mitogenome polymorphism on quantitative trait variation by combining molecular and pedigree information. MaGelLAn 1.0 is primarily used to: (1) optimise the sampling strategy for molecular analyses; (2) identify and correct pedigree inconsistencies; and (3) identify maternal lineages and assign the corresponding mitogenome sequences to all individuals in the pedigree, this information being used as input to any of the standard software for quantitative genetic (association) analysis. In addition, MaGelLAn 1.0 allows computing the mitogenome (maternal) effective population sizes and probability of mitogenome (maternal) identity that are useful for conservation management of small populations. Conclusions: MaGelLAn is the first tool for pedigree analysis that focuses on quantitative genetic analyses of mitogenome data. It is conceived with the purpose to significantly reduce the effort in handling and preparing large pedigrees for processing the information linked to maternal lines. The software source code, along with the manual and the example files can be downloaded at http://lissp.irb.hr/software/magellan-1-0/ and https://github.com/sristov/magellan.",
                "authors": [
                    {
                        "name": "Ristov S."
                    },
                    {
                        "name": "Brajkovic V."
                    },
                    {
                        "name": "Cubric-Curik V."
                    },
                    {
                        "name": "Michieli I."
                    },
                    {
                        "name": "Curik I."
                    }
                ],
                "citationCount": 3,
                "date": "2016-09-10T00:00:00Z",
                "journal": "Genetics Selection Evolution",
                "title": "MaGelLAn 1.0: A software to facilitate quantitative and population genetic analysis of maternal inheritance by combination of molecular and pedigree information"
            },
            "pmcid": "PMC5018160",
            "pmid": "27613390",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}