{
    "additionDate": "2016-02-12T08:47:48Z",
    "biotoolsCURIE": "biotools:heteromirpred",
    "biotoolsID": "heteromirpred",
    "credit": [
        {
            "name": "KMUTT",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "marasri.rue@kmutt.ac.th",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A heterogeneous ensemble algorithm which is the voting of multi-expert classifiers, SVM, kNN, and RF, in the task of pre-miRNA classification. Our model is trained on both human and plant pre-miRNA data and utilize robustness derivative features which has shown to be well distinquishing both plant and animal pre-miRNA hairpins from other non pre-miRNA hairpin-forming sequences.",
    "documentation": [
        {
            "type": "General",
            "url": "http://ncrna-pred.com/premiRNA.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence",
                        "uri": "http://edamontology.org/data_2044"
                    },
                    "format": [
                        {
                            "term": "FASTA-like (text)",
                            "uri": "http://edamontology.org/format_2200"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Score",
                        "uri": "http://edamontology.org/data_1772"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://ncrna-pred.com/premiRNA.html",
    "language": [
        "Java",
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "HeteroMirPred",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "KMUTT",
    "publication": [
        {
            "doi": "10.1093/nar/gks878",
            "metadata": {
                "abstract": "An ensemble classifier approach for microRNA precursor (pre-miRNA) classification was proposed based upon combining a set of heterogeneous algorithms including support vector machine (SVM), k-nearest neighbors (kNN) and random forest (RF), then aggregating their prediction through a voting system. Additionally, the proposed algorithm, the classification performance was also improved using discriminative features, self-containment and its derivatives, which have shown unique structural robustness characteristics of pre-miRNAs. These are applicable across different species. By applying preprocessing methods - both a correlation-based feature selection (CFS) with genetic algorithm (GA) search method and a modified-Synthetic Minority Oversampling Technique (SMOTE) bagging rebalancing method - improvement in the performance of this ensemble was observed. The overall prediction accuracies obtained via 10 runs of 5-fold cross validation (CV) was 96.54%, with sensitivity of 94.8% and specificity of 98.3% - this is better in trade-off sensitivity and specificity values than those of other state-of-the-art methods. The ensemble model was applied to animal, plant and virus pre-miRNA and achieved high accuracy, >93%. Exploiting the discriminative set of selected features also suggests that pre-miRNAs possess high intrinsic structural robustness as compared with other stem loops. Our heterogeneous ensemble method gave a relatively more reliable prediction than those using single classifiers. Our program is available at http://ncrna-pred.com/premiRNA.html. © 2012 The Author(s). Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Lertampaiporn S."
                    },
                    {
                        "name": "Thammarongtham C."
                    },
                    {
                        "name": "Nukoolkit C."
                    },
                    {
                        "name": "Kaewkamnerdpong B."
                    },
                    {
                        "name": "Ruengjitchatchawalya M."
                    }
                ],
                "citationCount": 30,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Heterogeneous ensemble approach with discriminative features and modified-SMOTEbagging for pre-miRNA classification"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}