{
    "additionDate": "2017-02-14T09:34:21Z",
    "biotoolsCURIE": "biotools:selecton",
    "biotoolsID": "selecton",
    "credit": [
        {
            "email": "bioSequence@tauex.tau.ac.il",
            "name": "SELECTON Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Selecton is a server for the identification of site-specific positive selection and purifying selection.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://selecton.tau.ac.il/overview.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis (natural selection)",
                    "uri": "http://edamontology.org/operation_0554"
                }
            ]
        }
    ],
    "homepage": "http://selecton.tau.ac.il/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "Selecton",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Biologically significant sites in a protein may be identified by contrasting the rates of synonymous (K s) and non-synonymous (K a) substitutions. This enables the inference of site-specific positive Darwinian selection and purifying selection. We present here Selecton version 2.2 (http://selecton. bioinfo.tau.ac.il), a web server which automatically calculates the ratio between K a and K s (u) at each site of the protein. This ratio is graphically displayed on each site using a color-coding scheme, indicating either positive selection, purifying selection or lack of selection. Selecton implements an assembly of different evolutionary models, which allow for statistical testing of the hypothesis that a protein has undergone positive selection. Specifically, the recently developed mechanisticempirical model is introduced, which takes into account the physicochemical properties of amino acids. Advanced options were introduced to allow maximal fine tuning of the server to the user's specific needs, including calculation of statistical support of the ω values, an advanced graphic display of the protein's 3-dimensional structure, use of different genetic codes and inputting of a pre-built phylogenetic tree. Selecton version 2.2 is an effective, user-friendly and freely available web server which implements up-to-date methods for computing site-specific selection forces, and the visualization of these forces on the protein's sequence and structure. © 2007 The Author(s).",
                "authors": [
                    {
                        "name": "Stern A."
                    },
                    {
                        "name": "Doron-Faigenboim A."
                    },
                    {
                        "name": "Erez E."
                    },
                    {
                        "name": "Martz E."
                    },
                    {
                        "name": "Bacharach E."
                    },
                    {
                        "name": "Pupko T."
                    }
                ],
                "citationCount": 222,
                "date": "2007-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Selecton 2007: Advanced models for detecting positive and purifying selection using a Bayesian inference approach"
            },
            "pmid": "17586822"
        },
        {
            "metadata": {
                "abstract": "Summary: We present an algorithmic tool for the identification of biologically significant amino acids in proteins of known three dimensional structure. We estimate the degree of purifying selection and positive Darwinian selection at each site and project these estimates onto the molecular surface of the protein. Thus, patches of functional residues (undergoing either positive or purifying selection), which may be discontinuous in the linear sequence, are revealed. We test for the statistical significance of the site-specific scores in order to obtain reliable and valid estimates. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Doron-Faigenboim A."
                    },
                    {
                        "name": "Stern A."
                    },
                    {
                        "name": "Mayrose I."
                    },
                    {
                        "name": "Bacharach E."
                    },
                    {
                        "name": "Pupko T."
                    }
                ],
                "citationCount": 111,
                "date": "2005-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Selection: A server for detecting evolutionary forces at a single amino-acid site"
            },
            "pmid": "15647294"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}