{
    "additionDate": "2020-01-14T09:51:06Z",
    "biotoolsCURIE": "biotools:Notch",
    "biotoolsID": "Notch",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nevouri@tau.ac.il",
            "name": "Uri Nevo",
            "typeEntity": "Person"
        }
    ],
    "description": "Modelling cell surface dynamics and cell-cell interactions using Cell Studio.\n\nA Notch-Delta receptor binding process agent-based model using Unity 3D.\n\nThe simulation was built and tested on Unity version 4.6.1, which is freely available for download at https://unity3d.com/get-unity/download/archive. To use the simulation, download the repository from GitHub, save it to a new folder (e.g. notch-delta-model), and create a project in Unity by clicking “create a new project” and select that folder (it should contain only the Assets folder and the readme file). Do not import any package. Then, load one of the scenes in the Assets folder by double clicking it.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                }
            ]
        }
    ],
    "homepage": "https://github.com/asafl/NotchDelta",
    "language": [
        "C#"
    ],
    "lastUpdate": "2021-01-04T08:55:53Z",
    "name": "Notch",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1098/RSIF.2019.0264",
            "metadata": {
                "abstract": "© 2019 The Author(s) Published by the Royal Society. All rights reserved.Predictive modelling of complex biological systems and biophysical interactions requires the inclusion of multiple nano- and micro-scale events. In many scenarios, however, numerical solutions alone do not necessarily enhance the understanding of the system. Instead, this work explores the use of an agent-based model with visualization capabilities to elucidate interactions between single cells. We present a model of juxtacrine signalling, using Cell Studio, an agent-based modelling system, based on gaming and three-dimensional visualization tools. The main advantages of the system are its ability to apply any cell geometry and to dynamically visualize the diffusion and interactions of the molecules within the cells in real time. These provide an excellent tool for obtaining insight about different biological scenarios, as the user may view the dynamics of a system and observe its emergent behaviour as it unfolds. The agent-based model was validated against the results of a mean-field model of Notch receptors and ligands in two neighbouring cells. The conversion to an agent-based model is described in detail. To demonstrate the advantages of the model, we further created a filopodium-mediated signalling model. Our model revealed that diffusion and endocytosis alone are insufficient to produce significant signalling in a filopodia scenario. This is due to the bottleneck at the cell–filopodium contact region and the long distance to the end of the filopodium. However, allowing active transport of ligands into filopodia enhances the signalling significantly compared with a face-to-face scenario. We conclude that the agent-based approach can provide insights into mechanisms underlying cell signalling. The open-source model can be found in the Internet hosting service GitHub.",
                "authors": [
                    {
                        "name": "Liberman A."
                    },
                    {
                        "name": "Mussel M."
                    },
                    {
                        "name": "Kario D."
                    },
                    {
                        "name": "Sprinzak D."
                    },
                    {
                        "name": "Nevo U."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Journal of the Royal Society Interface",
                "title": "Modelling cell surface dynamics and cell–cell interactions using Cell Studio: A three-dimensional visualization tool based on gaming technology"
            },
            "pmcid": "PMC6893490",
            "pmid": "31771451"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}