{
    "additionDate": "2021-01-18T11:57:35Z",
    "biotoolsCURIE": "biotools:rmea",
    "biotoolsID": "rmea",
    "confidence_flag": "tool",
    "description": "An R package to assess nonverbal synchronization in motion energy analysis time-series.\n\nThe goal of rMEA is to provide a suite of tools useful to read, visualize and export bivariate Motion Energy time-series. Lagged synchrony between subjects can be analyzed through windowed cross-correlation. Surrogate data generation allows an estimation of pseudosynchrony that helps to estimate the effect size of the observed synchronization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kleinbub/rMEA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-06T18:04:43Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/kleinbub/rMEA/issues"
        }
    ],
    "name": "rMEA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1080/10503307.2020.1844334",
            "metadata": {
                "abstract": "© 2020 Society for Psychotherapy Research.Introduction. Motion Energy Analysis (MEA) is a procedure that allows to automatically assess the amount of persons’ movement from video recordings. Recent studies used MEA to investigate nonverbal synchrony, i.e., the occurrence of simultaneous movement, suggesting the existence of an association with relationship quality. In patient-therapist dyads, synchrony predicted therapeutic alliance, empathy, as well as treatment outcome. Package description. The article presents rMEA, an open-source R package that allows to import, filter, and visualize dyadic time-series of nonverbal behaviour generated by other MEA software. The package includes a fast, state-of-the-art, moving window cross-correlation algorithm with lag analysis, which provides a user-friendly interface for the assessment of nonverbal synchrony. Through the analysis of a motivating example (40 psychotherapy intake interviews split between dropouts and good cases) the article provides an in-depth description of the package main functions and a tutorial for a typical analysis in this field, requiring only the most basic knowledge of the R language and environment. The rich visualization capabilities of the software provide powerful tools for the various steps involved in the diagnostics, analysis, interpretation and publication of these data. Conclusions. Overall, the paper aims to empower psychotherapy researchers and other interaction scientists to investigate nonverbal synchrony in their own dyads.",
                "authors": [
                    {
                        "name": "Kleinbub J.R."
                    },
                    {
                        "name": "Ramseyer F.T."
                    }
                ],
                "citationCount": 4,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Psychotherapy Research",
                "title": "rMEA: An R package to assess nonverbal synchronization in motion energy analysis time-series"
            },
            "pmid": "33225873"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}