{
    "additionDate": "2019-11-14T18:23:36Z",
    "biotoolsCURIE": "biotools:FTAlign",
    "biotoolsID": "FTAlign",
    "confidence_flag": "tool",
    "description": "Topology-independent and global protein structure alignment through an FFT-based algorithm | Fast topology-independent and global structure alignment through an FFT-based algorithm",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Global structure alignment",
                    "uri": "http://edamontology.org/operation_0510"
                },
                {
                    "term": "Local structure alignment",
                    "uri": "http://edamontology.org/operation_0509"
                },
                {
                    "term": "Pairwise structure alignment",
                    "uri": "http://edamontology.org/operation_0503"
                }
            ]
        }
    ],
    "homepage": "http://huanglab.phys.hust.edu.cn/ftalign/",
    "lastUpdate": "2020-12-29T12:13:48Z",
    "name": "FTAlign",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ609",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Protein structure alignment is one of the fundamental problems in computational structure biology. A variety of algorithms have been developed to address this important issue in the past decade. However, due to their heuristic nature, current structure alignment methods may suffer from suboptimal alignment and/or over-fragmentation and thus lead to a biologically wrong alignment in some cases. To overcome these limitations, we have developed an accurate topology-independent and global structure alignment method through an FFT-based exhaustive search algorithm, which is referred to as FTAlign. Results: Our FTAlign algorithm was extensively tested on six commonly used datasets and compared with seven state-of-the-art structure alignment approaches, TMalign, DeepAlign, Kpax, 3DCOMB, MICAN, SPalignNS and CLICK. It was shown that FTAlign outperformed the other methods in reproducing manually curated alignments and obtained a high success rate of 96.7 and 90.0% on two gold-standard benchmarks, MALIDUP and MALISAM, respectively. Moreover, FTAlign also achieved the overall best performance in terms of biologically meaningful structure overlap (SO) and TMscore on both the sequential alignment test sets including MALIDUP, MALISAM and 64 difficult cases from HOMSTRAD, and the non-sequential sets including MALIDUP-NS, MALISAM-NS, 199 topology-different cases, where FTAlign especially showed more advantage for non-sequential alignment. Despite its global search feature, FTAlign is also computationally efficient and can normally complete a pairwise alignment within one second.",
                "authors": [
                    {
                        "name": "He J."
                    },
                    {
                        "name": "Huang S.-Y."
                    },
                    {
                        "name": "Wen Z."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Topology-independent and global protein structure alignment through an FFT-based algorithm"
            },
            "pmid": "31384919"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ],
    "validated": 1
}
