{
    "additionDate": "2021-01-18T09:16:11Z",
    "biotoolsCURIE": "biotools:dctl",
    "biotoolsID": "dctl",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangyang07@hit.edu.cn",
            "name": "Yang Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "A method utilizing deep cycle transfer learning (DCTL) in order to detect apicomplexan parasites, by utilizing deep learning-based microscopic image analysis. DCTL is based on observations of parasitologists that Toxoplasma is banana-shaped, Plasmodium is generally ring-shaped, and Babesia is typically pear-shaped.\n\nParasitologist-level classification of apicomplexan parasites and host cell with deep cycle transfer learning (DCTL).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Microscope image visualisation",
                    "uri": "http://edamontology.org/operation_3552"
                }
            ]
        }
    ],
    "homepage": "https://github.com/senli2018/DCTL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-22T16:01:03Z",
    "name": "DCTL",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA513",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved.Motivation: Apicomplexan parasites, including Toxoplasma, Plasmodium and Babesia, are important pathogens that affect billions of humans and animals worldwide. Usually a microscope is used to detect these parasites, but it is difficult to use microscopes and clinician requires to be trained. Finding a cost-effective solution to detect these parasites is of particular interest in developing countries, in which infection is more common. Results: Here, we propose an alternative method, deep cycle transfer learning (DCTL), to detect apicomplexan parasites, by utilizing deep learning-based microscopic image analysis. DCTL is based on observations of parasitologists that Toxoplasma is banana-shaped, Plasmodium is generally ring-shaped, and Babesia is typically pear-shaped. Our approach aims to connect those microscopic objects (Toxoplasma, Plasmodium, Babesia and erythrocyte) with their morphological similar macro ones (banana, ring, pear and apple) through a cycle transfer of knowledge. In the experiments, we conduct DCTL on 24 358 microscopic images of parasites. Results demonstrate high accuracy and effectiveness of DCTL, with an average accuracy of 95.7% and an area under the curve of 0.995 for all parasites types. This article is the first work to apply knowledge from parasitologists to apicomplexan parasite recognition, and it opens new ground for developing AI-powered microscopy image diagnostic systems. Availability and implementation: Code and dataset available at https://github.com/senli2018/DCTL. Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Cortes-Vecino J.A."
                    },
                    {
                        "name": "Jiang H."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Yang Q."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 4,
                "date": "2020-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Parasitologist-level classification of apicomplexan parasites and host cell with deep cycle transfer learning (DCTL)"
            },
            "pmid": "32413103"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Infectious disease",
            "uri": "http://edamontology.org/topic_3324"
        },
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        }
    ]
}
