{
    "additionDate": "2022-11-08T08:15:58.467076Z",
    "biotoolsCURIE": "biotools:krishi",
    "biotoolsID": "krishi",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "barah@tezu.ernet.in",
            "name": "Pankaj Barah",
            "orcidid": "http://orcid.org/0000-0001-7039-7996",
            "typeEntity": "Person"
        },
        {
            "name": "Akash Das"
        }
    ],
    "description": "Knowledgebase for rice sheath blight information (KRiShI) is a manually curated user-friendly knowledgebase for rice sheath blight (SB) disease that allows users to efficiently mine, visualize, search, benchmark, download, and update meaningful data and information related to SB using its easy and interactive interface.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://www.tezu.ernet.in/krishi",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2022-11-08T08:15:58.469562Z",
    "license": "Other",
    "name": "KRiShI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S10142-022-00899-9",
            "metadata": {
                "abstract": "© 2022, The Author(s), under exclusive licence to Springer-Verlag GmbH Germany, part of Springer Nature.Knowledgebase for rice sheath blight information (KRiShI) is a manually curated user-friendly knowledgebase for rice sheath blight (SB) disease that allows users to efficiently mine, visualize, search, benchmark, download, and update meaningful data and information related to SB using its easy and interactive interface. KRiShI collects and integrates widely scattered and unstructured information from various scientific literatures, stores it under a single window, and makes it available to the community in a user-friendly manner. From basic information, best management practices, host resistance, differentially expressed genes, proteins, metabolites, resistance genes, pathways, and OMICS scale experiments, KRiShI presents these in the form of easy and comprehensive tables, diagrams, and pictures. The “Search” tab allows users to verify if their input rice gene id(s) are Rhizoctonia solani (R. solani) responsive and/or resistant. KRiShI will serve as a valuable resource for easy and quick access to data and information related to rice SB disease for both the researchers and the farmers. To encourage community curation a submission facility is made available. KRiShI can be found at http://www.tezu.ernet.in/krishi.",
                "authors": [
                    {
                        "name": "Barah P."
                    },
                    {
                        "name": "Das A."
                    },
                    {
                        "name": "Kashyap A."
                    },
                    {
                        "name": "Mishra A."
                    },
                    {
                        "name": "Naika M.B.N."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Functional and Integrative Genomics",
                "title": "“KRiShI”: a manually curated knowledgebase on rice sheath blight disease"
            },
            "pmid": "36109405"
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
