{
    "name": "WIFA", 
    "description": "Wavelet-based Identification of DNA focal genomic aberrations. Integrates array CGH data sets from multiple cancer samples and detects consistent aberrations across multiple samples.", 
    "homepage": "http://www.gcancer.org/wifa/WIFA.html", 
    "biotoolsID": "wifa", 
    "biotoolsCURIE": "biotools:wifa", 
    "version": [
        "20110617"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2495", 
                    "term": "Microarray data analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "MATLAB"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/wifa-20110617-wavelet-based-identification-of-dna-focal-genomic-aberrations.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-146", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Wavelet-based identification of DNA focal genomic aberrations from single nucleotide polymorphism arrays", 
                "abstract": "Background: Copy number aberrations (CNAs) are an important molecular signature in cancer initiation, development, and progression. However, these aberrations span a wide range of chromosomes, making it hard to distinguish cancer related genes from other genes that are not closely related to cancer but are located in broadly aberrant regions. With the current availability of high-resolution data sets such as single nucleotide polymorphism (SNP) microarrays, it has become an important issue to develop a computational method to detect driving genes related to cancer development located in the focal regions of CNAs.Results: In this study, we introduce a novel method referred to as the wavelet-based identification of focal genomic aberrations (WIFA). The use of the wavelet analysis, because it is a multi-resolution approach, makes it possible to effectively identify focal genomic aberrations in broadly aberrant regions. The proposed method integrates multiple cancer samples so that it enables the detection of the consistent aberrations across multiple samples. We then apply this method to glioblastoma multiforme and lung cancer data sets from the SNP microarray platform. Through this process, we confirm the ability to detect previously known cancer related genes from both cancer types with high accuracy. Also, the application of this approach to a lung cancer data set identifies focal amplification regions that contain known oncogenes, though these regions are not reported using a recent CNAs detecting algorithm GISTIC: SMAD7 (chr18q21.1) and FGF10 (chr5p12).Conclusions: Our results suggest that WIFA can be used to reveal cancer related genes in various cancer data sets. © 2011 Hur and Lee; licensee BioMed Central Ltd.", 
                "date": "2011-05-11T00:00:00Z", 
                "citationCount": 11, 
                "authors": [
                    {
                        "name": "Hur Y."
                    }, 
                    {
                        "name": "Lee H."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://combio.gist.ac.kr/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:14:14Z", 
    "lastUpdate": "2018-12-10T12:58:58Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}