{
    "additionDate": "2020-01-14T09:19:27Z",
    "biotoolsCURIE": "biotools:ORCAE-AOCC",
    "biotoolsID": "ORCAE-AOCC",
    "confidence_flag": "high",
    "description": "A Centralized Portal for the Annotation of African Orphan Crop Genomes.\n\nOnline Resource for Community Annotation of Eukaryotes.\n\nORCAE is an online genome curation and browsing portal for several eukaryotic species.\n\nCommunity Annotation of Eukaryotes.\n\nORCAE is an online genome annotation resource offering users the necessary tools and information to validate and correct gene annotations. The system is build on the wiki philosophy, all modifications to a certain gene are stored and can be found back in the annotation history of that gene. To be able to modify genes however you will need to have a user account. Anonymous users can browse the public genomes but don't have editing rights.\n\nNutrition is at the core of AOCC.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/limani (PSB.UGENT.BE), bio.tools/orcae (BIOINFORMATICS.PSB.UGENT.BE/orcae ; PSB.UGENT.BE/orcae), bio.tools/cornet_arabidopsis (PSB.UGENT.BE)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://bioinformatics.psb.ugent.be/orcae/",
    "lastUpdate": "2020-01-14T09:19:27Z",
    "link": [
        {
            "type": "Other",
            "url": "https://bioinformatics.psb.ugent.be/orcae/aocc/"
        }
    ],
    "name": "ORCAE-AOCC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/GENES10120950",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.ORCAE (Online Resource for Community Annotation of Eukaryotes) is a public genome annotation curation resource. ORCAE-AOCC is a branch that is dedicated to the genomes published as part of the African Orphan Crops Consortium (AOCC). The motivation behind the development of the ORCAE platform was to create a knowledge-based website where the research-community can make contributions to improve genome annotations. All changes to any given gene-model or gene description are stored, and the entire annotation history can be retrieved. Genomes can either be set to “public” or “restricted” mode; anonymous users can browse public genomes but cannot make any changes. Aside from providing a user-friendly interface to view genome annotations, the platform also includes tools and information (such as gene expression evidence) that enables authorized users to edit and validate genome annotations. The ORCAE-AOCC platform will enable various stakeholders from around the world to coordinate their efforts to annotate and study underutilized crops.",
                "authors": [
                    {
                        "name": "Yssel A.E.J."
                    },
                    {
                        "name": "Kao S.-M."
                    },
                    {
                        "name": "Van de Peer Y."
                    },
                    {
                        "name": "Sterck L."
                    }
                ],
                "date": "2019-12-01T00:00:00Z",
                "journal": "Genes",
                "title": "ORCAE-AOCC: A centralized portal for the annotation of african orphan crop genomes"
            },
            "pmid": "31757073"
        }
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        }
    ]
}