{
    "additionDate": "2016-05-17T10:17:54Z",
    "biotoolsCURIE": "biotools:my_forensic_loci_queries",
    "biotoolsID": "my_forensic_loci_queries",
    "collectionID": [
        "BIG N2N",
        "UGent"
    ],
    "credit": [
        {
            "name": "ugent.be",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "dieter.deforce@ugent.be",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analysis of forensic DNA profiles.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/beukueb/myflq"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        },
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Variant pattern analysis",
                    "uri": "http://edamontology.org/operation_3504"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Gene report",
                        "uri": "http://edamontology.org/data_0916"
                    }
                },
                {
                    "data": {
                        "term": "Image",
                        "uri": "http://edamontology.org/data_2968"
                    }
                }
            ]
        }
    ],
    "homepage": "https://github.com/beukueb/myflq",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "My Forensic Loci queries",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Katrijn.Vannerum@ugent.be",
    "publication": [
        {
            "doi": "10.1016/j.fsigen.2013.10.012",
            "metadata": {
                "abstract": "Forensic scientists are currently investigating how to transition from capillary electrophoresis (CE) to massive parallel sequencing (MPS) for analysis of forensic DNA profiles. MPS offers several advantages over CE such as virtually unlimited multiplexy of loci, combining both short tandem repeat (STR) and single nucleotide polymorphism (SNP) loci, small amplicons without constraints of size separation, more discrimination power, deep mixture resolution and sample multiplexing. We present our bioinformatic framework My-Forensic-Loci-queries (MyFLq) for analysis of MPS forensic data. For allele calling, the framework uses a MySQL reference allele database with automatically determined regions of interest (ROIs) by a generic maximal flanking algorithm which makes it possible to use any STR or SNP forensic locus. Python scripts were designed to automatically make allele calls starting from raw MPS data. We also present a method to assess the usefulness and overall performance of a forensic locus with respect to MPS, as well as methods to estimate whether an unknown allele, which sequence is not present in the MySQL database, is in fact a new allele or a sequencing error. The MyFLq framework was applied to an Illumina MiSeq dataset of a forensic Illumina amplicon library, generated from multilocus STR polymerase chain reaction (PCR) on both single contributor samples and multiple person DNA mixtures. Although the multilocus PCR was not yet optimized for MPS in terms of amplicon length or locus selection, the results show excellent results for most loci. The results show a high signal-to-noise ratio, correct allele calls, and a low limit of detection for minor DNA contributors in mixed DNA samples. Technically, forensic MPS affords great promise for routine implementation in forensic genomics. The method is also applicable to adjacent disciplines such as molecular autopsy in legal medicine and in mitochondrial DNA research. © 2013 The Authors. Published by Elsevier Ireland Ltd. All rights reserved.",
                "authors": [
                    {
                        "name": "Van Neste C."
                    },
                    {
                        "name": "Vandewoestyne M."
                    },
                    {
                        "name": "Van Criekinge W."
                    },
                    {
                        "name": "Deforce D."
                    },
                    {
                        "name": "Van Nieuwerburgh F."
                    }
                ],
                "citationCount": 50,
                "date": "2014-03-01T00:00:00Z",
                "journal": "Forensic Science International: Genetics",
                "title": "My-Forensic-Loci-queries (MyFLq) framework for analysis of forensic STR data generated by massive parallel sequencing"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "validated": 1,
    "version": [
        "1.1"
    ]
}