{
    "additionDate": "2021-01-18T10:06:40Z",
    "biotoolsCURIE": "biotools:scfa",
    "biotoolsID": "scfa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tinn@unr.edu",
            "name": "Tin Nguyen",
            "typeEntity": "Person"
        }
    ],
    "description": "A Novel Method for Cancer Subtyping and Risk Prediction Using Consensus Factor Analysis.\n\nSubtyping via Consensus Factor Analysis (SCFA) can efficiently remove noisy signals from consistent molecular patterns in order to reliably identify cancer subtypes and accurately predict risk scores of patients.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Consensus tree construction",
                    "uri": "http://edamontology.org/operation_0555"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                }
            ]
        }
    ],
    "homepage": "http://scfa.tinnguyen-lab.com",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T17:47:40Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/duct317/SCFA"
        }
    ],
    "name": "SCFA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FONC.2020.01052",
            "metadata": {
                "abstract": "© 2020 Tran, Nguyen, Le, Bebis, Luu and Nguyen.Cancer is an umbrella term that includes a range of disorders, from those that are fast-growing and lethal to indolent lesions with low or delayed potential for progression to death. One critical unmet challenge is that molecular disease subtypes characterized by relevant clinical differences, such as survival, are difficult to differentiate. With the advancement of multi-omics technologies, subtyping methods have shifted toward data integration in order to differentiate among subtypes from a holistic perspective that takes into consideration phenomena at multiple levels. However, these integrative methods are still limited by their statistical assumption and their sensitivity to noise. In addition, they are unable to predict the risk scores of patients using multi-omics data. Here, we present a novel approach named Subtyping via Consensus Factor Analysis (SCFA) that can efficiently remove noisy signals from consistent molecular patterns in order to reliably identify cancer subtypes and accurately predict risk scores of patients. In an extensive analysis of 7,973 samples related to 30 cancers that are available at The Cancer Genome Atlas (TCGA), we demonstrate that SCFA outperforms state-of-the-art approaches in discovering novel subtypes with significantly different survival profiles. We also demonstrate that SCFA is able to predict risk scores that are highly correlated with true patient survival and vital status. More importantly, the accuracy of subtype discovery and risk prediction improves when more data types are integrated into the analysis. The SCFA software and TCGA data packages will be available on Bioconductor.",
                "authors": [
                    {
                        "name": "Tran D."
                    },
                    {
                        "name": "Nguyen H."
                    },
                    {
                        "name": "Le U."
                    },
                    {
                        "name": "Bebis G."
                    },
                    {
                        "name": "Luu H.N."
                    },
                    {
                        "name": "Nguyen T."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Frontiers in Oncology",
                "title": "A novel method for cancer subtyping and risk prediction using consensus factor analysis"
            },
            "pmcid": "PMC7344292",
            "pmid": "32714868"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}