{
    "additionDate": "2021-01-18T08:02:26Z",
    "biotoolsCURIE": "biotools:brainnetclass",
    "biotoolsID": "brainnetclass",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hanzhang@med.unc.edu",
            "name": "Han Zhang",
            "orcidid": "https://orcid.org/0000-0002-6645-8810",
            "typeEntity": "Person"
        },
        {
            "email": "dgshen@med.unc.edu",
            "name": "Dinggang Shen",
            "typeEntity": "Person"
        },
        {
            "email": "gpan@zju.edu.cn",
            "name": "Gang Pan",
            "typeEntity": "Person"
        }
    ],
    "description": "Brain Network Construction and Classification (BrainNetClass) toolbox to promote more advanced brain network construction methods to the filed, including some state‐of‐the‐art methods that were recently developed to capture complex and high‐order interactions among brain regions. The toolbox also integrates a well‐accepted and rigorous classification framework based on brain connectome features toward individualized disease diagnosis in a hope that the advanced network modeling could boost the subsequent classification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zzstefan/BrainNetClass",
    "language": [
        "C",
        "C++",
        "Java",
        "MATLAB"
    ],
    "lastUpdate": "2021-02-06T16:43:29Z",
    "name": "BrainNetClass",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1002/HBM.24979",
            "metadata": {
                "abstract": "© 2020 The Authors. Human Brain Mapping published by Wiley Periodicals, Inc.Brain functional network has been increasingly used in understanding brain functions and diseases. While many network construction methods have been proposed, the progress in the field still largely relies on static pairwise Pearson's correlation-based functional network and group-level comparisons. We introduce a “Brain Network Construction and Classification (BrainNetClass)” toolbox to promote more advanced brain network construction methods to the filed, including some state-of-the-art methods that were recently developed to capture complex and high-order interactions among brain regions. The toolbox also integrates a well-accepted and rigorous classification framework based on brain connectome features toward individualized disease diagnosis in a hope that the advanced network modeling could boost the subsequent classification. BrainNetClass is a MATLAB-based, open-source, cross-platform toolbox with both graphical user-friendly interfaces and a command line mode targeting cognitive neuroscientists and clinicians for promoting reliability, reproducibility, and interpretability of connectome-based, computer-aided diagnosis. It generates abundant classification-related results from network presentations to contributing features that have been largely ignored by most studies to grant users the ability of evaluating the disease diagnostic model and its robustness and generalizability. We demonstrate the effectiveness of the toolbox on real resting-state functional MRI datasets. BrainNetClass (v1.0) is available at https://github.com/zzstefan/BrainNetClass.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Hu D."
                    },
                    {
                        "name": "Pan G."
                    },
                    {
                        "name": "Qiao L."
                    },
                    {
                        "name": "Shen D."
                    },
                    {
                        "name": "Yap P.-T."
                    },
                    {
                        "name": "Yu R."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhou Z."
                    }
                ],
                "citationCount": 8,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Human Brain Mapping",
                "title": "A toolbox for brain network construction and classification (BrainNetClass)"
            },
            "pmcid": "PMC7294070",
            "pmid": "32163221"
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
