{
    "additionDate": "2024-06-18T20:16:41.539123Z",
    "biotoolsCURIE": "biotools:bdm",
    "biotoolsID": "bdm",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xinqigong@ruc.edu.cn",
            "name": "Xinqi Gong",
            "typeEntity": "Person"
        }
    ],
    "description": "An assessment metric for protein complex structure models based on distance difference matrix.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ]
        }
    ],
    "homepage": "http://mialab.ruc.edu.cn/BDMServer/",
    "lastUpdate": "2024-06-18T20:16:41.541284Z",
    "name": "BDM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/s12539-024-00622-1",
            "metadata": {
                "abstract": "Abstract: Protein complex structure prediction is an important problem in computational biology. While significant progress has been made for protein monomers, accurate evaluation of protein complexes remains challenging. Existing assessment methods in CASP, lack dedicated metrics for evaluating complexes. DockQ, a widely used metric, has some limitations. In this study, we propose a novel metric called BDM (Based on Distance difference Matrix) for assessing protein complex prediction structures. Our approach utilizes a distance difference matrix derived from comparing real and predicted protein structures, establishing a linear correlation with Root Mean Square Deviation (RMSD). BDM overcomes limitations associated with receptor-ligand differentiation and eliminates the requirement for structure alignment, making it a more effective and efficient metric. Evaluation of BDM using CASP14 and CASP15 test sets demonstrates superior performance compared to the official CASP scoring. BDM provides accurate and reasonable assessments of predicted protein complexes, wide adoption of BDM has the potential to advance protein complex structure prediction and facilitate related researches across scientific domains. Code is available at http://mialab.ruc.edu.cn/BDMServer/. Graphical Abstract: (Figure presented.).",
                "authors": [
                    {
                        "name": "Gong X."
                    },
                    {
                        "name": "Lu D."
                    },
                    {
                        "name": "Sun D."
                    },
                    {
                        "name": "Wang W."
                    },
                    {
                        "name": "Zhai J."
                    },
                    {
                        "name": "Zhao R."
                    }
                ],
                "date": "2024-01-01T00:00:00Z",
                "journal": "Interdisciplinary Sciences - Computational Life Sciences",
                "title": "BDM: An Assessment Metric for Protein Complex Structure Models Based on Distance Difference Matrix"
            },
            "pmid": "38536590"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ]
}
