{
    "additionDate": "2018-05-12T10:40:27Z",
    "biotoolsCURIE": "biotools:psionplus",
    "biotoolsID": "psionplus",
    "credit": [
        {
            "email": "lkurgan@vcu.edu",
            "name": "Lukasz Kurgan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Accurate Sequence-Based Predictor of Ion Channels and Their Types.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://sourceforge.net/p/psion/wiki/Home/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/psion/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "PSIONplus",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0152964",
            "metadata": {
                "abstract": "© 2016 Gao et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Ion channels are a class of membrane proteins that attracts a significant amount of basic research, also being potential drug targets. High-throughput identification of these channels is hampered by the low levels of availability of their structures and an observation that use of sequence similarity offers limited predictive quality. Consequently, several machine learning predictors of ion channels from protein sequences that do not rely on high sequence similarity were developed. However, only one of these methods offers a wide scope by predicting ion channels, their types and four major subtypes of the voltage-gated channels. Moreover, this and other existing predictors utilize relatively simple predictive models that limit their accuracy.We propose a novel and accurate predictor of ion channels, their types and the four subtypes of the voltage-gated channels called PSIONplus. Our method combines a support vector machine model and a sequence similarity search with BLAST. The originality of PSIONplus stems from the use of a more sophisticated machine learning model that for the first time in this area utilizes evolutionary profiles and predicted secondary structure, solvent accessibility and intrinsic disorder. We empirically demonstrate that the evolutionary profiles provide the strongest predictive input among new and previously used input types.We also show that all new types of inputs contribute to the prediction. Results on an independent test dataset reveal that PSIONplus obtains relatively good predictive performance and outperforms existing methods. It secures accuracies of 85.4% and 68.3%for the prediction of ion channels and their types, respectively, and the average accuracy of 96.4% for the discrimination of the four ion channel subtypes. Standalone version of PSIONplus is freely available from https://sourceforge.net/projects/psion/.",
                "authors": [
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Cui W."
                    },
                    {
                        "name": "Sheng Y."
                    },
                    {
                        "name": "Ruan J."
                    },
                    {
                        "name": "Kurgan L."
                    }
                ],
                "citationCount": 8,
                "date": "2016-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PSIONplus: Accurate sequence-based predictor of ion channels and their types"
            },
            "pmcid": "PMC4820270",
            "pmid": "27044036"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}