
{
    "credit": [
        {
            "name": "Contact Form",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://feedback.wishartlab.com/?site=Preditor"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://wishart.biology.ualberta.ca/shiftor/help/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein sequence analysis",
                    "uri": "http://edamontology.org/operation_2479"
                },
                {
                    "term": "Protein geometry calculation",
                    "uri": "http://edamontology.org/operation_0249"
                },
                {
                    "term": "Protein geometry validation",
                    "uri": "http://edamontology.org/operation_1844"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python",
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "NMR",
                "uri": "http://edamontology.org/topic_0593"
            },
            {
                "term": "MRI",
                "uri": "http://edamontology.org/topic_3444"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Protein modifications",
                "uri": "http://edamontology.org/topic_0601"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Every year between 500 and 1000 peptide and protein structures are determined by NMR and deposited into the Protein Data Bank. However, the process of NMR structure determination continues to be a manually intensive and time-consuming task. One of the most tedious and error-prone aspects of this process involves the determination of torsion angle restraints including phi, psi, omega and chi angles. Most methods require many days of additional experiments, painstaking measurements or complex calculations. Here we wish to describe a web server, called PREDITOR, which greatly accelerates and simplifies this task. PREDITOR accepts sequence and/or chemical shift data as input and generates torsion angle predictions (with predicted errors) for phi, psi, omega and chi-1 angles. PREDITOR combines sequence alignment methods with advanced chemical shift analysis techniques to generate its torsion angle predictions. The method is fast (<40 s per protein) and accurate, with 88% of phi/psi predictions being within 30° of the correct values, 84% of chi-1 predictions being correct and 99.97% of omega angles being correct. PREDITOR is 35 times faster and up to 20% more accurate than any existing method. PREDITOR also provides accurate assessments of the torsion angle errors so that the torsion angle constraints can be readily fed into standard structure refinement programs, such as CNS, XPLOR, AMBER and CYANA. Other unique features to PREDITOR include dihedral angle prediction via PDB structure mapping, automated chemical shift re-referencing (to improve accuracy), prediction of proline cis/trans states and a simple user interface. © The Author 2006. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Berjanskii M.V.",
                "Neal S.",
                "Wishart D.S."
            ],
            "cit_count": 138,
            "journal": "Nucleic Acids Research",
            "pmid": "16845087",
            "title": "PREDITOR: A web server for predicting protein torsion angle restraints",
            "year": "2006-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:preditor",
        "biotoolsID": "preditor",
        "description": "PREDITOR predicts torsion angles in proteins from NMR chemical shift data and sequence homology.  PREDITOR combines sequence alignment methods with advanced chemical shift analysis techniques to generate its torsion angle predictions.",
        "homepage": "http://wishart.biology.ualberta.ca/shiftor/cgi-bin/preditor_current.py",
        "name": "PREDITOR"
    }
}