{
    "additionDate": "2021-01-18T10:53:58Z",
    "biotoolsCURIE": "biotools:nutil",
    "biotoolsID": "nutil",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "j.g.bjaalie@medisin.uio.no",
            "name": "Jan G. Bjaalie",
            "typeEntity": "Person"
        },
        {
            "email": "m.a.puchades@medisin.uio.no",
            "name": "Maja A. Puchades",
            "typeEntity": "Person"
        }
    ],
    "description": "A Pre- and Post-processing Toolbox for Histological Rodent Brain Section Images.\n\nNutil aims to both simplify and streamline the mechanism of pre-and-post processing 2D brain image data from mouse and rat.\n\nNutil simplifies and streamlines the pre-and-post processing of 2D brain image data from mouse and rat.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.nitrc.org/projects/nutil/",
    "language": [
        "C",
        "C#",
        "C++"
    ],
    "lastUpdate": "2021-03-18T10:05:07Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://www.humanbrainproject.eu"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://www.nitrc.org/projects/nutil/2"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/leuat/nutil/"
        }
    ],
    "name": "Nutil",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.3389/FNINF.2020.00037",
            "metadata": {
                "abstract": "© Copyright © 2020 Groeneboom, Yates, Puchades and Bjaalie.With recent technological advances in microscopy and image acquisition of tissue sections, further developments of tools are required for viewing, transforming, and analyzing the ever-increasing amounts of high-resolution data produced. In the field of neuroscience, histological images of whole rodent brain sections are commonly used for investigating brain connections as well as cellular and molecular organization in the normal and diseased brain, but present a problem for the typical neuroscientist with no or limited programming experience in terms of the pre- and post-processing steps needed for analysis. To meet this need we have designed Nutil, an open access and stand-alone executable software that enables automated transformations, post-processing, and analyses of 2D section images using multi-core processing (OpenMP). The software is written in C++ for efficiency, and provides the user with a clean and easy graphical user interface for specifying the input and output parameters. Nutil currently contains four separate tools: (1) A transformation toolchain named “Transform” that allows for rotation, mirroring and scaling, resizing, and renaming of very large tiled tiff images. (2) “TiffCreator” enables the generation of tiled TIFF images from other image formats such as PNG and JPEG. (3) A “Resize” tool completes the preprocessing toolset and allows downscaling of PNG and JPEG images with output in PNG format. (4) The fourth tool is a post-processing method called “Quantifier” that enables the quantification of segmented objects in the context of regions defined by brain atlas maps generated with the QuickNII software based on a 3D reference atlas (mouse or rat). The output consists of a set of report files, point cloud coordinate files for visualization in reference atlas space, and reference atlas images superimposed with color-coded objects. The Nutil software is made available by the Human Brain Project (https://www.humanbrainproject.eu) at https://www.nitrc.org/projects/nutil/.",
                "authors": [
                    {
                        "name": "Bjaalie J.G."
                    },
                    {
                        "name": "Groeneboom N.E."
                    },
                    {
                        "name": "Puchades M.A."
                    },
                    {
                        "name": "Yates S.C."
                    }
                ],
                "citationCount": 3,
                "date": "2020-08-21T00:00:00Z",
                "journal": "Frontiers in Neuroinformatics",
                "title": "Nutil: A Pre- and Post-processing Toolbox for Histological Rodent Brain Section Images"
            },
            "pmcid": "PMC7472695",
            "pmid": "32973479"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
