{
    "additionDate": "2019-11-14T18:41:47Z",
    "biotoolsCURIE": "biotools:catkern",
    "biotoolsID": "catkern",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "elies.ramon@cragenomica.es",
            "name": "Elies Ramon",
            "orcidid": "https://orcid.org/0000-0002-7953-8115",
            "typeEntity": "Person"
        }
    ],
    "description": "HIV drug resistance prediction with weighted categorical kernel functions | BACKGROUND:Antiretroviral drugs are a very effective therapy against HIV infection. However, the high mutation rate of HIV permits the emergence of variants that can be resistant to the drug treatment. Predicting drug resistance to previously unobserved variants is therefore very important for an optimum medical treatment. In this paper, we propose the use of weighted categorical kernel functions to predict drug resistance from virus sequence data. These kernel functions are very simple to implement and are able to take into account HIV data particularities, such as allele mixtures, and to weigh the different importance of each protein residue, as it is known that not all positions contribute equally to the resistance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/elies_ramon/catkern",
    "lastUpdate": "2020-12-10T13:47:21Z",
    "name": "catkern",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2991-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Antiretroviral drugs are a very effective therapy against HIV infection. However, the high mutation rate of HIV permits the emergence of variants that can be resistant to the drug treatment. Predicting drug resistance to previously unobserved variants is therefore very important for an optimum medical treatment. In this paper, we propose the use of weighted categorical kernel functions to predict drug resistance from virus sequence data. These kernel functions are very simple to implement and are able to take into account HIV data particularities, such as allele mixtures, and to weigh the different importance of each protein residue, as it is known that not all positions contribute equally to the resistance. Results: We analyzed 21 drugs of four classes: protease inhibitors (PI), integrase inhibitors (INI), nucleoside reverse transcriptase inhibitors (NRTI) and non-nucleoside reverse transcriptase inhibitors (NNRTI). We compared two categorical kernel functions, Overlap and Jaccard, against two well-known noncategorical kernel functions (Linear and RBF) and Random Forest (RF). Weighted versions of these kernels were also considered, where the weights were obtained from the RF decrease in node impurity. The Jaccard kernel was the best method, either in its weighted or unweighted form, for 20 out of the 21 drugs. Conclusions: Results show that kernels that take into account both the categorical nature of the data and the presence of mixtures consistently result in the best prediction model. The advantage of including weights depended on the protein targeted by the drug. In the case of reverse transcriptase, weights based in the relative importance of each position clearly increased the prediction performance, while the improvement in the protease was much smaller. This seems to be related to the distribution of weights, as measured by the Gini index. All methods described, together with documentation and examples, are freely available at https://bitbucket.org/elies-ramon/catkern.",
                "authors": [
                    {
                        "name": "Belanche-Munoz L."
                    },
                    {
                        "name": "Perez-Enciso M."
                    },
                    {
                        "name": "Ramon E."
                    }
                ],
                "citationCount": 5,
                "date": "2019-07-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HIV drug resistance prediction with weighted categorical kernel functions"
            },
            "pmcid": "PMC6668108",
            "pmid": "31362714"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
