{
    "additionDate": "2018-06-06T19:45:11Z",
    "biotoolsCURIE": "biotools:ccle_gdsc",
    "biotoolsID": "ccle_gdsc",
    "credit": [
        {
            "email": "jroszik@mdanderson.org",
            "name": "Jason Roszik",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Databases which contain gene expression levels from next generation sequencing and also drug screening data for a large number of cancer cell lines.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://public.tableau.com/profile/jason.roszik#!/vizhome/CCLE_GDSC_correlations/CCLE_GDSC",
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "CCLE GDSC",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0176763",
            "metadata": {
                "abstract": "© 2017 Qin et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The sensitivity of cancer cells to anticancer drugs is a crucial factor for developing effective treatments. However, it is still challenging to precisely predict the effectiveness of therapeutics in humans within a complex genomic and molecular context. We developed an interface which allows the user to rapidly explore drug sensitivity and gene expression associations. Predictions for how expression of various genes affect anticancer drug activity are available for all genes for a set of therapeutics based on data from various cell lines of different origin in the Cancer Cell Line Encyclopedia and the Genomics of Drug Sensitivity in Cancer projects. Our application makes discovery or validation of drug sensitivity and gene expression associations efficient. Effectiveness of this tool is demonstrated by multiple known and novel examples.",
                "authors": [
                    {
                        "name": "Qin Y."
                    },
                    {
                        "name": "Conley A.P."
                    },
                    {
                        "name": "Grimm E.A."
                    },
                    {
                        "name": "Roszik J."
                    }
                ],
                "citationCount": 2,
                "date": "2017-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A tool for discovering drug sensitivity and gene expression associations in cancer cells"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}