
{
    "credit": [
        {
            "email": "alekseyz@ipst.umd.edu",
            "name": "Aleksey Zimin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.genome.umd.edu/contact.html"
        },
        {
            "email": "gmarcais@umd.edu",
            "name": "Guillaume Marçais",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.genome.umd.edu/contact.html"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.genome.umd.edu/masurca_compile.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome assembly",
                    "uri": "http://edamontology.org/operation_0525"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequence assembly",
                "uri": "http://edamontology.org/topic_0196"
            },
            {
                "term": "Whole genome sequencing",
                "uri": "http://edamontology.org/topic_3673"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/msr-ca-1-8-3-genome-short-read-assembler.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Second-generation sequencing technologies produce high coverage of the genome by short reads at a low cost, which has prompted development of new assembly methods. In particular, multiple algorithms based on de Bruijn graphs have been shown to be effective for the assembly problem. In this article, we describe a new hybrid approach that has the computational efficiency of de Bruijn graph methods and the flexibility of overlap-based assembly strategies, and which allows variable read lengths while tolerating a significant level of sequencing error. Our method transforms large numbers of paired-end reads into a much smaller number of longer 'super-reads'. The use of super-reads allows us to assemble combinations of Illumina reads of differing lengths together with longer reads from 454 and Sanger sequencing technologies, making it one of the few assemblers capable of handling such mixtures. We call our system the Maryland Super-Read Celera Assembler (abbreviated MaSuRCA and pronounced 'mazurka'). Results: We evaluate the performance of MaSuRCA against two of the most widely used assemblers for Illumina data, Allpaths-LG and SOAPdenovo2, on two datasets from organisms for which high-quality assemblies are available: the bacterium Rhodobacter sphaeroides and chromosome 16 of the mouse genome. We show that MaSuRCA performs on par or better than Allpaths-LG and significantly better than SOAPdenovo on these data, when evaluated against the finished sequence. We then show that MaSuRCA can significantly improve its assemblies when the original data are augmented with long reads. Availability: MaSuRCA is available as open-source code at ftp://ftp.genome.umd.edu/pub/ MaSuRCA/. Previous (pre-publication) releases have been publicly available for over a year. © 2013 The Author 2013.",
            "authors": [
                "Zimin A.V.",
                "Marcais G.",
                "Puiu D.",
                "Roberts M.",
                "Salzberg S.L.",
                "Yorke J.A."
            ],
            "cit_count": 242,
            "journal": "Bioinformatics",
            "pmid": "23990416",
            "title": "The MaSuRCA genome assembler",
            "year": "2013-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:masurca",
        "biotoolsID": "masurca",
        "description": "Whole genome assembly software. It combines the efficiency of the de Bruijn graph and Overlap-Layout-Consensus (OLC) approaches. MaSuRCA can assemble data sets containing only short reads from Illumina sequencing or a mixture of short reads and long reads (Sanger, 454).",
        "homepage": "http://www.genome.umd.edu/masurca.html",
        "name": "MaSuRCA"
    }
}