{"credit":[{"email":"wonpil@lehigh.edu","name":"Wonpil Im","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.charmm-gui.org/?doc=demo"}],"function":[{"operation":[{"term":"Protein architecture recognition","uri":"http://edamontology.org/operation_2475"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"},{"term":"Protein structure analysis","uri":"http://edamontology.org/topic_2814"}]},"publication":[{"abstract":"Motivation Glycans play a central role in many essential biological processes. Glycan Reader was originally developed to simplify the reading of Protein Data Bank (PDB) files containing glycans through the automatic detection and annotation of sugars and glycosidic linkages between sugar units and to proteins, all based on atomic coordinates and connectivity information. Carbohydrates can have various chemical modifications at different positions, making their chemical space much diverse. Unfortunately, current PDB files do not provide exact annotations for most carbohydrate derivatives and more than 50% of PDB glycan chains have at least one carbohydrate derivative that could not be correctly recognized by the original Glycan Reader. Results Glycan Reader has been improved and now identifies most sugar types and chemical modifications (including various glycolipids) in the PDB, and both PDB and PDBx/mmCIF formats are supported. CHARMM-GUI Glycan Reader is updated to generate the simulation system and input of various glycoconjugates with most sugar types and chemical modifications. It also offers a new functionality to edit the glycan structures through addition/deletion/modification of glycosylation types, sugar types, chemical modifications, glycosidic linkages, and anomeric states. The simulation system and input files can be used for CHARMM, NAMD, GROMACS, AMBER, GENESIS, LAMMPS, Desmond, OpenMM, and CHARMM/OpenMM. Glycan Fragment Database in GlycanStructure.Org is also updated to provide an intuitive glycan sequence search tool for complex glycan structures with various chemical modifications in the PDB.","authors":["Park S.-J.","Lee J.","Patel D.S.","Ma H.","Lee H.S.","Jo S.","Im W."],"cit_count":4,"doi":"10.1093/bioinformatics/btx358","journal":"Bioinformatics","title":"Glycan Reader is improved to recognize most sugar types and chemical modifications in the Protein Data Bank","year":"2017-01-01"}],"summary":{"biotoolsCURIE":"biotools:glycan_reader","biotoolsID":"glycan_reader","description":"Identifies most sugar types and chemical modifications (including various glycolipids) in the PDB, and both PDB and PDBx/mmCIF formats are supported.","homepage":"http://www.glycanstructure.org/","name":"Glycan Reader"}}