{
    "accessibility": "Open access",
    "additionDate": "2022-05-08T10:23:45.743421Z",
    "biotoolsCURIE": "biotools:gedpm-cg",
    "biotoolsID": "gedpm-cg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "liao_xp@tib.cas.cn",
            "name": "Xiaoping Liao",
            "typeEntity": "Person"
        },
        {
            "email": "ma_hw@tib.cas.cn",
            "name": "Hongwu Ma",
            "typeEntity": "Person"
        },
        {
            "name": "Yang Yi"
        }
    ],
    "description": "The Genome Editing automated Design platform for point mutation construction in Corynebacterium glutamicum.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://gedpm-cg.biodesign.ac.cn/",
    "lastUpdate": "2022-05-08T10:23:45.746028Z",
    "name": "GEDpm-cg",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2021.768289",
            "metadata": {
                "abstract": "© Copyright © 2021 Yang, Mao, Liu, Wang, Lu, Li, Luo, Wang, Liao and Ma.Advances in robotic system-assisted genome editing techniques and computer-aided design tools have significantly facilitated the development of microbial cell factories. Although multiple separate software solutions are available for vector DNA assembly, genome editing, and verification, by far there is still a lack of complete tool which can provide a one-stop service for the entire genome modification process. This makes the design of numerous genetic modifications, especially the construction of mutations that require strictly precise genetic manipulation, a laborious, time-consuming and error-prone process. Here, we developed a free online tool called GEDpm-cg for the design of genomic point mutations in C. glutamicum. The suicide plasmid-mediated counter-selection point mutation editing method and the overlap-based DNA assembly method were selected to ensure the editability of any single nucleotide at any locus in the C. glutamicum chromosome. Primers required for both DNA assembly of the vector for genetic modification and sequencing verification were provided as design results to meet all the experimental needs. An in-silico design task of over 10,000 single point mutations can be completed in 5 min. Finally, three independent point mutations were successfully constructed in C. glutamicum guided by GEDpm-cg, which confirms that the in-silico design results could accurately and seamlessly be bridged with in vivo or in vitro experiments. We believe this platform will provide a user-friendly, powerful and flexible tool for large-scale mutation analysis in the industrial workhorse C. glutamicum via robotic/software-assisted systems.",
                "authors": [
                    {
                        "name": "Li H."
                    },
                    {
                        "name": "Liao X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Lu H."
                    },
                    {
                        "name": "Luo J."
                    },
                    {
                        "name": "Ma H."
                    },
                    {
                        "name": "Mao Y."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "date": "2021-10-15T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "GEDpm-cg: Genome Editing Automated Design Platform for Point Mutation Construction in Corynebacterium glutamicum"
            },
            "pmcid": "PMC8554027",
            "pmid": "34722482"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Genetic engineering",
            "uri": "http://edamontology.org/topic_3912"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
