{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-05-15T06:58:44Z",
    "biotoolsCURIE": "biotools:LeishInDB",
    "biotoolsID": "LeishInDB",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "brsaran@gmail.com",
            "name": "Saravanan Vijayakumar",
            "orcidid": "https://orcid.org/0000-0001-5145-0384",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Leishmania Inhibitor Database",
    "documentation": [
        {
            "type": [
                "Other"
            ],
            "url": "http://leishindb.biomedinformri.com/#help"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Operation",
                    "uri": "http://edamontology.org/operation_0004"
                }
            ]
        }
    ],
    "homepage": "http://leishindb.biomedinformri.com/",
    "lastUpdate": "2019-05-15T06:58:44Z",
    "license": "Other",
    "maturity": "Emerging",
    "name": "LeishInDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "brsaran",
    "publication": [
        {
            "doi": "10.1016/j.actatropica.2018.12.022",
            "metadata": {
                "abstract": "© 2018 Elsevier B.V. Despite the availability of drugs to treat Leishmaniasis, various other factors including drug resistance and adverse side effects encourage the researchers to search for new strategies and alternatives for treating Leishmaniasis. Repurposing and devising combination therapy with the existing small molecules would serve as an alternative strategy to address the issue, especially the drug resistance. Hence, here we report LeishInDB, a web-accessible resource of small molecule inhibitors having a varying degree of activity towards Leishmania sp. The database includes searchable information of >7000 small molecules collected from >600 literature. The comprehensive information of inhibitors mainly include the activity details (IC50, EC50, Ki, binding energy etc., if any); information on species and form of Leishmania the inhibitor is active against; and the details about their protein target (actively linked to TriTrypDB). In addition, chemical properties including the log P-value, number of rotatable bonds, number of hydrogen bond donors and acceptors, molecular weight, 2D/3D structural information etc., were also included. Toxicity prediction for each molecule was performed using admetSAR and their corresponding results were available to perform the filtered search. In addition, facility to perform sub-structure search, facility to perform the dynamic search on various fields, and facility to download all the structure of molecules that match the search criteria were also included. We believe that the scope of LeishInDB allows the researchers to utilize the available information for repurposing the inhibitors as well as for the investigation of new therapeutics. Database URL:http://leishindb.biomedinformri.com/.",
                "authors": [
                    {
                        "name": "Vijayakumar S."
                    },
                    {
                        "name": "Kant V."
                    },
                    {
                        "name": "Das P."
                    }
                ],
                "date": "2019-02-01T00:00:00Z",
                "journal": "Acta Tropica",
                "title": "LeishInDB: A web-accessible resource for small molecule inhibitors against Leishmania sp"
            },
            "pmid": "30552881",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ]
}