{
    "additionDate": "2021-01-18T10:01:42Z",
    "biotoolsCURIE": "biotools:netae",
    "biotoolsID": "netae",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ga@alum.mit.edu",
            "name": "Gil Alterovitz",
            "typeEntity": "Person"
        }
    ],
    "description": "Semi-supervised dimensionality reduction of single-cell RNA sequencing to facilitate cell labeling.\n\nnetAE: network-enhanced autoencoder.\n\nNetwork-enhanced autoencoder (netAE) is a semi-supervised dimensionality reduction method. It was specifically designed to facilitate cell labeling of single cell RNA-sequencing data. This repository was created by Zhengyang (Leo) Dong.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LeoZDong/netAE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-08T13:34:25Z",
    "license": "MIT",
    "name": "netAE",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA669",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: Single-cell RNA sequencing allows us to study cell heterogeneity at an unprecedented cell-level resolution and identify known and new cell populations. Current cell labeling pipeline uses unsupervised clustering and assigns labels to clusters by manual inspection. However, this pipeline does not utilize available gold-standard labels because there are usually too few of them to be useful to most computational methods. This article aims to facilitate cell labeling with a semi-supervised method in an alternative pipeline, in which a few gold-standard labels are first identified and then extended to the rest of the cells computationally. RESULTS: We built a semi-supervised dimensionality reduction method, a network-enhanced autoencoder (netAE). Tested on three public datasets, netAE outperforms various dimensionality reduction baselines and achieves satisfactory classification accuracy even when the labeled set is very small, without disrupting the similarity structure of the original space. AVAILABILITY AND IMPLEMENTATION: The code of netAE is available on GitHub: https://github.com/LeoZDong/netAE. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Alterovitz G."
                    },
                    {
                        "name": "Dong Z."
                    }
                ],
                "date": "2021-04-09T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "netAE: semi-supervised dimensionality reduction of single-cell RNA sequencing to facilitate cell labeling"
            },
            "pmid": "32726427"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
