{
    "accessibility": "Open access",
    "additionDate": "2024-02-25T13:07:57.380880Z",
    "biotoolsCURIE": "biotools:atpgcn",
    "biotoolsID": "atpgcn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chenyuan Bian",
            "orcidid": "https://orcid.org/0000-0003-2677-2546",
            "typeEntity": "Person"
        },
        {
            "name": "Anmu Xie",
            "typeEntity": "Person"
        },
        {
            "name": "Nan Xia",
            "typeEntity": "Person"
        },
        {
            "name": "Qian Dong",
            "typeEntity": "Person"
        },
        {
            "name": "Shan Cong",
            "typeEntity": "Person"
        }
    ],
    "description": "ATPGCN: Adversarially-Trained Persistent Homology-Based Graph Convolutional Network for Disease Identification Using Brain Connectivity.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CYB08/ATPGCN",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:13:21.850209Z",
    "name": "ATPGCN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/tmi.2023.3309874",
            "metadata": {
                "abstract": "Brain disease propagation is associated with characteristic alterations in the structural and functional connectivity networks of the brain. To identify disease-specific network representations, graph convolutional networks (GCNs) have been used because of their powerful graph embedding ability to characterize the non-Euclidean structure of brain networks. However, existing GCNs generally focus on learning the discriminative region of interest (ROI) features, often ignoring important topological information that enables the integration of connectome patterns of brain activity. In addition, most methods fail to consider the vulnerability of GCNs to perturbations in network properties of the brain, which considerably degrades the reliability of diagnosis results. In this study, we propose an adversarially trained persistent homology-based graph convolutional network (ATPGCN) to capture disease-specific brain connectome patterns and classify brain diseases. First, the brain functional/structural connectivity is constructed using different neuroimaging modalities. Then, we develop a novel strategy that concatenates the persistent homology features from a brain algebraic topology analysis with readout features of the global pooling layer of a GCN model to collaboratively learn the individual-level representation. Finally, we simulate the adversarial perturbations by targeting the risk ROIs from clinical prior, and incorporate them into a training loop to evaluate the robustness of the model. The experimental results on three independent datasets demonstrate that ATPGCN outperforms existing classification methods in disease identification and is robust to minor perturbations in network architecture. Our code is available at https://github.com/CYB08/ATPGCN.",
                "authors": [
                    {
                        "name": "Bian C."
                    },
                    {
                        "name": "Cong S."
                    },
                    {
                        "name": "Dong Q."
                    },
                    {
                        "name": "Xia N."
                    },
                    {
                        "name": "Xie A."
                    }
                ],
                "citationCount": 2,
                "date": "2024-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "Adversarially Trained Persistent Homology Based Graph Convolutional Network for Disease Identification Using Brain Connectivity"
            },
            "pmid": "37643097"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
