{
    "additionDate": "2017-01-13T13:14:05Z",
    "biotoolsCURIE": "biotools:clean_reads",
    "biotoolsID": "clean_reads",
    "credit": [
        {
            "email": "ngs_backbone@upv.es",
            "name": "Clean_reads team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "clean_reads cleans NGS (Sanger, 454, Illumina and solid) reads.It can trim bad quality regions, adaptors, vectors and regular expressions and also filters out reads that do not meet a minimum quality criteria.",
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                },
                {
                    "term": "Service invocation",
                    "uri": "http://edamontology.org/operation_3763"
                }
            ]
        }
    ],
    "homepage": "http://bioinf.comav.upv.es/clean_reads/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "maturity": "Legacy",
    "name": "Clean reads",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-12-285",
            "metadata": {
                "abstract": "Background: The possibilities offered by next generation sequencing (NGS) platforms are revolutionizing biotechnological laboratories. Moreover, the combination of NGS sequencing and affordable high-throughput genotyping technologies is facilitating the rapid discovery and use of SNPs in non-model species. However, this abundance of sequences and polymorphisms creates new software needs. To fulfill these needs, we have developed a powerful, yet easy-to-use application.Results: The ngs_backbone software is a parallel pipeline capable of analyzing Sanger, 454, Illumina and SOLiD (Sequencing by Oligonucleotide Ligation and Detection) sequence reads. Its main supported analyses are: read cleaning, transcriptome assembly and annotation, read mapping and single nucleotide polymorphism (SNP) calling and selection. In order to build a truly useful tool, the software development was paired with a laboratory experiment. All public tomato Sanger EST reads plus 14.2 million Illumina reads were employed to test the tool and predict polymorphism in tomato. The cleaned reads were mapped to the SGN tomato transcriptome obtaining a coverage of 4.2 for Sanger and 8.5 for Illumina. 23,360 single nucleotide variations (SNVs) were predicted. A total of 76 SNVs were experimentally validated, and 85% were found to be real.Conclusions: ngs_backbone is a new software package capable of analyzing sequences produced by NGS technologies and predicting SNVs with great accuracy. In our tomato example, we created a highly polymorphic collection of SNVs that will be a useful resource for tomato researchers and breeders. The software developed along with its documentation is freely available under the AGPL license and can be downloaded from http://bioinf.comav.upv.es/ngs_backbone/ or http://github.com/JoseBlanca/franklin. © 2011 Blanca et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Blanca J.M."
                    },
                    {
                        "name": "Canizares J."
                    },
                    {
                        "name": "Nuez F."
                    },
                    {
                        "name": "Pascual L."
                    },
                    {
                        "name": "Ziarsolo P."
                    }
                ],
                "citationCount": 45,
                "date": "2011-05-02T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "Ngs_backbone: A pipeline for read cleaning, mapping and SNP calling using Next Generation Sequence"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
