{
    "additionDate": "2019-11-14T18:39:31Z",
    "biotoolsCURIE": "biotools:NEEDS",
    "biotoolsID": "NEEDS",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "m.helbich@uu.nl",
            "name": "Marco Helbich",
            "orcidid": "https://orcid.org/0000-0003-0392-8915",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > CORRECT NAME OF TOOL COULD ALSO BE 'NEEDS study' | a protocol for a cross-sectional smartphone tracking study and a longitudinal population register study | Dynamic Urban Environmental Exposures on Depression and Suicide | Depression is among the leading health burdens worldwide and people affected by depression have a higher suicide risk. Environmental exposures may act as potential stressors or buffers to people’s mental health status. How much the environment (e.g. urban design, green space, social interaction) contributes to depression and suicide risk remains unclear and evidence tends to be limited to the residential environment. NEEDS calls such environmental exposure assessments into question",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.needs.sites.uu.nl",
    "lastUpdate": "2019-11-14T18:39:31Z",
    "name": "NEEDS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1136/BMJOPEN-2019-030075",
            "metadata": {
                "abstract": "© Author(s) (or their employer(s)) 2019. Re-use permitted under CC BY-NC. No commercial re-use. See rights and permissions. Published by BMJ.Introduction Environmental exposures are intertwined with mental health outcomes. People are exposed to the environments in which they currently live, and to a multitude of environments along their daily movements and through their residential relocations. However, most research assumes that people are immobile, disregarding that such dynamic exposures also serve as stressors or buffers potentially associated with depression and suicide risk. The aim of the Dynamic Urban Environmental Exposures on Depression and Suicide (NEEDS) study is to examine how dynamic environmental exposures along people's daily movements and over their residential histories affect depression and suicide mortality in the Netherlands. Methods and analysis The research design comprises two studies emphasising the temporality of exposures. First, a cross-sectional study is assessing how daily exposures correlate with depression. A nationally representative survey was administered to participants recruited through stratified random sampling of the population aged 18-65 years. Survey data were enriched with smartphone-based data (eg, Global Positioning System tracking, Bluetooth sensing, social media usage, communication patterns) and environmental exposures (eg, green and blue spaces, noise, air pollution). Second, a longitudinal population register study is addressing the extent to which past environmental exposures over people's residential history affect suicide risk later in life. Statistical and machine learning-based models are being developed to quantify environment-health relations. Ethics and dissemination Ethical approval (FETC17-060) was granted by the Ethics Review Board of Utrecht University, The Netherlands. Project-related findings will be disseminated at conferences and in peer-reviewed journal papers. Other project outcomes will be made available through the project's web page, http://www.needs.sites.uu.nl.",
                "authors": [
                    {
                        "name": "Helbich M."
                    }
                ],
                "citationCount": 10,
                "date": "2019-08-01T00:00:00Z",
                "journal": "BMJ Open",
                "title": "Dy n amic Urban e nvironmental e xposures on D epression and S uicide (NEEDS) in the Netherlands: A protocol for a cross-sectional smartphone tracking study and a longitudinal population register study"
            },
            "pmcid": "PMC6701679",
            "pmid": "31401609"
        }
    ],
    "topic": [
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        }
    ]
}