{"credit":[{"email":"msamanta1969@yahoo.com","name":"Support","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://www.lrrsearch.com/index.php?page=about"}],"function":[{"operation":[{"term":"Database search","uri":"http://edamontology.org/operation_2421"},{"term":"Sequence motif recognition","uri":"http://edamontology.org/operation_0239"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Database portal"],"topic":[{"term":"Protein sites, features and motifs","uri":"http://edamontology.org/topic_3510"},{"term":"Sequence composition, complexity and repeats","uri":"http://edamontology.org/topic_0157"},{"term":"Proteins","uri":"http://edamontology.org/topic_0078"}]},"publication":[{"abstract":"The leucine-rich repeat (LRR) motifs of the nucleotide-binding oligomerization domain like receptors (NLRs) play key roles in recognizing and binding various pathogen associated molecular patterns (PAMPs) resulting in the activation of downstream signaling and innate immunity. Therefore, identification of LRR motifs is very important to study ligand-receptor interaction. To date, available resources pose restrictions including both false negative and false positive prediction of LRR motifs from the primary protein sequence as their algorithms are relied either only on sequence based comparison or alignment techniques or are over biased for a particular LRR containing protein family. Therefore, to minimize the error (≤5%) and to identify a maximum number of LRR motifs in the wide range of proteins, we have developed \"LRRsearch\" web-server using position specific scoring matrix (PSSM) of 11 residue LRR-HCS (highly conserved segment) which are frequently observed motifs in the most divergent classes of LRR containing proteins. A data library of 421 proteins, distributed among five known NLR families has also been integrated with the \"LRRsearch\" for the rich user experience. The access to the \"LRRsearch\" program is freely available at http://www.lrrsearch.com/. © 2014 Elsevier Ltd.","authors":["Bej A.","Sahoo B.R.","Swain B.","Basu M.","Jayasankar P.","Samanta M."],"cit_count":11,"doi":"10.1016/J.COMPBIOMED.2014.07.016","journal":"Computers in Biology and Medicine","pmid":"25150822","title":"LRRsearch: An asynchronous server-based application for the prediction of leucine-rich repeat motifs and an integrative database of NOD-like receptors","year":"2014-10-01"}],"summary":{"biotoolsCURIE":"biotools:lrrsearch","biotoolsID":"lrrsearch","description":"An asynchronous server-based application for the prediction of leucine-rich repeat motifs and an integrative database of NOD-like receptors.","homepage":"http://www.lrrsearch.com/","name":"LRRsearch"}}