{
    "accessibility": "Open access",
    "additionDate": "2021-11-05T21:02:06.458018Z",
    "biotoolsCURIE": "biotools:mscnmf",
    "biotoolsID": "mscnmf",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chuanyuan Wang"
        },
        {
            "name": "Ying-Lian Gao"
        },
        {
            "name": "Xiang-Zhen Kong"
        },
        {
            "name": "Jin-Xing Liu"
        },
        {
            "name": "Chun-Hou Zheng"
        }
    ],
    "description": "Unsupervised Cluster Analysis and Gene Marker Extraction of scRNA-seq Data based on Non-negative Matrix Factorization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangchuanyuan1/project-MscNMF",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-11-05T21:02:06.460523Z",
    "license": "Not licensed",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/wangchuanyuan1/project-MscNMF"
        }
    ],
    "name": "MscNMF",
    "operatingSystem": [
        "Mac",
        "Windows",
        "Linux"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/JBHI.2021.3091506",
            "metadata": {
                "abstract": "IEEEThe development of single-cell RNA sequencing (scRNA-seq) technology has made it possible to measure gene expression levels at the resolution of a single cell, which further reveals the complex growth processes of cells such as mutation and differentiation. Recognizing cell heterogeneity is one of the most critical tasks in scRNA-seq research. To solve it, we propose a non-negative matrix factorization framework based on multi-subspace cell similarity learning for unsupervised scRNA-seq data analysis (MscNMF). MscNMF includes three parts: data decomposition, similarity learning, and similarity fusion. The three work together to complete the data similarity learning task. MscNMF can learn the gene features and cell features of different subspaces, and the correlation and heterogeneity between cells will be more prominent in multi-subspaces. The redundant information and noise in each low-dimensional feature space are eliminated, and its gene weight information can be further analyzed to calculate the optimal number of subpopulations. The final cell similarity learning will be more satisfactory due to the fusion of cell similarity information in different subspaces. The advantage of MscNMF is that it can calculate the number of cell types and the rank of Non-negative matrix factorization (NMF) reasonably. Experiments on seven real scRNA-seq datasets show that MscNMF can effectively perform clustering tasks and extract useful genetic markers. To verify its clustering performance, the framework is compared with other latest clustering algorithms and satisfactory results are obtained. The code of MscNMF is free available for academic https://github.com/wangchuanyuan1/project-MscNMF).",
                "authors": [
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Gao Y."
                    },
                    {
                        "name": "Kong X."
                    },
                    {
                        "name": "Liu J."
                    },
                    {
                        "name": "Zheng C."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "Unsupervised Cluster Analysis and Gene Marker Extraction of scRNA-seq Data based on Non-negative Matrix Factorization"
            },
            "pmid": "34156956"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}