
{
    "credit": [
        {
            "email": "xuan@vt.edu",
            "name": "Jianhua Xuan",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://sourceforge.net/projects/netsvmjava/files/UserManual_CyNetSVM.pdf/download"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Biomarkers",
                "uri": "http://edamontology.org/topic_3360"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2017 Shi et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. One of the important tasks in cancer research is to identify biomarkers and build classification models for clinical outcome prediction. In this paper, we develop a CyNetSVM software package, implemented in Java and integrated with Cytoscape as an app, to identify network biomarkers using network-constrained support vector machines (NetSVM). The Cytoscape app of NetSVM is specifically designed to improve the usability of NetSVM with the following enhancements: (1) user-friendly graphical user interface (GUI), (2) computationally efficient core program and (3) convenient network visualization capability. The CyNetSVM app has been used to analyze breast cancer data to identify network genes associated with breast cancer recurrence. The biological function of these network genes is enriched in signaling pathways associated with breast cancer progression, showing the effectiveness of CyNetSVM for cancer biomarker identification. The CyNetSVM package is available at Cytoscape App Store and http://sourceforge.net/projects/netsvmjava; a sample data set is also provided at sourceforge.net.",
            "authors": [
                "Shi X.",
                "Banerjee S.",
                "Chen L.",
                "Hilakivi-Clarke L.",
                "Clarke R.",
                "Xuan J."
            ],
            "cit_count": 1,
            "doi": "10.1371/journal.pone.0170482",
            "journal": "PLoS ONE",
            "title": "CyNetSVM: A cytoscape App for cancer biomarker identification using network constrained support vector machines",
            "type": "Primary",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:cynetsvm",
        "biotoolsID": "cynetsvm",
        "description": "Tool that is integrated as a Cytoscape APP to predict clinical outcome and identify network bio-markers by integrating gene expression data and PPI data.",
        "homepage": "https://sourceforge.net/projects/netsvmjava/",
        "name": "CyNetSVM"
    }
}