{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:18:41Z",
    "biotoolsCURIE": "biotools:EcoPrestMet",
    "biotoolsID": "EcoPrestMet",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zampieri@imsb.biol.ethz.ch",
            "name": "Mattia Zampieri",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Metabolomics-Driven Exploration of the Chemical Drug Space to Predict Combination Antimicrobial Therapies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Antimicrobial resistance prediction",
                    "uri": "http://edamontology.org/operation_3482"
                },
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "https://zampierigroup.shinyapps.io/EcoPrestMet",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "CC-BY-NC-4.0",
    "maturity": "Mature",
    "name": "EcoPrestMet",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1016/J.MOLCEL.2019.04.001",
            "metadata": {
                "abstract": "© 2019 The Author(s)Alternative to the conventional search for single-target, single-compound treatments, combination therapies can open entirely new opportunities to fight antibiotic resistance. However, combinatorial complexity prohibits experimental testing of drug combinations on a large scale, and methods to rationally design combination therapies are lagging behind. Here, we developed a combined experimental-computational approach to predict drug-drug interactions using high-throughput metabolomics. The approach was tested on 1,279 pharmacologically diverse drugs applied to the gram-negative bacterium Escherichia coli. Combining our metabolic profiling of drug response with previously generated metabolic and chemogenomic profiles of 3,807 single-gene deletion strains revealed an unexpectedly large space of inhibited gene functions and enabled rational design of drug combinations. This approach is applicable to other therapeutic areas and can unveil unprecedented insights into drug tolerance, side effects, and repurposing. The compendium of drug-associated metabolome profiles is available at https://zampierigroup.shinyapps.io/EcoPrestMet, providing a valuable resource for the microbiological and pharmacological communities. © 2019 The Author(s)Campos and Zampieri monitor the metabolic response of E. coli to 1,279 drugs and reveal an unexpectedly large spectrum of metabolic effects. Combining metabolic profiling with chemogenomic data, they predict epistatic drug interactions and show how to expand the search for new antimicrobial treatments to compounds with no growth-inhibitory activity.",
                "authors": [
                    {
                        "name": "Campos A.I."
                    },
                    {
                        "name": "Zampieri M."
                    }
                ],
                "citationCount": 19,
                "date": "2019-06-20T00:00:00Z",
                "journal": "Molecular Cell",
                "title": "Metabolomics-Driven Exploration of the Chemical Drug Space to Predict Combination Antimicrobial Therapies"
            },
            "pmid": "31047795",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        }
    ],
    "validated": 1
}