{
    "accessibility": "Open access",
    "additionDate": "2022-02-02T23:51:31.687045Z",
    "biotoolsCURIE": "biotools:s-cuda",
    "biotoolsID": "s-cuda",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lly2111101@163.com",
            "name": "Luyan Liu"
        },
        {
            "name": "Zhengdong Zhang"
        },
        {
            "name": "Shuai Li"
        },
        {
            "name": "Kai Ma"
        },
        {
            "name": "Yefeng Zheng"
        }
    ],
    "description": "Self-cleansing unsupervised domain adaptation for medical image segmentation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zzdxjtu/S-cuda",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-02-02T23:51:31.689642Z",
    "license": "Not licensed",
    "name": "S-CUDA",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.MEDIA.2021.102214",
            "metadata": {
                "abstract": "© 2021 The AuthorsMedical image segmentation tasks hitherto have achieved excellent progresses with large-scale datasets, which empowers us to train potent deep convolutional neural networks (DCNNs). However, labeling such large-scale datasets is laborious and error-prone, which leads the noisy (or incorrect) labels to be an ubiquitous problem in the real-world scenarios. In addition, data collected from different sites usually exhibit significant data distribution shift (or domain shift). As a result, noisy label and domain shift become two common problems in medical imaging application scenarios, especially in medical image segmentation, which degrade the performance of deep learning models significantly. In this paper, we identify a novel problem hidden in medical image segmentation, which is unsupervised domain adaptation on noisy labeled data, and propose a novel algorithm named “Self-Cleansing Unsupervised Domain Adaptation” (S-CDUA) to address such issue. S-CUDA sets up a realistic scenario to solve the above problems simultaneously where training data (i.e., source domain) not only shows domain shift w.r.t. unsupervised test data (i.e., target domain) but also contains noisy labels. The key idea of S-CUDA is to learn noise-excluding and domain invariant knowledge from noisy supervised data, which will be applied on the highly corrupted data for label cleansing and further data-recycling, as well as on the test data with domain shift for supervised propagation. To this end, we propose a novel framework leveraging noisy-label learning and domain adaptation techniques to cleanse the noisy labels and learn from trustable clean samples, thus enabling robust adaptation and prediction on the target domain. Specifically, we train two peer adversarial networks to identify high-confidence clean data and exchange them in companions to eliminate the error accumulation problem and narrow the domain gap simultaneously. In the meantime, the high-confidence noisy data are detected and cleansed in order to reuse the contaminated training data. Therefore, our proposed method can not only cleanse the noisy labels in the training set but also take full advantage of the existing noisy data to update the parameters of the network. For evaluation, we conduct experiments on two popular datasets (REFUGE and Drishti-GS) for optic disc (OD) and optic cup (OC) segmentation, and on another public multi-vendor dataset for spinal cord gray matter (SCGM) segmentation. Experimental results show that our proposed method can cleanse noisy labels efficiently and obtain a model with better generalization performance at the same time, which outperforms previous state-of-the-art methods by large margin. Our code can be found at https://github.com/zzdxjtu/S-cuda.",
                "authors": [
                    {
                        "name": "Liu L."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Li S."
                    },
                    {
                        "name": "Ma K."
                    },
                    {
                        "name": "Zheng Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Medical Image Analysis",
                "title": "S-CUDA: Self-cleansing unsupervised domain adaptation for medical image segmentation"
            },
            "pmid": "34464837"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Data quality management",
            "uri": "http://edamontology.org/topic_3572"
        }
    ]
}