
{
    "credit": [
        {
            "email": "brutlag@stanford.edu",
            "name": "Douglas L. Brutlag",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://robotics.stanford.edu/~xsliu/BioProspector/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Sequence motif recognition",
                    "uri": "http://edamontology.org/operation_0239"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Sequence sites, features and motifs",
                "uri": "http://edamontology.org/topic_0160"
            },
            {
                "term": "Gene regulation",
                "uri": "http://edamontology.org/topic_0204"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The development of genome sequencing and DNA microarray analysis of gene expression gives rise to the demand for data-mining tools. BioProspector, a C program using a Gibbs sampling strategy, examines the upstream region of genes in the same gene expression pattern group and looks for regulatory sequence motifs. BioProspector uses zero to third-order Markov background models whose parameters are either given by the user or estimated from a specified sequence file. The significance of each motif found is judged based on a motif score distribution estimated by a Monte Carlo method. In addition, BioProspector modifies the motif model used in the earlier Gibbs samplers to allow for the modeling of gapped motifs and motifs with palindromic patterns. All these modifications greatly improve the performance of the program. Although testing and development are still in progress, the program has shown preliminary success in finding the binding motifs for Saccharomyces cerevisiae RAP1, Bacillus subtilis RNA polymerase, and Escherichia coli CRP. We are currently working on combining BioProspector with a clustering program to explore gene expression networks and regulatory mechanisms.",
            "authors": [
                "Liu X.",
                "Brutlag D.L.",
                "Liu J.S."
            ],
            "cit_count": 614,
            "journal": "Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing",
            "pmid": "11262934",
            "title": "BioProspector: discovering conserved DNA motifs in upstream regulatory regions of co-expressed genes.",
            "year": "2001-01-01"
        },
        {
            "abstract": "The identification of regulatory motifs is important for the study of gene expression. Here we present a suite of programs that we have developed to search for regulatory sequence motifs: (i) BioProspector, a Gibbs-sampling-based program for predicting regulatory motifs from co-regulated genes in prokaryotes or lower eukaryotes; (ii) CompareProspector, an extension to BioProspector which incorporates comparative genomics features to be used for higher eukaryotes; (iii) MDscan, a program for finding protein-DNA interaction sites from ChIP-on-chip targets. All three programs examine a group of sequences that may share common regulatory motifs and output a list of putative motifs as position-specific probability matrices, the individual sites used to construct the motifs and the location of each site on the input sequences. The web servers and executables can be accessed at http://seqmotifs.stanford.edu. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Liu Y.",
                "Wei L.",
                "Batzoglou S.",
                "Brutlag D.L.",
                "Liu J.S.",
                "Liu X.S."
            ],
            "cit_count": 30,
            "journal": "Nucleic Acids Research",
            "pmid": "15215381",
            "title": "A suite of web-based programs to search for transcriptional regulatory motifs",
            "year": "2004-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bioprospector",
        "biotoolsID": "bioprospector",
        "description": "Server which scans upstream of genes in the same gene expression cluster for regulatory sequence motifs using a Gibbs sampling strategy.  The Markov background model is used for non-motif bases, improving specificity of predicted motif locations.",
        "homepage": "http://robotics.stanford.edu/~xsliu/BioProspector/",
        "name": "BioProspector"
    }
}