{
    "additionDate": "2020-01-14T08:57:44Z",
    "biotoolsCURIE": "biotools:PromPDD",
    "biotoolsID": "PromPDD",
    "confidence_flag": "tool",
    "description": "web-based tool for the prediction, deciphering and design of promiscuous peptides that bind to HLA class I molecules.\n\nPromPDD :HLA peptide-binding fingerprints : HLAsupE : Publication : Download: tutorial.\n\nPromPDD were developed based on the prediction models generated using the average relative binding (ARB) matrix method.PromPDD enables the prediction and deciphering of promiscuous peptides that bind to multiple HLA molecules within or cross HLA supertypes in a simpler and more direct way. We expanded the application of PromPDD to HLA class I alleles with limited experimentally verified data by generating pan-specific matrices using a derived modular method, and more than 2500 HLA molecules encoded by HLA-A and -B genes are available in PromPDD",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Epitope mapping",
                    "uri": "http://edamontology.org/operation_0416"
                },
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Virulence prediction",
                    "uri": "http://edamontology.org/operation_3461"
                }
            ]
        }
    ],
    "homepage": "http://www.immunoinformatics.net/PromPDD/",
    "lastUpdate": "2020-12-09T15:18:23Z",
    "name": "PromPDD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JIM.2019.112685",
            "metadata": {
                "abstract": "© 2019Promiscuous peptides that can be presented by multiple human leukocyte antigens (HLAs) have great potential for the development of vaccines with wide population coverage. However, the current available methods for the prediction of peptides that bind to major histocompatibility complex (MHC) are mainly aimed at the rapid or mass screening of potential T cell epitopes from pathogen antigens or proteomics. The current approaches do not allow deciphering the contribution of the residue at each peptide position to the promiscuous binding ability of the peptide or obtaining guidelines for the design of promiscuous peptides. In this study, we re-evaluated and characterized four matrix-based prediction models that have been extensively used for the prediction of HLA-binding peptides and found that the prediction models generated based on the average relative binding (ARB) matrix shared a consistent and conservative threshold for all well-studied HLA class I alleles. Evaluations performed using datasets of HLA supertype-specific peptides with various cross-binding abilities and peptide mutant analogues indicated that the ARB-based binding matrices could be used to decipher and design promiscuous peptides that bind to multiple HLA molecules. A web-based tool called PromPDD was developed using ARB matrix-based models, and this tool enables the prediction, deciphering and design of promiscuous peptides that bind to multiple HLA molecules within or across HLA supertypes in a simpler and more direct manner. Furthermore, we expanded the application of PromPDD to HLA class I alleles with limited experimentally verified data by generating pan-specific matrices using a derived modular method, and 2641 HLA molecules encoded by HLA-A and HLA-B genes are available in PromPDD. PromPDD, which is freely available at http://www.immunoinformatics.net/PromPDD/, is the first tool for the deciphering and design of promiscuous peptides that bind to HLA class I molecules.",
                "authors": [
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Hong P."
                    },
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Tian Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Wu Y."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "Journal of Immunological Methods",
                "title": "PromPDD, a web-based tool for the prediction, deciphering and design of promiscuous peptides that bind to HLA class I molecules"
            },
            "pmid": "31678214"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
