{
    "additionDate": "2021-01-18T10:51:08Z",
    "biotoolsCURIE": "biotools:deepmitodb",
    "biotoolsID": "deepmitodb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pierluigi.martelli@unibo.it",
            "name": "Pier Luigi Martelli",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepMitoDB is a database of experimental and predicted subcellular localization of mitochondrial proteins with exteded functional annotation.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Subcellular localisation prediction",
                    "uri": "http://edamontology.org/operation_2489"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ]
        }
    ],
    "homepage": "http://busca.biocomp.unibo.it/deepmitodb",
    "lastUpdate": "2021-02-27T14:25:07Z",
    "name": "DeepMitoDB",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03617-Z",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The prediction of protein subcellular localization is a key step of the big effort towards protein functional annotation. Many computational methods exist to identify high-level protein subcellular compartments such as nucleus, cytoplasm or organelles. However, many organelles, like mitochondria, have their own internal compartmentalization. Knowing the precise location of a protein inside mitochondria is crucial for its accurate functional characterization. We recently developed DeepMito, a new method based on a 1-Dimensional Convolutional Neural Network (1D-CNN) architecture outperforming other similar approaches available in literature. Results: Here, we explore the adoption of DeepMito for the large-scale annotation of four sub-mitochondrial localizations on mitochondrial proteomes of five different species, including human, mouse, fly, yeast and Arabidopsis thaliana. A significant fraction of the proteins from these organisms lacked experimental information about sub-mitochondrial localization. We adopted DeepMito to fill the gap, providing complete characterization of protein localization at sub-mitochondrial level for each protein of the five proteomes. Moreover, we identified novel mitochondrial proteins fishing on the set of proteins lacking any subcellular localization annotation using available state-of-the-art subcellular localization predictors. We finally performed additional functional characterization of proteins predicted by DeepMito as localized into the four different sub-mitochondrial compartments using both available experimental and predicted GO terms. All data generated in this study were collected into a database called DeepMitoDB (available at http://busca.biocomp.unibo.it/deepmitodb), providing complete functional characterization of 4307 mitochondrial proteins from the five species. Conclusions: DeepMitoDB offers a comprehensive view of mitochondrial proteins, including experimental and predicted fine-grain sub-cellular localization and annotated and predicted functional annotations. The database complements other similar resources providing characterization of new proteins. Furthermore, it is also unique in including localization information at the sub-mitochondrial level. For this reason, we believe that DeepMitoDB can be a valuable resource for mitochondrial research.",
                "authors": [
                    {
                        "name": "Savojardo C."
                    },
                    {
                        "name": "Martelli P.L."
                    },
                    {
                        "name": "Tartari G."
                    },
                    {
                        "name": "Casadio R."
                    }
                ],
                "citationCount": 1,
                "date": "2020-09-16T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Large-scale prediction and analysis of protein sub-mitochondrial localization with DeepMito"
            },
            "pmcid": "PMC7493403",
            "pmid": "32938368"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}