{
    "additionDate": "2022-07-17T11:49:58.440150Z",
    "biotoolsCURIE": "biotools:cardisort",
    "biotoolsID": "cardisort",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "ruthplim74@gmail.com",
            "name": "Ruth P. Lim",
            "typeEntity": "Person"
        },
        {
            "name": "Cian M. Scannell"
        }
    ],
    "description": "A convolutional neural network for cross vendor automated sorting of cardiac MR images.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cianmscannell/cardisort",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-07-17T11:49:58.442743Z",
    "license": "CC-BY-1.0",
    "name": "CardiSort",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1007/S00330-022-08724-4",
            "metadata": {
                "abstract": "© 2022, The Author(s).Objectives: To develop an image-based automatic deep learning method to classify cardiac MR images by sequence type and imaging plane for improved clinical post-processing efficiency. Methods: Multivendor cardiac MRI studies were retrospectively collected from 4 centres and 3 vendors. A two-head convolutional neural network (‘CardiSort’) was trained to classify 35 sequences by imaging sequence (n = 17) and plane (n = 10). Single vendor training (SVT) on single-centre images (n = 234 patients) and multivendor training (MVT) with multicentre images (n = 434 patients, 3 centres) were performed. Model accuracy and F1 scores on a hold-out test set were calculated, with ground truth labels by an expert radiologist. External validation of MVT (MVTexternal) was performed on data from 3 previously unseen magnet systems from 2 vendors (n = 80 patients). Results: Model sequence/plane/overall accuracy and F1-scores were 85.2%/93.2%/81.8% and 0.82 for SVT and 96.1%/97.9%/94.3% and 0.94 MVT on the hold-out test set. MVTexternal yielded sequence/plane/combined accuracy and F1-scores of 92.7%/93.0%/86.6% and 0.86. There was high accuracy for common sequences and conventional cardiac planes. Poor accuracy was observed for underrepresented classes and sequences where there was greater variability in acquisition parameters across centres, such as perfusion imaging. Conclusions: A deep learning network was developed on multivendor data to classify MRI studies into component sequences and planes, with external validation. With refinement, it has potential to improve workflow by enabling automated sequence selection, an important first step in completely automated post-processing pipelines. Key Points: • Deep learning can be applied for consistent and efficient classification of cardiac MR image types. • A multicentre, multivendor study using a deep learning algorithm (CardiSort) showed high classification accuracy on a hold-out test set with good generalisation to images from previously unseen magnet systems. • CardiSort has potential to improve clinical workflows, as a vital first step in developing fully automated post-processing pipelines.",
                "authors": [
                    {
                        "name": "Bettencourt N."
                    },
                    {
                        "name": "Chiribiri A."
                    },
                    {
                        "name": "Kachel S."
                    },
                    {
                        "name": "Kearney L."
                    },
                    {
                        "name": "Lim R.P."
                    },
                    {
                        "name": "Scannell C.M."
                    },
                    {
                        "name": "Villa A.D.M."
                    },
                    {
                        "name": "Young A.A."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "European Radiology",
                "title": "CardiSort: a convolutional neural network for cross vendor automated sorting of cardiac MR images"
            },
            "pmid": "35368227"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
