{
    "additionDate": "2024-01-23T11:02:56.207088Z",
    "biotoolsCURIE": "biotools:s_leaping",
    "biotoolsID": "s_leaping",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xin.gao@kaust.edu.sa",
            "name": "Xin Gao",
            "orcidid": "https://orcid.org/0000-0002-7108-3574",
            "typeEntity": "Person"
        }
    ],
    "description": "Efficient downsampling method for large high-throughput sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/hkuwahara/sleaping",
    "language": [
        "C"
    ],
    "lastUpdate": "2024-01-23T11:02:56.209659Z",
    "name": "s-leaping",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD399",
            "metadata": {
                "abstract": "Motivation: Sequencing coverage is among key determinants considered in the design of omics studies. To help estimate cost-effective sequencing coverage for specific downstream analysis, downsampling, a technique to sample subsets of reads with a specific size, is routinely used. However, as the size of sequencing becomes larger and larger, downsampling becomes computationally challenging. Results: Here, we developed an approximate downsampling method called s-leaping that was designed to efficiently and accurately process large-size data. We compared the performance of s-leaping with state-of-the-art downsampling methods in a range of practical omics-study downsampling settings and found s-leaping to be up to 39% faster than the second-fastest method, with comparable accuracy to the exact downsampling methods. To apply s-leaping on FASTQ data, we developed a light-weight tool called fadso in C. Using whole-genome sequencing data with 208 million reads, we compared fadso’s performance with that of a commonly used FASTQ tool with the same downsampling feature and found fadso to be up to 12% faster with 21% lower memory usage, suggesting fadso to have up to 40% higher throughput in a parallel computing setting.",
                "authors": [
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Kuwahara H."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "S-leaping: an efficient downsampling method for large high-throughput sequencing data"
            },
            "pmcid": "PMC10318387",
            "pmid": "37354496"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ]
}
