{
    "additionDate": "2021-11-29T11:04:35.275889Z",
    "biotoolsCURIE": "biotools:rrosetta",
    "biotoolsID": "rrosetta",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jan.komorowski@icm.uu.se",
            "name": "Jan Komorowski",
            "orcidid": "https://orcid.org/0000-0002-0766-8789",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R.ROSETTA is an R package for constructing and analyzing rule-based classification models. R.ROSETTA is designed to support the overall data mining and knowledge discovery process. The presented tool is a more accessible and extended version of ROSETTA system. In addition to all the existing ROSETTA functionalities, we have added new functions such as: balancing data with undersampling, estimating rule P values, retrieving support sets from rules, mergind rule-based models, predicting external classes, visualizing rule-based model and generating synthetic data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/komorowskilab/R.ROSETTA",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T11:04:35.278655Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/komorowskilab/R.ROSETTA/issues"
        }
    ],
    "name": "R.ROSETTA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04049-Z",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Machine learning involves strategies and algorithms that may assist bioinformatics analyses in terms of data mining and knowledge discovery. In several applications, viz. in Life Sciences, it is often more important to understand how a prediction was obtained rather than knowing what prediction was made. To this end so-called interpretable machine learning has been recently advocated. In this study, we implemented an interpretable machine learning package based on the rough set theory. An important aim of our work was provision of statistical properties of the models and their components. Results: We present the R.ROSETTA package, which is an R wrapper of ROSETTA framework. The original ROSETTA functions have been improved and adapted to the R programming environment. The package allows for building and analyzing non-linear interpretable machine learning models. R.ROSETTA gathers combinatorial statistics via rule-based modelling for accessible and transparent results, well-suited for adoption within the greater scientific community. The package also provides statistics and visualization tools that facilitate minimization of analysis bias and noise. The R.ROSETTA package is freely available at https://github.com/komorowskilab/R.ROSETTA. To illustrate the usage of the package, we applied it to a transcriptome dataset from an autism case–control study. Our tool provided hypotheses for potential co-predictive mechanisms among features that discerned phenotype classes. These co-predictors represented neurodevelopmental and autism-related genes. Conclusions: R.ROSETTA provides new insights for interpretable machine learning analyses and knowledge-based systems. We demonstrated that our package facilitated detection of dependencies for autism-related genes. Although the sample application of R.ROSETTA illustrates transcriptome data analysis, the package can be used to analyze any data organized in decision tables.",
                "authors": [
                    {
                        "name": "Garbulowski M."
                    },
                    {
                        "name": "Diamanti K."
                    },
                    {
                        "name": "Smolinska K."
                    },
                    {
                        "name": "Baltzer N."
                    },
                    {
                        "name": "Stoll P."
                    },
                    {
                        "name": "Bornelov S."
                    },
                    {
                        "name": "Ohrn A."
                    },
                    {
                        "name": "Feuk L."
                    },
                    {
                        "name": "Komorowski J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "R.ROSETTA: an interpretable machine learning framework"
            },
            "pmcid": "PMC7937228",
            "pmid": "33676405",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}