
{
    "credit": [
        {
            "email": "takeshiemura@gmail.com",
            "name": "Takeshi Emura",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/cran/compound.Cox"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Library"
        ],
        "topic": [
            {
                "term": "Compound libraries and screening",
                "uri": "http://edamontology.org/topic_3343"
            },
            {
                "term": "Oncology",
                "uri": "http://edamontology.org/topic_2640"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2018 Background and objective: Univariate feature selection is one of the simplest and most commonly used techniques to develop a multigene predictor for survival. Presently, there is no software tailored to perform univariate feature selection and predictor construction. Methods: We develop the compound.Cox R package that implements univariate significance tests (via the Wald tests or score tests) for feature selection. We provide a cross-validation algorithm to measure predictive capability of selected genes and a permutation algorithm to assess the false discovery rate. We also provide three algorithms for constructing a multigene predictor (compound covariate, compound shrinkage, and copula-based methods), which are tailored to the subset of genes obtained from univariate feature selection. We demonstrate our package using survival data on the lung cancer patients. We examine the predictive capability of the developed algorithms by the lung cancer data and simulated data. Results: The developed R package, compound.Cox, is available on the CRAN repository. The statistical tools in compound.Cox allow researchers to determine an optimal significance level of the tests, thus providing researchers an optimal subset of genes for prediction. The package also allows researchers to compute the false discovery rate and various prediction algorithms.",
            "authors": [
                "Emura T.",
                "Matsui S.",
                "Chen H.-Y."
            ],
            "cit_count": 1,
            "doi": "10.1016/j.cmpb.2018.10.020",
            "journal": "Computer Methods and Programs in Biomedicine",
            "pmid": "30527130",
            "title": "compound.Cox: univariate feature selection and compound covariate for predicting survival",
            "type": "Primary",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:compound.Cox",
        "biotoolsID": "compound.Cox",
        "description": "Univariate feature selection and compound covariate for predicting survival.",
        "homepage": "https://cran.r-project.org/package=compound.Cox",
        "name": "compound.Cox"
    }
}