{
    "additionDate": "2022-10-27T10:18:55.180902Z",
    "biotoolsCURIE": "biotools:bats_neuroimaging",
    "biotoolsID": "bats_neuroimaging",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "David C. Alsop"
        },
        {
            "name": "Manuel Taso"
        }
    ],
    "description": "Boston ASL Template and Simulator (BATS) offers high-quality, high-resolution perfusion-weighted and quantitative perfusion templates accompanied by ATT and different anatomical contrasts readily available in the Montreal Neurological Institute space.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://github.com/manueltaso/batsasltemplate",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-10-27T10:19:55.961782Z",
    "license": "GPL-3.0",
    "name": "BATS",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1111/JON.13042",
            "metadata": {
                "abstract": "© 2022 American Society of Neuroimaging.Background and purpose: Templates are a hallmark of image analysis in neuroimaging. However, while numerous structural templates exist and have facilitated single-subject and large group studies, templates based on functional contrasts, such as arterial spin labeling (ASL) perfusion, are scarce, have an inherently low spatial resolution, and are not as widely distributed. Having such tools at one's disposal is desirable, for example, in the case of studies not acquiring structural scans. We here propose an initial development of an ASL adult template based on high-resolution fast spin echo acquisitions. Methods: High-resolution single-delay ASL, low-resolution multi-delay ASL, T1-weighted magnetization prepared rapid acquisition 2 gradient echoes, and T2 fluid attenuated inversion recovery data were acquired in a cohort of 10 healthy volunteers (6 males and 4 females, 30± 7 years old). After offline reconstruction of high-resolution perfusion arterial transit time (ATT) and T1 maps, we built a multi-contrast template relying on the Advanced Normalization Toolbox multivariate template nonlinear construction framework. We offer examples for the registration of ASL data acquired with different sequences. Finally, we propose an ASL simulator based on our templates and a standard kinetic model that allows generating synthetic ASL contrasts based on user-specified parameters. Results: Boston ASL Template and Simulator (BATS) offers high-quality, high-resolution perfusion-weighted and quantitative perfusion templates accompanied by ATT and different anatomical contrasts readily available in the Montreal Neurological Institute space. In addition, examples of use for data registration and as a synthetic contrast generator show various applications in which BATS could be used. Conclusions: We propose a new ASL template collection, named BATS, that also includes a simulator allowing the generation of synthetic ASL contrasts. BATS is available at http://github.com/manueltaso/batsasltemplate.",
                "authors": [
                    {
                        "name": "Alsop D.C."
                    },
                    {
                        "name": "Munsch F."
                    },
                    {
                        "name": "Taso M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Journal of Neuroimaging",
                "title": "The Boston ASL Template and Simulator: Initial development and implementation"
            },
            "pmid": "36045507"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
