{
    "additionDate": "2016-10-03T14:08:36Z",
    "biotoolsCURIE": "biotools:maker",
    "biotoolsID": "maker",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "maker-devel@yandell-lab.org",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.yandell-lab.org/index.html"
        }
    ],
    "description": "Portable and easily configurable genome annotation pipeline. It’s purpose is to allow smaller eukaryotic and prokaryotic genome projects to independently annotate their genomes and to create genome databases.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.yandell-lab.org/software/maker.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics",
            "sergitobara"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "http://www.yandell-lab.org/software/maker.html",
    "lastUpdate": "2022-06-21T10:01:31.338016Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/maker-2-20120116-genome-annotation-pipeline.html"
        }
    ],
    "name": "MAKER",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_005309"
        }
    ],
    "owner": "jdianes",
    "publication": [
        {
            "doi": "10.1101/gr.6743907",
            "metadata": {
                "abstract": "We have developed a portable and easily configurable genome annotation pipeline called MAKER. Its purpose is to allow investigators to independently annotate eukaryotic genomes and create genome databases. MAKER identifies repeats, aligns ESTs and proteins to a genome, produces ab initio gene predictions, and automatically synthesizes these data into gene annotations having evidence-based quality indices. MAKER is also easily trainable: Outputs of preliminary runs are used to automatically retrain its gene-prediction algorithm, producing higher-quality gene-models on subsequent runs. MAKER's inputs are minimal, and its outputs can be used to create a GMOD database. Its outputs can also be viewed in the Apollo Genome browser; this feature of MAKER provides an easy means to annotate, view, and edit individual contigs and BACs without the overhead of a database. As proof of principle, we have used MAKER to annotate the genome of the planarian Schmidtea mediterranea and to create a new genome database, SmedGD. We have also compared MAKER's performance to other published annotation pipelines. Our results demonstrate that MAKER provides a simple and effective means to convert a genome sequence into a community-accessible genome database. MAKER should prove especially useful for emerging model organism genome projects for which extensive bioinformatics resources may not be readily available. ©2008 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Alvarado A.S."
                    },
                    {
                        "name": "Cantarel B.L."
                    },
                    {
                        "name": "Holt C."
                    },
                    {
                        "name": "Korf I."
                    },
                    {
                        "name": "Moore B."
                    },
                    {
                        "name": "Parra G."
                    },
                    {
                        "name": "Robb S.M.C."
                    },
                    {
                        "name": "Ross E."
                    },
                    {
                        "name": "Yandell M."
                    }
                ],
                "citationCount": 930,
                "date": "2008-01-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "MAKER: An easy-to-use annotation pipeline designed for emerging model organism genomes"
            },
            "pmcid": "PMC2134774",
            "pmid": "18025269",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1471-2105-12-491",
            "metadata": {
                "abstract": "Background: Second-generation sequencing technologies are precipitating major shifts with regards to what kinds of genomes are being sequenced and how they are annotated. While the first generation of genome projects focused on well-studied model organisms, many of today's projects involve exotic organisms whose genomes are largely terra incognita. This complicates their annotation, because unlike first-generation projects, there are no pre-existing 'gold-standard' gene-models with which to train gene-finders. Improvements in genome assembly and the wide availability of mRNA-seq data are also creating opportunities to update and re-annotate previously published genome annotations. Today's genome projects are thus in need of new genome annotation tools that can meet the challenges and opportunities presented by second-generation sequencing technologies.Results: We present MAKER2, a genome annotation and data management tool designed for second-generation genome projects. MAKER2 is a multi-threaded, parallelized application that can process second-generation datasets of virtually any size. We show that MAKER2 can produce accurate annotations for novel genomes where training-data are limited, of low quality or even non-existent. MAKER2 also provides an easy means to use mRNA-seq data to improve annotation quality; and it can use these data to update legacy annotations, significantly improving their quality. We also show that MAKER2 can evaluate the quality of genome annotations, and identify and prioritize problematic annotations for manual review.Conclusions: MAKER2 is the first annotation engine specifically designed for second-generation genome projects. MAKER2 scales to datasets of any size, requires little in the way of training data, and can use mRNA-seq data to improve annotation quality. It can also update and manage legacy genome annotation datasets. © 2011 Holt and Yandell; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Holt C."
                    },
                    {
                        "name": "Yandell M."
                    }
                ],
                "citationCount": 892,
                "date": "2011-12-22T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "MAKER2: An annotation pipeline and genome-database management tool for second-generation genome projects"
            },
            "pmcid": "PMC3280279",
            "pmid": "22192575",
            "version": "2"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
