{
    "additionDate": "2022-09-30T05:57:31.227968Z",
    "biotoolsCURIE": "biotools:cancertope",
    "biotoolsID": "cancertope",
    "credit": [
        {
            "name": "Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/cancertope/index.php"
        }
    ],
    "description": "In silico Platform for designing genome-based\nPersonalized immunotherapy or Vaccine against Cancer.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/cancertope/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/cancertope/index.php",
    "lastUpdate": "2022-09-30T05:57:38.928898Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/cancertope/index.php"
        }
    ],
    "name": "cancertope",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0166372",
            "metadata": {
                "abstract": "© 2016 Gupta et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Due to advancement in sequencing technology, genomes of thousands of cancer tissues or cell-lines have been sequenced. Identification of cancer-specific epitopes or neoepitopes from cancer genomes is one of the major challenges in the field of immunotherapy or vaccine development. This paper describes a platform Cancertope, developed for designing genome-based immunotherapy or vaccine against a cancer cell. Broadly, the integrated resources on this platform are apportioned into three precise sections. First section explains a cancer-specific database of neoepitopes generated from genome of 905 cancer cell lines. This database harbors wide range of epitopes (e.g., B-cell, CD8+ T-cell, HLA class I, HLA class II) against 60 cancer-specific vaccine antigens. Second section describes a partially personalized module developed for predicting potential neoepitopes against a user-specific cancer genome. Finally, we describe a fully personalized module developed for identification of neoepitopes from genomes of cancerous and healthy cells of a cancer-patient. In order to assist the scientific community, wide range of tools are incorporated in this platform that includes screening of epitopes against human reference proteome (http://www.imtech.res.in/raghava/cancertope/).",
                "authors": [
                    {
                        "name": "Chaudhary K."
                    },
                    {
                        "name": "Dhanda S.K."
                    },
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Kumar R."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Nagpal G."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sehgal M."
                    }
                ],
                "citationCount": 10,
                "date": "2016-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A platform for designing genome-based personalized immunotherapy or vaccine against cancer"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
