{
    "additionDate": "2018-07-31T15:36:05Z",
    "biotoolsCURIE": "biotools:tensor_classification",
    "biotoolsID": "tensor_classification",
    "credit": [
        {
            "email": "laura.frolich@gmail.com",
            "name": "Laura Frølich",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This repository contains code for classifying tensors using different tensor projection and classification methods. Currently the implementations only support matrix observations, There will also be code for simulating data to allow comparisons between the methods.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/laurafroelich/tensor_classification/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Test data",
            "url": "https://github.com/laurafroelich/tensor_classification/blob/master/code/simulation/simulate_data.m"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Classification",
                    "uri": "http://edamontology.org/operation_2990"
                }
            ]
        }
    ],
    "homepage": "https://github.com/laurafroelich/tensor_classification",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "MIT",
    "name": "tensor_classification",
    "owner": "shadi.m",
    "publication": [
        {
            "doi": "10.1186/s12859-018-2188-0",
            "metadata": {
                "abstract": "© 2018 The Author(s). Background: We propose rigorously optimised supervised feature extraction methods for multilinear data based on Multilinear Discriminant Analysis (MDA) and demonstrate their usage on Electroencephalography (EEG) and simulated data. While existing MDA methods use heuristic optimisation procedures based on an ambiguous Tucker structure, we propose a rigorous approach via optimisation on the cross-product of Stiefel manifolds. We also introduce MDA methods with the PARAFAC structure. We compare the proposed approaches to existing MDA methods and unsupervised multilinear decompositions. Results: We find that manifold optimisation substantially improves MDA objective functions relative to existing methods and on simulated data in general improve classification performance. However, we find similar classification performance when applied to the electroencephalography data. Furthermore, supervised approaches substantially outperform unsupervised mulitilinear methods whereas methods with the PARAFAC structure perform similarly to those with Tucker structures. Notably, despite applying the MDA procedures to raw Brain-Computer Interface data, their performances are on par with results employing ample pre-processing and they extract discriminatory patterns similar to the brain activity known to be elicited in the investigated EEG paradigms. Conclusion: The proposed usage of manifold optimisation constitutes the first rigorous and monotonous optimisation approach for MDA methods and allows for MDA with the PARAFAC structure. Our results show that MDA methods applied to raw EEG data can extract discriminatory patterns when compared to traditional unsupervised multilinear feature extraction approaches, whereas the proposed PARAFAC structured MDA models provide meaningful patterns of activity.",
                "authors": [
                    {
                        "name": "Frolich L."
                    },
                    {
                        "name": "Andersen T.S."
                    },
                    {
                        "name": "Morup M."
                    }
                ],
                "date": "2018-05-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Rigorous optimisation of multilinear discriminant analysis with Tucker and PARAFAC structures"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ],
    "validated": 1
}