{
    "additionDate": "2021-10-04T13:39:35.202887Z",
    "biotoolsCURIE": "biotools:manti",
    "biotoolsID": "manti",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fatih.demir@biomed.au.dk",
            "name": "Fatih Demir",
            "typeEntity": "Person"
        },
        {
            "email": "p.huesgen@fz-juelich.de",
            "name": "Pitter F. Huesgen",
            "typeEntity": "Person"
        }
    ],
    "description": "MANTI is an tool for automated annotation of protein N-termini for rapid interpretation of N-terminome data sets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimethyl",
                    "uri": "http://edamontology.org/operation_3642"
                },
                {
                    "term": "Peptide database search",
                    "uri": "http://edamontology.org/operation_3646"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                }
            ]
        }
    ],
    "homepage": "https://MANTI.sourceforge.io",
    "language": [
        "Perl",
        "R"
    ],
    "lastUpdate": "2021-10-04T13:39:35.205262Z",
    "license": "Artistic-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://sourceforge.net/projects/manti/"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://sourceforge.net/p/manti/tickets/"
        }
    ],
    "name": "MANTI",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.1C00310",
            "metadata": {
                "abstract": "© 2021 The Authors. Published by American Chemical Society.Site-specific proteolytic processing is an important, irreversible post-translational protein modification with implications in many diseases. Enrichment of protein N-terminal peptides followed by mass spectrometry-based identification and quantification enables proteome-wide characterization of proteolytic processes and protease substrates but is challenged by the lack of specific annotation tools. A common problem is, for example, ambiguous matches of identified peptides to multiple protein entries in the databases used for identification. We developed MaxQuant Advanced N-termini Interpreter (MANTI), a standalone Perl software with an optional graphical user interface that validates and annotates N-terminal peptides identified by database searches with the popular MaxQuant software package by integrating information from multiple data sources. MANTI utilizes diverse annotation information in a multistep decision process to assign a conservative preferred protein entry for each N-terminal peptide, enabling automated classification according to the likely origin and determines significant changes in N-terminal peptide abundance. Auxiliary R scripts included in the software package summarize and visualize key aspects of the data. To showcase the utility of MANTI, we generated two large-scale TAILS N-terminome data sets from two different animal models of chemically and genetically induced kidney disease, puromycin adenonucleoside-treated rats (PAN), and heterozygous Wilms Tumor protein 1 mice (WT1). MANTI enabled rapid validation and autonomous annotation of >10 000 identified terminal peptides, revealing novel proteolytic proteoforms in 905 and 644 proteins, respectively. Quantitative analysis indicated that proteolytic activities with similar sequence specificity are involved in the pathogenesis of kidney injury and proteinuria in both models, whereas coagulation processes and complement activation were specifically induced after chemical injury.",
                "authors": [
                    {
                        "name": "Demir F."
                    },
                    {
                        "name": "Kizhakkedathu J.N."
                    },
                    {
                        "name": "Rinschen M.M."
                    },
                    {
                        "name": "Huesgen P.F."
                    }
                ],
                "date": "2021-04-06T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "MANTI: Automated Annotation of Protein N-Termini for Rapid Interpretation of N-Terminome Data Sets"
            },
            "pmcid": "PMC8027985",
            "pmid": "33729755"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        }
    ]
}