
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.ikmb.uni-kiel.de/contact-ikmb"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.ikmb.uni-kiel.de/pibase/#tutorial"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            },
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/pibase-1-4-7-validational-comparative-analysis-bam-files.html"
        }
    ],
    "publication": [
        {
            "abstract": "Scientists working with single-nucleotide variants (SNVs), inferred by next-generation sequencing software, often need further information regarding true variants, artifacts and sequence coverage gaps. In clinical diagnostics, e.g. SNVs must usually be validated by visual inspection or several independent SNV-callers. We here demonstrate that 0.5-60% of relevant SNVs might not be detected due to coverage gaps, or might be misidentified. Even low error rates can overwhelm the true biological signal, especially in clinical diagnostics, in research comparing healthy with affected cells, in archaeogenetic dating or in forensics. For these reasons, we have developed a package called pibase, which is applicable to diploid and haploid genome, exome or targeted enrichment data. pibase extracts details on nucleotides from alignment files at user-specified coordinates and identifies reproducible genotypes, if present. In test cases pibase identifies genotypes at 99.98% specificity, 10-fold better than other tools. pibase also provides pair-wise comparisons between healthy and affected cells using nucleotide signals (10-fold more accurately than a genotype-based approach, as we show in our case study of monozygotic twins). This comparison tool also solves the problem of detecting allelic imbalance within heterozygous SNVs in copy number variation loci, or in heterogeneous tumor sequences. © 2012 The Author(s). Published by Oxford University Press.",
            "authors": [
                "Forster M.",
                "Forster P.",
                "Elsharawy A.",
                "Hemmrich G.",
                "Kreck B.",
                "Wittig M.",
                "Thomsen I.",
                "Stade B.",
                "Barann M.",
                "Ellinghaus D.",
                "Petersen B.-S.",
                "May S.",
                "Melum E.",
                "Schilhabel M.B.",
                "Keller A.",
                "Schreiber S.",
                "Rosenstiel P.",
                "Franke A."
            ],
            "cit_count": 17,
            "journal": "Nucleic Acids Research",
            "pmid": "22965131",
            "title": "From next-generation sequencing alignments to accurate comparison and validation of single-nucleotide variants: The pibase software",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:pibase",
        "biotoolsID": "pibase",
        "description": "Tool for validating novel Single Nucleotide Variants (SNVs). It utilizes the details in the alignment files in order to identify the reproducible genotypes, hence distinguishing the true variants from artifacts. It can also be used to compare the nucleotide signals in different BAM files.",
        "homepage": "http://www.ikmb.uni-kiel.de/pibase/",
        "name": "pibase"
    }
}