{
    "additionDate": "2019-11-14T19:54:39Z",
    "biotoolsCURIE": "biotools:crop-network",
    "biotoolsID": "crop-network",
    "confidence_flag": "tool",
    "description": "Coordinated Panel Visualization for Biological Networks Analysis | CroP – Coordinated Panels Visualization | The Computational Design and Visualization Lab focuses on multidisciplinary research bringing together Computer Science, Graphic Design and New Media Art | CroP is a visualization tool aimed at highlighting patterns of data in networks integrated with temporal data and analyzing their behaviors over time through dynamic visualization models in a coordinated multiple views layout",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cdv.dei.uc.pt/wp-content/uploads/2018/11/CroP-Manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Software package",
            "url": "https://www.dropbox.com/s/5b3clmu0b2jt8cy/CroP%20-%20Coordinated%20Panel%20Visualization.zip?dl=0"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://cdv.dei.uc.pt/crop/",
    "lastUpdate": "2020-12-17T08:50:12Z",
    "name": "CroP",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ688",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.CroP is a data visualization application that focuses on the analysis of relational data that changes over time. While it was specifically designed for addressing the preeminent need to interpret large scale time series from gene expression studies, CroP is prepared to analyze datasets from multiple contexts. Multiple datasets can be uploaded simultaneously and viewed through dynamic visualization models, which are contained within flexible panels that allow users to adapt the workspace to their data. Through clustering and the time curve visualization it is possible to quickly identify groups of data points with similar proprieties or behaviors, as well as temporal patterns across all points, such as periodic waves of expression. Additionally, it integrates a public biomedical database for gene annotation. CroP will be of major interest to biologists who seek to extract relations from complex sets of data.",
                "authors": [
                    {
                        "name": "Cruz A."
                    },
                    {
                        "name": "MacHado P."
                    },
                    {
                        "name": "Arrais J.P."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "CroP-Coordinated Panel visualization for biological networks analysis"
            },
            "pmid": "31504214"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}