{
    "additionDate": "2021-01-18T12:06:09Z",
    "biotoolsCURIE": "biotools:drugcentral",
    "biotoolsID": "drugcentral",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "toprea@salud.unm.edu",
            "name": "Tudor I Oprea",
            "typeEntity": "Person"
        }
    ],
    "description": "DrugCentral integrates structure, bioactivity, regulatory, pharmacologic actions and indications for active pharmaceutical ingredients approved by FDA and other regulatory agencies. Monitoring of regulatory agencies for new drugs approvals ensures the resource is up-to-date. DrugCentral integrates content for active ingredients with pharmaceutical formulations, indexing drugs and drug label annotations, complementing similar resources available online.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "http://drugcentral.org",
    "lastUpdate": "2021-03-03T19:47:36Z",
    "name": "DrugCentral",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/nar/gkw993",
            "metadata": {
                "abstract": "© The Author(s) 2016.DrugCentral (http://drugcentral.org) is an openaccess online drug compendium. DrugCentral integrates structure, bioactivity, regulatory, pharmacologic actions and indications for active pharmaceutical ingredients approved by FDA and other regulatory agencies. Monitoring of regulatory agencies for new drugs approvals ensures the resource is upto- date. DrugCentral integrates content for active ingredients with pharmaceutical formulations, indexing drugs and drug label annotations, complementing similar resources available online. Its complementarity with other online resources is facilitated by cross referencing to external resources. At the molecular level, DrugCentral bridges drug-target interactions with pharmacological action and indications. The integration with FDA drug labels enables text mining applications for drug adverse events and clinical trial information. Chemical structure overlap between DrugCentral and five online drug resources, and the overlap between DrugCentral FDA-approved drugs and their presence in four different chemical collections, are discussed. DrugCentral can be accessed via the web application or downloaded in relational database format.",
                "authors": [
                    {
                        "name": "Bologa C.G."
                    },
                    {
                        "name": "Holmes J."
                    },
                    {
                        "name": "Knockel J."
                    },
                    {
                        "name": "Mathias S.L."
                    },
                    {
                        "name": "Nelson S.J."
                    },
                    {
                        "name": "Oprea T.I."
                    },
                    {
                        "name": "Ursu O."
                    },
                    {
                        "name": "Yang J.J."
                    }
                ],
                "citationCount": 109,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DrugCentral: Online drug compendium"
            },
            "pmcid": "PMC5210665",
            "pmid": "27789690",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/NAR/GKAA997",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.DrugCentral is a public resource (http://drugcentral.org) that serves the scientific community by providing up-to-date drug information, as described in previous papers. The current release includes 109 newly approved (October 2018 through March 2020) active pharmaceutical ingredients in the US, Europe, Japan and other countries; and two molecular entities (e.g. mefuparib) of interest for COVID19. New additions include a set of pharmacokinetic properties for ∼1000 drugs, and a sex-based separation of side effects, processed from FAERS (FDA Adverse Event Reporting System); as well as a drug repositioning prioritization scheme based on the market availability and intellectual property rights forFDA approved drugs. In the context of the COVID19 pandemic, we also incorporated REDIAL-2020, a machine learning platform that estimates anti-SARS-CoV-2 activities, as well as the 'drugs in news' feature offers a brief enumeration of the most interesting drugs at the present moment. The full database dump and data files are available for download from the DrugCentral web portal.",
                "authors": [
                    {
                        "name": "Avram S."
                    },
                    {
                        "name": "Bocci G."
                    },
                    {
                        "name": "Bologa C.G."
                    },
                    {
                        "name": "Bora A."
                    },
                    {
                        "name": "Curpan R."
                    },
                    {
                        "name": "Halip L."
                    },
                    {
                        "name": "Holmes J."
                    },
                    {
                        "name": "Knockel J."
                    },
                    {
                        "name": "Nguyen D.-T."
                    },
                    {
                        "name": "Oprea T.I."
                    },
                    {
                        "name": "Sirimulla S."
                    },
                    {
                        "name": "Ursu O."
                    },
                    {
                        "name": "Wilson T.B."
                    },
                    {
                        "name": "Yang J.J."
                    }
                ],
                "citationCount": 8,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DrugCentral 2021 supports drug discovery and repositioning"
            },
            "pmid": "33151287"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Drug metabolism",
            "uri": "http://edamontology.org/topic_3375"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
