{
    "additionDate": "2020-01-14T09:05:31Z",
    "biotoolsCURIE": "biotools:Snorkel_DryBell",
    "biotoolsID": "Snorkel_DryBell",
    "confidence_flag": "high",
    "description": "A Case Study in Deploying Weak Supervision at Industrial Scale.\n\nProgrammatically Building and Managing Training Data.\n\nBuild Training Sets Programmatically.\n\nLabeling and managing training datasets by hand is one of the biggest bottlenecks in machine learning. In Snorkel, write heuristic functions to do this programmatically instead!",
    "editPermission": {
        "type": "public"
    },
    "homepage": "http://snorkel.stanford.edu",
    "lastUpdate": "2020-01-14T09:05:31Z",
    "name": "Snorkel DryBell",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1145/3299869.3314036",
            "metadata": {
                "abstract": "© 2019 Copyright held by the owner/author(s).Labeling training data is one of the most costly bottlenecks in developing machine learning-based applications. We present a first-of-its-kind study showing how existing knowledge resources from across an organization can be used as weak supervision in order to bring development time and cost down by an order of magnitude, and introduce Snorkel DryBell, a new weak supervision management system for this setting. Snorkel DryBell builds on the Snorkel framework, extending it in three critical aspects: flexible, template-based ingestion of diverse organizational knowledge, cross-feature production serving, and scalable, sampling-free execution. On three classification tasks at Google, we find that Snorkel DryBell creates classifiers of comparable quality to ones trained with tens of thousands of hand-labeled examples, converts non-servable organizational resources to servable models for an average 52% performance improvement, and executes over millions of data points in tens of minutes.",
                "authors": [
                    {
                        "name": "Bach S.H."
                    },
                    {
                        "name": "Rodriguez D."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Luo C."
                    },
                    {
                        "name": "Shao H."
                    },
                    {
                        "name": "Xia C."
                    },
                    {
                        "name": "Sen S."
                    },
                    {
                        "name": "Ratner A."
                    },
                    {
                        "name": "Hancock B."
                    },
                    {
                        "name": "Alborzi H."
                    },
                    {
                        "name": "Kuchhal R."
                    },
                    {
                        "name": "Re C."
                    },
                    {
                        "name": "Malkin R."
                    }
                ],
                "citationCount": 5,
                "date": "2019-06-25T00:00:00Z",
                "journal": "Proceedings of the ACM SIGMOD International Conference on Management of Data",
                "title": "Snorkel Drybell: A case study in deploying weak supervision at industrial scale"
            },
            "pmcid": "PMC6879379",
            "pmid": "31777414"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}