{
    "additionDate": "2021-10-25T08:45:19.647192Z",
    "biotoolsCURIE": "biotools:octsurf",
    "biotoolsID": "octsurf",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "minghu.song@uconn.edu",
            "name": "Minghu Song",
            "orcidid": "https://orcid.org/0000-0003-0887-0767",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "OctSurf is a efficient hierarchical voxel-based molecular surface representation tool for protein-ligand affinity prediction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular surface comparison",
                    "uri": "http://edamontology.org/operation_3666"
                }
            ]
        }
    ],
    "homepage": "https://github.uconn.edu/mldrugdiscovery/OctSurf",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2021-10-25T08:45:19.649674Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.uconn.edu/mldrugdiscovery/OctSurf/issues"
        }
    ],
    "name": "OctSurf",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/J.JMGM.2021.107865",
            "metadata": {
                "abstract": "© 2021 Elsevier Inc.Voxel-based 3D convolutional neural networks (CNNs) have been applied to predict protein-ligand binding affinity. However, the memory usage and computation cost of these voxel-based approaches increase cubically with respect to spatial resolution and sometimes make volumetric CNNs intractable at higher resolutions. Therefore, it is necessary to develop memory-efficient alternatives that can accelerate the convolutional operation on 3D volumetric representations of the protein-ligand interaction. In this study, we implement a novel volumetric representation, OctSurf, to characterize the 3D molecular surface of protein binding pockets and bound ligands. The OctSurf surface representation is built based on the octree data structure, which has been widely used in computer graphics to efficiently represent and store 3D object data. Vanilla 3D-CNN approaches often divide the 3D space of objects into equal-sized voxels. In contrast, OctSurf recursively partitions the 3D space containing the protein-ligand pocket into eight subspaces called octants. Only those octants containing van der Waals surface points of protein or ligand atoms undergo the recursive subdivision process until they reach the predefined octree depth, whereas unoccupied octants are kept intact to reduce the memory cost. Resulting non-empty leaf octants approximate molecular surfaces of the protein pocket and bound ligands. These surface octants, along with their chemical and geometric features, are used as the input to 3D-CNNs. Two kinds of CNN architectures, VGG and ResNet, are applied to the OctSurf representation to predict binding affinity. The OctSurf representation consumes much less memory than the conventional voxel representation at the same resolution. By restricting the convolution operation to only octants of the smallest size, our method also alleviates the overall computational overhead of CNN. A series of experiments are performed to demonstrate the disk storage and computational efficiency of the proposed learning method. Our code is available at the following GitHub repository: https://github.uconn.edu/mldrugdiscovery/OctSurf.",
                "authors": [
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Wang P.-S."
                    },
                    {
                        "name": "Zhu C."
                    },
                    {
                        "name": "Gaines B.B."
                    },
                    {
                        "name": "Zhu T."
                    },
                    {
                        "name": "Bi J."
                    },
                    {
                        "name": "Song M."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "Journal of Molecular Graphics and Modelling",
                "title": "OctSurf: Efficient hierarchical voxel-based molecular surface representation for protein-ligand affinity prediction"
            },
            "pmid": "33640787",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ]
}