{
    "additionDate": "2020-01-09T18:14:19Z",
    "biotoolsCURIE": "biotools:SEECancer",
    "biotoolsID": "SEECancer",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "afadaka@uwc.ac.za",
            "name": "Adewale Oluwaseun Fadaka",
            "typeEntity": "Person"
        }
    ],
    "description": "Functional Prediction of Candidate MicroRNAs for CRC Management Using in Silico Approach.\n\nClick evolutionary stage to quick search early late relapse metastasis drug resistant drug induced.\n\nCancer is driven by accumulating somatic alterations which confer normal cells fitness advantage to evolve from a premalignant status to malignant tumor. The SEECancer database presents the comprehensive cancer evolutionary stage-specific somatic events (including early-specific, late-specific, relapse-specific, metastasis-specific, drug-resistant and drug-induced genomic events) and their temporal orders.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'GeneMANIA' (bio.tools/genemania), 'Trident', 'Mfold' (bio.tools/mfold), 'Cytoscape' (bio.tools/cytoscape)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "http://biocc.hrbmu.edu.cn/SEECancer/index.jsp",
    "lastUpdate": "2020-01-09T18:14:19Z",
    "name": "SEECancer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/IJMS20205190",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Approximately 30–50% of malignant growths can be prevented by avoiding risk factors and implementing evidence-based strategies. Colorectal cancer (CRC) accounted for the second most common cancer and the third most common cause of cancer death worldwide. This cancer subtype can be reduced by early detection and patients’ management. In this study, the functional roles of the identified microRNAs were determined using an in silico pipeline. Five microRNAs identified using an in silico approach alongside their seven target genes from our previous study were used as datasets in this study. Furthermore, the secondary structure and the thermodynamic energies of the microRNAs were revealed by Mfold algorithm. The triplex binding ability of the oligonucleotide with the target promoters were analyzed by Trident. Finally, evolutionary stage-specific somatic events and co-expression analysis of the target genes in CRC were analyzed by SEECancer and GeneMANIA plugin in Cytoscape. Four of the five microRNAs have the potential to form more than one secondary structure. The ranges of the observed/expected ratio of CpG dinucleotides of these genes range from 0.60 to 1.22. Three of the candidate microRNA were capable of forming multiple triplexes along with three of the target mRNAs. Four of the total targets were involved in either early or metastatic stage-specific events while three other genes were either a product of antecedent or subsequent events of the four genes implicated in CRC. The secondary structure of the candidate microRNAs can be used to explain the different degrees of genetic regulation in CRC due to their conformational role to modulate target interaction. Furthermore, due to the regulation of important genes in the CRC pathway and the enrichment of the microRNA with triplex binding sites, they may be a useful diagnostic biomarker for the disease subtype.",
                "authors": [
                    {
                        "name": "Fadaka A.O."
                    },
                    {
                        "name": "Pretorius A."
                    },
                    {
                        "name": "Klein A."
                    }
                ],
                "citationCount": 2,
                "date": "2019-10-02T00:00:00Z",
                "journal": "International Journal of Molecular Sciences",
                "title": "Functional prediction of candidate micrornas for crc management using in silico approach"
            },
            "pmcid": "PMC6834124",
            "pmid": "31635135"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}