{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:11:43Z",
    "biotoolsCURIE": "biotools:LanceletDB",
    "biotoolsID": "LanceletDB",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lssxal@mail.sysu.edu.cn",
            "name": "Anlong Xu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "url": "http://genome.bucm.edu.cn/lancelet/mail.php"
        }
    ],
    "description": "Integrated genome database for lancelet, comparing domain types and combination in orthologues among lancelet and other species.",
    "download": [
        {
            "type": "Biological data",
            "url": "http://genome.bucm.edu.cn/lancelet/download_data.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://genome.bucm.edu.cn/lancelet/",
    "language": [
        "Java",
        "PHP",
        "Perl"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "LanceletDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ056",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Lancelet (amphioxus) represents the most basally divergent extant chordate (cephalochordates) that diverged from the other two chordate lineages (urochordates and vertebrates) more than half a billion years ago. As it occupies a key position in evolution, it is considered as one of the best proxies for understanding the chordate ancestral state. Thus, the construction of a database with multiple lancelet genomes and gene annotation data, including protein domains, is urgently needed to investigate the loss and gain of domains in orthologues among species, especially ancient domain types (non-vertebrate-specific domains) and novel domain combination, which is helpful for providing new insight into the chordate ancestral state and vertebrate evolution. Here, we present an integrated genome database for lancelet, LanceletDB, which provides reference haploid genome sequence and annotation data for lancelet (Branchiostoma belcheri), including gene models and annotation, protein domain types, gene expression pattern in embryogenesis, different expression sequence tag sets and alternative polyadenylation (APA) sites profiled by the sequencing APA sites method. Especially, LanceletDB allows comparison of domain types and combination in orthologues among type species so as to decode the ancient domain types and novel domain combination during evolution. We also integrated the released diploid lancelet genome annotation data (Branchiostoma floridae) to expand LanceletDB and extend its usefulness. These data are available through the search and analysis page, basic local alignment search tool page and genome browser to provide an integrated display.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Chi J."
                    },
                    {
                        "name": "Feng Y."
                    },
                    {
                        "name": "Gao X."
                    },
                    {
                        "name": "Huang G."
                    },
                    {
                        "name": "Huang S."
                    },
                    {
                        "name": "Li T."
                    },
                    {
                        "name": "Liu A."
                    },
                    {
                        "name": "Sang X."
                    },
                    {
                        "name": "Xu A."
                    },
                    {
                        "name": "You L."
                    },
                    {
                        "name": "Yu T."
                    },
                    {
                        "name": "Yue Z."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "LanceletDB: An integrated genome database for lancelet, comparing domain types and combination in orthologues among lancelet and other species"
            },
            "pmcid": "PMC6526094",
            "pmid": "31106360",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal",
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
