{
    "name": "BIONJ", 
    "description": "This software is well suited for distances estimated from DNA or protein sequences. It has better topological accuracy than NJ in all evolutionary conditions; its superiority becomes important when the substitution rates are high and varying among lineages.", 
    "homepage": "http://www.atgc-montpellier.fr/bionj/", 
    "biotoolsID": "bionj", 
    "biotoolsCURIE": "biotools:bionj", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0557", 
                    "term": "Phylogenetic tree distances calculation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3299", 
            "term": "Evolutionary biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3293", 
            "term": "Phylogenetics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0084", 
            "term": "Phylogeny"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/bionj-distance-based-phylogeny-reconstruction-algorithm.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.atgc-montpellier.fr/bionj/paper.php", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "9254330", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "BIONJ: An improved version of the NJ algorithm based on a simple model of sequence data", 
                "abstract": "We propose an improved version of the neighbor-joining (NJ) algorithm of Saitou and Nei. This new algorithm, BIONJ, follows the same agglomerative scheme as NJ, which consists of iteratively picking a pair of taxa, creating a new node which represents the cluster of these taxa, and reducing the distance matrix by replacing both taxa by this node. Moreover, BIONJ uses a simple first-order model of the variances and covariances of evolutionary distance estimates. This model is well adapted when these estimates are obtained from aligned sequences. At each step it permits the selection, from the class of admissible reductions, of the reduction which minimizes the variance of the new distance matrix. In this way, we obtain better estimates to choose the pair of taxa to be agglomerated during the next steps. Moreover, in comparison with NJ's estimates, these estimates become better and better as the algorithm proceeds. BIONJ retains the good properties of NJ-especially its low run time. Computer simulations have been performed with 12-taxon model trees to determine BIONJ's efficiency. When the substitution rates are low (maximum pairwise divergence κ0.1 substitutions per site) or when they are constant among lineages, BIONJ is only slightly better than NJ. When the substitution rates are higher and vary among lineages, BIONJ clearly has better topological accuracy. In the latter case, for the model trees and the conditions of evolution tested, the topological error reduction is on the average around 20%. With highly-varying-rate trees and with high substitution rates (maximum pairwise divergence κ1.0 substitutions per site), the error reduction may even rise above 50%, while the probability of finding the correct tree may be augmented by as much as 15%.", 
                "date": "1997-01-01T00:00:00Z", 
                "citationCount": 1076, 
                "authors": [
                    {
                        "name": "Gascuel O."
                    }
                ], 
                "journal": "Molecular Biology and Evolution"
            }
        }
    ], 
    "credit": [
        {
            "name": "Eric RIVALS", 
            "email": "Eric.Rivals@lirmm.fr", 
            "url": "http://www.lirmm.fr/~gascuel/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:36:58Z", 
    "lastUpdate": "2018-12-10T12:58:55Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}