{
    "additionDate": "2021-01-18T11:27:43Z",
    "biotoolsCURIE": "biotools:lcc",
    "biotoolsID": "lcc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "thiago.paula.oliveira@usp.br",
            "name": "Thiago P. Oliveira",
            "orcidid": "https://orcid.org/0000-0002-4555-2584",
            "typeEntity": "Person"
        }
    ],
    "description": "An R package to estimate the concordance correlation, Pearson correlation and accuracy over time.\n\nlcc is a package under development based on estimation procedures for longitudinal concordance correlation (lcc), longitudinal Pearson correlation (lpc), and longitudinal accuracy (la) through fixed effects and variance components of polynomial mixed-effect regression model.\n\nLongitudinal Concordance Correlation.\n\nEstimates the longitudinal concordance correlation to access the longitudinal agreement profile.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://prof-thiagooliveira.shinyapps.io/lccApp/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-12T11:20:00Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=lcc"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/web/packages/lcc/index.html"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Prof-ThiagoOliveira/lcc"
        }
    ],
    "name": "lcc",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.7717/PEERJ.9850",
            "metadata": {
                "abstract": "Copyright 2020 Oliveira et al.Background and Objective: Observational studies and experiments in medicine, pharmacology and agronomy are often concerned with assessing whether different methods/raters produce similar values over the time when measuring a quantitative variable. This article aims to describe the statistical package lcc, for are, that can be used to estimate the extent of agreement between two (or more) methods over the time, and illustrate the developed methodology using three real examples. Methods: The longitudinal concordance correlation, longitudinal Pearson correlation, and longitudinal accuracy functions can be estimated based on fixed effects and variance components of the mixed-effects regression model. Inference is made through bootstrap confidence intervals and diagnostic can be done via plots, and statistical tests. Results: The main features of the package are estimation and inference about the extent of agreement using numerical and graphical summaries. Moreover, our approach accommodates both balanced and unbalanced experimental designs or observational studies, and allows for different within-group error structures, while allowing for the inclusion of covariates in the linear predictor to control systematic variations in the response. All examples show that our methodology is flexible and can be applied to many different data types. Conclusions: The lcc package, available on the CRAN repository, proved to be a useful tool to describe the agreement between two or more methods over time, allowing the detection of changes in the extent of agreement. The inclusion of different structures for the variance-covariance matrices of random effects and residuals makes the package flexible for working with different types of databases.",
                "authors": [
                    {
                        "name": "Oliveira T.P."
                    },
                    {
                        "name": "Moral R.A."
                    },
                    {
                        "name": "Zocchi S.S."
                    },
                    {
                        "name": "Demetrio C.G.B."
                    },
                    {
                        "name": "Hinde J."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "lcc: An R package to estimate the concordance correlation, Pearson correlation and accuracy over time"
            },
            "pmcid": "PMC7502249",
            "pmid": "32995081"
        }
    ],
    "toolType": [
        "Web service",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}