{
    "accessibility": "Restricted access",
    "additionDate": "2019-08-09T13:07:57Z",
    "biotoolsCURIE": "biotools:coreMRI",
    "biotoolsID": "coreMRI",
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "aletras@auth.gr",
            "name": "Anthony H. Aletras",
            "orcidid": "https://orcid.org/0000-0002-3786-3817",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "info@coremri.com",
            "url": "https://www.coremri.org/index.php/contact-us"
        }
    ],
    "description": "Cloud-ORiented Engine for advanced MRI simulations (coreMRI) - high-performance, publicly available MR simulation platform on the cloud.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.coremri.org/documentation"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://www.coreMRI.org",
    "language": [
        "JavaScript",
        "Java"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "coreMRI",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0216594",
            "metadata": {
                "abstract": "© 2019 Xanthis, Aletras. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Introduction A Cloud-ORiented Engine for advanced MRI simulations (coreMRI) is presented in this study. The aim was to develop the first advanced MR simulation platform delivered as a web service through an on-demand, scalable cloud-based and GPU-based infrastructure. We hypothesized that such an online MR simulation platform could be utilized as a virtual MRI scanner but also as a cloud-based, high-performance engine for advanced MR simulations in simulation-based quantitative MR (qMR) methods. Methods and results The simulation framework of coreMRI was based on the solution of the Bloch equations and utilized a ground-up-approach design based on the principles already published in the literature. The development of a front-end environment allowed the connection of the end-users to the GPU-equipped instances on the cloud. The coreMRI simulation platform was based on a modular design where individual modules (such as the Gadgetron reconstruction framework and a newly developed Pulse Sequence Designer) could be inserted in the main simulation framework. Different types and sources of pulse sequences and anatomical models were utilized in this study revealing the flexibility that the coreMRI simulation platform offers to the users. The performance and scalability of coreMRI were also examined on multi-GPU configurations on the cloud, showing that a multi-GPU computer on the cloud equipped with a newer generation of GPU cards could significantly mitigate the prolonged execution times that accompany more realistic MRI and qMR simulations. Conclusions coreMRI is available to the entire MR community, whereas its high performance and scalability allow its users to configure advanced MRI experiments without the constraints imposed by experimentation in a true MRI scanner (such as time constraint and limited availability of MR scanners), without upfront investment for purchasing advanced computer systems and without any user expertise on computer programming or MR physics. coreMRI is available to the users through the webpage https://www.coreMRI.org.",
                "authors": [
                    {
                        "name": "Xanthis C.G."
                    },
                    {
                        "name": "Aletras A.H."
                    }
                ],
                "date": "2019-05-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "CoreMRI: A high-performance, publicly available MR simulation platform on the cloud"
            },
            "pmcid": "PMC6524794",
            "pmid": "31100074",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ],
    "validated": 1
}