{
    "additionDate": "2020-01-14T08:59:49Z",
    "biotoolsCURIE": "biotools:Shift-T",
    "biotoolsID": "Shift-T",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "meiering@uwaterloo.ca",
            "name": "Elizabeth M. Meiering",
            "typeEntity": "Person"
        }
    ],
    "description": "Temperature dependence of NMR chemical shifts.\n\nAutomated Variable-Temperature NMR Data Analysis.\n\nServer for analysis of variable temperature NMR data.\n\nNMR chemical shifts are extremely sensitive probes of molecular structure. The temperature dependences of protein chemical shifts are of interest because they offer insight into structure and dynamics. The Shift-T web server is designed to automate the analysis of protein solution NMR 1H-15N correlation spectra collected over a range of temperatures. Services include:.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/AnnoTree (UWATERLOO.CA)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak detection",
                    "uri": "http://edamontology.org/operation_3215"
                },
                {
                    "term": "Nucleic acid curvature calculation",
                    "uri": "http://edamontology.org/operation_0461"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "http://meieringlab.uwaterloo.ca/shiftt",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-14T08:59:49Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/meiering-lab/Shift-T"
        }
    ],
    "name": "Shift-T",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PRO.3785",
            "metadata": {
                "abstract": "© 2019 The Protein SocietyIsotropic chemical shifts measured by solution nuclear magnetic resonance (NMR) spectroscopy offer extensive insights into protein structure and dynamics. Temperature dependences add a valuable dimension; notably, the temperature dependences of amide proton chemical shifts are valuable probes of hydrogen bonding, temperature-dependent loss of structure, and exchange between distinct protein conformations. Accordingly, their uses include structural analysis of both folded and disordered proteins, and determination of the effects of mutations, binding, or solution conditions on protein energetics. Fundamentally, these temperature dependences result from changes in the local magnetic environments of nuclei, but correlations with global thermodynamic parameters measured via calorimetric methods have been observed. Although the temperature dependences of amide proton and nitrogen chemical shifts are often well approximated by a linear model, deviations from linearity are also observed and may be interpreted as evidence of fast exchange between distinct conformational states. Here, we describe computational methods, accessible via the Shift-T web server, including an automated tracking algorithm that propagates initial (single temperature) 1H15N cross peak assignments to spectra collected over a range of temperatures. Amide proton and nitrogen temperature coefficients (slopes determined by fitting chemical shift vs. temperature data to a linear model) are subsequently calculated. Also included are methods for the detection of systematic, statistically significant deviation from linearity (curvature) in the temperature dependences of amide proton chemical shifts. The use and utility of these methods are illustrated by example, and the Shift-T web server is freely available at http://meieringlab.uwaterloo.ca/shiftt.",
                "authors": [
                    {
                        "name": "Trainor K."
                    },
                    {
                        "name": "Palumbo J.A."
                    },
                    {
                        "name": "MacKenzie D.W.S."
                    },
                    {
                        "name": "Meiering E.M."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "Temperature dependence of NMR chemical shifts: Tracking and statistical analysis"
            },
            "pmcid": "PMC6933856",
            "pmid": "31730280"
        }
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}