{
    "accessibility": "Open access",
    "additionDate": "2023-02-13T17:38:17.220592Z",
    "biotoolsCURIE": "biotools:smma-hnrl",
    "biotoolsID": "smma-hnrl",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "lijianwei@hebut.edu.cn",
            "name": "Jianwei Li",
            "typeEntity": "Person"
        },
        {
            "name": "Baoqin Wu"
        },
        {
            "name": "Hongxin Lin"
        },
        {
            "name": "Yinfei Wang"
        },
        {
            "name": "Zhiguang Li"
        }
    ],
    "description": "Prediction of potential small molecule−miRNA associations based on heterogeneous network representation learning.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SMMA-HNRL/SMMA-HNRL",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-13T17:38:17.223367Z",
    "license": "Not licensed",
    "name": "SMMA-HNRL",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/FGENE.2022.1079053",
            "metadata": {
                "abstract": "Copyright © 2022 Li, Lin, Wang, Li and Wu.MicroRNAs (miRNAs) are closely associated with the occurrences and developments of many complex human diseases. Increasing studies have shown that miRNAs emerge as new therapeutic targets of small molecule (SM) drugs. Since traditional experiment methods are expensive and time consuming, it is particularly crucial to find efficient computational approaches to predict potential small molecule-miRNA (SM-miRNA) associations. Considering that integrating multi-source heterogeneous information related with SM-miRNA association prediction would provide a comprehensive insight into the features of both SMs and miRNAs, we proposed a novel model of Small Molecule-MiRNA Association prediction based on Heterogeneous Network Representation Learning (SMMA-HNRL) for more precisely predicting the potential SM-miRNA associations. In SMMA-HNRL, a novel heterogeneous information network was constructed with SM nodes, miRNA nodes and disease nodes. To access and utilize of the topological information of the heterogeneous information network, feature vectors of SM and miRNA nodes were obtained by two different heterogeneous network representation learning algorithms (HeGAN and HIN2Vec) respectively and merged with connect operation. Finally, LightGBM was chosen as the classifier of SMMA-HNRL for predicting potential SM-miRNA associations. The 10-fold cross validations were conducted to evaluate the prediction performance of SMMA-HNRL, it achieved an area under of ROC curve of 0.9875, which was superior to other three state-of-the-art models. With two independent validation datasets, the test experiment results revealed the robustness of our model. Moreover, three case studies were performed. As a result, 35, 37, and 22 miRNAs among the top 50 predicting miRNAs associated with 5-FU, cisplatin, and imatinib were validated by experimental literature works respectively, which confirmed the effectiveness of SMMA-HNRL. The source code and experimental data of SMMA-HNRL are available at https://github.com/SMMA-HNRL/SMMA-HNRL.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Lin H."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wu B."
                    }
                ],
                "date": "2022-12-02T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Prediction of potential small molecule−miRNA associations based on heterogeneous network representation learning"
            },
            "pmcid": "PMC9755196",
            "pmid": "36531225"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ]
}
