{
    "additionDate": "2020-01-14T09:03:18Z",
    "biotoolsCURIE": "biotools:sumrep",
    "biotoolsID": "sumrep",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "branden.olson@gmail.com",
            "name": "Branden J. Olson",
            "typeEntity": "Person"
        },
        {
            "email": "ematsen@gmail.com",
            "name": "Frederick A. Matsen",
            "typeEntity": "Person"
        }
    ],
    "description": "sumrep is a package for summarizing, visualizing, and comparing immune receptor repertoires. It contains dozens of different summary statistics to be applied on various levels of assumptions, from raw query reads to inferred phylogenies, as well as easy and principled ways to plot and compare repertoires. It currently supports the IgH, IgL, IgK, TRA, and TRB loci.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "homepage": "https://github.com/matsengrp/sumrep",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-01-16T14:35:28Z",
    "name": "sumrep",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FIMMU.2019.02533",
            "metadata": {
                "abstract": "© Copyright © 2019 Olson, Moghimi, Schramm, Obraztsova, Ralph, Vander Heiden, Shugay, Shepherd, Lees and Matsen.The adaptive immune system generates an incredible diversity of antigen receptors for B and T cells to keep dangerous pathogens at bay. The DNA sequences coding for these receptors arise by a complex recombination process followed by a series of productivity-based filters, as well as affinity maturation for B cells, giving considerable diversity to the circulating pool of receptor sequences. Although these datasets hold considerable promise for medical and public health applications, the complex structure of the resulting adaptive immune receptor repertoire sequencing (AIRR-seq) datasets makes analysis difficult. In this paper we introduce sumrep, an R package that efficiently performs a wide variety of repertoire summaries and comparisons, and show how sumrep can be used to perform model validation. We find that summaries vary in their ability to differentiate between datasets, although many are able to distinguish between covariates such as donor, timepoint, and cell type for BCR and TCR repertoires. We show that deletion and insertion lengths resulting from V(D)J recombination tend to be more discriminative characterizations of a repertoire than summaries that describe the amino acid composition of the CDR3 region. We also find that state-of-the-art generative models excel at recapitulating gene usage and recombination statistics in a given experimental repertoire, but struggle to capture many physiochemical properties of real repertoires.",
                "authors": [
                    {
                        "name": "Olson B.J."
                    },
                    {
                        "name": "Moghimi P."
                    },
                    {
                        "name": "Schramm C.A."
                    },
                    {
                        "name": "Obraztsova A."
                    },
                    {
                        "name": "Ralph D."
                    },
                    {
                        "name": "Vander Heiden J.A."
                    },
                    {
                        "name": "Shugay M."
                    },
                    {
                        "name": "Shepherd A.J."
                    },
                    {
                        "name": "Lees W."
                    },
                    {
                        "name": "Matsen F.A."
                    }
                ],
                "citationCount": 6,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "sumrep: A Summary Statistic Framework for Immune Receptor Repertoire Comparison and Model Validation"
            },
            "pmcid": "PMC6838214",
            "pmid": "31736960"
        }
    ],
    "topic": [
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}