{"credit":[],"function":[{"operation":[{"term":"Genotyping","uri":"http://edamontology.org/operation_3196"},{"term":"DNA profiling","uri":"http://edamontology.org/operation_3894"}]}],"labels":{"topic":[{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"DNA polymorphism","uri":"http://edamontology.org/topic_2885"}]},"publication":[{"abstract":"© 2019 Elsevier B.V.Forensic DNA Phenotyping (FDP) provides the ability to predict externally visible characteristics from minute amounts of crime scene DNA, which can help find unknown perpetrators who are typically unidentifiable via conventional forensic DNA profiling. Fundamental human genetics research has led to a better understanding of the specific DNA variants responsible for physical appearance characteristics, particularly eye, hair, and skin color. Recently, we introduced the HIrisPlex-S system for the simultaneous prediction of eye, hair, and skin color based on 41 DNA variants generated from two forensically validated SNaPshot multiplex assays using capillary electrophoresis (CE). Here we introduce massively parallel sequencing (MPS) solutions for the HIrisPlex-S (HPS) system on two MPS platforms commonly used in forensics, Ion Torrent and MiSeq, that cover all 41 DNA variants in a single assay, respectively. Additionally, we present the forensic developmental validation of the two HPS-MPS assays. The Ion Torrent MPS assay, based on Ion AmpliSeq technology, illustrated the successful generation of full HIrisPlex-S genotypic profiles from 100 pg of input control DNA, while the MiSeq MPS assay based on an in-house design yielded complete profiles from 250 pg of input DNA. Assessing simulated forensic casework samples such as saliva, hair (bulb), blood, semen, and low quantity touch DNA, as well as artificially damaged DNA samples, concordance testing, and samples from numerous species, all illustrated the ability of both versions of the HIrisPlex-S MPS assay to produce results that motivate forensic applications. By also providing an integrated bioinformatics analysis pipeline, MPS data can now be analyzed and a file generated for upload to the publically accessible HIrisPlex online webtool (https://hirisplex.erasmusmc.nl). In addition, we updated the website to accept VCF input data for those with genome sequence data. We thus provide a user-friendly and semi-automated MPS workflow from DNA sample to individual eye, hair, and skin color prediction probabilities. Furthermore, we present a 2-person mixture separation tool that not only assesses genotype reliability with regards genotyping confidence but also provides the most fitting mixture scenario for both minor and major contributors, including profile separation. We envision this MPS implementation of the HIrisPlex-S system for eye, hair, and skin color prediction from DNA as a starting point for further expanding MPS-based forensic DNA phenotyping. This may include the future addition of SNPs predictive for more externally visible characteristics, as well as SNPs for bio-geographic ancestry inference, provided the statistical framework for DNA prediction of these traits is in place.","authors":["Breslin K.","Wills B.","Ralf A.","Ventayol Garcia M.","Kukla-Bartoszek M.","Pospiech E.","Freire-Aradas A.","Xavier C.","Ingold S.","de La Puente M.","van der Gaag K.J.","Herrick N.","Haas C.","Parson W.","Phillips C.","Sijen T.","Branicki W.","Walsh S.","Kayser M."],"cit_count":1,"doi":"10.1016/J.FSIGEN.2019.102152","journal":"Forensic Science International: Genetics","pmid":"31518964","title":"HIrisPlex-S system for eye, hair, and skin color prediction from DNA: Massively parallel sequencing solutions for two common forensically used platforms","year":"2019-11-01"}],"summary":{"biotoolsCURIE":"biotools:HIrisPlex-S","biotoolsID":"HIrisPlex-S","description":"> COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/snpitty (ERASMUSMC.NL), bio.tools/ifuse (ERASMUSMC.NL), bio.tools/bigr_xnat (ERASMUSMC.NL) | > CORRECT NAME OF TOOL COULD ALSO BE 'HIrisPlex', 'HIrisPlex-S MPS' | Massively parallel sequencing solutions for two common forensically used platforms | HIrisPlex-S Eye, Hair and Skin Colour DNA Phenotyping Webtool | 8px 9px 10px 11px 12px 13px 14px 15px 16px 17px 18px | With the advancement of DNA phenotyping as a tool in Forensic and Anthropological usage, we now provide an easy to use interactive website to predict eye, hair and skin colour from DNA using the IrisPlex, HIrisPlex and HIrisPlex-S systems","homepage":"https://hirisplex.erasmusmc.nl","name":"HIrisPlex-S"}}