{
    "additionDate": "2020-01-09T17:31:12Z",
    "biotoolsCURIE": "biotools:DNMIVD",
    "biotoolsID": "DNMIVD",
    "confidence_flag": "tool",
    "description": "DNMIVD is a comprehensive annotation and interactive visualization database for DNA methylation profile of diverse human cancer constructed with high throughput microarray data from TCGA and GEO databases, and it also integrates some data from Pancan-meQTL and HACER databases. Overall, DNMIVD mainly contains the following important resources:.\n\nDNA methylation is strongly related to cancer, currently, no resource integratively provides the DNA methylation based diagnostic and prognostic models, e-mQTL (expression–methylation quantitative trait loci), pathway-meQTL (pathway activity-methylation quantitative trait loci), differentially variable and differentially methylated CpGs, survival analysis, as well as functional epigenetic modules for different cancers, which are valuable information for researchers to explore DNA methylation profile from different aspects in cancer",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "Bisulfite mapping",
                    "uri": "http://edamontology.org/operation_3186"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                }
            ]
        }
    ],
    "homepage": "http://www.unimd.org/dnmivd/",
    "lastUpdate": "2020-12-22T09:52:58Z",
    "name": "DNA Methylation Interactive Visualization Database (DNMIVD)",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ830",
            "metadata": {
                "abstract": "© 2019 The Author(s). Published by Oxford University Press on behalf of Nucleic Acids Research.Aberrant DNA methylation plays an important role in cancer progression. However, no resource has been available that comprehensively provides DNA methylation-based diagnostic and prognostic models, expression-methylation quantitative trait loci (emQTL), pathway activity-methylation quantitative trait loci (pathway-meQTL), differentially variable and differentially methylated CpGs, and survival analysis, as well as functional epigenetic modules for different cancers. These provide valuable information for researchers to explore DNA methylation profiles from different aspects in cancer. To this end, we constructed a user-friendly database named DNA Methylation Interactive Visualization Database (DNMIVD), which comprehensively provides the following important resources: (i) diagnostic and prognostic models based on DNA methylation for multiple cancer types of The Cancer Genome Atlas (TCGA); (ii) meQTL, emQTL and pathway-meQTL for diverse cancers; (iii) Functional Epigenetic Modules (FEM) constructed from Protein-Protein Interactions (PPI) and Co-Occurrence and Mutual Exclusive (COME) network by integrating DNA methylation and gene expression data of TCGA cancers; (iv) differentially variable and differentially methylated CpGs and differentially methylated genes as well as related enhancer information; (v) correlations between methylation of gene promoter and corresponding gene expression and (vi) patient survival-associated CpGs and genes with different endpoints. DNMIVD is freely available at http://www.unimd.org/dnmivd/. We believe that DNMIVD can facilitate research of diverse cancers.",
                "authors": [
                    {
                        "name": "Ding W."
                    },
                    {
                        "name": "Chen J."
                    },
                    {
                        "name": "Feng G."
                    },
                    {
                        "name": "Chen G."
                    },
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Ni X."
                    },
                    {
                        "name": "Shi T."
                    }
                ],
                "citationCount": 9,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "DNMIVD: DNA methylation interactive visualization database"
            },
            "pmid": "31598709"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Methylated DNA immunoprecipitation",
            "uri": "http://edamontology.org/topic_3674"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}