{
    "additionDate": "2019-11-14T19:43:27Z",
    "biotoolsCURIE": "biotools:scds",
    "biotoolsID": "scds",
    "confidence_flag": "tool",
    "description": "Computational Annotation of Doublets in Single-Cell RNA Sequencing Data | Instructions to create figures / tables from the scds manuscript | The scds_manuscript/data folder contains directories for each of the four data sets. Each directory contains two files, getRawData.sh and processRawData.R. getRawData.sh downloads the data sets (or contains instructions on how to do so), while processRawData.R can be run to process the input data and generate SingleCellExperiments that contain experimental doublet annotations. For each data set, these annotations are stored in the colData slot",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/kostkalab/scds"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/kostkalab/scds_manuscript",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2020-12-17T09:26:37Z",
    "name": "scds",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ698",
            "metadata": {
                "abstract": "© 2020 Oxford University Press. All rights reserved.Motivation: Single-cell RNA sequencing (scRNA-seq) technologies enable the study of transcriptional heterogeneity at the resolution of individual cells and have an increasing impact on biomedical research. However, it is known that these methods sometimes wrongly consider two or more cells as single cells, and that a number of so-called doublets is present in the output of such experiments. Treating doublets as single cells in downstream analyses can severely bias a study's conclusions, and therefore computational strategies for the identification of doublets are needed. Results: With scds, we propose two new approaches for in silico doublet identification: Co-expression based doublet scoring (cxds) and binary classification based doublet scoring (bcds). The co-expression based approach, cxds, utilizes binarized (absence/presence) gene expression data and, employing a binomial model for the co-expression of pairs of genes, yields interpretable doublet annotations. bcds, on the other hand, uses a binary classification approach to discriminate artificial doublets from original data. We apply our methods and existing computational doublet identification approaches to four datasets with experimental doublet annotations and find that our methods perform at least as well as the state of the art, at comparably little computational cost. We observe appreciable differences between methods and across datasets and that no approach dominates all others. In summary, scds presents a scalable, competitive approach that allows for doublet annotation of datasets with thousands of cells in a matter of seconds.",
                "authors": [
                    {
                        "name": "Bais A.S."
                    },
                    {
                        "name": "Kostka D."
                    }
                ],
                "citationCount": 14,
                "date": "2020-02-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Scds: Computational annotation of doublets in single-cell RNA sequencing data"
            },
            "pmid": "31501871"
        }
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}