{
    "name": "MoPS", 
    "description": "Identification and characterization of periodic fluctuations in time-series data.", 
    "homepage": "http://bioconductor.org/packages/release/bioc/html/MoPS.html", 
    "biotoolsID": "mops", 
    "biotoolsCURIE": "biotools:mops", 
    "version": [
        "1.8.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3565", 
                    "term": "RNA-seq time series data analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3678", 
            "term": "Experimental design and studies"
        }, 
        {
            "uri": "http://edamontology.org/topic_0203", 
            "term": "Gene expression"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "GPL-3.0", 
    "collectionID": [
        "BioConductor"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MoPS_1.8.0.tar.gz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/MoPS.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1002/msb.134886", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Other", 
            "version": null, 
            "metadata": {
                "title": "Periodic mRNA synthesis and degradation co-operate during cell cycle gene expression", 
                "abstract": "During the cell cycle, the levels of hundreds of mRNAs change in a periodic manner, but how this is achieved by alterations in the rates of mRNA synthesis and degradation has not been studied systematically. Here, we used metabolic RNA labeling and comparative dynamic transcriptome analysis (cDTA) to derive mRNA synthesis and degradation rates every 5 min during three cell cycle periods of the yeast Saccharomyces cerevisiae. A novel statistical model identified 479 genes that show periodic changes in mRNA synthesis and generally also periodic changes in their mRNA degradation rates. Peaks of mRNA degradation generally follow peaks of mRNA synthesis, resulting in sharp and high peaks of mRNA levels at defined times during the cell cycle. Whereas the timing of mRNA synthesis is set by upstream DNA motifs and their associated transcription factors (TFs), the synthesis rate of a periodically expressed gene is apparently set by its core promoter. Synopsis Genome-scale measurement of changes in mRNA synthesis and degradation rates during the yeast cell cycle identifies genes with periodic synthesis and degradation and reveals a tight temporal coupling of both processes. The first high-resolution time series of mRNA synthesis and degradation rates during the cell cycle is presented. A novel statistical algorithm identifies periodically expressed genes and parameters of their temporal profile. The timing of periodic expression is set by upstream DNA motifs and the associated transcription factors, whereas the synthesis rate is set by the core promoter. Sharp and high peaks of mRNA levels are obtained by a temporal coupling of periodic mRNA synthesis and degradation maxima. The dynamic mRNA synthesis and degradation during the cell cycle is monitored by metabolic mRNA labeling. Statistical modeling identifies genes with periodic synthesis and degradation and reveals a tight temporal coupling of both processes. © 2014 The Authors.", 
                "date": "2014-01-01T00:00:00Z", 
                "citationCount": 38, 
                "authors": [
                    {
                        "name": "Eser P."
                    }, 
                    {
                        "name": "Demel C."
                    }, 
                    {
                        "name": "Maier K.C."
                    }, 
                    {
                        "name": "Schwalb B."
                    }, 
                    {
                        "name": "Pirkl N."
                    }, 
                    {
                        "name": "Martin D.E."
                    }, 
                    {
                        "name": "Cramer P."
                    }, 
                    {
                        "name": "Tresch A."
                    }
                ], 
                "journal": "Molecular Systems Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": "Philipp Eser", 
            "email": "eser@genzentrum.lmu.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "bioconductor_import", 
    "additionDate": "2017-01-17T15:00:23Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}