{
    "additionDate": "2021-01-18T08:30:47Z",
    "biotoolsCURIE": "biotools:gps-palm",
    "biotoolsID": "gps-palm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xueyu@hust.edu.cn",
            "name": "Yu Xue",
            "typeEntity": "Person"
        }
    ],
    "description": "A deep learning-based graphic presentation system for the prediction of S-palmitoylation sites in proteins.\n\nA Graphic Presentation System for Palmitoylation Site Prediction.\n\nKinase-specific Phosphorylation Site Prediction.",
    "download": [
        {
            "type": "Downloads page",
            "url": "http://gpspalm.biocuckoo.cn/download.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "PTM localisation",
                    "uri": "http://edamontology.org/operation_3755"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                }
            ]
        }
    ],
    "homepage": "http://gpspalm.biocuckoo.cn/",
    "lastUpdate": "2021-01-25T09:28:30Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://gps.biocuckoo.cn/"
        }
    ],
    "name": "GPS-Palm",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAA038",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved.As an important reversible lipid modification, S-palmitoylation mainly occurs at specific cysteine residues in proteins, participates in regulating various biological processes and is associated with human diseases. Besides experimental assays, computational prediction of S-palmitoylation sites can efficiently generate helpful candidates for further experimental consideration. Here, we reviewed the current progress in the development of S-palmitoylation site predictors, as well as training data sets, informative features and algorithms used in these tools. Then, we compiled a benchmark data set containing 3098 known S-palmitoylation sites identified from small-or large-scale experiments, and developed a new method named data quality discrimination (DQD) to distinguish data quality weights (DQWs) between the two types of the sites. Besides DQD and our previous methods, we encoded sequence similarity values into images, constructed a deep learning framework of convolutional neural networks (CNNs) and developed a novel algorithm of graphic presentation system (GPS) 6.0. We further integrated nine additional types of sequence-based and structural features, implemented parallel CNNs (pCNNs) and designed a new predictor called GPS-Palm. Compared with other existing tools, GPS-Palm showed a >31.3% improvement of the area under the curve (AUC) value (0.855 versus 0.651) for general prediction of S-palmitoylation sites. We also produced two species-specific predictors, with corresponding AUC values of 0.900 and 0.897 for predicting human- A nd mouse-specific sites, respectively. GPS-Palm is free for academic research at http://gpspalm.biocuckoo.cn/.",
                "authors": [
                    {
                        "name": "Ning W."
                    },
                    {
                        "name": "Jiang P."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "Wang C."
                    },
                    {
                        "name": "Tan X."
                    },
                    {
                        "name": "Zhang W."
                    },
                    {
                        "name": "Peng D."
                    },
                    {
                        "name": "Xue Y."
                    }
                ],
                "citationCount": 10,
                "date": "2021-03-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "GPS-Palm: A deep learning-based graphic presentation system for the prediction of S-palmitoylation sites in proteins"
            },
            "pmid": "32248222"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Lipids",
            "uri": "http://edamontology.org/topic_0153"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}