{
    "additionDate": "2020-01-09T17:30:16Z",
    "biotoolsCURIE": "biotools:DeepMicro",
    "biotoolsID": "DeepMicro",
    "confidence_flag": "tool",
    "description": "Deep representation learning for disease prediction based on microbiome data.\nDeepMicro is a deep representation learning framework exploiting various autoencoders to learn robust low-dimensional representations from high-dimensional data and training classification models based on the learned representation.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/minoh0201/DeepMicro",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T20:54:24.134955Z",
    "license": "MIT",
    "name": "DeepMicro",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/785626"
        },
        {
            "doi": "10.1038/s41598-020-63159-5",
            "metadata": {
                "abstract": "Human microbiota plays a key role in human health and growing evidence supports the potential use of microbiome as a predictor of various diseases. However, the high-dimensionality of microbiome data, often in the order of hundreds of thousands, yet low sample sizes, poses great challenge for machine learning-based prediction algorithms. This imbalance induces the data to be highly sparse, preventing from learning a better prediction model. Also, there has been little work on deep learning applications to microbiome data with a rigorous evaluation scheme. To address these challenges, we propose DeepMicro, a deep representation learning framework allowing for an effective representation of microbiome profiles. DeepMicro successfully transforms high-dimensional microbiome data into a robust low-dimensional representation using various autoencoders and applies machine learning classification algorithms on the learned representation. In disease prediction, DeepMicro outperforms the current best approaches based on the strain-level marker profile in five different datasets. In addition, by significantly reducing the dimensionality of the marker profile, DeepMicro accelerates the model training and hyperparameter optimization procedure with 8X–30X speedup over the basic approach. DeepMicro is freely available at https://github.com/minoh0201/DeepMicro.",
                "authors": [
                    {
                        "name": "Oh M."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "citationCount": 88,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "DeepMicro: deep representation learning for disease prediction based on microbiome data"
            },
            "pmcid": "PMC7138789",
            "pmid": "32265477"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        }
    ],
    "validated": 1
}
