{
    "accessibility": "Open access",
    "additionDate": "2019-06-21T14:07:49Z",
    "biotoolsCURIE": "biotools:COAC",
    "biotoolsID": "COAC",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "ChengF-Lab",
            "typeEntity": "Division",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/ChengF-Lab"
        }
    ],
    "description": "Component overlapping attribute clustering (COAC) algorithm for single-cell RNA sequencing data analysis and potential pathobiological implications.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/ChengF-Lab/COAC/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene regulatory network analysis",
                    "uri": "http://edamontology.org/operation_1781"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ChengF-Lab/COAC",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "MPL-2.0",
    "maturity": "Mature",
    "name": "COAC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1006772",
            "metadata": {
                "abstract": "© 2019, Public Library of Science. All rights reserved.Recent advances in next-generation sequencing and computational technologies have enabled routine analysis of large-scale single-cell ribonucleic acid sequencing (scRNA-seq) data. However, scRNA-seq technologies have suffered from several technical challenges, including low mean expression levels in most genes and higher frequencies of missing data than bulk population sequencing technologies. Identifying functional gene sets and their regulatory networks that link specific cell types to human diseases and therapeutics from scRNA-seq profiles are daunting tasks. In this study, we developed a Component Overlapping Attribute Clustering (COAC) algorithm to perform the localized (cell subpopulation) gene co-expression network analysis from large-scale scRNA-seq profiles. Gene subnetworks that represent specific gene co-expression patterns are inferred from the components of a decomposed matrix of scRNA-seq profiles. We showed that single-cell gene subnetworks identified by COAC from multiple time points within cell phases can be used for cell type identification with high accuracy (83%). In addition, COAC-inferred subnetworks from melanoma patients’ scRNA-seq profiles are highly correlated with survival rate from The Cancer Genome Atlas (TCGA). Moreover, the localized gene subnetworks identified by COAC from individual patients’ scRNA-seq data can be used as pharmacogenomics biomarkers to predict drug responses (The area under the receiver operating characteristic curves ranges from 0.728 to 0.783) in cancer cell lines from the Genomics of Drug Sensitivity in Cancer (GDSC) database. In summary, COAC offers a powerful tool to identify potential network-based diagnostic and pharmacogenomics biomarkers from large-scale scRNA-seq profiles. COAC is freely available at https://github.com/ChengF-Lab/COAC.",
                "authors": [
                    {
                        "name": "Cheng F."
                    },
                    {
                        "name": "Nussinov R."
                    },
                    {
                        "name": "Peng H."
                    },
                    {
                        "name": "Zeng X."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 6,
                "date": "2019-02-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "A component overlapping attribute clustering (COAC) algorithm for single-cell RNA sequencing data analysis and potential pathobiological implications"
            },
            "pmcid": "PMC6396937",
            "pmid": "30779739",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        }
    ],
    "validated": 1
}
