{
    "additionDate": "2020-01-14T19:30:09Z",
    "biotoolsCURIE": "biotools:best-brain",
    "biotoolsID": "best-brain",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wangjing@psych.ac.cn",
            "name": "Jing Wang",
            "orcidid": "https://orcid.org/0000-0002-2512-0223",
            "typeEntity": "Person"
        }
    ],
    "description": "A web server for brain expression Spatio-temporal pattern analysis.\n\nBrain Expression Spatio-Temporal pattern.\n\n||| NAME EQUAL TO (PUB. DIFFERENT) bio.tools/best_literature, bio.tools/best.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/i-gsea4gwas (PSYCH.AC.CN), bio.tools/icsnpathway (PSYCH.AC.CN)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://best.psych.ac.cn",
    "lastUpdate": "2020-12-05T14:19:35.212612Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/GuoLiyuan-github/BEST"
        }
    ],
    "name": "BEST",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3222-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Dysregulated gene expression patterns have been reported in several mental disorders. Limited by the difficulty of obtaining samples, psychiatric molecular mechanism research still relies heavily on clues from genetics studies. By using reference data from brain expression studies, multiple types of comprehensive gene expression pattern analysis have been performed on psychiatric genetic results. These systems-level spatial-temporal expression pattern analyses provided evidence on specific brain regions, developmental stages and molecular pathways that are possibly involved in psychiatric pathophysiology. At present, there is no online tool for such systematic analysis, which hinders the applications of analysis by non-informatics researchers such as experimental biologists and clinical molecular biologists. Results: We developed the BEST web server to support Brain Expression Spatio-Temporal pattern analysis. There are three highlighted features of BEST: 1) visualization: it generates user-friendly visual results that are easy to interpret, including heatmaps, Venn diagrams, gene co-expression networks and cluster-based Manhattan gene plots; these results illustrate the complex spatio-temporal expression patterns, including expression quantification and correlation between genes; 2) integration: it provides comprehensive human brain spatio-temporal expression patterns by integrating data from currently available databases; 3) multi-dimensionality: it analyses input genes as both a whole set and several subsets (clusters) which are enriched according to co-expression patterns, and it also presents the correlation between genetic and expression data. Conclusions: To the best of our knowledge, BEST is the first data tool to support comprehensive human brain spatial-temporal expression pattern analysis. It helps to bridge disease-related genetic studies and mechanism studies, provides clues for key gene and molecular system identification, and supports the analysis of disease sensitive brain region and age stages. BEST is freely available at http://best.psych.ac.cn.",
                "authors": [
                    {
                        "name": "Guo L."
                    },
                    {
                        "name": "Lin W."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-05T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "BEST: a web server for brain expression Spatio-temporal pattern analysis"
            },
            "pmcid": "PMC6896511",
            "pmid": "31805847"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Psychiatry",
            "uri": "http://edamontology.org/topic_3419"
        }
    ]
}