
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Imaging",
                "uri": "http://edamontology.org/topic_3382"
            }
        ]
    },
    "link": [
        {
            "type": "OTHER",
            "url": "http://robokop.renci.org"
        }
    ],
    "publication": [
        {
            "abstract": "Copyright © 2019 American Chemical Society.A proliferation of data sources has led to the notional existence of an implicit Knowledge Graph (KG) that contains vast amounts of biological knowledge contributed by distributed Application Programming Interfaces (APIs). However, challenges arise when integrating data across multiple APIs due to incompatible semantic types, identifier schemes, and data formats. We present ROBOKOP KG (http://robokopkg.renci.org), which is a KG that was initially built to support the open biomedical question-answering application, ROBOKOP (Reasoning Over Biomedical Objects linked in Knowledge-Oriented Pathways) (http://robokop.renci.org). Additionally, we present the ROBOKOP Knowledge Graph Builder (KGB), which constructs the KG and provides an extensible framework to handle graph query over and integration of federated data sources.",
            "authors": [
                "Bizon C.",
                "Cox S.",
                "Balhoff J.",
                "Kebede Y.",
                "Wang P.",
                "Morton K.",
                "Fecho K.",
                "Tropsha A."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.JCIM.9B00683",
            "journal": "Journal of Chemical Information and Modeling",
            "pmid": "31769676",
            "title": "ROBOKOP KG and KGB: Integrated Knowledge Graphs from Federated Sources",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ROBOKOP_KG",
        "biotoolsID": "ROBOKOP_KG",
        "description": "Integrated Knowledge Graphs from Federated Sources.\n\nA proliferation of data sources has led to the notional existence of an implicit Knowledge Graph (KG) that contains vast amounts of biological knowledge contributed by distributed Application Programming Interfaces (APIs). However, challenges arise when integrating data across multiple APIs due to incompatible semantic types, identifier schemes, and data formats. We present ROBOKOP KG ( http: robokopkg.renci.org ), which is a KG that was initially built to support the open biomedical question-answering application, ROBOKOP (Reasoning Over Biomedical Objects linked in Knowledge-Oriented Pathways) ( http: robokop.renci.org ).\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/ROBOKOP (RENCI.ORG ; ROBOKOPKG.RENCI.ORG ; ROBOKOP.RENCI.ORG), bio.tools/ccb (RENCI.ORG).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'ROBOKOP' (bio.tools/ROBOKOP)",
        "homepage": "http://robokopkg.renci.org",
        "name": "ROBOKOP KG"
    }
}