{
    "additionDate": "2021-01-18T08:08:17Z",
    "biotoolsCURIE": "biotools:mtop",
    "biotoolsID": "mtop",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nchatte2@jhu.edu",
            "name": "Nilanjan Chatterjee",
            "typeEntity": "Person"
        }
    ],
    "description": "A mixed-model approach for powerful testing of genetic associations with cancer risk incorporating tumor characteristics.\n\nTwo-stage polytomous logistic regression (TOP): in this package, we developed a two-stage polytomous regression framework to handle cancer data with multivariate tumor characteristics.\n\nThe 'TOP' vignette will provide a good start point for using TOP package.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/andrewhaoyu/TOP",
    "language": [
        "C",
        "R"
    ],
    "lastUpdate": "2024-11-24T20:40:54.452746Z",
    "name": "MTOP",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/biostatistics/kxz065",
            "metadata": {
                "abstract": "Cancers are routinely classified into subtypes according to various features, including histopathological characteristics and molecular markers. Previous genome-wide association studies have reported heterogeneous associations between loci and cancer subtypes. However, it is not evident what is the optimal modeling strategy for handling correlated tumor features, missing data, and increased degrees-of-freedom in the underlying tests of associations. We propose to test for genetic associations using a mixed-effect two-stage polytomous model score test (MTOP). In the first stage, a standard polytomous model is used to specify all possible subtypes defined by the cross-classification of the tumor characteristics. In the second stage, the subtype-specific case-control odds ratios are specified using a more parsimonious model based on the case-control odds ratio for a baseline subtype, and the case-case parameters associated with tumor markers. Further, to reduce the degrees-of-freedom, we specify case-case parameters for additional exploratory markers using a random-effect model. We use the Expectation-Maximization algorithm to account for missing data on tumor markers. Through simulations across a range of realistic scenarios and data from the Polish Breast Cancer Study (PBCS), we show MTOP outperforms alternative methods for identifying heterogeneous associations between risk loci and tumor subtypes. The proposed methods have been implemented in a user-friendly and high-speed R statistical package called TOP (https://github.com/andrewhaoyu/TOP)",
                "authors": [
                    {
                        "name": "Ahearn T.U."
                    },
                    {
                        "name": "Chatterjee N."
                    },
                    {
                        "name": "Garcia-Closas M."
                    },
                    {
                        "name": "Wheeler W."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhao N."
                    }
                ],
                "citationCount": 7,
                "date": "2021-10-01T00:00:00Z",
                "journal": "Biostatistics",
                "title": "A mixed-model approach for powerful testing of genetic associations with cancer risk incorporating tumor characteristics"
            },
            "pmcid": "PMC8511944",
            "pmid": "32112086"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
