
{
    "credit": [
        {
            "email": "hihginfo@med.miami.edu",
            "name": "John P. Hussman Institute for Human Genomics",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://dmpi.duke.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://hihg.med.miami.edu/software-download/apl-version-1.1"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Population genomics",
                "uri": "http://edamontology.org/topic_3796"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/apl-1-1-association-presence-linkage.html"
        }
    ],
    "publication": [
        {
            "abstract": "Objective: The Association in the Presence of Linkage test (APL) is a powerful statistical method that allows for missing parental genotypes in nuclear families. However, in its original form, the statistic does not easily extend to mixed nuclear family structures nor to multiple-marker haplotypes. Furthermore, the robustness of APL in practice has not been examined. Here we present a generalization of the APL model and examination of its robustness under a variety of nonstandard scenarios. Methods: The generalization is made possible by incorporating a bootstrap variance estimator instead of the original robust variance estimator. This allows for use of more than two affected siblings. Haplotype analysis was accomplished by combining estimation of haplotype phase into the EM algorithm. Computer simulation was used to examine robustness of the APL to departures from test assumptions. Results: The extended APL tests both single-marker and multiple-marker haplotypes and shows more power than other association methods. Simulation results showed that the single-marker APL test is robust to the departure from HWE. For the haplotype test, violation of the HWE assumption can inflate type I error. We also evaluated general guidelines for the validity of APL with rare alleles and rare haplotypes. Software for the APL test is available from http://www.chg.duke.edu/ research/apl.html. Copyright © 2006 S. Karger AG.",
            "authors": [
                "Chung R.-H.",
                "Hauser E.R.",
                "Martin E.R."
            ],
            "cit_count": 45,
            "journal": "Human Heredity",
            "pmid": "16877866",
            "title": "The APL test: Extension to general nuclear families and haplotypes and examination of its robustness",
            "year": "2006-09-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:apl",
        "biotoolsID": "apl",
        "description": "The Association in the Presence of Linkage tool provides a novel test for association in the presence of linkage using general pedigree data.",
        "homepage": "http://hihg.med.miami.edu/software-download/apl-version-1.1",
        "name": "APL"
    }
}