{"credit":[{"email":"fontaine@uni-mainz.de","name":"Jean Fred Fontaine","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://cbdm-01.zdv.uni-mainz.de/~jfontain/cms/?page_id=333"}],"function":[{"input":[{"data":{"term":"Keyword","uri":"http://edamontology.org/data_0968"}},{"data":{"term":"Article ID","uri":"http://edamontology.org/data_1088"}},{"data":{"term":"Compound identifier","uri":"http://edamontology.org/data_1086"}}],"note":"Chemicals prioritization for topics of interest using Chemicals-related PubMed abstracts. Chemicals of interest are defined by names (MeSH vocabulary). Topics of interest are defined by a PubMed query, a MeSH term, or a list of abstracts (PMIDs).","operation":[{"term":"Literature search","uri":"http://edamontology.org/operation_0305"}],"output":[{"data":{"term":"Small molecule report","uri":"http://edamontology.org/data_0962"}}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application","Web service"],"topic":[{"term":"Data mining","uri":"http://edamontology.org/topic_3473"}]},"publication":[{"abstract":"The PubMed® database of biomedical citations allows the retrieval of scientific articles studying the function of chemicals in biology and medicine. Mining millions of available citations to search reported associations between chemicals and topics of interest would require substantial human time. We have implemented the Alkemio text mining web tool and SOAP web service to help in this task. The tool uses biomedical articles discussing chemicals (including drugs), predicts their relatedness to the query topic with a naïve Bayesian classifier and ranks all chemicals by P-values computed from random simulations. Benchmarks on seven human pathways showed good retrieval performance (areas under the receiver operating characteristic curves ranged from 73.6 to 94.5%). Comparison with existing tools to retrieve chemicals associated to eight diseases showed the higher precision and recall of Alkemio when considering the top 10 candidate chemicals. Alkemio is a high performing web tool ranking chemicals for any biomedical topics and it is free to non-commercial users. Availability: http://cbdm.mdc-berlin.de/ ∼medlineranker/cms/alkemio. © 2014 The Author(s).","authors":["Gijon-Correas J.A.","Andrade-Navarro M.A.","Fontaine J.F."],"cit_count":3,"doi":"10.1093/nar/gku432","journal":"Nucleic Acids Research","title":"Alkemio: Association of chemicals with biomedical topics by text and data mining","type":"Primary","year":"2014-07-01"}],"summary":{"biotoolsCURIE":"biotools:alkemio","biotoolsID":"alkemio","description":"Chemicals prioritization for topics of interest using gene-related PubMed abstracts.","homepage":"http://cbdm.uni-mainz.de/medlineranker","name":"Alkemio"}}