{
    "accessibility": "Open access",
    "additionDate": "2023-03-30T22:21:45.831699Z",
    "biotoolsCURIE": "biotools:kegg_pull",
    "biotoolsID": "kegg_pull",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hunter.moseley@uky.edu",
            "name": "Hunter N.B. Moseley",
            "orcidid": "http://orcid.org/0000-0003-3995-5368",
            "typeEntity": "Person"
        },
        {
            "name": "Erik Huckvale"
        }
    ],
    "description": "A Software Package for the RESTful Access and Pulling from The Kyoto Encyclopedia of Gene and Genomes.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "https://moseleybioinformaticslab.github.io/kegg_pull/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/kegg-pull/",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2023-03-30T22:21:45.834311Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/MoseleyBioinformaticsLab/kegg_pull/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MoseleyBioinformaticsLab/kegg_pull"
        }
    ],
    "name": "kegg_pull",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-023-05208-0",
            "metadata": {
                "abstract": "Background: The Kyoto Encyclopedia of Genes and Genomes (KEGG) provides organized genomic, biomolecular, and metabolic information and knowledge that is reasonably current and highly useful for a wide range of analyses and modeling. KEGG follows the principles of data stewardship to be findable, accessible, interoperable, and reusable (FAIR) by providing RESTful access to their database entries via their web-accessible KEGG API. However, the overall FAIRness of KEGG is often limited by the library and software package support available in a given programming language. While R library support for KEGG is fairly strong, Python library support has been lacking. Moreover, there is no software that provides extensive command line level support for KEGG access and utilization. Results: We present kegg_pull, a package implemented in the Python programming language that provides better KEGG access and utilization functionality than previous libraries and software packages. Not only does kegg_pull include an application programming interface (API) for Python programming, it also provides a command line interface (CLI) that enables utilization of KEGG for a wide range of shell scripting and data analysis pipeline use-cases. As kegg_pull’s name implies, both the API and CLI provide versatile options for pulling (downloading and saving) an arbitrary (user defined) number of database entries from the KEGG API. Moreover, this functionality is implemented to efficiently utilize multiple central processing unit cores as demonstrated in several performance tests. Many options are provided to optimize fault-tolerant performance across a single or multiple processes, with recommendations provided based on extensive testing and practical network considerations. Conclusions: The new kegg_pull package enables new flexible KEGG retrieval use cases not available in previous software packages. The most notable new feature that kegg_pull provides is its ability to robustly pull an arbitrary number of KEGG entries with a single API method or CLI command, including pulling an entire KEGG database. We provide recommendations to users for the most effective use of kegg_pull according to their network and computational circumstances.",
                "authors": [
                    {
                        "name": "Huckvale E."
                    },
                    {
                        "name": "Moseley H.N.B."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "kegg_pull: a software package for the RESTful access and pulling from the Kyoto Encyclopedia of Gene and Genomes"
            },
            "pmcid": "PMC9985241",
            "pmid": "36870946"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data governance",
            "uri": "http://edamontology.org/topic_3571"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "version": [
        "2.1.0"
    ]
}
