{
    "accessibility": "Open access",
    "additionDate": "2021-05-26T20:54:34Z",
    "biotoolsCURIE": "biotools:minpath",
    "biotoolsID": "minpath",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yye@indiana.edu",
            "name": "Yuzhen Ye",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MinPath (Minimal set of Pathways) is a parsimony approach for biological pathway reconstructions using protein family predictions, achieving a more conservative, yet more faithful, estimation of the biological pathways for a query dataset. Licensed under GNU GPL.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/mgtools/MinPath/blob/master/readme"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                },
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                },
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mgtools/MinPath",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-07-29T17:53:28.405917Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://omics.informatics.indiana.edu/MinPath/"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/mgtools/MinPath/issues"
        }
    ],
    "name": "MinPath",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.1000465",
            "metadata": {
                "abstract": "A common biological pathway reconstruction approach - as implemented by many automatic biological pathway services (such as the KAAS and RAST servers) and the functional annotation of metagenomic sequences - starts with the identification of protein functions or families (e.g., KO families for the KEGG database and the FIG families for the SEED database) in the query sequences, followed by a direct mapping of the identified protein families onto pathways. Given a predicted patchwork of individual biochemical steps, some metric must be applied in deciding what pathways actually exist in the genome or metagenome represented by the sequences. Commonly, and straightforwardly, a complete biological pathway can be identified in a dataset if at least one of the steps associated with the pathway is found. We report, however, that this naïve mapping approach leads to an inflated estimate of biological pathways, and thus overestimates the functional diversity of the sample from which the DNA sequences are derived. We developed a parsimony approach, called MinPath (Minimal set of Pathways), for biological pathway reconstructions using protein family predictions, which yields a more conservative, yet more faithful, estimation of the biological pathways for a query dataset. MinPath identified far fewer pathways for the genomes collected in the KEGG database - as compared to the naïve mapping approach - eliminating some obviously spurious pathway annotations. Results from applying MinPath to several metagenomes indicate that the common methods used for metagenome annotation may significantly overestimate the biological pathways encoded by microbial communities. © 2009 Ye, Doak.",
                "authors": [
                    {
                        "name": "Ye Y."
                    },
                    {
                        "name": "Doak T.G."
                    }
                ],
                "citationCount": 188,
                "date": "2009-08-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "A parsimony approach to biological pathway reconstruction/inference for genomes and metagenomes"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}