{
    "accessibility": [],
    "additionDate": "2017-02-14T09:36:15Z",
    "biotoolsCURIE": "biotools:deconstruct",
    "biotoolsID": "deconstruct",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "vinkovic@pmfst.hr",
            "gridid": null,
            "name": "DEJAN VINKOVIĆ",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        }
    ],
    "description": "deconSTRUCT web server interfaces with a protein database search engine and can be used for the detection of similar protein (sub)structures.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://epsf.bmad.bii.a-star.edu.sg/struct_server.html"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein structure comparison",
                    "uri": "http://edamontology.org/operation_2487"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://epsf.bmad.bii.a-star.edu.sg/struct_server.html",
    "homepage_status": 0,
    "language": [
        "Perl",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "license": null,
    "link": [],
    "maturity": null,
    "name": "deconSTRUCT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "deconSTRUCT webserver offers an interface to a protein database search engine, usable for a general purpose detection of similar protein (sub)structures. Initially, it deconstructs the query structure into its secondary structure elements (SSEs) and reassembles the match to the target by requiring a (tunable) degree of similarity in the direction and sequential order of SSEs. Hierarchical organization and judicious use of the information about protein structure enables deconSTRUCT to achieve the sensitivity and specificity of the established search engines at orders of magnitude increased speed, without tying up irretrievably the substructure information in the form of a hash. In a post-processing step, a match on the level of the backbone atoms is constructed. The results presented to the user consist of the list of the matched SSEs, the transformation matrix for rigid superposition of the structures and several ways of visualization, both downloadable and implemented as a web-browser plug-in. The server is available at http://epsf.bmad.bii.a-star.edu.sg/struct_server.html. © The Author(s) 2010. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Zhang Z.H."
                    },
                    {
                        "name": "Bharatham K."
                    },
                    {
                        "name": "Sherman W.A."
                    },
                    {
                        "name": "Mihalek I."
                    }
                ],
                "citationCount": 10,
                "date": "2010-06-03T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "deconSTRUCT: General purpose protein database search on the substructure level"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20522512",
            "type": null,
            "version": null
        },
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: Computational comparison of two protein structures is the starting point of many methods that build on existing knowledge, such as structure modeling (including modeling of protein complexes and conformational changes), molecular replacement, or annotation by structural similarity. In a commonly used strategy, significant effort is invested in matching two sets of atoms. In a complementary approach, a global descriptor is assigned to the overall structure, thus losing track of the substructures within.Results: Using a small set of geometric features, we define a reduced representation of protein structure, together with an optimizing function for matching two representations, to provide a pre-filtering stage in a database search. We show that, in a straightforward implementation, the representation performs well in terms of resolution in the space of protein structures, and its ability to make new predictions.Conclusions: Perhaps unexpectedly, a substantial discriminating power already exists at the level of main features of protein structure, such as directions of secondary structural elements, possibly constrained by their sequential order. This can be used toward efficient comparison of protein (sub)structures, allowing for various degrees of conformational flexibility within the compared pair, which in turn can be used for modeling by homology of protein structure and dynamics. © 2010 Zhang et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Zhang Z.H."
                    },
                    {
                        "name": "Lee H.K."
                    },
                    {
                        "name": "Mihalek I."
                    }
                ],
                "citationCount": 8,
                "date": "2010-03-26T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Reduced representation of protein structure: Implications on efficiency and scope of detection of structural similarity"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20338066",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Protein structural motifs and surfaces",
            "uri": "http://edamontology.org/topic_0166"
        }
    ],
    "validated": 1,
    "version": []
}