{
    "additionDate": "2020-01-14T08:59:39Z",
    "biotoolsCURIE": "biotools:PMBD",
    "biotoolsID": "PMBD",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hjzhang@hust.edu.cn",
            "name": "Houjin Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "a Comprehensive Plastics Microbial Biodegradation Database.\n\n&nbspPMBD: a Plastics Microbial Biodegradation Database.\n\nPlastics are produced in millions of tons each year. Most of them are discarded after a single use. Although plastics are generally considered as non-toxic to the environment, the sheer amount of plastic waste has caused significant burden to the environment. Fortunately, the plastic waste could be degraded slowly in nature, not only by the sunlight but also by the microorganisms. In this database, we collect the biodegradation relationships between microorganisms and plastics, along with the underlying mechanisms. Hopefully, this website will serve as a great tool for researchers who are working hard to solve the plastic waste problem",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "homepage": "http://pmbd.genome-mining.cn/home",
    "lastUpdate": "2020-12-05T12:40:18.636486Z",
    "name": "PMBD",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ119",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press.Since the invention over a hundred years ago, plastics have been used in many applications, and they are involved in every aspect of our lives. The extensive usage of plastics results in a tremendous amount of waste, which has become a severe burden on the environment. Several degradation approaches exist in nature to cope with ever-increasing plastic waste. Among these approaches, biodegradation by microorganisms has emerged as a natural way, which is favored by many environmentally conscious societies. To facilitate the study on biodegradation of plastics, we developed an online resource, Plastics Microbial Biodegradation Database (PMBD), to gather and present the information about microbial biodegradation of plastics. In this database, 949 microorganisms-plastics relationships and 79 genes involved in the biodegradation of plastics were manually collected and confirmed through literature searching. In addition, more than 8000 automatically annotated enzyme sequences, which were predicted to be involved in the plastics biodegradation, were extracted from the TrEMBL section of the UniProt database. The PMBD database is presented with a website at http://pmbd.genome-mining.cn/home. Data may be accessed through browsing or searching. Also included on the website are a sequence alignment tool and a function prediction tool.",
                "authors": [
                    {
                        "name": "Gan Z."
                    },
                    {
                        "name": "Zhang H."
                    }
                ],
                "citationCount": 3,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "PMBD: a Comprehensive Plastics Microbial Biodegradation Database"
            },
            "pmcid": "PMC6859810",
            "pmid": "31738435"
        }
    ],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        }
    ]
}