{
    "additionDate": "2017-12-18T00:03:04Z",
    "biotoolsCURIE": "biotools:3dcomb",
    "biotoolsID": "3dcomb",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://ttic.uchicago.edu/~jinbo/"
        }
    ],
    "description": "3DCOMB is a software which can generate a multiple structure alignment (MSA) with not only as many conserved cores as possible, but also high-quality pairwise alignments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple structure alignment",
                    "uri": "http://edamontology.org/operation_0504"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://ttic.uchicago.edu/~jinbo/software.htm",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/3dcomb-1-06-multiple-protein-structure-alignment.html"
        }
    ],
    "name": "3DCOMB",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btr432",
            "metadata": {
                "abstract": "Motivation: Building an accurate alignment of a large set of distantly related protein structures is still very challenging. Results: This article presents a novel method 3DCOMB that can generate a multiple structure alignment (MSA) with not only as many conserved cores as possible, but also high-quality pairwise alignments. 3DCOMB is unique in that it makes use of both local and global structure environments, combined by a statistical learning method, to accurately identify highly similar fragment blocks (HSFBs) among all proteins to be aligned. By extending the alignments of these HSFBs, 3DCOMB can quickly generate an accurate MSA without using progressive alignment. 3DCOMB significantly excels others in aligning distantly related proteins. 3DCOMB can also generate correct alignments for functionally similar regions among proteins of very different structures while many other MSA tools fail. 3DCOMB is useful for many real-world applications. In particular, it enables us to find out that there is still large improvement room for multiple template homology modeling while several other MSA tools fail to do so. © The Author 2011. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Xu J."
                    }
                ],
                "citationCount": 37,
                "date": "2011-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Alignment of distantly related protein structures: Algorithm, bound and implications to homology modeling"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "1.06"
    ]
}