{
    "accessibility": "Open access",
    "additionDate": "2022-12-27T01:53:00.068444Z",
    "biotoolsCURIE": "biotools:mparce",
    "biotoolsID": "mparce",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rodrigo.ochoa@udea.edu.co",
            "name": "Rodrigo Ochoa",
            "typeEntity": "Person"
        },
        {
            "name": "Pilar Cossio"
        },
        {
            "name": "Thomas Fox"
        }
    ],
    "description": "An open source protocol to design modified peptides with improved binding affinity to a target of reference. The protocol generates single-point mutations on the peptide sequence based on a list of parameterized non-natural amino acids (NNAAs). Then, it estimates their binding affinities in complex with the protein in an efficient but accurate manner by combining backrub sampling from Rosetta with a consensus metric using multiple protein-ligand scoring functions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide immunogenicity prediction",
                    "uri": "http://edamontology.org/operation_0252"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/rochoa85/mPARCE/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-27T01:53:00.070930Z",
    "license": "MIT",
    "name": "mPARCE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1007/S10822-022-00482-1",
            "metadata": {
                "abstract": "© 2022, The Author(s).Peptides are commonly used as therapeutic agents. However, they suffer from easy degradation and instability. Replacing natural by non-natural amino acids can avoid these problems, and potentially improve the affinity towards the target protein. Here, we present a computational pipeline to optimize peptides based on adding non-natural amino acids while improving their binding affinity. The workflow is an iterative computational evolution algorithm, inspired by the PARCE protocol, that performs single-point mutations on the peptide sequence using modules from the Rosetta framework. The modifications can be guided based on the structural properties or previous knowledge of the biological system. At each mutation step, the affinity to the protein is estimated by sampling the complex conformations and applying a consensus metric using various open protein-ligand scoring functions. The mutations are accepted based on the score differences, allowing for an iterative optimization of the initial peptide. The sampling/scoring scheme was benchmarked with a set of protein-peptide complexes where experimental affinity values have been reported. In addition, a basic application using a known protein-peptide complex is also provided. The structure- and dynamic-based approach allows users to optimize bound peptides, with the option to personalize the code for further applications. The protocol, called mPARCE, is available at: https://github.com/rochoa85/mPARCE/.",
                "authors": [
                    {
                        "name": "Cossio P."
                    },
                    {
                        "name": "Fox T."
                    },
                    {
                        "name": "Ochoa R."
                    }
                ],
                "date": "2022-11-01T00:00:00Z",
                "journal": "Journal of Computer-Aided Molecular Design",
                "title": "Protocol for iterative optimization of modified peptides bound to protein targets"
            },
            "pmcid": "PMC9640467",
            "pmid": "36258137"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Computational chemistry",
            "uri": "http://edamontology.org/topic_3332"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
