{
    "additionDate": "2021-01-18T09:19:25Z",
    "biotoolsCURIE": "biotools:sleepwalk",
    "biotoolsID": "sleepwalk",
    "confidence_flag": "tool",
    "description": "Exploring dimension-reduced embeddings with Sleepwalk.\n\nInteractively Explore Dimension-Reduced Embeddings.\n\nA tool to interactively explore the embeddings created by dimension reduction methods such as Principal Components Analysis (PCA), Multidimensional Scaling (MDS), T-distributed Stochastic Neighbour Embedding (t-SNE), Uniform Manifold Approximation and Projection (UMAP) or any other.\n\nSleepwalk displays a 2D embedding,i.e., a 2D representation of higher-dimensional data points, and whenever the user hovers with the mouse over a data point, all points are coloured according to their distance to the focus point under the mouse cursor.\n\nWhen working with single-cell data, e.g., from single-cell RNA-Seq, we need an intuitive visual representation of our data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://anders-biostat.github.io/sleepwalk/supplementary/",
    "lastUpdate": "2021-02-19T15:40:13Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://anders-biostat.github.io/sleepwalk/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://cran.r-project.org/package=sleepwalk"
        }
    ],
    "name": "Sleepwalk",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1101/GR.251447.119",
            "metadata": {
                "abstract": "© 2020 Ovchinnikova and Anders This article is distributed exclusively by Cold Spring Harbor Laboratory Press for the first six months after the full-issue publication date (see http://genome.cshlp.org/site/misc/terms.xhtml). After six months, it is available under a Creative Commons License (Attribution-NonCommercial 4.0 International), as described at http://creativecommons.org/licenses/by-nc/4.0/.Dimension-reduction methods, such as t-SNE or UMAP, are widely used when exploring high-dimensional data describing many entities, for example, RNA-seq data for many single cells. However, dimension reduction is commonly prone to introducing artifacts, and we hence need means to see where a dimension-reduced embedding is a faithful representation of the local neighborhood and where it is not. We present Sleepwalk, a simple but powerful tool that allows the user to interactively explore an embedding, using color to depict original or any other distances from all points to the cell under the mouse cursor. We show how this approach not only highlights distortions but also reveals otherwise hidden characteristics of the data, and how Sleepwalk's comparative modes help integrate multisample data and understand differences between embedding and preprocessing methods. Sleepwalk is a versatile and intuitive tool that unlocks the full power of dimension reduction and will be of value not only in single-cell RNA-seq but also in any other area with matrix-shaped big data.",
                "authors": [
                    {
                        "name": "Anders S."
                    },
                    {
                        "name": "Ovchinnikova S."
                    }
                ],
                "date": "2020-05-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Exploring dimension-reduced embeddings with Sleepwalk"
            },
            "pmcid": "PMC7263188",
            "pmid": "32430339"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
