{
    "additionDate": "2017-01-17T15:03:36Z",
    "biotoolsCURIE": "biotools:rtrm",
    "biotoolsID": "rtrm",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "diego10ruiz@gmail.com",
            "name": "Diego Diez",
            "orcidid": "http://orcid.org/0000-0002-2325-4893",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Identifies transcriptional regulatory modules (TRMs) from protein-protein interaction networks.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/rTRM.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/rTRM_1.12.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/rTRM.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T04:15:34Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/ddiez/rTRM"
        }
    ],
    "name": "rTRM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/nar/gkt913",
            "metadata": {
                "abstract": "© 2013 The Author(s).Transcription factors (TFs) combine with co-factors to form transcriptional regulatory modules (TRMs) that regulate gene expression programs with spatiotemporal specificity. Here we present a novel and generic method (rTRM) for the reconstruction of TRMs that integrates genomic information from TF binding, cell type-specific gene expression and protein-protein interactions. rTRM was applied to reconstruct the TRMs specific for embryonic stem cells (ESC) and hematopoietic stem cells (HSC), neural progenitor cells, trophoblast stem cells and distinct types of terminally differentiated CD4+ T cells. The ESC and HSC TRM predictions were highly precise, yielding 77 and 96 proteins, of which ∼75% have been independently shown to be involved in the regulation of these cell types. Furthermore, rTRM successfully identified a large number of bridging proteins with known roles in ESCs and HSCs, which could not have been identified using genomic approaches alone, as they lack the ability to bind specific DNA sequences. This highlights the advantage of rTRM over other methods that ignore PPI information, as proteins need to interact with other proteins to form complexes and perform specific functions. The prediction and experimental validation of the co-factors that endow master regulatory TFs with the capacity to select specific genomic sites, modulate the local epigenetic profile and integrate multiple signals will provide important mechanistic insights not only into how such TFs operate, but also into abnormal transcriptional states leading to disease.",
                "authors": [
                    {
                        "name": "Diez D."
                    },
                    {
                        "name": "Hutchins A.P."
                    },
                    {
                        "name": "Miranda-Saavedra D."
                    }
                ],
                "citationCount": 22,
                "date": "2013-04-30T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Systematic identification of transcriptional regulatory modules from protein-protein interaction networks"
            },
            "pmcid": "PMC3874207",
            "pmid": "24137002",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ],
    "validated": 1,
    "version": [
        "1.12.0"
    ]
}