{
    "additionDate": "2017-08-03T18:47:50Z",
    "biotoolsCURIE": "biotools:l-measure",
    "biotoolsID": "l-measure",
    "credit": [
        {
            "email": "spolavar@gmu.edu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Allows researchers to extract quantitative morphological measurements from neuronal reconstructions. Neuronal reconstructions are typically obtained from brightfield or fluorescence microscopy preparations using applications such as Neurolucida, Eutectic, or Neuron_Morpho, or can be synthesized via computational simulations.",
    "documentation": [
        {
            "type": "General",
            "url": "http://cng.gmu.edu:8080/Lm/help/index.htm"
        },
        {
            "type": "General",
            "url": "http://cng.gmu.edu:8080/Lm/FAQ/install.html#LM3.8_10"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://cng.gmu.edu:8080/Lm/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/l-measure-4-0-extract-quantitative-morphological-measurements-neuronal-reconstructions.html"
        }
    ],
    "name": "L-Measure",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "L-Measure (LM) is a freely available software tool for the quantitative characterization of neuronal morphology. LM computes a large number of neuroanatomical parameters from 3D digital reconstruction files starting from and combining a set of core metrics. After more than six years of development and use in the neuroscience community, LM enables the execution of commonly adopted analyses as well as of more advanced functions. This report illustrates several LM protocols: (i) extraction of basic morphological parameters, (ii) computation of frequency distributions, (iii) measurements from user-specified subregions of the neuronal arbors, (iv) statistical comparison between two groups of cells and (v) filtered selections and searches from collections of neurons based on any Boolean combination of the available morphometric measures. These functionalities are easily accessed and deployed through a user-friendly graphical interface and typically execute within few minutes on a set of ∼20 neurons. The tool is available at http://krasnow.gmu.edu/cn3 for either online use on any Java-enabled browser and platform or download for local execution under Windows and Linux.",
                "authors": [
                    {
                        "name": "Scorcioni R."
                    },
                    {
                        "name": "Polavaram S."
                    },
                    {
                        "name": "Ascoli G.A."
                    }
                ],
                "citationCount": 121,
                "date": "2008-04-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "L-Measure: A web-accessible tool for the analysis, comparison and search of digital reconstructions of neuronal morphologies"
            },
            "pmid": "18451794"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}