{
    "additionDate": "2019-11-14T20:12:33Z",
    "biotoolsCURIE": "biotools:WebGestalt_autogenerated",
    "biotoolsID": "WebGestalt_autogenerated",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "xueyadong2010@gmail.com",
            "name": "Yadong Xue",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > NAME EQUAL TO (PUB. DIFFERENT) bio.tools/webgestalt | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/webgestalt (WEBGESTALT.ORG/option.php) | > CORRECT NAME OF TOOL COULD ALSO BE 'DEGs', 'T2DM', 'limma' (bio.tools/limma), 'GSE20966' | Identification of core genes and pathways in type 2 diabetes mellitus by bioinformatics analysis | WebGestalt (WEB-based GEne SeT AnaLysis Toolkit) | WEB-based GEne SeT AnaLysis Toolkit | Translating gene lists into biological insights.. | WebGestalt (WEB-based Gene SeT AnaLysis Toolkit) is a functional enrichment analysis web tool, which has on average 26,000 unique users from 144 countries and territories per year according to Google Analytics. The WebGestalt 2005, WebGestalt 2013 and WebGestalt 2017 papers have been cited in more than 2,500 scientific papers according to Google Scholar",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://www.webgestalt.org/option.php",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T20:12:33Z",
    "name": "WebGestalt_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3892/MMR.2019.10522",
            "metadata": {
                "abstract": "© 2019 Spandidos Publications. All rights reserved.Type 2 diabetes mellitus (T2DM) is a metabolic disorder. Numerous proteins have been identified that are associated with the occurrence and development of T2DM. This study aimed to identify potential core genes and pathways involved in T2DM, through exhaustive bioinformatic analyses using GSE20966 microarray profiles of pancreatic β-cells obtained from healthy controls and patients with T2DM. The original microarray data were downloaded from the Gene expression omnibus database. Data were processed by the limma package in r software and the differentially expressed genes (DEGs) were identified. Gene ontology functional analysis and Kyoto encyclopedia of Genes and Genomes pathway analysis were carried out to identify potential biological functions and pathways of the DEGs. Key transcription factors were identified using the WEB-based GEne SeT AnaLysis Toolkit (WebGestalt) and Enrichr. The Search Tool for the Retrieval of Interacting Genes (STRING) database was used to establish a protein-protein interaction (PPI) network for the DEGs. In total, 329 DEGs were involved in T2DM, with 208 upregulated genes enriched in pancreatic secretion and the complement and coagulation cascades, and 121 downregulated genes enriched in insulin secretion, carbohydrate digestion and absorption, and the Toll-like receptor pathway. Furthermore, hepatocyte nuclear factor 1-alpha (HNF1A), signal transducer and activator of transcription 3 (STAT3) and glucocorticoid receptor (GR) were key transcription factors in T2DM. Twenty important nodes were detected in the PPI network. Finally, two core genes, serpin family G member 1 (SERPING1) and alanyl aminopeptidase, membrane (ANPEP), were shown to be associated with the development of T2DM. On the whole, the findings of this study enhance our understanding of the potential molecular mechanisms of T2DM and provide potential targets for further research.",
                "authors": [
                    {
                        "name": "Ding L."
                    },
                    {
                        "name": "Fan L."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Fu J."
                    },
                    {
                        "name": "Xue Y."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Medicine Reports",
                "title": "Identification of core genes and pathways in type 2 diabetes mellitus by bioinformatics analysis"
            },
            "pmcid": "PMC6691242",
            "pmid": "31524257"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ]
}