{"credit":[{"email":"boliu@umiacs.umd.edu","name":"Bo Liu","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://www.cs.umd.edu/~boliu/"}],"documentation":[{"url":"http://metaphyler.cbcb.umd.edu/metaphyler_tutorial.pdf"}],"function":[{"operation":[{"term":"Taxonomic classification","uri":"http://edamontology.org/operation_3460"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Metagenomics","uri":"http://edamontology.org/topic_3174"},{"term":"Taxonomy","uri":"http://edamontology.org/topic_0637"},{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Microbial ecology","uri":"http://edamontology.org/topic_3697"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/metaphyler-1-13-taxonomic-profiling-metagenomic-sequences.html"}],"publication":[{"abstract":"Background: A major goal of metagenomics is to characterize the microbial composition of an environment. The most popular approach relies on 16S rRNA sequencing, however this approach can generate biased estimates due to differences in the copy number of the gene between even closely related organisms, and due to PCR artifacts. The taxonomic composition can also be determined from metagenomic shotgun sequencing data by matching individual reads against a database of reference sequences. One major limitation of prior computational methods used for this purpose is the use of a universal classification threshold for all genes at all taxonomic levels.Results: We propose that better classification results can be obtained by tuning the taxonomic classifier to each matching length, reference gene, and taxonomic level. We present a novel taxonomic classifier MetaPhyler (http://metaphyler.cbcb.umd.edu), which uses phylogenetic marker genes as a taxonomic reference. Results on simulated datasets demonstrate that MetaPhyler outperforms other tools commonly used in this context (CARMA, Megan and PhymmBL). We also present interesting results by analyzing a real metagenomic dataset.Conclusions: We have introduced a novel taxonomic classification method for analyzing the microbial diversity from whole-metagenome shotgun sequences. Compared with previous approaches, MetaPhyler is much more accurate in estimating the phylogenetic composition. In addition, we have shown that MetaPhyler can be used to guide the discovery of novel organisms from metagenomic samples. © 2011 Liu et al; licensee BioMed Central Ltd.","authors":["Liu B.","Gibbons T.","Ghodsi M.","Treangen T.","Pop M."],"cit_count":59,"journal":"BMC Genomics","pmid":"21989143","title":"Accurate and fast estimation of taxonomic profiles from metagenomic shotgun sequences","year":"2011-07-27"}],"summary":{"biotoolsCURIE":"biotools:metaphyler","biotoolsID":"metaphyler","description":"Novel taxonomic classifier for metagenomic shotgun reads, which uses phylogenetic marker genes as a taxonomic reference. Our classifier, based on BLAST, uses different thresholds (automatically learned from the reference database) for each combination of taxonomic rank, reference gene, and sequence length.","homepage":"http://metaphyler.cbcb.umd.edu/","name":"MetaPhyler"}}