{
    "name": "SpliceTrap", 
    "description": "SpliceTrap is a statistic tool for quantifying exon inclusion ratios in paired-end RNA-seq data. Instead of full transcript quantification, SpliceTrap approaches to exon inclusion level estimation as a Bayesian inference problem. For every exon it quantifies the extent to which it is included, skipped or subjected to size variations due to alternative 3’/5’ splice sites or Intron Retention.", 
    "homepage": "http://rulai.cshl.edu/splicetrap/", 
    "biotoolsID": "splicetrap", 
    "biotoolsCURIE": "biotools:splicetrap", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2238", 
                    "term": "Statistical calculation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Script"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3320", 
            "term": "RNA splicing"
        }, 
        {
            "uri": "http://edamontology.org/topic_3170", 
            "term": "RNA-Seq"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++", 
        "Perl"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://rulai.cshl.edu/splicetrap/doc/index.html", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21896509", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Splice Trap: A method to quantify alternative splicing under single cellular conditions", 
                "abstract": "Motivation: Alternative splicing (AS) is a pre-mRNA maturation process leading to the expression of multiple mRNA variants from the same primary transcript. More than 90% of human genes are expressed via AS. Therefore, quantifying the inclusion level of every exon is crucial for generating accurate transcriptomic maps and studying the regulation of AS. Results: Here we introduce SpliceTrap, a method to quantify exon inclusion levels using paired-end RNA-seq data. Unlike other tools, which focus on full-length transcript isoforms, SpliceTrap approaches the expression-level estimation of each exon as an independent Bayesian inference problem. In addition, SpliceTrap can identify major classes of alternative splicing events under a single cellular condition, without requiring a background set of reads to estimate relative splicing changes. We tested SpliceTrap both by simulation and real data analysis, and compared it to state-of-the-art tools for transcript quantification. SpliceTrap demonstrated improved accuracy, robustness and reliability in quantifying exon-inclusion ratios. Conclusions: SpliceTrap is a useful tool to study alternative splicing regulation, especially for accurate quantification of local exoninclusion ratios from RNA-seq data. © The Author 2011. Published by Oxford University Press. All rights reserved.", 
                "date": "2011-11-01T00:00:00Z", 
                "citationCount": 59, 
                "authors": [
                    {
                        "name": "Wu J."
                    }, 
                    {
                        "name": "Akerman M."
                    }, 
                    {
                        "name": "Sun S."
                    }, 
                    {
                        "name": "McCombie W.R."
                    }, 
                    {
                        "name": "Krainer A.R."
                    }, 
                    {
                        "name": "Zhang M.Q."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "SpliceTrap Support", 
            "email": "jiewu@mit.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "seqwiki_import", 
    "additionDate": "2017-01-13T13:16:38Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}