{
    "accessibility": "Open access",
    "additionDate": "2021-12-13T12:41:03.459331Z",
    "biotoolsCURIE": "biotools:wavecnet",
    "biotoolsID": "wavecnet",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Linlin Shen",
            "orcidid": "https://orcid.org/0000-0003-1420-0815"
        },
        {
            "name": "Qiufu Li",
            "orcidid": "https://orcid.org/0000-0002-8120-6531"
        },
        {
            "name": "Sheng Guo",
            "orcidid": "https://orcid.org/0000-0002-8959-2473"
        },
        {
            "name": "Zhihui Lai",
            "orcidid": "https://orcid.org/0000-0002-4388-3080"
        }
    ],
    "description": "Wavelet Integrated CNNs to Suppress Aliasing Effect for Noise-Robust Image Classification.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/CVI-SZU/WaveCNet/blob/master/main.py"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CVI-SZU/WaveCNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-12-13T12:41:03.462146Z",
    "license": "Not licensed",
    "name": "WaveCNet",
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TIP.2021.3101395",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.Though widely used in image classification, convolutional neural networks (CNNs) are prone to noise interruptions, i.e. the CNN output can be drastically changed by small image noise. To improve the noise robustness, we try to integrate CNNs with wavelet by replacing the common down-sampling (max-pooling, strided-convolution, and average pooling) with discrete wavelet transform (DWT). We firstly propose general DWT and inverse DWT (IDWT) layers applicable to various orthogonal and biorthogonal discrete wavelets like Haar, Daubechies, and Cohen, etc., and then design wavelet integrated CNNs (WaveCNets) by integrating DWT into the commonly used CNNs (VGG, ResNets, and DenseNet). During the down-sampling, WaveCNets apply DWT to decompose the feature maps into the low-frequency and high-frequency components. Containing the main information including the basic object structures, the low-frequency component is transmitted into the following layers to generate robust high-level features. The high-frequency components are dropped to remove most of the data noises. The experimental results show that WaveCNets achieve higher accuracy on ImageNet than various vanilla CNNs. We have also tested the performance of WaveCNets on the noisy version of ImageNet, ImageNet-C and six adversarial attacks, the results suggest that the proposed DWT/IDWT layers could provide better noise-robustness and adversarial robustness. When applying WaveCNets as backbones, the performance of object detectors (i.e., faster R-CNN and RetinaNet) on COCO detection dataset are consistently improved. We believe that suppression of aliasing effect, i.e. separation of low frequency and high frequency information, is the main advantages of our approach. The code of our DWT/IDWT layer and different WaveCNets are available at https://github.com/CVI-SZU/WaveCNet.",
                "authors": [
                    {
                        "name": "Guo S."
                    },
                    {
                        "name": "Lai Z."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Shen L."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "WaveCNet: Wavelet Integrated CNNs to Suppress Aliasing Effect for Noise-Robust Image Classification"
            },
            "pmid": "34351858"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}
