{
    "accessibility": "Open access",
    "additionDate": "2023-02-24T23:37:33.200075Z",
    "biotoolsCURIE": "biotools:hignn",
    "biotoolsID": "hignn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Duancheng Zhao"
        },
        {
            "name": "Jianrong Xu"
        },
        {
            "name": "Weimin Zhu"
        },
        {
            "name": "Yi Zhang"
        },
        {
            "name": "Ling Wang",
            "orcidid": "https://orcid.org/0000-0001-5116-7749"
        }
    ],
    "description": "A Hierarchical Informative Graph Neural Network for Molecular Property Prediction Equipped with Feature-Wise Attention.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Small molecule design",
                    "uri": "http://edamontology.org/operation_4009"
                }
            ]
        }
    ],
    "homepage": "https://github.com/idruglab/hignn",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T14:58:12.370059Z",
    "license": "MIT",
    "name": "HiGNN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/acs.jcim.2c01099",
            "metadata": {
                "abstract": "Elucidating and accurately predicting the druggability and bioactivities of molecules plays a pivotal role in drug design and discovery and remains an open challenge. Recently, graph neural networks (GNNs) have made remarkable advancements in graph-based molecular property prediction. However, current graph-based deep learning methods neglect the hierarchical information of molecules and the relationships between feature channels. In this study, we propose a well-designed hierarchical informative graph neural network (termed HiGNN) framework for predicting molecular property by utilizing a corepresentation learning of molecular graphs and chemically synthesizable breaking of retrosynthetically interesting chemical substructure (BRICS) fragments. Furthermore, a plug-and-play feature-wise attention block is first designed in HiGNN architecture to adaptively recalibrate atomic features after the message passing phase. Extensive experiments demonstrate that HiGNN achieves state-of-the-art predictive performance on many challenging drug discovery-associated benchmark data sets. In addition, we devise a molecule-fragment similarity mechanism to comprehensively investigate the interpretability of the HiGNN model at the subgraph level, indicating that HiGNN as a powerful deep learning tool can help chemists and pharmacists identify the key components of molecules for designing better molecules with desired properties or functions. The source code is publicly available at https://github.com/idruglab/hignn.",
                "authors": [
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhao D."
                    },
                    {
                        "name": "Zhu W."
                    }
                ],
                "citationCount": 27,
                "date": "2023-01-09T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "HiGNN: A Hierarchical Informative Graph Neural Network for Molecular Property Prediction Equipped with Feature-Wise Attention"
            },
            "pmid": "36519623"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ]
}
