{
    "additionDate": "2021-01-18T09:37:17Z",
    "biotoolsCURIE": "biotools:chemicaltoolbox",
    "biotoolsID": "chemicaltoolbox",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "sbray@informatik.uni-freiburg.de",
            "name": "Simon A. Bray",
            "orcidid": "https://orcid.org/0000-0002-0621-6705",
            "typeEntity": "Person"
        }
    ],
    "description": "ChemicalToolbox is a publicly available web server for performing cheminformatics analysis. The ChemicalToolbox provides an intuitive, graphical interface for common tools for downloading, filtering, visualizing and simulating small molecules and proteins. The ChemicalToolbox is based on Galaxy, an open-source web-based platform which enables accessible and reproducible data analysis. There is already an active Galaxy cheminformatics community using and developing tools. Based on their work, we provide four example workflows which illustrate the capabilities of the ChemicalToolbox, covering assembly of a compound library, hole filling, protein-ligand docking, and construction of a quantitative structure-activity relationship (QSAR) model.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://cheminformatics.usegalaxy.eu/",
    "lastUpdate": "2021-02-15T10:13:59Z",
    "name": "ChemicalToolbox",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S13321-020-00442-7",
            "metadata": {
                "abstract": "© 2020 The Author(s).Here, we introduce the ChemicalToolbox, a publicly available web server for performing cheminformatics analysis. The ChemicalToolbox provides an intuitive, graphical interface for common tools for downloading, filtering, visualizing and simulating small molecules and proteins. The ChemicalToolbox is based on Galaxy, an open-source web-based platform which enables accessible and reproducible data analysis. There is already an active Galaxy cheminformatics community using and developing tools. Based on their work, we provide four example workflows which illustrate the capabilities of the ChemicalToolbox, covering assembly of a compound library, hole filling, protein-ligand docking, and construction of a quantitative structure-activity relationship (QSAR) model. These workflows may be modified and combined flexibly, together with the many other tools available, to fit the needs of a particular project. The ChemicalToolbox is hosted on the European Galaxy server and may be accessed via https://cheminformatics.usegalaxy.eu.",
                "authors": [
                    {
                        "name": "Bray S.A."
                    },
                    {
                        "name": "Lucas X."
                    },
                    {
                        "name": "Kumar A."
                    },
                    {
                        "name": "Gruning B.A."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "The ChemicalToolbox: Reproducible, user-friendly cheminformatics analysis on the Galaxy platform"
            },
            "pmcid": "PMC7268608"
        }
    ],
    "toolType": [
        "Web application",
        "Workbench",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Compound libraries and screening",
            "uri": "http://edamontology.org/topic_3343"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}