{
    "additionDate": "2021-01-18T09:39:14Z",
    "biotoolsCURIE": "biotools:qrisk2",
    "biotoolsID": "qrisk2",
    "confidence_flag": "tool",
    "description": "Gamma-glutamyl transferase and cardiovascular risk in nonalcoholic fatty liver disease.\n\nWelcome to the QRISK ® 2-2017 risk calculator: https://qrisk.org.\n\nThis calculator is only valid if you do not already have a diagnosis of coronary heart disease (including angina or heart attack) or stroke/transient ischaemic attack.\n\nWelcome to the QRISK ® 2-2017 Web Calculator. You can use this calculator to work out your risk of having a heart attack or stroke over the next ten years by answering some simple questions. It is suitable for people who do not already have a diagnosis of heart disease or stroke.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                }
            ]
        }
    ],
    "homepage": "https://qrisk.org/2017/",
    "lastUpdate": "2021-01-31T12:40:42Z",
    "name": "QRISK2",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3748/WJG.V26.I19.2416",
            "metadata": {
                "abstract": "© 2020 Baishideng Publishing Group Co., Limited. All rights reserved.BACKGROUND Gamma-glutamyl transferase (GGT) is associated with the risk of cardiovascular disease (CVD) in the general population. AIM To identify the association of baseline GGT level and QRISK2 score among patients with biopsy-proven nonalcoholic fatty liver disease (NAFLD). METHODS This was a retrospective study involving 1535 biopsy-proven NAFLD patients from 10 Asian centers in 8 countries using data collected by the Gut and Obesity in Asia (referred to as \"GO Asia\") workgroup. All patients with available baseline GGT levels and all 16 variables for the QRISK2 calculation (QRISK2-2017; developed by researchers at the United Kingdom National Health Service; https://qrisk.org/2017/; 10-year cardiovascular risk estimation) were included and compared to healthy controls with the same age, sex, and ethnicity. Relative risk was reported. QRISK2 score > 10% was defined as the high-CVD-risk group. Fibrosis stages 3 and 4 (F3 and F4) were considered advanced fibrosis. RESULTS A total of 1122 patients (73%) had complete data and were included in the final analysis; 314 (28%) had advanced fibrosis. The median age (interquartile range [IQR]) of the study population was 53 (44-60) years, 532 (47.4%) were females, and 492 (43.9%) were of Chinese ethnicity. The median 10-year CVD risk (IQR) was 5.9% (2.6-10.9), and the median relative risk of CVD over 10 years (IQR) was 1.65 (1.13-2.2) compared to healthy individuals with the same age, sex, and ethnicity. The high-CVD-risk group was significantly older than the low-risk group (median [IQR]: 63 [59-67] vs 49 [41-55] years; P < 0.001). Higher fibrosis stages in biopsy-proven NAFLD patients brought a significantly higher CVD risk (P < 0.001). Median GGT level was not different between the two groups (GGT [U/L]: Median [IQR], high risk 60 [37-113] vs low risk 66 [38-103], P = 0.56). There was no correlation between baseline GGT level and 10-year CVD risk based on the QRISK2 score (r = 0.02). CONCLUSION The CVD risk of NAFLD patients is higher than that of healthy individuals. Baseline GGT level cannot predict CVD risk in NAFLD patients. However, advanced fibrosis is a predictor of a high CVD risk.",
                "authors": [
                    {
                        "name": "Pitisuttithum P."
                    },
                    {
                        "name": "Chan W.-K."
                    },
                    {
                        "name": "Goh G.B.-B."
                    },
                    {
                        "name": "Fan J.-G."
                    },
                    {
                        "name": "Song M.J."
                    },
                    {
                        "name": "Charatcharoenwitthaya P."
                    },
                    {
                        "name": "Duseja A."
                    },
                    {
                        "name": "Dan Y.-Y."
                    },
                    {
                        "name": "Imajo K."
                    },
                    {
                        "name": "Nakajima A."
                    },
                    {
                        "name": "Ho K.-Y."
                    },
                    {
                        "name": "Goh K.-L."
                    },
                    {
                        "name": "Wong V.W.-S."
                    },
                    {
                        "name": "Treeprasertsuk S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-21T00:00:00Z",
                "journal": "World Journal of Gastroenterology",
                "title": "Gamma-glutamyl transferase and cardiovascular risk in nonalcoholic fatty liver disease: The Gut and Obesity Asia initiative"
            },
            "pmcid": "PMC7243652",
            "pmid": "32476802"
        }
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ]
}