{
    "accessibility": "Open access",
    "additionDate": "2021-11-27T19:12:41.119884Z",
    "biotoolsCURIE": "biotools:enhic",
    "biotoolsID": "enhic",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wenxiu.ma@ucr.edu",
            "name": "Wenxiu Ma",
            "orcidid": "https://orcid.org/0000-0003-4097-1621",
            "typeEntity": "Person"
        }
    ],
    "description": "Learning fine-resolution Hi-C contact maps using a generative adversarial framework.",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/wmalab/EnHiC",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-11-27T19:12:41.122428Z",
    "license": "MIT",
    "name": "EnHiC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAB272",
            "metadata": {
                "abstract": "© 2021 Oxford University Press. All rights reserved.Motivation: The high-throughput chromosome conformation capture (Hi-C) technique has enabled genome-wide mapping of chromatin interactions. However, high-resolution Hi-C data requires costly, deep sequencing; therefore, it has only been achieved for a limited number of cell types. Machine learning models based on neural networks have been developed as a remedy to this problem. Results: In this work, we propose a novel method, EnHiC, for predicting high-resolution Hi-C matrices from low-resolution input data based on a generative adversarial network (GAN) framework. Inspired by non-negative matrix factorization, our model fully exploits the unique properties of Hi-C matrices and extracts rank-1 features from multiscale low-resolution matrices to enhance the resolution. Using three human Hi-C datasets, we demonstrated that EnHiC accurately and reliably enhanced the resolution of Hi-C matrices and outperformed other GAN-based models. Moreover, EnHiC-predicted high-resolution matrices facilitated the accurate detection of topologically associated domains and fine-scale chromatin interactions. Availability and implementation: EnHiC is publicly available at https://github.com/wmalab/EnHiC.",
                "authors": [
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Ma W."
                    }
                ],
                "date": "2021-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "EnHiC: Learning fine-resolution Hi-C contact maps using a generative adversarial framework"
            },
            "pmcid": "PMC8382278",
            "pmid": "34252966"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        },
        {
            "term": "Chromosome conformation capture",
            "uri": "http://edamontology.org/topic_3940"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}
