{
    "additionDate": "2017-08-20T15:57:55Z",
    "biotoolsCURIE": "biotools:marge",
    "biotoolsID": "marge",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cistrome.org/MARGE/contact.html"
        }
    ],
    "description": "It is a robust methodology that leverages a comprehensive library of genome-wide H3K27ac ChIP-seq profiles to predict key regulated genes and cis-regulatory regions in human or mouse. The framework has three main functions: MARGE-potential, MARGE-express, and MARGE-cistrome.",
    "documentation": [
        {
            "type": "General",
            "url": "http://cistrome.org/MARGE/tutorial.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peak calling",
                    "uri": "http://edamontology.org/operation_3222"
                }
            ]
        }
    ],
    "homepage": "http://cistrome.org/MARGE/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-01-19T17:47:47Z",
    "license": "Not licensed",
    "name": "MARGE",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1101/gr.201574.115",
            "metadata": {
                "abstract": "© 2016 Aldrup-MacDonald et al. Model-based analysis of regulation of gene expression (MARGE) is a framework for interpreting the relationship between the H3K27ac chromatin environment and differentially expressed gene sets. The framework has three main functions: MARGE-potential, MARGE-express, and MARGE-cistrome. MARGE-potential defines a regulatory potential (RP) for each gene as the sum of H3K27ac ChIP-seq signals weighted by a function of genomic distance from the transcription start site. The MARGE framework includes a compendium of RPs derived from 365 human and 267 mouse H3K27ac ChIP-seq data sets. Relative RPs, scaled using this compendium, are superior to superenhancers in predicting BET (bromodomain and extraterminal domain) -inhibitor repressed genes. MARGE-express, which uses logistic regression to retrieve relevant H3K27ac profiles from the compendium to accurately model a query set of differentially expressed genes, was tested on 671 diverse gene sets from MSigDB. MARGE-cistrome adopts a novel semisupervised learning approach to identify cis-regulatory elements regulating a gene set. MARGE-cistrome exploits information from H3K27ac signal at DNase I hypersensitive sites identified from published human and mouse DNase-seq data. We tested the framework on newly generated RNAseq and H3K27ac ChIP-seq profiles upon siRNA silencing of multiple transcriptional and epigenetic regulators in a prostate cancer cell line, LNCaP-abl. MARGE-cistrome can predict the binding sites of silenced transcription factors without matched H3K27ac ChIP-seq data. Even when the matching H3K27ac ChIP-seq profiles are available, MARGE leverages public H3K27ac profiles to enhance these data. This study demonstrates the advantage of integrating a large compendium of historical epigenetic data for genomic studies of transcriptional regulation.",
                "authors": [
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zang C."
                    },
                    {
                        "name": "Xiao T."
                    },
                    {
                        "name": "Fan J."
                    },
                    {
                        "name": "Mei S."
                    },
                    {
                        "name": "Qin Q."
                    },
                    {
                        "name": "Wu Q."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Xu K."
                    },
                    {
                        "name": "He H.H."
                    },
                    {
                        "name": "Brown M."
                    },
                    {
                        "name": "Meyer C.A."
                    },
                    {
                        "name": "Liu X.S."
                    }
                ],
                "citationCount": 11,
                "date": "2016-10-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Modeling cis-regulation with a compendium of genome-wide histone H3K27ac profiles"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1
}