{
    "additionDate": "2021-01-18T09:12:00Z",
    "biotoolsCURIE": "biotools:bisg",
    "biotoolsID": "bisg",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xudong@missouri.edu",
            "name": "Dong Xu",
            "typeEntity": "Person"
        }
    ],
    "description": "BISG (BIclustering based Survival-related Gene sets detection) is a method for detecting cancer survival related gene markers based on rectified gactor network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Incident curve plotting",
                    "uri": "http://edamontology.org/operation_3503"
                }
            ]
        }
    ],
    "homepage": "https://github.com/LingtaoSu/BISG",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-04T15:40:27Z",
    "name": "BISG",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00349",
            "metadata": {
                "abstract": "© Copyright © 2020 Su, Liu, Wang, Gao and Xu.Detecting gene sets that serve as biomarkers for differentiating patient survival groups may help diagnose diseases robustly and develop multi-gene targeted therapies. However, due to the exponential growth of search space imposed by gene combinations, the performance of existing methods is still far from satisfactory. In this study, we developed a new method called BISG (BIclustering based Survival-related Gene sets detection) based on a rectified factor network (RFN) model, which allows efficiently biclustering gene subsets. By correlating genes in each significant bicluster with patient survival outcomes using a log-rank test and multi-sampling strategy, multiple survival-related gene sets can be detected. We applied BISG on three different cancer types, and the resulting gene sets were tested as biomarkers for survival analyses. Secondly, we systematically analyzed 12 different cancer datasets. Our analysis shows that the genes in all the survival-related gene sets are mainly from five gene families: microRNA protein coding host genes, zinc fingers C2H2-type, solute carriers, CD (cluster of differentiation) molecules, and ankyrin repeat domain containing genes. Moreover, we found that they are mainly enriched in heme metabolism, apoptosis, hypoxia and inflammatory response-related pathways. We compared BISG with two other methods, GSAS and IPSOV. Results show that BISG can better differentiate patient survival groups in different datasets. The identified biomarkers suggested by our study provide useful hypotheses for further investigation. BISG is publicly available with open source at https://github.com/LingtaoSu/BISG.",
                "authors": [
                    {
                        "name": "Gao J."
                    },
                    {
                        "name": "Liu G."
                    },
                    {
                        "name": "Su L."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Xu D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-23T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "Detecting Cancer Survival Related Gene Markers Based on Rectified Factor Network"
            },
            "pmcid": "PMC7212422",
            "pmid": "32426342"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ]
}
