{
    "accessibility": "Open access",
    "additionDate": "2022-09-07T22:49:56.592098Z",
    "biotoolsCURIE": "biotools:ijoq",
    "biotoolsID": "ijoq",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "walter.adams@sjsu.edu",
            "name": "Walter Adams",
            "typeEntity": "Person"
        },
        {
            "name": "Devons Mo"
        },
        {
            "name": "Juan P Rosa"
        },
        {
            "name": "Shakir Hasan"
        },
        {
            "name": "Shuying Xu"
        }
    ],
    "description": "Dynamic Python-Based Method Provides Quantitative Analysis of Intercellular Junction Organization During S. pneumoniae Infection of the Respiratory Epithelium.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/DevonsMo/IJOQ/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/DevonsMo/IJOQ",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:40:43.589351Z",
    "license": "GPL-3.0",
    "name": "IJOQ",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.3389/fcimb.2022.865528",
            "metadata": {
                "abstract": "Many respiratory pathogens compromise epithelial barrier function during lung infection by disrupting intercellular junctions, such as adherens junctions and tight junctions, that maintain intercellular integrity. This includes Streptococcus pneumoniae, a leading cause of pneumonia, which can successfully breach the epithelial barrier and cause severe infections such as septicemia and meningitis. Fluorescence microscopy analysis on intercellular junction protein manipulation by respiratory pathogens has yielded major advances in our understanding of their pathogenesis. Unfortunately, a lack of automated image analysis tools that can tolerate variability in sample-sample staining has limited the accuracy in evaluating intercellular junction organization quantitatively. We have created an open source, automated Python computer script called “Intercellular Junction Organization Quantification” or IJOQ that can handle a high degree of sample-sample staining variability and robustly measure intercellular junction integrity. In silico validation of IJOQ was successful in analyzing computer generated images containing varying degrees of simulated intercellular junction disruption. Accurate IJOQ analysis was further confirmed using images generated from in vitro and in vivo bacterial infection models. When compared in parallel to a previously published, semi-automated script used to measure intercellular junction organization, IJOQ demonstrated superior analysis for all in vitro and in vivo experiments described herein. These data indicate that IJOQ is an unbiased, easy-to-use tool for fluorescence microscopy analysis and will serve as a valuable, automated resource to rapidly quantify intercellular junction disruption under diverse experimental conditions.",
                "authors": [
                    {
                        "name": "Adams W."
                    },
                    {
                        "name": "Hasan S."
                    },
                    {
                        "name": "Mo D."
                    },
                    {
                        "name": "Rosa J.P."
                    },
                    {
                        "name": "Xu S."
                    }
                ],
                "citationCount": 4,
                "date": "2022-06-10T00:00:00Z",
                "journal": "Frontiers in Cellular and Infection Microbiology",
                "title": "Dynamic Python-Based Method Provides Quantitative Analysis of Intercellular Junction Organization During S. pneumoniae Infection of the Respiratory Epithelium"
            },
            "pmcid": "PMC9230243",
            "pmid": "35755841"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}
