{
    "additionDate": "2017-02-10T11:34:20Z",
    "biotoolsCURIE": "biotools:arts",
    "biotoolsID": "arts",
    "credit": [
        {
            "email": "ppdock@post.tau.ac.il",
            "name": "ARTS team",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ARTS (Advanced Retrieval Tool for SNPs) can be used to retrieve SNP that are polymorphic between several different mouse strains to aid in the design of genome-wide SNP marker panels.",
    "documentation": [
        {
            "type": "General",
            "url": "http://bioinfo3d.cs.tau.ac.il/ARTS/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo3d.cs.tau.ac.il/ARTS/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "ARTS",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "RNA molecules with common structural features may share similar functional properties. Structural comparison of RNAs and detection of common substructures is, thus, a highly important task. Nevertheless, the current available tools in the RNA community provide only a partial solution, since they either work at the 2D level or are suitable for detecting predefined or local contiguous tertiary motifs only. Here, we describe a web server built around ARTS, a method for aligning tertiary structures of nucleic acids (both RNA and DNA). ARTS receives apair of 3D nucleic acid structures and searches for a priori unknown common substructures. The search is truly 3D and irrespective of the order of the nucleotides on the chain. The identified common substructures can be large global folds with hundreds and even thousands of nucleotides as well as small local motifs with at least two successive base pairs. The method is highly efficient and has been used to conduct an all against-all comparison of all the RNA structures in the Protein Data Bank. The web server together with a software package for download are freely accessible at http://bioinfo3d.cs.tau.ac.il/ARTS. © The Author 2006. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Dror O."
                    },
                    {
                        "name": "Nussinov R."
                    },
                    {
                        "name": "Wolfson H.J."
                    }
                ],
                "citationCount": 35,
                "date": "2006-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "The ARTS web server for aligning RNA tertiary structures"
            },
            "pmid": "16845038"
        },
        {
            "metadata": {
                "abstract": "Motivation: A fast growing number of non-coding RNAs have recently been discovered to play essential roles in many cellular processes. Similar to proteins, understanding the functions of these active RNAs requires methods for analyzing their tertiary structures. However, in contrast to the wide range of structure-based approaches available for proteins, there is still a lack of methods for studying RNA structures. Results: We present a new computational method named ARTS (alignment of RNA tertiary structures). The method compares two nucleic acid structures (RNAs or DNAs) and detects a-priori unknown common substructures. These substructures can be either large global folds containing hundreds and even thousands of nucleotides or small local tertiary motifs with at least two successive base pairs. To the best of our knowledge, this is the first method of this type. The method is highly-efficient and was used to conduct an all-against-all comparison of all the RNA structures currently available in the Protein Data Bank. © The Author 2005. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Dror O."
                    },
                    {
                        "name": "Nussinov R."
                    },
                    {
                        "name": "Wolfson H."
                    }
                ],
                "citationCount": 56,
                "date": "2005-09-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ARTS: Alignment of RNA tertiary structures"
            },
            "pmid": "16204124"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}