{"credit":[{"email":"minhn@bii.a-star.edu.sg","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://mspc.bii.a-star.edu.sg/minhn/contacts_rclick.html"}],"documentation":[{"type":"GENERAL","url":"http://mspc.bii.a-star.edu.sg/minhn/help_rclick.html"}],"function":[{"operation":[{"term":"Comparison","uri":"http://edamontology.org/operation_2424"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Molecular modelling","uri":"http://edamontology.org/topic_2275"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Nucleic acid structure analysis","uri":"http://edamontology.org/topic_0097"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/rclick-comparison-of-rna-3d-structures.html"}],"publication":[{"abstract":"© The Author 2014. Published by Oxford University Press. All rights reserved. Summary: RNA molecules play important roles in key biological processes in the cell and are becoming attractive for developing therapeutic applications. Since the function of RNA depends on its structure and dynamics, comparing and classifying the RNA 3D structures is of crucial importance to molecular biology. In this study, we have developed Rclick, a web server that is capable of superimposing RNA 3D structures by using clique matching and 3D least-squares fitting. Our server Rclick has been benchmarked and compared with other popular servers and methods for RNA structural alignments. In most cases, Rclick alignments were better in terms of structure overlap. Our server also recognizes conformational changes between structures. For this purpose, the server produces complementary alignments to maximize the extent of detectable similarity. Various examples showcase the utility of our web server for comparison of RNA, RNA-protein complexes and RNA-ligand structures. Availability and implementation: The Rclick web server is freely accessible at http://mspc.bii.a-star.edu.sg/minhn/rclick.html.","authors":["Nguyen M.N.","Verma C."],"cit_count":13,"journal":"Bioinformatics","pmid":"25391398","title":"Rclick: A web server for comparison of RNA 3D structures","year":"2015-03-15"}],"summary":{"biotoolsCURIE":"biotools:rclick","biotoolsID":"rclick","description":"The application is capable of superimposing the RNA 3D structures by using the algorithm of clique matching and 3D least squares fitting.","homepage":"http://mspc.bii.a-star.edu.sg/minhn/rclick.html","name":"Rclick"}}