{
    "accessibility": "Open access",
    "additionDate": "2023-08-30T14:30:42.252185Z",
    "biotoolsCURIE": "biotools:scannotate",
    "biotoolsID": "scannotate",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xuekui@uvic.ca",
            "name": "Xuekui Zhang",
            "orcidid": "https://orcid.org/0000-0003-4728-2343",
            "typeEntity": "Person"
        },
        {
            "email": "li.xing@math.usask.ca",
            "name": "Li Xing",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated cell-type annotation tool for single-cell RNA-sequencing data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/package=scAnnotate",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:42:29.798095Z",
    "license": "GPL-3.0",
    "name": "scAnnotate",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioadv/vbad030",
            "metadata": {
                "abstract": "Motivation: Single-cell RNA-sequencing (scRNA-seq) technology enables researchers to investigate a genome at the cellular level with unprecedented resolution. An organism consists of a heterogeneous collection of cell types, each of which plays a distinct role in various biological processes. Hence, the first step of scRNA-seq data analysis is often to distinguish cell types so they can be investigated separately. Researchers have recently developed several automated cell-type annotation tools, requiring neither biological knowledge nor subjective human decisions. Dropout is a crucial characteristic of scRNA-seq data widely used in differential expression analysis. However, no current cell annotation method explicitly utilizes dropout information. Fully utilizing dropout information motivated this work. Results: We present scAnnotate, a cell annotation tool that fully utilizes dropout information. We model every gene's marginal distribution using a mixture model, which describes both the dropout proportion and the distribution of the non-dropout expression levels. Then, using an ensemble machine learning approach, we combine the mixture models of all genes into a single model for cell-type annotation. This combining approach can avoid estimating numerous parameters in the high-dimensional joint distribution of all genes. Using 14 real scRNA-seq datasets, we demonstrate that scAnnotate is competitive against nine existing annotation methods. Furthermore, because of its distinct modelling strategy, scAnnotate's misclassified cells differ greatly from competitor methods. This suggests using scAnnotate together with other methods could further improve annotation accuracy. Availability and implementation: We implemented scAnnotate as an R package and made it publicly available from CRAN: https://cran.r-project.org/package=scAnnotate.",
                "authors": [
                    {
                        "name": "Bai K."
                    },
                    {
                        "name": "Ji X."
                    },
                    {
                        "name": "Tsao D."
                    },
                    {
                        "name": "Tsao M."
                    },
                    {
                        "name": "Xing L."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 7,
                "date": "2023-01-01T00:00:00Z",
                "journal": "Bioinformatics Advances",
                "title": "scAnnotate: an automated cell-type annotation tool for single-cell RNA-sequencing data"
            },
            "pmcid": "PMC10027414",
            "pmid": "36949780"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
