{
    "additionDate": "2019-11-14T19:33:02Z",
    "biotoolsCURIE": "biotools:SED",
    "biotoolsID": "SED",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "kexiaoyan@njmu.edu.cn",
            "name": "Xiaoyan Ke",
            "typeEntity": "Person"
        },
        {
            "email": "zhng@umich.edu",
            "name": "Yang Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Precise modelling and interpretation of bioactivities of ligands targeting G protein-coupled receptors | SED: Screening for Lasso of ECFPs and Deep Neural Nets | SED was developed to predict ligand bioactivities and to recognize key substructures associated with GPCRs through the coupling of screening for Lasso of long extended-connectivity fingerprints (ECFPs) with deep neural network training",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein-ligand docking",
                    "uri": "http://edamontology.org/operation_0482"
                }
            ]
        }
    ],
    "homepage": "https://zhanglab.ccmb.med.umich.edu/SED/",
    "lastUpdate": "2019-11-14T19:33:02Z",
    "name": "SED",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ336",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Accurate prediction and interpretation of ligand bioactivities are essential for virtual screening and drug discovery. Unfortunately, many important drug targets lack experimental data about the ligand bioactivities; this is particularly true for G protein-coupled receptors (GPCRs), which account for the targets of about a third of drugs currently on the market. Computational approaches with the potential of precise assessment of ligand bioactivities and determination of key substructural features which determine ligand bioactivities are needed to address this issue. Results: A new method, SED, was proposed to predict ligand bioactivities and to recognize key substructures associated with GPCRs through the coupling of screening for Lasso of long extended-connectivity fingerprints (ECFPs) with deep neural network training. The SED pipeline contains three successive steps: (i) representation of long ECFPs for ligand molecules, (ii) feature selection by screening for Lasso of ECFPs and (iii) bioactivity prediction through a deep neural network regression model. The method was examined on a set of 16 representative GPCRs that cover most subfamilies of human GPCRs, where each has 300-5000 ligand associations. The results show that SED achieves excellent performance in modelling ligand bioactivities, especially for those in the GPCR datasets without sufficient ligand associations, where SED improved the baseline predictors by 12% in correlation coefficient (r2) and 19% in root mean square error. Detail data analyses suggest that the major advantage of SED lies on its ability to detect substructures from long ECFPs which significantly improves the predictive performance.",
                "authors": [
                    {
                        "name": "Wu J."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Chan W.K.B."
                    },
                    {
                        "name": "Wu W."
                    },
                    {
                        "name": "Pang T."
                    },
                    {
                        "name": "Hu H."
                    },
                    {
                        "name": "Yan S."
                    },
                    {
                        "name": "Ke X."
                    },
                    {
                        "name": "Zhang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Precise modelling and interpretation of bioactivities of ligands targeting G protein-coupled receptors"
            },
            "pmcid": "PMC6612825",
            "pmid": "31510691"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        }
    ]
}