{
    "additionDate": "2021-01-18T12:14:40Z",
    "biotoolsCURIE": "biotools:bcl-conf",
    "biotoolsID": "bcl-conf",
    "confidence_flag": "tool",
    "description": "BCL::Conf is a web application for generating conformational ensembles of small molecules.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Side chain modelling",
                    "uri": "http://edamontology.org/operation_0480"
                },
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                }
            ]
        }
    ],
    "homepage": "http://meilerlab.org/bclconf",
    "lastUpdate": "2021-01-31T16:42:57Z",
    "name": "BCL::Conf",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/ACS.JCIM.0C01140",
            "metadata": {
                "abstract": "© 2021 American Chemical Society. All rights reserved.We previously described BCL::Conf, a knowledge-based conformation sampling algorithm utilizing a small molecule fragment rotamer library derived from the Cambridge Structural Database (CSD, license required), as a component of the BioChemical Library (BCL) cheminformatics toolkit. This paper describes substantial improvements made to the BCL::Conf algorithm and a transition to a rotamer library derived from molecules in the Crystallography Open Database (COD, no license required). We demonstrate the performance of the new BCL::Conf on native conformer recovery in the Platinum dataset of high-quality protein-ligand complexes. This set of 2859 structures has previously been used to assess the performance of over a dozen conformer generation algorithms, including the Conformator, Balloon, RDKit DG, ETKDG, Confab, Frog2, MultiConf-DOCK, CSD conformer generator, ConfGenX-OPSL3 force field, Omega, excalc, iCon, and MOE. These benchmarks suggest that the CSD conformer generator is at the state of the art of reported conformer generators. Our results indicate that the improved BCL::Conf significantly outperforms the CSD conformer generation algorithm at binding conformer recovery across a range of ensemble sizes and with similarly fast rates of conformer generation. BCL::Conf is now distributed with the COD-derived rotamer library and is free for academic use. The BCL can be downloaded at http://meilerlab.org/bclcommons for Windows, Linux, or Apple operating systems. BCL::Conf can now also be accessed via webserver at http://meilerlab.org/bclconf.",
                "authors": [
                    {
                        "name": "Mendenhall J."
                    },
                    {
                        "name": "Brown B.P."
                    },
                    {
                        "name": "Kothiwale S."
                    },
                    {
                        "name": "Meiler J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-25T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "BCL::Conf: Improved Open-Source Knowledge-Based Conformation Sampling Using the Crystallography Open Database"
            },
            "pmid": "33351632"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Chemical biology",
            "uri": "http://edamontology.org/topic_3369"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        }
    ]
}