{
    "additionDate": "2022-09-29T06:24:16.079521Z",
    "biotoolsCURIE": "biotools:bacvacdb",
    "biotoolsID": "bacvacdb",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/bacvacdb/index.php"
        }
    ],
    "description": "BacVacDB is a manually curated comprehensive database containing information of the vaccines for human bacterial diseases",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/bacvacdb/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/bacvacdb/index.php",
    "lastUpdate": "2024-07-24T10:22:19.325937Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/bacvacdb/index.php"
        }
    ],
    "name": "BacVacDB",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.106030",
            "metadata": {
                "abstract": "Background: Bacterial diseases are one of the leading causes of millions of fatalities worldwide, mainly due to antimicrobial resistance. The discovery of chicken cholera vaccine in 1879 revolutionized our fight against bacterial infections. Bacterial vaccines are proven to be highly effective in preventing many infectious diseases. Currently, various licensed vaccines are available against bacterial infections such as typhoid, diphtheria, cholera and tetanus in the market. In this study, we have attempted to compile different information regarding bacterial vaccines, their types, efficacy, mechanism of action, status, route of administration and other relevant details as a knowledgebase known as BacVacDB. Methods: BacVacDB was implemented using Linux-Apache-MySQL-PHP. HTML, PHP, CSS and Javascript have been used to develop the front end and MySQL for the back end. The data was curated from several sources, including literature, databases and relevant web resources. Results: This paper reviewed 371 vaccines against 30 human bacterial diseases maintained in BacVacDB, of which 167 are approved and 204 in clinical trials. This database provides the users an effortless search facility in the four modules, ‘Search,’ ‘Browse,’ ‘External Links’ and ‘General Information’. In this systematic attempt, we also included the history of vaccines, their mechanism, types, route of administration and approving agencies. Conclusions: This knowledgebase has an intuitive interface that allows users to explore, search, and download information as well as to submit new bacterial vaccines (https://webs.iiitd.edu.in/raghava/bacvacdb/).",
                "authors": [
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Jain S."
                    },
                    {
                        "name": "Naorem L.D."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Sharma N."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "Collection, compilation and analysis of bacterial vaccines"
            },
            "pmid": "36084380"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
