{
    "additionDate": "2020-01-09T17:49:48Z",
    "biotoolsCURIE": "biotools:Metandem",
    "biotoolsID": "Metandem",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lingjun.li@wisc.edu",
            "name": "Lingjun Li",
            "typeEntity": "Person"
        }
    ],
    "description": "An online software tool for mass spectrometry-based isobaric labeling metabolomics.\n\nMetandem - A Data Analysis Tool for Isobaric Labeling-based Metabolomics.\n\nMetandem is a free online data analysis platform for mass spectrometry-based isobaric labeling metabolomics. It allows users to upload and process MS or hyphenated MS data files for isobaric-labeling-based quantitative and qualitative metabolomics analyses, including feature extraction, metabolite quantification, metabolite identification, batch processing of multiple data files, parameter optimization, median normalization, and statistical analysis. Results can be downloaded or visualized online",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                }
            ]
        }
    ],
    "homepage": "http://metandem.com/web/",
    "lastUpdate": "2020-12-28T09:22:41Z",
    "name": "Metandem",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.ACA.2019.08.046",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Mass spectrometry-based stable isotope labeling provides the advantages of multiplexing capability and accurate quantification but requires tailored bioinformatics tools for data analysis. Despite the rapid advancements in analytical methodology, it is often challenging to analyze stable isotope labeling-based metabolomics data, particularly for isobaric labeling using MS/MS reporter ions for quantification. We report Metandem, a novel online software tool for isobaric labeling-based metabolomics, freely available at http://metandem.com/web/. Metandem provides a comprehensive data analysis pipeline integrating feature extraction, metabolite quantification, metabolite identification, batch processing of multiple data files, online parameter optimization for custom datasets, data normalization, and statistical analysis. Systematic evaluation of the Metandem tool was demonstrated on UPLC-MS/MS, nanoLC-MS/MS, CE-MS/MS and MALDI-MS platforms, via duplex, 4-plex, 10-plex, and 12-plex isobaric labeling experiments and the application to various biological samples.",
                "authors": [
                    {
                        "name": "Hao L."
                    },
                    {
                        "name": "Zhu Y."
                    },
                    {
                        "name": "Wei P."
                    },
                    {
                        "name": "Johnson J."
                    },
                    {
                        "name": "Buchberger A."
                    },
                    {
                        "name": "Frost D."
                    },
                    {
                        "name": "Kao W.J."
                    },
                    {
                        "name": "Li L."
                    }
                ],
                "citationCount": 7,
                "date": "2019-12-11T00:00:00Z",
                "journal": "Analytica Chimica Acta",
                "title": "Metandem: An online software tool for mass spectrometry-based isobaric labeling metabolomics"
            },
            "pmcid": "PMC6814207",
            "pmid": "31623721"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1
}