{"credit":[{"email":"sereina.rutschmann@gmail.com","name":"Sereina Rutschmann","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/hdetering/discomark/wiki"}],"function":[{"operation":[{"term":"Sequence trimming","uri":"http://edamontology.org/operation_3192"}]},{"operation":[{"term":"PCR primer design","uri":"http://edamontology.org/operation_0308"}]},{"operation":[{"term":"Phylogenetic tree reconstruction","uri":"http://edamontology.org/operation_3478"}]}],"labels":{"language":["JavaScript","Shell","Perl","Python"],"license":"GPL-2.0","operatingSystem":["Linux"],"toolType":["Command-line tool","Desktop application"],"topic":[{"term":"Phylogenetics","uri":"http://edamontology.org/topic_3293"},{"term":"Probes and primers","uri":"http://edamontology.org/topic_0632"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"}]},"publication":[{"abstract":"© 2016 John Wiley & Sons Ltd High-throughput sequencing has laid the foundation for fast and cost-effective development of phylogenetic markers. Here we present the program discomark, which streamlines the development of nuclear DNA (nDNA) markers from whole-genome (or whole-transcriptome) sequencing data, combining local alignment, alignment trimming, reference mapping and primer design based on multiple sequence alignments to design primer pairs from input orthologous sequences. To demonstrate the suitability of discomark, we designed markers for two groups of species, one consisting of closely related species and one group of distantly related species. For the closely related members of the species complex of Cloeon dipterum s.l. (Insecta, Ephemeroptera), the program discovered a total of 78 markers. Among these, we selected eight markers for amplification and Sanger sequencing. The exon sequence alignments (2526 base pairs) were used to reconstruct a well-supported phylogeny and to infer clearly structured haplotype networks. For the distantly related species, we designed primers for the insect order Ephemeroptera, using available genomic data from four sequenced species. We developed primer pairs for 23 markers that are designed to amplify across several families. The discomark program will enhance the development of new nDNA markers by providing a streamlined, automated approach to perform genome-scale scans for phylogenetic markers. The program is written in Python, released under a public licence (GNU GPL version 2), and together with a manual and example data set available at: https://github.com/hdetering/discomark.","authors":["Rutschmann S.","Detering H.","Simon S.","Fredslund J.","Monaghan M.T."],"cit_count":4,"doi":"10.1111/1755-0998.12576","journal":"Molecular Ecology Resources","pmid":"27454666","title":"discomark: nuclear marker discovery from orthologous sequences using draft genome data","year":"2017-03-01"}],"summary":{"biotoolsCURIE":"biotools:discromark","biotoolsID":"discromark","description":"Discovery of Markers. Identify conserved regions and design primers based on multiple sequence alignments of putative orthologous sequences from whole‐genome or whole‐transcriptome data.","homepage":"https://github.com/hdetering/discomark","name":"discromark","version":["1.0"]}}