{
    "additionDate": "2021-07-06T17:18:18Z",
    "biotoolsCURIE": "biotools:humann2",
    "biotoolsID": "humann2",
    "description": "HUMAnN 2.0 is a pipeline for efficiently and accurately profiling the presence/absence and abundance of microbial pathways in a community from metagenomic or metatranscriptomic sequencing data (typically millions of short DNA/RNA reads). This process, referred to as functional profiling, aims to describe the metabolic potential of a microbial community and its members. More generally, functional profiling answers the question “What are the microbes in my community-of-interest doing (or capable of doing)?”",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic pathway prediction",
                    "uri": "http://edamontology.org/operation_3929"
                }
            ]
        }
    ],
    "homepage": "http://huttenhower.sph.harvard.edu/humann2",
    "lastUpdate": "2021-07-06T17:18:55Z",
    "name": "HUMAnN2",
    "owner": "leipzig",
    "publication": [
        {
            "doi": "10.1038/s41592-018-0176-y",
            "metadata": {
                "abstract": "© 2018, The Author(s), under exclusive licence to Springer Nature America, Inc.Functional profiles of microbial communities are typically generated using comprehensive metagenomic or metatranscriptomic sequence read searches, which are time-consuming, prone to spurious mapping, and often limited to community-level quantification. We developed HUMAnN2, a tiered search strategy that enables fast, accurate, and species-resolved functional profiling of host-associated and environmental communities. HUMAnN2 identifies a community’s known species, aligns reads to their pangenomes, performs translated search on unclassified reads, and finally quantifies gene families and pathways. Relative to pure translated search, HUMAnN2 is faster and produces more accurate gene family profiles. We applied HUMAnN2 to study clinal variation in marine metabolism, ecological contribution patterns among human microbiome pathways, variation in species’ genomic versus transcriptional contributions, and strain profiling. Further, we introduce ‘contributional diversity’ to explain patterns of ecological assembly across different microbial community types.",
                "authors": [
                    {
                        "name": "Caporaso J.G."
                    },
                    {
                        "name": "Franzosa E.A."
                    },
                    {
                        "name": "Huttenhower C."
                    },
                    {
                        "name": "Knight R."
                    },
                    {
                        "name": "Lipson K.S."
                    },
                    {
                        "name": "McIver L.J."
                    },
                    {
                        "name": "Rahnavard G."
                    },
                    {
                        "name": "Schirmer M."
                    },
                    {
                        "name": "Segata N."
                    },
                    {
                        "name": "Thompson L.R."
                    },
                    {
                        "name": "Weingart G."
                    }
                ],
                "citationCount": 317,
                "date": "2018-11-01T00:00:00Z",
                "journal": "Nature Methods",
                "title": "Species-level functional profiling of metagenomes and metatranscriptomes"
            }
        }
    ]
}
