{
    "additionDate": "2022-11-15T07:32:40.397399Z",
    "biotoolsCURIE": "biotools:mstocirc",
    "biotoolsID": "mstocirc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "glli@snnu.edu.cn",
            "name": "Guanglin Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A tool to proteome-widely predict the translatable circRNAs based on mass spectrometry",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QUMU00/mstocirc-master",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2024-11-24T15:21:11.298039Z",
    "license": "Not licensed",
    "name": "MStoCIRC",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/fmolb.2022.791797",
            "metadata": {
                "abstract": "CircRNAs are formed by a non-canonical splicing method and appear circular in nature. CircRNAs are widely distributed in organisms and have the features of time- and tissue-specific expressions. CircRNAs have attracted increasing interest from scientists because of their non-negligible effects on the growth and development of organisms. The translation capability of circRNAs is a novel and valuable direction in the functional research of circRNAs. To explore the translation potential of circRNAs, some progress has been made in both experimental identification and computational prediction. For computational prediction, both CircCode and CircPro are ribosome profiling-based software applications for predicting translatable circRNAs, and the online databases riboCIRC and TransCirc analyze as many pieces of evidence as possible and list the predicted translatable circRNAs of high confidence. Simultaneously, mass spectrometry in proteomics is often recognized as an efficient method to support the identification of protein and peptide sequences from diverse complex templates. However, few applications fully utilize mass spectrometry to predict translatable circRNAs. Therefore, this research aims to build up a scientific analysis pipeline with two salient features: 1) it starts with the data analysis of raw tandem mass spectrometry data; and 2) it also incorporates other translation evidence such as IRES. The pipeline has been packaged into an analysis tool called mass spectrometry to translatable circRNAs (MStoCIRC). MStoCIRC is mainly implemented by Python3 language programming and could be downloaded from GitHub (https://github.com/QUMU00/mstocirc-master). The tool contains a main program and several small, independent function modules, making it more multifunctional. MStoCIRC can process data efficiently and has obtained hundreds of translatable circRNAs in humans and Arabidopsis thaliana.",
                "authors": [
                    {
                        "name": "Cao Z."
                    },
                    {
                        "name": "Li G."
                    }
                ],
                "citationCount": 2,
                "date": "2022-08-22T00:00:00Z",
                "journal": "Frontiers in Molecular Biosciences",
                "title": "MStoCIRC: A powerful tool for downstream analysis of MS/MS data to predict translatable circRNAs"
            },
            "pmcid": "PMC9441560",
            "pmid": "36072432"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
