
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://vamps.mbl.edu/utils/contact.php"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://github.com/annaship/BPC-scripts/blob/master/gast_ill"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequences",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "References",
                "uri": "http://edamontology.org/topic_3068"
            },
            {
                "term": "Taxonomy",
                "uri": "http://edamontology.org/topic_0637"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gast-global-alignment-sequence-taxonomy.html"
        }
    ],
    "publication": [
        {
            "abstract": "Massively parallel pyrosequencing of hypervariable regions from small subunit ribosomal RNA (SSU rRNA) genes can sample a microbial community two or three orders of magnitude more deeply per dollar and per hour than capillary sequencing of full-length SSU rRNA. As with full-length rRNA surveys, each sequence read is a tag surrogate for a single microbe. However, rather than assigning taxonomy by creating gene trees de novo that include all experimental sequences and certain reference taxa, we compare the hypervariable region tags to an extensive database of rRNA sequences and assign taxonomy based on the best match in a Global Alignment for Sequence Taxonomy (GAST) process. The resulting taxonomic census provides information on both composition and diversity of the microbial community. To determine the effectiveness of using only hypervariable region tags for assessing microbial community membership, we compared the taxonomy assigned to the V3 and V6 hypervariable regions with the taxonomy assigned to full-length SSU rRNA sequences isolated from both the human gut and a deep-sea hydrothermal vent. The hypervariable region tags and full-length rRNA sequences provided equivalent taxonomy and measures of relative abundance of microbial communities, even for tags up to 15% divergent from their nearest reference match. The greater sampling depth per dollar afforded by massively parallel pyrosequencing reveals many more members of the \"rare biosphere\" than does capillary sequencing of the full-length gene. In addition, tag sequencing eliminates cloning bias and the sequences are short enough to be completely sequenced in a single read, maximizing the number of organisms sampled in a run while minimizing chimera formation. This technique allows the cost-effective exploration of changes in microbial community structure, including the rare biosphere, over space and time and can be applied immediately to initiatives, such as the Human Microbiome Project. © 2008 Huse et al.",
            "authors": [
                "Huse S.M.",
                "Dethlefsen L.",
                "Huber J.A.",
                "Welch D.M.",
                "Relman D.A.",
                "Sogin M.L."
            ],
            "cit_count": 595,
            "doi": "10.1371/journal.pgen.1000255",
            "journal": "PLoS Genetics",
            "title": "Exploring microbial diversity and taxonomy using SSU rRNA hypervariable tag sequencing",
            "type": "Primary",
            "year": "2008-11-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gast",
        "biotoolsID": "gast",
        "description": "The GAST algorithm assigns taxonomy to SSU sequences by comparing them to a set of reference sequences with known taxonomy. In the simplest terms, taxonomy is assigned to each query sequence based on the consensus of the nearest references sequences. The alignment distance between the query and references is also reported as a measure of how similar the query and reference sequences really are.",
        "homepage": "http://vamps.mbl.edu/resources/software.php",
        "name": "GAST"
    }
}