{
    "additionDate": "2020-01-14T19:50:41Z",
    "biotoolsCURIE": "biotools:ST-SIM",
    "biotoolsID": "ST-SIM",
    "confidence_flag": "tool",
    "description": "Subjective Evaluation of the Spectral Temporal SIMilarity (ST-SIM) Measure for Vibrotactile Quality Assessment.\n\nRecent standardization efforts for Tactile Internet (TI) and haptic codecs have paved the route for delivering tactile experiences in synchrony with audio and visual interaction components. Since humans are the ultimate consumers of tactile interactions, it is utmost important to develop objective quality assessment measures that are in close agreements with human perception. In this work, we present the results of a large-scale subjective study of a recently proposed objective quality assessment approach for vibrotactile signals called ST-SIM (Spectral Temporal SIMilarity). ST-SIM encompasses two components: perceptual spectral and temporal similarity measures. Two subjective experiments were conducted to validate ST-SIM, and elicited subjective ratings are used to create a VibroTactile Quality Assessment (VTQA) database.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://www.raniahassen.com/Research/",
    "lastUpdate": "2021-01-16T14:24:43Z",
    "name": "ST-SIM",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TOH.2019.2962446",
            "metadata": {
                "abstract": "© 2008-2011 IEEE.Recent standardization efforts for Tactile Internet (TI) and haptic codecs have paved the route for delivering tactile experiences in synchrony with audio and visual interaction components. Since humans are the ultimate consumers of tactile interactions, it is utmost important to develop objective quality assessment measures that are in close agreements with human perception. In this article, we present the results of a large-scale subjective study of a recently proposed objective quality assessment approach for vibrotactile signals called ST-SIM (Spectral Temporal SIMilarity). ST-SIM encompasses two components: perceptual spectral and temporal similarity measures. Two subjective experiments were conducted to validate ST-SIM, and elicited subjective ratings are used to create a VibroTactile Quality Assessment (VTQA) database. The VTQA database together with ST-SIM provide viable means to the development of vibrotactile compression and transmission applications. Our experimental results show that the ST-SIM highly correlates with human opinions in both experiments and significantly outperforms commonly used measures. The VTQA database is made publicly available at https://www.raniahassen.com/RESEARCH/.",
                "authors": [
                    {
                        "name": "Hassen R."
                    },
                    {
                        "name": "Steinbach E."
                    }
                ],
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Haptics",
                "title": "Subjective Evaluation of the Spectral Temporal SIMilarity (ST-SIM) Measure for Vibrotactile Quality Assessment"
            },
            "pmid": "31880560"
        }
    ],
    "topic": [
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        }
    ],
    "validated": 1
}