{
    "additionDate": "2021-10-11T09:04:51.678340Z",
    "biotoolsCURIE": "biotools:msrdb",
    "biotoolsID": "msrdb",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "todd.gray@health.ny.gov",
            "name": "Todd A. Gray",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "joseph.wade@health.ny.gov",
            "name": "Joseph T. Wade",
            "orcidid": "https://orcid.org/0000-0002-9779-3160",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "keith.derbyshire@health.ny.gov",
            "name": "Keith M. Derbyshire",
            "orcidid": "https://orcid.org/0000-0003-3404-8312",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "MSRdb (Mycobacterial Systems Resource) is a mycobacterial systems resource for the research community. The Mycobacterial Systems Resource (MSR) is a comprehensive, integrated biological and bioinformatic resource for the research community. The MSR uses M. smegmatis as its model organism, while focusing exclusively on genes that are highly conserved across the mycobacterial genus. Thus, functional insights from the MSR will apply to all mycobacterial species.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Homology-based gene prediction",
                    "uri": "http://edamontology.org/operation_3663"
                }
            ]
        }
    ],
    "homepage": "https://msrdb.org/",
    "lastUpdate": "2021-10-11T09:06:12.508582Z",
    "name": "MSRdb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1128/MBIO.02401-20",
            "metadata": {
                "abstract": "© 2021 Judd et al.Functional characterization of bacterial proteins lags far behind the identification of new protein families. This is especially true for bacterial species that are more difficult to grow and genetically manipulate than model systems such as Escherichia coli and Bacillus subtilis. To facilitate functional characterization of mycobacterial proteins, we have established a Mycobacterial Systems Resource (MSR) using the model organism Mycobacterium smegmatis. Thisresourcefocusesspecifically on 1,153 highly conserved core genes that are common to many mycobacterial species, including Mycobacterium tuberculosis, in order to provide the most relevant information and resources for the mycobacterial research community. The MSR includes both biological and bioinformatic resources. The biological resource includes (i) an expression plasmid library of 1,116 genes fused to a fluorescent protein for determining protein localization; (ii) a library of 569 precise deletions of nonessential genes; and (iii) a set of 843 CRISPR-interference (CRISPRi) plasmids specifically targeted to silence expression of essential core genes and genes for which a precise deletion was not obtained. The bioinformatic resource includes information about individual genes and a detailed assessment of protein local-ization. We anticipate that integration of these initial functional analyses and the availability of the biological resource will facilitate studies of these core proteins in many Mycobacterium species, including the less experimentally tractable pathogens M. absces-sus, M. avium, M. kansasii, M. leprae, M. marinum, M. tuberculosis, andM. ulcerans. IMPORTANCE Diseases caused by mycobacterial species result in millions of deaths per year globally, and present a substantial health and economic burden, especially in immunocompromised patients. Difficulties inherent in working with mycobacterial pathogens have hampered the development and application of high-throughput genetics that can inform genome annotations and subsequent functional assays. To facilitate mycobacterial research, we have created a biological and bioinformatic resource (https://msrdb.org/) using Mycobacterium smegmatis as a model organism. The resource focuses specifically on 1,153 proteins that are highly conserved across the mycobacterial genus and, therefore, likely perform conserved mycobacterial core functions. Thus, functional insights from the MSR will apply to all mycobacterial spe-cies. We believe that the availability of this mycobacterial systems resource will accelerate research throughout the mycobacterial research community.",
                "authors": [
                    {
                        "name": "Judd J.A."
                    },
                    {
                        "name": "Canestrari J."
                    },
                    {
                        "name": "Clark R."
                    },
                    {
                        "name": "Joseph A."
                    },
                    {
                        "name": "Lapierre P."
                    },
                    {
                        "name": "Lasek-Nesselquist E."
                    },
                    {
                        "name": "Mir M."
                    },
                    {
                        "name": "Palumbo M."
                    },
                    {
                        "name": "Smith C."
                    },
                    {
                        "name": "Stone M."
                    },
                    {
                        "name": "Upadhyay A."
                    },
                    {
                        "name": "Wirth S.E."
                    },
                    {
                        "name": "Dedrick R.M."
                    },
                    {
                        "name": "Meier C.G."
                    },
                    {
                        "name": "Russell D.A."
                    },
                    {
                        "name": "Dills A."
                    },
                    {
                        "name": "Dove E."
                    },
                    {
                        "name": "Kester J."
                    },
                    {
                        "name": "Wolf I.D."
                    },
                    {
                        "name": "Zhu J."
                    },
                    {
                        "name": "Rubin E.R."
                    },
                    {
                        "name": "Fortune S."
                    },
                    {
                        "name": "Hatfull G.F."
                    },
                    {
                        "name": "Gray T.A."
                    },
                    {
                        "name": "Wade J.T."
                    },
                    {
                        "name": "Derbyshire K.M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "mBio",
                "title": "A mycobacterial systems resource for the research community"
            },
            "pmcid": "PMC8092266",
            "pmid": "33653882",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}