{
    "additionDate": "2025-05-22T12:06:46.866961Z",
    "biotoolsCURIE": "biotools:breast_dense_tissue_segmentation",
    "biotoolsID": "breast_dense_tissue_segmentation",
    "collectionID": [
        "EUCAIM"
    ],
    "description": "The tool takes a digital mammogram and performs an automatic segmentation of the breast area and the dense tissue. After the mammogram segmentation, the tool returns a DICOM-SEG image with both the dense tissue and the breast tissue mask combined.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image annotation",
                    "uri": "http://edamontology.org/operation_3553"
                }
            ]
        }
    ],
    "homepage": "https://pubmed.ncbi.nlm.nih.gov/36010173/",
    "lastUpdate": "2025-06-19T06:23:14.022250Z",
    "license": "Proprietary",
    "name": "Breast Dense Tissue Segmentation",
    "owner": "dsilveira",
    "publication": [
        {
            "doi": "10.3390/diagnostics12081822",
            "metadata": {
                "abstract": "Breast density assessed from digital mammograms is a known biomarker related to a higher risk of developing breast cancer. Supervised learning algorithms have been implemented to determine this. However, the performance of these algorithms depends on the quality of the ground-truth information, which expert readers usually provide. These expert labels are noisy approximations to the ground truth, as there is both intra- and inter-observer variability among them. Thus, it is crucial to provide a reliable method to measure breast density from mammograms. This paper presents a fully automated method based on deep learning to estimate breast density, including breast detection, pectoral muscle exclusion, and dense tissue segmentation. We propose a novel confusion matrix (CM)—YNet model for the segmentation step. This architecture includes networks to model each radiologist’s noisy label and gives the estimated ground-truth segmentation as well as two parameters that allow interaction with a threshold-based labeling tool. A multi-center study involving 1785 women whose “for presentation” mammograms were obtained from 11 different medical facilities was performed. A total of 2496 mammograms were used as the training corpus, and 844 formed the testing corpus. Additionally, we included a totally independent dataset from a different center, composed of 381 women with one image per patient. Each mammogram was labeled independently by two expert radiologists using a threshold-based tool. The implemented CM-Ynet model achieved the highest DICE score averaged over both test datasets (0.82 ± 0.14) when compared to the closest dense-tissue segmentation assessment from both radiologists. The level of concordance between the two radiologists showed a DICE score of (0.76 ± 0.17). An automatic breast density estimator based on deep learning exhibited higher performance when compared with two experienced radiologists. This suggests that modeling each radiologist’s label allows for better estimation of the unknown ground-truth segmentation. The advantage of the proposed model is that it also provides the threshold parameters that enable user interaction with a threshold-based tool.",
                "authors": [
                    {
                        "name": "Casals M."
                    },
                    {
                        "name": "Larroza A."
                    },
                    {
                        "name": "Llobet R."
                    },
                    {
                        "name": "Perez-Benito F.J."
                    },
                    {
                        "name": "Perez-Cortes J.-C."
                    },
                    {
                        "name": "Perez-Gomez B."
                    },
                    {
                        "name": "Pollan M."
                    },
                    {
                        "name": "Roman M."
                    },
                    {
                        "name": "Salas-Trejo D."
                    }
                ],
                "citationCount": 5,
                "date": "2022-08-01T00:00:00Z",
                "journal": "Diagnostics",
                "title": "Breast Dense Tissue Segmentation with Noisy Labels: A Hybrid Threshold-Based and Mask-Based Approach"
            },
            "pmcid": "PMC9406546",
            "pmid": "36010173"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ],
    "version": [
        "v1.0.6"
    ]
}
