{
    "additionDate": "2020-01-14T19:42:37Z",
    "biotoolsCURIE": "biotools:TestIME",
    "biotoolsID": "TestIME",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "li.jiao@imicams.ac.cn",
            "name": "Jiao Li",
            "typeEntity": "Person"
        }
    ],
    "description": "an application for evaluating the efficiency of Chinese input method engines in electronic medical record entry task.\n\nBACKGROUND:With the wide application of Electronic Medical Record (EMR) systems, it has become a daily work for doctors using keyboards to input clinical information into the EMR system. Chinese Input Method Engine (IME) is essential for doctors to convert pinyin to Chinese characters, and an efficient IME would improve doctors' healthcare work. We developed a tool (called TestIME) to evaluating the efficiency of the current IMEs used in doctors' working scenario.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31801517",
    "lastUpdate": "2020-01-14T19:42:37Z",
    "name": "TestIME",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0932-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: With the wide application of Electronic Medical Record (EMR) systems, it has become a daily work for doctors using keyboards to input clinical information into the EMR system. Chinese Input Method Engine (IME) is essential for doctors to convert pinyin to Chinese characters, and an efficient IME would improve doctors' healthcare work. We developed a tool (called TestIME) to evaluating the efficiency of the current IMEs used in doctors' working scenario. The proposed TestIME consists of four major function modules: 1) Test tasks assignment, to ensure that participants using different IMEs to complete the same test task in a random order; 2) IME automatic switching, to automatically switch the input method engines without changing the experimental settings; 3) participants' behavior monitoring, to record the participants' keystrokes and timestamp during the typing process; 4) questionnaire, to collect the participants' subjective data. In addition, we designed a preliminary experiment to demonstrate the usability of TestIME. We selected three sentences from EMR corpus and news corpus as test texts respectively, and recruited four participants in a medical school to complete text entry tasks using the TestIME. Results: Our TestIME was able to generate 72 files that record the detailed participants' keyboard behavior while transcribing test texts, and 4 questionnaires that reflect participants' psychological states. These profiles can be downloaded in a structured format (CSV) from the TestIME for further analysis. Conclusions: We developed a tool (TestIME) to evaluate Chinese input methods in the EMR entry tasks. In the given text input scenario in healthcare, the TestIME is capable to record doctors' keyboard behavior, frequently used Chinese terms, IME usability feedback etc. These user profiles are important to improve current IME tools for doctors and further improve healthcare service.",
                "authors": [
                    {
                        "name": "Yang F."
                    },
                    {
                        "name": "Guo H."
                    },
                    {
                        "name": "Li J."
                    }
                ],
                "date": "2019-12-05T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "TestIME: An application for evaluating the efficiency of Chinese input method engines in electronic medical record entry task"
            },
            "pmcid": "PMC6894108",
            "pmid": "31801517"
        }
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}