
{
    "credit": [
        {
            "email": "e.tillier@utoronto.ca",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.uhnresearch.ca/labs/tillier/index.htm"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://wwwlabs.uhnresearch.ca/tillier/pmb/pmb.pdf"
        },
        {
            "type": "General",
            "url": "http://wwwlabs.uhnresearch.ca/tillier/software.htm#6"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Calculation",
                    "uri": "http://edamontology.org/operation_3438"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "MATLAB"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Phylogenetics",
                "uri": "http://edamontology.org/topic_3293"
            },
            {
                "term": "Applied mathematics",
                "uri": "http://edamontology.org/topic_3569"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/automatrix-calculate-instantaneous-rate-matrix.html"
        }
    ],
    "publication": [
        {
            "abstract": "Substitution matrices have been useful for sequence alignment and protein sequence comparisons. The BLOSUM series of matrices, which had been derived from a database of alignments of protein blocks, improved the accuracy of alignments previously obtained from the PAM-type matrices estimated from only closely related sequences. Although BLOSUM matrices are scoring matrices now widely used for protein sequence alignments, they do not describe an evolutionary model. BLOSUM matrices do not permit the estimation of the actual number of amino acid substitutions between sequences by correcting for multiple hits. The method presented here uses the Blocks database of protein alignments, along with the additivity of evolutionary distances, to approximate the amino acid substitution probabilities as a function of actual evolutionary distance. The PMB (Probability Matrix from Blocks) defines a new evolutionary model for protein evolution that can be used for evolutionary analyses of protein sequences. Our model is directly derived from, and thus compatible with, the BLOSUM matrices. The model has the additional advantage of being easily implemented.",
            "authors": [
                "Veerassamy S.",
                "Smith A.",
                "Tillier E.R.M."
            ],
            "cit_count": 88,
            "journal": "Journal of Computational Biology",
            "pmid": "14980022",
            "title": "A Transition Probability Model for Amino Acid Substitutions from Blocks",
            "year": "2003-12-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:automatrix",
        "biotoolsID": "automatrix",
        "description": "Matlab script that will calculate an instantaneous rate matrix (and its eigen value decompostion for use in phylip programs) from a series of substitution count matrices calculated for different levels of sequence identity/similarity.",
        "homepage": "http://www.uhnresearch.ca/labs/tillier/software.htm#6",
        "name": "AutoMatrix"
    }
}