
{
    "credit": [
        {
            "email": "contact@ngs-qc.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.ngs-qc.org/tutorial.php"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequencing quality control",
                    "uri": "http://edamontology.org/operation_3218"
                }
            ]
        }
    ],
    "labels": {
        "collectionID": [
            "Animal and Crop Genomics"
        ],
        "language": [
            "Shell",
            "C++"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Data quality management",
                "uri": "http://edamontology.org/topic_3572"
            },
            {
                "term": "ChIP-seq",
                "uri": "http://edamontology.org/topic_3169"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© Springer Science+Business Media New York 2016.The combination of massive parallel sequencing with a variety of modern DNA/RNA enrichment technologies provides means for interrogating functional protein–genome interactions (ChIP-seq), genome-wide transcriptional activity (RNA-seq; GRO-seq), chromatin accessibility (DNase-seq, FAIRE-seq, MNase-seq), and more recently the three-dimensional organization of chromatin (Hi-C, ChIA-PET). In systems biology-based approaches several of these readouts are generally cumulated with the aim of describing living systems through a reconstitution of the genome-regulatory functions. However, an issue that is often underestimated is that conclusions drawn from such multidimensional analyses of NGS-derived datasets critically depend on the quality of the compared datasets. To address this problem, we have developed the NGS-QC Generator, a quality control system that infers quality descriptors for any kind of ChIP-sequencing and related datasets. In this chapter we provide a detailed protocol for (1) assessing quality descriptors with the NGS-QC Generator; (2) to interpret the generated reports; and (3) to explore the database of QC indicators (www.ngs-qc.org) for >21,000 publicly available datasets.",
            "authors": [
                "Mendoza-Parra M.A.",
                "Saleem M.-A.M.",
                "Blum M.",
                "Cholley P.-E.",
                "Gronemeyer H."
            ],
            "cit_count": 4,
            "doi": "10.1007/978-1-4939-3578-9_13",
            "journal": "Methods in Molecular Biology",
            "title": "NGS-QC generator: A quality control system for ChIP-seq and related deep sequencing-generated datasets",
            "type": "Primary",
            "year": "2016-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ngs-qc_generator",
        "biotoolsID": "ngs-qc_generator",
        "description": "Comparative analysis between ChIP-seq and other enrichment-related NGS datasets requires prior characterization of their degree of technical similarity. The Galaxy tool NGS-QC Generator is a computational-based approach that infers quality indicators from the distribution of sequenced reads associated to a particular NGS profile. Such information is then used for comparative purposes and for defining strategies to improve the quality of sample-derived datasets.",
        "homepage": "http://www.ngs-qc.org/",
        "name": "NGS-QC Generator"
    }
}