{
    "additionDate": "2018-08-09T07:50:55Z",
    "biotoolsCURIE": "biotools:lakemorpho",
    "biotoolsID": "lakemorpho",
    "credit": [
        {
            "email": "hollister.jeff@epa.gov",
            "name": "Jeffrey Hollister",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Calculating lake morphometry metrics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/usepa/lakemorpho"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "https://github.com/usepa/lakemorpho",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "name": "lakemorpho",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.12688/f1000research.12512.1",
            "metadata": {
                "abstract": "© 2017 Hollister J and Stachelek J.Metrics describing the shape and size of lakes, known as lake morphometry metrics, are important for any limnological study. In cases where a lake has long been the subject of study these data are often already collected and are openly available. Many other lakes have these data collected, but access is challenging as it is often stored on individual computers (or worse, in filing cabinets) and is available only to the primary investigators. The vast majority of lakes fall into a third category in which the data are not available. This makes broad scale modelling of lake ecology a challenge as some of the key information about in-lake processes are unavailable. While this valuable in situ information may be difficult to obtain, several national datasets exist that may be used to model and estimate lake morphometry. In particular, digital elevation models and hydrography have been shown to be predictive of several lake morphometry metrics. The R package lakemorpho has been developed to utilize these data and estimate the following morphometry metrics: surface area, shoreline length, major axis length, minor axis length, major and minor axis length ratio, shoreline development, maximum depth, mean depth, volume, maximum lake length, mean lake width, maximum lake width, and fetch. In this software tool article we describe the motivation behind developing lakemorpho, discuss the implementation in R, and describe the use of lakemorpho with an example of a typical use case.",
                "authors": [
                    {
                        "name": "Hollister J."
                    },
                    {
                        "name": "Stachelek J."
                    }
                ],
                "citationCount": 7,
                "date": "2017-01-01T00:00:00Z",
                "journal": "F1000Research",
                "title": "lakemorpho: Calculating lake morphometry metrics in R"
            },
            "pmcid": "PMC5698920",
            "pmid": "29188019"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Marine biology",
            "uri": "http://edamontology.org/topic_3387"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
