{
    "additionDate": "2020-01-14T09:51:30Z",
    "biotoolsCURIE": "biotools:Legumefix_Sympal_vermicompost_Legumefix_Sympal",
    "biotoolsID": "Legumefix_Sympal_vermicompost_Legumefix_Sympal",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "m.thuita@cgiar.org",
            "name": "Moses Thuita",
            "typeEntity": "Person"
        }
    ],
    "description": "Variability of soybean response to rhizobia inoculant, vermicompost, and a legume-specific fertilizer blend in Siaya County of Kenya.\n\nRhizobia inoculation can increase soybean yield, but its performance is influenced by among others soybean genotype, rhizobia strains, environment, and crop management. The objective of the study was to assess soybean response to rhizobia inoculation when grown in soils amended with urea or vermicompost to improve nitrogen levels. Two greenhouse experiments and one field trial at two sites were carried out. The first greenhouse experiment included soils from sixty locations, sampled from smallholder farms in Western Kenya.\n\n||| HOMEPAGE MISSING!.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Sympal vermicompost Legumefix Sympal urea', 'urea Legumefix Sympal vermicompost Legumefix', 'Legumefix Sympal vermicompost Legumefix', 'Sympal vermicompost Legumefix Sympal'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31680708",
    "language": [
        "SAS"
    ],
    "lastUpdate": "2020-01-14T09:51:30Z",
    "name": "Legumefix Sympal vermicompost Legumefix Sympal",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.STILL.2019.06.007",
            "metadata": {
                "abstract": "© 2019 The AuthorsRhizobia inoculation can increase soybean yield, but its performance is influenced by among others soybean genotype, rhizobia strains, environment, and crop management. The objective of the study was to assess soybean response to rhizobia inoculation when grown in soils amended with urea or vermicompost to improve nitrogen levels. Two greenhouse experiments and one field trial at two sites were carried out. The first greenhouse experiment included soils from sixty locations, sampled from smallholder farms in Western Kenya. The second greenhouse experiment consisted of one soil selected among soils used in the first experiment where inoculation response was poor. The soil was amended with vermicompost or urea. In the two greenhouse experiments, Legumefix (inoculant) + Sympal (legume fertilizer blend) were used as a standard package. Results from the second greenhouse experiment were then validated in the field. Analysis of variance was done using SAS statistical software and mean separation was done using standard error of the difference for shoot biomass, grain yield nodulation, nodule effectiveness and nutrient uptake. In the first greenhouse trial, soybean response to inoculation was significantly affected by soil fertility based on nodule fresh weight and shoot biomass. Soils with low nitrogen had low to no response to inoculation. After amendment, nodule fresh weight, nodule effectiveness, nodule occupancy, and shoot dry biomass were greater in the treatment amended with vermicompost than those amended with urea (Legumefix + Sympal + vermicompost and Legumefix + Sympal + urea) respectively. Under field conditions, trends were similar to the second experiment for nodulation, nodule occupancy and nitrogen uptake resulting in significantly greater grain yields (475, 709, 856, 880, 966 kg ha−1) after application of vermicompost at 0, 37, 74, 111, and 148 kg N ha−1 respectively. It was concluded that soybean nodulation and biological nitrogen fixation in low fertility soils would not be suppressed by organic amendments like vermicompost up to 148 kg N ha−1.",
                "authors": [
                    {
                        "name": "Mathenge C."
                    },
                    {
                        "name": "Thuita M."
                    },
                    {
                        "name": "Masso C."
                    },
                    {
                        "name": "Gweyi-Onyango J."
                    },
                    {
                        "name": "Vanlauwe B."
                    }
                ],
                "citationCount": 1,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Soil and Tillage Research",
                "title": "Variability of soybean response to rhizobia inoculant, vermicompost, and a legume-specific fertilizer blend in Siaya County of Kenya"
            },
            "pmcid": "PMC6743212",
            "pmid": "31680708"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ]
}