{
    "additionDate": "2021-11-29T07:05:10.846479Z",
    "biotoolsCURIE": "biotools:progperm",
    "biotoolsID": "progperm",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "liangliangzhang.stat@gmail.com",
            "name": "Liangliang Zhang",
            "orcidid": "https://orcid.org/0000-0001-5986-2260",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ProgPerm is a tool for progressive permutation for a dynamic representation of the robustness of microbiome discoveries. The proposed method progressively permutes the grouping factor labels of microbiome and performs multiple differential abundance tests in each scenario. We compare the signal strength of top hits from the original data with their performance in permutations, and will observe an apparent decreasing trend if these top hits are true positives identified from the data. The method can evaluate the overall association between microbiome and the grouping factor, rank the robustness of the discovered microbes, and list the discoveries, their effect sizes, and individual abundances.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dot plot plotting",
                    "uri": "http://edamontology.org/operation_0490"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://biostatistics.mdanderson.org/shinyapps/ProgPerm",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-11-29T07:05:26.879109Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/LyonsZhang/ProgPerm/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/LyonsZhang/ProgPerm"
        }
    ],
    "name": "ProgPerm",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04061-3",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Identification of features is a critical task in microbiome studies that is complicated by the fact that microbial data are high dimensional and heterogeneous. Masked by the complexity of the data, the problem of separating signals (differential features between groups) from noise (features that are not differential between groups) becomes challenging and troublesome. For instance, when performing differential abundance tests, multiple testing adjustments tend to be overconservative, as the probability of a type I error (false positive) increases dramatically with the large numbers of hypotheses. Moreover, the grouping effect of interest can be obscured by heterogeneity. These factors can incorrectly lead to the conclusion that there are no differences in the microbiome compositions. Results: We translate and represent the problem of identifying differential features, which are differential in two-group comparisons (e.g., treatment versus control), as a dynamic layout of separating the signal from its random background. More specifically, we progressively permute the grouping factor labels of the microbiome samples and perform multiple differential abundance tests in each scenario. We then compare the signal strength of the most differential features from the original data with their performance in permutations, and will observe a visually apparent decreasing trend if these features are true positives identified from the data. Simulations and applications on real data show that the proposed method creates a U-curve when plotting the number of significant features versus the proportion of mixing. The shape of the U-Curve can convey the strength of the overall association between the microbiome and the grouping factor. We also define a fragility index to measure the robustness of the discoveries. Finally, we recommend the identified features by comparing p-values in the observed data with p-values in the fully mixed data. Conclusions: We have developed this into a user-friendly and efficient R-shiny tool with visualizations. By default, we use the Wilcoxon rank sum test to compute the p-values, since it is a robust nonparametric test. Our proposed method can also utilize p-values obtained from other testing methods, such as DESeq. This demonstrates the potential of the progressive permutation method to be extended to new settings.",
                "authors": [
                    {
                        "name": "Do K.-A."
                    },
                    {
                        "name": "Jenq R.R."
                    },
                    {
                        "name": "Peterson C.B."
                    },
                    {
                        "name": "Shi Y."
                    },
                    {
                        "name": "Zhang L."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "ProgPerm: Progressive permutation for a dynamic representation of the robustness of microbiome discoveries"
            },
            "pmcid": "PMC7972227",
            "pmid": "33731016",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
