{
    "additionDate": "2022-09-30T11:33:13.999433Z",
    "biotoolsCURIE": "biotools:ccne",
    "biotoolsID": "ccne",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jianping Jiang"
        },
        {
            "name": "Minggui Wang"
        }
    ],
    "description": "Carbapenemase-encoding gene Copy Number Estimator (ccne) is a tool to estimate the copy number of AMR genes. It uses housekeeping gene as the reference and compares the count of reads that mapped to AMR genes with the count of reads that mapped to the reference gene.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/biojiang/ccne",
    "language": [
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2022-09-30T11:33:14.001980Z",
    "license": "GPL-3.0",
    "name": "CCNE",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1128/SPECTRUM.01000-22",
            "metadata": {
                "abstract": "© 2022 Jiang et al.Carbapenemase production is one of the leading mechanisms of carbapenem resistance in Gram-negative bacteria. An increase in carbapenemase gene (blaCarb) copies is an important mechanism of carbapenem resistance. No currently available bioinformatics tools allow for reliable detection and reporting of carbapenemase gene copy numbers. Here, we describe the carbapenemase-encoding gene copy number estimator (CCNE), a ready-to-use bioinformatics tool that was developed to estimate blaCarb copy numbers from whole-genome sequencing data. Its performance on Klebsiella pneumoniae carbapenemase gene (blaKPC) copy number estimation was evaluated by simulation and quantitative PCR (qPCR), and the results were compared with available algorithms. CCNE has two components, CCNE-acc and CCNE-fast. CCNE-acc detects blaCarb copy number in a comprehensive and high-accuracy way, while CCNE-fast rapidly screens blaCarb copy numbers. CCNE-acc achieved the best accuracy (100%) and the lowest root mean squared error (RMSE; 0.07) in simulated noise data sets, compared to the assembly-based method (23.4% accuracy, 1.697 RMSE) and the OrthologsBased method (78.9% accuracy, 0.395 RMSE). In the qPCR validation, a high consistency was observed between the blaKPC copy number determined by qPCR and that determined with CCNE. Reverse transcription-qPCR transcriptional analysis of 40 isolates showed that blaKPC expression was positively correlated with the blaKPC copy numbers detected by CCNE (P, 0.001). An association study of 357 KPC-producing K. pneumoniae isolates and their antimicrobial susceptibility identified a significant association between the estimated blaKPC copy number and MICs of imipenem (P, 0.001) and ceftazidime-avibactam (P, 0.001). Overall, CCNE is a useful genomic tool for the analysis of antimicrobial resistance genes copy number; it is available at https://github.com/biojiang/ccne.",
                "authors": [
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Fowler V.G."
                    },
                    {
                        "name": "Jiang J."
                    },
                    {
                        "name": "Li P."
                    },
                    {
                        "name": "Wang M."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "van Duin D."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "Microbiology Spectrum",
                "title": "Carbapenemase-Encoding Gene Copy Number Estimator (CCNE): a Tool for Carbapenemase Gene Copy Number Estimation"
            },
            "pmid": "35863018"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        }
    ],
    "validated": 1
}
