
{
    "credit": [
        {
            "email": "Marie-Paule.Lefranc@igh.cnrs.fr",
            "name": "Marie-Paule Lefranc",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "veronique.giudicelli@igh.cnrs.fr",
            "name": "Véronique Giudicelli",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        },
        {
            "email": "patrice.duroux@igh.cnrs.fr",
            "name": "Patrice Duroux",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        },
        {
            "email": "sofia.kossida@igh.cnrs.fr",
            "name": "Sofia Kossida",
            "typeEntity": "Person",
            "typeRoles": [
            ]
        }
    ],
    "documentation": [
        {
            "url": "http://www.imgt.org/IMGT_vquest/user_guide"
        },
        {
            "type": "RELEASE_NOTES",
            "url": "http://www.imgt.org/IMGT_vquest/program_versions"
        },
        {
            "type": "RELEASE_NOTES",
            "url": "http://www.imgt.org/IMGT_vquest/data_releases"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Nucleic acid sequence",
                        "uri": "http://edamontology.org/data_2977"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Sequence alignment analysis",
                    "uri": "http://edamontology.org/operation_0258"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Sequence alignment",
                        "uri": "http://edamontology.org/data_0863"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        },
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence features",
                        "uri": "http://edamontology.org/data_1255"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        },
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Sequence report",
                        "uri": "http://edamontology.org/data_2955"
                    },
                    "format": [
                        {
                            "term": "xlsx",
                            "uri": "http://edamontology.org/format_3620"
                        },
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        },
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge (with restrictions)",
        "language": [
            "Java"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Immunoinformatics",
                "uri": "http://edamontology.org/topic_3948"
            },
            {
                "term": "Immunogenetics",
                "uri": "http://edamontology.org/topic_3930"
            },
            {
                "term": "Sequence analysis",
                "uri": "http://edamontology.org/topic_0080"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "publication": [
        {
            "abstract": "IMGT/V-QUEST is the highly customized and integrated system for the standardized analysis of the immunoglobulin (IG) and T cell receptor (TR) rearranged nucleotide sequences. IMGT/V-QUEST identifies the variable (V), diversity (D) and joining (J) genes and alleles by alignment with the germline IG and TR gene and allele sequences of the IMGT reference directory. New functionalities were added through a complete rewrite in Java. IMGT/V-QUEST analyses batches of sequences (up to 50) in a single run. IMGT/V-QUEST describes the V-REGION mutations and identifies the hot spot positions in the closest germline V gene. IMGT/V-QUEST can detect insertions and deletions in the submitted sequences by reference to the IMGT unique numbering. IMGT/V-QUEST integrates IMGT/JunctionAnalysis for a detailed analysis of the V-J and V-D-J junctions, and IMGT/Automat for a full V-J- and V-D-J-REGION annotation. IMGT/V-QUEST displays, in 'Detailed view', the results and alignments for each submitted sequence individually and, in 'Synthesis view', the alignments of the sequences that, in a given run, express the same V gene and allele. The 'Advanced parameters' allow to modify default parameters used by IMGT/V-QUEST and IMGT/JunctionAnalysis according to the users' interest. IMGT/V-QUEST is freely available for academic research at http://imgt.cines.fr.",
            "authors": [
                "Brochet X.",
                "Lefranc M.P.",
                "Giudicelli V."
            ],
            "cit_count": 597,
            "journal": "Nucleic acids research",
            "pmid": "18503082",
            "title": "IMGT/V-QUEST: the highly customized and integrated system for IG and TR standardized V-J and V-D-J sequence analysis.",
            "year": "2008-01-01"
        },
        {
            "abstract": "IMGT/V-QUEST, for 'V-QUEry and STandardization', is an integrated software program which analyses the immunoglobulin (IG) and T cell receptor (TR) rearranged nucleotide sequences. The extraordinary diversity of the IG and TR repertoires (1012 antibodies and 1012 TR per individual) results from several mechanisms at the DNA level: the combinatorial diversity of the variable (V), diversity (D) and joining (J) genes, the N-diversity and, for IG, the somatic mutations. IMGT/V-QUEST identifies the V, D and J genes and alleles by alignment with the germline IG and TR gene and allele sequences of the IMGT reference directory. IMGT/V-QUEST delimits the structurally important features, frameworks and complementarity-determining regions (the last of these forming the antigen binding site), on the basis of the IMGT unique numbering. The tool localizes the somatic mutations of the IG rearranged sequences. IMGT/V-QUEST also dynamically displays a graphical two-dimensional representation, or IMGT Collier de Peries, of the IG and TR variable regions. Moreover, IMGT/V-QUEST can interact with IMGT/JunctionAnalysis for the detailed description of the V-J and V-D-J junctions, and with IMGT/PhyloGene for the construction of phylogenetic trees. IMGT/V-QUEST is currently available for human and mouse, and partly for non-human primates, sheep, chondrichthyes and teleostei. IMGT/V-QUEST is freely available at http://imgt.cines.fri. © Oxford University Press 2004; all rights reserved.",
            "authors": [
                "Giudicelli V.",
                "Chaume D.",
                "Lefranc M.-P."
            ],
            "cit_count": 227,
            "journal": "Nucleic Acids Research",
            "pmid": "15215425",
            "title": "IMGT/V-QUEST, an integrated software program for immunoglobulin and T cell receptor V-J and V-D-J rearrangement analysis",
            "year": "2004-07-01"
        },
        {
            "pmid": "21632778"
        },
        {
            "abstract": "© The Author(s) 2014. Published by Oxford University Press on behalf of Nucleic Acids Research.IMGT, the international ImMunoGeneTics information system (http://www.imgt.org) is the global reference in immunogenetics and immunoinformatics. By its creation in 1989 by Marie-Paule Lefranc (Université de Montpellier and CNRS), IMGT marked the advent of immunoinformatics, which emerged at the interface between immunogenetics and bioinformatics. IMGT is specialized in the immunoglobulins (IG) or antibodies, T cell receptors (TR), major histocompatibility (MH) and proteins of the IgSF and MhSF superfamilies. IMGT is built on the IMGTONTOLOGY axioms and concepts, which bridged the gap between genes, sequences and 3D structures. The concepts include the IMGTR standardized keywords (identification), IMGTR standardized labels (description), IMGTR standardized nomenclature (classification), IMGT unique numbering and IMGT Colliers de Perles (numerotation). IMGTR comprises 7 databases, 17 online tools and 15 000 pages of web resources, and provides a high-quality and integrated system for analysis of the genomic and expressed IG and TR repertoire of the adaptive immune responses, including NGS high-throughput data. Tools and databases are used in basic, veterinary and medical research, in clinical applications (mutation analysis in leukemia and lymphoma) and in antibody engineering and humanization. The IMGT/mAb-DB interface was developed for therapeutic antibodies and fusion proteins for immunological applications (FPIA). IMGTR is freely available at http://www.imgt.org.",
            "authors": [
                "Lefranc M.-P.",
                "Giudicelli V.",
                "Duroux P.",
                "Jabado-Michaloud J.",
                "Folch G.",
                "Aouinti S.",
                "Carillon E.",
                "Duvergey H.",
                "Houles A.",
                "Paysan-Lafosse T.",
                "Hadi-Saljoqi S.",
                "Sasorith S.",
                "Lefranc G.",
                "Kossida S."
            ],
            "cit_count": 149,
            "journal": "Nucleic Acids Research",
            "pmid": "25378316",
            "title": "IMGT R, the international ImMunoGeneTics information system R 25 years on",
            "year": "2015-01-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:imgt_v-quest",
        "biotoolsID": "imgt_v-quest",
        "description": "IMGT/V-QUEST is the IMGT® tool for nucleotide sequence alignment and analysis of immunoglobulin (IG) or antibody and T cell receptor (TR) variable domains, integrates IMGT/JunctionAnalysis, IMGT/Automat and IMGT/Collier-de-Perles.\nAnalysis is based on the IMGT-ONTOLOGY concepts.",
        "homepage": "http://www.imgt.org/IMGT_vquest",
        "name": "IMGT V-QUEST"
    }
}