{
    "name": "IMGT V-QUEST", 
    "description": "Tool that compares a user-provided fasta-formatted germline or rearranged T cell receptor or immunoglobulin variable sequence with a reference set of sequences.", 
    "homepage": "http://www.imgt.org/IMGT_vquest/vquest", 
    "biotoolsID": "imgt_v-quest", 
    "biotoolsCURIE": "biotools:imgt_v-quest", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3192", 
                    "term": "Sequence trimming"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0258", 
                    "term": "Sequence alignment analysis"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0292", 
                    "term": "Sequence alignment"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0448", 
                    "term": "Sequence alignment analysis (conservation)"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2830", 
            "term": "Immunoproteins, genes and antigens"
        }, 
        {
            "uri": "http://edamontology.org/topic_0199", 
            "term": "Genetic variation"
        }, 
        {
            "uri": "http://edamontology.org/topic_2815", 
            "term": "Human biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }, 
        {
            "uri": "http://edamontology.org/topic_3168", 
            "term": "Sequencing"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Java"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.imgt.org/IMGT_vquest/vquest", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "18503082", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "IMGT/V-QUEST: the highly customized and integrated system for IG and TR standardized V-J and V-D-J sequence analysis.", 
                "abstract": "IMGT/V-QUEST is the highly customized and integrated system for the standardized analysis of the immunoglobulin (IG) and T cell receptor (TR) rearranged nucleotide sequences. IMGT/V-QUEST identifies the variable (V), diversity (D) and joining (J) genes and alleles by alignment with the germline IG and TR gene and allele sequences of the IMGT reference directory. New functionalities were added through a complete rewrite in Java. IMGT/V-QUEST analyses batches of sequences (up to 50) in a single run. IMGT/V-QUEST describes the V-REGION mutations and identifies the hot spot positions in the closest germline V gene. IMGT/V-QUEST can detect insertions and deletions in the submitted sequences by reference to the IMGT unique numbering. IMGT/V-QUEST integrates IMGT/JunctionAnalysis for a detailed analysis of the V-J and V-D-J junctions, and IMGT/Automat for a full V-J- and V-D-J-REGION annotation. IMGT/V-QUEST displays, in 'Detailed view', the results and alignments for each submitted sequence individually and, in 'Synthesis view', the alignments of the sequences that, in a given run, express the same V gene and allele. The 'Advanced parameters' allow to modify default parameters used by IMGT/V-QUEST and IMGT/JunctionAnalysis according to the users' interest. IMGT/V-QUEST is freely available for academic research at http://imgt.cines.fr.", 
                "date": "2008-01-01T00:00:00Z", 
                "citationCount": 528, 
                "authors": [
                    {
                        "name": "Brochet X."
                    }, 
                    {
                        "name": "Lefranc M.P."
                    }, 
                    {
                        "name": "Giudicelli V."
                    }
                ], 
                "journal": "Nucleic acids research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15215425", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "IMGT/V-QUEST, an integrated software program for immunoglobulin and T cell receptor V-J and V-D-J rearrangement analysis", 
                "abstract": "IMGT/V-QUEST, for 'V-QUEry and STandardization', is an integrated software program which analyses the immunoglobulin (IG) and T cell receptor (TR) rearranged nucleotide sequences. The extraordinary diversity of the IG and TR repertoires (1012 antibodies and 1012 TR per individual) results from several mechanisms at the DNA level: the combinatorial diversity of the variable (V), diversity (D) and joining (J) genes, the N-diversity and, for IG, the somatic mutations. IMGT/V-QUEST identifies the V, D and J genes and alleles by alignment with the germline IG and TR gene and allele sequences of the IMGT reference directory. IMGT/V-QUEST delimits the structurally important features, frameworks and complementarity-determining regions (the last of these forming the antigen binding site), on the basis of the IMGT unique numbering. The tool localizes the somatic mutations of the IG rearranged sequences. IMGT/V-QUEST also dynamically displays a graphical two-dimensional representation, or IMGT Collier de Peries, of the IG and TR variable regions. Moreover, IMGT/V-QUEST can interact with IMGT/JunctionAnalysis for the detailed description of the V-J and V-D-J junctions, and with IMGT/PhyloGene for the construction of phylogenetic trees. IMGT/V-QUEST is currently available for human and mouse, and partly for non-human primates, sheep, chondrichthyes and teleostei. IMGT/V-QUEST is freely available at http://imgt.cines.fri. © Oxford University Press 2004; all rights reserved.", 
                "date": "2004-07-01T00:00:00Z", 
                "citationCount": 220, 
                "authors": [
                    {
                        "name": "Giudicelli V."
                    }, 
                    {
                        "name": "Chaume D."
                    }, 
                    {
                        "name": "Lefranc M.-P."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }
    ], 
    "credit": [
        {
            "name": "Marie-Paule Lefranc", 
            "email": "Marie-Paule.Lefranc@igh.cnrs.fr", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-05-01T13:19:16Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}