{"collectionID": [], "accessibility": [], "topic": [{"term": "Transcriptome", "uri": "http://edamontology.org/topic_3308"}, {"term": "Assembly", "uri": "http://edamontology.org/topic_0196"}], "owner": "mbs_import", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/s12859-014-0389-8", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "VTBuilder: A tool for the assembly of multi isoform transcriptomes", "abstract": "© Archer et al.; licensee BioMed Central Ltd.Background: Within many research areas, such as transcriptomics, the millions of short DNA fragments (reads) produced by current sequencing platforms need to be assembled into transcript sequences before they can be utilized. Despite recent advances in assembly software, creating such transcripts from read data harboring isoform variation remains challenging. This is because current approaches fail to identify all variants present or they create chimeric transcripts within which relationships between co-evolving sites and other evolutionary factors are disrupted. We present VTBuilder, a tool for constructing non-chimeric transcripts from read data that has been sequenced from sources containing isoform complexity. Results: We validated VTBuilder using reads simulated from 54 Sanger sequenced transcripts (SSTs) expressed in the venom gland of the saw scaled viper,. The SSTs were selected to represent genes from major co-expressed toxin groups known to harbor isoform variants. From the simulated reads, VTBuilder constructed 55 transcripts, 50 of which had a greater than 99% sequence similarity to 48 of the SSTs. In contrast, using the popular assembler tool Trinity (r2013-02-25), only 14 transcripts were constructed with a similar level of sequence identity to just 11 SSTs. Furthermore VTBuilder produced transcripts with a similar length distribution to the SSTs while those produced by Trinity were considerably shorter. To demonstrate that our approach can be scaled to real world data we assembled the venom gland transcriptome of the African puff adder using paired-end reads sequenced on Illumina's MiSeq platform. VTBuilder constructed 1481 transcripts from 5 million reads and, following annotation, all major toxin genes were recovered demonstrating reconstruction of complex underlying sequence and isoform diversity. Conclusion: Unlike other approaches, VTBuilder strives to maintain the relationships between co-evolving sites within the constructed transcripts, and thus increases transcript utility for a wide range of research areas ranging from transcriptomics to phylogenetics and including the monitoring of drug resistant parasite populations. Additionally, improving the quality of transcripts assembled from read data will have an impact on future studies that query these data. VTBuilder has been implemented in java and is available, under the GPL GPU V0.3 license, from http://.", "citationCount": 16, "authors": [{"name": "Archer J."}, {"name": "Whiteley G."}, {"name": "Casewell N.R."}, {"name": "Harrison R.A."}, {"name": "Wagstaff S.C."}], "date": "2014-12-03T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": null, "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "jarcher@liverpool.ac.uk"}], "biotoolsCURIE": "biotools:vtbuilder", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "http://www.lstmed.ac.uk/vtbuilder", "function": [{"note": null, "input": [], "operation": [{"term": "Sequence assembly", "uri": "http://edamontology.org/operation_0310"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:58:58Z", "otherID": [], "description": "It is for the inference of non-chimeric contigs from read data that has been sequenced from complex multi-isoformic transcriptomes, such as snake venom glands, or rapidly evolving viral populations, such as HIV-1.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["Java"], "link": [{"url": "http://www.mybiosoftware.com/vtbuilder-assembly-of-multi-isoform-transcriptomes.html", "note": null, "type": "Software catalogue"}], "biotoolsID": "vtbuilder", "additionDate": "2017-12-18T00:14:05Z", "name": "VTBuilder", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}