{
    "additionDate": "2024-03-18T14:41:54.313503Z",
    "biotoolsCURIE": "biotools:kidneygps",
    "biotoolsID": "kidneygps",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "iris.heid@ukr.de",
            "name": "Iris M. Heid",
            "typeEntity": "Person"
        },
        {
            "email": "thomas.winkler@ukr.de",
            "name": "Thomas W. Winkler",
            "typeEntity": "Person"
        }
    ],
    "description": "User-friendly web application to help prioritize kidney function genes and variants based on evidence from genome-wide association studies.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Collapsing methods",
                    "uri": "http://edamontology.org/operation_3791"
                },
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "homepage": "https://kidneygps.ur.de/gps/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-03-18T14:41:54.316006Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/kjstanzick/KidneyGPS"
        }
    ],
    "name": "KidneyGPS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05472-0",
            "metadata": {
                "abstract": "Background: Genome-wide association studies (GWAS) have identified hundreds of genetic loci associated with kidney function. By combining these findings with post-GWAS information (e.g., statistical fine-mapping to identify independent association signals and to narrow down signals to causal variants; or different sources of annotation data), new hypotheses regarding physiology and disease aetiology can be obtained. These hypotheses need to be tested in laboratory experiments, for example, to identify new therapeutic targets. For this purpose, the evidence obtained from GWAS and post-GWAS analyses must be processed and presented in a way that they are easily accessible to kidney researchers without specific GWAS expertise. Main: Here we present KidneyGPS, a user-friendly web-application that combines genetic variant association for estimated glomerular filtration rate (eGFR) from the Chronic Kidney Disease Genetics consortium with annotation of (i) genetic variants with functional or regulatory effects (“SNP-to-gene” mapping), (ii) genes with kidney phenotypes in mice or human (“gene-to-phenotype”), and (iii) drugability of genes (to support re-purposing). KidneyGPS adopts a comprehensive approach summarizing evidence for all 5906 genes in the 424 GWAS loci for eGFR identified previously and the 35,885 variants in the 99% credible sets of 594 independent signals. KidneyGPS enables user-friendly access to the abundance of information by search functions for genes, variants, and regions. KidneyGPS also provides a function (“GPS tab”) to generate lists of genes with specific characteristics thus enabling customizable Gene Prioritisation (GPS). These specific characteristics can be as broad as any gene in the 424 loci with a known kidney phenotype in mice or human; or they can be highly focussed on genes mapping to genetic variants or signals with particularly with high statistical support. KidneyGPS is implemented with RShiny in a modularized fashion to facilitate update of input data (https://kidneygps.ur.de/gps/). Conclusion: With the focus on kidney function related evidence, KidneyGPS fills a gap between large general platforms for accessing GWAS and post-GWAS results and the specific needs of the kidney research community. This makes KidneyGPS an important platform for kidney researchers to help translate in silico research results into in vitro or in vivo research.",
                "authors": [
                    {
                        "name": "Gorski M."
                    },
                    {
                        "name": "Heid I.M."
                    },
                    {
                        "name": "Kronenberg F."
                    },
                    {
                        "name": "Kruger R."
                    },
                    {
                        "name": "Schodel J."
                    },
                    {
                        "name": "Stanzick K.J."
                    },
                    {
                        "name": "Stark K.J."
                    },
                    {
                        "name": "Warth R."
                    },
                    {
                        "name": "Winkler T.W."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "KidneyGPS: a user-friendly web application to help prioritize kidney function genes and variants based on evidence from genome-wide association studies"
            },
            "pmcid": "PMC10512588",
            "pmid": "37735349"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Urology and nephrology",
            "uri": "http://edamontology.org/topic_3422"
        }
    ]
}
