{
    "additionDate": "2023-02-08T14:25:13.210188Z",
    "biotoolsCURIE": "biotools:iprom_phage",
    "biotoolsID": "iprom_phage",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hilaltayara@jbnu.ac.kr",
            "name": "Hilal Tayara",
            "typeEntity": "Person"
        },
        {
            "email": "kitchong@jbnu.ac.kr",
            "name": "Kil To Chong",
            "typeEntity": "Person"
        }
    ],
    "description": "A two-layer model to identify phage promoters and their types using a convolutional neural network.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome annotation",
                    "uri": "http://edamontology.org/operation_0362"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "http://nsclbio.jbnu.ac.kr/tools/iProm-phage/",
    "lastUpdate": "2024-11-24T14:58:58.650678Z",
    "license": "Other",
    "name": "iProm-phage",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3389/fmicb.2022.1061122",
            "metadata": {
                "abstract": "The increased interest in phages as antibacterial agents has resulted in a rise in the number of sequenced phage genomes, necessitating the development of user-friendly bioinformatics tools for genome annotation. A promoter is a DNA sequence that is used in the annotation of phage genomes. In this study we proposed a two layer model called “iProm-phage” for the prediction and classification of phage promoters. Model first layer identify query sequence as promoter or non-promoter and if the query sequence is predicted as promoter then model second layer classify it as phage or host promoter. Furthermore, rather than using non-coding regions of the genome as a negative set, we created a more challenging negative dataset using promoter sequences. The presented approach improves discrimination while decreasing the frequency of erroneous positive predictions. For feature selection, we investigated 10 distinct feature encoding approaches and utilized them with several machine-learning algorithms and a 1-D convolutional neural network model. We discovered that the one-hot encoding approach and the CNN model outperformed based on performance metrics. Based on the results of the 5-fold cross validation, the proposed predictor has a high potential. Furthermore, to make it easier for other experimental scientists to obtain the results they require, we set up a freely accessible and user-friendly web server at http://nsclbio.jbnu.ac.kr/tools/iProm-phage/.",
                "authors": [
                    {
                        "name": "Chong K.T."
                    },
                    {
                        "name": "Jin J.S."
                    },
                    {
                        "name": "Shujaat M."
                    },
                    {
                        "name": "Tayara H."
                    }
                ],
                "citationCount": 6,
                "date": "2022-11-04T00:00:00Z",
                "journal": "Frontiers in Microbiology",
                "title": "iProm-phage: A two-layer model to identify phage promoters and their types using a convolutional neural network"
            },
            "pmcid": "PMC9672459",
            "pmid": "36406389"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
