{"credit":[{"name":"Rodrigo Cánovas","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://users.dcc.uchile.cl/~rcanovas/"}],"documentation":[{"type":"GENERAL","url":"https://github.com/rcanovas/libCSAM/blob/master/README.md"}],"function":[{"operation":[{"term":"Data handling","uri":"http://edamontology.org/operation_2409"},{"term":"Formatting","uri":"http://edamontology.org/operation_0335"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Data governance","uri":"http://edamontology.org/topic_3571"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/libcsam-lossy-compression-of-quality-scores-in-genomic-data.html"}],"publication":[{"abstract":"Motivation: Next-generation sequencing technologies are revolutionizing medicine. Data from sequencing technologies are typically represented as a string of bases, an associated sequence of per-base quality scores and other metadata, and in aggregate can require a large amount of space. The quality scores show how accurate the bases are with respect to the sequencing process, that is, how confident the sequencer is of having called them correctly, and are the largest component in datasets in which they are retained. Previous research has examined how to store sequences of bases effectively; here we add to that knowledge by examining methods for compressing quality scores. The quality values originate in a continuous domain, and so if a fidelity criterion is introduced, it is possible to introduce flexibility in the way these values are represented, allowing lossy compression over the quality score data. Results: We present existing compression options for quality score data, and then introduce two new lossy techniques. Experiments measuring the trade-off between compression ratio and information loss are reported, including quantifying the effect of lossy representations on a downstream application that carries out single nucleotide polymorphism and insert/deletion detection. The new methods are demonstrably superior to other techniques when assessed against the spectrum of possible trade-offs between storage required and fidelity of representation. Availability and implementation: An implementation of the methods described here is available at https://github.com/rcanovas/libCSAM. © The Author 2014.","authors":["Canovas R.","Moffat A.","Turpin A."],"cit_count":23,"journal":"Bioinformatics","pmid":"24728856","title":"Lossy compression of quality scores in genomic data","year":"2014-08-01"}],"summary":{"biotoolsCURIE":"biotools:libcsam","biotoolsID":"libcsam","description":"Contains several C++ codes for compress, decompress, and access each of the fields of any SAM format file.","homepage":"https://github.com/rcanovas/libCSAM","name":"libCSAM"}}