{
    "additionDate": "2020-01-14T09:08:01Z",
    "biotoolsCURIE": "biotools:NmrLineGuru",
    "biotoolsID": "NmrLineGuru",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "cbp@purdue.edu",
            "name": "Carol Beth Post",
            "typeEntity": "Person"
        }
    ],
    "description": "Standalone and User-Friendly GUIs for Fast 1D NMR Lineshape Simulation and Analysis of Multi-State Equilibrium Binding Models.\n\nRelease Notes for NmrLineGuru: Standalone and User-Friendly GUIs for Fast 1D NMR Lineshape Simulation and Analysis with Multi-State Equilibrium Binding Models.\n\nPlease download, install, and start NmrLineGuru according to the repo page:.\n\nBefore you use NmrLineGuru for your own data or project, please repeat the example simulations/fittings in the tutorials and make sure you can reproduce the example results.\n\nFeng C, Kovrigin EL, Post CB (2019) NmrLineGuru: Standalone and User-Friendly GUIs for Fast 1D NMR Lineshape Simulation and Analysis of Multi-State Equilibrium Binding Models. Scientific Reports 9:16023. [DOI]",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/stonefonly/NmrLineGuru/wiki"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                }
            ]
        }
    ],
    "homepage": "https://github.com/stonefonly/NmrLineGuru",
    "lastUpdate": "2021-01-04T08:33:47Z",
    "name": "NmrLineGuru",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41598-019-52451-8",
            "metadata": {
                "abstract": "© 2019, The Author(s).The ability of high-resolution NMR spectroscopy to readout the response of molecular interactions at multiple atomic sites presents a unique capability to define thermodynamic equilibrium constants and kinetic rate constants for complex, multiple-step biological interactions. Nonetheless, the extraction of the relevant equilibrium binding and rate constants requires the appropriate analysis of not only a readout that follows the equilibrium concentrations of typical binding titration curves, but also the lineshapes of NMR spectra. To best take advantage of NMR data for characterizing molecular interactions, we developed NmrLineGuru, a software tool with a user-friendly graphical user interface (GUI) to model two-state, three-state, and four-state binding processes. Application of NmrLineGuru is through stand-alone GUIs, with no dependency on other software and no scripted input. NMR spectra can be fitted or simulated starting with user-specified input parameters and a chosen kinetic model. The ability to both simulate and fit NMR spectra provides the user the opportunity to not only determine the binding parameters that best reproduce the measured NMR spectra for the selected kinetic model, but to also query the possibility that alternative models agree with the data. NmrLineGuru is shown to provide an accurate, quantitative analysis of complex molecular interactions.",
                "authors": [
                    {
                        "name": "Feng C."
                    },
                    {
                        "name": "Kovrigin E.L."
                    },
                    {
                        "name": "Post C.B."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "NmrLineGuru: Standalone and User-Friendly GUIs for Fast 1D NMR Lineshape Simulation and Analysis of Multi-State Equilibrium Binding Models"
            },
            "pmcid": "PMC6831641",
            "pmid": "31690758"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
