{
    "additionDate": "2021-01-18T07:03:42Z",
    "biotoolsCURIE": "biotools:rxnblast",
    "biotoolsID": "rxnblast",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "qnhu@sibs.ac.cn",
            "name": "Qian-Nan Hu",
            "typeEntity": "Person"
        }
    ],
    "description": "molecular scaffold and reactive chemical environment feature extractor for biochemical reactions.\n\nRxnBLAST as a web-based tool for analyzing scaffold transformations and reactive chemical environment fea-tures in bioreactions. RxnBLAST extracts chemical features from bioreactions including atom–atom mapping, reaction centers, functional groups, and rules to help understand chemical compositions and reaction patterns. Core-to-Core is proposed, which can be utilized in scaffold networks and for constructing a reac-tion space, as well as provide guidance for subsequent biosynthesis efforts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://design.rxnfinder.org/rxnblast/",
    "lastUpdate": "2021-02-10T13:36:05Z",
    "name": "RxnBLAST",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA036",
            "metadata": {
                "abstract": "© 2020 The Author(s). Published by Oxford University Press. All rights reserved.Motivation: Molecular scaffolds are useful in medicinal chemistry to describe, discuss and visualize series of chemical compounds, biochemical transformations and associated biological properties. Results: Here, we present RxnBLAST as a web-based tool for analyzing scaffold transformations and reactive chemical environment features in bioreactions. RxnBLAST extracts chemical features from bioreactions including atom-atom mapping, reaction centers, rules and functional groups to help understand chemical compositions and reaction patterns. Core-to-Core is proposed, which can be utilized in scaffold networks and for constructing a reaction space, as well as providing guidance for subsequent biosynthesis efforts.",
                "authors": [
                    {
                        "name": "Cai P."
                    },
                    {
                        "name": "Cheng X."
                    },
                    {
                        "name": "Ding S."
                    },
                    {
                        "name": "Hu Q.-N."
                    },
                    {
                        "name": "Sun D."
                    },
                    {
                        "name": "Tian Y."
                    },
                    {
                        "name": "Tian Y."
                    },
                    {
                        "name": "Zhang D."
                    }
                ],
                "citationCount": 1,
                "date": "2020-05-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "RxnBLAST: Molecular scaffold and reactive chemical environment feature extractor for biochemical reactions"
            },
            "pmid": "31950996"
        }
    ],
    "topic": [
        {
            "term": "Chemistry",
            "uri": "http://edamontology.org/topic_3314"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}
