{
    "additionDate": "2022-03-25T09:28:08.567834Z",
    "biotoolsCURIE": "biotools:jarvis",
    "biotoolsID": "jarvis",
    "description": "Efficient lossless compression of genomic sequences using a competitive prediction between two different classes of models: weighted stochastic repeat models and weighted context models.",
    "editPermission": {
        "type": "private"
    },
    "elixirNode": [
        "Portugal"
    ],
    "elixirPlatform": [
        "Tools"
    ],
    "homepage": "https://github.com/cobilab/jarvis",
    "language": [
        "C"
    ],
    "lastUpdate": "2022-03-25T09:28:32.835332Z",
    "license": "GPL-3.0",
    "name": "JARVIS",
    "owner": "pratas",
    "publication": [
        {
            "doi": "10.3390/e21111074",
            "metadata": {
                "abstract": "© 2019 by the authors.The development of efficient data compressors for DNA sequences is crucial not only for reducing the storage and the bandwidth for transmission, but also for analysis purposes. In particular, the development of improved compression models directly influences the outcome of anthropological and biomedical compression-based methods. In this paper, we describe a new lossless compressor with improved compression capabilities for DNA sequences representing different domains and kingdoms. The reference-free method uses a competitive prediction model to estimate, for each symbol, the best class of models to be used before applying arithmetic encoding. There are two classes of models: weighted context models (including substitutional tolerant context models) and weighted stochastic repeat models. Both classes of models use specific sub-programs to handle inverted repeats efficiently. The results show that the proposed method attains a higher compression ratio than state-of-the-art approaches, on a balanced and diverse benchmark, using a competitive level of computational resources. An efficient implementation of the method is publicly available, under the GPLv3 license.",
                "authors": [
                    {
                        "name": "Hosseini M."
                    },
                    {
                        "name": "Pinho A.J."
                    },
                    {
                        "name": "Pratas D."
                    },
                    {
                        "name": "Silva J.M."
                    }
                ],
                "citationCount": 3,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Entropy",
                "title": "A reference-free lossless compression algorithm for DNA sequences using a competitive prediction of two classes of weighted models"
            },
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ],
    "version": [
        "1.0"
    ]
}
