{
    "additionDate": "2021-01-18T10:58:31Z",
    "biotoolsCURIE": "biotools:cngbdb",
    "biotoolsID": "cngbdb",
    "confidence_flag": "tool",
    "description": "China National GeneBank DataBase (CNGBdb) is a uniﬁed platform built for biological big data sharing and application services to the research community. Based on the big data and cloud computing technologies, it provides data services such as archive, analysis, knowledge search, management authorization, and visualization.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://db.cngb.org/",
    "lastUpdate": "2021-02-13T19:41:24Z",
    "name": "CNGBdb",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.16288/J.YCZZ.20-080",
            "metadata": {
                "abstract": "国家基因库生命大数据平台(China National GeneBank DataBase, CNGBdb)是一个致力于生命科学多组学数据归档和开放共享的数据库平台,是深圳国家基因库的核心功能“三库两平台”中生物信息数据库的对外服务平台,拥有深圳国家基因库丰富的样本资源、数据资源、合作项目资源和强大的数据计算和分析能力等优势。生命科学研究已经进入到了一个以高通量多组学数据为基础的大数据时代,迫切需要加强国际合作和信息共享。随着中国经济的发展和在生命科学研究领域的研究项目投入力度的加大,需要建立相关的生命大数据归档和共享的平台, 来促进我国生命科学研究项目中生成的基因组学数据的系统管理、开放共享与合理利用。目前,CNGBdb主要提供生命科学研究相关的数据归档、知识搜索、数据管理、数据计算和数据服务等服务。其归档和共享的数据类型,主要包括项目、样本、实验、测序、组装、变异、序列等。截止2020年5月22号, CNGBdb已接受了全球生命科学科研工作者提交的研究项目达2176个,归档的基因组学数据量超过2221 TB。未来,CNGBdb将继续推动生命科学研究多组学数据的开放共享和产业应用,完善基因组学数据的归档和共享功能,提升其服务生命科学数据开放共享的能力。CNGBdb的网址是：https://db.cngb.org/。. China National GeneBank DataBase (CNGBdb) is a data platform aiming to systematically archiving and sharing of multi-omics data in life science. As the service portal of Bio-informatics Data Center of the core structure, namely, \"Three Banks and Two Platforms\" of China National GeneBank (CNGB), CNGBdb has the advantages of rich sample resources, data resources, cooperation projects, powerful data computation and analysis capabilities. With the advent of high throughput sequencing technologies, research in life science has entered the big data era, which is in the need of closer international cooperation and data sharing. With the development of China's economy and the increase of investment in life science research, we need to establish a national public platform for data archiving and sharing in life science to promote the systematic management, application and industrial utilization. Currently, CNGBdb can provide genomic data archiving, information search engines, data management and data analysis services. The data schema of CNGBdb has covered projects, samples, experiments, runs, assemblies, variations and sequences. Until May 22, 2020, CNGBdb has archived 2176 research projects and more than 2221 TB sequencing data submitted by researchers globally. In the future, CNGBdb will continue to be dedicated to promoting data sharing in life science research and improving the service capability. CNGBdb website is: https://db.cngb.org/.",
                "authors": [
                    {
                        "name": "Chen F.Z."
                    },
                    {
                        "name": "Fang L."
                    },
                    {
                        "name": "Gao F."
                    },
                    {
                        "name": "Guo X.Q."
                    },
                    {
                        "name": "Hua C."
                    },
                    {
                        "name": "Shan R.Q."
                    },
                    {
                        "name": "Tan C."
                    },
                    {
                        "name": "Wang B."
                    },
                    {
                        "name": "Wang L.N."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Wei X.F."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Yang F."
                    },
                    {
                        "name": "You L.J."
                    },
                    {
                        "name": "Zeng W.J."
                    }
                ],
                "citationCount": 17,
                "date": "2020-08-20T00:00:00Z",
                "journal": "Yi chuan = Hereditas",
                "title": "CNGBdb: China National GeneBank DataBase"
            },
            "pmid": "32952115"
        }
    ],
    "toolType": [
        "Bioinformatics portal"
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
