{
    "additionDate": "2025-05-22T14:58:20.772120Z",
    "biotoolsCURIE": "biotools:extended_a_priori_probability_tool",
    "biotoolsID": "extended_a_priori_probability_tool",
    "collectionID": [
        "EUCAIM"
    ],
    "description": "The tool provides a semi-supervised metric (EAPP) for binary classification tasks that considers not only the a priori probability but also some possible bias present in the dataset, as well as other features that could provide a relatively trivial separability of the target classes. Therefore, it allows for evaluating the ease or complexity of the task or bias of the data beyond the well-established baseline for any binary classification.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://ieeexplore.ieee.org/document/9950248",
    "lastUpdate": "2025-05-22T14:58:20.774428Z",
    "name": "EAPP - Extended a Priori Probability tool",
    "owner": "dsilveira",
    "publication": [
        {
            "doi": "10.1109/ACCESS.2022.3221936",
            "metadata": {
                "abstract": "The a priori probability of a dataset is usually used as a baseline for comparing a particular algorithm's accuracy in a given binary classification task. ZeroR is the simplest algorithm for this, predicting the majority class for all examples. However, this is an extremely simple approach that has no predictive power and does not describe other dataset features that could lead to a more demanding baseline. In this paper, we present the Extended A Priori Probability (EAPP), a novel semi-supervised baseline metric for binary classification tasks that considers not only the a priori probability but also some possible bias present in the dataset as well as other features that could provide a relatively trivial separability of the target classes. The approach is based on the area under the ROC curve (AUC ROC), known to be quite insensitive to class imbalance. The procedure involves multiobjective feature extraction and a clustering stage in the input space with autoencoders and a subsequent combinatory weighted assignation from clusters to classes depending on the distance to nearest clusters for each class. Class labels are then assigned to establish the combination that maximizes AUC ROC for each number of clusters considered. To avoid overfit in the combined feature extraction and clustering method, a cross-validation scheme is performed in each case. EAPP is defined for different numbers of clusters, starting from the inverse of the minority class proportion, which is useful for a fair comparison among diversely imbalanced datasets. A high EAPP usually relates to an easy binary classification task, but it also may be due to a significant coarse-grained bias in the dataset, when the task is previously known to be difficult. This metric represents a baseline beyond the a priori probability to assess the actual capabilities of binary classification models.",
                "authors": [
                    {
                        "name": "Castello V.O."
                    },
                    {
                        "name": "Catala O.D.T."
                    },
                    {
                        "name": "Igual I.S."
                    },
                    {
                        "name": "Llobet R."
                    },
                    {
                        "name": "Perez-Benito F.J."
                    },
                    {
                        "name": "Perez-Cortes J.-C."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Access",
                "title": "Extended a Priori Probability (EAPP): A Data-Driven Approach for Machine Learning Binary Classification Tasks"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "version": [
        "v1.0.1"
    ]
}
