{
    "name": "MESMER", 
    "description": "Scientific tool designed to identify characteristic structures or components in heterogenous solutions from bulk-average data. It does this by evolving a population of ensembles containing candidate components, selecting only ensembles that fit the available experimental data better than their peers.", 
    "homepage": "https://code.google.com/p/mesmer/", 
    "biotoolsID": "mesmer", 
    "biotoolsCURIE": "biotools:mesmer", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2480", 
                    "term": "Structure analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_1317", 
            "term": "Structural biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_0081", 
            "term": "Structure analysis"
        }
    ], 
    "operatingSystem": [
        "Windows", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mesmer-0-9-0-minimum-ensemble-solutions-to-multiple-experimental-restraints.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://github.com/steelsnowflake/mesmer/blob/master/README.txt", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "25673340", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "MESMER: Minimal ensemble solutions to multiple experimental restraints", 
                "abstract": "© The Author 2015. Published by Oxford University Press. Motivation: Macromolecular structures and interactions are intrinsically heterogeneous, temporally adopting a range of configurations that can confound the analysis of data from bulk experiments. To obtain quantitative insights into heterogeneous systems, an ensemble-based approach can be employed, in which predicted data computed from a collection of models is compared to the observed experimental results. By simultaneously fitting orthogonal structural data (e.g. small-angle X-ray scattering, nuclear magnetic resonance residual dipolar couplings, dipolar electron-electron resonance spectra), the range and population of accessible macromolecule structures can be probed. Results: We have developed MESMER, software that enables the user to identify ensembles that can recapitulate experimental data by refining thousands of component collections selected from an input pool of potential structures. The MESMER suite includes a powerful graphical user interface (GUI) to streamline usage of the command-line tools, calculate data from structure libraries and perform analyses of conformational and structural heterogeneity. To allow for incorporation of other data types, modular Python plugins enable users to compute and fit data from nearly any type of quantitative experimental data. Results: Conformational heterogeneity in three macromolecular systems was analyzed with MESMER, demonstrating the utility of the streamlined, user-friendly software.", 
                "date": "2015-06-15T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Ihms E.C."
                    }, 
                    {
                        "name": "Foster M.P."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Mark P. Foster", 
            "email": null, 
            "url": "https://research.cbc.osu.edu/foster.281/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:49:17Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}