{
    "additionDate": "2021-03-19T08:36:21Z",
    "biotoolsCURIE": "biotools:trvae",
    "biotoolsID": "trvae",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fabian.theis@helmholtz-muenchen.de",
            "name": "Fabian J Theis",
            "typeEntity": "Person"
        },
        {
            "email": "alex.wolf@helmholtz-muenchen.de",
            "name": "F Alexander Wolf",
            "typeEntity": "Person"
        }
    ],
    "description": "Conditional out-of-distribution generation for unpaired data using transfer VAE.\n\nA Keras (tensorflow < 2.0) implementation of trVAE (transfer Variational Autoencoder) .\n\nTrain trVAE with Kang or Haber dataset.\n\nThen you can run each notebook and reproduce the results.\n\nAll datasets are available in this drive directory.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://github.com/theislab/trvae",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-07-07T10:45:56Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "http://github.com/theislab/trvae_reproducibility"
        }
    ],
    "name": "trVAE",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA800",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.comMotivation: While generative models have shown great success in sampling high-dimensional samples conditional on low-dimensional descriptors (stroke thickness in MNIST, hair color in CelebA, speaker identity in WaveNet), their generation out-of-distribution poses fundamental problems due to the difficulty of learning compact joint distribution across conditions. The canonical example of the conditional variational autoencoder (CVAE), for instance, does not explicitly relate conditions during training and, hence, has no explicit incentive of learning such a compact representation. Results: We overcome the limitation of the CVAE by matching distributions across conditions using maximum mean discrepancy in the decoder layer that follows the bottleneck. This introduces a strong regularization both for reconstructing samples within the same condition and for transforming samples across conditions, resulting in much improved generalization. As this amount to solving a style-transfer problem, we refer to the model as transfer VAE (trVAE). Benchmarking trVAE on high-dimensional image and single-cell RNA-seq, we demonstrate higher robustness and higher accuracy than existing approaches. We also show qualitatively improved predictions by tackling previously problematic minority classes and multiple conditions in the context of cellular perturbation response to treatment and disease based on high-dimensional single-cell gene expression data. For generic tasks, we improve Pearson correlations of high-dimensional estimated means and variances with their ground truths from 0.89 to 0.97 and 0.75 to 0.87, respectively. We further demonstrate that trVAE learns cell-type-specific responses after perturbation and improves the prediction of most cell-type-specific genes by 65%.",
                "authors": [
                    {
                        "name": "Lotfollahi M."
                    },
                    {
                        "name": "Naghipourfar M."
                    },
                    {
                        "name": "Theis F.J."
                    },
                    {
                        "name": "Alexander Wolf F."
                    }
                ],
                "citationCount": 4,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Conditional out-of-distribution generation for unpaired data using transfer VAE"
            },
            "pmid": "33381839"
        }
    ],
    "toolType": [
        "Library",
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}