
{
    "credit": [
        {
            "email": "kbli@ym.edu.tw",
            "name": "Kuo-Bin Li",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.bii.a-star.edu.sg/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://mirtif.bii.a-star.edu.sg/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Machine learning",
                "uri": "http://edamontology.org/topic_3474"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            },
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/mirtif-micrornatarget-interaction-filter.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: MicroRNAs (miRNAs) are a set of small non-coding RNAs serving as important negative gene regulators. In animals, miRNAs turn down protein translation by binding to the 3′ UTR regions of target genes with imperfect complementary pairing. The identification of microRNA targets has become one of the major challenges of miRNA research. Bioinformatics investigations on miRNA target have resulted in a number of target prediction tools. Although these tools are capable of predicting hundreds of targets for a given miRNA, many of them suffer from high false positive rates, indicating the need for a post-processing filter for the predicted targets. Once trained with experimentally validated true and false targets, machine learning methods appear to be ideal approaches to distinguish the true targets from the false ones. Results: We present a miRNA target filtering system named MiRTif (miRNA:target interaction filter). The system is a support vector machine (SVM) classifier trained with 195 positive and 38 negative miRNA: target interaction pairs, all experimentally validated. Each miRNA: target interaction pair is divided into a seed and a non-seed region. The encoded feature vector contains various k-gram frequencies in the seed, the non-seed and the entire regions. Informative features are selected based on their discriminating abilities. Prediction accuracies are assessed using 10-fold cross-validation experiments. Our system achieves AUC (area under the ROC curve) of 0.86, sensitivity of 83.59%, and specificity of 73.68%. More importantly, the system correctly predicts majority of the false positive miRNA: target interactions (28 out of 38). The possibility of over-fitting due to the relatively small negative sample set has also been investigated using a set of non-validated and randomly selected targets (from miRBase). Conclusion: MiRTif is designed as a post-processing filter that takes miRNA: target interactions predicted by other target prediction softwares such as TargetScanS, PicTar and miRanda as inputs, and determines how likely the given interaction is a real or a pseudo one. MiRTif can be accessed from http://bsal.ym.edu.tw/mirtif. © 2008 Yang et al; licensee BioMed Central Ltd.",
            "authors": [
                "Yang Y.",
                "Wang Y.-P.",
                "Li K.-B."
            ],
            "cit_count": 49,
            "journal": "BMC Bioinformatics",
            "pmid": "19091027",
            "title": "MiRTif: A support vector machine-based microRNA target interaction filter",
            "year": "2008-12-12"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mirtif",
        "biotoolsID": "mirtif",
        "description": "Machine learning algorithm based on SVM (support vector machine) that serves as a post-processing filter for the miRNA:target duplexes predicted by softwares such as miRanda, PicTar and TargetScanS.",
        "homepage": "http://mirtif.bii.a-star.edu.sg/",
        "name": "MiRTif"
    }
}