{
    "additionDate": "2017-02-10T11:35:40Z",
    "biotoolsCURIE": "biotools:compareprospector",
    "biotoolsID": "compareprospector",
    "credit": [
        {
            "email": "yliu@stanford.edu",
            "name": "Yueyi Irene Liu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Server which attempts to identify any motifs related to genes predicted to share regulatory elements. It alters Gibbs sampling through biasing searches towards conserved sequences across multiple species.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://compareprospector.stanford.edu/overview.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "homepage": "http://compareprospector.stanford.edu/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "CompareProspector",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The identification of regulatory motifs is important for the study of gene expression. Here we present a suite of programs that we have developed to search for regulatory sequence motifs: (i) BioProspector, a Gibbs-sampling-based program for predicting regulatory motifs from co-regulated genes in prokaryotes or lower eukaryotes; (ii) CompareProspector, an extension to BioProspector which incorporates comparative genomics features to be used for higher eukaryotes; (iii) MDscan, a program for finding protein-DNA interaction sites from ChIP-on-chip targets. All three programs examine a group of sequences that may share common regulatory motifs and output a list of putative motifs as position-specific probability matrices, the individual sites used to construct the motifs and the location of each site on the input sequences. The web servers and executables can be accessed at http://seqmotifs.stanford.edu. © Oxford University Press 2004; all rights reserved.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Wei L."
                    },
                    {
                        "name": "Batzoglou S."
                    },
                    {
                        "name": "Brutlag D.L."
                    },
                    {
                        "name": "Liu J.S."
                    },
                    {
                        "name": "Liu X.S."
                    }
                ],
                "citationCount": 30,
                "date": "2004-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "A suite of web-based programs to search for transcriptional regulatory motifs"
            },
            "pmid": "15215381"
        },
        {
            "metadata": {
                "abstract": "Comparative genomics is a promising approach to the challenging problem of eukaryotic regulatory element identification, because functional noncoding sequences may be conserved across species from evolutionary constraints. We systematically analyzed known human and Saccharomyces cerevisiae regulatory elements and discovered that human regulatory elements are more conserved between human and mouse than are background sequences. Although S. cerevisiae regulatory elements do not appear to be more conserved by comparison of S. cerevisiae to Schizosaccharomyces pombe, they are more conserved when compared with multiple other yeast genomes (Saccharomyces paradoxus, Saccharomyces mikatae, and Saccharomyces bayanus). Based on these analyses, we developed a sequence-motif-finding algorithm called CompareProspector, which extends Gibbs sampling by biasing the search in regions conserved across species. Using human-mouse comparison, CompareProspector identified known motifs for transcription factors Mef2, Myf, Srf, and Sp1 from a set of human-muscle-specific genes. It also discovered the NFAT motif from genes up-regulated by CD28 stimulation in T-cells, which implies the direct involvement of NFAT in mediating the CD28 stimulatory signal. Using Caenorhabditis elegans-Caenorhabditis briggsae comparison, CompareProspector found the PHA-4 motif and the UNC-86 motif. CompareProspector outperformed many other computational motif-finding programs, demonstrating the power of comparative genomics-based biased sampling in eukaryotic regulatory element identification. © 2004 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Liu X.S."
                    },
                    {
                        "name": "Wei L."
                    },
                    {
                        "name": "Altman R.B."
                    },
                    {
                        "name": "Batzoglou S."
                    }
                ],
                "citationCount": 108,
                "date": "2004-03-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Eukaryotic regulatory element conservation analysis and identification using comparative genomics"
            },
            "pmid": "14993210"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1
}