{
    "additionDate": "2020-01-14T19:58:29Z",
    "biotoolsCURIE": "biotools:RBPome",
    "biotoolsID": "RBPome",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "roman-ulrich.mueller@uk-koeln.de",
            "name": "Roman-Ulrich Müller",
            "typeEntity": "Person"
        }
    ],
    "description": "Activation of Hypoxia-Inducible Factor Signaling Modulates the RNA Protein Interactome in Caenorhabditis elegans.\n\nThe cellular response to hypoxia is crucial to organismal survival, and hypoxia-inducible factors (HIF) are the key mediators of this response. HIF-signaling is central to many human diseases and mediates longevity in the nematode. Despite the rapidly increasing knowledge on RNA-binding proteins (RBPs), little is known about their contribution to hypoxia-induced cellular adaptation. We used RNA interactome capture (RIC) in wild-type Caenorhabditis elegans and vhl-1 loss-of-function mutants to fill this gap. This approach identifies more than 1,300 nematode RBPs, 270 of which can be considered novel RBPs. Interestingly, loss of vhl-1 modulates the RBPome. This difference is not primarily explained by protein abundance suggesting differential RNA-binding.\n\n||| HOMEPAGE BROKEN!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                }
            ]
        }
    ],
    "homepage": "http://shiny.cecad.uni-koeln.de:3838/celegans_rbpome",
    "lastUpdate": "2020-01-14T19:58:29Z",
    "name": "RBPome",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.ISCI.2019.11.039",
            "metadata": {
                "abstract": "© 2019 The Author(s)Biological Sciences; Molecular Biology; Molecular Interaction; Molecular Network; Integrative Aspects of Cell Biology; Proteomics © 2019 The Author(s)The cellular response to hypoxia is crucial to organismal survival, and hypoxia-inducible factors (HIF) are the key mediators of this response. HIF-signaling is central to many human diseases and mediates longevity in the nematode. Despite the rapidly increasing knowledge on RNA-binding proteins (RBPs), little is known about their contribution to hypoxia-induced cellular adaptation. We used RNA interactome capture (RIC) in wild-type Caenorhabditis elegans and vhl-1 loss-of-function mutants to fill this gap. This approach identifies more than 1,300 nematode RBPs, 270 of which can be considered novel RBPs. Interestingly, loss of vhl-1 modulates the RBPome. This difference is not primarily explained by protein abundance suggesting differential RNA-binding. Taken together, our study provides a global view on the nematode RBPome and proteome as well as their modulation by HIF-signaling. The resulting RBP atlas is also provided as an interactive online data mining tool (http://shiny.cecad.uni-koeln.de:3838/celegans_rbpome).",
                "authors": [
                    {
                        "name": "Esmaillie R."
                    },
                    {
                        "name": "Ignarski M."
                    },
                    {
                        "name": "Bohl K."
                    },
                    {
                        "name": "Kruger T."
                    },
                    {
                        "name": "Ahmad D."
                    },
                    {
                        "name": "Seufert L."
                    },
                    {
                        "name": "Schermer B."
                    },
                    {
                        "name": "Benzing T."
                    },
                    {
                        "name": "Muller R.-U."
                    },
                    {
                        "name": "Fabretti F."
                    }
                ],
                "date": "2019-12-20T00:00:00Z",
                "journal": "iScience",
                "title": "Activation of Hypoxia-Inducible Factor Signaling Modulates the RNA Protein Interactome in Caenorhabditis elegans"
            },
            "pmcid": "PMC6926210",
            "pmid": "31835171"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}