{
    "additionDate": "2018-10-03T18:31:41Z",
    "biotoolsCURIE": "biotools:viromescan",
    "biotoolsID": "viromescan",
    "credit": [
        {
            "email": "simone.rampelli@unibo.it",
            "name": "Simone Rampelli",
            "orcidid": "http://orcid.org/0000-0002-5655-6695",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ViromeScan is a metagenomic analysis tool that characterizes the taxonomy of the virome directly from raw data of next-generation sequencing.",
    "documentation": [
        {
            "note": "\"Readme.txt\" file can be viewed in the link or downloaded.",
            "type": [
                "Other"
            ],
            "url": "https://sourceforge.net/projects/viromescan/files/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://sourceforge.net/projects/viromescan/",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2019-01-13T00:52:45Z",
    "license": "BSD-2-Clause-FreeBSD",
    "name": "ViromeScan",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12864-016-2446-3",
            "metadata": {
                "abstract": "© 2016 Rampelli et al.Background: Bioinformatics tools available for metagenomic sequencing analysis are principally devoted to the identification of microorganisms populating an ecological niche, but they usually do not consider viruses. Only some software have been designed to profile the viral sequences, however they are not efficient in the characterization of viruses in the context of complex communities, like the intestinal microbiota, containing bacteria, archeabacteria, eukaryotic microorganisms and viruses. In any case, a comprehensive description of the host-microbiota interactions can not ignore the profile of eukaryotic viruses within the virome, as viruses are definitely critical for the regulation of the host immunophenotype. Results: ViromeScan is an innovative metagenomic analysis tool that characterizes the taxonomy of the virome directly from raw data of next-generation sequencing. The tool uses hierarchical databases for eukaryotic viruses to unambiguously assign reads to viral species more accurately and >1000 fold faster than other existing approaches. We validated ViromeScan on synthetic microbial communities and applied it on metagenomic samples of the Human Microbiome Project, providing a sensitive eukaryotic virome profiling of different human body sites. Conclusions: ViromeScan allows the user to explore and taxonomically characterize the virome from metagenomic reads, efficiently denoising samples from reads of other microorganisms. This implies that users can fully characterize the microbiome, including bacteria and viruses, by shotgun metagenomic sequencing followed by different bioinformatic pipelines.",
                "authors": [
                    {
                        "name": "Rampelli S."
                    },
                    {
                        "name": "Soverini M."
                    },
                    {
                        "name": "Turroni S."
                    },
                    {
                        "name": "Quercia S."
                    },
                    {
                        "name": "Biagi E."
                    },
                    {
                        "name": "Brigidi P."
                    },
                    {
                        "name": "Candela M."
                    }
                ],
                "citationCount": 58,
                "date": "2016-03-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "ViromeScan: A new tool for metagenomic viral community profiling"
            },
            "pmcid": "PMC4774116",
            "pmid": "26932765",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Virology",
            "uri": "http://edamontology.org/topic_0781"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        }
    ],
    "validated": 1
}