{
    "additionDate": "2021-01-18T10:34:08Z",
    "biotoolsCURIE": "biotools:wingmesh",
    "biotoolsID": "wingmesh",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "eshghi.shahab@gmail.com",
            "name": "Shahab Eshghi",
            "orcidid": "https://orcid.org/0000-0002-6224-6634",
            "typeEntity": "Person"
        }
    ],
    "description": "A Matlab-Based Application for Finite Element Modeling of Insect Wings.\n\nManual modeling of complicated insect wings presents considerable practical challenges. To overcome these challenges, therefore, we developed WingMesh. This is an application for simple yet precise automatic modeling of insect wings. Using a series of examples, we showed the performance of our application in practice. We expect WingMesh to be particularly useful in comparative studies, especially where the modeling of a large number of insect wings is required within a short time.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://wingquest.org/wingmesh/",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-18T09:40:38Z",
    "name": "WingMesh",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3390/INSECTS11080546",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.The finite element (FE) method is one of the most widely used numerical techniques for the simulation of the mechanical behavior of engineering and biological objects. Although very efficient, the use of the FE method relies on the development of accurate models of the objects under consideration. The development of detailed FE models of often complex-shaped objects, however, can be a time-consuming and error-prone procedure in practice. Hence, many researchers aim to reach a compromise between the simplicity and accuracy of their developed models. In this study, we adapted Distmesh2D, a popular meshing tool, to develop a powerful application for the modeling of geometrically complex objects, such as insect wings. The use of the burning algorithm (BA) in digital image processing (DIP) enabled our method to automatically detect an arbitrary domain and its subdomains in a given image. This algorithm, in combination with the mesh generator Distmesh2D, was used to develop detailed FE models of both planar and out-of-plane (i.e., three-dimensionally corrugated) domains containing discontinuities and consisting of numerous subdomains. To easily implement the method, we developed an application using the Matlab App Designer. This application, called WingMesh, was particularly designed and applied for rapid numerical modeling of complicated insect wings but is also applicable for modeling purposes in the earth, engineering, mathematical, and physical sciences.",
                "authors": [
                    {
                        "name": "Eshghi S."
                    },
                    {
                        "name": "Nooraeefar V."
                    },
                    {
                        "name": "Darvizeh A."
                    },
                    {
                        "name": "Gorb S.N."
                    },
                    {
                        "name": "Rajabi H."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "Insects",
                "title": "Wingmesh: A matlab-based application for finite element modeling of insect wings"
            },
            "pmcid": "PMC7469191",
            "pmid": "32824828"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Pure mathematics",
            "uri": "http://edamontology.org/topic_3570"
        }
    ]
}