
{
    "credit": [
        {
            "email": "ferref@bc.edu",
            "name": "Fabrizio Ferrè",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://clavius.bc.edu/~ferre/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioinformatics.bc.edu/clotelab/BTW/BTW-instructions.html"
        },
        {
            "type": "General",
            "url": "http://bioinformatics.bc.edu/clotelab/BTW/BTW-help.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression comparison",
                    "uri": "http://edamontology.org/operation_0315"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Dynamic time warping (DTW) is a well-known quadratic time algorithm to determine the smallest distance and optimal alignment between two numerical sequences, possibly of different length. Originally developed for speech recognition, this method has been used in data mining, medicine and bioinformatics. For gene expression time series data, time warping distance is arguably a more flexible tool to determine genes having similar temporal expression, hence possibly related biological function, than either Euclidean distance or correlation coefficient - especially since time warping accommodates sequences of different length. The BTW web server allows a user to upload two tab-separated text files A,B of gene expression data, each possibly having a different number of time intervals of different durations. BTW then computes time warping distance between each gene of A with each gene of B, using a recently developed symmetric algorithm which additionally computes the Boltzmann partition function and outputs Boltzmann pair probabilities. The Boltzmann pair probabilities, not available with any other existent software, suggest possible biological significance of certain positions in an optimal time warping alignment. © The Author 2006. Published by Oxford University Press. All rights reserved.",
            "authors": [
                "Ferre F.",
                "Clote P."
            ],
            "cit_count": 3,
            "journal": "Nucleic Acids Research",
            "pmid": "16845055",
            "title": "BTW: A web server for Boltzmann time warping of gene expression time series",
            "year": "2006-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:btw",
        "biotoolsID": "btw",
        "description": "Boltzmann Time Warping (BTW) computes time warping distances and Boltzmann' pair probabilities for a  given input gene expression time series.  This tool helps to identify genes that may share similar expression patterns over time.",
        "homepage": "http://bioinformatics.bc.edu/clotelab/BTW/",
        "name": "BTW"
    }
}