
{
    "credit": [
        {
            "email": "wyeth@cmmt.ubc.ca",
            "name": "Wyeth W Wasserman",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.cisreg.ca/gsb/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "Gene functional annotation",
                    "uri": "http://edamontology.org/operation_3672"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Database management",
                "uri": "http://edamontology.org/topic_3489"
            },
            {
                "term": "Gene transcripts",
                "uri": "http://edamontology.org/topic_3512"
            },
            {
                "term": "Human biology",
                "uri": "http://edamontology.org/topic_2815"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Background: In bioinformatics and genomics, there are many applications designed to investigate the common properties for a set of genes. Often, these multi-gene analysis tools attempt to reveal sequential, functional, and expressional ties. However, while tremendous effort has been invested in developing tools that can analyze a set of genes, minimal effort has been invested in developing tools that can help researchers compile, store, and annotate gene sets in the first place. As a result, the process of making or accessing a set often involves tedious and time consuming steps such as finding identifiers for each individual gene. These steps are often repeated extensively to shift from one identifier type to another or to recreate a published set. In this paper, we present a simple online tool which - with the help of the gene catalogs Ensembl and GeneLynx - can help researchers build and annotate sets of genes quickly and easily. Description: The Gene Set Builder is a database-driven, web-based tool designed to help researchers compile, store, export, and share sets of genes. This application supports the 17 eukaryotic genomes found in version 32 of the Ensembl database, which includes species from yeast to human. User-created information such as sets and customized annotations are stored to facilitate easy access. Gene sets stored in the system can be \"exported\" in a variety of output formats - as lists of identifiers, in tables, or as sequences. In addition, gene sets can be \"shared\" with specific users to facilitate collaborations or fully released to provide access to published results. The application also features a Perl API (Application Programming Interface) for direct connectivity to custom analysis tools. A downloadable Quick Reference guide and an online tutorial are available to help new users learn its functionalities. Conclusions: The Gene Set Builder is an EnsemblF-facilitated online tool designed to help researchers compile and manage sets of genes in a user-friendly environment. The application can be accessed via http:// www.cisreg.ca/gsb/. © 2005 Yusuf et al., licensee BioMed Central Ltd.",
            "authors": [
                "Yusuf D.",
                "Lim J.S.",
                "Wasserman W.W."
            ],
            "cit_count": 2,
            "journal": "BMC Bioinformatics",
            "pmid": "16371163",
            "title": "The Gene Set Builder: Collation, curation, and distribution of sets of genes",
            "year": "2005-12-21"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gene_set_builder",
        "biotoolsID": "gene_set_builder",
        "description": "Database-driven, web-based tool designed to help researchers compile, store, export, and share sets of genes. This application supports the 17 eukaryotic genomes found in version 32 of the Ensembl database, which includes species from yeast to human. User-created information such as sets and customized annotations are stored and can be shared to facilitate easy access.",
        "homepage": "http://www.cisreg.ca/gsb/",
        "name": "Gene Set Builder"
    }
}