{
    "additionDate": "2021-03-19T09:17:54Z",
    "biotoolsCURIE": "biotools:blvector",
    "biotoolsID": "blvector",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "galvez@uma.es",
            "name": "Sergio Gálvez",
            "typeEntity": "Person"
        }
    ],
    "description": "BLVector is a fast BLAST-Like Aagorithm for multicore CPU with vectorization.  BLVector produces a list in a similar way than BLAST. BLVector provides a score based on the result of a Smith-Waterman algorithm with affine gaps which is the result of applying a score matrix like BLOSUM62 or PAM30.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                },
                {
                    "term": "Pairwise sequence alignment",
                    "uri": "http://edamontology.org/operation_0491"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://github.com/galvezuma/BLVector",
    "language": [
        "C"
    ],
    "lastUpdate": "2021-03-19T18:56:32Z",
    "license": "AGPL-3.0",
    "name": "BLVector",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2021.618659",
            "metadata": {
                "abstract": "© Copyright © 2021 Gálvez, Agostini, Caselli, Hernandez and Dorado.New High-Performance Computing architectures have been recently developed for commercial central processing unit (CPU). Yet, that has not improved the execution time of widely used bioinformatics applications, like BLAST+. This is due to a lack of optimization between the bases of the existing algorithms and the internals of the hardware that allows taking full advantage of the available CPU cores. To optimize the new architectures, algorithms must be revised and redesigned; usually rewritten from scratch. BLVector adapts the high-level concepts of BLAST+ to the x86 architectures with AVX-512, to harness their capabilities. A deep comprehensive study has been carried out to optimize the approach, with a significant reduction in time execution. BLVector reduces the execution time of BLAST+ when aligning up to mid-size protein sequences (∼750 amino acids). The gain in real scenario cases is 3.2-fold. When applied to longer proteins, BLVector consumes more time than BLAST+, but retrieves a much larger set of results. BLVector and BLAST+ are fine-tuned heuristics. Therefore, the relevant results returned by both are the same, although they behave differently specially when performing alignments with low scores. Hence, they can be considered complementary bioinformatics tools.",
                "authors": [
                    {
                        "name": "Galvez S."
                    },
                    {
                        "name": "Agostini F."
                    },
                    {
                        "name": "Caselli J."
                    },
                    {
                        "name": "Hernandez P."
                    },
                    {
                        "name": "Dorado G."
                    }
                ],
                "date": "2021-02-02T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "BLVector: Fast BLAST-Like Algorithm for Manycore CPU With Vectorization"
            },
            "pmcid": "PMC7884812",
            "pmid": "33603776"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ]
}