{"credit":[],"function":[{"operation":[{"term":"Metabolic network modelling","uri":"http://edamontology.org/operation_3660"},{"term":"Metabolic labeling","uri":"http://edamontology.org/operation_3715"},{"term":"Visualisation","uri":"http://edamontology.org/operation_0337"},{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"},{"term":"Pathway or network visualisation","uri":"http://edamontology.org/operation_3083"}]}],"labels":{"toolType":["Web application"],"topic":[{"term":"Endocrinology and metabolism","uri":"http://edamontology.org/topic_3407"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Pharmacokinetics and pharmacodynamics","uri":"http://edamontology.org/topic_3375"},{"term":"Protein interactions","uri":"http://edamontology.org/topic_0128"}]},"publication":[{"abstract":"The metabolic SearcH And Reconstruction Kit (metaSHARK) is a new fully automated software package for the detection of enzyme-encoding genes within unannotated genome data and their visualization in the context of the surrounding metabolic network. The gene detection package (SHARKhunt) runs on a Linux system and requires only a set of raw DNA sequences (genomic, expressed sequence tag and/or genome survey sequence) as input. Its output may be uploaded to our web-based visualization tool (SHARKview) for exploring and comparing data from different organisms. We first demonstrate the utility of the software by comparing its results for the raw Plasmodium falciparum genome with the manual annotations available at the PlasmoDB and PlasmoCyc websites. We then apply SHARKhunt to the unannotated genome sequences of the coccidian parasite Eimeria tenella and observe that, at an E-value cut-off of 10-20, our software makes 142 additional assertions of enzymatic function compared with a recent annotation package working with translated open reading frame sequences. The ability of the software to cope with low levels of sequence coverage is investigated by analyzing assemblies of the E.tenella genome at estimated coverages from 0.5× to 7.5×. Lastly, as an example of how metaSHARK can be used to evaluate the genomic evidence for specific metabolic pathways, we present a study of coenzyme A biosynthesis in P.falciparum and E.tenella. © The Author 2005. Published by Oxford University Press. All rights reserved.","authors":["Pinney J.W.","Shirley M.W.","McConkey G.A.","Westhead D.R."],"cit_count":80,"journal":"Nucleic Acids Research","pmid":"15745999","title":"metaSHARK: Software for automated metabolic network prediction from DNA sequence and its application to the genomes of Plasmodium falciparum and Eimeria tenella","year":"2005-10-21"},{"abstract":"The metaSHARK (metabolic search and reconstruction kit) web server offers users an intuitive, fully interactive way to explore the KEGG metabolic network via a WWW browser. Metabolic reconstruction information for specific organisms, produced by our automated SHARKhunt tool or from other programs or genome annotations, may be uploaded to the website and overlaid on the generic network. Additional data from gene expression experiments can also be incorporated, allowing the visualization of differential gene expression in the context of the predicted metabolic network. metaSHARK is available at http://bioinformatics.leeds.ac.uk/shark/. © The Author 2006. Published by Oxford University Press. All rights reserved.","authors":["Hyland C.","Pinney J.W.","McConkey G.A.","Westhead D.R."],"cit_count":14,"journal":"Nucleic Acids Research","pmid":"16845107","title":"metaSHARK: A WWW platform for interactive exploration of metabolic networks","year":"2006-07-01"}],"summary":{"biotoolsCURIE":"biotools:metashark","biotoolsID":"metashark","description":"Interactive visualisation platform for the KEGG metabolic network in the form of the SHARKview applet.","homepage":"http://bioinformatics.leeds.ac.uk/shark/","name":"metaSHARK"}}