{
    "additionDate": "2018-05-22T23:12:56Z",
    "biotoolsCURIE": "biotools:tuberq",
    "biotoolsID": "tuberq",
    "credit": [
        {
            "email": "info@proteinq.com.ar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Mycobacterium tuberculosis protein druggability database",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "http://tuberq.proteinq.com.ar/bioflux/information/UsageExample.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://tuberq.proteinq.com.ar/",
    "lastUpdate": "2018-12-10T12:58:58Z",
    "name": "TuberQ",
    "owner": "aotamendi.1",
    "publication": [
        {
            "doi": "10.1093/database/bau035",
            "metadata": {
                "abstract": "© The Author(s) 2014.In 2012 an estimated 8.6 million people developed tuberculosis (TB) and 1.3 million died from the disease [including 320 000 deaths among human immunodeficiency virus (HIV)-positive people]. There is an urgent need for new anti-TB drugs owing to the following: the fact that current treatments have severe side effects, the increasing emergence of multi-drug-resistant strains of Mycobacterium tuberculosis (Mtb), the negative drug-drug interactions with certain HIV (or other disease) treatments and the ineffectiveness against dormant Mtb. In this context we present here the TuberQ database, a novel resource for all researchers working in the field of drug development in TB. The main feature of TuberQ is to provide a druggability analysis of Mtb proteins in a consistent and effective manner, contributing to a better selection of potential drug targets for screening campaigns and the analysis of targets for structure-based drug design projects. The structural druggability analysis is combined with features related to the characteristics of putative inhibitor binding pockets and with functional and biological data of proteins. The structural analysis is performed on all available unique Mtb structures and high-quality structural homology-based models. This information is shown in an interactive manner, depicting the protein structure, the pockets and the associated characteristics for each protein. TuberQ also provides information about gene essentiality information, as determined from whole cell-based knockout experiments, and expression information obtained from microarray experiments done in different stress-related conditions. We hope that TuberQ will be a powerful tool for researchers working in TB and eventually will lead to the identification of novel putative targets and progresses in therapeutic activities.",
                "authors": [
                    {
                        "name": "Radusky L."
                    },
                    {
                        "name": "Defelipe L.A."
                    },
                    {
                        "name": "Lanzarotti E."
                    },
                    {
                        "name": "Luque J."
                    },
                    {
                        "name": "Barril X."
                    },
                    {
                        "name": "Marti M.A."
                    },
                    {
                        "name": "Turjanski A.G."
                    }
                ],
                "citationCount": 25,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Database",
                "title": "TuberQ: A Mycobacterium tuberculosis protein druggability database"
            },
            "pmcid": "PMC4014675",
            "pmid": "24816183"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Medicinal chemistry",
            "uri": "http://edamontology.org/topic_0209"
        }
    ],
    "validated": 1,
    "version": [
        "1.4.3"
    ]
}