
{
    "credit": [
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Scatter plot plotting",
                    "uri": "http://edamontology.org/operation_2940"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "MATLAB"
        ],
        "license": "GPL-3.0",
        "topic": [
            {
                "term": "Microbial ecology",
                "uri": "http://edamontology.org/topic_3697"
            },
            {
                "term": "Metabolomics",
                "uri": "http://edamontology.org/topic_3172"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Physiology",
                "uri": "http://edamontology.org/topic_3300"
            },
            {
                "term": "Small molecules",
                "uri": "http://edamontology.org/topic_0154"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019 American Chemical Society.Accumulating evidence points to the strong and complicated associations between the metabolome and the microbiome, which play diverse roles in physiology and pathology. Various correlation analysis approaches were applied to identify microbe-metabolite associations. Given the strengths and weaknesses of the existing methods and considering the characteristics of different types of omics data, we designed a special strategy, called Generalized coRrelation analysis for Metabolome and Microbiome (GRaMM), for the intercorrelation discovery between the metabolome and microbiome. GRaMM can properly deal with two types of omics data, the effect of confounders, and both linear and nonlinear correlations by integrating several complementary methods such as the classical linear regression, the emerging maximum information coefficient (MIC), the metabolic confounding effect elimination (MCEE), and the centered log-ratio transformation (CLR). GRaMM contains four sequential computational steps: (1) metabolic and microbial data preprocessing, (2) linear/nonlinear type identification, (3) data correction and correlation detection, and (4) p value correction. The performances of GRaMM, including the accuracy, sensitivity, specificity, false positive rate, applicability, and effects of preprocessing and confounder adjustment steps, were evaluated and compared with three other methods in multiple simulated and real-world datasets. To our knowledge, GRaMM is the first strategy designed for the intercorrelation analysis between metabolites and microbes. The Matlab function and an R package were developed and are freely available for academic use (comply with GNU GPL.V3 license).",
            "authors": [
                "Liang D.",
                "Li M.",
                "Wei R.",
                "Wang J.",
                "Li Y.",
                "Jia W.",
                "Chen T."
            ],
            "cit_count": 0,
            "doi": "10.1021/ACS.ANALCHEM.9B02948",
            "journal": "Analytical Chemistry",
            "pmid": "31638380",
            "title": "Strategy for Intercorrelation Identification between Metabolome and Microbiome",
            "year": "2019-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:GRaMM",
        "biotoolsID": "GRaMM",
        "description": "Strategy for Intercorrelation Identification between Metabolome and Microbiome.\n\nAccumulating evidence points to the strong and complicated associations between the metabolome and the microbiome, which play diverse roles in physiology and pathology. Various correlation analysis approaches were applied to identify microbe-metabolite associations. Given the strengths and weaknesses of the existing methods and considering the characteristics of different types of omics data, we designed a special strategy, called Generalized coRrelation analysis for Metabolome and Microbiome (GRaMM), for the intercorrelation discovery between the metabolome and microbiome.\n\n||| HOMEPAGE MISSING!",
        "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31638380",
        "name": "GRaMM"
    }
}