{
    "additionDate": "2021-01-18T11:17:31Z",
    "biotoolsCURIE": "biotools:circ2go",
    "biotoolsID": "circ2go",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "s.diederichs@dkfz.de",
            "name": "Sven Diederichs",
            "orcidid": "https://orcid.org/0000-0001-7901-4752",
            "typeEntity": "Person"
        }
    ],
    "description": "circ2GO is a comprehensive database compiling and analyzing circular RNAs found in lung cancer cell lines providing the data in tables as well as visualizing it in transcript maps and in heatmaps. Importantly, we also provide easy-to-use online tools to find circular forms of genes associated with specific molecular functions, biological processes or cellular components or predict their targeted microRNAs. This resource will enable researchers to rapidly identify circular RNAs relevant for their specific research question.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Binding site prediction",
                    "uri": "http://edamontology.org/operation_2575"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "https://circ2GO.dkfz.de",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T18:36:35Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/airbox11/circ2GO"
        }
    ],
    "name": "circ2GO",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/CANCERS12102975",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Circular RNAs (circRNAs) play critical roles in a broad spectrum of physiological and pathological processes, including cancer. Here, we provide a comprehensive database-circ2GO- systematically linking circRNAs to the functions and processes of their linear counterparts. circ2GO contains 148, 811 circular human RNAs originating from 12, 251 genes, which we derived from deep transcriptomics after rRNA depletion in a panel of 60 lung cancer and non-transformed cell lines. The broad circRNA expression dataset is mapped to all isoforms of the respective gene. The data are visualized in transcript maps and in heatmaps, to intuitively display a comprehensive portrait for the abundance of circRNAs across transcripts and cell lines. By integrating gene ontology (GO) information for all genes in our dataset, circ2GO builds a connection between circRNAs and their host genes’ biological functions and molecular mechanisms. Additionally, circ2GO offers target predictions for circRNA-microRNA (miRNA) pairs for 25, 166 highly abundant circRNAs from 6578 genes and 897 high-confidence human miRNAs. Visualization, user-friendliness, intuitive and advanced forward and reverse search options, batch processing and download options make circ2GO a comprehensive source for circRNA information to build hypotheses on their function, processes, and miRNA targets.",
                "authors": [
                    {
                        "name": "Lyu Y."
                    },
                    {
                        "name": "Caudron-Herger M."
                    },
                    {
                        "name": "Diederichs S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-10-01T00:00:00Z",
                "journal": "Cancers",
                "title": "circ2GO: A database linking circular RNAs to gene function"
            },
            "pmcid": "PMC7602184",
            "pmid": "33066523"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}