{"credit":[{"email":"christophe.beroud@univ-amu.fr","name":"Christophe Beroud","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"david.salgado@univ-amu.fr","name":"David Salgado","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Variant classification","uri":"http://edamontology.org/operation_3225"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"collectionID":["Developed_RD-Connect","RD-Connect","Rare Disease","ELIXIR-FR"],"elixirNode":["France"],"language":["PHP","JavaScript"],"maturity":"Mature","operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Human genetics","uri":"http://edamontology.org/topic_3574"},{"term":"Gene transcripts","uri":"http://edamontology.org/topic_3512"},{"term":"Pathology","uri":"http://edamontology.org/topic_0634"},{"term":"Rare diseases","uri":"http://edamontology.org/topic_3325"},{"term":"Medical informatics","uri":"http://edamontology.org/topic_3063"}]},"publication":[{"abstract":"© 2016 Wiley Periodicals, Inc. Whole-exome sequencing (WES) is increasingly applied to research and clinical diagnosis of human diseases. It typically results in large amounts of genetic variations. Depending on the mode of inheritance, only one or two correspond to pathogenic mutations responsible for the disease and present in affected individuals. Therefore, it is crucial to filter out nonpathogenic variants and limit downstream analysis to a handful of candidate mutations. We have developed a new computational combinatorial system UMD-Predictor (http://umd-predictor.eu) to efficiently annotate cDNA substitutions of all human transcripts for their potential pathogenicity. It combines biochemical properties, impact on splicing signals, localization in protein domains, variation frequency in the global population, and conservation through the BLOSUM62 global substitution matrix and a protein-specific conservation among 100 species. We compared its accuracy with the seven most used and reliable prediction tools, using the largest reference variation datasets including more than 140,000 annotated variations. This system consistently demonstrated a better accuracy, specificity, Matthews correlation coefficient, diagnostic odds ratio, speed, and provided the shortest list of candidate mutations for WES. Webservices allow its implementation in any bioinformatics pipeline for next-generation sequencing analysis. It could benefit to a wide range of users and applications varying from gene discovery to clinical diagnosis. UMD-Predictor is a new bionformatics system to predict the pathogenicity of human genes mutations. It is today the most efficient system and it can be integrated in any NGS analysis pipeline. It will benefit to a wide range of users and applications varying from gene discovery to clinical diagnosis.","authors":["Salgado D.","Desvignes J.-P.","Rai G.","Blanchard A.","Miltgen M.","Pinard A.","Levy N.","Collod-Beroud G.","Beroud C."],"cit_count":46,"doi":"10.1002/humu.22965","journal":"Human Mutation","title":"UMD-Predictor: A High-Throughput Sequencing Compliant System for Pathogenicity Prediction of any Human cDNA Substitution","type":"Primary","year":"2016-05-01"}],"summary":{"biotoolsCURIE":"biotools:umd-predictor","biotoolsID":"umd-predictor","description":"A tool that provides a combinatorial approach to identify potential pathogenic variations, that associates the following data: localization within the protein, conservation, biochemical properties of the mutant and wild-type residues, and the potential impact of the variation on mRNA.","homepage":"http://umd-predictor.eu","name":"UMD-Predictor"}}