{
    "accessibility": "Open access",
    "additionDate": "2019-08-11T10:12:02Z",
    "biotoolsCURIE": "biotools:3DMorph",
    "biotoolsID": "3DMorph",
    "cost": "Free of charge",
    "description": "Script that analyzes microglia morphology from 3D data. Outputs include cell and territorial volume, branch length, and number of branch and end points.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/ElisaYork/3DMorph/blob/master/Script_3DMorph.m"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ElisaYork/3DMorph",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2020-06-16T10:55:24Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/ElisaYork/3DMorph/issues"
        }
    ],
    "maturity": "Mature",
    "name": "3DMorph",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1523/ENEURO.0266-18.2018",
            "metadata": {
                "abstract": "© 2018 York et al.Microglia are dynamic immune cells of the central nervous system, and their morphology is commonly used as a readout of cellular function. However, current morphological analysis techniques rely on either tracing of cells or two-dimensional projection analysis, which are time-consuming, subject to bias, and may ignore important three-dimensional (3D) information. Therefore, we have created 3DMorph, a MATLAB-based script that analyzes microglial morphology from 3D data. The program initially requires input of threshold levels, cell size expectations, and preferred methods of skeletonization. This makes 3DMorph easily scalable and adaptable to different imaging parameters or cell types. After these settings are defined, the program is completely automatic and can batch process files without user input. Output data includes cell volume, territorial volume, branch length, number of endpoints and branch points, and average distance between cells. We show that 3DMorph is accurate compared to manual tracing, with significantly decreased user input time. Importantly, 3DMorph is capable of processing in vivo microglial morphology, as well as other 3D branching cell types, from mouse cranial windows or acute hippocampal slices. Therefore, we present a novel, user-friendly, scalable, and semiautomatic method of analyzing cell morphology in 3 dimensions. This method should improve the accuracy of cell measurements, remove user bias between conditions, increase reproducibility between experimenters and labs, and reduce user input time. We provide this open source code on GitHub so that it is free and accessible to all investigators.",
                "authors": [
                    {
                        "name": "York E.M."
                    },
                    {
                        "name": "Ledue J.M."
                    },
                    {
                        "name": "Bernier L.-P."
                    },
                    {
                        "name": "Macvicar B.A."
                    }
                ],
                "citationCount": 8,
                "date": "2018-11-01T00:00:00Z",
                "journal": "eNeuro",
                "title": "3dmorph automatic analysis of microglial morphology in three dimensions from ex vivo and in vivo imaging"
            },
            "pmcid": "PMC6325541",
            "pmid": "30627639",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ]
}