{
    "name": "HOMA", 
    "description": "Web-based interface that can create homology models of a protein with unknown structure (the target or query protein) based on a homologous protein with known structure (the template protein).", 
    "homepage": "http://www-nmr.cabm.rutgers.edu/HOMA/", 
    "biotoolsID": "homa", 
    "biotoolsCURIE": "biotools:homa", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0477", 
                    "term": "Protein modelling"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web service"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }, 
        {
            "uri": "http://edamontology.org/topic_0078", 
            "term": "Proteins"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/homa-create-homology-models-protein-unknown-structure.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www-nmr.cabm.rutgers.edu/HOMA/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "17640066", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Assessing model accuracy using the homology modeling automatically (HOMA) software", 
                "abstract": "Homology modeling is a powerful technique that greatly increases the value of experimental structure determination by using the structural information of one protein to predict the structures of homologous proteins. We have previously described a method of homology modeling by satisfaction of spatial restraints (Li et al., Protein Sci 1997;6:956-970). The Homology Modeling Automatically (HOMA) web site, 〈http://www-nmr.cabm.rutgers.edu/HOMA〉, is a new tool, using this method to predict 3D structure of a target protein based on the sequence alignment of the target protein to a template protein and the structure coordinates of the template. The user is presented with the resulting models, together with an extensive structure validation report providing critical assessments of the quality of the resulting homology models. The homology modeling method employed by HOMA was assessed and validated using twenty-four groups of homologous proteins. Using HOMA, homology models were generated for 510 proteins, including 264 proteins modeled with correct folds and 246 modeled with incorrect folds. Accuracies of these models were assessed by superimposition on the corresponding experimentally determined structures. A subset of these results was compared with parallel studies of modeling accuracy using several other automated homology modeling approaches. Overall, HOMA provides prediction accuracies similar to other state-of-the-art homology modeling methods. We also provide an evaluation of several structure quality validation tools in assessing the accuracy of homology models generated with HOMA. This study demonstrates that Verify3D (Luthy et al., Nature 1992;356:83-85) and ProsaII (Sippl, Proteins 1993;17:355-362) are most sensitive in distinguishing between homology models with correct or incorrect folds. For homology models that have the correct fold, the steric conformational energy (including primarily the Van der Waals energy), MolProbity clashscore (Word et al., Protein Sci 2000;9:2251-2259), and the PROCHECK G-factors (Laskowski et al., J Biomol NMR 1996;8:477-486) provide sensitive and consistent methods for assessing accuracy and can distinguish between homology models of higher and lower accuracy. As demonstrated in the accompanying paper (Bhattacharya et al., accompanying paper), combinations of these scores for models generated with HOMA provide a basis for distinguishing low from high accuracy models. © 2007 Wiley-Liss, Inc.", 
                "date": "2008-01-01T00:00:00Z", 
                "citationCount": 28, 
                "authors": [
                    {
                        "name": "Bhattacharya A."
                    }, 
                    {
                        "name": "Wunderlich Z."
                    }, 
                    {
                        "name": "Monleon D."
                    }, 
                    {
                        "name": "Tejero R."
                    }, 
                    {
                        "name": "Montelione G.T."
                    }
                ], 
                "journal": "Proteins: Structure, Function and Genetics"
            }
        }
    ], 
    "credit": [
        {
            "name": "CABM Structural Bioinformatics Laboratory", 
            "email": null, 
            "url": "http://www-nmr.cabm.rutgers.edu/about/contact.htm", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:46:03Z", 
    "lastUpdate": "2018-12-10T12:58:43Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}