{
    "accessibility": "Open access",
    "additionDate": "2022-09-28T18:59:00.768123Z",
    "biotoolsCURIE": "biotools:simelit",
    "biotoolsID": "simelit",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Gregory K. Schenter"
        },
        {
            "name": "Joon-Yong Lee",
            "orcidid": "https://orcid.org/0000-0002-5864-8518"
        },
        {
            "name": "Sandilya VB Garimella",
            "orcidid": "https://orcid.org/0000-0001-6649-9842"
        },
        {
            "name": "Yehia M. Ibrahim",
            "orcidid": "https://orcid.org/0000-0001-6085-193X"
        }
    ],
    "description": "A Novel GUI-Based Comprehensive Ion Trajectory Simulation Software for Mass Spectrometry.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/PNNL-Comp-Mass-Spec/SimELIT",
    "language": [
        "C",
        "C++"
    ],
    "lastUpdate": "2022-09-28T18:59:00.770866Z",
    "license": "BSD-2-Clause",
    "name": "SimELIT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/JASMS.1C00301",
            "metadata": {
                "abstract": "© 2022 Springer New York LLC. All rights reserved.Ion trajectory simulation in mass spectrometry systems from injection to detection is technically challenging but very important for better understanding the ion dynamics in instrument development. Here, we present SimELIT (Simulator of Eulerian and Lagrangian Ion Trajectories), a novel ion trajectory simulation platform. SimELIT is built upon a suite of multiphysics solvers compiled into OpenFOAM (an open-source numerical solver library particularly used for computational mechanics), with a simple web-based graphical user interface (GUI) allowing users to define the details of OpenFOAM cases and run simulations. SimELIT is a modular program and can provide extensions of physics (e.g., gas flows, electrodynamic fields) and thus enable ion trajectory simulations from the ion source to detector. The current version (SimELIT) provides two numerical solvers for ion trajectory simulations-(1) a Lagrangian particle tracker in vacuum and (2) a Eulerian ion density solver in background gas in the presence of electric fields. Here, we describe the architecture of SimELIT, including its use of Docker and the React Framework, and demonstrate the computation of ion trajectories of multiple m/z values in a static/linear voltage drop in vacuum (across a 1 m long flight tube). Further, the drift motion of ions under 1 Torr pressure conditions in a static background (N2) gas through a 20 V/cm static electric field is shown. The results produced from SimELIT were compared with SIMION and theoretical estimates. In addition, we report the computation of ion trajectories in electrodynamic fields within a planar FAIMS device operating at atmospheric pressure.",
                "authors": [
                    {
                        "name": "Chun J."
                    },
                    {
                        "name": "Garimella S.V.B."
                    },
                    {
                        "name": "Giberson C."
                    },
                    {
                        "name": "Huntley A.P."
                    },
                    {
                        "name": "Ibrahim Y.M."
                    },
                    {
                        "name": "Lee J.-Y."
                    },
                    {
                        "name": "Schenter G.K."
                    },
                    {
                        "name": "Singh R.K."
                    },
                    {
                        "name": "Zhong J."
                    }
                ],
                "date": "2022-08-03T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "SimELIT: A Novel GUI-Based Comprehensive Ion Trajectory Simulation Software for Mass Spectrometry"
            },
            "pmid": "35852821"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        }
    ]
}
