{
    "additionDate": "2017-01-13T13:14:51Z",
    "biotoolsCURIE": "biotools:genometools",
    "biotoolsID": "genometools",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "gordon@gremme.org",
            "name": "GenomeTools Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Free collection of bioinformatics tools for genome informatics.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://genometools.org/documentation.html"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "http://genometools.org/",
    "language": [
        "C"
    ],
    "lastUpdate": "2019-01-29T12:08:55Z",
    "license": "BSD-3-Clause",
    "maturity": "Mature",
    "name": "GenomeTools",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": "10.1109/TCBB.2013.68",
            "metadata": {
                "abstract": "Genome annotations are often published as plain text files describing genomic features and their subcomponents by an implicit annotation graph. In this paper, we present the GenomeTools, a convenient and efficient software library and associated software tools for developing bioinformatics software intended to create, process or convert annotation graphs. The GenomeTools strictly follow the annotation graph approach, offering a unified graph-based representation. This gives the developer intuitive and immediate access to genomic features and tools for their manipulation. To process large annotation sets with low memory overhead, we have designed and implemented an efficient pull-based approach for sequential processing of annotations. This allows to handle even the largest annotation sets, such as a complete catalogue of human variations. Our object-oriented C-based software library enables a developer to conveniently implement their own functionality on annotation graphs and to integrate it into larger workflows, simultaneously accessing compressed sequence data if required. The careful C implementation of the GenomeTools does not only ensure a light-weight memory footprint while allowing full sequential as well as random access to the annotation graph, but also facilitates the creation of bindings to a variety of script programming languages (like Python and Ruby) sharing the same interface. © 2004-2012 IEEE.",
                "authors": [
                    {
                        "name": "Gremme G."
                    },
                    {
                        "name": "Steinbiss S."
                    },
                    {
                        "name": "Kurtz S."
                    }
                ],
                "citationCount": 114,
                "date": "2013-11-25T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "Genome tools: A comprehensive software library for efficient processing of structured genome annotations"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}