{
    "accessibility": "Open access",
    "additionDate": "2022-12-29T19:16:01.854806Z",
    "biotoolsCURIE": "biotools:ipida-gcn",
    "biotoolsID": "ipida-gcn",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bliu@bliulab.net",
            "name": "Bin Liu",
            "orcidid": "https://orcid.org/0000-0002-8520-8374",
            "typeEntity": "Person"
        },
        {
            "name": "Hang Wei"
        },
        {
            "name": "Jialu Hou"
        }
    ],
    "description": "Identification of piRNA-disease associations based on Graph Convolutional Network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                }
            ]
        }
    ],
    "homepage": "http://bliulab.net/iPiDA-GCN/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-12-29T19:16:01.857590Z",
    "license": "Not licensed",
    "name": "iPiDA-GCN",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1010671",
            "metadata": {
                "abstract": "Copyright: © 2022 Hou et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Motivation Piwi-interacting RNAs (piRNAs) play a critical role in the progression of various diseases. Accurately identifying the associations between piRNAs and diseases is important for diagnosing and prognosticating diseases. Although some computational methods have been proposed to detect piRNA-disease associations, it is challenging for these methods to effectively capture nonlinear and complex relationships between piRNAs and diseases because of the limited training data and insufficient association representation. Results With the growth of piRNA-disease association data, it is possible to design a more complex machine learning method to solve this problem. In this study, we propose a computational method called iPiDA-GCN for piRNA-disease association identification based on graph convolutional networks (GCNs). The iPiDA-GCN predictor constructs the graphs based on piRNA sequence information, disease semantic information and known piRNA-disease associations. Two GCNs (Asso-GCN and Sim-GCN) are used to extract the features of both piRNAs and diseases by capturing the association patterns from piRNA-disease interaction network and two similarity networks. GCNs can capture complex network structure information from these networks, and learn discriminative features. Finally, the full connection networks and inner production are utilized as the output module to predict piRNA-disease association scores. Experimental results demonstrate that iPiDA-GCN achieves better performance than the other state-of-the-art methods, benefitted from the discriminative features extracted by Asso-GCN and Sim-GCN. The iPiDA-GCN predictor is able to detect new piRNA-disease associations to reveal the potential pathogenesis at the RNA level. The data and source code are available at http://bliulab.net/iPiDA-GCN/.",
                "authors": [
                    {
                        "name": "Hou J."
                    },
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Wei H."
                    }
                ],
                "date": "2022-10-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "iPiDA-GCN: Identification of piRNA-disease associations based on Graph Convolutional Network"
            },
            "pmcid": "PMC9662734",
            "pmid": "36301998"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Cardiology",
            "uri": "http://edamontology.org/topic_3335"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        }
    ]
}
