{
    "additionDate": "2017-12-18T00:10:24Z",
    "biotoolsCURIE": "biotools:pomo",
    "biotoolsID": "pomo",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://code.google.com/p/pomo/"
        }
    ],
    "description": "POMO (Plotting Omics-associations for Multiple Organisms) is a web application to integrate and visualize genomic feature relationships and annotations across a broad range of organisms – human, mouse, nematode, fly, yeast, zebra fish, e. coli, arabidopsis, rice and tomato.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://compbio.uta.fi/pomo/#"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://pomo.cs.tut.fi/",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2024-11-25T14:47:35.860789Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/pomo-20140613-plotting-omic-associations-for-multiple-organisms.html"
        }
    ],
    "name": "POMO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2164-14-918",
            "metadata": {
                "abstract": "Background: Systems biology experiments studying different topics and organisms produce thousands of data values across different types of genomic data. Further, data mining analyses are yielding ranked and heterogeneous results and association networks distributed over the entire genome. The visualization of these results is often difficult and standalone web tools allowing for custom inputs and dynamic filtering are limited.Results: We have developed POMO (http://pomo.cs.tut.fi), an interactive web-based application to visually explore omics data analysis results and associations in circular, network and grid views. The circular graph represents the chromosome lengths as perimeter segments, as a reference outer ring, such as cytoband for human. The inner arcs between nodes represent the uploaded network. Further, multiple annotation rings, for example depiction of gene copy number changes, can be uploaded as text files and represented as bar, histogram or heatmap rings. POMO has built-in references for human, mouse, nematode, fly, yeast, zebrafish, rice, tomato, Arabidopsis, and Escherichia coli. In addition, POMO provides custom options that allow integrated plotting of unsupported strains or closely related species associations, such as human and mouse orthologs or two yeast wild types, studied together within a single analysis. The web application also supports interactive label and weight filtering. Every iterative filtered result in POMO can be exported as image file and text file for sharing or direct future input.Conclusions: The POMO web application is a unique tool for omics data analysis, which can be used to visualize and filter the genome-wide networks in the context of chromosomal locations as well as multiple network layouts. With the several illustration and filtering options the tool supports the analysis and visualization of any heterogeneous omics data analysis association results for many organisms. POMO is freely available and does not require any installation or registration. © 2013 Lin et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Autio R."
                    },
                    {
                        "name": "Dudley A.M."
                    },
                    {
                        "name": "Kallio A."
                    },
                    {
                        "name": "Kreisberg R."
                    },
                    {
                        "name": "Lin J."
                    },
                    {
                        "name": "May P."
                    },
                    {
                        "name": "Nykter M."
                    },
                    {
                        "name": "Shmulevich I."
                    }
                ],
                "citationCount": 3,
                "date": "2013-12-24T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "POMO - Plotting Omics analysis results for Multiple Organisms"
            },
            "pmcid": "PMC3880012",
            "pmid": "24365393",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Omics",
            "uri": "http://edamontology.org/topic_3391"
        },
        {
            "term": "Organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1,
    "version": [
        "20140613"
    ]
}
