{"credit":[{"email":"pierre.peterlongo@inria.fr","name":"Pierre Peterlongo","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Sequence similarity search","uri":"http://edamontology.org/operation_0346"},{"term":"Optimisation and refinement","uri":"http://edamontology.org/operation_2425"},{"term":"Sequence feature detection","uri":"http://edamontology.org/operation_0253"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Suite"],"topic":[{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Bioinformatics","uri":"http://edamontology.org/topic_0091"},{"term":"Genomics","uri":"http://edamontology.org/topic_0622"}]},"publication":[{"abstract":"Background: With next-generation sequencing (NGS) technologies, the life sciences face a deluge of raw data. Classical analysis processes for such data often begin with an assembly step, needing large amounts of computing resources, and potentially removing or modifying parts of the biological information contained in the data. Our approach proposes to focus directly on biological questions, by considering raw unassembled NGS data, through a suite of six command-line tools. Findings: Dedicated to 'whole-genome assembly-free' treatments, the Colib'read tools suite uses optimized algorithms for various analyses of NGS datasets, such as variant calling or read set comparisons. Based on the use of a de Bruijn graph and bloom filter, such analyses can be performed in a few hours, using small amounts of memory. Applications using real data demonstrate the good accuracy of these tools compared to classical approaches. To facilitate data analysis and tools dissemination, we developed Galaxy tools and tool shed repositories. Conclusions: With the Colib'read Galaxy tools suite, we enable a broad range of life scientists to analyze raw NGS data. More importantly, our approach allows the maximum biological information to be retained in the data, and uses a very low memory footprint.","authors":["Le Bras Y.","Collin O.","Monjeaud C.","Lacroix V.","Rivals E.eric","Lemaitre C.","Miele V.","Sacomoto G.","Marchet C.","Cazaux B.","El Aabidine A.Z.","Salmela L.","Alves-Carvalho S.","Andrieux A.","Uricaru R.","Peterlongo P."],"cit_count":1,"doi":"10.1186/s13742-015-0105-2","journal":"GigaScience","title":"Colib'read on galaxy: A tools suite dedicated to biological information extraction from raw NGS reads","type":"Primary","year":"2016-01-01"}],"summary":{"biotoolsCURIE":"biotools:colib_read","biotoolsID":"colib_read","description":"A project and collection of tools for analyzing and comparing next generation sequencing data without the need to first assemble the genome.","homepage":"http://colibread.inria.fr/","name":"Colib read"}}