{
    "additionDate": "2018-06-04T19:37:02Z",
    "biotoolsCURIE": "biotools:mptp",
    "biotoolsID": "mptp",
    "credit": [
        {
            "email": "paschalia.kapli@h-its.org",
            "name": "Paschalia Kapli",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "tomas.flouri@h-its.org",
            "name": "Tomas Flouri",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "alexandros.stamatakis@h-its.org",
            "name": "Alexandros Stamatakis",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Multi-rate Poisson tree processes for single-locus species delimitation under maximum likelihood and Markov chain Monte Carlo.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Pas-Kapli/mptp"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Community profiling",
                    "uri": "http://edamontology.org/operation_3200"
                }
            ]
        }
    ],
    "homepage": "http://mptp.h-its.org/#/tree",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:59Z",
    "name": "mPTP",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx025",
            "metadata": {
                "abstract": "© The Author 2017. Motivation: In recent years, molecular species delimitation has become a routine approach for quantifying and classifying biodiversity. Barcoding methods are of particular importance in large-scale surveys as they promote fast species discovery and biodiversity estimates. Among those, distance-based methods are the most common choice as they scale well with large datasets; however, they are sensitive to similarity threshold parameters and they ignore evolutionary relationships. The recently introduced \"Poisson Tree Processes\" (PTP) method is a phylogeny-aware approach that does not rely on such thresholds. Yet, two weaknesses of PTP impact its accuracy and practicality when applied to large datasets; it does not account for divergent intraspecific variation and is slow for a large number of sequences. Results: We introduce the multi-rate PTP (mPTP), an improved method that alleviates the theoretical and technical shortcomings of PTP. It incorporates different levels of intraspecific genetic diversity deriving from differences in either the evolutionary history or sampling of each species. Results on empirical data suggest that mPTP is superior to PTP and popular distance-based methods as it, consistently yields more accurate delimitations with respect to the taxonomy (i.e., identifies more taxonomic species, infers species numbers closer to the taxonomy). Moreover, mPTP does not require any similarity threshold as input. The novel dynamic programming algorithm attains a speedup of at least five orders of magnitude compared to PTP, allowing it to delimit species in large (meta-) barcoding data. In addition, Markov Chain Monte Carlo sampling provides a comprehensive evaluation of the inferred delimitation in just a few seconds for millions of steps, independently of tree size.",
                "authors": [
                    {
                        "name": "Kapli P."
                    },
                    {
                        "name": "Lutteropp S."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Kobert K."
                    },
                    {
                        "name": "Pavlidis P."
                    },
                    {
                        "name": "Stamatakis A."
                    },
                    {
                        "name": "Flouri T."
                    }
                ],
                "citationCount": 54,
                "date": "2017-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Multi-rate Poisson tree processes for single-locus species delimitation under maximum likelihood and Markov chain Monte Carlo"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        }
    ],
    "validated": 1
}