{"credit":[{"email":"bart.deplancke@epfl.ch","name":"Bart Deplancke","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/DeplanckeLab/ASAP"}],"function":[{"operation":[{"term":"Sequence visualisation","uri":"http://edamontology.org/operation_0564"},{"term":"RNA-Seq analysis","uri":"http://edamontology.org/operation_3680"}]}],"labels":{"language":["R","Python"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Cell biology","uri":"http://edamontology.org/topic_2229"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"RNA-seq","uri":"http://edamontology.org/topic_3170"},{"term":"Data visualisation","uri":"http://edamontology.org/topic_0092"}]},"publication":[{"abstract":"Motivation Single-cell RNA-sequencing (scRNA-seq) allows whole transcriptome profiling of thousands of individual cells, enabling the molecular exploration of tissues at the cellular level. Such analytical capacity is of great interest to many research groups in the world, yet these groups often lack the expertise to handle complex scRNA-seq datasets. Results We developed a fully integrated, web-based platform aimed at the complete analysis of scRNA-seq data post genome alignment: From the parsing, filtering and normalization of the input count data files, to the visual representation of the data, identification of cell clusters, differentially expressed genes (including cluster-specific marker genes), and functional gene set enrichment. This Automated Single-cell Analysis Pipeline (ASAP) combines a wide range of commonly used algorithms with sophisticated visualization tools. Compared with existing scRNA-seq analysis platforms, researchers (including those lacking computational expertise) are able to interact with the data in a straightforward fashion and in real time. Furthermore, given the overlap between scRNA-seq and bulk RNA-seq analysis workflows, ASAP should conceptually be broadly applicable to any RNA-seq dataset. As a validation, we demonstrate how we can use ASAP to simply reproduce the results from a single-cell study of 91 mouse cells involving five distinct cell types.","authors":["Gardeux V.","David F.P.A.","Shajkofci A.","Schwalie P.C.","Deplancke B."],"cit_count":8,"doi":"10.1093/bioinformatics/btx337","journal":"Bioinformatics","title":"ASAP: A web-based platform for the analysis and interactive visualization of single-cell RNA-seq data","year":"2017-01-01"}],"summary":{"biotoolsCURIE":"biotools:asap_pipeline","biotoolsID":"asap_pipeline","description":"Automated Single-cell Analysis Pipeline.","homepage":"https://github.com/DeplanckeLab/ASAP","name":"ASAP"}}