{
    "additionDate": "2021-01-18T10:30:12Z",
    "biotoolsCURIE": "biotools:cipher-sc",
    "biotoolsID": "cipher-sc",
    "confidence_flag": "tool",
    "description": "CIPHER-SC is the latest version of CIPHER, is a complete end-to-end prediction algorithm based on a context-aware network including single-cell data. CIPHER-SC is able to perform Disease-Gene Association Inference Using Graph Convolution on a Context-Aware Network with Single-Cell Data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "http://github.com/YidingZhang117/CIPHER-SC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T18:27:35Z",
    "name": "CIPHER-SC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1109/TCBB.2020.3017547",
            "metadata": {
                "abstract": "IEEEInference of disease-gene associations helps unravel the pathogenesis of diseases and contributes to the treatment. Although many machine learning-based methods have been developed to predict causative genes, accurate association inference remains challenging. One major reason is the inaccurate feature selection and accumulation of error brought by commonly used multi-stage training architecture. In addition, the existing methods do not incorporate cell-type-specific information, thus fail to study gene functions at a higher resolution. Therefore, we introduce single-cell transcriptome data and construct a context-aware network to unbiasedly integrate all data sources. Then we develop a graph convolution-based approach named CIPHER-SC to realize a complete end-to-end learning architecture. Our approach outperforms four state-of-the-art approaches in five-fold cross-validations on three distinct test sets with the best AUC of 0.9501, demonstrating its stable ability either to predict the novel genes or to predict with genetic basis. The ablation study shows that our complete end-to-end design and unbiased data integration boost the performance from 0.8727 to 0.9443 in AUC. The addition of single-cell data further improves the prediction accuracy and makes our results be enriched for cell-type-specific genes. These results confirm the ability of CIPHER-SC to discover reliable disease genes. Our implementation is available at http://github.com/YidingZhang117/CIPHER-SC.",
                "authors": [
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Chen L."
                    },
                    {
                        "name": "Li S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-01T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "CIPHER-SC: Disease-Gene Association Inference Using Graph Convolution on a Context-Aware Network with Single-Cell Data"
            },
            "pmid": "32809944"
        }
    ],
    "topic": [
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}