{
    "additionDate": "2017-12-18T00:09:00Z",
    "biotoolsCURIE": "biotools:ms-deconv",
    "biotoolsID": "ms-deconv",
    "collectionID": [
        "Proteomics"
    ],
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://proteomics.ucsd.edu/"
        }
    ],
    "description": "MS-Deconv is a combinatorial algorithm for spectral deconvolution. The algorithm first generates a large set of candidate isotopomer envelopes for a spectrum, then represents the spectrum as a graph, and finally selects its highest scoring subset of envelopes as a heaviest path in the graph.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bix.ucsd.edu/projects/msdeconv/msdeconv_manual.html"
        }
    ],
    "editPermission": {
        "authors": [
            "proteomics.bio.tools"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deconvolution",
                    "uri": "http://edamontology.org/operation_3629"
                }
            ]
        }
    ],
    "homepage": "http://proteomics.ucsd.edu/software-tools/ms-deconv/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-03-26T08:25:13Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ms-deconv-0-8-0-7370-deconvolution-of-top-down-spectra.html"
        }
    ],
    "name": "MS-Deconv",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1074/mcp.M110.002766",
            "metadata": {
                "abstract": "Top-down proteomics studies intact proteins, enabling new opportunities for analyzing post-translational modifications. Because tandem mass spectra of intact proteins are very complex, spectral deconvolution (grouping peaks into isotopomer envelopes) is a key initial stage for their interpretation. In such spectra, isotopomer envelopes of different protein fragments span overlapping regions on the m/z axis and even share spectral peaks. This raises both pattern recognition and combinatorial challenges for spectral deconvolution. We present MS-Deconv, a combinatorial algorithm for spectral deconvolution. The algorithm first generates a large set of candidate isotopomer envelopes for a spectrum, then represents the spectrum as a graph, and finally selects its highest scoring subset of envelopes as a heaviest path in the graph. In contrast with other approaches, the algorithm scores sets of envelopes rather than individual envelopes. We demonstrate that MS-Deconv improves on Thrash and Xtract in the number of correctly recovered monoisotopic masses and speed. We applied MS-Deconv to a large set of top-down spectra from Yersinia rohdei (with a still unsequenced genome) and further matched them against the protein database of related and sequenced bacterium Yersinia enterocolitica. MS-Deconv is available at http://proteomics.ucsd.edu/Software.html. © 2010 by The American Society for Biochemistry and Molecular Biology, Inc.",
                "authors": [
                    {
                        "name": "Bafna V."
                    },
                    {
                        "name": "Dorrestein P.C."
                    },
                    {
                        "name": "Edwards N."
                    },
                    {
                        "name": "Inbar Y."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Pevzner P.A."
                    },
                    {
                        "name": "Souda P."
                    },
                    {
                        "name": "Whitelegge J.P."
                    },
                    {
                        "name": "Wynne C."
                    }
                ],
                "citationCount": 123,
                "date": "2010-12-01T00:00:00Z",
                "journal": "Molecular and Cellular Proteomics",
                "title": "Deconvolution and database search of complex tandem mass spectra of intact proteins: A combinatorial approach"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ],
    "validated": 1,
    "version": [
        "0.8.0.7370"
    ]
}
