
{
    "credit": [
        {
            "email": "mmizjpph66@163.com",
            "name": "BingYu Chen",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "mmizjpph668@163.com",
            "name": "Dongsheng Huang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://seqanswers.com/forums/showthread.php?t=23196"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Methylation analysis",
                    "uri": "http://edamontology.org/operation_3204"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "Perl"
        ],
        "license": "GPL-3.0",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Epigenetics",
                "uri": "http://edamontology.org/topic_3295"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 Wang et al. DNA methylation is a widespread epigenetic modification that plays an essential role in gene expression through transcriptional regulation and chromatin remodeling. The emergence of whole genome bisulfite sequencing (WGBS) represents an important milestone in the detection of DNA methylation. Characterization of differential methylated regions (DMRs) is fundamental as well for further functional analysis. In this study, we present swDMR (http://sourceforge.net/projects/swdmr/) for the comprehensive analysis of DMRs from whole genome methylation profiles by a sliding window approach. It is an integrated tool designed for WGBS data, which not only implements accessible statistical methods to perform hypothesis test adapted to two or more samples without replicates, but false discovery rate was also controlled by multiple test correction. Downstream analysis tools were also provided, including cluster, annotation and visualization modules. In summary, based on WGBS data, swDMR can produce abundant information of differential methylated regions. As a convenient and flexible tool, we believe swDMR will bring us closer to unveil the potential functional regions involved in epigenetic regulation. Copyright:",
            "authors": [
                "Wang Z.",
                "Li X.",
                "Jiang Y.",
                "Shao Q.",
                "Liu Q.",
                "Chen B.Y.",
                "Huang D."
            ],
            "cit_count": 15,
            "doi": "10.1371/journal.pone.0132866",
            "journal": "PLoS ONE",
            "title": "SwDMR: A sliding window approach to identify differentially methylated regions based on whole genome bisulfite sequencing",
            "type": "Primary",
            "year": "2015-07-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:swdmr",
        "biotoolsID": "swdmr",
        "description": "swDMR: a sliding window approach to identify differentially methylated regions based on bisulfite sequencing",
        "homepage": "http://code.google.com/p/swdmr/",
        "name": "SwDMR"
    }
}