{
    "additionDate": "2017-03-24T11:31:28Z",
    "biotoolsCURIE": "biotools:athamap",
    "biotoolsID": "athamap",
    "credit": [
        {
            "email": "k.romanov@tu-braunschweig.de",
            "name": "Artyom Romanov (Webmaster)",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "AthaMap is a genome-wide map of putative transcription factor binding sites in Arabidopsis thaliana",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.athamap.de/documentation.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Transcriptional regulatory element prediction",
                    "uri": "http://edamontology.org/operation_0438"
                }
            ]
        }
    ],
    "homepage": "http://www.athamap.de/",
    "lastUpdate": "2021-04-14T19:27:02.387835Z",
    "name": "AthaMap",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_006717"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Gene expression is controlled mainly by the binding of transcription factors to regulatory sequences. To generate a genomic map for regulatory sequences, the Arabidopsis thaliana genome was screened for putative transcription factor binding sites. Using publicly available data from the TRANSFAC database and from publications, alignment matrices for 23 transcription factors of 13 different factor families were used with the pattern search program Patser to determine the genomic positions of more than 2.4 × 106 putative binding sites. Due to the dense clustering of genes and the observation that regulatory sequences are not restricted to upstream regions, the prediction of binding sites was performed for the whole genome. The genomic positions and the underlying data were imported into the newly developed AthaMap database. This data can be accessed by positional information or the Arabidopsis Genome Initiative identification number. Putative binding sites are displayed in the defined region. Data on the matrices used and on the thresholds applied in these screens are given in the database. Considering the high density of sites it will be a valuable resource fo generating models on gene expression regulation. The data are available at http://www.athamap.de.",
                "authors": [
                    {
                        "name": "Ole Steffens N."
                    },
                    {
                        "name": "Galuschka C."
                    },
                    {
                        "name": "Schindler M."
                    },
                    {
                        "name": "Bulow L."
                    },
                    {
                        "name": "Hehl R."
                    }
                ],
                "citationCount": 94,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AthaMap: An online resource for in silico transcription factor binding sites in the Arabidopsis thaliana genome"
            },
            "pmid": "14681436"
        },
        {
            "metadata": {
                "abstract": "The AthaMap database generates a map of cis-regulatory elements for the Arabidopsis thaliana genome. AthaMap contains more than 7.4 × 106 putative binding sites for 36 transcription factors (TFs) from 16 different TF families. A newly implemented functionality allows the display of subsets of higher conserved transcription factor binding sites (TFBSs). Furthermore, a web tool was developed that permits a user-defined search for co-localizing cis-regulatory elements. The user can specify individually the level of conservation for each TFBS and a spacer range between them. This web tool was employed for the identification of co-localizing sites of known interacting TFs and TFs containing two DNA-binding domains. More than 1.8 × 105 combinatorial elements were annotated in the AthaMap database. These elements can also be used to identify more complex co-localizing elements consisting of up to four TFBSs. The AthaMap database and the connected web tools are a valuable resource for the analysis and the prediction of gene expression regulation at http://www.athamap.de. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Steffens N.O."
                    },
                    {
                        "name": "Galuschka C."
                    },
                    {
                        "name": "Schindler M."
                    },
                    {
                        "name": "Bulow L."
                    },
                    {
                        "name": "Hehl R."
                    }
                ],
                "citationCount": 33,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AthaMap web tools for database-assisted identification of combinatorial cis-regulatory elements and the display of highly conserved transcription factor binding sites in Arabidopsis thaliana"
            },
            "pmid": "15980498"
        },
        {
            "metadata": {
                "abstract": "The AthaMap database generates a map of cis-regulatory elements for the whole Arabidopsis thaliana genome. This database has been extended by new tools to identify common cis-regulatory elements in specific regions of user-provided gene sets. A resulting table displays all cis-regulatory elements annotated in AthaMap including positional information relative to the respective gene. Further tables show overviews with the number of individual transcription factor binding sites (TFBS) present and TFBS common to the whole set of genes. Over represented cis-elements are easily identified. These features were used to detect specific enrichment of drought-responsive elements in cold-induced genes. For identification of co-regulated genes, the output table of the colocalization function was extended to show the closest genes and their relative distances to the colocalizing TFBS. Gene sets determined by this function can be used for a co-regulation analysis in microarray gene expression databases such as Genevestigator or PathoPlant. Additional improvements of AthaMap include display of the gene structure in the sequence window and a significant data increase. AthaMap is freely available at http://www.athamap.de/. © 2007 Oxford University Press.",
                "authors": [
                    {
                        "name": "Galuschka C."
                    },
                    {
                        "name": "Schindler M."
                    },
                    {
                        "name": "Bulow L."
                    },
                    {
                        "name": "Hehl R."
                    }
                ],
                "citationCount": 38,
                "date": "2007-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AthaMap web tools for the analysis and identification of co-regulated genes"
            },
            "pmid": "17148485"
        },
        {
            "metadata": {
                "abstract": "The AthaMap database generates a map of predicted transcription factor binding sites (TFBS) for the whole Arabidopsis thaliana genome. AthaMap has now been extended to include data on post-transcriptional regulation. A total of 403 173 genomic positions of small RNAs have been mapped in the A. thaliana genome. These identify 5772 putative post-transcriptionally regulated target genes. AthaMap tools have been modified to improve the identification of common TFBS in co-regulated genes by subtracting post-transcriptionally regulated genes from such analyses. Furthermore, AthaMap was updated to the TAIR7 genome annotation, a graphic display of gene analysis results was implemented, and the TFBS data content was increased. AthaMap is freely available at http://www.athamap.de/. © 2008 The Author(s).",
                "authors": [
                    {
                        "name": "Bulow L."
                    },
                    {
                        "name": "Engelmann S."
                    },
                    {
                        "name": "Schindler M."
                    },
                    {
                        "name": "Hehl R."
                    }
                ],
                "citationCount": 41,
                "date": "2009-01-09T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "AthaMap, integrating transcriptional and post-transcriptional data"
            },
            "pmid": "18842622"
        },
        {
            "metadata": {
                "abstract": "The AthaMap database generates a map of potential transcription factor binding sites (TFBS) and small RNA target sites in the Arabidopsis thaliana genome. The database contains sites for 115 different transcription factors (TFs). TFBS were identified with positional weight matrices (PWMs) or with single binding sites. With the new web tool 'Gene Identification', it is possible to identify potential target genes for selected TFs. For these analyses, the user can define a region of interest of up to 6000bp in all annotated genes. For TFBS determined with PWMs, the search can be restricted to high-quality TFBS. The results are displayed in tables that identify the gene, position of the TFBS and, if applicable, individual score of the TFBS. In addition, data files can be downloaded that harbour positional information of TFBS of all TFs in a region between -2000 and +2000bp relative to the transcription or translation start site. Also, data content of AthaMap was increased and the database was updated to the TAIR8 genome release. Database URL: http://www.athamap.de/gene_ident.php.",
                "authors": [
                    {
                        "name": "Bulow L."
                    },
                    {
                        "name": "Brill Y."
                    },
                    {
                        "name": "Hehl R."
                    }
                ],
                "citationCount": 20,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "AthaMap-assisted transcription factor target gene identification in Arabidopsis thaliana."
            },
            "pmid": "21177332"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "DNA binding sites",
            "uri": "http://edamontology.org/topic_3125"
        }
    ],
    "validated": 1
}