{
    "additionDate": "2022-01-02T18:20:35.951456Z",
    "biotoolsCURIE": "biotools:wasp-rna",
    "biotoolsID": "wasp-rna",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "andreas.hoek@computational.bio.uni-giessen.de",
            "name": "Andreas Hoek",
            "orcidid": "https://orcid.org/0000-0002-0451-2519",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "WASP is a versatile, web-accessible single cell RNA-Seq processing platform designed for the management, analysis and interpretation of scRNA-seq high-throughput data. The software addresses all aspects from initial quality control, demultiplexing and reference alignment to downstream statistical evaluation. Furthermore, it provides an automated workflow suitable for both non-bioinformaticians as well as experts. The software is available via a web-based interface and supports deployment to local as well as cloud-based compute infrastructures.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://docs.google.com/document/d/1UR6Esw56TEfjdRmJ3T4yD4EQgzoRFDvRg9c9Ji4yMa8/edit"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Demultiplexing",
                    "uri": "http://edamontology.org/operation_3933"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                }
            ]
        }
    ],
    "homepage": "http://www.computational.bio/software/wasp",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2022-01-02T18:20:35.953965Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/andreashoek/wasp/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/andreashoek/wasp"
        }
    ],
    "name": "WASP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12864-021-07469-6",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The technology of single cell RNA sequencing (scRNA-seq) has gained massively in popularity as it allows unprecedented insights into cellular heterogeneity as well as identification and characterization of (sub-)cellular populations. Furthermore, scRNA-seq is almost ubiquitously applicable in medical and biological research. However, these new opportunities are accompanied by additional challenges for researchers regarding data analysis, as advanced technical expertise is required in using bioinformatic software. Results: Here we present WASP, a software for the processing of Drop-Seq-based scRNA-Seq data. Our software facilitates the initial processing of raw reads generated with the ddSEQ or 10x protocol and generates demultiplexed gene expression matrices including quality metrics. The processing pipeline is realized as a Snakemake workflow, while an R Shiny application is provided for interactive result visualization. WASP supports comprehensive analysis of gene expression matrices, including detection of differentially expressed genes, clustering of cellular populations and interactive graphical visualization of the results. The R Shiny application can be used with gene expression matrices generated by the WASP pipeline, as well as with externally provided data from other sources. Conclusions: With WASP we provide an intuitive and easy-to-use tool to process and explore scRNA-seq data. To the best of our knowledge, it is currently the only freely available software package that combines pre- and post-processing of ddSEQ- and 10x-based data. Due to its modular design, it is possible to use any gene expression matrix with WASP’s post-processing R Shiny application. To simplify usage, WASP is provided as a Docker container. Alternatively, pre-processing can be accomplished via Conda, and a standalone version for Windows is available for post-processing, requiring only a web browser.",
                "authors": [
                    {
                        "name": "Goesmann A."
                    },
                    {
                        "name": "Hain T."
                    },
                    {
                        "name": "Herold S."
                    },
                    {
                        "name": "Hoek A."
                    },
                    {
                        "name": "Maibach K."
                    },
                    {
                        "name": "Mengel J.P."
                    },
                    {
                        "name": "Ozmen E."
                    },
                    {
                        "name": "Vazquez-Armendariz A.I."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "WASP: a versatile, web-accessible single cell RNA-Seq processing platform"
            },
            "pmcid": "PMC7977290",
            "pmid": "33736596",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
