{
    "accessibility": "Open access",
    "additionDate": "2022-06-10T23:00:45.426996Z",
    "biotoolsCURIE": "biotools:sccorr",
    "biotoolsID": "sccorr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ke.xu@yale.edu",
            "name": "Ke Xu",
            "typeEntity": "Person"
        },
        {
            "name": "Bradley E. Aouizerat"
        },
        {
            "name": "Chunhua Yan"
        }
    ],
    "description": "An R package for A graph-based k-partitioning approach for single-cell analysis",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Expression correlation analysis",
                    "uri": "http://edamontology.org/operation_3463"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Weighted correlation network analysis",
                    "uri": "http://edamontology.org/operation_3766"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CBIIT-CGBB/scCorr",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-06-10T23:00:45.429405Z",
    "license": "Not licensed",
    "name": "scCorr",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12864-021-08235-4",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Gene expression is regulated by transcription factors, cofactors, and epigenetic mechanisms. Coexpressed genes indicate similar functional categories and gene networks. Detecting gene-gene coexpression is important for understanding the underlying mechanisms of cellular function and human diseases. A common practice of identifying coexpressed genes is to test the correlation of expression in a set of genes. In single-cell RNA-seq data, an important challenge is the abundance of zero values, so-called “dropout”, which results in biased estimation of gene-gene correlations for downstream analyses. In recent years, efforts have been made to recover coexpressed genes in scRNA-seq data. Here, our goal is to detect coexpressed gene pairs to reduce the “dropout” effect in scRNA-seq data using a novel graph-based k-partitioning method by merging transcriptomically similar cells. Results: We observed that the number of zero values was reduced among the merged transcriptomically similar cell clusters. Motivated by this observation, we leveraged a graph-based algorithm and develop an R package, scCorr, to recover the missing gene-gene correlation in scRNA-seq data that enables the reliable acquisition of cluster-based gene-gene correlations in three independent scRNA-seq datasets. The graphically partitioned cell clusters did not change the local cell community. For example, in scRNA-seq data from peripheral blood mononuclear cells (PBMCs), the gene-gene correlation estimated by scCorr outperformed the correlation estimated by the nonclustering method. Among 85 correlated gene pairs in a set of 100 clusters, scCorr detected 71 gene pairs, while the nonclustering method detected only 4 pairs of a dataset from PBMCs. The performance of scCorr was comparable to those of three previously published methods. As an example of downstream analysis using scCorr, we show that scCorr accurately identified a known cell type (i.e., CD4+ T cells) in PBMCs with a receiver operating characteristic area under the curve of 0.96. Conclusions: Our results demonstrate that scCorr is a robust and reliable graph-based method for identifying correlated gene pairs, which is fundamental to network construction, gene-gene interaction, and cellular omic analyses. scCorr can be quickly and easily implemented to minimize zero values in scRNA-seq analysis and is freely available at https://github.com/CBIIT-CGBB/scCorr.",
                "authors": [
                    {
                        "name": "Aouizerat B.E."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Xu H."
                    },
                    {
                        "name": "Xu K."
                    },
                    {
                        "name": "Yan C."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "A novel graph-based k-partitioning approach improves the detection of gene-gene correlations by single-cell RNA sequencing"
            },
            "pmcid": "PMC8740455",
            "pmid": "34996359"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
