{
    "name": "DISCOVER", 
    "description": "DISCOVER is a discriminative, conditional random field (CRF) based model used for supervised motif discovery on metazoan genomes.", 
    "homepage": "http://www.sailing.cs.cmu.edu/main/?page_id=387", 
    "biotoolsID": "discover", 
    "biotoolsCURIE": "biotools:discover", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_0238", 
                    "term": "Motif discovery"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/discover-model-factor-binding-site-discovery-metazoan-genomes.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp230", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "DISCOVER: A feature-based discriminative method for motif search in complex genomes", 
                "abstract": "Motivation: Identifying transcription factor binding sites (TFBSs) encoding complex regulatory signals in metazoan genomes remains a challenging problem in computational genomics. Due to degeneracy of nucleotide content among binding site instances or motifs, and intricate 'grammatical organization' of motifs within cis-regulatory modules (CRMs), extant pattern matching-based in silico motif search methods often suffer from impractically high false positive rates, especially in the context of analyzing large genomic datasets, and noisy position weight matrices which characterize binding sites. Here, we try to address this problem by using a framework to maximally utilize the information content of the genomic DNA in the region of query, taking cues from values of various biologically meaningful genetic and epigenetic factors in the query region such as clade-specific evolutionary parameters, presence/absence of nearby coding regions, etc. We present a new method for TFBS prediction in metazoan genomes that utilizes both the CRM architecture of sequences and a variety of features of individual motifs. Our proposed approach is based on a discriminative probabilistic model known as conditional random fields that explicitly optimizes the predictive probability of motif presence in large sequences, based on the joint effect of all such features. Results: This model overcomes weaknesses in earlier methods based on less effective statistical formalisms that are sensitive to spurious signals in the data. We evaluate our method on both simulated CRMs and real Drosophila sequences in comparison with a wide spectrum of existing models, and outperform the state of the art by 22% in F1 score. © 2009 The Author(s).", 
                "date": "2009-06-09T00:00:00Z", 
                "citationCount": 8, 
                "authors": [
                    {
                        "name": "Fu W."
                    }, 
                    {
                        "name": "Ray P."
                    }, 
                    {
                        "name": "Xing E.P."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://www.sailing.cs.cmu.edu/main/", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:05:35Z", 
    "lastUpdate": "2018-12-10T12:58:57Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}