{
    "additionDate": "2021-01-18T09:16:21Z",
    "biotoolsCURIE": "biotools:circrnaprofiler",
    "biotoolsID": "circrnaprofiler",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "s.aufiero@amsterdamumc.nl",
            "name": "Simona Aufiero",
            "orcidid": "https://orcid.org/0000-0003-0782-3985",
            "typeEntity": "Person"
        }
    ],
    "description": "circRNAprofiler is an R-based framework that only requires an R installation and offers 15 modules for a comprehensive in silico analysis of circRNAs. This computational framework allows to combine and analyze circRNAs previously detected by multiple publicly available annotation-based circRNA detection tools. It covers different aspects of circRNAs analysis from differential expression analysis, evolutionary conservation, biogenesis to functional analysis. The pipeline used by circRNAprofiler is highly automated and customizable. Furthermore, circRNAprofiler includes additional functions for data visualization which facilitate the interpretation of the results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "SNP annotation",
                    "uri": "http://edamontology.org/operation_3661"
                },
                {
                    "term": "miRNA expression analysis",
                    "uri": "http://edamontology.org/operation_3792"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Aufiero/circRNAprofiler",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-11T19:17:53Z",
    "name": "circRNAprofiler",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-3500-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Circular RNAs (circRNAs) are a newly appreciated class of non-coding RNA molecules. Numerous tools have been developed for the detection of circRNAs, however computational tools to perform downstream functional analysis of circRNAs are scarce. Results: We present circRNAprofiler, an R-based computational framework that runs after circRNAs have been identified. It allows to combine circRNAs detected by multiple publicly available annotation-based circRNA detection tools and to analyze their expression, genomic context, evolutionary conservation, biogenesis and putative functions. Conclusions: Overall, the circRNA analysis workflow implemented by circRNAprofiler is highly automated and customizable, and the results of the analyses can be used as starting point for further investigation in the role of specific circRNAs in any physiological or pathological condition.",
                "authors": [
                    {
                        "name": "Aufiero S."
                    },
                    {
                        "name": "Creemers E.E."
                    },
                    {
                        "name": "Pinto Y.M."
                    },
                    {
                        "name": "Reckman Y.J."
                    },
                    {
                        "name": "Tijsen A.J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-04-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CircRNAprofiler: An R-based computational framework for the downstream analysis of circular RNAs"
            },
            "pmcid": "PMC7191743",
            "pmid": "32349660"
        }
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
