
{
    "credit": [
        {
            "email": "bvoigh28@gmail.com",
            "name": "Benjamin F. Voight",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://coruscant.itmat.upenn.edu/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://py-merp.github.io/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Calculation",
                    "uri": "http://edamontology.org/operation_3438"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Public health and epidemiology",
                "uri": "http://edamontology.org/topic_3305"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/merp-0-01-mendelian-randomization-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Summary: We present a Mendelian randomization (MR) pipeline (MeRP) to facilitate rapid, causal inference analysis through automating key steps in developing and analyzing genetic instruments obtained from publicly available data. Our tool uses the National Human Genome Research Institute catalog of associations to generate instrumental variable trait files and provides methods for filtering of potential confounding associations as well as linkage disequilibrium. MeRP generates estimated causal effect scores via a MR-score analysis using summary data for disease endpoints typically found in the public domain. We utilize our pipeline to develop genetic instruments for seven traits and evaluate potential causal relationships with two disease endpoints, observing two putatively causal associations between blood pressure and bone-mineral density with type 2 diabetes. Our tool emphasizes the importance of careful but systematic screening of large datasets for discovery and systematic follow-up. Availability and implementation: MeRP is a free, open-source project and can be downloaded at http://github.com/py-merp/py-merp. Complete documentation can be found at http://py-merp.github.io. Requires Python 2.7, along with NumPy, SciPy.",
            "authors": [
                "Yin P.",
                "Voight B.F."
            ],
            "cit_count": 6,
            "journal": "Bioinformatics",
            "pmid": "25388149",
            "title": "MeRP: A high-throughput pipeline for Mendelian randomization analysis",
            "year": "2015-03-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:merp",
        "biotoolsID": "merp",
        "description": "Free, open-source tool designed to streamline and automate large-scale Mendelian Randomization analysis.",
        "homepage": "http://py-merp.github.io/",
        "name": "MeRP"
    }
}