{
    "additionDate": "2021-01-18T10:48:25Z",
    "biotoolsCURIE": "biotools:prehots",
    "biotoolsID": "prehots",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jhguan@tongji.edu.cn",
            "name": "Jihong Guan",
            "typeEntity": "Person"
        }
    ],
    "description": "Computationally identifying hot spots in protein-DNA binding interfaces using an ensemble approach.\n\nPrediction of Protein-DNA Binding Energy Hot Spots.\n\nPreHots, a computational method that can effectively identify hot spots on protein-DNA binding interfaces using an ensemble approach.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "DNA-binding protein prediction",
                    "uri": "http://edamontology.org/operation_3900"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Nucleic acids-binding site prediction",
                    "uri": "http://edamontology.org/operation_0420"
                }
            ]
        }
    ],
    "homepage": "https://dmb.tongji.edu.cn/tools/PreHots/",
    "lastUpdate": "2021-03-20T16:03:50Z",
    "name": "PreHots",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03675-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Protein-DNA interaction governs a large number of cellular processes, and it can be altered by a small fraction of interface residues, i.e., the so-called hot spots, which account for most of the interface binding free energy. Accurate prediction of hot spots is critical to understand the principle of protein-DNA interactions. There are already some computational methods that can accurately and efficiently predict a large number of hot residues. However, the insufficiency of experimentally validated hot-spot residues in protein-DNA complexes and the low diversity of the employed features limit the performance of existing methods. Results: Here, we report a new computational method for effectively predicting hot spots in protein-DNA binding interfaces. This method, called PreHots (the abbreviation of Predicting Hot spots), adopts an ensemble stacking classifier that integrates different machine learning classifiers to generate a robust model with 19 features selected by a sequential backward feature selection algorithm. To this end, we constructed two new and reliable datasets (one benchmark for model training and one independent dataset for validation), which totally consist of 123 hot spots and 137 non-hot spots from 89 protein-DNA complexes. The data were manually collected from the literature and existing databases with a strict process of redundancy removal. Our method achieves a sensitivity of 0.813 and an AUC score of 0.868 in 10-fold cross-validation on the benchmark dataset, and a sensitivity of 0.818 and an AUC score of 0.820 on the independent test dataset. The results show that our approach outperforms the existing ones. Conclusions: PreHots, which is based on stack ensemble of boosting algorithms, can reliably predict hot spots at the protein-DNA binding interface on a large scale. Compared with the existing methods, PreHots can achieve better prediction performance. Both the webserver of PreHots and the datasets are freely available at: http://dmb.tongji.edu.cn/tools/PreHots/.",
                "authors": [
                    {
                        "name": "Pan Y."
                    },
                    {
                        "name": "Zhou S."
                    },
                    {
                        "name": "Guan J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-09-17T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Computationally identifying hot spots in protein-DNA binding interfaces using an ensemble approach"
            },
            "pmcid": "PMC7495898",
            "pmid": "32938375"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        }
    ]
}