{
    "accessibility": "Open access",
    "additionDate": "2022-05-08T14:02:25.411476Z",
    "biotoolsCURIE": "biotools:gfdx",
    "biotoolsID": "gfdx",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "htong4@jhu.edu",
            "name": "Hanzhi Tong",
            "typeEntity": "Person"
        },
        {
            "name": "Neff Walker"
        }
    ],
    "description": "An analysis and visualization tool for data on food fortification",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://fortificationdata.org",
    "lastUpdate": "2022-05-08T14:02:25.414167Z",
    "name": "GFDx",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.7189/JOGH.11.18002",
            "metadata": {
                "abstract": "Copyright © 2021 by the Journal of Global Health. All rights reserved.Background: Food fortification can be an effective intervention to improve maternal and child health. Folic acid fortification can reduce neural tube defects due to folate deficiency. Iron fortification is effective to reduce maternal anemia due to iron deficiency. The paper describes the methods for estimating current coverage levels for iron fortification and folic acid fortification and estimates current impact of fortification in low- and middle-income countries (LMICs) using the Lives Saved Tool (LiST). Methods: The database was obtained from Global Fortification Data Exchange. We used the following indicators from the database: food intake, fortification standard, percent of food produced in industrial mills, and percent of industrially milled food that is fortified. Together with the recommended dietary allowances for women of reproductive age (WRA), we calculated percentage of WRA getting recommended intake through fortification and used the percentage as an estimate for fortification coverage. We then used LiST to estimate the health impact of fortification on maternal and child health. Results: Folic acid was fortified in 72 countries, with a median coverage of 43%. Iron was fortified in 87 countries, with a median coverage of 23%. Forty-six LMICs fortified either folic acid, iron, or both. And the weighted coverage of folic acid fortification and iron fortification were 34% and 19%, respectively. A greater percentage of WRA got appropriate levels of folic acid and iron via fortification in higher income countries. Based on LiST projection, it is estimated that in 2021, over 4 million anemia cases among WRA will be averted due to consumption of iron fortified food. About 1900 stillbirths and 3000 neonatal deaths due to neural tube defects will be averted due to consumption of folic acid fortified food. Conclusions: We estimated the coverage of folic acid fortification and iron fortification in LMICs and included them in the most recent version of LiST. Trends in coverage will be included in LiST as data become available. Our analysis shows that while most LMICs have fortification programs, currently the effects of these programs are limited either through low levels of fortification in industrialized food, low consumption of fortified food or both.",
                "authors": [
                    {
                        "name": "Tong H."
                    },
                    {
                        "name": "Walker N."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of global health",
                "title": "Current levels of coverage of iron and folic acid fortification are insufficient to meet the recommended intake for women of reproductive age in low- and middle-income countries"
            },
            "pmcid": "PMC8501472",
            "pmid": "34671465"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        }
    ]
}
