{
    "additionDate": "2021-01-18T07:56:39Z",
    "biotoolsCURIE": "biotools:rf-pseu",
    "biotoolsID": "rf-pseu",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zhangjun13902003@163.com",
            "name": "Jun Zhang",
            "typeEntity": "Person"
        },
        {
            "email": "zouquan@nclab.net",
            "name": "Quan Zou",
            "typeEntity": "Person"
        }
    ],
    "description": "A Random Forest Predictor for RNA Pseudouridine Sites.\n\nOne of the ubiquitous chemical modifications in RNA, pseudouridine modification is crucial for various cellular biological and physiological processes. To gain more insight into the functional mechanisms involved, it is of fundamental importance to precisely identify pseudouridine sites in RNA. Several useful machine learning approaches have become available recently, with the increasing progress of next-generation sequencing technology; however, existing methods cannot predict sites with high accuracy. Thus, a more accurate predictor is required. In this study, a random forest-based predictor named RF-PseU is proposed for prediction of pseudouridylation sites. To optimize feature representation and obtain a better model, the light gradient boosting machine algorithm and incremental feature selection strategy were used to select the optimum feature space vector for training the random forest model RF-PseU",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Recombination detection",
                    "uri": "http://edamontology.org/operation_0451"
                },
                {
                    "term": "Indel detection",
                    "uri": "http://edamontology.org/operation_0452"
                }
            ]
        }
    ],
    "homepage": "http://rfpsu.aibiochem.net/",
    "lastUpdate": "2021-03-20T16:34:17Z",
    "name": "RF-PseU",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FBIOE.2020.00134",
            "metadata": {
                "abstract": "© Copyright © 2020 Lv, Zhang, Ding and Zou.One of the ubiquitous chemical modifications in RNA, pseudouridine modification is crucial for various cellular biological and physiological processes. To gain more insight into the functional mechanisms involved, it is of fundamental importance to precisely identify pseudouridine sites in RNA. Several useful machine learning approaches have become available recently, with the increasing progress of next-generation sequencing technology; however, existing methods cannot predict sites with high accuracy. Thus, a more accurate predictor is required. In this study, a random forest-based predictor named RF-PseU is proposed for prediction of pseudouridylation sites. To optimize feature representation and obtain a better model, the light gradient boosting machine algorithm and incremental feature selection strategy were used to select the optimum feature space vector for training the random forest model RF-PseU. Compared with previous state-of-the-art predictors, the results on the same benchmark data sets of three species demonstrate that RF-PseU performs better overall. The integrated average leave-one-out cross-validation and independent testing accuracy scores were 71.4% and 74.7%, respectively, representing increments of 3.63% and 4.77% versus the best existing predictor. Moreover, the final RF-PseU model for prediction was built on leave-one-out cross-validation and provides a reliable and robust tool for identifying pseudouridine sites. A web server with a user-friendly interface is accessible at http://148.70.81.170:10228/rfpseu.",
                "authors": [
                    {
                        "name": "Lv Z."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Ding H."
                    },
                    {
                        "name": "Zou Q."
                    }
                ],
                "citationCount": 25,
                "date": "2020-02-26T00:00:00Z",
                "journal": "Frontiers in Bioengineering and Biotechnology",
                "title": "RF-PseU: A Random Forest Predictor for RNA Pseudouridine Sites"
            },
            "pmcid": "PMC7054385",
            "pmid": "32175316"
        }
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}