{
    "additionDate": "2021-01-20T11:03:19Z",
    "biotoolsCURIE": "biotools:lipoddx",
    "biotoolsID": "lipoddx",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "david.araujo@usc.es",
            "name": "David Araújo-Vilar",
            "orcidid": "https://orcid.org/0000-0003-2852-7851",
            "typeEntity": "Person"
        }
    ],
    "description": "A mobile application for identification of rare lipodystrophy syndromes.\n\nLIPO-DDx® is a mobile app based on a personal algorithm developed by Prof. David Araújo-Vilar. With the support of the University of Santiago de Compostela, the Galician Health Service (SERGAS) and AELIP (International Association of Relatives and People with Lipodystrophy).",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "https://www.uetem.com/lipoddx/",
    "lastUpdate": "2021-05-17T07:42:38Z",
    "name": "LipoDDx",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13023-020-01364-1",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Lipodystrophy syndromes are a group of disorders characterized by a loss of adipose tissue once other situations of nutritional deprivation or exacerbated catabolism have been ruled out. With the exception of the HIV-associated lipodystrophy, they have a very low prevalence, which together with their large phenotypic heterogeneity makes their identification difficult, even for endocrinologists and pediatricians. This leads to significant delays in diagnosis or even to misdiagnosis. Our group has developed an algorithm that identifies the more than 40 rare lipodystrophy subtypes described to date. This algorithm has been implemented in a free mobile application, LipoDDx®. Our aim was to establish the effectiveness of LipoDDx®. Forty clinical records of patients with a diagnosis of certainty of most lipodystrophy subtypes were analyzed, including subjects without lipodystrophy. The medical records, blinded for diagnosis, were evaluated by 13 physicians, 1 biochemist and 1 dentist. Each evaluator first gave his/her results based on his/her own criteria. Then, a second diagnosis was given using LipoDDx®. The results were analysed based on a score table according to the complexity of each case and the prevalence of the disease. Results: LipoDDx® provides a user-friendly environment, based on usually dichotomous questions or choice of clinical signs from drop-down menus. The final result provided by this app for a particular case can be a low/high probability of suffering a particular lipodystrophy subtype. Without using LipoDDx® the success rate was 17 ± 20%, while with LipoDDx® the success rate was 79 ± 20% (p < 0.01). Conclusions: LipoDDx® is a free app that enables the identification of subtypes of rare lipodystrophies, which in this small cohort has around 80% effectiveness, which will be of help to doctors who are not experts in this field. However, it will be necessary to analyze more cases in order to obtain a more accurate efficiency value.",
                "authors": [
                    {
                        "name": "Antela A."
                    },
                    {
                        "name": "Araujo-Vilar D."
                    },
                    {
                        "name": "Canton A."
                    },
                    {
                        "name": "Diaz-Ortega C."
                    },
                    {
                        "name": "Fernandez-Pombo A."
                    },
                    {
                        "name": "Gonzalez-Mendez B."
                    },
                    {
                        "name": "Hermida-Ameijeiras A."
                    },
                    {
                        "name": "Losada E."
                    },
                    {
                        "name": "Martinez-Olmos M.A."
                    },
                    {
                        "name": "Martinez-Rey C."
                    },
                    {
                        "name": "Muy-Perez A.E."
                    },
                    {
                        "name": "Rodriguez-Carnero G."
                    },
                    {
                        "name": "Sanchez-Iglesias S."
                    },
                    {
                        "name": "Santamaria-Nieto A."
                    },
                    {
                        "name": "Villar-Taibo R."
                    }
                ],
                "date": "2020-04-02T00:00:00Z",
                "journal": "Orphanet Journal of Rare Diseases",
                "title": "LipoDDx: A mobile application for identification of rare lipodystrophy syndromes"
            },
            "pmcid": "PMC7118879",
            "pmid": "32241282"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        },
        {
            "term": "Nutritional science",
            "uri": "http://edamontology.org/topic_3390"
        },
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        }
    ]
}
