{
    "additionDate": "2020-01-09T18:20:44Z",
    "biotoolsCURIE": "biotools:EURO-FIGS",
    "biotoolsID": "EURO-FIGS",
    "confidence_flag": "low",
    "description": "preliminary results from the IHU-IRCAD-EAES EURO-FIGS registry.\n\nLogin – European Fluorescence Imaging Guided Surgery.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'Fluorescence-based cholangiography', 'METHODS:EURO-FIGS', 'ICG dose timing NIRF-C', 'NIRF-C'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Anonymisation",
                    "uri": "http://edamontology.org/operation_3283"
                }
            ]
        }
    ],
    "homepage": "http://www.euro-figs.eu",
    "lastUpdate": "2020-01-09T18:20:44Z",
    "name": "EURO-FIGS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S00464-019-07157-3",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature.Introduction: Near-infrared fluorescence cholangiography (NIRF-C) is a popular application of fluorescence image-guided surgery (FIGS). NIRF-C requires near-infrared optimized laparoscopes and the injection of a fluorophore, most frequently Indocyanine Green (ICG), to highlight the biliary anatomy. It is investigated as a tool to increase safety during cholecystectomy. The European registry on FIGS (EURO-FIGS: www.euro-figs.eu) aims to obtain a snapshot of the current practices of FIGS across Europe. Data on NIRF-C are presented. Methods: EURO-FIGS is a secured online database which collects anonymized data on surgical procedures performed using FIGS. Data collected for NIRF-C include gender, age, Body Mass Index (BMI), pathology, NIR device, ICG dose, ICG timing of administration before intraoperative visualization, visualization (Y/N) of biliary structures such as the cystic duct (CD), the common bile duct (CBD), the CD-CBD junction, the common hepatic duct (CHD), Visualization scores, adverse reactions to ICG, operative time, and surgical complications. Results: Fifteen surgeons (12 European surgical centers) uploaded 314 cases of NIRF-C during cholecystectomy (cholelithiasis n = 249, cholecystitis n = 58, polyps n = 7), using 4 different NIR devices. ICG doses (mg/kg) varied largely (mean 0.28 ± 0.17, median 0.3, range: 0.02–0.62). Similarly, injection-to-visualization timing (minutes) varied largely (mean 217 ± 357; median 57), ranging from 1 min (direct intragallbladder injection in 2 cases) to 3120 min (n = 2 cases). Visualization scores before dissection were significantly correlated, at univariate analysis, with ICG timing (all structures), ICG dose (CD-CBD), device (CD and CD-CBD), surgeon (CD and CD-CBD), and pathology (CD and CD-CBD). BMI was not correlated. At multivariate analysis, pathology and timing remained significant factors affecting the visualization scores of all three structures, whereas ICG dose remained correlated with HD visualization only. Conclusions: The EURO-FIGS registry has confirmed a wide disparity in ICG dose and timing in NIRF-C. EURO-FIGS can represent a valuable tool to promote and monitor FIGS-related educational and consensus activities in Europe.",
                "authors": [
                    {
                        "name": "Agnus V."
                    },
                    {
                        "name": "Pesce A."
                    },
                    {
                        "name": "Boni L."
                    },
                    {
                        "name": "Van Den Bos J."
                    },
                    {
                        "name": "Morales-Conde S."
                    },
                    {
                        "name": "Paganini A.M."
                    },
                    {
                        "name": "Quaresima S."
                    },
                    {
                        "name": "Balla A."
                    },
                    {
                        "name": "La Greca G."
                    },
                    {
                        "name": "Plaudis H."
                    },
                    {
                        "name": "Moretto G."
                    },
                    {
                        "name": "Castagnola M."
                    },
                    {
                        "name": "Santi C."
                    },
                    {
                        "name": "Casali L."
                    },
                    {
                        "name": "Tartamella L."
                    },
                    {
                        "name": "Saadi A."
                    },
                    {
                        "name": "Picchetto A."
                    },
                    {
                        "name": "Arezzo A."
                    },
                    {
                        "name": "Marescaux J."
                    },
                    {
                        "name": "Diana M."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Surgical Endoscopy",
                "title": "Fluorescence-based cholangiography: preliminary results from the IHU-IRCAD-EAES EURO-FIGS registry"
            },
            "pmid": "31591654"
        }
    ],
    "topic": [
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Hepatic and biliary medicine",
            "uri": "http://edamontology.org/topic_3412"
        },
        {
            "term": "Anatomy",
            "uri": "http://edamontology.org/topic_3067"
        }
    ]
}