{
    "additionDate": "2022-01-17T08:21:35.599710Z",
    "biotoolsCURIE": "biotools:lpdr",
    "biotoolsID": "lpdr",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "abrower@acmg.net",
            "name": "Amy Brower",
            "orcidid": "https://orcid.org/0000-0001-6621-1247",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The Longitudinal Pediatric Data Resource (LPDR) is used for facilitating longitudinal collection of health information to inform clinical care and guide newborn screening efforts.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://nbstrn.org/tools/lpdr",
    "lastUpdate": "2022-01-17T08:21:35.602173Z",
    "name": "LPDR",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3390/IJNS7030037",
            "metadata": {
                "abstract": "© 2021 by the authors. Licensee MDPI, Basel, Switzerland.The goal of newborn screening is to improve health outcomes by identifying and treating affected newborns. This manuscript provides an overview of a data tool to facilitate the longitudinal collection of health information on newborns diagnosed with a condition through NBS. The Newborn Screening Translational Research Network (NBSTRN) developed the Longitudinal Pediatric Data Resource (LPDR) to capture, store, analyze, visualize, and share genomic and phenotypic data over the lifespan of NBS identified newborns to facilitate understanding of genetic disease and to assess the impact of early identification and treatment. NBSTRN developed a consensus-based process using clinical care experts to create, maintain, and evolve question and answer sets organized into common data elements (CDEs). The LPDR contains 24,172 core and disease specific CDEs for 118 rare genetic diseases, and the CDEs are being made available through the NIH CDE Repository. The number of CDEs for each condition average of 2200 with a range from 69 to 7944. The LPDR is used by state NBS programs, clinical researchers, and community-based organizations. Case level, de-identified data sets are available for secondary research and data mining. The development of the LPDR for longitudinal data gathering, sharing, and analysis supports research and facilitates the translation of discoveries into clinical practice.",
                "authors": [
                    {
                        "name": "Brower A."
                    },
                    {
                        "name": "Chan K."
                    },
                    {
                        "name": "Hartnett M."
                    },
                    {
                        "name": "Taylor J."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "International Journal of Neonatal Screening",
                "title": "The longitudinal pediatric data resource: Facilitating longitudinal collection of health information to inform clinical care and guide newborn screening efforts"
            },
            "pmcid": "PMC8293037",
            "pmid": "34208910",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Paediatrics",
            "uri": "http://edamontology.org/topic_3418"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}
