{
    "additionDate": "2021-11-29T08:18:56.486016Z",
    "biotoolsCURIE": "biotools:pykrev",
    "biotoolsID": "pykrev",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "nicholle.bell@ed.ac.uk",
            "name": "Nicholle G. A. Bell",
            "orcidid": "https://orcid.org/0000-0001-7887-2659",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "PyKrev is a Python library for the analysis of complex mixture FT-MS data. PyKrev is a comprehensive suite of tools for analysis and visualization of FT-MS data after formula assignment has been performed. These comprise formula manipulation and calculation of chemical properties, intersection analysis between multiple lists of formulas, calculation of chemical diversity, assignment of compound classes to formulas, multivariate analysis, and a variety of visualization tools producing van Krevelen diagrams, class histograms, PCA score, and loading plots, biplots, scree plots, and UpSet plots. The library is showcased through analysis of hot water green tea extracts and Scotch whisky FT-ion cyclotron resonance-MS data sets. PyKrev addresses the lack of a single, cohesive toolset for researchers to perform FT-MS analysis in the Python programming environment encompassing the most recent data analysis techniques used in the field.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Box-Whisker plot plotting",
                    "uri": "http://edamontology.org/operation_2943"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Kzra/pykrev",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-11-29T08:18:56.488589Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/Kzra/pykrev/issues"
        }
    ],
    "name": "PyKrev",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1021/JASMS.1C00064",
            "metadata": {
                "abstract": "© 2021 American Society for Mass Spectrometry. Published by American Chemical Society. All rights reserved.In this paper, we present PyKrev, a Python library for the analysis of complex mixture Fourier transform mass spectrometry (FT-MS) data. PyKrev is a comprehensive suite of tools for analysis and visualization of FT-MS data after formula assignment has been performed. These comprise formula manipulation and calculation of chemical properties, intersection analysis between multiple lists of formulas, calculation of chemical diversity, assignment of compound classes to formulas, multivariate analysis, and a variety of visualization tools producing van Krevelen diagrams, class histograms, PCA score, and loading plots, biplots, scree plots, and UpSet plots. The library is showcased through analysis of hot water green tea extracts and Scotch whisky FT-ion cyclotron resonance-MS data sets. PyKrev addresses the lack of a single, cohesive toolset for researchers to perform FT-MS analysis in the Python programming environment encompassing the most recent data analysis techniques used in the field.",
                "authors": [
                    {
                        "name": "Kitson E."
                    },
                    {
                        "name": "Kew W."
                    },
                    {
                        "name": "Ding W."
                    },
                    {
                        "name": "Bell N.G.A."
                    }
                ],
                "date": "2021-05-05T00:00:00Z",
                "journal": "Journal of the American Society for Mass Spectrometry",
                "title": "PyKrev: A Python Library for the Analysis of Complex Mixture FT-MS Data"
            },
            "pmid": "33904714",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Suite"
    ],
    "topic": [
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        }
    ]
}